{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7549895/Psychologist-reveals-lose-weight-WITHOUT-dieting-simply-learning-recognise-hunger.html", "downloaded_at": "2019-10-09 12:10:12.135345+00:00", "title": "Psychologist reveals how to lose weight WITHOUT dieting by simply learning to recognise your hunger", "language": "en", "text": "A weight loss psychologist has created an appetite pendulum - which can help you to recognise how much food your body actually needs, in order to lose weight without dieting.\n\nDr Helen McCarthy, based in Bristol, told Femail that we've all been trained to eat at certain times, rather than when we're hungry and we overeat when we don't need to.\n\nThe author, reveals in her new book How To Retrain Your Appetite, that the appetite pendulum starts at 0 when your hunger is neutral and swings into minus when you're hungry and plus when you start to eat.\n\nShe believes that you shouldn't start eating until your hunger gets to minus 3, which signifies when you're 'definitely hungry' and you should stop when you are 'just full' at plus 3.\n\nIn her book she reveals that by eating according to hunger and recognising when we're full, will prevent overeating, and allow you to enjoy any food you fancy without gaining weight - even if it's a piece of cake.\n\nA weight loss psychologist says that we can use our hunger to change our eating habits and help us lose weight\n\nDon't fear hunger\n\nThe former NHS psychologist, with an Oxford doctorate in Psychology, says we shouldn't fear mild hunger - and five minutes of it can be essential for a healthy diet.\n\nThe author says: 'Many of us eat too much either because we're enjoying the food and don't want to stop, or we're eating mindlessly.'\n\n'The Appetite Pendulum essentially teaches people to stop eating when they're just full, which is crucial for healthy eating.'\n\nHelen, who encourages clients not to give up any of the foods they love and whose approach involves eating your own meal plans – not those dictated by a diet, says it combines years of research with the trend for mindful eating.\n\nDr Helen McCarthy (pictured) based in Bristol, believes that we have all been trained to eat at certain times, rather than when we're hungry and we also overeat when we don't need to\n\n'The Japanese have a principle of eating only until you're 80 per cent,' she said. [According to the proverb: 'Eight parts of a full stomach sustain the man; the other two sustain the doctor.']\n\n'That's similar to stopping at +3 (just full.) It's a feeling of definite satisfaction, but not what we traditionally think of as a full sensation. That's what needs to be re-evaluated if we're ever to find a happy and healthy weight.'\n\nHow To Retrain Your Appetite details how you can retrain how you see hunger\n\nThe author, who even lost a stone and half this way, says her Appetite Pendulum could be especially helpful for people who regularly eat overly large meals, or have a dessert even though they're full.\n\n'If your portion sizes are too big, regularly, you're constantly putting more food into your body than it can use,' she says.\n\n'Whatever that food is, healthy or not, excess food will be converted into fat.'\n\nHow hungry are you?\n\nThe weight loss psychologist, who is also training other professionals in this way of thinking, says hunger signs aren't a bad thing.\n\n'Mild hunger in the hour or so before your next meal or snack is healthy.\n\n'When you never feel mild hunger, your body may have been continuously digesting food, with no chance to stop and rest.\n\n'Understanding and respecting mild hunger lets your gut work in the way that it evolved.\n\nShe goes on to say: 'The hunger message to the brain is our body's inbuilt natural way of letting us know we've used up the energy from our last meal, and that we're having to switch over to using our stored energy, i.e. fat, so the hunger signals are switched off.'\n\n'We can go a whole day, or month or lifetime, without actually getting hungry - and it's one of the biggest reasons we put on weight.'\n\nStop dieting and lose weight\n\nHelen says that most diets make people change their food habits dramatically - that's why we end up failing. Instead she said you should plan what you eat based on how long it will be until your next meal or snack.\n\n'If there's going to be just a couple of hours until you next eat, choosing something that will be quickly digested, raw fruit or veg or a piece of toast for example, will allow you to get hungry sooner.\n\n'If it's several hours, go for foods with protein, fibre and fat to keep you going. Like scrambled egg or boil-in-the-bag kipper or yoghurt with fruit, nuts and seeds for breakfast if it's going to be a long time until lunch.'\n\nIf you are eating just enough, and only letting you appetite pendulum swing to +3, which is 'just full' - it will allow you to be hungry for your next meal.\n\nThe rewards, says Helen, will be that by cutting down on the amount you eat overall, you will see the pounds fall, and food will taste better than ever.\n\nIn fact Helen has lost weight using this exact plan: 'I was in a sedentary job and realised I needed a way to lose weight without dieting. I started to look at the psychological aspects of eating and how we can listen to our bodies more.'\n\nMyths and facts around hunger Myth: It's bad to go to bed hungry Truth: Overnight fasting is a positively good thing for health and wellbeing. It's the basis of the 16:8 approach to eating, where you eat just within an eight-hour window during the day, and leave 16 hours between dinner and breakfast. But be sensible about what works for you - trial and error - perhaps it's a milky drink before bed. Myth: I'd better eat now, in case I get hungry later Truth: This is something I call insurance policy eating. You're eating more than your body needs now, to head off what might happen later. The key is to discover that you don't need to panic about possibly feeling a bit hungry in a meeting or over coffee, for example. If you do start to get hungry, and don't eat immediately, your body will burn a bit of stored fat. When it's done that, the hunger signals will switch off. Myth: I need lots of afternoon snacks Truth: Late in the afternoon can be witching hour for hunger. Alter what you eat at lunch to keep you going so you are definitely (but not overly) hungry by the time dinner's ready. Or introduce a small and delicious snack mid-afternoon (half a chocolate brownie if that's your favourite.) Myth: It's easy to tell when you're full-up Truth: Possibly not. We have 2 types of fullness signals – fast signals that tell us how much we've eaten, and slow signals about what nutrients we've eaten. When you develop awareness of the fast neuronal signals, you can gauge what amount you need to keep you going until your next meal. Because the same volume of porridge stretches your stomach to the same degree as that volume of green beans or ice cream or sausages, you can work out what to eat based on how long it will be until your next meal. If it's going to be several hours you may need something with more fibre, protein and/or fat, whilst if it's not so long a portion of your favourite vegetables might be what you need.\n\nFood will taste better\n\nHelen's new book also reveals that we often turn to sugary, salty and fatty foods because they've been developed to have 'hyper-palatable' tastes: 'This means they have lots of taste even when we're not hungry.\n\n'If you're not hungry and you eat a cherry tomato, you'll feel the texture but very little taste. Eat that same cherry tomato on an empty stomach, the taste will zing.\n\n'When you're hungry, your sense of taste is at its most sensitive,' says Helen. As the ancient Greeks used to say, 'Hunger is the best seasoning'.\n\n'You may find that foods with lots of additives start to lose their appeal - you might notice the more 'chemical' taste when you're actually feeling hungry.\n\n'And a fabulous discovery many of my clients make is that really simple foods that were only on their plate because they are 'healthy', like broccoli, now taste out of this world.\n\n'It's also a great way to discover new foods and food combinations. For me, it was toasted seeds and roasted cauliflower.\n\n'Prepare to be completely blown away by how great food tastes.'\n\nHow to Retrain Your Appetite is out now on Pavilion Books.", "description": "EXCLUSIVE: Dr Helen McCarthy, based in Bristol, believes that we have all been trained to eat at certain times, rather than when we're hungry and we also overeat when we don't need to.", "authors": ["Sarah Finley For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/10/19484378-0-image-a-3_1570614664088.jpg", "published_at": "2019-10-09"}