{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7561285/The-white-lies-parents-told-kids-believed-WAY-long.html", "downloaded_at": "2019-10-11 05:10:59.163145+00:00", "title": "The white lies parents told their kids that they believed for WAY too long", "language": "en", "text": "An Australian mother has sparked a lively discussion about the white lies parents tell their children on Facebook.\n\nIn an amusing post, the woman revealed her parents convinced her that writing on her hand would poison her with ink.\n\nShe also admitted she now tells her own children the ice cream truck only plays music when it has run out of ice cream.\n\nThe post received dozens of comments from fellow parents confessing to a wide range of amusing fibs.\n\nAn Australian mother sparked a lively Facebook discussion about the white lies parents tell their children (stock image)\n\nIronically, a number of people recalled their parents making up myths to discourage them from lying.\n\n'If you lie you get a pimple on your tongue, according to my mother,' one woman said.\n\n'My personal favourite is every time you lie, a bird dies,' another wrote.\n\nOne woman said she made her sons believe she could smell lies on their breath.\n\nAdults reveal the hilarious lies they were told as children 'My dad said if I could look after a special growing rock, and watered it each day until it stopped growing I could get a dog. I'd water it and every week, while I was at school he'd replace it with a slightly bigger rock.' 'My dad told me when I was really little that graveyards were just people farms.' 'I told both of my kids that the ice cream truck was the \"music truck.\" It's purpose was to drive around and cheer up all the sad people.' 'My dad told me that thunder happens when two clouds bump into each other.' 'Dad told me that if the turn signal on the car stayed on too long the car would flip over. I still get anxious.' 'My grandmother, who was honest as the day is long but really loved her garden, convinced my sister at an early age that birds of paradise bite. My sister is 50-something now and still wary of them.' 'When I was 5 my dad told me that french fries were made from earthworms. I didn't eat them for 8 years.' Source: Reddit\n\nA number of people recalled their parents telling them the ice cream van only played music to indicate it had run out of ice cream (stock image)\n\nOthers remembered their parents creating fantasies about certain food and drinks.\n\n'Mine told me that swallowing apple or watermelon seeds would leave me with plants sprouting out of my ears!' one woman said.\n\n'I was told the ice cream truck song meant it was out of ice cream,' another recalled.\n\nTwo women revealed their kids have already cottoned on to white lies about alcohol.\n\n'I told my kids that if they drank alcohol or coffee they will stop growing,' one wrote.\n\nSome parents used alcohol as an excuse to never share meals with their kids (stock image)\n\n'I explained that parents have stopped growing so it's okay for them to drink.\n\n'They called me out on it a while ago after they figured out it was a little white lie!'\n\nThe other said she used alcohol as an excuse for never sharing her meal with her children.\n\n'Anything we didn't want to share with the kids, we'd tell them it had alcohol in it.\n\n'Unfortunately they don't fall for that anymore!'", "description": "An Australian mother has sparked a lively Facebook discussion about the white lies parents tell their children, including ice cream trucks playing music because they ran out of ice cream.", "authors": ["Alice Murphy For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/04/19569802-0-image-a-26_1570764508312.jpg", "published_at": "2019-10-11"}