{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7552027/Low-income-individuals-forced-buy-affordable-Androids-hackers-dream.html", "downloaded_at": "2019-10-09 01:24:54.468757+00:00", "title": "Low-income individuals are forced to buy affordable Androids that are a hackers dream", "language": "en", "text": "It seems privacy comes at a cost.\n\nA privacy advocacy group has found that cheap Android smartphones, specifically the $17 MYA2Phone, are vulnerable to hackers and data scraping companies.\n\nThese handsets can only support an older version of the operating system and is unable to delete or updated apps, leaking information and leaving a window open for cyberthieves.\n\nHowever, a study found that many Americans and those living in developing worlds who own the phone are well aware of the privacy violations, but feel they have no choice because they cannot afford high-end handsets.\n\nA privacy advocacy group has found that cheap Android smartphones, specifically the $17 MYA2Phone, are vulnerable to hackers and data scraping companies\n\nThe analysis of the affordable phones comes from Privacy International, a non-profit that challenges governments and companies when it comes to tacking the public via technology, which found that these specific handset are an open window for hackers and a data mining companies dream, according to FastCompany.\n\nThe Androids are not able to support the latest operating system, so they do not have the strongest digital security to keep cybertheives at bay.\n\nThe MYA2 also has apps that cannot be updated nor deleted, specifically Facebook Lite.\n\nThis app was found to follow users, grab contacts and read calendars without the need of the user's permission.\n\nAnd earlier this year, it was discovered that Facebook left up hundreds of millions of Facebook Lite passwords for more than 20,000 employees to see.\n\nMyPhone, which is mainly found in the Philippines, said the specs of the MYA2 limited it to shipping the phone with Android 6.0, and since then it says it has 'lost access and support to update the apps we have pre-installed' with the device.\n\nBecause the MYA2, like most affordable Androids, is equip with an outdated version of the operating system and is unable to update because of the out-of-date heardware.\n\nThese handsets can only support an older version of the operating system and is unable to delete or updated apps, leaking information and leaving a window open for cyberthieves -- but many people have no choice as they cannot afford high-end handsets\n\nHindering users from the luxury of having privacy.\n\nPrivacy International states: 'for those who live in the data wild west and can only afford cheap phones as their sole way to access the internet, we're now also seeing that privacy is becoming a luxury that few can afford.'\n\nFACEBOOK DATA BREACH Facebook said in April 2019 that millions of Instagram passwords have been left exposed on its servers. The social media giant said that it discovered additional passwords were stored in plain text, after believing it was limited to tens of thousands of users. That means the information was readable and searchable by more than 20,000 Facebook employees. The company disclosed the major security oversight in an update to a March 21 post where it revealed it left the passwords of up to 600 million Facebook, Facebook Lite and Instagram users combined stored in plain text. The initial discovery, which was first revealed by security researcher Brian Krebs, uncovered archives dating back to 2012 that show users' passwords in plain text. The company only first learned of the issue this past January.\n\n'While buying a recent Apple phone will guarantee you a secure Operating System (OS) and good encryption, buying a brand new MyPhone, like we did, will leave you with an OS with vulnerabilities left unpatched for years, and apps like MyPhoneRegistration that share your personal data in plain text.'\n\n'Even downloading apps that offer secure communications proved extremely difficult.'\n\nIn September, researchers from the University of Pennsylvania and Rutgers University published a study based on focus groups with 79 Americans who use their phone primarily to access the web.\n\nAnd the team found that 'nearly all study participants shared stories of relinquishing their data privacy, which we consider to be a basic civil right, in exchange for the ability to access online services and platforms,' reads the study.", "description": "A privacy group stated cheap Androids are unable to support new operating systems or update apps, leaving phones vulnerable to hackers and data thieves -but this is all some people can afford.", "authors": ["Stacy Liberatore For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/22/19462944-0-image-a-7_1570570160567.jpg", "published_at": "2019-10-08"}