{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/family-of-8-year-old-boy-finds-closure-as-police-confirm-remains-found-on-field-are-his-20191018", "downloaded_at": "2019-10-19 11:18:51.367840+00:00", "title": "Family of 8-year-old boy finds 'closure' as police confirm remains found on field are his", "language": "en", "text": "The decomposed body of a child found on an open field in Malabar, Port Elizabeth, last month is that of Recolin Keagan Witbooi, the police confirmed on Friday.\n\nDNA tests have confirmed that it was the eight-year-old whose remains were found by a man walking through the field, said police spokesperson Colonel Priscilla Naidu.\n\nRecolin from Barcelona in Gelvandale was last seen on July 6 at 13:30. He and his friends had been playing in Uranus Street when he went missing.\n\nREAD: Family of missing 8-year-old Port Elizabeth boy convinced body found in field is his\n\nAt the time of his disappearance, he was wearing a black hoodie top, a pair of black tracksuit pants and a pair of white Nike takkies.\n\n\"Due to the state of decomposition, the identification of the child could not be determined and DNA analysis was done to confirm his identity. Post-mortem results indicated 'unascertained' due to the advance state of decomposition,\" said Naidu.\n\nClosure\n\nRecolin's father, Clive Domingo, told News24 on Friday that it was difficult for the family to come to terms with the loss of their son, although they were convinced it was his remains found on the scene.\n\n\"The family is heartbroken. His mother has been crying. At least, we have found closure now that we know that it is him,\" Domingo said.\n\nWitbooi will be buried on October 26.\n\nThe police have appealed to anyone who can assist with the investigation to contact Sergeant Edman Mandeka of the Gelvandale police at 078 370 9785/041 402 2018 or Crime Stop at 08600 10111.", "description": "The decomposed body of a child found in an open field in Malabar, Port Elizabeth, last month is that of Recolin Keagan Witbooi, the police confirmed on Friday.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7496/f50a60c696c94f239c8305e34a2cf952.jpg", "published_at": "2019-10-18"}