{"pub": "breitbart", "url": "https://breitbart.com/news/white-house-refuses-to-cooperate-with-impeachment-inquiry", "downloaded_at": "2019-10-09 00:52:38.907609+00:00", "title": "White House refuses to cooperate with impeachment inquiry", "language": "en", "text": "Oct. 8 (UPI) — The White House on Tuesday sent a letter to House Speaker Nancy Pelosi saying it will not cooperate with House Democrats’ impeachment inquiry, calling it “illegitimate and unconstitutional.”\n\nThe letter, signed by White House counsel Pat Cipollone, accused the California Democrat of “seeking to overturn the results of the 2016 election.”\n\n“Given that your inquiry lacks any legitimate constitutional foundation, any pretense of fairness, or even the most elementary due process protections, the Executive Branch cannot be expected to participate in it,” the letter read. “Because participating in this inquiry under the current unconstitutional posture would inflict lasting institutional harm on the Executive Branch and lasting damage to the separation of powers, you have the President no choice.\n\n“Consistent with the duties of the President of the United States, and in particular his obligation to preserve the rights of future occupants of his office, President Trump cannot permit his Administration to participate in this partisan inquiry under these circumstances.”\n\nPelosi on Sept. 24 announced an official impeachment into Trump, accusing him of “seriously” violating the Constitution when he pressed Ukrainian President Volodymyr Zelensky to investigate former President Joe Biden, who is running to unseat Trump in the 2020 election.\n\nEarlier Tuesday, House Democrats said they planned to issue a subpoena to U.S. Ambassador to the European Union Gordon Sondland to testify in Congress and turn over documents related to the impeachment inquiry.\n\nThe chairmen of three investigating House committees announced the subpoena after Sondland failed to appear Tuesday at his scheduled deposition hearing on the orders of the U.S. State Department.\n\nInvestigators — who are trying to determine whether Trump threatened to withhold military aid to Ukraine to pressure the Biden probe — called Sondland to the private hearing to answer key questions for the inquiry.\n\n“Ambassador Sondland had previously agreed to appear voluntarily today, without the need for a subpoena, in order to answer the committee’s questions on an expedited basis,” Sondland’s attorney, Jim McDermott, said in a statement. “As the sitting U.S. Ambassador to the EU and employee of the State Department, Ambassador Sondland is required to follow the department’s direction.”\n\nMcDermott also said Sondland was “profoundly disappointed” he couldn’t testify Tuesday, but is ready to appear on short notice, if he’s permitted.\n\nIn a joint statement, panel Chairmen Adam Schiff, Eliot Engel and Elijah Cummings said the White House is trying to cover up presidential misconduct.\n\n“We consider this interference to be obstruction to the impeachment inquiry,” they said. “We will be issuing subpoena to Ambassador Sondland for both his testimony and documents.”\n\nSchiff, chair of the House intelligence committee, said the State Department is also withholding Sondland’s personal device that contains text messages or emails that are relevant to the case.\n\n“The president and the secretary of state are taking actions that prevent us from getting the facts,” he said. “Those messages are also deeply relevant to this investigation and the impeachment inquiry.”\n\nHe also said Ukrainian officials had wanted to meet with U.S. leaders to discuss Russian incursions, raising questions about whether such a meeting was “conditioned” on Ukraine’s willingness to “play ball” and investigate the Bidens.\n\nAdministration officials discussed whether to block Sondland’s testimony late into Monday night, CNN reported. The White House said the House needs to have a formal impeachment inquiry vote for the probe to be legitimate. Democrats don’t agree.\n\nRep. Jim Jordan, R-Ohio, said he understands the White House decision, saying it’s a result of the way Schiff and other Democrats have handled the impeachment inquiry, which he said has been an “unfair and partisan process.”\n\n“You think about what the Democrats are trying to do: Impeach the president of the United States 13 months prior to an election, based on an anonymous whistle-blower with no firsthand knowledge who has a bias against the president,” Jordan said, adding that he expects Sondland’s testimony to reinforce that of former U.S. Ambassador to Ukraine Kurt Volker last week.\n\nSondland, 62, is one the diplomats involved in numerous text messages released by the committees last week that show discussions about Trump’s July phone call with Zelensky, which was the subject of at least one whistle-blower report. In the messages, diplomat William Taylor expressed concern about Trump pressuring Zelensky for a Biden investigation.\n\nIn the exchanges, Sondland told Taylor that Trump was not trying to use Ukraine’s military aid as leverage.\n\n“The president has been crystal clear no quid pro quo of any kind,” he added. “The president is trying to evaluate whether Ukraine is truly going to adopt the transparency and reforms that President Zelensky promised during his campaign. I suggest we stop the back and forth by text.”\n\nSome Republicans have cited Sondland’s text messages as proof that Trump did nothing wrong.\n\nTaylor, however, signaled in one message he might resign over frustration with how the situation was being handled.\n\nSondland, a wealthy hotelier and longtime Republican donor, has been vocal in his support for the president’s dealings with Ukraine. He was appointed by Trump to the EU ambassadorship last year to succeed Obama appointee Anthony Gardner.\n\nMonday, the committee chairmen subpoenaed records, to be turned over by Oct. 15, from the Defense Department and White House budget office — and requested the same from the White House and Vice President Mike Pence last weekend.", "description": "Oct. 8 (UPI) — The White House on Tuesday sent a letter to House Speaker Nancy Pelosi saying it will not cooperate with House Democrats’", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-08"}