{"pub": "fox", "url": "https://foxnews.com/tech/apple-augmented-reality-headset-launch-2020", "downloaded_at": "2019-10-09 19:00:20.427786+00:00", "title": "Apple's next big thing? Augmented reality headset to launch early next year, report says", "language": "en", "text": "Apple may be getting close to launching its long-awaited augmented reality headset, according to an influential analyst.\n\nThe report, from TF International Securities analyst Ming-Chi Kuo and first obtained by Apple-focused website, MacRumors, says that the headset is likely to launch in the second quarter of 2020. He had previously expected the headset to launch in the latter part of next year.\n\nKuo did not mention the price of the headset, though the analyst did add that Apple would work with third-party brands for the wearable technology.\n\nAPPLE ATTACKED BY CHINA FOR KEEPING CROWDSOURCED POLICE ACTIVITY APP IN HONG KONG\n\nThe headset, which may be sold as an accessory to the iPhone, according to Kuo, has been rumored for several years.\n\nIn 2017, the iPhone maker filed a patent for a glasses-style device that harnesses augmented reality (AR), showing how the technology could work with a device and overlay information on real-world objects. In that case, the technology could be used in conjunction with a smartphone, but also with “semi-transparent spectacle or glasses\" or both devices in tandem with each other.\n\nEarlier this year, Apple also filed a patent for a mixed reality headset that could include sensors to track users' facial features, eyes and hands. The patent, filed in March 2019 and known as Display System Having Sensors, indicates that Apple is researching how mixed (or augmented) reality might translate from cellphones to glasses.\n\nApple CEO Tim Cook made comments in 2016 that for a significant portion of the population in developed countries and eventually all countries, augmented reality experiences will be like \"eating three meals a day.\"\n\nApple did not immediately respond to a request for comment from Fox News.\n\nCLICK HERE TO GET THE FOX NEWS APP", "description": "Apple may be getting close to launching its long-awaited augmented reality headset, according to an influential analyst.", "authors": ["Chris Ciaccia"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/01/ContentBroker_contentid-7695c2fde2e54d77bf1f9a22626228d4.png", "published_at": "2019-10-09"}