{"pub": "newrepublic", "url": "https://newrepublic.com/article/155141/cancel-culture-con", "downloaded_at": "2019-09-23 10:34:32.394387+00:00", "title": "The “Cancel Culture” Con", "language": "en", "text": "Nevertheless, Chappelle’s Jackson bits were among the jokes that, along with his routine cracks against transgender people, landed him in hot water that has since turned lukewarm. Despite being loudly panned by professional and social media critics alike, Chappelle remains in the good graces of both major figures in the comedy community—including defenders like Sarah Silverman, Bill Burr, and Matt Stone—as well as his fans. Sticks and Stones has a 99 percent audience score on Rotten Tomatoes. Netflix, unfazed by all the commotion, actively promoted some of the show’s controversial bits. It’s hardly surprising. Disbelief of sexual abuse and disgust for transgender people are mainstream enough that Chappelle could take on a second career as a Republican speechwriter.\n\nSo too are disclaimers like the one that began Chappelle’s bit on Jackson. What actually happens to the comedians who “say what they’re not allowed to say” 55 years after Bruce’s death? We were given a glimpse of these new consequences when recent Saturday Night Live hire Shane Gillis was fired after videos of him using racial slurs and disparaging Asians and Muslims went viral. Gillis’s initial statement offered an apology to anyone “actually offended by anything I’ve said,” and explained that the jokes for which he’d been criticized were made in the course of being a “comedian that pushes boundaries.” The “boundary pushing” comedy in question included a mock Chinese accent and a line on “having gay sex in jail.” The Gillis saga has troubled Democratic presidential candidate Andrew Yang, who seems to have arranged a forthcoming beer summit of sorts with the comedian. After Gillis made his apology, Yang tweeted that as a society, “we would benefit from being more forgiving rather than punitive.”\n\nProminent comics have agreed. Sarah Silverman says comedians are working within a “mutated McCarthy era, where any comic better watch anything they say.” Former SNL castmember Rob Schneider tweeted that Gillis and other comedians had been the subject of an “intolerable inquisition.” On the Comedy Central show Lights Out with David Spade, Jim Jefferies named a cultural culprit for the inquisition. “This is just cancel culture,” he said. “The guy shouldn’t have been fired.”\n\n\n\n“Cancel culture” has been in the sights of many comedians for a while now, and you can find the most diligent reports on their salvos against it in conservative media. “Adam Carolla Unloads on Cancel Culture At Alec Baldwin Roast” read a Breitbart headline last week. Carolla is probably best known, at this point, for his work with the conservative commentator Dennis Prager on a forthcoming documentary about political correctness on campus titled No Safe Spaces. His remarks about young people at the roast—an event ostensibly about Alec Baldwin—were a kind of preview of the film. “You’re all woke and no joke,” he grunted. “So, if you were offended by anything said tonight, please give a reach around to your emotional support dog and shut the fuck up! This is our safe space, bitches.”\n\n\n\nThere’s a large audience for this kind of thing and comedy marketers are hip to it.\n\nThere’s a large audience for this kind of thing and comedy marketers are hip to it. A 2016 Joe Rogan special was titled, simply, Triggered. A new special from Bill Burr that offers subtle critiques of the turn against political correctness was nevertheless promoted by Netflix with a selection of clips from a rant in which Burr appears to mock the #MeToo movement, feminists, and the like. This year’s MTV Video Music Awards were hosted by 46-year-old comic Sebastian Maniscalco, whose opening monologue mocked millennials and teens. “If you feel triggered or you feel offended by anything I’m saying here or anything the musical artists are doing,” he said, “they’re providing a safe space backstage where you’ll get some stress balls and a blankie and also Lil Nas X brought his horse which will double as an emotional support animal.”\n\nThose who turned to Google afterwards wondering how an aging comedian wound up on MTV sneering at young people the network has been struggling to reach might have happened across a Forbes article listing Maniscalco, who also released a Netflix special of his own this year, as one of the top ten highest paid comedians in the world in 2018, having earned an estimated $15 million. Chappelle was third, having earned $35 million. This “mutated McCarthy era” has treated the comics on that list particularly well, although some on it, beyond Chappelle, remain troubled by our cultural climate. Chris Rock (#4, $30 million) and Jerry Seinfeld (#1, $57.5 million), for instance, have been quoted in recent years, saying that over-sensitivity has made it impossible for comics to tour college campuses. In response, comedian John Mulaney argued that campuses have become sensitive not to the material of comics like Rock and Seinfeld, but to their astronomical performance fees.\n\n\n\nIn fairness, Shane Gillis’s past material will probably keep him from touring campuses anytime soon. But he is performing standup again. During a set at New York’s The Stand last week, he addressed his firing, saying that he had accepted and made peace with the consequences for his past jokes. “Everybody’s been like, ‘You can’t say shit and not expect consequences,’” he said. “I’m not arguing. Fuck it.” It needn’t be said that Gillis is going to be fine. He already is.\n\n\n\nYet, Gillis is now at the center of a discourse that suggests comedians should see, in critical tweets and Tumblr posts, the kind of threat comedians in Bruce’s day once saw in undercover policemen. This might be the funniest idea comics like Chappelle have left to offer us. As far as comedy is concerned, “cancel culture” seems to be the name mediocrities and legends on their way to mediocrity have given their own waning relevance. They’ve set about scolding us about scolds, whining about whiners, and complaining about complaints because they would rather cling to material that was never going to stay fresh and funny forever than adapt to changing audiences, a new set of critical concerns, and a culture that might soon leave them behind. In desperation, they’ve become the tiresome cowards they accuse their critics of being—and that comics like Bruce, who built the contemporary comedy world, never were.\n\nPerhaps this is too flippant a dismissal. “Cancel culture,” after all, is a phrase deployed widely outside the world of comedy to describe an all consuming, social media-fueled climate of outrage—a dark cloud hanging over not only comics, but also a wide range of public figures and entities, some of whom where helpfully named by a New York Times piece last year, “Everyone is Canceled”:\n\n\n\nSignificantly, all of these figures are alive, well, and prosperous today—as are the people, brands, and projects named in a Wired piece about the Chappelle controversy earlier this month:\n\n\n\n[Chappelle] joins internet culture criminals as various as Logan Paul (who filmed a dead person in Japan’s Aokigahara Forest and posted it to YouTube), Kanye West (who said, among other things, that slavery is a choice), Gucci (who made several items of clothing deemed racially insensitive), Shania Twain (who said she would have voted for Trump if she weren’t Canadian), and Disney’s upcoming live-action remake of Mulan (because star Liu Yifei stated that she supported Hong Kong’s police force rather than its protesters).\n\nThree days later, Digiday published another list of the damned in a piece that referenced the troubles that fitness chain Equinox has faced since it was revealed that the chair of its parent company Related Companies was a Trump supporter:\n\n\n\nEquinox isn’t alone. Soulcycle is canceled too. So is: Louis C.K., LaCroix, Kamala Harris, Joe Biden, Donald Trump (of course), pretty much every single Democratic presidential candidate, Taylor Swift, guacamole, In & Out’s French fries.\n\n“Cancel culture” seems to describe the phenomenon of being criticized by multiple people—often but not exclusively on the internet.\n\nIf we take these lists seriously, cancel culture, as best as one can tell, seems to describe the phenomenon of being criticized by multiple people—often but not exclusively on the internet. Neither the number of critics, the severity of the criticism, nor the extent of the actual fallout from it seem particularly important. A great many people find Louis CK to be disgusting. The same can’t yet be said for guacamole. Both, we’re told urgently, have been canceled.\n\n\n\nSince their piece on “cancel culture” last year, writers at the Times alone have referenced the concept in at least 14 articles on subjects ranging from Joe Biden’s age to a revival of Kiss Me, Kate on Broadway. This count doesn’t include references to “call-out culture,” a close synonym invoked by David Brooks earlier this year in a column about a woman “cancelled” or “called out” online after it was discovered she had engaged in cyberbullying during high school. Her saga, featured in the podcast Invisibilia, troubled Brooks deeply. “I’m older, so all sorts of historical alarm bells were going off,” he wrote. “The way students denounced and effectively murdered their elders for incorrect thought during Mao’s Cultural Revolution and in Stalin’s Russia.” Later in the column, he described call-outs as “a step towards the Rwandan genocide.”\n\n\n\nStatements like this are routine in cancel culture discourse—any particular cancellation, no matter how trivial or narrow it may seem to the casual observer, evidently carries within it the seeds of something much more grave. In a March column, The Wall Street Journal’s Peggy Noonan also made reference to torture and indoctrination under Mao. “I don’t want to be overdramatic, but the spirit of the struggle session has returned,” she declared. “Social media is full of swarming political and ideological mobs. In an interesting departure from democratic tradition, they don’t try to win the other side over. They only condemn and attempt to silence. The spirit of the struggle session is all over Twitter.”\n\n\n\nBeing cancelled on Twitter, then, is an event that belongs to an alarming lineage of severe intolerance, cruel persecution, official condemnation, and vindictive upheavals. The list of weighty precedents is endless. Nelson Mandela was cancelled. Martin Luther King Jr. was cancelled. The Beatles were cancelled. Lenny Bruce, of course, was cancelled. Vladimir Nabokov, D.H. Lawrence, and James Joyce were all cancelled. Alfred Dreyfus was cancelled and, famously, uncancelled. Robespierre, like fellow canceller par excellence Joseph McCarthy, eventually got himself cancelled. Twenty unlucky Puritans were cancelled at Salem. Galileo was cancelled. Martin Luther was cancelled. Joan of Arc was cancelled. At least half a dozen popes have been cancelled. Jesus was cancelled. Socrates was cancelled. The pharaoh Akhenaten, reviled and stricken from official records for introducing monotheism to Egypt, was cancelled quite thoroughly in the fourteenth century BC. In the twenty-fourth, Lugalzagesi, uniter of Sumer, was cancelled by Sargon of Akkad and a cheering public as he was marched in a neck stock through the city of his coronation and executed. Et cetera.\n\n\n\nYet it seems at least possible that tweets are just tweets—that as difficult as criticism in the social media age may be to contend with at times, it bears no meaningful resemblance to genocides, excommunications, executions, assassinations, political imprisonments, and official bans past. Perhaps we should choose instead to understand cancel culture as something much more mundane: ordinary public disfavor voiced by ordinary people across new platforms.\n\nBut many of those troubled by cancel culture insist it should trouble the rest of us even so. “Whatever you call it—public shaming, call-out culture, or cancellation—what’s happening now is in no way a new phenomenon,” The Stranger’s Katie Herzog wrote last week. “But what is new is the scale of it all. This isn’t just happening to public figures; it’s happening everywhere that social media exists, and you no longer have to be powerful, or even notable, to get canceled. And sometimes the offense was committed when the guilty party was just a kid.”\n\n\n\nThe “guilty party” Herzog references with a link here is Kyler Murray, a football player who made an apology after winning the Heisman Trophy last year when it was discovered he had written homophobic tweets as a teen. Those curious about how low cancellation has brought Murray should tune into Fox next Sunday afternoon. He’s now the starting quarterback for the Arizona Cardinals.\n\n\n\nAsk a cancel culture critic for a good example of how destructive online criticism can be and they’ll likely reference a set of controversies that have recently erupted within the world of young adult publishing, one of which was covered earlier this year by the Times’ Jennifer Senior in a column titled “Teen Fiction and the Perils of Cancel Culture.” A novel set during the Kosovo War titled A Place for Wolves by a young debut author, Kosoko Jackson, had been pulled from publication after it was criticized on social media for, among other things, villainizing Albanian Muslims.\n\n\n\nThough Senior conceded that the novel had been “painfully clumsy,” she argued that the criticisms Jackson and the novel had faced online opened the door to a terrifying possibility. “If Twitter controls publishing,” she wrote, “we’ll soon enter a dreary monoculture that admits no book unless it has been prejudged and meets the standards of the censors.” She also noted the irony of Jackson, who has worked as a “sensitivity reader” for publishers, coming in for the kinds of criticisms he’d leveled at other books online in the past: “Robespierre with his own neck in the cradle of the guillotine,” she called him—and that another YA book had been pulled by a debut author just five weeks earlier.\n\n\n\nThe controversy surrounding that book, Blood Heir by Amélie Wen Zhao, was covered in a Tablet article titled “How a Twitter Mob Derailed an Immigrant Female’s Budding Career,” by Jesse Singal—part of his ongoing effort, he wrote, to catalog “pathological social rituals in online communities.” Singal wrote that he’d been tipped off to a “whisper campaign” against Zhao, which mostly amounted to posts arguing her novel, a fantasy about a magical society defined by a caste system in which, according to PR copy, “oppression is blind to skin color, and good and evil exist in shades of gray,” trivialized racism and American slavery.\n\n\n\nSingal, citing an apology from Zhao in which she said that the book had been an allegory for contemporary slavery, concluded his piece with a solemn shake of his head. “[T]he book, which was intended as a comment on contemporary slavery in a part of the world most Americans know nothing about, probably won’t be published,” he wrote, “and won’t give American readers a chance to read the perspective of an Asian writer inspired by an issue of urgent importance to many Asian people.”\n\n\n\nIn another piece about Blood Heir, Reason’s Robby Soave made the inevitable reference to Ray Bradbury’s Fahrenheit 451. “[I]t’s a treatise against the sort of society where everything that provokes anyone is deemed problematic,” he wrote. “Bradbury wasn’t worried that the government would start burning books out of nowhere; he worried that people would demand the bonfires. Censorship grows out of political correctness, weaponized by each aggrieved person against everyone else.”\n\n\n\nThe Jackson and Zhao controversies came roughly a year and a half after “The Toxic Drama of YA Twitter,” a piece by New York magazine’s Kat Rosenfield about Laurie Forest’s The Black Witch—another fantasy criticized online for its handling of race—and the YA book world’s other supposed casualties of cancel culture, which Rosenfield listed:\n\n\n\nElsewhere in the piece, she named two other condemned titles: E.E. Charlton-Trujillo’s When We Was Fierce, criticized for stereotyping African-Americans, and Keira Drake’s The Continent, yet another racially problematic fantasy.\n\n\n\nFor all the online ruckus Rosenfield chronicles in the piece, it seems significant every title referenced within it but one, including The Black Witch, has been published. Everything Everything, in fact, was a Times bestseller and adapted into a feature film. The author of the lone exception, Charlton-Trujillo, released her third YA novel this year.\n\n\n\nAs for Jackson and Zhao, the decision to suspend their debuts was entirely voluntary and entirely their own, as The New Yorker’s Katy Waldman wrote earlier this year. In his tweeted apology to critics, Jackson conceded that he had “failed to fully understand the people and the conflict” central to his novel. In hers, Zhao expressed gratitude to those who had spoken up about the book’s themes. “I have the utmost respect for your voices, and I am listening.” This was received well by those who had led critiques of Blood Heir. “When Zhao apologized and withdrew her book, Y.A. stakeholders largely greeted her words with support and encouragement,” Waldman wrote, “seeing them as the result of being ‘called in’—reminded of one’s values as a community member—rather than ‘called out.’”\n\n\n\nKosoko Jackson now has another novel set for release in the spring. Zhao’s Blood Heir—the novel that inspired Soave’s allusion to book burnings, the novel Singal suggested would never be released thanks to a controversy that “derailed” Zhao’s career—will be out in November.\n\nSome of the most serious cancellations have been products of the #MeToo movement—a number of serial abusers have been genuinely ostracized in a fast-moving, social media-driven cultural wave that some argued would inevitably sweep up many innocent men. Nearly two years on from its peak, the awaited pogroms against nice guys have yet to materialize, and several of the men who rightly came under fire either never really left public life or are planning comebacks. Al Franken is set to headline a major political convention. Mark Halperin, accused, among other things, of throwing a woman against a window, will put out a book in the fall. Aziz Ansari had his fall from grace cushioned substantially to begin with by sympathetic pieces across the press, including a tremulous essay in The Atlantic by Caitlin Flanagan titled “The Humiliation of Aziz Ansari.”\n\n“Twenty-four hours ago—this is the speed at which we are now operating—Aziz Ansari was a man whom many people admired and whose work, although very well paid, also performed a social good,” she wrote. “Now he has been—in a professional sense—assassinated, on the basis of one woman’s anonymous account.”\n\n\n\nAnsari, reputedly dead, in a professional sense, released a new Netflix special in July.\n\nAnsari, reputedly dead, in a professional sense, released a new Netflix special in July and returned to Forbes’ highest paid comedians list this year for the first time since 2015, having earned an estimated $13 million between this and last spring. One writer who worked particularly hard to protect him from this dreadful ignominy was the Times’ Bari Weiss, who wrote a column that both omitted uncomfortable details of Ansari’s encounter with his accuser and advanced a broader critique of the #MeToo movement. “The insidious attempt by some women to criminalize awkward, gross and entitled sex,” she wrote, “takes women back to the days of smelling salts and fainting couches.”\n\n\n\nWeiss, a frequent critic of cancel culture once best known for her efforts to cancel professors critical of Israel, was recently covered in a New York magazine article on a party that could have used some salts and couches. Various media figures, celebrities, and socialites gathered earlier this month to commemorate the release of Weiss’s new book How to Fight Anti-Semitism and commend her bravery in the face of criticism.\n\n\n\n“As the canapés came out (pastrami and pickle on rye squares!), the temperature rose, and the head count approached 140, guests grumbled about Twitter mobs and cheered Weiss’s ­outspokenness,” New York’s Boris Kachka wrote. “The depredations of the online left came up often at the party, with little or no prompting. MSNBC anchor Stephanie Ruhle, who has frequently hosted Weiss on her morning show, deplored ‘cancel culture.’ ‘On a regular basis,’ she said, people say to me, ‘I wouldn’t say that in public.’”\n\n\n\nIt seems doubtful that Ruhle’s confidants would have preferred being on the other side of public opinion just a few decades ago, in a country then given to social conniptions over miniskirts and mild profanity—one whose pearl clutchers included judges and prosecutors empowered by a regime of obscenity laws and other repressive statues that has since crumbled. It also seems relevant that the contempt Weiss and her friends have for progressive identity politics wouldn’t have been on the other side of public opinion then and isn’t actually heretical now, shared as it is by millions of ordinary people, a broad constellation of publications and outlets, and political figures—including the sitting president of the United States—who happen to hold most of the political power in this country.\n\n\n\nBut those concerns do, as multiple profiles of Weiss in particular lament, make them unlikeable to a certain segment of progressives whose respect they evidently feel entitled to. “For people of a certain age, it might seem odd that Weiss should be a favorite punching bag for lefties with itchy Twitter fingers,” Vanity Fair’s Evgenia Peretz wrote in April. “If you read her work, she’s a liberal humanist whose guiding principle is free expression in art, love, and discourse, something the left spent decades fighting to achieve.” As deeply as Weiss might believe in discourse, art, love, light, and laughter, of course, many people disagree strongly with her views and will continue to say so online. This is less a tragedy than an integral part of her chosen profession.\n\n\n\nAngst about this cannot really be understood as a response to the advent of an oppressively censorious monoculture—not when political figures reviled by most of the country can dance the salsa on national television or when rants about gay frogs and Bilderberg Satanists can earn millions. Not with anti-vaxxers, Flat Earthers, and keyboard Klansmen running about.\n\nThe critics of cancel culture are plainly threatened not by a new and uniquely powerful kind of public criticism but by a new set of critics: young progressives, including many minorities and women who, largely through social media, have obtained a seat at the table where matters of justice and etiquette are debated and are banging it loudly to make up for lost time. The fact that jabs against cancel culture are typically jabs leftward, even as conservatives work diligently to cancel academics, activists, and companies they disfavor in both tweets and legislation, underscores this.\n\nSocial media activism and commentary occasionally tips into overzealotry. But stray instances of identity political criticisms going overboard are not evidence that the culture as a whole has or that those who dissent from progressive consensus will soon find themselves sent to the gulag. By any reasonable standard, this is the greatest period for free expression in the history of mankind. Ours is a golden age—by comparison to an era, within living memory, that saw intense legal and political battles over censorship—of the American public not being offended by things.\n\nSuch is life under cancel culture. It is mostly good.\n\nIf we find ourselves moving dizzily from outrage to outrage from week to week, we should consider that being outrageous has never cost so little or earned professional contrarians and provocateurs so much. When they’re not weeping into plates of hors d’oeuvres about Twitter, they may well be writing for the Times or The Atlantic, finishing up a forthcoming best-seller, or taking up a standing invitation to join Bill Maher on national television. Such is life under cancel culture. It is mostly good.\n\n\n\nThis isn’t to say, of course, that there aren’t real instances of intolerance and repression around for our putative chroniclers of cultural ostracism to take an interest in. In April, a 23-year-old Dallas woman named Muhlaysia Booker backed into a car in an apartment parking lot. The driver of the other car then held her at gunpoint to force her to pay damages. As the confrontation took place, a bystander was offered $200 to attack Booker. He obliged. In a video that subsequently went viral, a mob—a real one—can be seen joining in, punching and kicking her in the head and yelling slurs as she squirms and struggles on the ground. She was hospitalized with a concussion and facial fractures.\n\n\n\nMuhlaysia Booker isn’t going to be given a column in which she might describe her treatment to the public. She won’t be appearing on any panels or podcasts. She won’t be doing any standup sets. Muhlaysia Booker is dead. A month after the attack, her body was found face down in an East Dallas street with a gunshot wound. She was one of nineteen predominantly black transgender women to have been murdered so far this year in a wave of violence the American Medical Association has called an epidemic.\n\n\n\nThe cultural power the critics of cancel culture breezily ascribe to progressive identity politics did not save these women. It hasn’t yet afforded their deaths the pride of place in our discourse which our media class—in its incredible, bottomless narcissism—readily gives to elite university dramas and the insults that land in their Twitter notifications. The power to cancel is nothing compared to the power to establish what is and is not a cultural crisis. And that power remains with opinion leaders who are, at this point, skilled hands at distending their own cultural anxieties into panics that—time and time and time again—smother history, fact, and common sense into irrelevance. Cancel culture is only their latest phantom. And it’s a joke.", "description": "Dave Chappelle, Shane Gillis, and other alleged victims would rather scold their critics than come up with fresh material.", "authors": ["Osita Nwanevu"], "top_image": "https://images.newrepublic.com/a11eb135fdd6b37af33a4286cfe08682cc1ab476.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg", "published_at": "2019-09-23"}