{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/dad-disgusted-after-baby-changing-20703427", "downloaded_at": "2019-10-23 09:40:06.230239+00:00", "title": "Dad's horror after Wetherspoons baby changing station 'used to snort cocaine'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA disgusted dad claims a baby changing station in his local Wetherspoons pub had been used as a \"snorting table\" for cocaine.\n\nChris Kempson, 48, used the loo during his visit to the Admiral of the Humber in Hull on Saturday morning - and said he found a rolled up £20 note on the white plastic baby changing table.\n\nThe dad-of-six said it was \"obvious\" the table had been used by someone snorting cocaine and described it as being \"beyond belief.\"\n\nWetherspoons has described drug-taking at the pub as \"unacceptable.\"\n\nAsked if he reported it to the staff, Mr Kempson said: \"No, but I did tell the dad with baby who was going in there, he wiped it down with baby wipes,\" reports Hull Live.\n\n\"If they wanna stick that s*** up their nose that's their issue, but a baby changing station to rack up on is so low. Really not cool.\n\n\"It's their choice if they wanna stick beak up their nose, but why would someone use that as a snorting table? It's beyond belief.\"\n\n(Image: HullLive/ WS)\n\nMr Kempson, who runs a furniture removal firm, said he suspects the note had been left since the Friday night.\n\nHe said: \"They [staff] ain't cleaned it otherwise cash would of been gone. Someone said to me before 'name and shame' pub, but how can you blame the pub?\n\n\"It's the idiot who did it to be honest, unless it's been there all night, then it's their issue as well then.\n\n\"With a bit of luck the little b****** might see it [the story] and make them rethink. Wetherspoons baby changing table is not the place to be doing lines of coke folks.\"\n\nThe dad, who does a lot of voluntary work with homeless people, including the Raise the Roof project, admits he kept the money to pay for breakfast.\n\n(Image: HullLive/ WS)\n\nHe said: \"Sorry, no angel like charity thing but I do enough of that stuff as is well known.\n\n\"I'm human all the same.\n\n\"Half the notes in circulation are known to carry traces of coke these days.\"\n\nEddie Gershon, a Wetherspoon spokesman, said: “We apologise to the gentleman concerned. Wetherspoon has zero tolerance to the use of drugs in its pubs.\n\n\"It is impossible to monitor what goes on in a toilet cubicle once the door has been locked. However, we fully appreciate that the discovery of cocaine in the toilet is unacceptable.”", "description": "Chris Kempson, 48, used the loo during his visit to the Ad'miral of the Humber in Hull on Saturday morning - and said he found a rolled up £20 note on the white plastic baby changing table", "authors": ["Joanna Lovell", "Image", "Hulllive", "Ws"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20703805.ece/ALTERNATES/s1200/0_Hull-dad-disgusted-as-Wetherspoons-baby-changing-station-used-as-cocaine-snorting-tableWetherspoo.jpg", "published_at": "2019-10-23"}