{"pub": "fox", "url": "https://foxnews.com/media/marianne-williamson-crystal-woo-woo-lady", "downloaded_at": "2019-10-05 01:28:25.042509+00:00", "title": "Marianne Williamson: I'm not some 'crystal woo-woo lady' people on the 'left' say I am", "language": "en", "text": "Spiritual guru and 2020 hopeful Marianne Williamson had some harsh words for \"left-wing voices\" who portray her as a \"crystal woo-woo lady.\"\n\nIn an interview with Yahoo News, Williamson pushed back against the narrative about her spirituality, making it clear she has never owned a \"crystal.\"\n\n“This idea that I’m a crystal woo-woo lady ... the crystal woo-woo lady image, to some extent amusing, has no relation to reality,” Williamson said. “I’ve never had a crystal, I’ve never written about crystals. I’ve never talked about crystals. I’ve never had a crystal onstage with me.”\n\nThe wellness author expressed that she thought \"something far more sinister\" was behind the amplified scrutiny of her record and went on to claim that \"left-wing voices” pushed stories that were “out-and-out lies,\" adding, \"Unfortunately, the vicious smears have not been coming from Republicans.”\n\nMARIANNE WILLIAMSON CAUGHT ON A HOT MIC SAYING 'CONSERVATIVES ARE NICER' TO HER THAN THE LEFT\n\n“The words were all the same: ‘anti-science,’ ‘anti-medicine,’ ‘dangerous,’ ‘crazy’ and ‘grifter.’ I mean, you couldn’t be clearer. Those were the words repeated in all of the articles, all of the stories. They were meant to create suspicion in people’s minds,\" she said.\n\n\"They were meant to create doubt, lest anybody even think of taking me seriously as a candidate. But I think at this point, just as that smear campaign cast doubt on my credibility, the fact that I’ve been out there, that people have heard me more themselves, people have seen my clips, enough has begun to cast doubt on the credibility of those who have projected onto me such mischaracterization.”\n\nWilliamson, who failed to qualify for the October Democratic debate, accused the media of \"dictating the process,\" offering a simple \"duh\" when asked if debate moderators offering more questions to top-tier candidates was evidence of bias.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nHer campaign announced this week that it has raised $3 million in the third quarter, far overshadowed by Sens. Bernie Sanders, I-Vt., and Elizabeth Warren, D-Mass., who both raised over $20 million, but she expressed her optimism as a candidate going forward.\n\n“My campaign is like a bonsai tree,” Williamson explained. “A bonsai tree has everything that a big tree has. But it’s within the limits of those glass walls. So, I have everything every campaign has, just less of it.\"", "description": "Spiritual guru and 2020 hopeful Marianne Williamson had some harsh words for \"left-wing voices\" who portray her as a \"crystal woo woo lady.\"", "authors": ["Joseph Wulfsohn", "Joseph A. Wulfsohn Is A Media Reporter For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/AP19262622255095.jpg", "published_at": "2019-10-04"}