{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/04/greek-pm-eu-states-must-do-more-to-share-burden-of-hosting-refugees", "downloaded_at": "2019-10-04 23:46:10.775685+00:00", "title": "Greek PM: EU states must do more to share burden of hosting refugees", "language": "en", "text": "Kyriakos Mitsotakis vows to take tougher line on migration by stepping up deportations\n\nGreek PM: EU states must do more to share burden of hosting refugees\n\nThe Greek prime minister has called for sanctions to be imposed on EU member states that refuse to share the burden of hosting refugees, as the country struggles to handle burgeoning numbers of asylum seekers.\n\nAmid mounting tensions over the dramatic increase in men, women and children crossing from Turkey, Kyriakos Mitsotakis warned that his centre-right government would take a tougher line than its leftist predecessor, stepping up deportations and internationalising the issue.\n\n“I will say this clearly: I will raise the matter of specific sanctions for European countries that refuse to take part in a fair distribution of refugees on a European level,” he said on Friday, as senior EU officials visited Athens and Ankara for talks on the migration crisis.\n\nThe influx has overwhelmed Aegean island camps and put the new government on the defensive, barely three months after it was voted into office.\n\nRiots at Greek refugee camp on Lesbos after fatal fire Read more\n\nThis week riots erupted in Moria, the vastly overcrowded registration centre on Lesbos, after an Afghan woman died in a fire at the facility, prompting demands for mass transferrals to the Greek mainland.\n\nThe camp is now operating at four times over capacity with 13,500 living mostly in flimsy tents. In other islands across the Aegean archipelago, close to 30,000 are currently forced to endure conditions human rights groups have described as deplorable.\n\nMitsotakis pledged to move as many as 20,000 to the mainland, insisting “we don’t want fences or walls”, but he also claimed that most of those now entering Greece were economic migrants rather than refugees.\n\n“Today only two out of 10 are Syrians,” he told parliament, recalling that in 2015, at the height of Europe’s migration crisis, 75% of those landing on Greek shores had come from the war-torn nation.\n\n“Some 50% are Afghans and Pakistanis, who are moved by organised traffickers. Most have the profile of economic migrants, not refugees.”\n\nThe sharp increase has alarmed Brussels and Berlin. Under a landmark accord struck with the EU in March 2016, Ankara agreed to curb flows by enhancing patrols along its Aegean coast. In return, Brussels promised to hand over $6bn in funds to the country.\n\nAmid bitter recriminations over the amount of money given thus far, Turkey’s strongman president, Recep Tayyip Erdoğan, has threatened “to open the gates” and flood Europe with migrants if demands aren’t met.\n\nThe Turkish leader is also pressing for European support in creating a “safe zone” in northern Syria where Ankara aims to resettle some 2 million Syrian refugees. As home to close to 4 million displaced Syrians, Turkey hosts more Syrians than any other place in the world.\n\nWith concerns heightened over the pact’s durability, the European commission’s migration commissioner, Dimitris Avramopoulos, and German interior minister, Horst Seehofer, held talks in Turkey and Greece on Friday as officials called for more deportations of asylum seekers whose applications are rejected.\n\nMitsotakis reiterated his government’s plans to send back 10,000 migrants to Turkey by the end of 2020 – an eight-fold increase of the number readmitted under the former Syriza administration.\n\nBut the returns – and plans to create closed, pre-deportation centres – are controversial.\n\n“We are very much opposed to this policy of deterrence,” Dimitris Vitsas, the former migration minister under the Syriza government, told the Guardian. “In every flow there is a mix of migrants and refugees. To say that only migrants are arriving now is very wrong when you are asking for others to equitably share the burden. Does this government honestly think that Hungary and other [central and European countries] will accept to take in more when it is openly saying they are not refugees?”", "description": "Kyriakos Mitsotakis vows to take tougher line on migration by stepping up deportations", "authors": ["Helena Smith"], "top_image": "https://i.guim.co.uk/img/media/1230077ba6ada42270e2b97290c8cd46695c7f0a/0_349_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=aff771dbd657b53e0d875e7e8e024a42", "published_at": "2019-10-04"}