{"pub": "investing.com", "url": "https://ng.investing.com/news/economy/eisman-says-trump-would-have-to-give-in-for-china-trade-deal-47286", "downloaded_at": "2019-09-09 23:34:57.734698+00:00", "title": "Eisman Says Trump Would Have to Give in for China Trade Deal", "language": "en", "text": "© Reuters. Eisman Says Trump Would Have to Give in for China Trade Deal\n\n(Bloomberg) -- Steve Eisman, the Neuberger Berman Group money manager, said U.S. President Donald Trump would have to back down to get a trade deal with China.\n\n“Will there be a deal between China and the U.S.? I have my doubts,” Eisman said on Bloomberg TV on Monday. “My impression is that China is not backing down on anything,” so to get a deal “Trump basically has to give in.”\n\nEisman, 57, said the prospects of a deal would collapse if China sent its military to manage the continuing protests in Hong Kong. Such a move could also cause a global market correction, said the money manager who famously foresaw the collapse of subprime mortgages before the 2008 financial crisis.\n\n“If that were to happen, the probability of a trade deal between the United States and China would probably go to zero,” he said.\n\nGlobal markets have been buffeted by the U.S.-China trade dispute since Trump first proposed tariffs on imports in early 2018. Volatility has soared and corporate earnings estimates slashed as hopes of a resolution have come and gone. The saga has added to the risks of a disruption in global supply chains, driving up some consumer prices and weighing on growth.\n\nEisman’s bets against the housing market before the financial crisis were chronicled in Michael Lewis’s 2010 book “The Big Short,” which showcased money managers who foresaw and profited from the market turmoil. The money manager joined Neuberger Berman after closing his hedge fund Emrys Partners in 2014, and currently runs managed accounts and money pools betting on rising and falling share prices.\n\n(Updates with Eisman comments in fourth paragraph.)", "description": "Eisman Says Trump Would Have to Give in for China Trade Deal", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEE2P0H6_L.jpg", "published_at": "2019-09-09"}