{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stocks/united-airlines-shares-may-be-ready-to-break-out-of-holding-pattern-15128484", "downloaded_at": "2019-10-16 13:36:26.911246+00:00", "title": "United Airlines Shares May Be Ready to Break Out of Holding Pattern", "language": "en", "text": "United Airlines Holdings Inc. (UAL) has been in a holding pattern of sorts the past year with buyers coming in around $78 and sellers taking profits in the upper $90s. There has been some subtle improvement in the technical condition of the stock in recent months, so we may want to grab our boarding passes and go long. Let's do a pre-flight check of the charts and indicators.\n\nIn this daily bar chart of UAL, below, we can see that prices have formed a triangle-like pattern since early June with lower highs and higher lows. Triangles typically break out before reaching the apex, so we as traders should be on guard to jump in on the long side. UAL is above the bottoming 200-day moving average line and the declining 50-day line. The On-Balance-Volume (OBV) line shows an uptrend the past 12 months, so despite the sideways price action buyers of UAL have been more aggressive. The Moving Average Convergence Divergence (MACD) is about to turn up above the zero line for a fresh outright buy signal.\n\nIn this weekly bar chart of UAL, below, we can see that prices have been in sideways consolidation pattern the past year. UAL is above the flat to slightly rising 40-week moving average line. The weekly OBV line has been steady since last August and the MACD oscillator is in a bullish configuration above the zero line.\n\nIn this first Point and Figure chart of UAL, below, we can see an upside price target of $97.56, but also that a trade at $98.34 will be a more important upside breakout.\n\nIn this second Point and Figure chart of UAL, below, we can see a possible price target of $112.\n\nBottom line strategy: UAL looks ready to finally lift off to higher prices. Traders could go long UAL at current levels and risk a close below $83. Our price targets are $100 and $112.", "description": "United Airlines Holdings (UAL) shares may be ready to break out of their holding pattern, as buyers of the airline's stock have been more aggressive the last 12 months despite UAL's sideways pattern.....UAL", "authors": ["Bruce Kamich", "United Airlines Shares May Be Ready To Break Out Of Holding Pattern", "Despite Sideways Action In The Airline'S Shares", "Buyers Have Been More Aggressive The Last Months.", "Stocks Quotes In This Article", "Bret Jensen", "Jim Cramer", "Stephen Guilfoyle", "Bob Lang", "Carolyn Boroden"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/e27d65c8-9efe-11e7-be5b-eb576189f3b4.png", "published_at": "2019-10-16"}