{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-49764300", "downloaded_at": "2019-09-19 23:14:22.043685+00:00", "title": "US expels two Cuban diplomats to the UN in New York", "language": "en", "text": "Image copyright AFP/Getty Image caption All members of Cuba's UN mission are now restricted to Manhattan, a spokeswoman said\n\nThe US has expelled two Cuban diplomats to the UN in New York, accusing them of conducting \"activities harmful to US national security\", a State Department spokeswoman said.\n\nAll of Cuba's UN mission are now restricted to Manhattan where the UN is headquartered, Morgan Ortagus added.\n\nThe US has yet to provide details about the alleged actions.\n\nCuba's foreign minister Bruno Rodriguez called the move \"categorically unjustified\".\n\nMr Rodriguez tweeted (in Spanish) that the accusations were \"vulgar slander\", and said the expulsion has created tensions between the two countries.\n\nWorld leaders are set to gather for an annual meeting at the UN in just a few days.\n\nThese expulsions mark the most recent diplomatic confrontation between the US and the Communist state.\n\nIn July, Cuba dismissed a US academic study which found brain abnormalities in US diplomats who worked in the country.\n\nImage copyright Reuters Image caption US diplomats at the Havana embassy began complaining of dizziness, hearing loss and \"cognitive fog\" in 2016\n\nThe US has accused Cuba of conducting \"sonic attacks\", after several diplomats complained of unexplained symptoms including dizziness and hearing loss.\n\nPublished in the Journal of the American Medical Association, the research suggested that the brains of the envoys had less white matter.\n\nAcademics at the Cuban Neuroscience Center said the results were unclear. A Canadian study published on Thursday suggested neurotoxins in pesticides commonly sprayed in Cuba to tackle disease-carrying insects could be the cause.\n\nPresident Donald Trump has steadily increased US pressure on Cuba since taking office, changing tack from his predecessor's efforts to normalise relations with the Communist state.\n\nThe administration announced a new ban on US tour groups travelling to the Caribbean island nation in June.\n\nTreasury Secretary Steven Mnuchin said the restrictions would \"help to keep US dollars out of the hands of Cuban military, intelligence and security services\".", "description": "A State Department spokeswoman says the two engaged in \"activities harmful to US national security\".", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/7131/production/_108877982_tv056631794.jpg", "published_at": "2019-09-19"}