{"pub": "washingtonpost", "url": "https://washingtonpost.com/dc-md-va/2019/09/19/over-million-women-us-say-their-first-sexual-experience-was-rape", "downloaded_at": "2019-09-19 23:05:48.124916+00:00", "title": "Over 3 million women in U.S. say their first sexual experience was rape", "language": "en", "text": "\n\nThe first sexual experience for many U.S. women was forced or coerced intercourse in their early teens, encounters that for some may have had lasting health repercussions, according to a study. (Ted S. Warren/AP)\n\nOver 3.3 million women’s first sexual experience was rape, according to a new study of U.S. women ages 18 to 44, which also found that these incidents were associated with health effects later in life.\n\nThe findings, published this week in the Journal of the American Medical Association, found that 6.5 percent of women in the United States — or about 1 in 16 — experienced a sexual initiation that was forced or coerced. The average age they had this experience was around 15.\n\nThese women were less likely to be white and college-educated, and more likely to have incomes below the poverty level and to have been born outside the United States, than women who say their first sexual encounter was voluntary, the data showed.\n\nThe health implications were just as stark. The study found that the affected women were more likely to experience an unwanted first pregnancy, abortion, endometriosis and other reproductive health issues compared with women who reported having a voluntary first sexual experience.\n\nResearchers used data from the 2011-2017 National Survey of Family Growth and included a total of 13,310 women in the study. In that survey, women were asked whether their first experience of vaginal intercourse with a man was “voluntary” or “involuntary,” and the authors of the study focused on the latter. Because the data was nationally representative, the authors were able to extrapolate that an estimated 3,351,733 women ages 18 to 44 did not have a voluntary first sexual experience.\n\nAnd these staggering numbers may not actually encompass the full scope of American women who have experienced such assaults.\n\n“It’s quite alarming, and that’s just the tip of the iceberg because this study is only including women aged 18 to 44,” Laura Hawks, a research fellow at the Cambridge Health Alliance and the lead author of the study, told NPR. “You can imagine that if we asked this of women of all ages, the [absolute] number would be many millions higher.”\n\nThe survey period ended in September 2017 — just a month before reporting on alleged sexual predators such as Hollywood producer Harvey Weinstein ignited an international conversation about sexual assault, consent and coercion. “More women may feel more comfortable identifying their experiences of sexual violence today than they did just a few years ago,” Hawks said.\n\nIn a commentary on the study, Alison Huang of the University of California at San Francisco and Carolyn Gibson of the San Francisco Veterans Affairs Health Care System argued that the data was vital for a society moving toward a more comprehensive understanding of sexual assault and more effective care plans for patients.\n\nOne detail that stood out to Gibson, a psychologist, was the different ways in which women had been forced to submit to sex.\n\nAbout 46 percent of the women who had a coerced sexual experience reported being held down during the incident — but even more reported experiencing verbal pressure (56.4 percent) and coercion by a partner who was larger or older (50 percent).\n\n“The thing that really struck me about this paper was this idea that so [for] many of the women … it wasn’t a result of physical force, the stereotypical threats,” she said. “It was the results of verbal pressure, psychological pressure, threats to end relationship, coercion.”\n\nShe said this shows a need for a more nuanced understanding of sexual assault and its repercussions on “how you think about sex and intimacy, and how it affects relationships going forward in your life.”\n\nHuang found the study impressive but said future research needed to “document associations and really understand the mechanism by which an early forced event could lead to bad health outcomes in women.”\n\nIn an echo of Hawks’s comments on the lack of data on older women in this study, Huang hoped that future research would not only get a more comprehensive tally of women who had involuntary first sexual experiences but also help us better understand how this age group could be affected.\n\n“We don’t think of midlife and older women as sexual beings; we don’t think about how sexual events can affect them,” she said. “But these issues can have ramifications for the full life span of women.”\n\nRead more:\n\nBoy Scouts failed to stop hundreds of previously unreported sexual predators, a lawsuit alleges", "description": "A new study shows that for 6.5 percent of women ages 18 to 44, their first sexual experience was rape.", "authors": ["Kayla Epstein", "Embedded Audience Editor On The National Desk", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/CMzat6fA3dZTsrsTjPi-Ug9-QzM=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5FPHTSWYTMI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-19"}