{"pub": "yahoo", "url": "https://sports.yahoo.com/warriors-coach-steve-kerr-klay-143004931.html", "downloaded_at": "2019-10-22 16:02:28.134762+00:00", "title": "Warriors coach Steve Kerr: Klay Thompson unlikely to play this season", "language": "en", "text": "Warriors general manager Bob Myers and Klay Thompson himself both said Thompson would be out until at least the the All-Star break.\n\nGolden State coach Steve Kerr is putting an even longer timeline on Thompson’s recovery from a torn ACL.\n\nKerr, via Logan Murdock of NBC Sports:\n\nScroll to continue with content Ad\n\n“It’s unlikely that he’s going to play this year,” Steve Kerr recently told NBC Sports Bay Area in an exclusive interview that will air at 1 p.m. PT Tuesday in “NBA Season Tip-Off,” only on the MyTeams app. “So we have to understand that.”\n\n“You have to look at it realistically,” the Warriors coach said. “I had an ACL [tear] in college, and I missed a whole season. Generally, an ACL for a basketball player is a full-year recovery, and if it’s a full year for Klay, that puts them out for the season. “We’ve kind of left the door open in case the rehab goes perfectly and the doctors say he can go. But the reality is, on April 1, that’s the nine-month mark. … April versus nine months post-op for an ACL.\n\nI don’t know when Thompson will return. Kerr doesn’t know when Thompson will return, though Kerr has for information than me. Each injury recovery is unique, and Thompson will heal in his own time.\n\nStill, this is a FAR more reasonable expectation than most prognostications for Thompson. There was a lot of wishful thinking tied into the idea he’d return sooner, usually accompanied by a narrative about him sparking the Warriors to a deep playoff run with Stephen Curry and Draymond Green. ACL tears nearly always sideline players longer than that.\n\nStory continues\n\nMost teams also give high-end estimates for injury absences. That delays potentially distracting questions and makes the player look good if he returns sooner than the announced projection. Golden State might have learned its lesson after doing the opposite with Kevin Durant last postseason.\n\nBut this also sounds more realistic than anything previously coming from the Warriors about Thompson’s injury.", "description": "Warriors general manager Bob Myers and Klay Thompson himself both said Thompson would be out until at least the the All-Star break.", "authors": ["Dan Feldman"], "top_image": "https://s.yimg.com/ny/api/res/1.2/WaCQC3BmGztGQi9csAv3KA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTc5MjtoPTQ0OA--/https://s.yimg.com/uu/api/res/1.2/SoMcMyBGJseMCPaxX5tDIA--~B/aD0yMjQ7dz0zOTY7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/homerun/nbcsports.com/2f84caef93633f2bf1e4c3b1d89cac25", "published_at": "2019-10-22"}