{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/2019/10/15/video-appears-show-russian-soldiers-abandoned-us-base-syria", "downloaded_at": "2019-10-15 16:26:26.723751+00:00", "title": "U.S. troops abandoned their Syrian base. Video appears to show Russians have moved in.", "language": "en", "text": "The video, which was independently verified by news organization Storyful, showed multiple tents under camouflage netting and a radio mast that matched previous photographs of the U.S. base. In a separate video filmed half an hour later, Blokhin showed a motorized vehicle gate that contained prominent English writing.\n\nAD\n\nAD\n\nBlokhin later posted more photographs to the messaging service Telegram several hours later showing whiteboards with a Russian flag and messages referencing President Trump written on them in a mixture of Russian and English. It was not immediately clear who wrote the messages.\n\nA U.S. official said late Monday that U.S. troops had withdrawn from Manbij. Col. Myles B. Caggins III, a U.S. military spokesman, declined to say Tuesday whether Syrian troops or their Russian allies had entered Manbij.\n\nHowever, Syrian state television reported government troops had entered the town early the next day, and a Russian Defense Ministry statement said military police in northwestern Manbij were patrolling “along the line of contact between the Syrian Arab Republic and Turkey.”\n\nAD\n\nBlokhin is a journalist who works with pro-Kremlin media outlets such as the Abkhazian Network News Agency and appears to often embed with pro-Russian forces in Syria. He lists his place of birth as Odessa, Ukraine, on social media and his current home as Latakia, a port city in Syria that has remained under government control since the civil war started, and that is home to a Russian military base.\n\nAD", "description": "\"We are at the U.S. base in Manbij. Only yesterday morning they were still here and today we are here.\"", "authors": ["Adam Taylor", "Foreign Reporter Who Writes About A Variety Of Subjects", "Joyce Lee", "Video Editor"], "top_image": "https://www.washingtonpost.com/resizer/Ku4RZj0S1TLUiGRKJVH5XRucvlQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LUT5COXPGUI6TO362IBG5YGBTE.jpg", "published_at": "2019-10-15"}