{"pub": "realclearpolitics", "url": "https://tampabay.com/opinion/2019/10/23/two-steps-up-one-step-back-on-florida-voting-rights-editorial", "downloaded_at": "2019-10-24 13:57:07.236931+00:00", "title": "Two steps up, one step back on Florida voting rights | Editorial", "language": "en", "text": "The cause of justice in Florida went 2-for-3 over the past week as Gov. Ron DeSantis and a federal judge in Tallahassee embraced the restoration of rights of felons on two important fronts. Their words could shape new opportunities in the coming months to make it easier for felons to vote and to more fully participate in society. At the same time, state officials need to resolve an unforced error with their botched rollout of a new process for amending the Florida Constitution.\n\nU.S. District Judge Robert Hinkle got the ball rolling with his laudable ruling Friday that Florida must allow 17 felons to vote even if they can’t afford to pay the court-ordered fees, fines and restitution stemming from their case. The ruling marked the first significant crack against a new state statute lawmakers passed this year that requires felons in virtually all instances to repay these financial obligations in full before being allowed to register to vote. That new law undercuts the will of the voters and would prevent most of the felons the amendment was intended to help from automatically having their voting rights restored.\n\nHinkle’s ruling brings much needed common-sense and fairness to the Legislature’s mugging of Amendment 4, an historic constitutional revision supported by nearly two-thirds of Florida voters last year that was intended to automatically restore voting rights to most felons. The decision gives lawmakers a guide path in the coming legislative session for removing these financial barriers as a condition of voting. While the decision affects only the 17 plaintiffs in an Amendment 4 case that Hinkle set for trial in April, it offers clear guidance of what the courts see as the law’s core constitutional deficiency.\n\nThe Republican governor, to his credit, agreed with the ruling, will which put pressure on the Republican-led Legislature to come up with a practical fix when the session begins in January. The easiest would be a change to the state’s voter registration form that would allow felons to declare themselves as indigent. Another option would be allowing felons on payment plans to vote, a recognition that hundreds of thousands could be disenfranchised for life simply because they cannot afford to fully repay their obligations.\n\nDeSantis sent another encouraging signal this week, declaring he is willing to use his power as governor to enable nonviolent felons to serve on juries and run for elected office. The governor said he was “comfortable,” as the leader of the state’s Clemency Board, to advocate for expanding the rights for some felons beyond the right to vote as prescribed by Amendment 4. The move could open the door to re-integrating tens of thousands of felons more deeply in their communities and the democratic process. DeSantis is right that a broader range of civil rights for felons makes sense, and he should expand that view to include more felons who have completed their sentences.\n\nThe state also needs to fix its process for voters to amend the Florida Constitution. A top state official acknowledged Monday that a website for handling ballot initiatives was broken, leaving petition gatherers in a state of confusion with no solution in sight. This is the predictable result of the Legislature’s hasty overhaul of the petition process this year that was obviously aimed at frustrating citizen access to the ballot. With another election on the horizon, time is of the essence, and Republican lawmakers need to fix what they have broken.\n\nStill, this was an encouraging week. What matters now is follow-through.\n\nEditorials are the institutional voice of the Tampa Bay Times. The members of the Editorial Board are Times Chairman and CEO Paul Tash, Editor of Editorials Tim Nickens, and editorial writers Elizabeth Djinis, John Hill and Jim Verhulst. Follow @TBTimes_Opinion on Twitter for more opinion news", "description": "A federal judge and the governor send positive signals on restoring rights for felons. But the state has more work to do.", "authors": ["Tampa Bay Times Editorial Board"], "top_image": "https://www.tampabay.com/resizer/mGu0bx04WB-H126zi9aQr3DNy-k=/800x450/smart/arc-anglerfish-arc2-prod-tbt.s3.amazonaws.com/public/PHF3DKHLOUI6TLFLIBWI6S7HAY.jpg", "published_at": "2019-10-23"}