{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nba/2019/10/18/bucks-76ers-eye-east-title-with-leonard-back-in-the-west/40340607", "downloaded_at": "2019-10-19 11:14:15.727779+00:00", "title": "Bucks, 76ers eye East title with Leonard back in the West", "language": "en", "text": "Giannis Antetokounmpo and the Milwaukee Bucks were a couple wins from beating Toronto. The Philadelphia 76ers were maybe a couple bounces from doing it a round earlier.\n\nNeither team was good enough to finish the job last season, but both think this is their time after Kawhi Leonard went back to the Western Conference.\n\nThat left the NBA champions weakened and the Bucks and 76ers looking like the favorites to represent the East in the NBA Finals — where perhaps they'd have to deal with Leonard again.\n\nThe Bucks appeared headed there in 2018-19, right up until midway through the East finals. Milwaukee had the league's best record at 60-22, with Antetokounmpo eventually winning MVP and Mike Budenholzer the Coach of the Year. But the Bucks couldn't get another victory after taking a 2-0 lead over the Raptors, who won the next four games to reach the finals.\n\nThe Bucks think they addressed some of their weaknesses and are ready to take another run at it.\n\n\"I think everybody on this team wants to show that last year wasn't just, you know, a year by accident that we just won 60 games,\" Antetokounmpo said. \"I think we had a great team. We got better but obviously there's going to be a lot of teams that expect us. They know us now and they're going to play hard.\"\n\nIt took Leonard's shot that bounced on the rim four times before falling in at the buzzer in Game 7 to knock out Philadelphia in the second round. The 76ers come back with Al Horford and Josh Richardson but without Jimmy Butler or JJ Redick, hoping they've given coach Brett Brown the right mix around All-Stars Joel Embiid and Ben Simmons.\n\n\"We know what the expectations are and we embrace it. It's not just Brett, it's all of us,\" general manager Elton Brand said. \"We're in that position now where just getting to the first round, getting to the second round, those expectations are gone. We're expected to win big and we embrace it.\"\n\nLeonard went to the Los Angeles Clippers but the Raptors still have Marc Gasol and Pascal Siakam in their frontcourt that finally slowed down Antetokounmpo. He knows there will be many more teams gearing up to do the same starting next week.\n\n\"We've just got to be ready,\" he said. \"They're not going to give us nothing. We've got to go out there and take everything that we want and we've got to earn everything that we've got to earn this year.\"\n\nA look at the East, in predicted order of finish:\n\nPLAYOFF BOUND\n\n1. Milwaukee — By bringing in Kyle Korver and Wes Matthews, the Bucks have surrounded Antetokounmpo with even more shooting to space the floor.\n\n2. Philadelphia — Having Horford in Philadelphia removes one possible defender against Embiid.\n\n3. Toronto — Gasol, Siakam and Serge Ibaka still make up an imposing frontcourt even without Leonard.\n\n4. Boston — With Kemba Walker now in Kyrie Irving's former spot, the Celtics should have better chemistry even with a little less talent.\n\n5. Brooklyn — No Kevin Durant yet, but enough pieces around newcomer Irving to reach the postseason again.\n\n6. Orlando — Magic hope to pick up where they left off after a strong finish in 2018-19.\n\n7. Indiana — Will get Victor Oladipo back at some point, but losing Bojan Bogdanovic will hurt.\n\n8. Miami — Couldn't make a final playoff appearance in Dwyane Wade's last season in South Florida but could in Jimmy Butler's first.\n\n___\n\nIN THE MIX\n\n9. Detroit — Need to come up with enough shooting from the backcourt to complement Andre Drummond and Blake Griffin in the frontcourt.\n\n10. Atlanta — Hawks putting together good young core around one old player: 42-year-old Vince Carter.\n\n11. New York — Couldn't get any of the top free agents but signed enough veterans to improve last season's NBA-worst team.\n\n___\n\nFACING LONG ODDS\n\n12. Chicago — Bulls think they can make a leap but there's a long way to go after losing 60 games last season.\n\n13. Washington — Bradley Beal should put up big numbers — unless the Wizards trade him — but they won't often lead to wins.\n\n14. Cleveland — The development of Darius Garland could be key to John Beilein's transition to life as an NBA coach.\n\n15. Charlotte — Kemba Walker is gone and there's not much talent left behind in Charlotte.\n\n___\n\nWHAT TO KNOW\n\nJumping Off Point\n\nThe deciding factor in the East could be how much either Antetokounmpo or Simmons improves from the perimeter. Both have relied on their ability to get to the basket to overcome a weak jump shot, but both worked on their stroke over the summer and hit from 3-point range in the preseason.\n\nSidelined Stars\n\nAmong the injured East players missing some or possibly all of the season: Kevin Durant (Brooklyn), Victor Oladipo (Indiana) and John Wall (Washington).\n\nRecord-Setting Season\n\nCarter re-signed with Atlanta last month and will become the first player in NBA history to play 22 seasons.\n\nBack to Boston\n\nIrving originally said he planned to remain in Boston, but changed his mind and signed with Brooklyn after the Celtics' disappointing season. His first trip back is scheduled for Nov. 27 for a nationally televised game on the night before Thanksgiving.\n\nMake More Magic\n\nOrlando engineered a 17-win improvement last season, tops in the NBA, to finish 42-40 and reach the playoffs for the first time since 2012. The Magic, who went 22-9 down the stretch, brought back 12 of the 17 players who appeared in a game for them in 2018-19.\n\n___\n\nAP Sports Writer Dan Gelston in Philadelphia contributed to this report.\n\n___\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP_Sports\n\n___\n\nFollow Brian Mahoney on Twitter at https://twitter.com/briancmahoney\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Giannis Antetokounmpo and the Milwaukee Bucks were a couple wins from beating Toronto", "authors": ["Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/c5c284ffb6bc826d824930de56424805e23950aa/c=0-105-1894-1170/local/-/media/2019/10/19/USATODAY/usatsports/e8760e93717e4d5b9585334c487ea295.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-18"}