{"pub": "arynews", "url": "https://arysports.tv/smith-warner-make-t20-sri-lanka-pakistan-series", "downloaded_at": "2019-10-08 06:31:13.025482+00:00", "title": "Smith, Warner make T20 for Sri Lanka, Pakistan series", "language": "en", "text": "SYDNEY: Steve Smith and David Warner completed their return from the wilderness Tuesday when Australia recalled them to a 14-man Twenty20 squad to play Sri Lanka and Pakistan with a firm eye on next year’s World Cup.\n\nThe star batsmen were both banned for a year for their roles in a ball-tampering scandal but have returned to Australia’s Test, one-day and now Twenty20 sides.\n\n“We are delighted to welcome Steve Smith and David Warner back into the T20 international fold,” chief selector Trevor Hohns said.\n\n“Steve is a world-class batsman in all formats, while Warner is Australia’s highest ever T20I runs scorer. He was also the leading runs scorer at this year’s Indian Premier League with Sunrisers Hyderabad.”\n\nThe Twenty20 squad named Tuesday will face Sri Lanka and Pakistan in coming weeks but Hohns said the focus was firmly on next year’s World Cup, which will be held in Australia.\n\n“It is almost a year to the day until Australia hosts the men’s Twenty20 World Cup and we have selected this squad with that in mind,” he said.\n\n“We have looked to put a squad together that we think can take us through to that tournament.”\n\nDespite their success in other formats, Australia have never won a Twenty20 World Cup, with an appearance in the 2010 final their best showing.\n\nThey are currently ranked fifth in the world but will be desperate to succeed on home soil in October-November next year.\n\nAaron Finch retains the skipper’s armband, with wicketkeeper Alex Carey and paceman Pat Cummins sharing vice-captain duties.\n\nAshton Turner returns from a finger injury to bolster the batting, while Adam Zampa edged out Nathan Lyon as the preferred spinner.\n\nCummins and Mitchell Starc will likely open the bowling attack, backed up by Andrew Tye, Kane Richardson and Billy Stanlake.\n\nThe three-match series against Sri Lanka will begin in Adelaide on October 27, followed by another three Twenty20s against Pakistan opening on November 3 in Sydney.\n\nAustralia:\n\nAaron Finch (capt), Ashton Agar, Alex Carey, Pat Cummins, Glenn Maxwell, Ben McDermott, Kane Richardson, Steve Smith, Billy Stanlake, Mitchell Starc, Ashton Turner, Andrew Tye, David Warner, Adam Zampa.\n\nComments\n\ncomments", "description": "Steve Smith and David Warner completed their return from the wilderness Tuesday when Australia recalled them to a 14-man Twenty20 squad to play Sri Lanka and Pakistan with a firm eye on next year's World Cup.", "authors": [], "top_image": "https://arysports.tv/wp-content/uploads/2019/10/Steve-Smith-and-David-Warner.jpg", "published_at": "2019-10-08"}