{"pub": "townhall", "url": "https://finance.townhall.com/columnists/danieljmclaughlin/2019/02/20/rich-people-who-dont-shop-at-walmart-say-its-bad-for-poor-people-who-do-n2541919", "downloaded_at": "2019-09-20 08:15:58.940666+00:00", "title": "Rich People Who Don't Shop At Wal-Mart Say It's Bad For Poor People Who Do", "language": "en", "text": "I have heard numerous times how terrible Walmart is for paying its employees a low wage when Walton family members are billionaires. Surely they are paying dishonest wages and can afford to pay more. The further charge is that taxpayers, you and me, subsidize Walmart because many of their employees get government benefits available to low-income families. It is worthwhile looking at this, because this is not simply a Walmart issue and it is not new or unique to them.\n\nThe wealth of the Walton family primarily stems from the fact that they own the controlling interest of the company’s public stock, approximately fifty percent, which is not surprising, since a company founder typically retains enough stock to maintain control. A significant portion of the other half is owned by pension trusts, mutual funds, and the like. They buy stock in companies like Walmart because they are stable, well-run companies that will allow them to pay benefits when due, and that is a good thing.\n\nThe stock of Walmart, and many other companies like it, is valuable because they have developed a system that serves their target customers well at prices that earn a profit. The target customer for Walmart is working class families and the poor. It is a kind of cognitive dissonance that many of the people railing against Walmart are the same ones who don’t shop there because of the low-class image and supposed “trailer-trash” that they attract. Poor and working-class people go to Walmart because they can get what they need and want cheaper than they can elsewhere. They don’t care about the lack of Neiman Marcus flair.\n\nPart of the effective management of Walmart is the state-of-the-art inventory and logistics systems they have developed, as well as the third largest fleet of trucks in the United States to keep inventory moving. The complexity of the inventory and logistics systems keeps other things simple. Checkout clerks simply scan items and take payment. It is a repetitive, low skill type of labor, and, because of the nature of the business, Walmart employs a lot of them.\n\nA clerk or stock person employed by Walmart gets paid clerk and stock-person wages, similar to what they would be paid elsewhere. That shouldn’t be a surprise to anyone. When Walmart hires, it typically gets many more job applicants than there are jobs. People choose to work there. It is an entirely voluntary arrangement that every employee can sever, pretty much at will.\n\nEmployment is a market, just like everything else, and as such, it is absolutely subject to the dictates of supply and demand. Those jobs that are difficult or take a lot of time, dedication, and expense to qualify for tend to have a low supply of labor, and, because they contribute a great deal to profit, have a high demand relative to the supply. A high demand and low supply spells a high price, or wage in terms of employment.\n\nOn the opposite end, jobs that are easy to do, don’t require special skills or years of training, and have relatively pleasant and safe working conditions have a very large potential supply of workers. Almost everybody qualifies. The individual jobs contribute a small portion to profit, so demand is relatively limited compared to the supply. In this case, a large supply of labor relative to the demand for it means that the wages will be low. It has nothing to do with fairness or honesty.\n\nIf someone intends to make a long-term career of being a checkout clerk, at Walmart or anywhere else, that person needs to get used to the idea of earning a low wage. If someone intends, instead, to have a higher paying, more fulfilling career, he or she needs to take the steps necessary to become more valuable so the services provided are in higher demand. That means completing high school, more advanced education, apprenticing for a trade, learning how to sell effectively, or a host of other paths. Low wage jobs are first-rung jobs, something to get experience and build a success record and a future career on. If you are stuck in a low wage job, at Walmart or anywhere else, only you can unstick yourself, and it is your duty to yourself, your family, and society to do so.", "description": "I have heard numerous times how terrible Walmart is for .09/20/2019 4:16:02AM EST.", "authors": ["Daniel J. Mclaughlin", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/303/dcab0d07-abc7-42f0-849c-e0504c89dc62.jpg", "published_at": "2019-02-20"}