{"pub": "bbc", "url": "https://bbc.com/news/world-asia-50135152", "downloaded_at": "2019-10-23 08:32:49.747459+00:00", "title": "Kim Ji-young, Born 1982: Feminist film reignites tensions in South Korea", "language": "en", "text": "Image copyright Lotte Entertainment Image caption Actress Jung Yu-mi, who was cast as the lead, got thousands of hate comments on her Instagram in just a day\n\nA movie adaptation of the bestselling novel that triggered a fierce sexism battle in South Korea was released on Wednesday.\n\nThe novel, called Kim Ji-young, Born 1982 was published in 2016 and sold more than a million copies.\n\nIt tells the story of an ordinary 30-something Korean woman juggling work and family, and the gender discrimination she faces at each phase of her life.\n\nThe book was hailed by some as one of the most important feminist novels in Korean - but led to an outcry from anti-feminists in the country.\n\nAnd now, with the film's release, those arguments are being revisited.\n\nKim Ji-young is one of the most common Korean names of the generation, and thus represents any Korean woman.\n\nThe book, written by Cho Nam-joo, a television scriptwriter, tells her story from birth to motherhood from the perspective of her male psychiatrist.\n\nWhen she is born, into a typical patriarchal family, her mother apologises to her mother-in-law for having a girl.\n\nAs she goes to school, gets a job, gets married and has a baby, Ji-young faces deep-rooted gender discrimination at every stage.\n\nImage copyright Lotte Entertainment Image caption A scene from the movie\n\nAlthough South Korea is economically one of the most advanced countries in Asia, it remains socially conservative.\n\nSo much so, that female singers and actresses who said they read the book were attacked and bullied online.\n\nThose who criticise the book say it presents distorted views, is highly subjective, and makes negative, sexist generalisations against men.\n\nThe male characters, they say, are portrayed as either actively or passively endorsing a culture of discrimination against women. Critics also argue it aggravates gender conflicts.\n\nWhen the movie was first announced, those tensions were stoked again.\n\nActress Jung Yu-mi, who was cast as the lead, got thousands of hate comments on her Instagram in just a day; there was a petition asking the president not to allow the release of the movie; and people flocked to web portals to give bad ratings, even before the film was released.\n\n'Discrimination, exclusion and violence'\n\nAsked why the novel resonated so strongly with Korean women, Lee Na-young, sociology professor at Chung-Ang University in Seoul, told the BBC the \"timing [of the novel] was remarkable\".\n\nIt came out in autumn 2016. Months earlier, a young woman was murdered near Gangnam metro station in Seoul in a hate crime.\n\nThe murderer testified in court that \"he had been ignored by women a lot and couldn't bear it anymore so committed the crime\".\n\nThis incident - along with sexual violence accusations against key figures in literature and the entertainment industry - were considered by many as the key triggers behind the massive #metoo movement that took over the country in 2018.\n\n\"The book is not about someone special or a particularly miserable woman, but it's about any woman,\" Prof Lee said.\n\n\"It follows Kim Ji-young's life cycle and along the way one detects discrimination, exclusion and violence. And it hurts.\"\n\nProf Lee said the feminist movement in South Korea following the Gangnam murder was also led by \"regular women\".\n\n\"They're not women's rights activists but simply women who sympathise with the victim,\" she said.\n\n\"First they mourned for her. And then they identified with her, thinking they too are in danger [of such hate crime].\n\n\"And [then] they realised the correlation between the source of their fear and the discrimination they experience, and declared they won't just do nothing about it.\"\n\nImage copyright AFP Image caption Hundreds of South Korean women have spoken out against sexual abuse last year\n\nProf Lee said the book struck different chords with women of different age groups.\n\nKorean women in their 30s, like protagonist Kim Ji-young, were told they could do it all. So they grew up studying hard, working hard and playing hard. But reality set in as their careers progressed.\n\nWomen in South Korea earn only 63% of men's salaries - one of the highest pay gaps among developed nations. The Economist also ranks South Korea as the worst developed nation in which to be a working woman, in its glass ceiling index.\n\nIn September, Jeong Kab-yoon, a male conservative lawmaker, grilled a female candidate, Joh Sung-wook, in a confirmation hearing for the chair of the Fair Trade Commission.\n\nHe questioned why she had not married or had children - saying she failed to \"contribute to national development\".\n\nSkip Twitter post by @BBCLBicker In Seoul: confirmation hearing for Chairman of Fair Trade Commission a congressman said to candidate\n\n\n\n“ You’re still single, right? The biggest problem of our country is the low birth rate. You have a distinguished career but you should be responsible to your country too.” — Laura Bicker (@BBCLBicker) September 2, 2019 Report\n\nKim Ji-young, Born 1982 also highlighted the treatment women face when they do choose to have a baby.\n\nIn one scene, the protagonist spills coffee because of her baby in a coffee shop and people around her whisper to each other that she is a \"mum-roach\".\n\nThe term merges \"mum\" and \"cockroach\" and refers to mothers who lack manners in public spaces.\n\nIt was also around this time that some trendy cafes and restaurants designated themselves as \"no-kids zones\" to stave off these mothers.\n\nGlobal movement\n\nThe book became a bestseller in neighbouring Japan, China and Taiwan, according to South Korean publisher Minumsa. The publishing rights have been sold to 17 countries including UK, US, France, and Spain.\n\nJamie Chang, a professor at Ewha Womans University who translated the book for the UK market, said it was emotionally challenging work.\n\n\"There was a significant amount of internalised misogyny that I had to face up to in order to translate this book.\n\n\"I found myself constantly asking Kim Ji-young, 'why don't you speak up?' and 'why don't you say something?'\n\n\"I realised that Kim Ji-young's struggle comes from being told for a very long time that there is gender equality now and women can do what they want to do.\"\n\nImage copyright Julie Yoon Image caption Jamie Chang, who translated the book into English for UK edition\n\nChang said she believed the book would resonate with people in Western cultures.\n\n\"People around me said, 'the book is so Korean, what are foreign readers going to get out of it?'\n\n\"But I think we tell ourselves there are certain aspects of misogyny that is specific to Korea or Eastern culture and doesn't happen anywhere else in the world but that's not true.\n\n\"Primogeniture, preference of male… that's very common in Western culture, too.\"\n\nScrutiny intensifies\n\nIn the lead-up to the film release, female singers and actresses who supported the movie and the book were targeted.\n\nK-pop singer-actress Suzy \"liked\" an Instagram photo of an event related to the movie and the screen grab spread through online communities, with many hateful comments.\n\nImage copyright News1 Image caption The lead actors of the film were questioned about why they chose to take the parts\n\nIrene of the girl group Red Velvet said she had read the book at a fan meet-and-greet event. Her social media account was later flooded with insults.\n\nMale singers and actors have mentioned the book too - including RM of global K-pop sensations BTS - but they don't seem to face as much scrutiny as their female counterparts.\n\nFilm critic Hwang Jin Mi told Korean newspaper Hankook Ilbo that, to some observers, \"female celebrities reading the book means it's their way of testifying that they are the victims of gender inequality\".", "description": "The book was hailed as one of the most important feminist novels in Korean - but also led to outcry.", "authors": ["Hyung Eun Kim", "Bbc News Korean"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/179DC/production/_109323769_411e8865-2cf2-47fa-a169-90179f842122.jpg", "published_at": "2019-10-23"}