{"pub": "news24", "url": "https://news24.com/Green/News/watch-extinction-rebellion-climate-demonstrators-blocks-london-roads-20190416", "downloaded_at": "2019-10-26 00:09:31.691722+00:00", "title": "WATCH: 'Extinction Rebellion' climate demonstrators blocks London roads", "language": "en", "text": "Environmental protesters from the Extinction Rebellion group dance around a pink boat as they take part in a demonstration at Oxford Circues. (Daniel Leal-Olivas, AFP)\n\nClimate change protesters brought a bridge in London to a standstill on Monday and blocked major roads in the capital, kicking off days of planned civil disobedience events in cities around the world.\n\nMore than a thousand people blocked off Waterloo Bridge and laid out trees and potted plants along its length, in the protests organised by campaign group Extinction Rebellion.\n\nCampaigners also daubed graffiti and smashed windows at the UK offices of energy giant Royal Dutch Shell, spraying the Extinction Rebellion logo on the walls along with \"Shell kills\", \"shame\" and \"lies\".\n\nPolice officers detained suspects at the building while demonstrators held up a banner reading \"fossil fuels are killing us\" and placards saying \"wanted for ecocide\".\n\nExtinction Rebellion started in Britain five months ago with the aim of pressing governments and other institutions to declare a climate and ecological emergency.\n\nThey also want action to halt biodiversity loss, reduce greenhouse gas emissions to net zero by 2025 and be led by the decisions of new \"citizens' assemblies on climate and ecological justice\".\n\n\"The aim is to contribute to an escalating series of acts of civil disobedience which bring about change,\" said Larch Maxey, 46, a spokesperson for the movement.\n\n\"The plan is disruption and that disruption escalates until you get the attention of the people you are persuading to change,\" he said.\n\n'No planet B'\n\nOn Waterloo Bridge, demonstrators held up placards reading \"rebel for life\", \"we have no planet B\" and \"truth, disobey\", set up a skateboard ramp and marched back and forth across the bridge behind a group of drummers.\n\nPeople brought wheelbarrows with them and set up vegetarian food stalls, enjoying their lunch in the sunshine.\n\nMany families with children took part in the demonstration.\n\nRuby Brookman, 22, a volunteer in helping refugees, said: \"I'm here because our generation is going to be affected by this.\n\n\"I work with refugees and we saw people moving with climate change: Drought in East Africa a while ago, the recent hurricanes in Zimbabwe.\"\n\nOliver Paines, 68, from Cornwall, was part of a group of people who stripped off in the public gallery of parliament's House of Commons on April 1.\n\n\"We are farmers. Twenty years ago we saw the way farming was industrialised, destroying and damaging human life with pesticides,\" he said.\n\n\"Every day, we see evidence of the planet in crisis.\"\n\nProtesters also gathered in four other London sites: Parliament Square and the major city centre interchanges at Piccadilly Circus, Marble Arch and Oxford Circus, where people gathered around a pink boat.\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "Climate change protesters brought a bridge in London to a standstill and blocked major roads in the capital, kicking off days of planned civil disobedience events in cities around the world.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8748/95417bf1d337431ba8ede362cecccf5e.jpg", "published_at": "2019-04-16"}