{"pub": "telegraph", "url": "https://telegraph.co.uk/football/2019/10/18/biggest-difference-liverpool-manchester-united-jurgen-klopp", "downloaded_at": "2019-10-18 10:37:55.586190+00:00", "title": "The biggest difference between Liverpool and Manchester United? Jurgen Klopp", "language": "en", "text": "It was early in Jurgen Klopp’s first full season at Liverpool, just after the October international break, and he was preparing to face Manchester United.\n\nKlopp was hoping to celebrate his first anniversary in charge by going level with Manchester City at the top of the Premier League.\n\nInstead, Jose Mourinho secured a 0-0 draw by nullifying what he sarcastically described as \"the last wonder of the world\" - Liverpool’s attack.\n\nA forgettable game did not disguise the fact Liverpool were becoming a force again, heading in the right direction under their relatively new coach as he faced up to the first objective of Champions League qualification.\n\nExactly three years on Klopp is celebrating another anniversary in vastly different circumstances, this time taking on United to consolidate league leadership.\n\nNow it is the United manager seeking to re-establish his club’s status at the start of his first full season, his supporters desperately hunting for signs they can break back into the top four.\n\nSo much of the build-up to Sunday's encounter has focused on comparing the Liverpool and Manchester United of 2019. This is actually wrong and unfair on Ole Gunnar Solskjaer. His work should be compared to that of Klopp between 2015-16.", "description": "It was early in Jurgen Klopp’s first full season at Liverpool, just after the October international break, and he was preparing to face Manchester United.", "authors": ["Jamie Carragher"], "top_image": "https://www.telegraph.co.uk/content/dam/football/2019/10/18/TELEMMGLPICT000213383104-xlarge_trans_NvBQzQNjv4BqQl3YdX96GGHymuuHmeeMPOFSB14fu31SQAijRkpyu9U.jpeg?imwidth=1200", "published_at": "2019-10-18"}