{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/empty-mansion-up-for-sale-in-posh-london-neighborhood-208377", "downloaded_at": "2019-10-19 10:56:30.417145+00:00", "title": "Empty Mansion Up For Sale in Posh London Neighborhood", "language": "en", "text": "An empty London mansion in posh St. John’s Wood that is primed and ready for redevelopment hit the market last week.\n\n\n\nThe stucco-fronted home is being sold by informal tender with a guide price of £10 million (US$12.9 million) by estate agency Hamptons International.\n\n\n\nMore: Tommy Hilfiger Sells Plaza Hotel Penthouse to Auto Tycoon for $31.25 Million\n\n“Informal tender means that we run a campaign long enough to expose the property to the biggest audience and everyone will do their due diligence and bid on the last date unconditionally,” explained Andrew Phillips, global director of Hamptons Wealth Partnership—a division of Hamptons International—who is handling the sale.\n\n\n\nThe deadline is Nov. 8.\n\n\n\nIt gives potential buyers time to organize their bid and consult with their architects and builders, so it will be their very best offer, according to Mr. Phillips.\n\n\n\nInformal tender is rare, but not unheard of in the London market. “The best way to look at it is that it delivers what the market is prepared to pay,” he said.\n\n\n\nMansion Global could not determine who owns the property, which is currently configured as six apartments and is in “poor state of repair throughout,” according to the listing.\n\n\n\nFrom Penta: Former Mayfair Home of Aviation Tycoon Sir Frederick Handley Page Asks £18.75M\n\nBut planning permission is already in place to turn the residence into a luxury London spread more akin to its neighbors in the posh neighborhood popular with celebrities and affluent international buyers.\n\n\n\nThe planning includes permission for an extension and a basement area fitted with a home cinema, a wine room, gym and swimming pool, documents show.\n\n\n\nThough big changes are on the cards for the interior of the home, any work to the facade of the house—located within the St. John’s Wood Conservation Area—must match the original in terms of materials and finished appearance to keep with the character and appearance of the protected neighborhood.\n\n\n\nConstruction is likely to take a minimum of two years, but the result will be a “super luxury house,” Mr. Phillips said.\n\n", "description": "", "authors": ["Liz Lucking"], "top_image": "https://images.mansionglobal.com/im-118465?size=1.5005861664712778&width=1280", "published_at": "2019-10-18"}