{"pub": "breitbart", "url": "https://breitbart.com/2020-election/2019/10/23/house-republicans-storm-adam-schiffs-secret-impeachment-room", "downloaded_at": "2019-10-24 02:34:06.443468+00:00", "title": "House Republicans Storm Schiff's Secret Impeachment Room", "language": "en", "text": "About two dozen frustrated House Republicans on Wednesday stormed the secret room where House Intelligence Committee Chairman Adam Schiff (D-CA) has been running the closed-door impeachment inquiry.\n\nLed by House Judiciary Committee member Rep. Matt Gaetz (R-FL), the Republican lawmakers attempted to enter the room where Schiff has been bringing in current and former State Department officials to testify on whether President Trump withheld military aid from Ukraine in exchange for alleged help with the 2020 election.\n\n“Behind those doors they intend to overturn the results of an American presidential election. We want to know what is going on,” Gaetz said during a press conference beforehand.\n\n“We are going to try and go in there, and we’re going to try to figure out what is going on behalf of the millions of Americans that we represent, who want to see Congress working for them, and not obsessed with attacking a president who we believe has not done anything to deserve impeachment.”\n\nA senior Pentagon official working on Ukraine, Laura Cooper, was scheduled to testify, but due to restrictions set by House Speaker Nancy Pelosi (D-CA) and Schiff, members of the Armed Services Committee — which has oversight over the Pentagon — were not allowed to attend.\n\nHouse Armed Services Committee member and Green Beret Rep. Mike Waltz (R-FL) told reporters he has served in third world countries more transparent than the way Schiff was handling the impeachment inquiry.\n\nGreen Beret @RepMichaelWaltz slamming the secret impeachment inquiry this morning: \"I have fought from #Afghanistan to West Africa — I have operated in countries in third world countries who have fairer processes to deal with their elected leadership than what we see today.\" pic.twitter.com/a32jggQcVi — Kristina Wong 🇺🇸 (@kristina_wong) October 23, 2019\n\nHouse Foreign Affairs Commitee member Rep. Lee Zeldin (R-NY), who has attended every hearing, said by mid-day Wednesday, some Republican lawmakers were still inside the secret room, known as a Sensitive Compartmented Information Facility, or SCIF.\n\n“The members are still there,” Zeldin said. “We want to hear from this witness. But we want our colleagues to hear from this witness, too. Especially those members who are on the House Armed Services Committee. The person coming to testify is from the Department of Defense.”\n\n“This is more the jurisdiction of the House Armed Services Committee than it is than any of the other three committees [involved in the impeachment inquiry],” he said. “But we want the deposition to take place, but we don’t want it to be happening so much in secret that even most of Congress can’t even know what’s going on.”\n\nThe interviews of these officials have taken place out of the public’s view and in a classified compartment in the Capitol Hill basement. Republicans say there is no classified material being discussed, and it is not an intelligence matter, but the closed-door interviews have allowed Democrats to emerge from the basement bunker and selectively leak snippets of the interviews to reporters.\n\nPelosi took the handling of the impeachment inquiry away from House Judiciary Committee Chairman Jerry Nadler (D-NY), and gave it to the Intelligence, Foreign Affairs, and Oversight Committees, led by Schiff.\n\nAs a result, members of the House Judiciary Committee — which is in charge of drafting articles of impeachment — cannot attend the secret impeachment proceedings featuring former and current State Department officials secretly testifying on Ukraine.\n\nGaetz attempted to attend the impeachment hearings last week, but was forced to leave. Schiff is not sharing transcripts of the interviews with members of Congress yet either. He recently compared his secret proceedings to a grand jury, despite there being no crime involved.\n\nSchiff expressed concern with witnesses being able to compare stories, and Republicans being able to defend the president more effectively if the hearings are open and transparent to the public.\n\nLast week, 184 Republicans backed a bill to censure Schiff for his handling of the impeachment inquiry.\n\nFollow Breitbart News’ @Kristina_Wong.", "description": "House Republicans stormed the secret room where Schiff has been running the closed-door impeachment inquiry.", "authors": ["Kristina Wong"], "top_image": "https://media.breitbart.com/media/2019/10/Republican-Transparancy-News-Conference-640x335.jpg", "published_at": "2019-10-23"}