{"pub": "reuters", "url": "https://reuters.com/article/us-syria-security/russia-turkey-reach-deal-to-remove-kurdish-ypg-from-syria-border-idUSKBN1X10ZE", "downloaded_at": "2019-10-23 08:30:41.314047+00:00", "title": "Russia, Turkey reach deal to remove Kurdish YPG from Syria border", "language": "en", "text": "SOCHI, Russia/ANKARA (Reuters) - Syrian and Russian forces will deploy in northeast Syria to remove Kurdish YPG fighters and their weapons from the border with Turkey under a deal agreed on Tuesday which both Moscow and Ankara hailed as a triumph.\n\nHours after the deal was announced, the Turkish defense ministry said that the United States had told Turkey the withdrawal of Kurdish militants was complete from the “safe zone” Ankara demands in northern Syria.\n\nThere was no need to initiate another operation outside the current area of operation at this stage, the ministry said in a statement, effectively ending its military offensive that had begun on Oct. 9, drawing widespread criticism.\n\nThe agreement follows a U.S.-brokered truce which expired on Tuesday and underlines the dizzying changes in Syria since U.S. President Donald Trump announced the withdrawal of American troops two weeks ago ahead of Turkey’s cross-border offensive against the Kurds.\n\nThe Russia-Turkey agreement struck in the Black Sea resort of Sochi endorses the return of Syrian President Bashar al-Assad’s forces to the border alongside Russian troops, replacing the Americans who had patrolled the region for years with their former Kurdish allies.\n\nUnder the pact between Russian President Vladimir Putin and Turkish President Tayyip Erdogan, the two countries said Russian military police and Syrian border guards would start removing the YPG 30 km (19 miles) from the Turkish border on Wednesday.\n\nSix days later, Russian and Turkish forces will jointly start to patrol a narrower, 10 km strip of land in the “safe zone” that Ankara has long sought in northeast Syria.\n\nU.S. Vice President Mike Pence voiced support for the establishment of the safe zone.\n\n“We may well give the international community an opportunity to establish a safe zone between Turkey and the Kurdish population in Syria that will ensure peace and security,” Pence told a Heritage Foundation gala in Washington.\n\nEarlier on Tuesday, Jim Jeffrey, the senior U.S. diplomat on Syria, dismissed the Sochi deal and questioned whether the Russians could get the YPG to leave the territory it covers.\n\n“It’s full of holes,” he told a congressional hearing. “All I know it will stop the Turks from moving forward. Whether the Russians will ever live up to their commitment, which is very vague, to ... get the YPG out of their areas, I don’t know.”\n\nPUTIN CALLS DEAL ‘MOMENTOUS’\n\nAfter six hours of talks with Erdogan in Sochi, Putin expressed satisfaction at decisions he described as “very important, if not momentous, to resolve what is a pretty tense situation which has developed on the Syrian-Turkish border”.\n\nA senior Turkish official described it as an “excellent” deal which would achieve Turkey’s long-held goal of a border strip cleared of the YPG, which Ankara regards as a terrorist organization because of its links to insurgents inside Turkey.\n\nTurkey-backed Syrian rebel fighters gesture as they ride on a vehicle near the border town of Tal Abyad, Syria, October 22, 2019. REUTERS/Khalil Ashawi TP\n\nLast week’s U.S.-brokered deal was limited to the central part of the border strip between the Syrian towns of Tel Abyad and Ras al Ain, where Turkish forces had focused their military offensive.\n\nUnder the deal with Moscow, the length of border which the YPG would be required to pull back from is more than triple the size of the territory covered by the U.S.-Turkish accord, covering most of the area Turkey had wanted to include.\n\n“The outcome of the Putin-Erdogan meeting in Sochi today indicates that Erdogan has become a master of leveraging the U.S. and Russia against each other to maximize Ankara’s gains,” Soner Cagaptay, director of the Turkish program at the Washington Institute said in a tweet.\n\n“Turkey got the safe zone it wanted all this time.”\n\nSome 300,000 people have been displaced by Turkey’s offensive and 120 civilians have been killed, according to the Syrian Observatory for Human Rights, a UK-based war monitor. It said on Sunday 259 fighters with the Kurdish-led forces had been killed, and 196 Turkey-backed Syrian rebels. Turkey says 765 terrorists but no civilians have been killed in its offensive.\n\nPence received a letter from Kurdish-led Syrian Democratic Forces (SDF) commander Mazloum Kobani on Tuesday saying their forces had withdrawn “from the relevant area of operations” under that deal, Pence’s spokeswoman Katie Waldman said.\n\nHowever, before flying to Russia Erdogan had said hundreds of Kurdish fighters remained near to Syria’s northeast border despite the truce demanding their withdrawal. Earlier he had said the fighting might resume if promises by Washington were not kept.\n\nThe U.S. withdrawal from northern Syria has been criticized by U.S. lawmakers, including some of Trump’s fellow Republicans, as a betrayal of Kurdish allies who have helped the United States fight Islamic State in Syria.\n\nSlideshow (4 Images)\n\nTurkey sought a “safe zone” along 440 km (275 miles) of border with northeast Syria, but its assault focused on the two border towns in the center of that strip, Ras al Ain and Tel Abyad.\n\nSyrian and Russian forces have already entered two border cities, Manbij and Kobani, which lie within Turkey’s planned “safe zone” but to the west of Turkey’s military operations.\n\nErdogan has said he could accept the presence of Syrian troops in those areas, as long as the YPG are pushed out.\n\nRussia is an ally of Assad. Turkey has backed rebels seeking to oust Assad during Syria’s more than eight-year-long civil war but has dropped its once frequent calls for him to quit.", "description": "Syrian and Russian forces will deploy in northeast Syria to remove Kurdish YPG fighters and their weapons from the border with Turkey under a deal agreed on Tuesday which both Moscow and Ankara hailed as a triumph.", "authors": ["Darya Korsunskaya", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191023&t=2&i=1443985771&w=1200&r=LYNXMPEF9M08U", "published_at": "2019-10-23"}