{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/07/hiker-killed-after-falling-feet-half-dome-cables-yosemite", "downloaded_at": "2019-09-08 11:39:48.333390+00:00", "title": "Hiker killed after falling 500 feet from Half Dome cables in Yosemite", "language": "en", "text": "The iconic Half Dome in Yosemite National Park has loomed large in the national imagination since American settlers began exploring the park in the middle of the 19th-century. Every year, thousands of hikers seek to summit the 8,800-foot, crescent-shaped granite formation that offers one of the most spectacular panoramic views in the country.\n\nBut Half Dome can be deadly.\n\nOn Thursday morning, an Arizona woman died after falling 500 feet down steep, rocky terrain on a segment of Half Dome that requires hikers to cling to cables for stability, according to Yosemite spokesman Scott Gediman. The woman was identified as 29-year old Danielle Burnett of Lake Havasu City, Ariz.\n\nBurnett was dead when emergency officials found her, Gediman said, and park officials are investigating the accident.\n\nThe popular hike, considered the “most iconic attraction in all of Yosemite Valley” according to the park’s website, requires a lottery-distributed permit to climb to the top. But despite its massive appeal, it requires experience to successfully summit. The Half Dome trail traverses 17 miles and gains 4,800 feet in elevation, and ends in a daunting climb to the summit during which hikers must use cables to ascend safely.\n\nThe park warns that the route is “not suitable for novice or unfit hikers” and that several visitors must be rescued each year, many due to dehydration and lack of preparation.\n\nPhotos from Burnett’s Facebook page show her hiking and exploring the outdoors. On Friday, her sister Nichole Burnett posted an image of Danielle in a baseball cap and a striped tee, perched on a rock formation on a beautiful day.\n\nIt’s with a broken heart to inform you all that our beautiful Danielle left us yesterday doing something she loved so... Posted by Nichole Lee Burnett on Friday, September 6, 2019\n\n“Danielle left us yesterday doing something she loved so much,” Nichole Burnett wrote. “This will take time. Thank you for understanding.”\n\nBurnett is not the first climber to suffer a fatal accident on Half Dome, or in Yosemite. Another climber slipped and fell to his death on the Half Dome cables in May 2018 when a thunderstorm created treacherous conditions.\n\nIn June, Patricia Stoops, a 57-year-old teacher’s aide, died while scaling the Central Pillar of Frenzy, the Modesto Bee reported. In August, a 21-year-old Romanian tourist died after plummeting from Bridalveil Falls.\n\nMore than 100 climbing accidents occur in Yosemite each year, and park officials urge hikers to bring necessary supplies and stay on park trails for their safety.\n\nA previous version of this story provided the incorrect height of Half Dome. The full elevation of Half Dome is 8,839 feet above sea level, but the elevation gain during the hike up to half dome is 4,800 feet, according to Yosemite’s website.\n\nRead more:\n\nPerspective: On the trail, looking for traces of my dad\n\nSunlight makes this Yosemite waterfall look like lava — and the photos are mesmerizing\n\nYosemite sets new wildlife protection zones for motorists", "description": "Danielle Burnett, 29, fell while ascending the cables leading to Half Dome's summit.", "authors": ["Kayla Epstein", "Embedded Audience Editor On The National Desk", "September At Am", "Kayla Epstein Is The Social Media Editor For National At The Washington Post. She Specializes In Blending Traditional Reporting", "Social Media To Tell Stories", "Engage Readers. She Previously Worked For The Guardian Us", "Where She Worked In Support Of The Pulitzer Prize-Winning Team That Broke The National Security Agency Stories."], "top_image": "https://www.washingtonpost.com/resizer/vgqTyKV4bpuClCOWRlOXJlxfFIU=/1484x0/d1i4t8bqe7zgj6.cloudfront.net/09-07-2019/t_91bed05f49f549fc85677f2dc5fba4b8_name_20190907_Half_Dome_yosemite_still_1.jpg", "published_at": "2019-09-07"}