{"pub": "yahoo", "url": "https://sports.yahoo.com/week-4-daily-fantasy-football-cheatsheet-a-last-hurrah-for-austin-ekeler-190243059.html", "downloaded_at": "2019-09-27 00:03:47.135656+00:00", "title": "Week 4 Daily Fantasy Football cheatsheet: A last hurrah for Austin Ekeler?", "language": "en", "text": "Week 4 of the 2019 Fantasy Football season is here, and our six experts have revealed who they would choose in their Yahoo Daily Fantasy lineups using a budget of $200. The ultimate goal: To build the perfect lineup.\n\n[Play in Yahoo’s NFL $400K Baller. $10 entry fee and $50K to first place]\n\nOur “Fantasy Football Live” crew is doing a guru challenge again this season. Watch the show all season to see who comes out on top.\n\nScroll to continue with content Ad\n\nAfter news broke that Melvin Gordon was ending his holdout and making his return to the Chargers, panic ensued among many fantasy gamers who have been enjoying the services of Austin Ekeler. Now, with Flash back, Ekeler won’t be reduced to nothing, but a reduced role could be in the cards.\n\nNot this week, though. Ekeler gets to enjoy the sieve-like defense of the Miami Dolphins, and our experts like his chances (among others like Alvin Kamara, Sterling Shepard, and Will Dissly) for a big game in Week 4:\n\nOur experts reveal their most optimal DFS lineups for Week 4.\n\nWhat do you think of their squads? Let us know who you would choose in the comments and @YahooFantasy !", "description": "Ready to set your daily fantasy lineups for Week 4? Our experts reveal their most optimal DFS lineups — feel free to cheat off them!", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/H4L9NwnYBa5LYmAHm649cQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/zA1LhabjQRrE2Nr1GGYFxw--~B/aD0zNDU2O3c9NTE4NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/4af69cb0-e08c-11e9-bfdf-5ff5ba4cdc3f", "published_at": "2019-09-26"}