{"pub": "euronews", "url": "https://euronews.com/living/2019/10/18/welcome-to-the-dark-side-shein-is-the-biggest-rip-off-since-fast-fashion-was-born", "downloaded_at": "2019-10-18 08:52:36.076814+00:00", "title": "Welcome to the dark side: Why Shein is the biggest rip-off since fast fashion was born", "language": "en", "text": "Colleagues and friends had warned me “you won’t receive all your orders at once, and some of the packages may get lost in the mail.” Apparently, it’s common knowledge that buying from online retailer Shein is always a gamble. But who cares, when you pay less than £20 for a dress, right?\n\nWrong. One evening in September as I was endlessly scrolling the internet in search of the perfect outfit to wear at a wedding, I accidently ended up on Shein. Weird, as I don’t usually browse on fast fashion sites, but this time they found me, through the beauty of targeted Facebook ads. At first, I couldn’t believe it. The prices were ludicrous - £8.99 for a blouse, £9.99 for a maxi dress, £22.99 for a coat…the list goes on.\n\nFrom the pictures everything looked perfect. Beautifully shot looks with that trendy detail or a particular shade seen on all the biggest Instagram influencers this season. Strangely, the quality of the garment didn’t seem so dubious either - to put it bluntly, it didn’t look cheap. Shein had succeeded in giving me the illusion of having found the holy grail of online shopping.\n\nShein clothing and ‘fashion bloggers’\n\nShein describes itself as “an international B2C fast fashion e-commerce platform (that) focuses on women's wear, but also offers men's apparel, children's clothes, accessories, shoes, bags and other fashion items” and it upholds the philosophy that \"everyone can enjoy the beauty of fashion.\"\n\nOverall, Shein (previously She Inside) is a complete mystery. No phone number, no email and certainly no press contact was to be found online. Even the name of its founder remains a total enigma, as El Mundo reports. This seemingly opaque company relies mostly on digital marketing and bloggers to get you hooked on their products, rather than divulging anything about their supply chain transparently. The US website runs a “fashion blogger program” to fuel its huge popularity on social media (7.4 million followers on Instagram alone).\n\n“Do you want clothings (sic) absolutely for FREE? Are you looking for long term sponsorship?” they ask, in bad grammar. “Then don’t hesitate to send us an email to introduce your thought about fashion, your blog website or youtube channel for us. You may get free clothing that is worth US$40 to US$200 every month!” Shein promises.\n\nThe stores are about to pop up near you\n\nHaving been around for eight years, the brand has now reached such a level of fame it is promoted by celebrities like American actress Madelaine Petsch, from Netflix series Riverdale, who boasts over 16 million followers on Instagram. She recently shared a beautifully shot video in which she is pictured walking around a luxurious countryside estate wearing a series of Shein summer looks. The video has 1.3 million views as I write this.\n\nLast month, Shein launched a pop-up shop in Paris, widely applauded by the local press. Paulette magazine and Cosmopolitan both wrote praiseworthy reviews celebrating the brand as a ‘size inclusive label’ (Shein caters up to 4XL) offering fashionable garments for less. A reputation the retailer has been polishing for months by opening pop-up stores in other French cities like Lyon, Bordeaux and Marseille.\n\nIndependent voices in the French media such as Adaptation Magazine offer another point of view, calling the brand ‘old fashioned” and confronting its marketing strategy based on 100% visual appeal. In her article titled “Why we will never buy from Shein?”, fashion journalist, consultant and blogger, Estelle Surbranche calls out fashion influencers endorsing the brand on social media and attending its fashion show in Paris. The professionally orchestrated event took place on October 3rd during Fashion Week and is available to watch on their website.\n\nWait, what? A Shein fashion show.\n\nTo be frank, as I watched the show online I wondered if I was going mad. Was this really the same Shein I bought from a month ago? Are these clothes for real? Back when I was looking for that special party dress, I ended up purchasing a bunch of pretty underwear from Shein - as is usually the case when you end up window shopping on the web. There are no words to describe how ill-fitting and poor quality the items were when they arrived. My first impulse was to throw all of them away, which says a lot for someone like me who is conscious of living a low waste lifestyle. But that’s where Shein’s clothing belong: in the bin. In fact, they should have never been made in the first place.\n\nEuronews Living journalist Rachel Graham tells me how she recalls buying a pair of striped trousers one summer: “When my packaged first arrived, I thought I had accidentally bought from a fraudulent duplicate website. The trousers came unhemmed, uncomfortably cheap and vaguely close to the beautiful pictures they rope me in with. The pattern on the waistband was so ill-aligned, it looked like an outfit of two parts.” she describes.\n\nCountless other customers warn about the disappointment of splurging at Shein on forums. 43% of people rank the brand as ‘bad’ on Trust Pilot, with extremely angry comments counterbalancing tame positive opinions. Watching this Youtuber’s video is perhaps the best way to make up your own mind. Here she sums up what you can expect.\n\nIf you buy clothes to throw them in the trash after one use (let’s say to post a picture on social media), are not concerned with the zipper arriving broken, don’t care about a badly sewn garment and spend your hard-earned money on cheap stuff you don’t value, then this brand is definitely the right choice for you.\n\nWho made my clothes?\n\nBesides the obvious low quality and virgin oil-based textiles used - everything is made with polyester, nylon and other synthetic fabrics - the main question is, who is making Shein clothing and how much are they paid? Our guess is not much. The fact that the Chinese brand also copies independent designers is also public knowledge, as Jezebel reports.\n\nFast fashion is under a lot of fire. Last June, Missguided launched the £1 bikini prompting Fashion Revolution to publish this statement: “Cheap prices make us believe they bring about savings for consumers. This may appear true in the short term, with a narrow focus and looking just at the money in our wallets, but all of us, as global citizens, will ultimately end up paying the external cost, the true cost for the unsustainable consumption and production of cheap clothing.”\n\n(...) “This is why, when garments are priced as cheaply as single-use items, it implies that our clothing is disposable. And if we buy that message, we are buying into a very ugly side of fashion.” they add.\n\n\"Everyone can enjoy the beauty of fashion\" says Shein.\n\nYes that may be true, as long as you don’t buy from them.", "description": "We expose the truth behind the Chinese online fashion giant.", "authors": ["Ines Fressynet"], "top_image": "https://static.euronews.com/articles/stories/04/23/32/98/1000x563_cmsv2_7f448ba4-2051-523c-a2db-ad46716b684c-4233298.jpg", "published_at": "2019-10-18"}