{"pub": "cbc", "url": "https://cbc.ca/life/home/winter-car-prep-a-mechanic-s-advice-on-getting-your-vehicle-ready-for-the-upcoming-polar-coaster-1.5304900", "downloaded_at": "2019-10-02 00:33:02.828183+00:00", "title": "CBC Life", "language": "en", "text": "RIN-NIN-NIN-NIN! That's an all-too familiar sound for many drivers used to Canadian winters. And it's not just engines dying — winter car concerns range from frozen windows and getting stuck in snowbanks to driving in treacherous conditions like freezing rain and snow squalls, or on black icy roads. It all sends a literal shiver down the average driver's spine.\n\nOh, and it looks like this winter will be even more harsh than usual. The Farmer's Almanac has coined it the \"polar coaster\", with Canadian conditions seeing a -40C dip over the Prairies, heavy snowfall and strong winds across the Great Lakes, and an excruciatingly slow start to spring. These predictions have us turning to cold weather car hacks and safe winter driving tips, as well as thinking about what kind of vehicle maintenance can be done now, while it's still warm in most parts of the country. We reached out to an Ontario mechanic Nelson Ponte of Certified Auto Repair to give us a tune-up on how to help our cars survive our coldest season.\n\nYour vehicle's pre-winter prep checklist\n\n\"There is definitely a 'winter checklist' that you should have done to your vehicle prior to the cold weather,\" says Ponte. He says that making sure the essentials are in working order is the best preventative measure against the potential harms of winter conditions.\n\nPonte suggests the first order of business is: \"making sure you have good winter tires, with tire pressures properly inflated and balanced.\" Next, Ponte says, \"Have your car battery tested, making sure the contacts are clean.\" Check all of your vehicle's fluids, topping off any that are low and replacing any that are \"suspect or dirty\". He also says you need to make sure your windshield wiper system is working properly, including the wiper blades and washer jets, and to make sure that the washer tank has no leaks.\n\nTo prevent freezing of the exterior, Ponte says, \"You should also apply a lubricant or lubricating-compound to all doors, latches and locks\". Ponte notes it's also a wise idea to install all winter mats well before the first snow hits so as to avoid any chance of snowy boots making a mess of the interior.\n\nAs for accessories and supplies, Ponte says items like a blanket, a candle and booster cables should always be in your trunk, along with \"a small shovel, if possible and, if room allows, a small bag of melting salt. I typically carry a very small tool bag with very basic tools in there, and some emergency equipment such as blankets, flares and reflective triangles.\" Also in your trunk, Ponte says you should \"make sure your spare tire is full, if your car does have one, and make sure your tools are in their place for tire replacement, if needed.\"\n\n\"And, of course,\" cautions Ponte, \"you should have your vehicle inspected before the snow starts to fall — making sure that your suspension, brakes, lighting, etc. are all up to snuff.\" If you routinely have general maintenance tune-ups with your mechanic, it would be wise to schedule one now, to catch any emerging issues and know the status of any items that will eventually need replacing.\n\nWhen should I put on my winter tires?\n\nYou don't want to get caught in the snow without any treads, but you also don't want to put on your winter tires if there's no need to. \"The best time to install your winter tires is typically when the temperature is below 7C and before the first snowfall,\" says Ponte, \"I recommend winter tires to be installed mid-October to avoid the rush, but realistically, up until early November is still a good time.\"\n\nDo you really need to let your engine run for a bit before driving?\n\nWhether you have a remote starter or just run outside in your pyjamas, it's a common belief that it's good to let your car \"warm up\" in the winter before driving - but is it necessary? \"Today's newer vehicles don't really require engines to warm up,\" explains Ponte, \"However, my rule of thumb is: let the vehicle idle for 30 seconds before you drive away. You can also let the car idle for 3 to 4 minutes to get a little bit of warmth in the car before you start driving, but there really is no reason for that other than comfort.\"\n\nWhat if it's extremely cold?\n\nWhile there are certain protocols for general winter weather, does any of that change when it's going to be this cold? No matter what level of cold, Ponte firmly believes that, if you're car is properly maintained with quality care and parts, \"there should be no difference as far as how cold it is.\"\n\nDriving and handling tips\n\nPonte also passed along some tips from his experience with winter driving and preparedness. \"For starters, always give yourself and the car in front of you enough space,\" Ponte says, \"in case you need to suddenly break or you feel your vehicle sliding.\" Ponte also passed strongly suggests you follow the common rule of giving yourself extra time to drive somewhere. \"Even 30 minutes extra, so you're not speeding and racing down the road, so you can arrive safely. Keep in mind, you're the one in a hurry, but you're also putting everyone else around you in jeopardy if you're going to be driving dangerously fast.\" Lastly, Ponte urges, \"If you are not comfortable driving in the winter, I highly recommend you do not drive. There are a lot of overly cautious drivers who eventually get themselves into trouble or can create accidents.\"\n\nHow should I store my summer car?\n\nWhether they're custom, vintage or just plain expensive, some cars are not made for the winter weather. In addition to not driving it, how you store such vehicles during these months can impact their condition. \"There are many myths and opinions on how you should properly store your summer car,\" Ponte says. \"I can tell you from experience that the best way to do it is to store it in a heated, dry location, preferably in a garage, the basement of a building or wherever you can find a place\". Storing such a vehicle outside wreaks havoc on it's metal, so keep it indoors, even if you have to rent a space outside of your home. Another important step is to place \"flat pieces of plywood under each tire, basically driving over all four of them,\" says Ponte, separating your tires from the asphalt and \"helping your ties stay true and round, avoiding any steel belts from shifting.\" The most essential storage tip is having a proper, dedicated car cover. \"You should not tarp your vehicle, as a tarp doesn't allow air to pass through — it basically will trap water and we all know sitting water isn't good on metal,\" Ponte explains. \"It's worth the investment [to get a proper car cover]. It keeps debris off the vehicle's paint, makes the paint last longer and will dry if it gets wet.\"\n\n\n\nDo you have any winter driving tips or questions? Park them in our comments and let us know.", "description": "The cold weather checklist to start working through now.", "authors": [], "top_image": "https://i.cbc.ca/1.5304926.1569962922!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/winter-car-care-cbc-life-2019.jpg", "published_at": "2019-10-01"}