{"pub": "fox", "url": "https://foxnews.com/health/florida-boy-5-battling-aggressive-brain-cancer-gets-to-patrol-with-coast-guard-police", "downloaded_at": "2019-10-17 05:16:48.727591+00:00", "title": "Florida boy, 5, battling aggressive brain cancer gets to patrol with Coast Guard, police", "language": "en", "text": "A 5-year-old Florida boy who is battling an aggressive form of brain cancer got to live his dream last week when the Coast Guard, Customs and Border Protection (CBP) and several local law enforcement teams joined forces so he could be an honorary marine officer and go on a ride with the military branch.\n\nGiovanni Bacon has only months -- perhaps weeks -- to live, his mother, Veronica Koors, told WPTV West Palm Beach on Thursday.\n\nHer son was found to have anaplastic ependymoma stage 4 brain cancer when he was 2 years old, and it spread to his spine, according to WPTV. He has undergone seven brain operations and 66 rounds of radiation, Koors told the news station; chemotherapy stopped working, so she stopped his treatment.\n\n\"I just want Giovanni to be happy. That's all I want,\" said Koors, who is expecting her third child.\n\nGiovanni said he wanted to spend a day with the professionals who protect South Florida's coastal waters, according to CBP.\n\nThe Coast Guard and Air and Marine Operations West Palm Beach Marine Unit teamed up with several at least a half dozen local law enforcement teams to give Giovanni a tour around the Intracoastal Waterway and the Atlantic Ocean on Oct. 9. More than a half-dozen vessels participated in the joint patrol, CBP said.\n\n“We are a part of communities across the state of Florida, and it is a privilege and an honor that Air and Marine Operations had an opportunity to participate alongside Homeland Security partners,” said Hector Rojas, deputy director of marine operations at the Miami Air and Marine Branch. \"Boosting the spirits of this young boy with dozens of community partners is just another reminder that Air and Marine Operations is a federal law enforcement organization dedicated to serving and protecting the American people.\"\n\nFLORIDA BOY, 12, WITH FAILING HEART SCORES TOUCHDOWN: 'THIS WAS SO MUCH BIGGER THAN FOOTBALL'\n\nIn addition to the Coast Guard and Border Protection, the Florida Fish and Wildlife Conservation Commission (FWC), the Palm Beach County Sheriff's Office and police departments from Boynton Beach, Jupiter, Palm Beach, North Palm Beach, West Palm Beach, Riviera Beach and Tequesta came together to help make Giovanni's dream a reality, according to WPTV.\n\n“The extraordinary courage and strength displayed by this boy facing brain cancer is something for us all to admire,\" said Miami Air and Marine Branch Director Martin Wade. “The spirit of service and the outpouring of support is a testament to the teams of teams that work together safeguarding the homeland every day.”\n\n\"I would never wish this on anyone ever,\" Koors told WPTV. \"That’s my first-born baby and I need him. I need a miracle.\"\n\n\"I trust God's plan for my son, and I just go with that. I want everyone in the whole entire universe to pray for my son.\"\n\nCLICK HERE TO GET THE FOX NEWS APP", "description": "A 5-year-old Florida boy who is battling aggressive brain cancer got to live his dream last week when the Coast Guard, U.S. Customs and Border Protection (CBP) and several local law enforcement teams joined forces to make his wish come true -- become an honorary marine officer and go on a ride with the Coast Guard.", "authors": ["Melissa Leon", "Melissa Leon Is A Reporter For Foxnews.Com. She Can Be Found On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Florida-Boy-1-CBP.jpg", "published_at": "2019-10-17"}