{"pub": "nymag", "url": "https://vulture.com/2019/10/theater-review-ross-golans-the-wrong-man-with-josh-henry.html", "downloaded_at": "2019-10-10 02:45:50.476969+00:00", "title": "Theater Review: A Pop-Song Master Delivers The Wrong Man", "language": "en", "text": "From The Wrong Man, at MCC. Photo: Matthew Murphy\n\n‘They say all kinds of clichés here, like ‘what happens here stays here,’” Josh Henry sings early on in The Wrong Man. In the pop-hit-songwriting machine Ross Golan’s concept album turned stage musical, directed by Thomas Kail of Hamilton and In The Heights fame, the same line could double as a TL;DR review of the show. Well … at least the first clause. They do say a lot of clichés here, if here is the Newman Mills Theater, home to the story of an unjustly incarcerated man who was “at the wrong place at the wrong time,” and who wants you to understand what it’s like to be “in my shoes,” fighting an “eye-for-an-eye” justice system. What happens here, however, doesn’t stay here — it gets reviewed on Vulture.\n\nThe wrong man himself is Duran, a middle-aged middle manager in Reno who fled a rough childhood in search of something better. Which, he’d thought, was penny-pinching though life with his girlfriend and her two kids, until she left him heartbroken. It’s the kind of sadness best cured by a bender in a local bar followed by a hookup with Mariana. Weeks later, Mariana tells Duran she’s pregnant and advises him to skip town as her criminal ex-boyfriend is out for blood. Instead, the ex kills Mariana and a stranger, setting Duran up to take the fall for both murders. Duran is, as he reminds the audience with increasing desperation during his trial and his final days on death row, the wrong man. “I did not shoot a man in Reno just to watch him die,” he sings at one point, an eye-roller of a line around which it suddenly seemed possible the whole show was written.\n\nHenry imbues Duran with everything he’s got: sweat, tears, and a powerhouse voice that brings down the house, song after song. The man could belt the phone book and make you feel things about it. But that formula gets tedious, and packing in so many eleven-o’clock numbers diminishes their impact. Golan has written for Selena Gomez, Ariana Grande, and Justin Bieber, among many others, and you can tell: He knows how to craft a big three-minute song that can punch through the smoke machines at an arena show or into your earbuds. But he doesn’t do much of the modulation, the emotional slow-build and release, then backing off, then doing it again, that a full-length musical demands.\n\nThat kind of repetition, in fact, is the trap that the show falls into over and over. The dancers, masterfully choreographed by Travis Wall, often mirror the action onstage. When Mariana takes Duran home to her apartment, a duo of dancers simulate sex beside them. It’s a nice effect the first time. Also nice: “Take Off Your Clothes,” the background music to Mariana and Duran’s hookup, sung on stage into a stand microphone by another cast member. “No need to airbrush this body on covers of magazines, ’cause you’re the sexiest lady this world has or ever will see” is a perfect skewering of a body-positive, sex-positive pop anthem that wouldn’t be out of place as a follow-up to Maroon 5’s “Girls Like You.” Golan (of course) has written for Maroon 5, too.\n\nThat pop sensibility is, as they might say in Reno, a double-edged sword, because it brings us still more repetition. Lyrically, we hear a handful of lines ad nauseam: that “some good people do bad things,” that “the wrong man is singing this song,” that line about all the clichés in Reno. By the time Duran, moments from death, is singing about being the wrong man, we’re still left wondering just who exactly Duran is. He is most certainly not the right man — that we know, believe me — but that’s really the only thing we’re sure of, making it hard to fully feel for Duran’s plight, even with as much of his heart — seemingly all of it — Henry is pouring into his character.\n\nThe book, also by Golan, does the show no favors. A particular problem is the cheapo characterization of Mariana’s ex, known only as The Man in Black, who eventually lands in jail, not for multiple homicides but for a parole violation. He’s all smarm, and it’s jolting in a show trying to shine a light on a broken legal system and the prison-industrial complex to hear solitary confinement reduced to a joke about “peace and quiet” in a Latin-infused pop number, complete with rainbow lighting. The impulse to give us a foil is correct in a show where the material only gets darker and darker, but this doesn’t land at all.\n\nThat said, some of those eleven o’clock numbers do come through. Golan has written several powerful standalone songs for the show, enhanced by arrangements and orchestrations by Alex Lacamoire. (The show debuted originally as a concept album to positive reviews at SXSW earlier this year.) “Stay Positive,” Duran’s attempt to self-soothe while hiding out from the cops and realizing the likeliness of his fate is a particular standout. But taken collectivel,y The Wrong Man’s songs can feel one-note. Literally in their repetitive patter — Golan’s work is at its best in verses straight from Duran’s stream of consciousness, like a line about Duran noticing Mariana’s alphabetized DVD collection, a delightfully funny moment preceding the foreboding grim turn — but also in their narrow emotional bandwidth. As the cliché goes, it’s hard to invest fully in the forest when all you’re shown are the trees.\n\nThe Wrong Man is at MCC through November 17.", "description": "Theater Review: The Pop Songwriter Ross Golan’s ‘The Wrong Man’ Starring Josh Henry Opens at MCC Theater", "authors": ["Madison Malone Kircher"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/09/09-the-wrong-man.w1200.h630.jpg", "published_at": "2019-10-10"}