{"pub": "euronews", "url": "https://euronews.com/2019/10/13/ted-cruz-course-trump-was-wrong-ask-china-probe-bidens-n1065536", "downloaded_at": "2019-10-13 18:46:54.390141+00:00", "title": "Ted Cruz: 'Of course' Trump was wrong to ask China to probe Bidens", "language": "en", "text": "Sen. Ted Cruz said Sunday that it was wrong for President Donald Trump to call on China to probe former Vice President Joe Biden and his son in the Texas Republican's most direct rebuke of the president yet.\n\nAsked on CBS's \"Face the Nation\" whether Trump's comments were \"appropriate,\" Cruz said \"of course not.\"\n\n\"Elections in the U.S. should be decided by Americans and it's not the business of foreign countries, any foreign countries, to be interfering in our elections,\" he said.\n\n\"Face the Nation\" host Margaret Brennan then asked if it was improper for Trump to ask Ukraine to probe the Bidens, as he did in a July 25 call with Ukrainian President Volodymyr Zelenskiy — a call that is now at the center of an impeachment inquiry.\n\n\"Listen, foreign countries should stay out of American elections,\" Cruz said. \"That's true for Russia. That's true for Ukraine. That's true for China. That's true for all of them. It should be the American people deciding elections. I don't know what [Trump's personal attorney Rudy Giuliani has] been saying. I do know though that we should decide our elections. It should be the American people making those decisions.\"\n\nBut Cruz added that it would make \"sense\" for Giuliani, who is at the center of the president's campaign to have Ukraine investigate the Bidens, testify before the Senate Judiciary Committee. Senate Judiciary Committee Chairman Lindsey Graham, R-S.C., has already invited Giuliani to do so.\n\n\"I'd like to see Rudy testify,\" Cruz said. \"Yes.\"\n\nCruz's comments come as Republicans have struggled to align on their responses to Trump's requests to have Chinese and Ukrainian officials investigate the former vice president and his son. Some Republicans defended Trump's China remarks by saying the president wasn't \"serious\" despite Trump never having indicated he was joking.\n\nAsked Thursday about whether he was serious about calling on China to investigate the Bidens, Trump said, \"China has to do whatever they want.\"\n\n\"If they want to look into something, they can look into it,\" the president continued. \"If they don't want to look into it, they don't have to. Frankly, are far as I'm concerned, if China wants to look into something, I think that's great. And if they don't want to, I think that's great too. That's up to China.\"\n\nTreasury Secretary Steven Mnuchin said he \"can't comment\" on whether Trump was serious in his ask to have China investigate the Biden family.\n\n\"I can't comment on whether he was serious or not,\" Mnuchin said, adding that the topic had not been brought up in trade negotiations between the two countries. \"And in the Oval Office, when the president was asked about this in front of the Vice Premier, the president made very clear, they can do what they want. So, again, people who are trying to imply that the president is asking for things or quid pro quos, I think this is ridiculous.\"\n\nThe president began ramping up his push to have China probe Hunter's business dealings this month in the face of House Democrats' rapidly escalating impeachment probe.\n\n\"China should start an investigation into the Bidens because what happened in China is just about as bad as what happened with Ukraine,\" Trump told reporters outside the White House earlier this month.\n\nThe president has repeatedly accused the former vice president's son of using a 2013 trip on Air Force Two with his father to procure $1.5 billion from China for a private equity fund he had started. There has been no evidence of corruption on behalf of either Biden. The Washington Post found Trump's claims false. And a spokesman for Hunter Biden said he did not acquire an equity interest in the fund until 2017, after his father had left office. Meanwhile, Hunter's total capitalization from the fund at the time amounted to about $4.2 million, not the $1.5 billion Trump alleged.\n\nOn Sunday, Hunter announced through his attorney that he would step down from the Chinese-backed firm by the end of the month. Hunter's attorney, George Mesires, wrote that the former vice president's son \"never anticipated the barrage of false charges against both him and his father by the president of the United States.\"", "description": "\"It's not the business of foreign countries, any foreign countries, to be interfering in our elections,\" Cruz said.", "authors": [], "top_image": "https://static.euronews.com/articles/4229306/1000x563_nbc-191013-ted-cruz-cs-1120a_102254fdd7f6e408b76a24b0cdc56748.jpg", "published_at": "2019-10-13"}