{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/21/syria-estimated-number-uk-children-trapped-doubles-60-isis", "downloaded_at": "2019-10-21 08:54:33.102156+00:00", "title": "Syria: estimated number of UK children trapped doubles to 60", "language": "en", "text": "Many of the stranded children are under five years old, figures compiled by UK charity suggest\n\nAt least 60 British children are trapped in north-east Syria after fleeing areas held by Islamic State during the recent escalation in fighting, according to Save the Children –twice the number initially feared.\n\nFigures compiled by the UK-based charity suggest many of the children are under five years old and are enduring dire conditions in desolate camps. All were born to British parents suspected of joining Isis.\n\nAmid efforts by some European countries to repatriate children, and signs that the UK is taking similar steps, the new figures underline the scale and difficulty of the problem and will add to pressure to evacuate the children.\n\nOlder children who lived under Isis have witnessed appalling acts of brutality, including beheadings, and been left with physical injuries and psychological needs from years of conflict and brutal repression.\n\n“Children in Syria who have fled Isis-held areas are innocent,” said Alison Griffin of the aid group. “We can and must give them the safety they need by bringing them to be cared for in the UK.”\n\nBernard-Henri Lévy: Trump's Syria withdrawal is 'a nightmare and completely predictable' Read more\n\nWhat to do with accused Isis fighters and their families has been a pressing global security concern after Donald Trump’s decision to suddenly withdraw all US forces from Syria, which prompted an incursion by Turkish forces.\n\nLast week three children believed to be UK citizens were evacuated from a detention camp at Ain Issa.\n\nWhile the aid agency welcomed a recent shift in the UK government’s stance towards providing “safe passage” for British orphans to come to the UK, it said the vast majority of the children were with their mothers and all had been swept up in horrific events beyond their control.\n\n“Children whose parents are alive are just as innocent as those who have been orphaned,” Griffin said. “All have been put through unimaginable horrors. The foreign secretary has said he wants to ensure ‘innocents are not caught in the crossfire’. To play his part to achieve that, he needs to act now while there’s still a window of opportunity and bring all the UK’s children home.\n\n“The camps with the majority of foreign women and children have not yet been reached by fighting and remain under the control of the Kurdish authorities. The time to act is now.”\n\nSave the Children said its staff in Syria had recently spoken to a British mother with two young children – a baby and a child under five – in one of the camps. She told the charity she knew of at least 15 other British children in the same camp.\n\nOn Saturday Whitehall sources confirmed the government was working with “various agencies” in north-east Syria – believed to include the International Committee of the Red Cross – to kickstart the process of transferring children of British parents linked to Isis back to the UK.\n\nAmong the first cases identified are three orphans, believed to have travelled to Syria with their parents from London five years ago and who are currently in Raqqa, under the control of the Kurdish-dominated militia, the Syrian Democratic Forces (SDF).\n\nLast week the Guardian reported efforts by Belgium and other European states to begin preparing to evacuate citizens accused of having links to Isis from detention camps in north-eastern Syria through a newly declared “safe zone” being carved out by Turkish forces along the border.\n\nBelgian officials informed family members of detainees held in two camps on Friday that they would attempt to take advantage of a five-day ceasefire to retrieve nationals allegedly tied to the terror group.\n\nTurkey wants to clear the area of SDF soldiers, who had spearheaded the fight against Isis. It regards Kurdish fighters as proxies for the Kurdistan Workers’ party (PKK), which has waged a 35-year insurgency against the Turkish state.\n\nTrump’s move immediately prompted fears that the ensuing vacuum could lead to a collapse of security at the four main camps for Isis detainees and their families. Kurdish guards have already abandoned one detention centre, allowing up to 800 detainees, among them Isis members, to walk out.", "description": "Many of the stranded children are under five years old, figures compiled by UK charity suggest", "authors": ["Peter Beaumont", "Nesrine Malik"], "top_image": "https://i.guim.co.uk/img/media/88cca83195ddc0a23917485bab36d34606df24e2/0_148_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f783823bfafb27b8bfcc44c3f9ba25da", "published_at": "2019-10-21"}