{"pub": "bbc", "url": "https://bbc.com/news/world-australia-49916119", "downloaded_at": "2019-10-03 07:14:04.257693+00:00", "published_at": "2019-10-03", "title": "Poison fire coral: Deadly Asian fungus detected in Australia", "language": "en", "text": "Image copyright RAY PALMER Image caption Poison fire corals have caused deaths in parts of Asia\n\nOne of the world's most deadly fungi has been identified growing in Australia for the first time, scientists say.\n\nThe poison fire coral, which has a red appearance, was previously thought to be native to Japan and Korea.\n\nIts presence in the tropical state of Queensland - after sightings elsewhere in Asia - \"considerably\" extends the reach of the species, researchers said.\n\nIf eaten, the fungus can cause organ failure and brain damage.\n\nIn some recorded cases of fatalities in Japan and South Korea, people had brewed tea from poison fire coral after confusing it with an edible fungus used in traditional medicine.\n\nEven touching the fungus can cause inflammation and dermatitis, researchers from James Cook University (JCU) said.\n\n\"Of the hundred or so toxic mushrooms that are known to researchers, this is the only one in which the toxins can be absorbed through the skin,\" said Dr Matt Barrett.\n\nHe identified its presence through a picture that had been taken by a local nature photographer in a rainforest near the city of Cairns.\n\nBut the fungus has also had reported sightings in China, Thailand and Papua New Guinea, Dr Barrett said.\n\nHe suspected that wind had spread its spores thousands of years ago.\n\n\"We don't have hordes of mushroom hunters in tropical Australia... so it has just gone undetected until now,\" he told the BBC.\n\nHe said the fungus was among more than 20 previously undetected species identified in Australia in the past six months.", "description": "The poison fire coral was previously thought to be native to Japan and Korea alone, researchers say.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/17A96/production/_109081969_fungi.jpg"}