{"pub": "afr", "url": "https://afr.com/property/commercial/pay-by-the-hour-sydney-airport-to-get-country-s-first-aerotel-20191030-p535no", "downloaded_at": "2019-10-30 07:54:18.650155+00:00", "title": "Pay by the hour: Sydney Airport to get country's first 'aerotel'", "language": "en", "text": "He added that people travelling for an early-morning flight from, say, the Hunter Valley, who would normally have to leave at 3am, could leave at a more reasonable time and stay in the aerotel overnight before their flight.\n\nThe other issue with conventional hotels, Mr Song said, was that they charged for a minimum 24-hour stay, even if the room was used for only a few hours.\n\n\"You see people sleeping on the floor prior to flights,\" he said. \"For us it's all about offering comfort, quality and convenience.\"\n\nThe new Sydney Airport aerotel will be built across 600 square metres within the arrivals hall at the international terminal after PPG negotiated a leasing deal with Sydney Airport.\n\nAerotel hotel rooms measure just 10-12 square metres but have showers.\n\nGuest will be able to check in immediately on arrival with a minimum stay of six hours. Beyond this guests will be charged an hourly rate until they check out.\n\nPricing will be less than half of that of a conventional hotel, Mr Song said.\n\n\"You have to give good credit to the Sydney Airport authority. They have realised there is a lack of services within the airport, which is quite old,\" he said.\n\nAdvertisement\n\nMr Song said PPG was keen to expand the aerotel concept to other Australian airports.\n\n\"We are talking to Melbourne Airport so hopefully they will announce [they are working with us as well],\" he said.\n\nAlongside the aerotel, PPG will also open its first Plaza Premium Lounge.\n\nBefore launching the aerotel concept three years, Mr Song came up with his main business idea – pay-per-use airport lounges – when he downgraded from business class to economy class after a career in investment banking.\n\n\"All those who travelled business class had lounge access, but what about economy class travellers?\" he said.\n\n\"There was nowhere I could charge batteries or send a fax. It was very frustrating.\n\n\"Out of that frustration triggered my business wisdom: why only provide lounges for the 15 per cent of people who travel business class?\n\n\"If you create a business centre for everyone, that will be viable.\"\n\nAdvertisement\n\nHaving opened its first lounge in Hong Kong in 1998, PPG now operates 160 outlets serving 15 million passengers.\n\n\"On the ground everyone can be first-class,\" Mr Song said.", "description": "The hotel for weary travellers will be built within the international arrivals hall at Sydney Airport.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3516%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_254/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/587293cf70a0ff49cc0818647e8c909389aa7acc", "published_at": "2019-10-30"}