{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7542833/Britains-worst-female-paedophile-Vanessa-George-spotted-sunshine-freed-jail.html", "downloaded_at": "2019-10-06 11:30:28.969400+00:00", "title": "Britain's worst female paedophile Vanessa George is spotted in the sunshine after being freed jail", "language": "en", "text": "Vanessa George, 49, sexually assaulted up to 64 children in her care at Little Ted's nursery in Plymouth\n\nBritain's most notorious female paedophile Vanessa George has been spotted basking in the sunshine as she is seen for the first time since her release.\n\nWith a tan, vest top and shorts on, George, a former nursery worker, smiles in a courtyard as she is pictured enjoying her freedom.\n\nThe paedophile is housed at a bail hostel in Birmingham, West Midlands, as she prepares to build a new life.\n\nAnd fellow ex-convicts told how she swapped jokes and was laughing as she lapped up the sunshine.\n\n'She didn’t come across as the type who’s too troubled by what she was banged up for,' a source told The Sun on Sunday.\n\nThe 49-year-old was jailed for a minimum of seven years in 2009 after she sexually assaulted up to 64 children as young as two.\n\nShe photographed herself abusing the children at Little Ted's nursery in Plymouth and then sent the images to other paedophiles she had met online.\n\nIn July, despite outrage from her victims' parents and MPs, a Parole Board panel ordered her release after she'd served 10 years behind bars.\n\nCCTV footage of George on the phone to her lawyer while in police custody in Plymouth\n\nGeorge, who lost three of her 19 stone in prison, convinced the board to release her after having treatment to boost her 'self-esteem'\n\nGeorge, who lost three of her 19 stone in prison, convinced the board to release her after having treatment to boost her 'self-esteem'.\n\nPlymouth Sutton and Devonport MP Luke Pollard said last night: 'The families concerned are facing a life sentence as she spends time relaxing in the sunshine.\n\n'Vanessa George shouldn't be allowed out of prison until her victims have reached adulthood as a bare minimum. Many of them are now around 12, 13 or 14.'\n\n\n\nLast month she walked free from HMP Send, Surrey, after a parole board ruled she had 'shown remorse', and was put in the probation hostel costing up to £50,000 a year.\n\nAnd the hostel was just 547 yards from a nursery and less than half a mile from a children's club, according to The Sunday People.\n\nIn 2009, George admitted 13 sexual assault charges, but maintained a silence over the names of children she assaulted.\n\nChild protection officers have visited 180 children thought to have had contact with George, and 21 families have taken up an offer of support.\n\nGeorge's co defendant Angela Allen, who raped a girl of three, has already served the five-year minimum of her sentence imposed at the same time.\n\nThe ringleader of the paedophile gang, Colin Blanchard, will be eligible for parole next year after being jailed in 2011 for a minimum of nine years.", "description": "Britain's most notorious female paedophile Vanessa George, 49, has been spotted enjoying the sun at a bail hostel in Birmingham. She was released from jail last month.", "authors": ["Emily Webber For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/09/19356162-0-image-a-19_1570350989984.jpg", "published_at": "2019-10-06"}