{"pub": "atlantic", "url": "https://theatlantic.com/magazine/archive/2019/11/how-baseball-cards-got-weird/598345", "downloaded_at": "2019-10-12 15:09:06.371668+00:00", "title": "How Baseball Cards Got Weird", "language": "en", "text": "A case of Topps Series 2 contains 12 boxes, each made up of 24 packs, which in turn each hold 14 cards. Some breakers, I would later learn, tear open the packs and riffle through them with the speed of a blackjack dealer, pausing only to display the rarest cards. Byington is more methodical in his approach, carefully unwrapping each pack and allowing the camera to glimpse every card. This break threatened to last nearly as long as a regulation baseball game.\n\nAs he started pulling individual cards from the packs, Byington offered the kind of pleasant, meandering chatter that might fill the air during a rain delay. About an hour into the break, he turned over a card depicting Rickey Henderson, the brash Oakland leadoff man who had set stolen-base records during my childhood. “Oooh, look at that!” he exclaimed. “Boom! Nice, Eric.” Not only was Henderson a player I recognized; this was a “relic” card, embedded with a shard of a bat Henderson had once used in a game. In the break’s live chat room, other participants gave the rookie in their midst a round of attaboys.\n\nUp until that point, the experience of baseball-card collecting as a spectator sport could hardly have been more foreign. Having acquired the limited-edition Henderson card—or, at least, having seen Byington unwrap it—I now felt a familiar rush, one I hadn’t known since the days I’d spent opening packs at Gilbert’s: the thrill of the hunt.\n\nBaseball-card collecting really ought to be extinct. It’s an analog hobby in a digital world, an expression of fandom in a sport whose attendance is in slow decline and whose cultural relevance is in free fall. But as my experience in Billy Byington’s break suggests, the hobby has not only persisted; it’s found effective, if peculiar, methods of adapting to an inhospitable environment.\n\nThe story of the baseball-card market is a story of scarcity. Before the 1970s, varying prices for individual baseball cards were virtually unheard-of. Vintage cards were traded through the mail by completist collectors seeking to round out a set. In the late ’60s, the 1952 Topps Mickey Mantle listed for about a dollar—the going rate for any card from the sixth series of 1952 Topps. It was only in the ’70s, as Baby Boomers sought out favorite cards from their youth, that certain stars began to soar in value.\n\nAs kids, Boomers had treated baseball cards like what they were—playthings, not museum pieces. They fondled them and flipped them and stuck them between the spokes of their bicycles—then went off to college and lost shoeboxes stuffed with cards to flooded basements and spring cleaning. Later, when grown Boomers returned to their childhood hobby, ardent demand met limited supply. By the end of the ’70s, that same ’52 Mantle approached $1,000 in value.\n\nBy the ’80s, blue-chip cards were outperforming the S&P 500 and collecting had transformed from a sleepy novelty into a billion-dollar industry. In 1991, approximately 18 million people in the United States bought at least one newly issued pack, spending $2 billion to acquire nearly 21 billion baseball and other sports cards. A 1990 market study found that 77 percent of collectors were drawn to cards partly or fully because they considered them a “good investment.”", "description": "A very analog hobby finds a way to thrive in the digital age.", "authors": ["Eric Moskowitz"], "top_image": "https://cdn.theatlantic.com/assets/media/img/2019/10/BaseballCards/facebook.jpg?1570889864", "published_at": "2019-10-12"}