{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/23/eu-us-privacy-shield-passes-third-commission-health-check-but-litigation-looms", "downloaded_at": "2019-10-23 14:58:37.466820+00:00", "title": "EU-US Privacy Shield passes third Commission ‘health check’ — but litigation looms – TechCrunch", "language": "en", "text": "The third annual review of the EU-US Privacy Shield data transfer mechanism has once again been nodded through by Europe’s executive.\n\nThis despite the EU parliament calling last year for the mechanism to be suspended.\n\nThe European Commission also issued US counterparts with a compliance deadline last December — saying the US must appoint a permanent ombudsperson to handle EU citizens’ complaints, as required by the arrangement, and do so by February.\n\nThis summer the US senate finally confirmed Keith Krach — under secretary of state for economic growth, energy, and the environment — in the ombudsperson role.\n\nThe Privacy Shield arrangement was struck between EU and US negotiators back in 2016 — as a rushed replacement for the prior Safe Harbor data transfer pact which in fall 2015 was struck down by Europe’s top court following a legal challenge after NSA whistleblower Edward Snowden revealed US government agencies were liberally helping themselves to digital data from Internet companies.\n\nAt heart is a fundamental legal clash between EU privacy rights and US national security priorities.\n\nThe intent for the Privacy Shield framework is to paper over those cracks by devising enough checks and balances that the Commission can claim it offers adequate protection for EU citizens personal data when taken to the US for processing, despite the lack of a commensurate, comprehensive data protection region. But critics have argued from the start that the mechanism is flawed.\n\nEven so around 5,000 companies are now signed up to use Privacy Shield to certify transfers of personal data. So there would be major disruption to businesses were it to go the way of its predecessor — as has looked likely in recent years, since Donald Trump took office as US president.\n\nThe Commission remains a staunch defender of Privacy Shield, warts and all, preferring to support data-sharing business as usual than offer a pro-active defence of EU citizens’ privacy rights.\n\nTo date it has offered little in the way of objection about how the US has implemented Privacy Shield in these annual reviews, despite some glaring flaws and failures (for example the disgraced political data firm, Cambridge Analytica, was a signatory of the framework, even after the data misuse scandal blew up).\n\nThe Commission did lay down one deadline late last year, regarding the ongoing lack of a permanent ombudsperson. So it can now check that box.\n\nIt also notes approvingly today that the final two vacancies on the US’ Privacy and Civil Liberties Oversight Board have been filled, meaning it’s fully-staffed for the first time since 2016.\n\nCommenting in a statement, commissioner for justice, consumers and gender equality, Věra Jourová, added: “With around 5,000 participating companies, the Privacy Shield has become a success story. The annual review is an important health check for its functioning. We will continue the digital diplomacy dialogue with our U.S. counterparts to make the Shield stronger, including when it comes to oversight, enforcement and, in a longer-term, to increase convergence of our systems.”\n\nIts press release characterizes US enforcement action related to the Privacy Shield as having “improved” — citing the Federal Trade Commission taking enforcement action in a grand total of seven cases.\n\nIt also says vaguely that “an increasing number” of EU individuals are making use of their rights under the Privacy Shield, claiming the relevant redress mechanisms are “functioning well”. (Critics have long suggested the opposite.)\n\nThe Commission is recommending further improvements too though, including that the US expand compliance checks such as concerning false claims of participation in the framework.\n\nSo presumably there’s a bunch of entirely fake compliance claims going unchecked, as well as actual compliance going under-checked…\n\n“The Commission also expects the Federal Trade Commission to further step up its investigations into compliance with substantive requirements of the Privacy Shield and provide the Commission and the EU data protection authorities with information on ongoing investigations,” the EC adds.\n\nAll these annual Commission reviews are just fiddling around the edges, though. The real substantive test for Privacy Shield which will determine its long term survival is looming on the horizon — from a judgement expected from Europe’s top court next year.\n\nIn July a hearing took place on a key case that’s been dubbed Schrems II. This is a legal challenge which initially targeted Facebook’s use of another EU data transfer mechanism but has been broadened to include a series of legal questions over Privacy Shield — now with the Court of Justice of the European Union.\n\nThere is also a separate litigation directly targeting Privacy Shield that was brought by a French digital rights group which argues it’s incompatible with EU law on account of US government mass surveillance practices.\n\nThe Commission’s PR notes the pending litigation — writing that this “may also have an impact on the Privacy Shield”. “A hearing took place in July 2019 in case C-311/18 (Schrems II) and, once the Court’s judgement is issued, the Commission will assess its consequences for the Privacy Shield,” it adds.\n\nSo, tl;dr, today’s third annual review doesn’t mean Privacy Shield is out of the legal woods.", "description": "The third annual review of the EU-US Privacy Shield data transfer mechanism has once again been nodded through by Europe’s executive. This despite the EU parliament calling last year for the mechanism to be suspended. The European Commission also issued US counterparts with a compliance deadline last December — saying the US must appoint a […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2015/10/shutterstock_141093727.jpg?w=600", "published_at": "2019-10-23"}