{"pub": "foxnews", "url": "https://foxnews.com/food-drink/man-visits-15000th-starbucks-in-22-years", "downloaded_at": "2019-09-09 10:24:36.601117+00:00", "title": "Starbucks-obsessed man visits 15,000 locations in 22 years, and plans to hit all", "language": "en", "text": "This man plans to visit every Starbucks there is -- no small feat when you realize how many there are around the globe.\n\nIn fact, after 22 years, he’s only about halfway done. Granted, that means he’s visited about 15,000 Starbucks across the world.\n\nIt’s a good thing Starbucks specializes in coffee, because this goal sounds exhausting -- an excellent excuse for regular caffeine jolts.\n\nThe man, whose full name is reportedly just Winter, recently visited his 15,000th Starbucks in Peru, Fox 35 reports. Despite usually ordering drip coffee, he celebrated with a Colombia Narino Latte Macchiato.\n\nWinter tweeted about the momentous occasion, claiming that he's traveled over a million miles in 22 years to get so far along in his quest. He claims to have visited nearly 12,000 locations in the United States and Canada, along with more than 3,000 internationally.\n\nThe Texas native has traveled to India, Japan, Egypt, France and Costa Rica.\n\nIn March, Starbucks opened its 30,000th store in Shenzhen, China.\n\nSTARBUCKS CUSTOMER CLAIMS BARISTA WROTE 'HIPPO' ON CUP INSTEAD OF HER NAME: 'GROTESQUELY UNPROFESSIONAL'\n\n“I was quite thrilled to finally achieve a significant milestone in my Starbucking quest,” Winter told Fox News in an interview, “one that was long delayed because of my family responsibilities. But it was especially exciting that circumstances allowed me to select not only a store in a new country, but in fact the first store in South America.\n\n\"That choice was additionally special for me because of my Latin American ethnicity.”\n\nFOLLOW US ON FACEBOOK FOR MORE FOX LIFESTYLE NEWS\n\nWinter would like to clarify one thing: He actually prefers independent coffee to Starbucks brews. “That’s the definition of irony right there,” he said.\n\nWhen asked if it would take another 22 years to hit 30,000 stores, Winter said it might actually take longer. “Given that Starbucks growth in North America has peaked, thus requiring me to spend more time overseas to rack up stores, I predict that it will take closer to 30 years.\"\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\nOf course, he’s already off to a good start. Since hitting 15,000, Winter hasn’t taken any time off from hitting up new Starbucks stores.\n\n“Ovalo Gutierrez was my 16th store in Peru,” he explained. “And after I saw it, I went on to visit 44 additional, for a total of 60 in the country, in four days, six hours. Then I hopped on a redeye flight to Houston, abandoned my connection to Rochester, N.Y., and decided to road-trip 1,790 miles in 48 hours, visiting 13 stores on the way, bringing my current total to 15,057.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWhile there are still a lot of stores to hit, Winter is apparently looking forward to visiting China and Japan. “The Starbucks in Kyoto offers tatami mats for seating,” he excitedly explained. He also looks forward to traveling to Europe, as he describes himself as a big “Europhile.”\n\nIn a recent tweet, Winter summed up his journey, writing, “When asking me about Starbucking, most journalists focus on Starbucks, but that's like looking at a painting and fixating on the canvas. In truth, Starbucking is more about challenges, travel, experiences and people than about one company.”", "description": "One man's journey to visit every Starbucks finally hit the halfway point... after 22 years.", "authors": ["Michael Hollan"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Starbucks-sign.jpg", "published_at": "2019-09-05"}