{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/man-utd-to-offered-juventus-20544726", "downloaded_at": "2019-10-09 12:47:11.632408+00:00", "title": "Man Utd 'to be offered Juventus duo' in exchange for Paul Pogba transfer", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJuventus are reportedly ready to offer two players to Man Utd in a bid to prise Paul Pogba back to the club.\n\nThe French midfielder wants out of Old Trafford, with Juve and Real Madrid both interested in acquiring his services.\n\nPogba favoured a move to Spain, but Madrid have gone cold after United slapped a £179 million price tag on his head.\n\nNow Juve are hoping to steal in and seal Pogba's return to the club where he spent four years from 2012-2016.\n\nTuttosport claim that the Serie A giants will try and tempt United by offering ex-Liverpool midfielder Emre Can and veteran striker Mario Mandzukic as part of the deal.\n\n(Image: EMPICS Sport)\n\nMandzukic, 33, stayed with Juve despite being targeted by United in the summer, but is not part of boss Maurizio Sarri's future plans.\n\nMeanwhile Can, 25, is only playing a bit-part role in first-team affairs after being omitted from Juve's Champions League squad.\n\nUnited are unlikely to accept an offer for Pogba unless a significant fee is paid in addition to the two players, but it is unclear whether Juventus are prepared to do so.\n\nMadrid's interest in Pogba has fizzled out further since the summer due to the emergence of youngster Fede Valverde.\n\nThe 21-year-old Uruguayan midfielder has been a stand-out performer for Los Blancos this season having returned from a season-long loan spell with Deportivo La Coruna.\n\nValverde has emerged as their main man in midfield after a string of injuries early in the season - and Marca report Zidane is now confident they are better off without Pogba.\n\nMeanwhile United could use any funds from the sale of Pogba to launch bids for prime targets Declan Rice and Khalidou Koulibaly next summer.\n\nAccording to Goal , United chiefs are determined to continue the rebuilding of their squad and have set their sights on both players, regardless of whether manager Ole Gunnar Soslkjaer is still in charge or not.", "description": "Wantaway star Pogba looks set to leave Old Trafford next summer but interest from Real Madrid has gone cold", "authors": ["Darren Wells", "Image", "Empics Sport"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20544684.ece/ALTERNATES/s1200/0_Manchester-United-v-Arsenal-Premier-League-Old-Trafford.jpg", "published_at": "2019-10-09"}