{"pub": "townhall", "url": "https://bearingarms.com/bob-o/2014/06/23/awkward-moment-hk-fanboys-find-germans-call-g36-rifle-doesnt-shoot-straight", "downloaded_at": "2019-09-30 11:28:53.102501+00:00", "title": "That Awkward Moment When H&K Fanboys Find Out That The Germans Call The G36 The Rifle That “Doesn’t Shoot Straight”", "language": "en", "text": "Heckler & Koch fanboys—and I’m specifically referring to those who insist that the company can do no wrong—aren’t going to like this.\n\nThe German government is claiming that the G36 assault rifle—the parent of the XM8 once looked at as a replacement for the M4/M16 family of weapons fielded here in the United States—can’t hack it in real-world conditions:\n\nGermany’s defense ministry has temporarily halted new orders of its military’s standard assault rifle while it probes complaints the weapon doesn’t shoot straight, a news report said Sunday. German troops in Afghanistan in recent years voiced concerns over the G36 automatic rifle made by Heckler & Koch, saying it became inaccurate when its barrel heated up in prolonged firefights. The military initially blamed the use of unsuitable munitions, but the government auditing body the Bundesrechnungshof has now ordered a new investigation, reported the Bild am Sonntag newspaper.\n\nReports are that once German soldiers have fired their basic load of five 30-round magazines, their rifles become wildly inaccurate. Anyone with much experience with firearms expects a point-of-aim/point-of-impact (POA/POI) shift as a rifle barrel heats up, and also expects that groups will open up as well under sustained fire. But the claims are that the G36’s pencil barrel simply can’t hold minute of man groups inside 200 meters (link is in German) is stunning in a war when the engagement range is typically more than double that distance, with the Taliban preferring to engage out past 500 meters with longer-ranged 7.62x54R rifles and machine guns, along with rocket-propelled grenades and mortars.\n\nOur own military found similar problems with early variants of the M16 rifle and M4 carbine with thinner barrels, which resulted in the adoption of thicker barrels that handles prolonged firing better. The most surprising thing here is that it took this long for the German military and H&K to discover what everyone else has known regarding the suitability of pencil barrels in combat weapons.\n\nThen again, as someone once snarked, the G36 is best known as an assault rifle fielded by countries that don’t fight wars. The rifle simply hasn’t been subjected to the extensive real-world conditions of other combat rifles created before and during the so-called Cold War.\n\nHeckler & Koch admitted the rifle wasn’t designed for sustained fire when the issue was first raised in 2012. Considering that the weapon makers had a 50+year history of assault rifle usage in combat around the world as their guide, we’re forced to ask how they couldn’t have seen the need for a rifle capable of sustained fire. A rifle that overheated to the point of being virtually useless might be acceptable for a police service rifle, but simply isn’t acceptable in a military firearm\n\nAm I wrong in thinking that H&K screwed up in designing a weapon with a thin pencil barrel to begin with, but the German government screwed up even worse by not realizing how the weapon would be used on the modern battlefield during testing of system before it became general-issue in 1997?\n\nAs far as Afghanistan goes, the Bundeswehr would probably be better prepared if they returned to a variant of the 7.62 NATO G3 battle rifle, which has actually be proven in combat, and at range.", "description": "", "authors": ["Bob Owens", "Author'S Bio", "Bob Owens Is The Editor Of", "Posted At Am On June"], "top_image": "https://bearingarms.com/wp-content/themes/Bearing-Arms-2016/images/ba_placeholder.png", "published_at": "2014-06-23"}