{"pub": "reuters", "url": "https://in.reuters.com/article/us-global-oil/oil-falls-below-64-on-saudi-oil-restart-prospects-economy-concerns-idINKBN1W8037", "downloaded_at": "2019-09-23 11:56:42.392430+00:00", "title": "Oil falls below $64 on Saudi oil restart prospects, economy concerns", "language": "en", "text": "LONDON (Reuters) - Oil fell below $64 a barrel on Monday, reversing an earlier gain, pressured by the prospect of a faster-than-expected full restart of Saudi Arabian oil output and by fresh signs of European economic weakness.\n\nFILE PHOTO: General view of the Fos-Lavera oil hub near Marseille, France, September 17. REUTERS/Jean-Paul Pelissier\n\nA source, briefed on the latest developments in the Sept. 14 attack on Saudi oil facilities, said Saudi Arabia has restored around 75% of crude output lost.\n\nOil was up earlier in the session, supported by scepticism over how fast output would come back.\n\nGlobal benchmark Brent crude fell 30 cents to $63.98 a barrel at 1045 GMT, having earlier risen as high as $65.50. U.S. West Texas Intermediate CLc1 was down 38 cents to $57.71.\n\nA business survey showing euro zone business growth stalled this month, dragged down by shrinking activity in Germany where a manufacturing recession deepened unexpectedly, also weighed on oil and other markets such as equities.\n\n“Oil prices are tracking European markets lower this morning, understandably knocked by the woeful manufacturing data from the bloc and the implications for global growth and demand,” said Craig Erlam, analyst at OANDA.\n\nBrent has still gained about 18% this year, helped by a supply-limiting pact led by the Organization of the Petroleum Exporting Countries, although concern about slowing economic growth has limited the advance.\n\nTension in the Middle East has escalated since the Saudi attack. The Pentagon has ordered additional U.S. troops to be deployed in the Gulf region to strengthen Saudi Arabia’s air and missile defenses.\n\nBritain believes Iran was responsible for the attack and will work with the United States and European allies on a joint response, Prime Minister Boris Johnson said on Monday. The United States and Saudi Arabia have already blamed Iran, which denies responsibility.\n\nThe Saudi attacks have refocused investor attention on the prospect of other supply disruptions in other OPEC producers like Nigeria, Libya and Venezuela. Investors had been less concerned about supply risks due to ample supplies.\n\n“The geopolitical risk premium has returned with a vengeance and supply-side developments have been thrust back into the spotlight,” Stephen Brennock of oil broker PVM said.\n\n“While Saudi oil facilities smolder, the potential for fresh outages in Nigeria, Libya and Venezuela continues to hang over the market.”", "description": "Oil fell below $64 a barrel on Monday, reversing an earlier gain, pressured by the prospect of a faster-than-expected full restart of Saudi Arabian oil output and by fresh signs of European economic weakness.", "authors": ["Alex Lawler", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1432798461&w=1200&r=LYNXMPEF8M034", "published_at": "2019-09-23"}