{"pub": "hotair", "url": "https://hotair.com/archives/jazz-shaw/2019/10/10/good-old-days-kurds-world-war-2", "downloaded_at": "2019-10-10 15:01:07.750964+00:00", "title": "The good old days of the Kurds in World War 2", "language": "en", "text": "The Turkish invasion of the northern Syria border region is well underway, as a couple of smaller cities are going up in flames and tens of thousands of Kurish civilians are fleeing to the south in convoys. Meanwhile, the Kurds are claiming that they successfully “scuppered a ground incursion attempt.” Such is the fog of war, I suppose.\n\nAllahpundit wrote about the President’s shifting explanations for how things reached this point last night. But one of the President’s defenses of the situation hit the news cycle a bit later. The Kurds may be our allies, according to the President, but hey… they didn’t help us with the invasion of Normandy. (WaPo)\n\nPresident Trump said Wednesday that it would be “easy” for the United States to form new alliances if Syrian Kurds leave the fight against the Islamic State to fend off a Turkish attack, noting that “they didn’t help us in the Second World War, they didn’t help us in Normandy” and were only interested in fighting for “their land.” “With all of that being said, we like the Kurds,” he said in response to questions about Turkey’s incursion into Syria. Trump’s off-the-cuff remarks, following a White House ceremony where he signed unrelated executive orders, came as the administration continued an effort to correct what it has called the misimpression that Trump enabled the offensive against the U.S.-allied Kurds that Turkey launched Wednesday.\n\nSometimes it’s hard to even come up with a joke about such things. Needless to say, our relationship with Iraq and the Kurdish region back in the forties was significantly different than the dealings we had with most of the nations that would later become NATO members and our allies against the Nazis. (Actually, Britain was occupying Iraq in the early forties.) I’m going to take a pass on trying to guess what Trump was thinking when he said that because frankly, I’ve given up on figuring out what our Syria strategy is for the time being.\n\nI was doing a radio hit on a station in Connecticut yesterday and discussing this situation with the host. We both seemed to agree that there really wasn’t (and still isn’t) a good solution for our involvement in Syria at this point. The real reason we were there in the first place was to break the ISIS caliphate. That job is now about as done as it’s going to be in the short term. Staying in that dangerous neck of the woods indefinitely was never an option anyone wanted to consider.\n\nBut at the same time, the Kurds have shed a lot of blood on our behalf. Or more correctly, on behalf of the entire western world under threat from ISIS. And right now our supposed “ally” Turkey is in the process of “clearing” a large stretch of the border territory inside of Syria. That means that a large military force from a NATO member is currently engaged in a full-scale war with our allies who did the heavy lifting in wiping out ISIS in Syria.\n\nThe only way to have avoided this would have been through some sort of diplomatic engagement with Erdogan. Was that even possible? He’s had blood in his eyes for the Kurds for a very long time. Maybe Trump could have convinced him to avoid this attack and maybe he couldn’t. But in the end it still represents a diplomatic failure and the Kurds are paying the price for it. Perhaps there was no way to avoid this in the long run, but this will not be remembered as one of the shining moments of the Trump administration.", "description": "No end game in sight", "authors": ["Jazz Shaw", "Karen Townsend", "John Sexton", "Ed Morrissey"], "top_image": "https://hotair.com/wp/wp-content/uploads/2017/09/TrumpErdogan.jpg", "published_at": "2019-10-10"}