{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7565931/Ex-Paralympic-cyclist-allegedly-glued-BA-plane-Extinction-Rebellion-protest.html", "downloaded_at": "2019-10-12 15:22:02.810135+00:00", "title": "Ex-Paralympic cyclist allegedly glued himself to BA plane in Extinction Rebellion protest", "language": "en", "text": "James Brown, 55, outside Westminster Magistrates' Court today\n\nA former Paralympic cyclist accused of climbing on to a British Airways plane and gluing himself to it during Extinction Rebellion protests has denied causing a public nuisance.\n\nJames Brown, 55, who is visually impaired, is alleged to have climbed on top of the aircraft at London City Airport on Thursday.\n\nHe appeared at Westminster Magistrates' Court today where a not guilty plea was entered on his behalf by his solicitor Raj Chada.\n\nBrown, of Exeter, wore a grey jumper to the hearing and spoke only to confirm his name, address and date of birth.\n\nThe alleged offence took place two days after his birthday.\n\nDistrict judge John Zani granted Brown conditional bail, prohibiting him from going within one mile of any airport in the UK.\n\nHis case was heard in front of a full public gallery, which included members of Extinction Rebellion. There was applause at the end of the hearing.\n\nMr Chada requested that Brown's walking cane was returned to him after it was confiscated by officers. The request was granted by Mr Zani.\n\nJames Brown is alleged to have climbed on top of the aircraft at London City Airport on Thursday during the Extinction Rebellion protests\n\nDistrict judge John Zani granted Brown conditional bail, prohibiting him from going within one mile of any airport in the UK (pictured: James Brown with his wife after the hearing)\n\nBrown is next due to appear at Southwark Crown Court in London on November 8 for trial.\n\nThe athlete's arrest and charging capped a week of demonstrations against climate inaction which saw more than 1,100 arrests across the capital.\n\nBrown competed for Britain, Ireland and Northern Ireland in a career which saw him participate at five Paralympic Games and earn two gold medals and a bronze.", "description": "James Brown, pictured outside Westminster Magistrates' Court, is alleged to have climbed on top of the aircraft at London City Airport on Thursday during Extinction Rebellion protests.", "authors": ["Henry Martin For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/14/19627520-0-image-a-29_1570888731507.jpg", "published_at": "2019-10-12"}