{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7568077/Indigenous-group-mass-protests-Ecuador-agree-hold-talks-austerity-President.html", "downloaded_at": "2019-10-13 18:56:39.455675+00:00", "title": "Indigenous group behind mass protests in Ecuador agree to hold talks on austerity with President", "language": "en", "text": "Advertisement\n\nAn indigenous group in Ecuador behind mass protests against cuts to fuel subsidies agreed to hold talks with President Lenin Moreno, who ordered a curfew in the capital on Saturday after the latest wave of violence in the city.\n\nThe announcement by the group, Conaie, was the first sign of a possible breakthrough in a dispute that has sparked national security concerns and cast doubt on Moreno's ability to carry out an austerity plan that is still in early stages.\n\nBut the group was angered by Moreno's decision to impose a military-enforced curfew in Quito and surrounding valleys shortly after it signalled its willingess to talk.\n\nScroll for video\n\nThe rolling demonstrations (pictured, a protester from the indigenous Kichwa yesterday) have left six people dead and nearly 2,100 wounded or detained, according to authorities\n\nProtesters on Saturday targeted a television station and a newspaper as well as set fire to the comptroller general's office. Pictured: Barricades on fire near Casa de la Cultura as protesters clash with police yesterday\n\nAn indigenous group in Ecuador behind mass protests (pictured yesterday) against cuts to fuel subsidies agreed to hold talks with President Lenin Moreno, who ordered a curfew in the capital on Saturday after the latest wave of violence in the city\n\nThe announcement by the group, Conaie, was the first sign of a possible breakthrough in a dispute that has sparked national security concerns and cast doubt on Moreno's ability to carry out an austerity plan that is still in early stages. Pictured: Barricades being set up in Quito yesterday\n\nA shocking picture shows the General Comptroller's Office building after demonstrators broke in, during the 10th day of a protest over a fuel price hike ordered by the government to secure an IMF loan\n\nHe also ordered the armed forces to restore order nationwide, blaming unrest on extremists he said had infiltrated protests.\n\nConaie, an umbrella organisation of indigenous groups across Ecuador, stopped short of calling off talks and said its members would continue to protest.\n\n'There's no real dialogue without necessary guarantees' of physical safety, Conaie said on Twitter.\n\nIn a late-night speech to the nation, Moreno defended the curfew and thanked indigenous leaders for being open to dialogue and said together they would look at the impact of a law he passed last week that ended a decades-old fuel subsidy.\n\n'Whoever has the disposition to talk, weâll do it. This process has made advances and I hope to give you good news soon,' he said.\n\nLenin Moreno ordered a curfew and military control (pictured yesterday) in the capital to try to quell deadly, anti-austerity protests\n\nDemonstrators stand at the terrace roof of the General Comptroller's Office building after breaking in during the rioting yesterday\n\nConaie, an umbrella organisation of indigenous groups across Ecuador, stopped short of calling off talks and said its members would continue to protest (pictured yesterday)\n\nOn Saturday (pictured), the tenth day of marches scheduled in Quito, police and protesters clashed amid clouds of tear gas as vandals set fire to the comptroller's office and a TV station\n\nLocal media reported violent protests in other parts of the country yesterday (pictured), including the coastal city of Guayaquil, where Moreno has moved his government for safety reasons\n\nHe did not indicate any plans to repeal the law, which has triggered a backlash and protests that have spun out of control.\n\nOn Saturday, the tenth day of marches scheduled in Quito, police and protesters clashed amid clouds of tear gas as vandals set fire to the comptroller's office and a TV station.\n\nRoads to Quito's airport were blocked and flights cancelled.\n\nLocal media reported violent protests in other parts of the country, including the coastal city of Guayaquil, where Moreno has moved his government for safety reasons.\n\nThe United Nations in Ecuador, which has offered to mediate talks to end the unrest, announced late on Saturday that a first round of dialogue with indigenous groups would be held in Quito on Sunday at 3 p.m. local time (2000 GMT). It did not say if Moreno and Conaie would take part.\n\nEarlier on Saturday, one of Conaie's leaders told TV channel Ecuavisa that one of the group's conditions for talks included making them public.\n\nEcuador's embattled President Lenin Moreno (centre) is pictured addressing the media next to President of Ecuador's National Assembly Cesar Litardo (left) and the government's ombudsman Pablo Celi (right) in Guayaquil, on October 8\n\nAnti-government demonstrators are pictured taking cover behind a barricade during clashes with police in Quito, yesterday\n\nDemonstrators (pictured) on Saturday ransacked and set fire to the building housing the comptroller general's office, which was shrouded in thick smoke after being attacked with fire bombs. The prosecutor's office said 34 people were arrested\n\nUnits of the Ecuadorian Army are pictured moving through the streets after curfew during the tenth day of protests against the Government, in downtown Quito\n\n'We're not going to talk behind closed doors,' Leonidas Iza said. 'There has to be large screens so every bit of input from our members is heard.'\n\nMoreno, 66, has defended his decision to slash fuel subsidies as a key part of his bid to clean up the country's finances, after signing a $4.2billion loan deal with the International Monetary Fund (IMF) earlier this year.\n\nBut the measure has pushed up prices on other products and opponents say it will hit the poor the hardest.\n\nProtesters have taken aim at the IMF and Moreno's turn to the right since being elected in 2017 as the left-leaning successor to Rafael Correa.\n\nProtesters yesterday sets barricades on fire near Casa de la Cultura as they clash with the police in another day of violence in the capital\n\nNearby, protesters built barricades in front of the National Assembly building as police fired tear gas at them, according reports. The Teleamazonas TV channel interrupted its regular broadcast to air images of broken windows, a burned vehicle and heavy police presence on the scene\n\nThe national auditor's office building burns during clashes between anti-government demonstrators and police in Quito yesterday\n\nEl Comercio newspaper reported on Twitter its offices were attacked by a 'group of unknowns.' It did not provide further details. Pictured: Protesters on the street yesterday\n\nFive people have been killed in the unrest since it began on Oct. 3 and nearly 1,000 wounded, according to the latest report the office of the country's ombudsman, which monitors conflicts. More than a 1,100 people have been arrested.\n\nIt was unclear what impact the curfew had after it went into effect at 3pm (20:00pm GMT) on Saturday. In his late-night message, Moreno said it had yielded 'tangible' results.\n\n'We've recovered calm in a good part of the city,' Moreno told Ecuadoreans.\n\nShuttered inside for several hours, many residents of the city of more than 2 million people banged on pots at night on their roofs in a collective call for peace.", "description": "The announcement by Conaie was the first sign of a possible breakthrough in a dispute that has sparked national security concerns and cast doubt on Moreno's ability to carry out an austerity plan.", "authors": ["James Gant For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/13/19653920-0-image-a-18_1570969483069.jpg", "published_at": "2019-10-13"}