{"pub": "americanconservative", "url": "https://theamericanconservative.com/articles/idiocy-or-perfidy-how-we-get-hooked-on-foreign-democracy-movements", "downloaded_at": "2019-10-05 13:14:34.429891+00:00", "title": "Idiocy or Perfidy? How We Get Hooked on Foreign Democracy Crusades", "language": "en", "text": "Gullible Superpower: U.S. Support For Bogus Foreign Democratic Movements by Ted Galen Carpenter, 2019, Cato Institute, 300 pages\n\nFor the past 20 years, U.S. foreign policy has been marked by constant lies and unjustified killings, from the 1999 bombing of Serbia and the 2003 invasion of Iraq to Libyan regime change in 2011 and our role in the bloody Syrian war since 2012. What explains this unbroken record of deadly folly?\n\nAccording to Ted Carpenter, author of the new book Gullible Superpower, Washington policymakers have been deceived by foreign con men who claim to adore freedom and democracy. Carpenter has a far more sagacious foreign policy record over the past 30 years than either the White House or the Washington Post editorial page. His latest work captures, in his own words, “the lengthy, depressing record of U.S. support for bogus freedom fighters and democratic activists.”\n\nGullible Superpower walks readers through almost 40 years of pro-democracy shams. From Jonas Savimbi’s ludicrous authoritarian pro-freedom movement in Angola to the murderous Kosovo Liberation Army to the boundless rascality of Ahmed Chalabi, Carpenter recounts how the U.S. government bankrolled and supported one fraud after another. He also details how it intervened in Ukraine’s internal affairs, choosing to back the side with neo-Nazi elements in order to topple an elected pro-Russian government. (At least it worked out well for Joe Biden’s son.)\n\nAdvertisement\n\nGullible Superpower swats at some of the biggest connivers of our times. For example, Senator Joe Lieberman claimed that “fighting for the Kosovo Liberation Army is fighting for human rights and American values.” Lieberman did not rescind his endorsement after the former KLA leaders were linked to a scandal involving body snatching and selling human organs. John McCain was canonized as a saint after he died last year, despite or perhaps because of his endless mania for bombing foreign nations. In 2013, Mother Jones tabulated 13 different countries that McCain wanted to bomb, invade, or destabilize.\n\nCarpenter’s book is a blunt call for realism in U.S. foreign policy. But the deck is increasingly stacked against clear assessments of American interests abroad in part because of deluges of foreign funding for Washington advocacy. Oppressive regimes are buying better reputations as think tanks become “a muscular arm of foreign governments’ lobbying in Washington,” the New York Times reported in 2014. The Brookings Institution received a windfall from the government of Qatar to set up a research institute that would devote itself to “reflecting the bright image of Qatar in the international media, especially the American ones”—at least according to the Qatari government. The Atlantic Council, another prominent D.C. think tank, has pocketed cash from Saudi Arabia, Bahrain, the United Arab Emirates, and NATO. Facebook hired the Atlantic Council to help them decide which “extremist” or “hate” speech it should suppress (though it has thus far eschewed attaching an “Arab Dictator-Approved Censorship” label to such deletions).\n\nConsidering the perennial foreign debacles, the question arises: are U.S. policymakers fools, liars, or both? Carpenter’s tone in this book and in his articles over the decades has always been civil. Politeness is a virtue when dealing with reasonable people. However, politeness is only a mixed blessing when chronicling the perfidy of scoundrels.\n\nGullible Superpowers has an excellent chapter on the Iranian group Mujahideen-e-Khalq (MEK). That organization sprang up in the 1960s and proceeded to kill Americans in the 1970s and large numbers of Iranians in subsequent decades. NBC News reported in early 2012 that MEK had carried out killings of Iranian nuclear scientists and that it was “financed, trained and armed by Israel’s secret service.”\n\nThat was the same period during which a stampede of Washington hustlers took huge payoffs to publicly champion de-listing the MEK as a terrorist organization. As Trita Parsi noted in the New York Review of Books, MEK “rented office space in Washington, held fundraisers with lawmakers, or offered US officials speaking fees to appear at their gatherings. But the MEK did this openly for years, despite being on the US government’s terrorist list.”\n\nFederal law prohibited taking money from or advocating on behalf of any designated terrorist group. Yet a 2011 Huffington Post headline reported, “Former U.S. Officials Make Millions Advocating For Terrorist Organization.” That didn’t seem to matter much to former FBI boss Louis Freeh, former CIA boss Porter Goss, co-chair of the 9/11 Commission Lee Hamilton, former attorney general Michael B. Mukasey, and former homeland security secretary Tom Ridge, who were pocketing $30,000 or more for brief speeches to pro-MEK events.\n\nGlenn Greenwald rightly scoffed that the advocacy “reveals the impunity with which political elites commit the most egregious crimes, as well as the special privileges to which they explicitly believe they—and they alone—are entitled.”\n\nThe Obama administration was swayed to cancel the MEK’s terrorist designation in 2012 and Trump administration officials are babbling about MEK’s possible role in ruling Iran after the current government is toppled. MEK apologists continue to portray the group as idealistic freedom fighters devoted to democracy. A simple online search shows that the Farsi translation of the group’s name is “holy warriors of the people.” But as long as the MEK serves the purposes of the Saudi and Israeli governments and their American string-pullers, there will be plenty of Washingtonians who pretend that the Iranian people do not loathe MEK.\n\nForeign policy experts have become Washington’s preeminent con men. This is a playing field that will likely always be slanted against opponents of foolhardy interventions like Ted Carpenter. Vigorous criticism of foreign policy follies will always be needed. But don’t forget the ridicule.", "description": "", "authors": [], "top_image": "https://www.theamericanconservative.com/wp-content/uploads/2015/06/Barack-Obama-George-W-Bush-Bill-Clinton-Jimmy-Carter-Library.jpg", "published_at": "2019-10-02"}