{"pub": "washingtonpost", "url": "https://washingtonpost.com/dc-md-va/2019/09/16/womens-march-cutting-ties-with-three-original-board-members-accused-anti-semitism/?tid=pm_pop", "downloaded_at": "2019-09-16 23:13:31.649922+00:00", "title": "Women’s March replaces three original leaders, after anti-Semitism accusations, with 16 board members", "language": "en", "text": "\n\nWomen's March Co-Chairs Linda Sarsour and Tamika Mallory speak during the Power to the Polls voter-registration tour last year in Las Vegas. (Ethan Miller/Getty Images)\n\nThe Women’s March is replacing three inaugural board members who have been dogged by accusations of anti-Semitism, infighting and financial mismanagement — controversies some say have slowed the organization’s progress and diminished its impact.\n\nCo-Chairs Bob Bland, Tamika Mallory and Linda Sarsour stepped down from the board July 15, though the organization has been slow to announce their departures. The Women’s March website continued to host their photos and titles as co-chairs through this week, when the group announced the board turnover.\n\nA diverse cast of 16 new board members that includes three Jewish women, a transgender woman, a former legislator, two religious leaders and a member of the Oglala tribe of the Lakota nation will inherit an organization recovering from a failed attempt to trademark the Women’s March name and fractured relationships with local activist groups and the Jewish community.\n\n[What’s in a name? Women’s March groups spar over who owns the name and the movement.]\n\nThe shake-up comes at a critical time for the organization. With the 2020 election kicking into high gear, experts said organizers can no longer afford the distractions and controversies that have muddled the group’s message and loomed over its every move.\n\n“There’s an opportunity here for a group to rise out of the ashes of divisiveness and continue on with the mission that was the Women’s March, and, honestly, that would be wonderful,” said Dana R. Fisher, a sociology professor at the University of Maryland who studies and tracks protest movements. “There were so many things that were odd decisions, and decisions that made it unclear whether they actually cared about building toward a blue wave and building on the energy and enthusiasm that was built in 2017.”\n\nBland and Mallory, who served as co-presidents of the organization, will be formally replaced when the new board convenes for its first meeting this month. Once assembled, officials said, the incoming board will elect new leadership.\n\n\n\nWith the Capitol in the background, a crowd fills a street in the District during the Women's March on Jan. 21, 2017. (Oliver Contreras for The Washington Post)\n\nCo-Chair Carmen Perez, who runs the Gathering for Justice — a criminal justice reform group that seeks to end child incarceration and reform the justice system at large — will stay.\n\nA Monday afternoon statement from the organization described the departures by saying their terms had ended with the board. It thanked Sarsour, Mallory and Bland for their “groundbreaking work and sacrifices towards equal rights.”\n\nCalls for the co-chairs to resign rose to a crescendo ahead of the 2019 Women’s March on Washington, which drew thousands of women to the District in January sporting the movement’s telltale pink hats.\n\nMuch of the controversy stems from an incident when Mallory attended a Nation of Islam event at which black nationalist Louis Farrakhan made incendiary remarks about Jews. The march’s leadership tried to quell the outrage, reaching out to the Jewish community and denouncing anti-Semitism, but leaders stopped short of denouncing Farrakhan, who is known for making virulently anti-Semitic remarks.\n\nMallory didn’t respond to requests for comment on her departure, although the organization issued a statement Monday that said the three would “transition off of the Women’s March Board and onto other projects focused on advocacy within their respective organizations.”\n\nReached via text message, Sarsour said the new Women’s March board is “AMAZING,” adding that she will continue working to get voters to the polls in 2020.\n\n“I am grateful to the women who stepped up to shepherd the Women’s March,” she wrote. “This is what women supporting women looks like.”\n\nBland said the changeover was long planned by the outgoing leadership.\n\nThe new board members — several of whom acknowledged that the organization has made “mistakes and missteps” in the past — were selected by a nominating committee.\n\nThe new board members are:\n\n• Samia Assed, a Palestinian American activist from New Mexico who serves on the board of the Albuquerque Center for Peace and Justice and leads the organization’s New Mexico chapter.\n\n• Zahra Billoo, a civil rights attorney and executive director of the San Francisco Bay area chapter of the Council on American-Islamic Relations.\n\n• Charlene Carruthers, a self-described black, queer feminist who is the founding national director of BYP100 (Black Youth Project 100), a racial, gender and LGBT justice organization for black youth.\n\n• Mrinalini Chakraborty, executive director of Men4Choice, who has been a Women’s March organizer and national field director, and founded Women’s March Illinois.\n\n• Rabbi Tamara Cohen, who runs innovation for Moving Traditions, a national organization focused on teens and gender and Jewish identity, who spearheaded the creation of Tzelem, a group for transgender and non-binary youth.\n\n• The Rev. T. Sheri Dickerson, a co-founder of Black Lives Matter in Oklahoma.\n\n• Sarah Eagle Heart, a member of the Oglala Lakota Nation of the Pine Ridge Indian Reservation in South Dakota and the former CEO of Native Americans in Philanthropy.\n\n• Lucy Flores, a former Democratic state assemblywoman from Nevada who made headlines this year for accusing former vice president Joe Biden of inappropriate touching. She lives in Los Angeles, where she runs Luz Collective, an organization focused on empowering Latinas.\n\n• Ginny Goldman, a political strategist who founded the Texas Organizing Project in Houston.\n\n• Ginna Green, who runs the strategy arm of liberal Jewish group Bend the Arc and was among a group of Jewish women to lead the 2019 Women’s March on Washington.\n\n• Shawna Knipper, an advocate for organ transplants who received a kidney donation in 2014 and an organizer with Women’s March Pennsylvania.\n\n• Isa Noyola, a Latina transgender activist who serves as deputy director for Mijente, a national grass-roots hub for activism in the Latino community. She is the former deputy director of the Transgender Law Center and in 2015 organized the first national protest of violence against transgender people.\n\n• Kelley Robinson of the District, who serves as Planned Parenthood’s national organizing director.\n\n• Rinku Sen, an Indian American writer and civil rights activist who is the former executive director of racial-justice group Race Forward and publisher of Colorlines.com.\n\n• Leslie Templeton, a youth activist who has focused on disability, health care and drug policy and has served on the Women’s March Disability Caucus.\n\n• Lu-Shawn Thompson, widow of Brooklyn District Attorney Kenneth Thompson. She has worked to get more black women elected to political office.\n\nThe geographic diversity of the new board is a shift from a concentration in New York and Washington, where all of its previous board members were based.\n\nThe board’s first big task will be overseeing a protest next month in the District.\n\nOn Oct. 6, the group will host #ReclaimTheCourt, in which activists will gather to protest Supreme Court Justice Brett M. Kavanaugh’s appointment and “his work to overturn Roe v. Wade,” according to Women’s March organizers.\n\nThe group also will focus on seeing through a federal policy platform unveiled last year that outlined a 10-prong call to action for lawmakers. The platform, known as “the Women’s Agenda,” outlines priorities such as raising the federal minimum wage, addressing reproductive rights and violence against women, and passing the long-dormant Equal Rights Amendment.\n\n[Women’s March rolls out political platform before its third Washington rally]\n\nTo some, the plan to issue a legislative agenda on behalf of all women spoke directly to the growing rift at the center of the Women’s March movement: What began as a grass-roots collaboration by hundreds of distinct organizations and activists became increasingly defined by one group and its leadership team of four women.\n\nSeveral cities, including Washington, New York and Philadelphia, saw competing Women’s Marches in January, with groups offering alternative rallies for women who didn’t want to affiliate with the national group.\n\n\n\nPeople gather ahead of the start of the Women's March at Freedom Plaza in the District. (Salwan Georges/The Washington Post)\n\nEarlier this year, the national Women’s March organization abandoned its effort to trademark the words “women’s march,” bringing a splintering two-year battle over who owns the words and the movement to a close.\n\n[Women’s March group drops application to trademark name after two-year battle]\n\nMany organizers separate from the national Women’s March group celebrated the national group’s about-face as a victory for the movement. More than a dozen local organizations across the country formally opposed the national group’s trademark petition, claiming that no entity can own the words “women’s march” or the activism it inspired. Four of them sued.\n\nNew board members said they hope to change the focus and reputation of the Women’s March.\n\n“Most of us are new to this,” Green said. “We don’t have any relationship with the state chapters. I think we’re open to make sure we’re building the right movement for everyone.”\n\nFisher said research shows organizers of successful protest movements have strong relationships with stakeholders.\n\n“If this new board can’t turn the ship around and create an organization that can play well with others, they’ll be back in the same position as they were before,” she said.\n\nThe story of the Women’s March began in 2016 with a Facebook post calling for women to rally in the wake of Donald Trump’s election. As the new board convenes, members said the group plans to return to its roots in crafting priorities.\n\nThey said the main goal will be getting President Trump out of the White House.\n\n“The priority for me is really dealing with the very serious consequences of what the president and his administration is doing and causing,” Flores said. “Once we’re in the general [election], the number one priority will be to defeat Trump, and we will do whatever it takes.”\n\nSeveral newly appointed board members said the Women’s March’s biggest challenge remains its greatest strength: having a wide base of support among women with various life experiences and priorities.\n\n“There is so much energy to harness, and as we approach what may be the most challenging election of our lives — even more challenging than the last one — the biggest challenge the Women’s March will face is being able to harness our biggest strength and turn that energy into action,” Billoo said.\n\nRead more:\n\nThe Women’s March in Year 3: Can the movement overcome a year of controversy and division?\n\nThe Women’s March drew more moderates in its third year. It’s all Trump, researchers say.\n\nWill Jewish women attend the Women’s March amid allegations of anti-Semitism?", "description": "Calls for the co-chairs to resign arose before the 2019 Women’s March on Washington.", "authors": ["Marissa J. Lang", "Local Reporter Focused On D.C. Area News", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/bZyS6lEzJRAOsusv5XZwrgCDHrs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HRMEU5XNZAI6RC2HXUEXL7LBTE.jpg", "published_at": "2019-09-16"}