{"pub": "aljazeera", "url": "https://aljazeera.com/indepth/opinion/kremlin-anger-proof-navalny-winning-191020080901687.html", "downloaded_at": "2019-10-21 14:59:57.713595+00:00", "title": "The Kremlin's anger is proof that Navalny is winning", "language": "en", "text": "Since last summer, when tens of thousands of people took to the streets of Moscow to demonstrate against the exclusion of several opposition candidates from the city's local election on a technicality, voices critical of Russia's president Vladimir Putin have been under increased scrutiny. Government forces have been raiding opposition offices across the country, conducting searches at the residences of anti-corruption activists and arresting protest leaders on an almost daily basis.\n\nCharismatic opposition leader Alexei Navalny is at the centre of this most recent assault on dissent in Russia. He not only repeatedly called on his supporters to take to the streets, but also instructed them to vote strategically to block pro-Kremlin candidates in Moscow's September 8 city council election. As a result, Putin's ruling United Russia party lost a total of 13 seats on the city council and barely managed to hold on to its majority.\n\nThis, albeit minor, electoral upset proved to be a tipping point for the Kremlin and led to a crackdown on Navalny and his supporters.\n\nFirst, Russian investigators launched a money-laundering probe into the Anti-Corruption Foundation (FBK), a non-profit organisation founded by Navalny. The authorities also froze accounts belonging to the organisation and its employees across the country to guarantee the group's activities were brought to a halt.\n\nThe money laundering charges, however, did little to convince Navalny's supporters of the group's alleged corruption, as the accused were not only known to be living modest lives, but most of them had spent years trying to expose the hidden mansions, yachts and private jets of Russian officials who, on paper, earned lower middle-class salaries.\n\nLater, investigators raided dozens of regional FBK offices, as well as the homes of Navalny's known supporters.\n\nAnd finally, on October 9, the state declared the FBK, a \"foreign agent\" under a controversial law that bans political movements in Russia from receiving foreign funding. Russia started a list of so-called \"foreign agent organisations\", which heavily implies that these groups are covertly working for a foreign government, back in 2012. As a result, many of the groups on the list, including respected human rights organisations, closed down.\n\nWhile Russian officials offered no details on the reasons why the FBK was included in the list, an Interfax news agency report said regulators had found two undeclared foreign donations to the organisation - one from the US and another from Spain - totalling just over $2,000. Navalny's supporters, who insist the group functions solely on donations collected within Russia, are convinced that it is a setup.\n\nBut these acts of aggression and intimidation were only secondary tools used by the Kremlin to silence Navalny's movement. Their primary tool has always been acting as if Navalny does not even exist and imposing a media blackout on his activities.\n\nIn Putin's Russia, Navalny is \"the one whose name shall not be spoken\".\n\nPutin has famously never called his main political rival by name, even on the few occasions where he was cornered into talking about him. In 2017, when asked a direct question about Navalny, for example, Putin invoked the name of another, perhaps less intimidating political rival, and called the anti-corruption campaigner \"the Russian edition of Saakashvili\".\n\nA search on the website of Channel One, the Kremlin's flagship station, reveals only three reports - all negative - mentioning Navalny in 2019. Extending the search back to 2013 reveals just one more item about the opposition leader. More mentions date back to 2013 and earlier, but with 64 in total, it is a far cry from Putin's 28 thousand.\n\n\n\nThe mainstream Russian media's silence on Navalny is even more striking because not only is he the country's most prominent opposition figure, but a few years ago he ran a presidential campaign and set up regional offices across the country.\n\nThe geographic expansion of Navalny's movement was a major leap for the Russian opposition, which had previously been confined largely to Moscow and St Petersburg.\n\n\n\nThe Kremlin eventually barred Navalny from running in the 2018 presidential election in a move that exposed Putin's fear of running against an actual political rival rather than a group of stooges put forward to create the impression of a functioning democracy.\n\nThe current wave of repression is just another demonstration of the Russian leader's fear of genuine democratic competition.\n\nNavalny and his allies admit that the freezing of accounts and regular confiscations of pricey equipment hamper their quest to expose government corruption and show the Russian people the true face of the Kremlin. But they are not anywhere close to giving up. Navalny and his supporters are well used to all forms of intimidation and they seem ready and willing to take on anything the Kremlin may throw at them - including prison sentences and poisoning attempts.\n\nA truly organic movement independent from Western funding, Team Navalny keeps finding new ways of getting donations and delivering their message, defying the Kremlin's political attack dogs. Millions of Russians are watching this battle, despite the media blackout.\n\nThe trajectory of public opinion, reflected in opinion polls, clearly points towards Putin's decline. His approval ratings are sliding, as are those of the political institutions he presides over.\n\nBut, this is not 1989. The Western liberal democratic model is in crisis, while Russia's East and Central European neighbours, from the Baltic to Adriatic seas, are toying with versions of illiberalism and authoritarianism which are increasingly reminiscent of Russia's own. Putin can still get a public opinion boost at home if the West surrenders Ukraine to him the way President Donald Trump has just effectively surrendered Syria.\n\nPutin's opponents are trying to reinvent Russia in the absence of viable role models. They are waging a lonely battle in the dark. But with a bit of luck, it may result in something more organic and sustainable than the defective democracy and cannibalistic capitalism that took over Russia following the collapse of the Soviet Union and which paved the way for the rise of Putin.\n\nThe views expressed in this article are the author's own and do not necessarily reflect Al Jazeera's editorial stance.", "description": "Despite attempts to silence the opposition leader, the trajectory of public opinion is shifting away from Putin.", "authors": ["Leonid Ragozin", "About The Author", "Leonid Ragozin Is A Freelance Journalist Based In Riga."], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/20/68dbf629aae9411cb6582b5578b48dd5_18.jpg", "published_at": "2019-10-21"}