{"pub": "indiatimes", "url": "https://indiatimes.com/news/choking-in-delhi-and-elsewhere-here-are-five-simple-things-you-can-do-to-fight-pollution-378757.html", "downloaded_at": "2019-10-29 07:45:54.240593+00:00", "title": "Choking In Delhi And Elsewhere? Here Are Five Simple Things You Can Do To Fight Pollution", "language": "en", "text": "Choking In Delhi And Elsewhere? Here Are Five Simple Things You Can Do To Fight Pollution\n\nChoking In Delhi And Elsewhere? Here Are Five Simple Things You Can Do To Fight Pollution\n\nThe arrival of winter brings with it fears of rising pollution levels in north India as year after year, new records are broken in the shameless tally.\n\nThis year again, the case is not very different if we were to consider pollution in and around Delhi and although the air quality had been very bad for a while, it touched the severe mark on Monday, a day after Diwali.\n\nREPRESENTATIONAL IMAGE. BCCL\n\nElaborate preparations were in place and people were discouraged from bursting firecrackers. Even a directive from the Supreme Court had last year prevented the use of firecrackers. The Delhi government also organised a mega laser show to attract people so that they refrain from bursting crackers.\n\nAt the same time, Stubble burning in Punjab and Haryana further adds to the woes of Delhiites, and those residing in adjoining areas.\n\nDon't Miss 322 SHARES 296 SHARES\n\nAll said and done, Diwali is over and our air quality is no good despite all claims of it having improved from the previous years post the festival. We are still choking. According to estimates by global environment and health bodies nobody can be a non-smoker in Delhi as its air is equivalent to smoking cigarettes.\n\nBCCL/ FILE\n\nThere are five simple steps that World Health Organisation had earlier urged people to follow in order to reduce pollution. Although most of them are unlikely to bring about a radical change overnight but if people genuinely follow these in their day-to-day lives on a long-term basis, we can surely make a lot of difference and perhaps live to breathe fresher air.\n\nThese five-points are worth a revisit as we are increasingly tending to divide a major crisis such as this into smaller fragments.\n\nDo not drive during rush hour\n\n\n\n\n\nWalk to your workplace if possible\n\n\n\n\n\nOpt for electric vehicles\n\nDon’t burn your waste\n\nTurn off light and electronics after use\n\n\n\n\n\nThese are only a handful of simple things that you can do on a daily basis but besides these too, all of us know deep down in our hearts where we are going wrong. Pollution is not falling like rain from the skies, it’s a thing of our own making and only our concerted efforts can turn the wheels once again.\n\nWe can start small, by conserving energy wherever we are, at workplace, home or in a hotel. Then we should also be careful and opt for products with Energy-star label.\n\nOther simple steps to fight pollution includes car pooling, which is anyways finding a lot of takers these days. But even if you are not car pooling, opting for public transport or riding a bicycle is always an option. If you are driving in a personal car on a regular basis, ensure that its tyres are properly inflated as it will reduce the consumption of fuel as well as the release of toxic materials into the atmosphere.", "description": "The arrival of winter brings with it fears of rising pollution levels in north India as year after year, new records are broken in the shameless tally. This year again, the case is not very different if we were to consider pollution in and around Delhi and although the air quality had been very bad for a while, it touched the severe mark on Monday, a day after Diwali.", "authors": ["Saket Suman"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/diwali_1572264056_800x420.jpg", "published_at": "2019-10-28"}