{"pub": "yahoo", "url": "https://sg.news.yahoo.com/iraqi-kurds-turn-zoroastrianism-faith-identity-entwine-003150513.html", "downloaded_at": "2019-10-25 01:47:52.095265+00:00", "title": "Iraqi Kurds turn to Zoroastrianism as faith, identity entwine", "language": "en", "text": "Iraqi Kurd Faiza Fouad takes part in a ritual ceremony in an ancient and ruined temple as she joins the millennia-old Zoroastrian religion\n\nIn a ceremony at an ancient, ruined temple in northern Iraq, Faiza Fuad joined a growing number of Kurds who are leaving Islam to embrace the faith of their ancestors -- Zoroastrianism.\n\nYears of violence by the Islamic State jihadist group have left many disillusioned with Islam, while a much longer history of state oppression has pushed some in Iraq's autonomous Kurdish region to see the millennia-old religion as a way of reasserting their identity.\n\n\"After Kurds witnessed the brutality of IS, many started to rethink their faith,\" said Asrawan Qadrok, the faith's top priest in Iraq's autonomous Kurdish region.\n\nDuring Fuad's conversion ritual in Darbandikhan, near the Iranian border, a high priest and his assistants wore white clothes representing purity and recited verses from the Zoroastrian holy book, the Avesta.\n\nThey knotted a cord three times around Fuad's waist to symbolise the faith's core values of good words, good thoughts and good deeds.\n\nThe newcomer raised her hand and swore to abide by those three values and to protect nature, respecting water, air, fire, earth, animals and humans.\n\n\"I feel very happy and refreshed,\" Fuad said, adorned with her Farawahar necklace, a powerful spiritual symbol given to her by the high priest.\n\nShe said she had been studying Zoroastrianism for a long time and was drawn to its philosophy, which \"makes life easy\".\n\n\"It is all about wisdom and philosophy. It serves mankind and nature,\" she said.\n\n- Forced into secrecy -\n\nZoroastrianism was founded in ancient Iran some 3,500 years ago, gaining followers as far afield as India.\n\nIt was the official religion of the powerful Persian empire for a thousand years, but the assassination of the final Zoroastrian king in 650 and the rise of Islam sent it into a long demise.\n\nHowever the faith did survive -- often in the face of severe persecution -- and famous followers include Freddie Mercury, whose Zoroastrian family were originally from Gujarat in western India.\n\n\"During (late dictator) Saddam Hussein's rule, my father practiced Zoroastrianism but kept it secret from the state, our neighbours and relatives,\" said Awat Tayib, who represents the faith at the regional government's ministry of religious affairs.\n\nIn 2014, IS jihadists captured swathes of northern Iraq, carrying out what may have constituted a genocide against another minority, the Yazidis.\n\nThe extremists imposed a violent version of Islamic law and sparking a three-year war that eventually left their self-proclaimed \"caliphate\" in tatters and the region in ruins.\n\n\"Many think IS values are very odd in contrast with Kurdish values and traditions, so some have decided to abandon their faith,\" high priest Qadrok said, adding that he performs ceremonies every week to welcome new converts.\n\nThe religion only gained official recognition by regional authorities in 2015, but since then, three new temples have opened -- although Tayib said the state has yet to build a cemetery for followers of the religion.\n\nFor some in the autonomous region, which overwhelmingly voted for independence in a 2017 referendum bid, turning to Zoroastrianism is a way for a stateless people to assert regional identity in defiance of Baghdad.\n\nTayib, the only female religious representative in the autonomous government, said Kurdish society is becoming more tolerant towards Zoroastrians.\n\nAFP accompanied the high priest and his assistants to Islamic Friday prayers organised to condemn a Turkish military incursion into Kurdish parts of northern Syria.\n\nAs the Zoroastrian religious men arrived, they were surrounded by Muslims welcoming them and asking for selfies.\n\nIslam is still by far the main religion in the Iraqi Kurdistan, while there are no official figures on Zoroastrians.\n\n\"The Zoroastrians are our brothers, not our enemies: our enemies are the ones who are killing us, such as (Turkish President Recep Tayyip) Erdogan,\" said Islamic cleric Mullah Saman, who welcomed the Zoroastrians.\n\nAzad Saeed Mohammad, the head of Yasna, a body which promotes Zoroastrianism in Kurdistan, said Kurds \"need to have their own religion just like other nations in the Middle East in order to save themselves from aggression and invaders\".\n\n\"We need to use our ancient religion to revive our identity and build the nation,\" he said.", "description": "Zoroastrianism.  Years of violence by the Islamic State jihadist group have left many disillusioned with Islam, while a much longer history of state oppression has pushed some in Iraq's autonomous Kurdish region to see the millennia-old religion as a way of reasserting their identity.  \"After", "authors": ["Qassim Khidhir"], "top_image": "https://s.yimg.com/uu/api/res/1.2/yDYVqn9yhrpVnm.puWgoOw--~B/aD00OTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_sg/News/AFP/16419e7c8fa408ce4522518e9985a15b227fd534.jpg", "published_at": "2019-10-25"}