{"pub": "news24", "url": "https://traveller24.com/Explore/Islands/indian-ocean-family-escapes-beach-busting-holidays-for-south-africans-20160626", "downloaded_at": "2019-10-07 20:08:19.721192+00:00", "title": "Indian Ocean escapes: Beach-busting holidays for South Africans", "language": "en", "text": "YOU MIGHT ALSO LIKE {{item.title}}\n\nIt is no secret us ‘Saffas’ adore our beach holidays. Even more so if we can make it a family affair. So bundle up your brood and head to the Indian Ocean Islands for some of the close-to-home, family friendly beach breaks to suit your pocket.\n\nTwo of our favourites certainly are Mozambique and The Seychelles. We caught up with Natalie Tenzer-Silva, Director at Dana Tours, to ask what her top picks for a a family break are. Take a look.\n\nMozambique\n\nTofo beach, Inhambane Province\n\nWhy: Arguably one of the most beautiful beaches in the world, Tofo Beach offers picture-perfect white sand, crystal clear warm water and palm trees. The 8km stretch of sandy beach seems to go on forever as it winds and hugs the shores where the Atlantic Ocean and the southern coast of Mozambique meet. Tofinho, or ‘Little Tofo’ is in the same area, offering a quieter scene which is just a nine-minute walk away.\n\nLook forward to: Great for activities like scuba diving, surfing and backpacking which make the beach and its location ideal for adventure minded not minding the occasional dose of relaxation.\n\nPonta do Ouro, South of Maputo, just north of the border with South Africa\n\nWhy: The town is famous for its beach, dolphins and deep-sea fishing. While there are other places in the world where you can swim with dolphins, Ponta do Ouro‘s dolphin tours stand out as being more personalised and put a strong emphasis on conservation awareness, making it the perfect destination for families. South Africans also flock to this area for some deep-sea diving and with eight diving centres, both beginners and advanced divers get to enjoy the thrilling experience.\n\nLook forward to: Beach walks, shopping and eating can be added to your list of things to do in the area.\n\nMacaneta Beach, Mozambican Peninsula island of Macaneta\n\nWhy: Macaneta Beach is yet another perfect beach destination for South Africans. With the Nkomati River and the Indian Ocean as its borders, Macaneta is the jewel in the crown of the Maputo province, and for centuries has fulfilled the role of weekend getaway and holiday destination for South Africans.\n\nLook forward to: Macaneta offers pristine beaches, whale watching, game fishing and it is also home to the delicate breeding grounds of the giant leatherback turtle. Bring the family, go backpacking or simply slip away for a romantic retreat.\n\n\n\n\n\nPemba Beach, Pemba, formerly known as Porto Amelia, is a stunning gateway to the Quirimbas Archipelago and Quirimbas National Park.\n\nWhy: With its relaxed feel and gorgeous architecture, it is no wonder that Pemba is such a popular Mozambique tourist destination. Pemba offers modern amenities including an airport, banks and traditional markets. Stunning coral reefs lie close to the shore providing wonderful diving and snorkelling adventures while the Boabab forests that surround the beach are a boon for nature lovers.\n\nLook forward to: Because of its ideal location near the Quirimbas National Park, Pemba is perfect for a safari, sun, sea and sand experience that the entire family can enjoy.\n\n\n\n\n\nVilanculos, Bazaruto Archipelago\n\nWhy: If you have Bazaruto on your bucket list, Vilanculos should be on the agenda. Whether you’re in pursuit of a beach holiday or a break with lots of activities, the extraordinary mix of friendly people and rustic surroundings that Vilanculos has to offer will captivate you.\n\nLook forward to: Scuba diving, backpacking, kitesurfing and wildlife watching are a few of the activities that will allow for endless family fun. The best activity though is to go island hopping on the dhows that set out to sea all times of the day.\n\n\n\n\n\nSeychelles\n\nBeau Vallon, Mahé\n\nWhy: Mahé's most popular beach offers a 3km crescent of white-sand beach dotted with takamaka trees and coconut palms. There is an area specifically marked out for swimmers, and lifeguards are present at all times. Despite Beau Vallon’s popularity, it is still surprisingly crowd-free.\n\nLook forward to: Beau Vallon offers plenty of activities to keep the entire family occupied including parasailing, snorkelling, diving, sailing, and delicious Seychelles eateries.\n\nBird Island, private northern-most island in the Seychelles archipelago\n\nWhy: For nature-loving families, Bird Island is the obvious choice. The clear Indigo blue waters offer a variety of sea-life and you are most likely to spot dolphins from October to December and March to May. Bird Island is also a haven for turtles laying their eggs, especially between October and February when Hawksbill turtles crawl ashore and lay their eggs.\n\nLook forward to: Join an eco-tour with the resident conservationist, who'll enthusiastically tell you about the breeding habits of turtles.\n\nAnse Lazio, Praslin\n\nWhy: True relaxation. With its calm, shallow waters, Anse Lazio make it the ideal spot for families.\n\nLook forward to: It will be difficult to find a better spot for swimming and snorkelling and the beachfront restaurants are sure to satisfy even the most peckish of families.\n\nOr download the News24 App here to receive expertly curated travel ideas and deals directly to your mobile.", "description": "It is no secret us ‘Saffas’ adore our beach holidays. Even more so if we can make it a family affair.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/4142/0e4fb55978e94197b826b4151ba84cc7.jpg", "published_at": "2019-10-06"}