{"pub": "nationalreview", "url": "https://nationalreview.com/corner/notre-dame-law-school-dean-freedom-of-speech-matters", "downloaded_at": "2019-10-10 18:35:36.611692+00:00", "title": "Notre Dame Law School Dean: ‘Freedom of Speech Matters’", "language": "en", "text": "I wrote last week about discouraging news out of my alma mater, the University of Notre Dame. This week, something more positive: G. Marcus Cole, dean of the Notre Dame Law School, has issued an excellent statement affirming the value of free speech in advance of Attorney General Bill Barr’s visit to campus.\n\nHere’s some of what Cole had to say:\n\nFrom time to time, speakers will be invited by the Law School, faculty, student groups, or organizations affiliated with the University of Notre Dame, to speak at the Law School. Sometimes those speakers are government officials responsible for controversial policies. Sometimes they are people who are known to espouse controversial points of view. As long as they are here at Notre Dame Law School, they are free to say whatever is on their mind within the bounds of law. Freedom of speech matters. As Frederick Douglass once said, “To suppress free speech is a double wrong. It violates the rights of the hearer as well as those of the speaker.” Just as speakers are free to speak, protesters are free to protest. They must do so in a place and manner that respects the rights of speakers to speak and listeners to listen, and that is consistent with the educational mission of the Law School. Student groups and other organizations which hold contrary points of view have every right to schedule their own programs with their own speakers, and these speakers’ rights will be protected in just the same way. Notre Dame Law School will neither endorse nor condemn invited speakers. An institution of higher education must be a place where controversial ideas and points of view are expressed, heard, and discussed.\n\nGood for Cole. This sets down an important marker in the debate over free speech on college campuses. A statement like this shouldn’t be considered brave — it should be commonplace, routine on campuses across the country — but unfortunately statements like this one are far too rare from administrators at our nation’s most prominent universities. More should learn from his example.", "description": "Dean G. Marcus Cole issued an excellent statement affirming the value of free speech in advance of Attorney General Bill Barr’s visit to campus.", "authors": ["Alexandra Desanctis", "Jim Geraghty", "Victor Davis Hanson", "John Mccormack", "A. G. Hamilton", "Zachary Evans", "Andrew C. Mccarthy", "Read More", "The American Conservative", "The Week"], "top_image": "https://s0.wp.com/i/blank.jpg", "published_at": "2019-10-10"}