{"pub": "marketwatch", "url": "https://marketwatch.com/story/one-big-stock-is-holding-up-the-entire-stock-market-right-now-says-allianz-strategist-2019-09-26", "downloaded_at": "2019-09-26 20:52:42.207633+00:00", "title": "One big stock is holding up the entire stock market right now, says Allianz strategist", "language": "en", "text": "Could one well-known mega cap stock be supporting the rest of the market right now?\n\nYes, and for good reason, says Neil Dwane, global strategist at Allianz Global Investors, who says investors are leaning more on that old favorite Microsoft Corp. MSFT, +0.13% as regulatory wagons circle around some popular names in the tech, internet and media space.\n\n“We’re a Microsoft market,” Dwane told MarketWatch in a recent interview. “It is the least affected by regulation and trade issues.” And it just rewarded its faithful recently with an 11% dividend increase and the approval of a new $40 billion stock buyback program.\n\nWhile Microsoft isn’t one of the quarter’s best performers, with a gain of just over 3%, it’s the seventh best performer year to date with a 37% gain. That puts it right up there in the top ten with defensive names like Lockheed Martin LMT, +0.64%, Mastercard MA, +0.42% , Costco COST, -0.09% and Starbucks SBUX, -0.61%. Amid growing concerns about the U.S. economy, defensive stocks have become popular this year, as they represent companies that offer services or products that are in demand through good and bad economic times.\n\nMicrosoft’s gains this year put it just one place behind Apple AAPL, -0.52% , which some would consider a defensive play considering its products are always in demand.\n\nDwane said Microsoft’s has also become a go-to stock by investors who are scared by regulation surrounding other big popular names, such as some of the big FANG (Facebook, Amazon AMZN, -1.61%, Netflix NFLX, -0.54% and Google parent Alphabet GOOGL, -0.29%, ) members. That acronym can be stretched to include Apple — FAANG.\n\nFacebook was back in the news on Thursday, amid a report that the U.S. Justice Department had initiated a probe into the social media group for anti-competitive practices. The Federal Trade Commission has already begun an enquiry into Facebook but did not return requests for comment on the report.\n\n“I think the momentum behind Facebook and Alphabet is constrained by tax regulation in Europe and by the Justice Department investigations into their monopolies which will end up with them being broken up,” said Dwane. And obviously Apple is constrained by the fact that its new business model is to undercut everyone from Disney to Netflix..and to cut their iPhone prices by 35%,” he said.\n\n\n\nHe also thinks with all the regulatory questions around some of those popular stocks, it will “only be a matter of time before Amazon is drawn into an investigation,” he said. He adds that investors are also worried that if Democratic Sen. Elizabeth Warren wins the presidential nomination next year, she could be one step closer to the presidency and to many she represents more regulation for companies.\n\nThe fact Microsoft is \"holding up the market,” is precarious for investors as that means the market is leaning on fewer leaders to drive it higher, he says.\n\n“Normally in a bull market everything is going up,” said Dwane.\n\n“We’re now seeing tech is splitting into enterprise software names like Microsoft,” he said. “I think the chip names, while buoyant, are very, very sensitive to the atmosphere around China and trade and the FAANGy names that have moved into media and consumer services have just got regulation written all over them. Therefore I think many investors are not inclined to chase those companies at the moment, in that environment.”", "description": "Microsoft is turning into a clear favorite these days for investors who are running scared of regulatory issues for their favorite stocks.", "authors": ["Barbara Kollmeyer", "Markets Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS133_x_clou_ZG_20190926104915.jpg", "published_at": "2019-09-26"}