{"pub": "scmp", "url": "https://yp.scmp.com/news/hong-kong/article/114479/hong-kong-protests-friends-radical-student-protesters-should-help-them", "downloaded_at": "2019-10-15 11:21:15.637119+00:00", "title": "Hong Kong protests: Friends of radical student protesters should help them gain perspective and defuse tensions", "language": "en", "text": "The most effective way to help your friends who have been emotionally affected by the current events in Hong Kong is to talk to them. According to an expert, talking to them and showing that you care will help calm them down.\n\nOn Tuesday, a Form Six student from De La Salle Secondary School N. T., in Sheung Shui, was charged with wounding with intent after allegedly slashing a sergeant’s neck with a box cutter during Sunday’s anti-government protests in Kwun Tong.\n\nThe charge carries a maximum sentence of life imprisonment and the case was heard in the Eastern Magistrates’ Courts on Tuesday afternoon.\n\nPolice officer slashed in neck, another drop-kicked during 19th straight weekend of demonstrations\n\nLocal media also reported that the police found the 18-year-old student’s will at his home.\n\nDr Wan Lap-man, the supervisor of Services for Youth at Risk at Hong Kong Playground Association, said the student might be overly caught up in the social movement. Given the facts, Wan suspected that the student was suffering from depression and saw no hope for the future.\n\n“The cognitive thinking of people who already suffer from mental health conditions could be twisted,” said Wan, a registered social worker. “For example, they might perceive things in [completely different ways]. Their analytical thinking could also turn very radical.”\n\nFace off: Should we talk about politics in schools?\n\nIn the current situation, Wan said such people might become pessimistic about their current social conditions and move towards the “give me liberty or give me death” mentality.\n\n“When emotions take over a person, their decision-making would be affected,” Wan added. “Although we can’t be sure about the 18-year-old student’s intentions now, the act and consequences of slashing the policeman in the neck might not be thoroughly considered.”\n\nWan pointed out that a dangerous situation may arise from the incident.\n\nStudents at Hong Kong Design Institute vandalise campus, demanding surveillance footage of classmate found dead in sea\n\n“Some students might consider the 18-year-old as a hero and glorify his actions and even call him a martyr. For those who already share the same mentality as this student, they might start imitating his actions.”\n\nWan said people should try to calm their aggressive friends down, perhaps by trying to discuss whether it really would be the end of the world if the five protester demands aren’t met.\n\nThere have been and will continue to be, though, critical moments, where talking things out isn’t possible. At those times, Wan suggests simply asking them to calm down.\n\nMental health in Hong Kong amid ongoing protest is at an all-time low but there is help\n\n“It won’t help if you preach, or [try to] analyse the whole situation with them in great detail,” Wan said. “There’s simply no room for that [kind of] discussion. Instead, we need to remind them that there’s a way out.”\n\nDe La Salle has said it will not expel the student who attacked the officer.\n\n“It is a serious case, and our teachers and students are all very upset and concerned after learning of his arrest,” De La Salle’s vice-principal, Poon Man-yiu, said.\n\nIs your mental health suffering? It might be compassion fatigue\n\n“But I believe the school’s priority right now is to offer help and support to him and his family, and to remind students to stay away from dangerous public events at this tense time in our society.”\n\nPoon said school staff had visited the student at Tseung Kwan O Police Station on Sunday night, where he was still detained.\n\nAs of Tuesday, the injured sergeant is in a stable condition at United Christian Hospital in Kwun Tong.\n\nEdited by M. J. Premaratne", "description": "The advice from a social worker comes after a Form Six student from De La Salle Secondary School was charged with attacking a police officer.", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/24df4b5c-ef29-11e9-9f3d-785f2d889e39imagehires183239.jpg", "published_at": "2019-10-15"}