{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-rugby-union-worldcup-aus-ury/seven-try-australia-rout-uruguay-to-inch-towards-quarters-idUKKBN1WK046", "downloaded_at": "2019-10-05 12:24:27.539846+00:00", "title": "Seven-try Australia rout Uruguay to inch towards quarters", "language": "en", "text": "OITA, Japan (Reuters) - Twice champions Australia overcame a sloppy start to crush Uruguay 45-10 on Saturday, forging towards the World Cup quarter-finals with some exhilarating running rugby despite their problems with high tackles resurfacing at Oita Stadium.\n\nRugby Union - Rugby World Cup 2019 - Pool D - Australia v Uruguay - Oita Stadium, Oita, Japan - October 5, 2019 Australia's Jack Dempsey and Uruguay's Manuel Leindekar during a lineout REUTERS/Edgar Su\n\nWrecking ball centre Tevita Kuridrani and Dane Haylett-Petty each crossed twice each, with teenage winger Jordan Petaia sparkling with a try on debut under the domed roof.\n\nScrumhalf Will Genia and prop James Slipper also grabbed five-pointers for the Wallabies, who shrugged off the heartbreak of their Wales defeat with flair and determination.\n\nAustralia had trouble getting low enough in their tackling, with both lock Adam Coleman and loose forward Lukhan Salakaia-Loto yellow-carded in an eventful opening half.\n\nBut the Wallabies, wearing their indigenous strip for the first time at a World Cup, were able to mitigate the damage to lead 19-3 at the break before throwing down the hammer in a dominant second half.\n\nThe result put Australia top of Pool D ahead of second-placed Wales, putting pressure on the Welsh to beat Fiji at the same venue on Wednesday.\n\nAustralia coach Michael Cheika was disappointed with his team’s third slow start for the tournament.\n\n“That’s three games now, a little bit off the pace at the start. I’ll have to work on my pre-match speeches.\n\n“(Uruguay) are big-hearted and they take it to you and they’ve obviously improved since the last World Cup.”\n\nIt was a tough day for Uruguay, desperate to impress the powers of global rugby, but they were rewarded with a late try to Manuel Diana in the final minutes.\n\n“I think in the first half we did a really good job but Australia are a really big and fast team. We have to get better for our next match against Wales,” said Andres Vilaseca, who stood in for benched regular skipper Juan Gaminara.\n\nThe South Americans will take heart from not conceding as many points as they did in the 2015 tournament, when they lost 65-3 to the Wallabies.\n\nAustralia had 12 changes to the starting side that lost 29-25 to Wales, with James O’Connor a late withdrawal for a cork injury.\n\nThey came out firing but it was a stroke of fortune that created the first try, with a ricochet off the boot of Kurtley Beale taking the ball to the try-line.\n\nWith the defence scrambling, Australia whipped the ball cross-field where unmarked winger Haylett-Petty jogged over at the right corner for an easy score in the sixth minute.\n\nUruguay battled back, with Felipe Berchesi slotting a penalty when Wallabies captain Michael Hooper put a high tackle on Nicolas Freitas as the winger darted toward the line.\n\nA minute later, Australia were down a man, when Coleman was given a yellow card for also going high on fullback Rodrigo Silva.\n\nThe action bypassed Petaia in the opening quarter, but he made an impact with his first touch, rumbling the ball toward the line, then linking up with Beale a moment later to sidestep two defenders and pirouette over the line for a 24th minute try.\n\nBeale escaped a yellow for a high tackle but Salakaia-Loto was not so lucky, being sent off for what seemed a less egregious offence a few minutes after Coleman had returned to the field.\n\nAgain, Australia brushed off the setback, with the powerfully built Petaia bursting through on the left wing and offloading to Kuridrani for a try on the half-hour mark.\n\nUruguay would not lie down, though, and a huge roar echoed under the domed roof when centre Tomas Inciarte charged down the right wing for a turnover try a minute before halftime.\n\nIt was to a fleeting moment of triumph for the South Americans, however, with the try cancelled by a video review which showed Diana was off-side when he plucked the ball from the ruck.\n\nSlideshow (9 Images)\n\nAustralia came out with renewed intent and needed only six minutes to claim the bonus point, with Kuridrani waltzing through a huge hole at midfield to cross near the right corner.\n\nThe game then descended into a training run for the Wallabies as green and gold jerseys began punching holes through the Uruguayan line at will.", "description": "Twice champions Australia overcame a sloppy start to crush Uruguay 45-10 on Saturday, forging towards the World Cup quarter-finals with some exhilarating running rugby despite their problems with high tackles resurfacing at Oita Stadium.", "authors": ["Ian Ransom", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191005&t=2&i=1437309815&w=1200&r=LYNXMPEF9404L", "published_at": "2019-10-05"}