{"pub": "indiatimes", "url": "https://indiatimes.com/entertainment/celebs/manish-malhotra-s-lit-diwali-party-ranbir-alia-s-wedding-invite-is-fake-more-from-ent-378368.html", "downloaded_at": "2019-10-22 14:03:10.615039+00:00", "title": "Manish Malhotra's LIT Diwali Party, Ranbir-Alia's Wedding Invite Is Fake & More From Ent.", "language": "en", "text": "At a panel discussion titled “Films as an agent of social change” at the ongoing Jio MAMI 21st Mumbai Film Festival, Khan was asked if writers and directors in the Hindi film industry were being put under such pressure to make pro-India, pro-Hindu content.\n\nDiwali week has finally begun and Bollywood celebrities are in full party mood. It is officially the season of card parties and it kickstarted with Farah Khan's special lunch and a Diwali bash hosted by Fashion designer Manish Malhotra.\n\nAs if wedding rumors were not enough that now a card hinting at their Winter wedding in January is doing rounds on the internet. In dramatic twist of events, a wedding card announcing Ranbir Kapoor and Alia Bhatt's wedding details surfaced on the social media circuit.\n\nDon't Miss 130 SHARES 158 SHARES\n\nHowever, recently an incident that happened on the sets of the show left many cringing. In a promo clip shared by Sony Entertainment Television that is now viral, a man dressed in Rajasthani costume appears for an audition and then calls Neha on stage with him.\n\nBut now looking back from where he started out, Rajkummar Rao recalls his struggling days. In an interview with a leading entertainment portal, Rajkummar Rao said, \"I was paying Rs 7000 of my share which I thought was too much. I needed around 15-20000 every month to survive and there were times I would get a notification that I have only 18 rupees left in my account. My friend would have 23 rupees.\"", "description": "Diwali week has finally begun and Bollywood celebrities are in full party mood. It is officially the season of card parties and it kickstarted with Farah Khan's special lunch and a Diwali bash hosted by Fashion designer Manish Malhotra.Diwali week has finally begun and Bollywood celebrities are in full party mood. It is officially the season of card parties and it kickstarted with Farah Khan's spe", "authors": ["Saloni Singh"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/wrap_1571748362_800x420.jpg", "published_at": "2019-10-22"}