{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/susan-rice-obama-national-security-adviser-slams-u", "downloaded_at": "2019-10-08 16:21:40.600902+00:00", "title": "Susan Rice, Obama national security adviser, slams U.S. withdrawal from Syria: 'It's just appalling'", "language": "en", "text": "President Trump was sharply criticized by his predecessor’s longtime national security adviser for announcing the sudden withdrawal this week of U.S. troops from Syria near Turkey.\n\nSusan Rice, the national security adviser for four years under former President Barack Obama, offered her unfiltered reaction to Mr. Trump’s decision during an interview that aired Monday evening on CBS’ “Late Show with Stephen Colbert.”\n\n“I woke up this morning to hear that news and, as I do it seems about six days a week, I just put my head in my hands. This is bats—t crazy,” Ms. Rice said on the program.\n\nThe White House announced late Sunday that the U.S. would remove its troops from northern Syria, where American forces have fought for years alongside Kurdish fighters against the Islamic State terrorist group also known as ISIS, catching Mr. Trump’s allies off guard and prompting rebuke from across Washington.\n\n“These are the people who for the last four years have been fighting on our behalf with our equipment to defeat ISIS,” Ms. Rice said about the Kurds. “And they have done it with enormous efficacy, and they’ve sacrificed immensely, and we basically just said to them, ‘See ya.’ “\n\n“And it’s just appalling because we promised them our partnership. And we promised them that if they worked with us to defeat our common enemy, but particularly our — the United States and the western enemy — that we would stand with them,” Ms. Rice said. “And Trump woke up on the wrong side of the bed, it appears, and decided never mind.”\n\nIn a series of tweets on Tuesday, Mr. Trump maintained that the U.S. isn’t turning its back on the Kurds.\n\n“We may be in the process of leaving Syria, but in no way have we Abandoned the Kurds, who are special people and wonderful fighters. Likewise our relationship with Turkey, a NATO and Trading partner, has been very good,” he tweeted. “Turkey already has a large Kurdish population and fully understands that while we only had 50 soldiers remaining in that section of Syria, and they have been removed, any unforced or unnecessary fighting by Turkey will be devastating to their economy and to their very fragile currency. We are helping the Kurds financially/weapons!”\n\nDemocrats and Republicans alike denounced the withdrawal after it was announced late Monday, with some of Mr. Trump’s staunchest defenders calling his decision into question.\n\n“The President’s decision to withdraw U.S. forces from Northern Syria is a deeply disturbing development that betrays our Kurdish allies who have been instrumental partners in our mission to eradicate ISIS,” House Speaker Nancy Pelosi, California Democrat, said in a statement.\n\nSen. Lindsey Graham, South Carolina Republican, called it “a disaster in the maker,” and Senate Majority Leader Mitch McConnell, Kentucky Republican, said that “it would increase the risk that ISIS and other terrorist groups regroup.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "President Trump was sharply criticized by his predecessor's longtime national security adviser for announcing the sudden withdrawal this week of U.S. troops from Syria near Turkey.", "authors": ["The Washington Times Http", "Andrew Blake"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2018/10/16/AP_16132544760301_c0-0-5184-3022_s1770x1032.jpg?f8af44803671c941549f723d1fe30bad83d555a9", "published_at": "2019-10-08"}