{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/burglar-who-murdered-shopkeeper-suspended-20558150", "downloaded_at": "2019-10-11 12:32:28.255366+00:00", "title": "Burglar who stabbed shopkeeper to death then stole £100 is jailed for 32 years", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA 'one-man crimewave' who stabbed a shopkeeper to death has been jailed for life and will serve a minimum of 32 years behind bars.\n\nAlex Gunn, 31, was found guilty of the murder of 54-year-old Ravi Katharkamar earlier this week.\n\nThe Old Bailey heard today Gunn was on a suspended sentence at the time of the killing.\n\nGunn attacked the father-of-two, then stole £100 and went on to burgle two homes. He drove off in a car he had stolen.\n\nThe career criminal was armed with a large kitchen knife when he entered the newsagent in Pinner, north west London in March.\n\n(Image: PA)\n\nMr Katharkamar was found collapsed by a jogger who called police at 6am, but he was pronounced dead at the scene from shock and haemorrhage from the stab wounds.\n\nGunn was found guilty of murder, burglary, theft and robbery after a trial at the Old Bailey in London.\n\nToday Judge Angela Rafferty QC jailed him for life and ordered that he serve at least 32 years behind bars before being considered for release.\n\nAddressing Gunn directly she said: \"Your arrogance was clear to me during this trial. I consider you remorseless\", reports My London.\n\nAs she read out a list of his previous crimes he repeatedly yelled: \"No, I never\".\n\n(Image: Daily Mirror)\n\nDescribing Gunn as a \"one-man crimewave\", prosecutor Bill Emlyn Jones QC told jurors during the trial that he was also responsible for a string of burglaries and thefts to fund his drug habit.\n\nGunn was also sentenced for four counts of burglary, two counts of theft from a motor vehicle and two counts of possession of a knife.", "description": "\"One-man crimewave\" Alex Gunn, 31, stabbed 54-year-old Ravi Katharkamar to death inside his shop in Pinner, north-west London, in March", "authors": ["Tom Davidson", "Image", "Pa", "Daily Mirror"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20558096.ece/ALTERNATES/s1200/0_Ravi-Katharkamar-death.jpg", "published_at": "2019-10-11"}