{"pub": "abcnews", "url": "https://abcnews.go.com/Business/wireStory/stocks-skid-us-raises-tensions-ahead-china-talks-66133842", "downloaded_at": "2019-10-09 00:28:01.185139+00:00", "title": "Stocks skid as US raises tensions ahead of China talks", "language": "en", "text": "Stocks closed broadly lower on Wall Street Tuesday as tensions between the U.S. and China flared ahead of negotiations aimed at resolving the costly trade war between the world's two biggest economies.\n\nThe sell-off, which accelerated in the last hour of regular trading, knocked more than 300 points off the Dow Jones Industrial Average. Technology companies, banks and health care stocks bore the brunt of the selling, which stretched the market's losses further into a fourth week.\n\nThe market slide began after the U.S. blacklisted a group of Chinese companies, claiming that their technology plays a role in the repression of China's Muslim minority groups. The State Department also imposed restrictions on visas for Chinese officials.\n\nThe moves cast more doubt on whether Washington and Beijing will find a resolution to their long-running and economically damaging trade conflict. Envoys from the U.S. and China are scheduled to meet in Washington on Thursday for another round of trade talks.\n\n\"The rhetoric on both sides, whether it's the U.S. putting certain Chinese technology companies on a blacklist, or China vowing to retaliate with a 'stay tuned', it just keeps upping the temperature in the room and creating greater uncertainty for businesses, for consumers and for investors,\" said Sameer Samana, senior global market strategist at Wells Fargo Investment Institute.\n\nThe S&P 500 index lost 45.73 points, or 1.6%, to 2,893.06. The Dow slid 313.98 points, or 1.2%, to 26,164.04. The Nasdaq, which is heavily weighted with technology companies, dropped 132.52 points, or 1.7%, to 7,823.78.\n\nSmaller company stocks were also big decliners, sending the Russell 2000 index down 25.19 points, or 1.7%, to 1,472.60.\n\nThe yield on the 10-year Treasury fell to 1.53% from 1.55% late Monday, a signal that investors favored lower-risk investments amid the trade war turmoil. Utilities and real estate companies, both safe-play sectors, held up better than the rest of the market, though they also ended the day in the red.\n\nThe latest escalation in U.S.-China tensions adds yet another worry for investors already anxious over a bevy of political and economic concerns. Last week, the S&P 500 posted its first back-to-back losses of 1% this year as surprisingly weak numbers in surveys of manufacturing and service industries showed the U.S.-China trade war is threatening U.S. economic growth.\n\nThe Trump administration's moves to blacklist select Chinese companies and restrict visas on certain officials dampened investors' hopes that the negotiations this week will yield progress.\n\n\"The jockeying for position in front of the Thursday and Friday meetings in Washington has intensified perhaps more than the market could have imagined,\" said Julian Emanuel, chief equity and derivatives strategist at BTIG.\n\nTechnology stocks were among the biggest losers as chipmakers absorbed the impact of the latest U.S. restrictions on sales to Chinese tech companies that develop facial recognition and other artificial intelligence technology. Ambarella tumbled 9.5% and Nvidia fell 3.9%.\n\nThe sector has shouldered much of the volatility from swings in trade war sentiment because many of the companies face bigger risks to sales and supply chains.\n\nSeveral medical device makers knocked down health care stocks. Thermo Fisher fell 6% and Boston Scientific slid 6.1%. Banks also dropped as bond yields fell. Bank of America lost 2.4%.\n\nBenchmark crude oil fell 12 cents to settle at $52.63 a barrel. Brent crude oil, the international standard, slid 11 cents to close at $58.24 a barrel.\n\nWhile the price of U.S. crude is up just under 9% so far this year, it remains off by more than 27% from a year ago. That slide in prices over the past 12 months has weighed on energy stocks this year.\n\nEnergy is the biggest loser among the S&P 500's 11 sectors. It's down 2.8% for the year and 27.8% over the past 12 months. It's also the worst-performing sector so far this month.\n\nThe stocks could face more pressure when energy companies report their third-quarter results later this month. The sector is expected to report a nearly 10% drop in revenue for the third quarter due to a 19% decline in crude oil prices from a year ago, according to Credit Suisse analyst Jonathan Golub.\n\nThe analyst expects the sector to reduce earnings growth for the S&P 500 by 1.9% for the third quarter.\n\nWwholesale gasoline rose a penny to $1.58 per gallon. Heating oil added 1 cent to $1.91 per gallon. Natural gas fell 2 cents to $2.29 per 1,000 cubic feet.\n\nGold slipped 50 cents to $1,503.90 per ounce, silver rose 16 cents to $17.70 per ounce and copper was little changed at $2.57 per pound.\n\nThe dollar fell to 107.14 Japanese yen from 107.28 yen on Monday. The euro weakened to $1.0954 from $1.0973.\n\nMajor stock indexes in Europe finished broadly lower after the British government warned that chances of a separation deal with the European Union are fading.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Business/WireAP_897fea59507c4bd9823f6d6eac136505_16x9_992.jpg", "published_at": "2019-10-09"}