{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/guinea-bissau-president-fires-pm-political-crisis-191029195324027.html", "downloaded_at": "2019-10-30 00:02:23.092240+00:00", "title": "Guinea-Bissau president fires PM amid political crisis", "language": "en", "text": "Guinea-Bissau President Jose Mario Vaz has fired the country's prime minister and named a new one, intensifying a bitter power struggle between him and the ruling party before next month's presidential poll.\n\nBut in a move that complicated the political crisis in the West African country, Aristide Gomes, the dismissed prime minister, said he would not be leaving office.\n\nMore:\n\nVaz, who is running for office again in the November 24 poll, dissolved the government late on Monday, saying the political situation was undermining the normal functioning of state institutions in the country.\n\nIn a decree on Tuesday, Vaz named Faustino Fudut Imbali as prime minister. Fudut Imbali served in the same post from 2000-2003 and represents the small Manifest Party of the People.\n\nGomes, who was put forward for the job by the African Party of the Independence of Guinea and Cape Verde (PAIGC), which controls a majority in Parliament, told the Reuters news agency that he was refusing to go: \"I am in my office, working.\"\n\nGomes said Vaz's orders were illegitimate since the president's term technically expired on June 23.\n\nWest African regional bloc ECOWAS declared a few days later that Vaz, 61, could stay in office through to the November election.\n\nGuinea-Bissau has suffered repeated bouts of instability since it became independent from Portugal in 1974, including nine coups or attempted coups.\n\nThe country has been largely peaceful since Vaz came to power in a 2014 election that followed a coup two years earlier.\n\nBut the president has repeatedly clashed over the balance of power in the semi-presidential system with a string of prime ministers put forward by PAIGC.\n\nVaz won the 2014 presidential election as the PAIGC's candidate but fell out with the party after sacking his prime minister in 2015. He is now running for re-election as an independent candidate.\n\nIn a rare political protest, demonstrations from a party opposed to Gomes's government took to the streets of the capital, Bissau at the weekend, demanding the election be postponed so that voter lists could be checked for irregularities.\n\nOne protester died on Saturday and several were wounded, according to the government, a hospital source and march organisers.", "description": "Jose Mario Vaz sacks Aristide Gomes intensifying bitter power struggle with the ruling party before next month's poll.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/29/22caceb76a224e8296580e660bcc109f_18.jpg", "published_at": "2019-10-29"}