{"pub": "yahoo", "url": "https://yahoo.com/entertainment/sex-trafficking-victim-15-takes-060242995.html", "downloaded_at": "2019-10-17 08:11:33.245224+00:00", "title": "Sex-Trafficking Victim, 15, Takes Her Own Life After Being Rescued: 'We Got Her Back Damaged'", "language": "en", "text": "Sex-Trafficking Victim, 15, Takes Her Own Life After Being Rescued: 'We Got Her Back Damaged'\n\nA Texas teenager’s life was tragically cut short after she died by suicide just two years after she was rescued from a sex trafficking ring. She was 15.\n\nThe family of Leticia “Letty” Serrano says the young girl just couldn’t recover from the time she spent drugged up in captivity by the man who kidnapped her, her loved ones told local outlet ABC13.\n\nLetty was sold to sex traffickers at just 13 years old, according to the outlet.\n\nWhile Letty’s family was able to rescue her after finding her near Moody Park in Houston, she was never the same.\n\n“We got her back damaged,” Letty’s grandmother Cynthia Rivera told ABC13.\n\nView photos Letty Serrano | ABC News More\n\nHer family explained to Fox 26 Houston that Letty even ran away from home twice to be with her kidnapper.\n\n“She was a good student, good grades, quiet, kind of a loner, and her brother had just passed. She was a perfect target for them,” Rivera explained to Fox 26 Houston.\n\nOn Saturday, Letty, who celebrated her quinceanera in May, locked herself in the bathroom of her home and took her own life.\n\nHer father Mariano Serrano found her, he told Fox 26 Houston. “She died in my arms.”\n\n“She wanted to be with him,” Serrano said of Letty’s kidnapper. “But, she also didn’t want to hurt her family.”\n\n• Want to keep up with the latest crime coverage? Click here to get breaking crime news, ongoing trial coverage and details of intriguing unsolved cases in the True Crime Newsletter.\n\nAs Serrano copes with the death of his daughter, he explained to Fox 26 Houston that he wants justice.\n\n“I want to see him in court,” Serrano told the outlet. “I want to tell him it’s his fault my daughter his dead.”\n\nLetty’s grandmother also wants answers.\n\nView photos Letty Serrano | Fox News More\n\nRELATED: Cyntoia Brown-Long Speaks Out About Release From Prison After Killing Man as Sex-Trafficking Victim\n\nRivera has since launched a fundraiser for Letty in hopes of raising awareness about the prevalence of sex trafficking.\n\n“Letty went through a horrific abduction in 2017 through a man who drugged her and trafficked her. With help of our community I was able to find her,” Rivera said on the Facebook page. “When we got her back she was already broken and addicted at that point — the road to recovery was and is one of the hardest things for any child to overcome.”\n\nRivera explained that Letty’s kidnapper was arrested and put in jail for three days only to be released. He allegedly went on to abduct another 13-year-old.", "description": "Sex-Trafficking Victim, 15, Takes Her Own Life After Being Rescued", "authors": ["Robyn Merrett"], "top_image": "https://s.yimg.com/uu/api/res/1.2/DTDDnfuszFtPlJOlpdbd4g--~B/aD0xMTc5O3c9MjA1MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/people_218/daa8b67d9c7e6b24d37f27a50e1a07ec", "published_at": "2019-10-17"}