{"pub": "townhall", "title": "Townhall Media's Father's Day Gift Guide 2019", "url": "https://townhall.com/notebook/notebookstaff/2019/06/05/townhall-medias-fathers-day-gift-guide-2019-n2547424", "language": "en", "published_at": "2019-06-05", "downloaded_at": "2019-09-02 07:20:10.454783+00:00", "text": "Are you still looking for that Father's Day gift? Look no further! Whether it's a Maine Shore Dinner, a grill, portable generator, or an easy to use computer, this list is sure to have a gift that will make your dad feel loved and appreciated.\n\nMaine Shore Dinner\n\nLobster, Corn on the cob, Shrimp, Scallops, Mussels, Butter, Olive oil, Lemon zest, Garlic, Parsley, Chives that come straight to your door in a foil pack to put in the oven or on the grill!\n\nYETI Tundra 45 Cooler\n\nKeeps your ice frozen thanks to up to 3 inches of PermaFrost Insulation and an extra thick FatWall design is certified Bear-Resistant. One of the strongest coolers out there.\n\nBiofreeze On-the-Go Pain Relief Gel, 5 mL Packets, 100 Count\n\nBiofreeze has been the secret weapon of pharmacists, physical therapists, chiropractors, massage therapists and podiatrists. Overcome pain and get back to your best fast with the #1 clinically recommended topical pain relief brand.\n\nPortable Generator Charged By Wall Or Sun\n\nOn the go power for Laptops, TVs, Air Mattress, Lamps, Fans, Routers, car vacuums, mini refrigerators, phones, iPads, gps, droids etc. Charges by 120V wall adapter, car charger and MC4 solar panel adapter.\n\nFamily Tree Memory Keeper: Your Workbook for Family History, Stories and Genealogy\n\nFamily Tree Memory Keeper helps you keep track of basic genealogy information and special family memories, including traditions, heirloom histories, family records, newsworthy moments, family migrations and immigrations, old recipes, important dates, and much more.\n\nOutdoor Flat Top Gas Grill Griddle Station\n\nGriddles aren't just for breakfast foods and stir-fry! Cook everything from steak to chicken and fish to vegetables. When cooking on this flat top not only do you retain all the flavor and juices in your food but you can still get that sought after crisp wherever preferred.\n\nCarnivore Club - Jerky & Meat Sticks Sampler Box\n\nIncludes 4 to 6 Meats - Typically 10-16 oz altogether (Jerky & Meat Sticks) Past boxes featured items like honey bourbon beef jerky, pepperettes, biltong, venison jerky, bacon jerky, salami sticks, chorizo bites, and more!\n\nCRAFTSMAN Handheld Yard Blower\n\nLightweight design Less than 8lbs for decreased user fatigue. Makes any clean up a breeze!\n\nCrocs Men's Santa Cruz Playa Lace Sneaker\n\nLace-up loafer style sneakers with tiny bumps along footbed to give feet a massage-like feel.\n\nFabric Steamer with Garment Hanger\n\nFast & Effective Wrinkle Remover that he can do in seconds not hours!\n\nWild River Multi-Tackle Large Backpack\n\nLarge upper storage area with removable divider, converts backpack for storage of larger items. Front pocket cover folds down to provide a handy work surface. Clear internal pocket to keep your maps and licenses visible but dry and lower tray compartment for tackle.\n\nDad, I Want to Hear Your Story: A Father’s Guided Journal To Share His Life & His Love\n\nThis book will guide your father with questions, assisting him in sharing the stories of his childhood, his teens, and his adult years. This will be his tale, his triumphs, his challenges.\n\nSmall Rotisserie Oven / Vertical Rotisserie\n\nEnjoy Rotisserie Chicken & Oven Roasted Chicken With More Convenient & Healthy Way. Also For Kebab, Shawarma, Gyros, Tacos Al Pastor, Vegetables, Hot dogs, Meat And Fish...\n\nThe WOW! Computer--A Simple to Use Computer for Seniors\n\nTouch screen technology, One-touch \"zoom\" magnification, Big bright screen -- no bulky tower. Send and receive emails and video chat, \"Surf\" the internet, Play games online. No prior knowledge of computers needed!\n\nLike this Gift List? See our other Gift Guides for Conservatives, Proud Americans, Trump supporters, and more at Gift Guides on Townhall.\n\nWhen you make a purchase, Townhall Media receives a revenue share from qualifying purchases as an Amazon Associate.", "description": ".09/02/2019 3:20:10AM EST.", "authors": ["Notebook Staff", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/156/c9b7c9a0-d131-479c-a29d-6e9c5ebc82eb.png"}