{"pub": "businessinsider", "url": "https://businesstimes.com.sg/energy-commodities/gold-rises-ahead-of-us-china-trade-negotiations", "downloaded_at": "2019-10-07 06:02:35.861891+00:00", "title": "Gold rises ahead of US-China trade negotiations", "language": "en", "text": "Gold prices advanced on Monday as markets braced for US-China trade negotiations during the week with lesser hopes of a breakthrough, following a report that Chinese officials may not be as willing to bend.\n\n[BENGALURU] Gold prices advanced on Monday as markets braced for US-China trade negotiations during the week with lesser hopes of a breakthrough, following a report that Chinese officials may not be as willing to bend.\n\nSpot gold was up 0.3 per cent to US$1,508.23 per ounce as of 0101 GMT. Prices had edged 0.5 per cent higher in the previous week on fears of global economic slowdown.\n\nUS gold futures inched 0.1 per cent higher to US$1,513.90 an ounce.\n\nThe US dollar against a basket of currencies was a shade lower in early trade. Asian markets too edged lower ahead of the trade talks.\n\nsentifi.com Market voices on:\n\nThe next round of US-China trade negotiations, likely to be in Washington on Oct 10-11, will be in focus to see if the two sides can end their year-long trade spat that has upset economic growth around the world and raised concerns of a possible recession.\n\nUS President Donald Trump said on Friday there is a \"very good chance\" of a trade deal with China.\n\nHowever, a report that Chinese officials may be increasingly reluctant to agree to a broad trade deal pursued by Mr Trump has made this uncertain.\n\nRuffles in the US political front also supported gold, with a second whistleblower coming forward with knowledge of Mr Trump's attempts to get the Ukrainian president to investigate a political rival, amid an impeachment battle that threatens the US President's administration.\n\nMeanwhile, a report on Friday showed jobs growth in the United States slowed down in September and wage growth stalled, even as unemployment dropped to a 50-year low.\n\nThe unemployment data drop pushed traders of US short-term interest rate futures to pare bets the Federal Reserve will cut rates at both of its two upcoming meetings.\n\nElsewhere, twenty people were killed in an attack by suspected jihadists on a gold-mining site in northern Burkina Faso, Senegal on Friday.\n\nREUTERS", "description": ": THE BUSINESS TIMES Energy & Commodities - [BENGALURU] Gold prices advanced on Monday as markets braced for US-China trade negotiations during the week with lesser hopes of a breakthrough, following a report that Chinese officials may not be as willing to bend. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/07/AK_gld_0710.jpg?itok=_tnpAyf5", "published_at": "2019-10-07"}