{"pub": "nyt", "url": "https://nytimes.com/2019/09/17/world/middleeast/israel-election-results.html", "downloaded_at": "2019-09-17 23:27:32.205910+00:00", "title": "Israel Election Live Updates: Netanyahu and Gantz in Tight Race", "language": "en", "text": "Adding to the uncertainty, Israeli exit polls have been inaccurate and unreliable in the past.\n\nActual results were expected to trickle in overnight. And the winner of the contest for prime minister could end up being decided not by the final vote count but in weeks of coalition talks.\n\nMr. Netanyahu, Israel’s longest-serving prime minister, narrowly won the vote in April but was unable to form a government with his usual right-wing and religious coalition partners. He dissolved Parliament, triggering Tuesday’s do-over election, rather than let Mr. Gantz or another rival be given the chance to form a coalition.\n\nThe exit polls had other bad news for Mr. Netanyahu.\n\nAll three showed the umbrella Arab party, the Arab Joint List, improving on its 10-seat current representation, with gains of up to three seats. Arab citizens were eager to end the Netanyahu era, and any increase in their representation in Parliament takes seats away from a possible Netanyahu coalition.\n\nThe exit polls also all showed a far-right anti-Arab party, Otzma Yehudit, or Jewish Power, failing to gain enough votes to be seated in Parliament. If that result holds it could prove costly to Mr. Netanyahu, because the party’s votes — which could have gone to other right-wing parties that would have joined his coalition — will have been wasted.", "description": "Israelis are deciding the political fate of Prime Minister Benjamin Netanyahu in a contest that has revolved around whether Jewish voters want their country to become more or less religious.", "authors": ["David M. Halbfinger", "Isabel Kershner"], "top_image": "https://static01.nyt.com/images/2019/09/17/world/17israel-live-briefing-hp-promo1/17israel-live-briefing-hp-promo1-facebookJumbo-v3.jpg", "published_at": "2019-09-17"}