{"pub": "arirang", "url": "https://arirang.com/News/News_View.asp?nseq=245497", "downloaded_at": "2019-10-11 05:58:49.782375+00:00", "title": "News View :: The World On Arirang", "language": "en", "text": "The stocks on Wall Street saw an increase in response to rising hopes for the ongoing U.S.-China trade talks, which kicked off in Washington on Thursday local time.Chinese Vice-Premier Liu He is leading the Beijing delegation and U.S. Treasury Secretary Steven Mnuchin and trade representative Robert Lighthizer are on the American side for the two-day meeting.This is the first such meeting in three months, with the previous round in Shanghai ending with no deal.As of now, no details have been revealed, but President Trump hinted at a positive outcome.\"I think it's going really well. I will say, I think it's going really well. So we had a very, very good negotiation with China.\"On the same day, he also tweeted that it was a big day of negotiations with China, and added that he will meet China's Liu He on Friday at the White House.Given these optimistic comments by Trump, there's rising possibility of a small deal.Bloomberg and foreign reports say, the two sides may agree on a partial agreement.It could include a currency agreement and additional agricultural purchases by China in exchange for a delay of the tariff hikes by the U.S.Washington had previously announced it would impose a 30 percent tariff on Chinese goods starting next week.China had also echoed the optimistic sentiment of the U.S.Liu He said that China has come with great sincerity and is willing to make progress with Washington on trade balance, market access and investor protection.Meanwhile, the industry's general consensus is slightly more pessimistic with many saying a big deal seems very unlikely.However, with the two sides proactively engaging in talks, the world is paying close attention to the outcome on Friday.Lee Kyung-eun, Arirang news.", "description": "한국을 대표하는 글로벌 방송! The World On Arirang!", "authors": ["The Korea International Broadcasting Foundation"], "top_image": "http://www.arirang.com/arirang_blue.png", "published_at": "2019-10-11"}