{"pub": "yahoo", "url": "https://sports.yahoo.com/joe-maddon-returns-los-angeles-angels-manager-155528786--mlb.html", "downloaded_at": "2019-10-16 20:45:12.016734+00:00", "title": "Joe Maddon returns to Los Angeles Angels as new manager", "language": "en", "text": "Joe Maddon returns to Los Angeles Angels as new manager FILE - In this Sept. 25, 2019, file photo, then-Chicago Cubs manager Joe Maddon stands in the dugout before a baseball game against the Pittsburgh Pirates, in Pittsburgh. Joe Maddon has agreed to become the Los Angeles Angels' manager. Maddon and the Angels agreed to terms Wednesday, Oct. 16, 2019, on a deal to reunite the veteran manager with the organization where he spent the first three decades of his baseball career. (AP Photo/Gene J. Puskar, File)\n\nANAHEIM, Calif. (AP) -- Joe Maddon is back under the halo.\n\nMaddon agreed to a three-year deal to become the Los Angeles Angels' manager on Wednesday, reuniting the World Series-winning former bench boss of the Chicago Cubs with the organization where he spent the first three decades of his baseball career.\n\n''We are thrilled that Joe is coming back home and bringing an exciting brand of baseball to our fans,'' general manager Billy Eppler said. ''Every stop he has made throughout his managerial career, he has built a culture that is focused on winning while also allowing his players to thrive. We believe Joe will be a great asset for our club and look forward to him leading the team to another World Series championship.''\n\nScroll to continue with content Ad\n\nThe Angels will formally introduce the 65-year-old Maddon at a news conference next week, but he already knows his way around Angel Stadium.\n\nMaddon signed with the Angels as an undrafted catcher in 1975, and he spent the next 31 seasons working at almost every level of the organization as a player, coach and manager. He served as a big league assistant coach under five managers, and he had two stints as the Angels' interim manager.\n\nHe was the Angels' bench coach alongside manager Mike Scioscia during their championship season in 2002.\n\n''I could not be more excited to come back home and manage this great organization,'' Maddon said. ''I'd like to thank (owner) Arte Moreno, Billy Eppler and (president) John Carpino for giving me the opportunity to add another chapter to my Angels career. I was lucky enough to be a part of the first Angels team to win a World Series title, and I look forward to the opportunity to bring Angel fans their second championship.''\n\nStory continues\n\nMaddon left to manage Tampa Bay in 2006 for nine mostly successful seasons, followed by a big-money move to Chicago to make history.\n\nThe three-time Manager of the Year left the Cubs by mutual consent last month after they missed the playoffs for the first time in his five-year tenure. He'll still likely never have to buy a drink in Chicago again because of 2016, when he led the Cubs to their first World Series title in 108 years.\n\nMaddon replaces Brad Ausmus, who was fired after one season when the Angels finished 72-90, their worst record since 1999. Ausmus was abruptly dismissed shortly after Maddon became available, and most observers assumed Moreno had his eye on a reunion with Maddon, the Angels' bench coach when Moreno bought the club in 2003.\n\nThe Angels also interviewed veteran managers John Farrell and Buck Showalter and Padres hitting coach Johnny Washington for the job, but Maddon was the choice. Maddon was expected to be a valued candidate for other managerial openings around the majors, but he was clearly eager for a reunion.\n\nMaddon kept a home in Long Beach during his 14 seasons away from Anaheim, and he has fond feelings for the organization that gave him his start.\n\nThat organization is experiencing hard times: The Angels have endured four straight losing seasons for the first time since the 1970s, and they still haven't won a playoff game with Mike Trout and Albert Pujols on their roster, making just one three-game postseason appearance after winning the AL West in 2014.\n\nThe Angels also were rocked this month by revelations about the role of a team employee in procuring opioids for pitcher Tyler Skaggs, who was found dead in his hotel room July 1.\n\nMaddon's personal charisma and mild eccentricities have made him a popular figure in baseball, but his consistent success made him the highest-profile candidate on the managerial market. The Angels managed to bring him home in a much-needed boost for a beleaguered franchise.\n\nThe Angels' problems didn't deter Maddon from taking over a roster with Trout as its centerpiece. The probable three-time AL MVP is signed to a 12-year, $426.5 million contract that should keep him in Anaheim for the bulk of his career.\n\nThe Angels' starting pitching was easily their biggest weakness in 2019, but the rotation will benefit next season from the return of Shohei Ohtani, the two-way star who spent this year solely as a designated hitter while recovering from Tommy John surgery. Eppler also will attempt to be active in the free agent market to supplement a roster finally starting to bear fruit from Eppler's years of rehabilitating a barren farm system.\n\nMaddon's managerial career away from Anaheim began with two losing seasons in Tampa Bay, but has been impressive ever since. The Rays made a 31-game improvement and won the AL pennant in 2008, leading to the first of Maddon's three Manager of the Year awards.\n\nHe had five 90-win teams in Tampa Bay and four more in Chicago, including the 103-win Cubs who went on to that historic World Series victory. Maddon has received praise for his personable combination of old-school baseball passion and an eagerness to adapt to the new world of analytics and statistical decision-making.\n\n---\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP-Sports", "description": "Joe Maddon is back under the halo.  Maddon agreed to a three-year deal to become the Los Angeles Angels' manager on Wednesday, reuniting the World Series-winning former bench boss of the Chicago Cubs with the organization where he spent the first three decades of his baseball career.  ''We", "authors": ["Greg Beacham", "Ap Sports Writer"], "top_image": "https://s.yimg.com/ny/api/res/1.2/gYuKRRpn.QID7dLlt7Rt2A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD02ODI-/https://s.yimg.com/uu/api/res/1.2/RORmQFPKkx9DNDGG7yRsyg--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201910161103398160562", "published_at": "2019-10-16"}