{"pub": "telegraph", "url": "https://telegraph.co.uk/technology/2019/10/09/twitter-fire-profiting-millions-uk-users-data-sold-advertisers", "downloaded_at": "2019-10-09 18:46:54.081410+00:00", "title": "Twitter under fire for profiting from millions of UK users' data sold to advertisers", "language": "en", "text": "Twitter has been accused of unfairly profiteering from the personal data of up to 14.1 million people in the UK after it used their email addresses to sell targeted advertising without their knowledge.\n\nThe San Francisco-based social media giant admitted on Tuesday that it allowed advertisers to benefit from email addresses and phone numbers which it was given by users for security reasons.\n\nThe revelations triggered a furious backlash in London.\n\nTory MP Damian Collins, chairman of the Commons' digital committee, accused Twitter of trampling over users' rights to squeeze out profits by aggressively targeting them with personalised adverts.\n\nHe said: \"This is a significant breach and a 'hands up apology' is not enough for Twitter to escape a thorough investigation into how individuals’ data could have been misused.\n\n\"Unintentional use is no defence. People trust that their personal data – email addresses and phone numbers – are safe in the hands of tech companies, who have a legal duty to keep it safe.\"\n\nIt is understood that all of Twitter's 140 million global users could have been affected by the gaffe, although the company has not confirmed any figures. The firm generated $727m in advertising revenue in the second quarter of this year.\n\nTwitter had users' emails and phone numbers because it uses a security process called two-factor authentication, where they have to log in using a code which has been text to their mobile. They did not know this data would be used for advertising purposes.", "description": "Twitter has been accused of unfairly profiteering from the personal data of up to 14.", "authors": ["Natasha Bernal", "Tom Hoggins", "Harry De Quetteville"], "top_image": "https://www.telegraph.co.uk/content/dam/technology/2018/10/02/TELEMMGLPICT000175345422-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200", "published_at": "2019-10-09"}