{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stocks/lululemon-just-buy-the-darned-stock-don-t-trade-it-15080448", "downloaded_at": "2019-09-07 02:17:31.815340+00:00", "title": "Lululemon: Just Buy the Darned Stock, Don't Trade It", "language": "en", "text": "I sit at my desk. The jobs data has posted. I can hear Jim Cramer's voice coming from my office television that I only un-mute for a few individuals.\n\nCramer is speaking on monetary policy. That's not what I hear right now, though. What I hear Friday morning is still in Jim's voice, but it goes something like this... \"Own it, don't trade it.\"\n\nJim often states this mantra in reference to Apple (AAPL) . Why do I hear it today? The thought has dawned on my cerebrum that every three months in response to an earnings release, that I end up writing a positive article about Lululemon Athletica (LULU) .\n\nDon't get me wrong, I have traded this name often, and traded it quite well. That said, this one should have just been an investment, and not a trade.\n\nThese guys win. Plain and simple.\n\nLet's talk.\n\nLULU Reports\n\nFor the company's second quarter, Lululemon Athletica printed earnings per share (not adjusted, but GAAP style) of $0.96, beating Wall Street estimates by $0.07. LULU posted revenue of $883.35 million, up 22.1% year over year. This also topped expectations.\n\nIt gets better.\n\nSame-store sales increased by 15% versus consensus of 12.2%. See any other retailer put up growth like that?\n\nThe company has expanded its bricks-and-mortar presence to 460 locations, and now offers the option to purchase online and pick up the goods at nearly all of them. Sales at stores including new stores grew 10%, while direct to consumer sales, now 24.6% of total net revenue grew 30%.\n\nNow, I want you to read the next sentence very slowly. Sales for the company's men's products grew 35%, outpacing their women's business.\n\nI have one of their shirts. You want to work out in this shirt. There, I said it.\n\nOne other item, though gross margin did print slightly below consensus at 55% of sales, that itself was still good for growth from 54.8%, while operating margin also improved to 19%.\n\nAs for guidance, LULU expects full-year revenue to hit a range of $3.80 to $3.84, up from $3.73 to $3.77. The company also guided full-year EPS to $4.63 to $4.70 versus consensus of $4.64.\n\nTrade War Impact\n\nThis may be more significant than growth in the men's business. Now, 67% of Lululemon's products are manufactured in China. However, the company has enjoyed 70% sales growth in that nation, and plans to open 15 retail locations there.\n\nMost of that 67% are either sold in China, or are imported to other nations. A mere 6% of the finished goods sold in the U.S. are imported directly from China. This company has navigated the trade war perhaps better than any other retailer.\n\nThe Chart\n\nObviously, a day like this makes the daily MACD (Moving Average Convergence Divergence), and Relative Strength look terrific. The nitty gritty here, though, is that the stock price gapped above what might be seen as the top end of a basing pattern that came itself after a spike in response to first-quarter earnings in June. That was after a sideways move after a spike in response to fourth-quarter earnings in March. That itself is a pattern.\n\nMy thoughts? I think I want to, as I stated earlier, just buy these darned shares, and forget about trading them, but I do not think that I need to buy them today, right here.\n\nI would expect LULU, after this spike to base yet again. The low of the new range is anybody's guess, but barring unforeseen events, the highs of the old range, $195-ish, could very well be the lows of any coming range. I will probably initiate there with one-eighth of an intended position given that chance.\n\nIn the meantime, an interested investor could probably sell Oct. 18 $195 puts for nearly $5 Friday. If that makes one nervous, the Oct. 18 $190 puts were recently going for roughly $3.50.", "description": "Lululemon has navigated the trade war perhaps better than any other retailer....AAPL", "authors": ["Stephen Guilfoyle", "Lululemon", "Just Buy The Darned Stock", "Don'T Trade It", "This Company Has Navigated The Trade War Perhaps Better Than Any Other Retailer.", "Stocks Quotes In This Article", "Bruce Kamich", "James", "Rev Shark", "Doug Kass"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/447f8618-cfe1-11e9-848d-3dcf98f9f275.png", "published_at": "2019-09-06"}