{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/30/hasnt-ukraine-suffered-enough", "downloaded_at": "2019-10-01 00:17:24.913853+00:00", "title": "Hasn't Ukraine suffered enough?", "language": "en", "text": "ANALYSIS/OPINION:\n\nThe International Monetary Fund staff just concluded their mission to Ukraine. Upon reading the report, a colleague, who is a very good economist and student of IMF programs, immediately quipped, “Haven’t they suffered enough?” — with the added statement, “The IMF should steer clear.” (More on this below.)\n\nUkraine first obtained an identity in history as a distinct area with peoples who spoke an early version of Ukrainian about 1,300 years ago. Most of the region had a temperate climate with sufficient rainfall and very rich black soils to make it an ideal breadbasket, which it remains today. Ukraine also has mineral wealth and natural seaports on the Black Sea. The attractions have always been great enough to tempt outsiders who wish to control Ukraine’s natural wealth and territory.\n\nUkraine is the largest country entirely within Europe, with few natural barriers to discourage foreign armies from rolling in — so, over the centuries, the Mongols, Swedes, Poles, Turks, Lithuanians, Germans and, of course, the Russians decided to dine on parts or all of Ukraine. The northern Black Sea coast, which belongs to Ukraine, has been home to settlements from ancient civilizations, including the Greeks and then the Romans.\n\nKyiv was the first great Ukraine city, home to what were known as the Rus people (long before there was a Russia) and center of the once-powerful principality of Kyivan Rus. In the 8th and 9th centuries, it was ruled by people from Scandinavia. In the 11th century, Yaroslav the Wise, the prince of Kyiv, used cultural, administrative and military tools to consolidate, expand and strengthen Kyivan Rus and elevate it to a prominent country.\n\nHowever, the Mongolian Golden Horde invaded and controlled today’s Ukrainian lands from 1223 to 1363, while Muscovy and other early principalities of today’s Russia continued paying tribute to Mongols until the 1500s.\n\nUkraine is credited with weakening and stopping the Mongol Horde from conquering the rest of Europe, but it suffered a toll by being broken into pieces and ruled by a variety of empires over the centuries, including the Polish-Lithuanian, Russian, Ottoman and Astro-Hungarian Empires.\n\nAt the end of World War I, Ukraine gained its independence from the Russian Empire, but the inner disagreements among the leaders of the young state, battles between the reds (communists) and whites in Russia and neighboring countries, with eventually the communists gaining control of Ukraine, made Ukraine once again a vassal state.\n\nStalin never trusted the Ukrainians and engaged in massive killings of them, in part through government-induced famines in 1932-33, which alone are estimated to have caused up to 10 million deaths. When Hitler invaded the Soviet Union, many Ukrainians viewed the Germans as liberators from Russian dominance; but rather than taking advantage of this sentiment, many of the Germans turned out to be as brutal as the Russians, thus depriving themselves of a natural ally.\n\nAt the end of World War II, many Ukrainians rose up to resist their reoccupation by the Russians but were ultimately suppressed, with many killed, imprisoned and exiled to hard-labor camps in Siberia.\n\nWhen Ukraine achieved its independence in 1991, after the collapse of the Soviet Union, the new democratic leaders were ill-prepared. Support groups and foundations in the United States, Canada and elsewhere were created, often by Ukrainian refugees, to help the fledgling democracy.\n\nIn the early 1990s, Ukraine went through a hyperinflation, where some prices changed hourly. (I had been working on economic reform in Russia and was asked by the head of the Ukrainian central bank to come to Kyiv to see what might be done.) The problem was that the central bank had no control over the money supply because many government agencies, such as the Ministry of Defense or the Agricultural Ministry, were issuing their own credits.\n\nUkraine has continued to have more problems and poorer economic performance than the other Eastern European countries, whether they were members of the Soviet Union or just satellites. Ukraine has been viewed as the most corrupt of the former communist countries and, as a result, attracted many bad actors from other countries looking for sweetheart deals, including some politically well-connected U.S. citizens.\n\nTo its credit, the IMF report did focus on the need to do more to get rid of the corruption, as well as to make continued improvement in Ukraine’s monetary and fiscal policy. But then, the IMF reverted to form, where it recommended that Ukraine borrow large sums from the IMF. These loans would need to be paid back to the IMF with interest — probably requiring higher taxes.\n\nMany good development economists argue that the developing countries can obtain all the money they need for productive purposes from private sources, provided there is a rule of law and solid institutions — and without those conditions, the money will be wasted, as often happens with the IMF and other international loan programs.\n\nUkraine now finds itself in the center of U.S. political battles — having apparently been exploited by some Americans. Haven’t they suffered enough?\n\n• Richard W. Rahn is chairman of the Institute for Global Economic Growth and Improbable Success Productions.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The International Monetary Fund staff just concluded their mission to Ukraine. Upon reading the report, a colleague, who is a very good economist and student of IMF programs, immediately quipped, \"Haven't they suffered enough?\" -- with the added statement, \"The IMF should steer clear.\"", "authors": ["The Washington Times Http", "Richard W. Rahn"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/05/02/ukraine_clashes_78092_c0-235-5616-3509_s1770x1032.jpg?22449b62918975d4b3a41c3dcdea763d54d91807", "published_at": "2019-09-30"}