{"pub": "independent", "title": "9 best desks that are stylish and functional with storage space", "url": "https://independent.co.uk/extras/indybest/house-garden/furniture/best-desk-home-office-small-modern-corner-student-study-wood-storage-a9081031.html", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:04:06.041118+00:00", "text": "A home office isn’t just for freelancers. With a sharp uptake in flexible working conditions, these days more and more of us are happily working from home – a win for both productivity and emotional wellbeing.\n\nThis does, however, mean that we need to create some dedicated office space in our habitats, whether that’s a corner of a living room or bedroom, or if we’re lucky, our very own study. When space is at a premium, this can be a challenge.\n\nFinding the right desk to suit your needs is paramount to successful homeworking. You need to think about size, shape and functionality. For some, a super slim laptop is all that’s needed while others are drowning in physical paperwork and will be thankful for integrated storage in the shape of drawers and shelves.\n\nA desk in the domestic sphere needs to earn its place on the design front, otherwise we’re simply recreating the clinical office look at home, so give those office supplies stores a wide berth and invest in a beautiful design-led piece you’ll want to leap into come Monday morning.\n\nWe put a range of home working desks to the test, looking for top craftsmanship and quality of materials along with ease of functionality given their daily, heavy use. Above all, though, we focused on the best designs on the market because, boring spreadsheets aside, a home desk should be a stylish furniture piece to feel proud of.\n\nYou can trust our independent reviews. We may earn commission from some of the retailers , but we never allow this to influence selections, which are formed from real-world testing and expert advice. This revenue helps to fund journalism across The Independent.\n\nTikamoon Oslo acasia console: £299, Tikamoon\n\nMarrying rustic charm with sleek minimalist lines is this versatile desk that works just as well in the living room as it does a stylish home office. We loved the way the console celebrates the natural patina of the blonde-toned wood, awarding ours a totally unique finish. It also offers ample storage space with double drawers. When stuck indoors working from home, this is one stylish way to bring the outside in. Expect instant calm.\n\nBuy now\n\nFurniture Village east street desk: £329, Furniture Village\n\nThis simple but beautiful furniture piece is all about the curves. If it’s refined elegance you’re after, and you don’t mind the lack of storage, it’ll make for a stylish and nifty workstation. The top of the desk is finished in smooth walnut veneer while slim angled legs offer a chic mid-century aesthetic. We loved the V-shaped notch at the back, designed for holding our laptop leads. Pretty and practical.\n\nBuy now\n\nBo Concept cupertino desk: From £899, Bo Concept\n\nFans of Scandi minimalism will love this deceptively simple desk with its smooth and sleek silhouette that cleverly hides multiple storage compartments. Available in two sizes to suit your space, and in light and dark colourways – choose an oak or walnut veneer finish – it’s a versatile number that puts functionality at the fore. Tech-friendly, the desk can be customised to fit inconspicuous Bluetooth speakers, and comes with handy holes to hide away leads.\n\nBuy now\n\nNazanin Kamali for Case Furniture celene desk: £499, The Conran Shop\n\nThe slimline celine desk is almost too attractive to be shut away in the study. In warming oak, the natural grain of the wood is on full display, not only in its sharp-angled body but in its smooth tapered legs too. Ideal for those with limited floor space, this nifty unit maximizes on storage despite its diminutive form. With its concealed drawer and open compartment taking up the full width and depth of the desk, there’s no excuse not to keep this beauty clutter-free.\n\nBuy now\n\nJohn Lewis & Partners Fallowfield desk, natural/black: £199, John Lewis & Partners\n\nOffering an industrial take on home office furniture is this striking piece from John Lewis & Partners. Its weathered wood top is supported by a cubic steel frame, making it strong and robust in both look and feel. Utterly elegant in its simple, economic form, this is an ideal piece for the creative at-home studio: spread out your latest designs across almost four foot of sturdy tabletop space.\n\nBuy now\n\nTiva glass and chrome console table: £139, Danetti\n\nIf your home study amounts to a corner in the living room, you might want to consider a desk that doubles as an attractive console table for the times you don’t have your head buried in a spreadsheet. In this case, a reflective chrome and glass number that’ll give your most glamorous living room pieces a run for their money. We loved the simple design of this boxy unit with its sturdy tempered glass top and shiny frame that complements our metallics trend pieces.\n\nBuy now\n\nZipcode Design Diane hairpin desk: £114.99, Wayfair\n\nWho doesn’t love a Sixties-inspired hairpin leg? This stylish piece is a clean-lined and contemporary writing desk with a retro edge thanks to its looped metal supporting limbs. The snow white top is fashioned from high grade MDF and offers a smooth and sleek surface for working on – ideal for those who crave clutter-free thinking space. Don’t be fooled by its delicate form, those hairpins make for a hefty base.\n\nBuy now\n\nArgos Home valence desk, rose gold: £90, Argos\n\nYou’d be forgiven for thinking our most affordable desk on the list costs much more than its £90 price tag, such is its obvious quality and design-led appeal. Another chic and stylish workstation that plays to the metallics trend, this time the rose gold offsets the understated grey in an eye-catching contrast. Ample storage comes in the shape of two generous drawers while a centre shelf will keep your most pressing documents to hand.\n\nBuy now\n\nDutchbone finn desk table: £490, Houseology\n\nThis beautiful piece from the Westzaan-based Dutchbone merges the appeal of an antique bureau with the lightness of form you’d usually find in a contemporary console. The writing desk is crafted from lacquered solid ash wood and features a tactile bottle green velvet panel, gently curved to give the workstation its charming asymmetrical structure. A future family heirloom, this one’s for vintage lovers.\n\nBuy now\n\nThe verdict: Desks\n\nThe Oslo acacia console from Tikamoon won us over for its mix of warming natural wood with its sleek and modern design – one that managed to give us plenty of integrated storage despite its clean minimalist lines. On the slightly pricier side, Dutchbone’s finn desk is a thing of beauty, recalling the smoky home studies of yesteryear while keeping its form light and contemporary.\n\nIndyBest product reviews are unbiased, independent advice you can trust. On some occasions, we earn revenue if you click the links and buy the products, but we never allow this to bias our coverage. The reviews are compiled through a mix of expert opinion and real-world testing.", "description": "Whether you want industrial structure or a modern touch, these tables from John Lewis & Partners, Wayfair and more will work perfectly in your home", "authors": ["Ali Howard"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/27/17/homedesks.png"}