{"pub": "japantoday", "url": "https://japantoday.com/category/national/feature-jica-kumamoto-tie-up-to-facilitate-hosting-of-foreign-workers", "downloaded_at": "2019-10-20 00:15:37.579522+00:00", "title": "JICA, Kumamoto tie up to facilitate hosting of foreign workers", "language": "en", "text": "By Mariko Tamura\n\nThe Japan International Cooperation Agency and Kumamoto Prefecture will launch a project next year to train young Japanese people to assist the western Japan prefecture in hosting its ever-growing population of foreign workers.\n\nThe project will enlist Japanese nationals who have volunteered to provide technical assistance in developing countries, and organizers hope they will contribute to revitalizing local economies and creating the conditions for the building of a more diverse society, JICA officials said in a recent interview with Kyodo News.\n\nIt will be the first time that the aid agency has teamed up with a local government that has plans to train people to help spur the local economy and facilitate the hosting of foreign workers.\n\nThe JICA officials expressed hope that former overseas cooperation volunteers will use their skills and experiences to support communities that are becoming increasingly dependent on immigration as Kumamoto's population shrinks.\n\nThe number of foreign residents in Kumamoto Prefecture totaled 13,411 in 2018, up 52.7 percent from 2013 due to rising demand for labor in agriculture, as well as in reconstruction works from the two earthquakes that rocked the prefecture in 2016, according to prefectural government data.\n\nThe rate of increase was 16.64 percent in 2017, the highest among Japan's 47 prefectures, the data showed.\n\nIn the same period, the number of foreign workers in the prefecture increased 2.7 times to 10,155, with nearly 60 percent of them engaged in the agriculture and forestry industries, as well as in manufacturing.\n\nUnder the project, JICA hopes more residents of Kumamoto Prefecture will take part in the agency's program that sends volunteers abroad, and that the Kumamoto government will give some assistance to former overseas volunteers in finding jobs and continuing studies in the prefecture upon their return.\n\nSpecifically, Prefectural University of Kumamoto will host a number of returnees at its graduate programs, while municipal governments and companies in the prefecture will offer internships to volunteers.\n\nFour companies have agreed to offer internships, and others have indicated interest, according to Shinichi Tanaka, senior director at JICA's Operations Strategy Department.\n\nTanaka said JICA hopes the number of volunteer-turned-students at the university will grow over the years, possibly to around 50 in 10 years.\n\n\"Having even one person with overseas experience in an organization or community would create a positive ripple effect leading to better interactions with foreign counterparts,\" he said.\n\nHaruko Kase, deputy director at JICA's Office of Media and Public Relations, expressed a similar view.\n\n\"Former and current volunteers have a better understanding of the type of considerations necessary toward foreign workers to allow them to play an active role (in the community) and not feel isolated,\" Kase said.\n\n\"They can also act as good facilitators by helping both sides smoothen out any cultural misunderstandings,\" she said.\n\n© KYODO", "description": "The Japan International Cooperation Agency and Kumamoto Prefecture will launch a project next year to train young Japanese people to assist the western Japan prefecture in hosting its ever-growing population of foreign workers. The project will enlist Japanese nationals who have volunteered to provide technical assistance in developing countries, and…", "authors": [], "top_image": "https://japantoday.com/images/japan-today-social.jpg", "published_at": "2019-10-19"}