{"pub": "yahoo", "url": "https://news.yahoo.com/1-two-killed-26-wounded-141602014.html", "downloaded_at": "2019-10-27 04:06:16.168606+00:00", "title": "UPDATE 5-Fifteen killed, dozens wounded as Iraq protests flare for second day", "language": "en", "text": "* Iraqis on the streets for day two of renewed protest wave\n\n* At least 15 people killed on Saturday; 52 on Friday\n\n* Protests aimed at political elite accused of corruption\n\n* Shi'ite heartland rising up against Iran-backed militias (Adds links to related content, second byline)\n\nBy Ahmed Aboulenein and Ahmed Rasheed\n\nBAGHDAD, Oct 26 (Reuters) - At least 67 Iraqis were killed and hundreds wounded in two days of protests over the weekend, as demonstrators clashed with security forces and militia groups in a second wave of protests against Prime Minister Adel Abdul Mahdi's government this month.\n\nSeeking to contain the spiralling violence, on Saturday night Abdul Mahdi ordered members of the country's elite Counter-Terrorism Service (CTS) onto the streets of the capital Baghdad and the southern city of Nasiriya.\n\nThey were told to \"use all necessary measures\" to end the protests, security sources told Reuters.\n\nAround midnight, CTS troops took over checkpoints in neighbourhoods surrounding Baghdad's central Tahrir Square and began corralling protesters out. Security forces firing tear gas had earlier failed to clear the square of demonstrators.\n\nIn Nasiriya, CTS soldiers broke up demonstrations by beating and arresting dozens, police and security sources said.\n\nThe two cities, where thousands had turned out for a second day of protests, saw the bulk of Saturday's violence as protesters continued to vent their frustration at political elites they say have failed to improve their lives after years of conflict and economic hardship.\n\nFour people were killed after being struck directly in the head by tear gas canisters fired by security forces in Baghdad, with dozens more wounded. Four others died in Nasiriya, when a group of protesters stormed the home of a local security official, police said. Guards opened fire after the protesters torched the building, police said.\n\nSeven more people died in Hilla, most when members of the Iranian-backed Badr Organization militia group opened fire on protesters who had gathered near their office.\n\nAt least 52 people were killed around the country on Friday, and more than 2,000 more wounded.\n\nThe latest bloodshed was the second major bout of violence this month. Earlier in October, 157 people were killed and more than 6,000 wounded in other clashes between protesters and security forces.\n\n\n\n\n\nSPIRALLING VIOLENCE\n\nThe unrest has broken nearly two years of relative stability in Iraq, which from 2003 to 2017 endured a foreign occupation, civil war and an Islamic State (IS) insurgency.\n\nIt poses the biggest challenge to Abdul Mahdi since he took office just a year ago. Despite promising reforms and ordering a broad cabinet reshuffle, he has so far struggled to address the protesters' discontent.\n\nAdding more pressure, the parliamentary bloc linked to Shi'ite cleric Moqtada al-Sadr announced it was going into opposition on Saturday, a big blow to his premiership.\n\nHowever, Abdul Mahdi's decision to deploy CTS troops was likely to be met with broad support from the country's political elite as well as praise from security forces who said they would not shy away from using force.\n\nEarlier in the day, Iraq's military and Ministry of Interior said that they planned to respond more firmly to protests on Saturday after Friday's heavy death toll.\n\nIn Basra, police said protesters who attacked security forces, public and private property would be prosecuted under Iraq's strict counter-terrorism law.\n\nPolitical leaders also spoke out in support of the security forces' actions over the weekend, while militia leaders signaled their support for a tough stance against protesters, and urged the premier not to back down.\n\nThe statements came after another long day of violent protests across the country. Although volleys of tear gas were lobbed indiscriminately at protesters on Saturday, many demonstrators expressed relief that security forces had not used live rounds this time.\n\nIn Baghdad protesters distributed masks and homemade remedies to protect themselves from the tear gas. Others handed out food and water.\n\nAs sirens wailed and tuk-tuks ferried bloodied protesters to hospitals, others expressed outrage at a political establishment so willing to resort to violence.\n\n\"Our protests are peaceful, we only have flags and water bottles, but they keep firing bombs at us, firing tear gas at us,\" said 33-year-old demonstrator Silwan Ali. \"What have we done to deserve this? What have we done? The young men who died, what did they do?\" he said.", "description": "At least 67 Iraqis were killed and hundreds wounded in two days of protests over the weekend, as demonstrators clashed with security forces and militia groups in a second wave of protests against Prime Minister Adel Abdul Mahdi's government this month.  Seeking to contain the spiralling violence,", "authors": ["Ahmed Aboulenein", "Ahmed Rasheed"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-26"}