{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7495777/Van-Dijk-arrives-Milan-Fifas-Best-Player-awards-does-battle-Messi-Ronaldo.html", "downloaded_at": "2019-10-05 07:50:52.955338+00:00", "title": "Messi beats Ronaldo and and Van Dijk to win FIFA's Men's Player of the Year award", "language": "en", "text": "Barcelona's Lionel Messi was named Men's Player of the Year at FIFA's The Best awards in Milan on Monday night.\n\nMessi was nominated for the award alongside Cristiano Ronaldo - who snubbed the ceremony - and Virgil van Dijk and was handed the prize after another stunning individual season.\n\nThe Argentine won La Liga but missed out on another Champions League crown after Barca were beaten by Van Dijk's Liverpool in the semi-finals.\n\nLionel Messi was named FIFA's Men's Player of the Year at Monday's ceremony in Milan\n\nVirgil van Dijk missed out on the prize despite winning the Champions League last season\n\nJurgen Klopp was named Coach of the Year at Fifa's The Best awards in Milan on Monday\n\nUSA star Megan Rapinoe was named Women's Player of the Year after winning the World Cup\n\nJurgen Klopp was named FIFA's Men's Coach of the Year after guiding Liverpool to Champions League glory in June.\n\nKlopp saw off competition from Tottenham's Mauricio Pochettino and Manchester City coach Pep Guardiola to be named the game's best coach.\n\nThere was more success for Liverpool as Alisson scooped the Men's Goalkeeper of the Year gong ahead of Ederson and Marc-Andre ter Stegen.\n\nLiverpool's Alisson Becker was named FIFA's Goalkeeper of the Year after a fine 2019\n\nEngland Women's boss Phil Neville missed out on the Women's Coach of the Year prize\n\nMegan Rapinoe was named the Women's Player of the Year after scoring six goals as the USA won this summer's World Cup. Rapinoe beat USA team-mate Alex Morgan and England's Lucy Bronze to the prize.\n\nEngland Women's coach, Phil Neville, missed out on FIFA's Women's Coach of the Year award, which went to USWNT coach Jill Ellis.\n\nNeville guided England to the semi-finals of the Women's World Cup, which was won by Ellis' USA side who beat the Netherlands team 2-0 in the final.\n\nFIFA The Best awards: Winners Men's Player of the Year: Lionel Messi Women's Player of the Year: Megan Rapinoe Men's Coach of the Year: Jurgen Klopp Women's Coach of the Year: Jill Ellis Men's Goalkeeper of the Year: Alisson Becker Women's Goalkeeper of the Year: Sari van Veenendaal Puskas Award: Daniel Zsori (Debrecen v Ferencvaros) FIFA Fair Play award: Marcelo Bielsa and Leeds United\n\nDespite being on the losing side in the final, Oranje goalkeeper Sari van Veenendaal landed the Women's Goalkeeper of the Year gong.\n\nThe Puskas prize, awarded to the player who scored the best goal, was won by Daniel Zsori for his incredible injury-time strike in Debrecen's win over Ferencvaros.\n\nMarcelo Bielsa and Leeds United were also winners as they were handed FIFA's Fair Play award for allowing Aston Villa to score a goal unopposed following a controversial strike of their own in their Championship clash in April.", "description": "Messi was nominated for the award alongside Cristiano Ronaldo and Virgil van Dijk but was handed the prize after another stunning individual season for Barcelona as he lifted La Liga.", "authors": ["Alec Fenn For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/23/21/18842318-0-image-a-7_1569270683735.jpg", "published_at": "2019-09-23"}