{"pub": "fox", "url": "https://foxbusiness.com/technology/apple-files-patent-for-wireless-voice-responsive-smart-clothing-that-will-measure-vital-and-fitness-signs", "downloaded_at": "2019-10-04 23:44:58.337096+00:00", "title": "Would you wear 'smart clothing'? Apple patents tech to be sewn into clothes", "language": "en", "text": "Soon, your shirt will give you an ECG and measure other health data.\n\nContinue Reading Below\n\nApple is looking into sewing health tracking technology and sensors into your clothes. The company filed a patent with the U.S. Patent and Trademark Office for what's called “smart clothing,” which would likely connect with devices like the Apple Watch to measure health vitals, including ECG readings.\n\nApple’s patent, which was filed last year, shows a soft-and-stretchy, ring-shaped band that can be woven into clothing fabric with sensors and circuitry that will gather information on the user’s health data, according to Patently Apple.\n\nThe smart clothing would measure heart rate, blood sugar levels, blood pressure, electrocardiograms, blood oxygen levels and respiration rates. The patent also describes fitness-related metrics as well, such as step count.\n\nThe device could respond to voice commands through a microphone and will be capable of communicating wirelessly with other Apple electronic equipment.\n\nAs for fabric, Apple’s patent notes that yarns may be formed from a combination of polymer, ceramic, graphite, glass, metal, cotton or bamboo.\n\nDaniel Podhajny is listed as a product designer for Apple’s smart clothing patent, who had previously worked at Nike as their ‘Knit Exploration Innovator’ and was behind the brand’s Nike Flykit line of knitted, breathable athletic footwear.\n\nThe caveat is that such fabric-based smart clothing will require extreme care, and might be difficult to keep clean. However, Apple’s patent does state that the “fabric-based item may be configured to sustain relatively high temperatures such as those associated with laundering of clothing.”\n\nCLICK HERE TO GET THE FOX BUSINESS APP\n\nApple’s patent was published Firday, so it will still likely take some time before smart clothing products hit the market, and pricing has yet to be determined.", "description": "Apple has filed a patent for 'smart clothing' that will sensor vital signs for a potential new line of athletic-wear.", "authors": ["Matthew Mcnulty"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/apple-logo-iStock.jpg?ve=1&tl=1", "published_at": "2019-10-04"}