{"pub": "yahoo", "url": "https://news.yahoo.com/hillary-clinton-says-evidence-for-impeachment-inquiry-is-dramatic-and-irrefutable-163007618.html", "downloaded_at": "2019-10-03 07:38:29.271151+00:00", "published_at": "2019-10-01", "title": "Hillary Clinton says evidence for impeachment inquiry is 'dramatic and irrefutable'", "language": "en", "text": "Former Secretary of State and 2016 presidential candidate Hillary Clinton dismissed concerns that Democrats are overreaching in their impeachment inquiry into President Trump, calling the evidence at the center of the probe “dramatic and irrefutable.”\n\n“The evidence concerning Ukraine is so dramatic and irrefutable because it came right out of the White House,” Clinton said on “Good Morning America” Tuesday. She was there alongside her daughter, Chelsea, to promote the book they co-wrote, \"The Book of Gutsy Women,” a collection of essays about more than 100 inspirational women throughout world history.\n\n“So let the impeachment inquiry proceed,” Clinton added. “I know that they will do a thoughtful, thorough job. Nobody should jump to any conclusions.”\n\nLast week House Speaker Nancy Pelosi announced the inquiry after the White House released a memo of a controversial July 25 call between Trump and Ukrainian President Volodymyr Zelensky. That was followed by the release of an anonymous whistleblower complaint against the president, which was based on the conversation. It detailed repeated attempts by Trump and his allies to enlist Ukrainian officials to investigate former Vice President Joe Biden and his son Hunter, including allegations the administration delayed almost $400 million in military aid to Ukraine as leverage. Depositions and hearings on the matter will begin this week.\n\nTrump has tweeted a series of demands for the identity of the whistleblower and threats against House Intelligence Committee Chair Adam Schiff, who is leading the probe.\n\nHillary Clinton discusses the House impeachment inquiry on \"Good Morning America.\" (Photo: ABCNews.com) More\n\nClinton, who lost the 2016 presidential election to Trump despite winning the popular vote, said she thinks the president’s attempt to “find out” the identity of the whistleblower, a member of the intelligence community, at this stage in the inquiry process would be “very dangerous.”\n\n“From everything we know, and we don’t know much, this is an experienced person who saw things that bothered him. That’s what the whole whistleblower statute is for, and it is to protect their identity. And I understand he’s going to testify, and we’ll let the process unfold,” she said.\n\nThe whistleblower made an agreement to provide an “unfiltered testimony” before Congress, Schiff confirmed Sunday. The whistleblower’s attorney has said Trump’s attacks are putting his client’s life at risk.\n\nClinton, whose husband, President Bill Clinton, was impeached over a sex scandal in 1998 but survived a vote in the Senate, defended Pelosi’s decision to abandon her resistance to impeachment and open an inquiry last week.\n\n“I think there was no choice,” Clinton said. “But what I hope the Democrats will do is not only proceed in a very deliberative way on the impeachment inquiry, but tell the American people what they’ve accomplished. They passed legislation on gun safety, improving health, lowering prescription drug costs, doing so many things that the American people really want and need, and it goes to the Senate and dies.\n\n“So I think the Democrats have to go on two tracks here, but they will do that,” Clinton added.\n\n_____\n\nDownload the Yahoo News app to customize your experience.\n\nRead more from Yahoo News:", "description": "Hillary Clinton dismissed concerns that Democrats are overreaching in their impeachment inquiry into President Trump, calling the evidence at the center of the probe “dramatic and irrefutable.”", "authors": ["Kadia Tubman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Ov2aKs2mFS4nyHf7p2timA--~B/aD03NTY7dz0xNDA0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/148a34f0-e471-11e9-bfd5-f4ef0bedc2a7"}