{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201909231736/london-markets-thomas-cooks-liquidation-wipes-out-travel-company-worth-gbp185-billion-just-18-months-ago", "downloaded_at": "2019-09-23 10:34:43.006277+00:00", "title": "LONDON MARKETS: Thomas Cook's Liquidation Wipes Out Travel Company Worth GBP1.85 Billion Just 18 Months Ago", "language": "en", "text": "By Steve Goldstein, MarketWatch\n\nEasyJet, Tui rally after Thomas Cook collapse\n\nThomas Cook shares (TCG.LN) were halted Monday as the travel company filed for liquidation, wiping out a company worth over GBP1.85 billion ($2.3 billion) little more than a year ago.\n\nThe company's chief executive, Peter Fankhauser, blamed an additional facility requested in the last few days for the liquidation, a reference to the roughly GBP200 million sought by creditors including Lloyds (LLOY.LN) and the Royal Bank of Scotland (RBS.LN) .\n\nThe collapse led the British government to announce the largest peacetime repatriation in history as it sought to bring home 150,000 U.K. customers.\n\n(link)\n\nThomas Cook's most recent financial report showed net debt of GBP1.25 billion and a first-half ending March 31 loss of GBP1.46 billion. It blamed a summer heatwave for reducing demand for winter holidays, and Brexit for delaying U.K. customer travel plans. Thomas Cook said in May that economic and political uncertainty led to high levels of promotional activity, and that higher fuel and hotel costs also were weighing on the current year.\n\nThomas Cook shares were as high as 123.6 pence as recently as April 2018. The shares closed Friday, at 3.45 pence.\n\nThe move did lift rival airlines, with easyJet shares (EZJ.LN) surging 4%, and Ryanair (RY4C.DB) adding 1%. Travel operator Tui surged nearly 7%.\n\nThe broader FTSE 100 index fell 0.74% to 7290.42, a slightly better performance than the rest of Europe .\n\n(END) Dow Jones Newswires\n\nSeptember 23, 2019 05:26 ET (09:26 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-23"}