{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/21/WS5dad4b97a310cf3e35571b1d.html", "downloaded_at": "2019-10-21 07:37:35.120799+00:00", "title": "Nation on fast track in booming tech sector", "language": "en", "text": "Steve Hoffman, founder and CEO of Founders Space, gives a speech at the Business Leaders Dialogue of WIC in Wuzhen on Sunday. [Photo by Gao Erqiang/China Daily]\n\nChina is on the fast track transforming itself into an innovative country driven by the rapid development of its digital economy which is reshaping the country's traditional industries, experts said.\n\nXu Lejiang, deputy head of The United Front Work Department of CPC Central Committee, said at the ongoing World Internet Conference that the \"digital economy has steered China's rapid development in traditional industries like manufacturing and agriculture\".\n\nXu said: \"Tech adaptation in these areas has certainly enhanced production efficiency, provided a more accurate demand-supply evaluation, and has contributed to green production processes.\"\n\nHe also remarked that the digital economy is creating new growth points for China's GDP.\n\n\"It increased employment in emerging markets. China's market of digital economy had exceeded 30 trillion yuan ($4.2 trillion) by 2018 and accounted for about one third of China's total GDP,\" Xu explained.\n\nData from the China Academy of Information and Communications Technology showed China's market for the digital economy has hit 31.3 trillion yuan, up 15.1 percent year-on-year and accounting for 34.8 percent of China's GDP by 2018.\n\n\"Going ahead, China needs more concentrated efforts in developing high-end chips and integrated circuit. The country's traditional industries will also see increasing tech adaptations,\" Xu said. \"The future of the digital economy is in the hands of all countries and the global community should step up communications and cooperation for a shared future.\"\n\nCyberspace Administration of China Minister Zhuang Rongwen shared a similar view at the conference.\n\n\"Now the development of a digital economy is essential to the booming world economy and industries' sustainable development, and has facilitated the development of emerging markets like cross-border e-commerce,\" the minister said.\n\nDuring this process, the superfast 5G technology has definitely become a key accelerator, said Xiaomi Corp founder and CEO Lei Jun.\n\n\"Chinese consumers have shown huge enthusiasm for 5G smartphones, which has outpaced our expectations,\" he said. \"To tap into this demand, Xiaomi plans to launch over 10 types of 5G smartphones next year.\"\n\nAccording to the Global System for Mobile Communications Association, which represents the interests of mobile operators worldwide, China will become the world's largest 5G market by 2025.\n\nWith an expected 460 million users of the next-generation, superfast network, user numbers will surpass those in Europe (205 million) and the United States (187 million) combined, the association's report said.\n\nRupert Hoogewerf, chairman of Hurun Report Inc, said China's development of advanced technologies has made it a most popular destination for unicorn companies.", "description": "China is on the fast track transforming itself into an innovative country driven by the rapid development of its digital economy which is reshaping the country's traditional industries, experts said.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/21/5dad4b97a310cf3e97a238bb.png", "published_at": "2019-10-21"}