{"pub": "fox", "url": "https://foxbusiness.com/lifestyle/wedding-gift-spending-what-experts-say", "downloaded_at": "2019-10-01 00:14:32.771083+00:00", "title": "Wedding gift spending: How much is too much? How much is not enough?", "language": "en", "text": "Marriage might be a lifetime contract, but that doesn’t mean guests want to shoulder the cost on the wedding day.\n\nContinue Reading Below\n\nIn the world of celebrity weddings, actress Jennifer Lawrence had a few things on her wish list—including a very expensive exercise item.\n\nShe partnered with e-commerce giant Amazon to provide a gift registry guide for engaged couples. The actively updated registry went up at the end of September and originally had a $2,000 indoor exercise bike listed, but has since been removed.\n\nPublicists of Amazon also insist that not all items were hand-selected by Lawrence.\n\nBut Lawrence and Amazon aren't alone in cashing in on love.\n\nAccording to a report by industry market research firm IBISWorld, the U.S. wedding industry has racked up an estimated $76 billion in 2019 alone. It is also “expected to increase 1.9%, as a strengthening economy boosts wedding budgets,” the report said regarding 2019 revenue.\n\nThe strengthening of the nation’s economy, coupled with the rise of social media and picture-perfect wedding editorials has been a contributing factor to the inflating cost of a wedding.\n\nAnd that desire has transferred over to guests as seen as seen in trending bridezilla horror stories where “under-gifting” is a hot topic.\n\nTo avoid these situations, guests may wonder what they can do to ensure their gifts are satisfactory. For a clear-cut answer, FOX Business consulted both financial and wedding experts about how much should be spent on wedding gifts.\n\nWhat financial experts say about wedding gifting?\n\nWeddings, for the most part, are meant to be a once-in-a-lifetime event for a couple. And like other monumental events in a person’s life, gifts are typically expected.\n\n“People tend to overspend because the purchase is driven by emotion—you are so happy for the couple, and in an effort to celebrate them, you may go over-budget,” NerdWallet Communications Specialist Chloe Wallach said.\n\nHowever, financial experts unanimously agree that going over budget for a wedding gift is not a good idea, regardless of a person’s income.\n\n“Depending on the source you reference, the average dollar spent per gift ranges between $50 and $120, but that can be misleading,” said Sean Stein Smith, a member of the AICPA Financial Literacy Commission.\n\n“For every mainstream wedding, there are weddings featuring items like $5,000 flower displays, so it’s important to figure out what dollar amount works for your budget,” he added.\n\nCraig Kirsner, president of Stuart Estate Planning Wealth Advisors, provided a more detailed spending range that guests might want to follow based on their relationship with the couple.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\n“For a non-family member gift, if you are a couple invited to the wedding, you should spend about $75 total on a gift. For a family member, $100 to $200 might be more appropriate,” Kirsner said.\n\nHowever, for single guests, he said that amount can be scaled down to $50 for non-family and $100 to $150 for a blood relative.\n\nThe growing rate of pre-marital cohabitation is another factor wedding guests should be aware of before they dole out cash at a department store. According to the 2018 report from the U.S. Census Bureau, 15 percent of young adults between the ages of 25 and 34 live with an unmarried partner. So, ultimately, wedding guests should keep the couple’s living arrangements in mind.\n\n“Traditional wedding gifts are usually in the realm of bed, bath, and kitchenware. Some examples include appliances, bedding, and electronics. Choosing these items might be difficult if the bride and groom are already living together,” Logan Allec, a CPA and owner of personal finance site Money Done Right explained.\n\nIf a guest insists on buying a tangible gift, Allec advised purchasing either items that the couple doesn’t already own or timeless gifts such as silverware or a comfy quilt.\n\nHe also cited the unwritten “cover your plate” rule that suggests a guest should buy a gift of equal value to their reception meal—which he urges people not to follow because “you should not center the price of your gift around whether the wedding was more casual or fancy.”\n\nWhat wedding experts say about gifts\n\nIn Bankrate’s “Navigating The Cost Of Wedding Season” survey, experts have slightly differing perspectives when it comes to etiquette and budgeting for gifts.\n\nWhen invited guests are unable to attend, gifts are generally still expected. Out of the nine experts surveyed, 33.3 percent agreed that guests who are unable to attend should spend the same amount they would otherwise, while the rest said it's OK to spend less.\n\n“It's not required, but if you can afford it and you care about the relationship, it's a nice gesture to send a gift if you can't attend the wedding. If they are close friends or family members, it's a good idea to give them what you would have gifted if you had attended the wedding. If you're not especially close with the couple, it's still a nice idea to send something, but it's ok if it's not super extravagant.” - Kate Donovan of Brides Magazine.\n\nAnne Chertoff of Beaumont Etiquette sides with the majority.\n\n“If a guest can't attend the wedding, they may still want to send a congratulatory note and gift, however, the cost of the gift doesn't have to be as expensive as if they attended the wedding,” Chertoff said. “For example, a guest can send a bottle of champagne as a wedding gift instead of shopping off the wedding registry.”\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nThere are additional reasons that may justify spending less on wedding gifts:\n\nEight out of nine experts say it's fine to spend less if the marrying couple aren't family members or very close friends.\n\nEight out of nine also say it's reasonable to spend less if a guest incurred expenses as part of the bridal party.\n\nSeven out of nine experts agree it's fine to spend less if a guest incurred travel expenses to get to the wedding.\n\nWhen it comes to actually budgeting for a wedding as a guest, Zola’s Director of Brand Marketing Jennifer Spector has a savvy strategy.\n\n“A good rule of thumb for every wedding is to set a total budget and then split that budget between wedding events. I recommend spending about 40 percent on pre-wedding events and 60 percent on the wedding day, including any travel and a gift,” Spector said.\n\nAmerican etiquette expert Thomas P. Farley of Mister Manners advised wedding guests to stick to their guns and evaluate their relationship to the couple when making a budget.\n\n“When determining how much to spend on a wedding gift, the primary factors that matter are what can you easily afford and how close are you to the couple. A wedding is not a fundraiser, nor is it a quid-pro-quo,” Farley pointed out.\n\nAll nine surveyed wedding experts agreed that giving cash or a check as wedding gift instead of a physical gift is the way to go.\n\nWhat about exorbitant wedding gift requests?\n\nFor wedding guests who encounter registries that are out of their price range, experts unanimously agreed that people should do what is feasible.\n\n“If the couple is asking for very expensive gifts, their wedding guests should not feel obligated to buy them, nor feel guilty when they can't afford them. In this case, guests should ignore the high-priced gifts and give cash or a gift card in an amount that they can comfortably swing,” said Laura Gariepy, owner of content creation company Day by the Lake.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Financial experts and wedding professionals offer tips to help you decide how much money to put into presents for the happy couple.", "authors": ["Cortney Moore"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/02/0/0/ef77e12323224b1094dd3f0fbeb5496d.jpg?ve=1&tl=1", "published_at": "2019-09-26"}