{"pub": "yahoo", "url": "https://sports.yahoo.com/betances-montgomery-season-debuts-yanks-loss-203723568--mlb.html", "downloaded_at": "2019-09-15 23:11:47.691759+00:00", "title": "Betances, Montgomery make season debuts in Yanks' loss", "language": "en", "text": "Betances, Montgomery make season debuts in Yanks' loss Toronto Blue Jays Randal Grichuk is met at home plate by teammates Cavan Biggio and Bo Bichette after hitting a three-run home run against the New York Yankees in the fifth inning of a baseball game in Toronto, Sunday, Sept. 15, 2019. (Fred Thornhill/The Canadian Press via AP)\n\nTORONTO (AP) -- Pitchers Dellin Betances and Jordan Montgomery made their season debuts for the Yankees after lengthy layoffs, and New York finished its longest road trip of the season with a 6-4 loss to Toronto Blue Jays on Sunday.\n\nBetances, a 31-year-old right-hander, was diagnosed with an impingement in his pitching shoulder after his fourth spring training appearance on March 17. His rehabilitation stopped when the team said June 11 that he had strained his right latissimus dorsi muscle, and Betances did not start a minor league injury rehabilitation assignment until September.\n\nAfter three minor league outings, he entered to start the fourth inning against the Blue Jays and faced two batters, throwing seven of eight pitches for strikes. He struck out Reese McGuire on a 95 mph fastball and got Brandon Drury to take three straight strikes, the last an 84 mph curveball. Betances hopped off the mound after the second out, mistakenly thinking it was the end of the inning.\n\nScroll to continue with content Ad\n\nNew York hopes Betances will be a factor in the playoffs, joining an already strong bullpen that includes Aroldis Chapman, Zack Britton, Adam Ottavino, Tommy Kahnle and Chad Green. Betances also hopes to show he is at or close to full strength going into an offseason in which he is eligible for free agency.\n\nAce starter Luis Severino, also sidelined since spring training by a lat strain, is slated to make his first big league outing this season when the Yankees open their final homestand Tuesday against the Los Angeles Angels.\n\nGreen pitched the first inning against the Blue Jays and Montgomery followed in his first major league appearance since May 1 last year, when he left a start at Houston after one inning. The 26-year-old had Tommy John surgery on June 7, 2018.\n\nStory continues\n\nShowing a velocity in the low 90 mph range, Montgomery allowed three runs and four hits in two innings. He threw 26 of 41 pitches for strikes.\n\nAaron Judge's 23rd homer had put New York ahead in the first against Wilmer Font, but Montgomery gave up an RBI single in the second to former Yankee Billy McKinney, who scored on a double by Richard Urena before Montgomery struck out Bo Bichette to end the inning.\n\nDJ LeMahieu hit an RBI double and scored on Didi Gregorius' single for a 3-2 lead in the third against T.J. Zeuch (1-0), but Randal Grichuk tied the score in the bottom half with the first of his two homers, then hit a three-run drive in the fifth off Nestor Cortes Jr. (5-1). Grichuk has a career-high 28 homers this season.\n\nNew York headed home with a 98-53 record, and its magic number for clinching a postseason berth remained at two. The Yankees, who lost two of three at Toronto, had won their 10 previous series rubber games since an April 14 loss to the Chicago White Sox.\n\nZeuch, who debuted on Sept. 3, allowed three runs - two earned - fives hits and three walks in 5 1/3 innings. He retired 11 of his last 13 batters.\n\nKen Giles finished for his 20th save in 21 chances.\n\nTRAINER'S ROOM\n\nYankees: Betances and Montgomery were activated from the 60-day IL. RHP Jonathan Holder (shoulder) was transferred to the 60-day IL and RHP yan Dull was designated for assignment.\n\nBlue Jays: 3B Vladimir Guerrero Jr. and 1B Justin Smoak got the day off.\n\nSEE YA, CC!\n\nBefore the game, the Blue Jays honored retiring Yankees LHP CC Sabathia with a video tribute and on-field ceremony. Blue Jays president Mark Shapiro, Cleveland's GM during Sabathia's tenure with the Indians, presented the pitcher with a painting before the two embraced.\n\nUP NEXT\n\nBlue Jays: Toronto starts a three-game series Tuesday at Baltimore.\n\n---\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP-Sports", "description": "Pitchers Dellin Betances and Jordan Montgomery made their season debuts for the Yankees after lengthy layoffs, and New York finished its longest road trip of the season with a 6-4 loss to Toronto Blue Jays on Sunday.  Betances, a 31-year-old right-hander, was diagnosed with an impingement in his pitching", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/ukudOyzJtWXPjgRErpShvg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD03ODg-/https://s.yimg.com/uu/api/res/1.2/2vyUcnuXSJNUVLHbli9y5w--~B/aD0zOTQ7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201909151422517228542", "published_at": "2019-09-15"}