{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7614605/Fire-brigade-save-man-ends-dangling-one-leg-tree.html", "downloaded_at": "2019-10-27 00:45:43.801039+00:00", "title": "Fire brigade has to save a man who ends up dangling by one leg from a tree", "language": "en", "text": "A man had to be rescued by the fire brigade after he slipped and was left dangling from a tree by his left leg.\n\nThe man was trimming back branches in Castleton, Rochdale, when his leg got trapped.\n\nWhen concerned neighbours were unable to help him down, they called the fire brigade.\n\nA man has to be rescued by the fire brigade after he slipped and was left dangling from a tree by his left leg in Castleton, Rochdale\n\nThe footage shows the man precariously dangling from the tree as one man climbs a ladder to help him down - but has no success.\n\nThe video then cuts to show the firefighters trying to help.\n\nOne climbs the ladder as another holds onto the man to stop him toppling to the floor.\n\nEventually, one firefighter is able to dislodge his foot as the others lower him to the ground.\n\nThe video cuts to show the firefighters trying to help. One climbs the ladder as another holds onto the man to stop him toppling to the floor\n\nNeighbour Jon Bradshaw, 40, filmed the operation from his window.\n\nMr Bradshaw said: 'He was in the tree trimming the tree back. He obviously slipped. He shouted \"help\" and people started helping him.\n\n'They couldn't get him down so someone rang the fire brigade.\n\nEventually, one firefighter is able to dislodge his foot as the others lower him to the ground. Neighbour Jon Bradshaw, 40, filmed the operation from his window\n\n'It looked like he had done some serious damage but it was only a sprained ankle.\n\n'He lives about seven doors up, I don't really know him.\n\n'I thought it was pretty funny.\n\n'One of the other neighbours tried to help him by climbing over the fence but then got stuck himself.'", "description": "EXCLUSIVE The man was trimming the tree in Castleton, Rochdale, when he slipped and got his leg stuck. When neighbours were unable to help him down, they called the fire brigade.", "authors": ["Jemma Carr For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/20/20196754-0-image-a-42_1572118306620.jpg", "published_at": "2019-10-26"}