{"pub": "yahoo", "url": "https://news.yahoo.com/hong-kong-exchanges-drops-39-003328331.html", "downloaded_at": "2019-10-08 04:13:06.032585+00:00", "title": "Hong Kong bourse scraps $39 billion play for London Stock Exchange", "language": "en", "text": "FILE PHOTO: The name of Hong Kong Exchanges and Clearing Limited is displayed at the entrance in Hong Kong\n\nBy Sumeet Chatterjee and Scott Murdoch\n\nHONG KONG (Reuters) - Hong Kong's bourse on Tuesday dropped its unsolicited $39 billion bid for London Stock Exchange Group (LSE), conceding it hadn't won over LSE management for a move that could have transformed both global financial services businesses.\n\nThe surprise approach, made last month, had threatened to upend the LSE's own $27 billion plan to buy data and analytics company Refinitiv. The Hong Kong exchange had said the LSE would have to ditch the Refinitiv purchase for its offer to go ahead.\n\nIn a statement on Tuesday, Hong Kong Exchanges and Clearing Ltd (HKEX), said it still believed the combination of the two exchanges would be \"strategically compelling\".\n\n\"HKEX is disappointed that it has been unable to engage with the management (of the London Stock Exchange) in realizing this vision,\" HKEX said.\n\nThe approach's chance of success had been viewed by analysts as slim after it was emphatically rejected by the LSE just two days after HKEX went public with its interest.\n\nSubsequent efforts by the Hong Kong exchange to engage with LSE shareholders had also met with resistance, with some investors telling Reuters the HKEX would have to raise its offer by at least 20% - mostly in cash - to tempt LSE shareholders.\n\nHKEX shares rose 2.7% in early trading in Hong Kong following the news, compared with a 0.9% gain for the blue-chip Hang Seng Index.\n\n\"The price tag from the Hong Kong exchange perspective was getting a bit too high, so it's good for the shareholders that they decided to walk away,\" said Hao Hong, head of research at broker BOCOM International.\n\n\"HKEX will continue to try other things. Charles Li has done a lot of deals, most notably the London Metal Exchange. It may not be a stock exchange, but other related areas.\"\n\nHKEX's approach for the LSE also struggled to win support as investors viewed the political turmoil engulfing Hong Kong and the perceptions of Beijing's growing influence over the city as another key obstacle to any deal.\n\nUnder British takeover rules, the HKEX cannot bid again for the LSE for at least six months unless the LSE's management agreed to an offer, another group made a bid for the London exchange operator, or other events were deemed to be a material change in the LSE's circumstances.\n\n\"If the Refinitiv deal surprisingly fails to get approval, I think we could see HKEX come again,\" said China Galaxy Securities analyst Chi Man Wong.\n\n\"The (LSE) shareholder meeting (to approve the Refinitiv purchase) has been tentatively set for November but there is no firm date. If that deal fails then HKEX will be there.\"\n\nRefinitiv is 45%-owned by Thomson Reuters which owns Reuters News.\n\nThe LSE was not immediately available to comment on HKEX's announcement on Tuesday.\n\n\n\n\n\n(Reporting by Sumeet Chatterjee and Scott Murdoch in Hong Kong and Devika Syamnath in Bengaluru; Editing by Kenneth Maxwell)", "description": "Hong Kong's bourse on Tuesday dropped its unsolicited $39 billion bid for London Stock Exchange Group (LSE), conceding it hadn't won over LSE management for a move that could have transformed both global financial services businesses.  The surprise approach, made last month, had threatened to", "authors": ["Sumeet Chatterjee", "Scott Murdoch"], "top_image": "https://s.yimg.com/uu/api/res/1.2/T8xx_skfLkic0jy43jRdnw--~B/aD0zMDA7dz00NDk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/337cfb4689191b268a2d8c9605faa714", "published_at": "2019-10-08"}