{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7577125/Rochelle-Humes-cuts-sophisticated-figure-autumnal-trouser-suit-cosies-Marvin.html", "downloaded_at": "2019-10-16 00:28:50.101859+00:00", "title": "Rochelle Humes cuts a sophisticated figure in an autumnal trouser suit as she cosies up to Marvin", "language": "en", "text": "The radiant spouses celebrated their ten-year anniversary as a couple last month with a romantic weekend in Venice.\n\nAnd the honeymoon period seemed never-ending as a smiling Rochelle and Marvin Humes stepped out for the WellChild awards at at Royal Lancaster Hotel in London on Tuesday evening.\n\nThe This Morning presenter, 30, and her radio host husband, 34, cosied up on the purple carpet in London as they joined the Duke and Duchess of Sussex for a night to celebrate the UK's seriously ill children and young people.\n\nThe happy couple: Rochelle Humes, 30, and her radio host husband Marvin, 34, cosied up on the purple carpet on Tuesday night at the WellChild awards at Royal Lancaster Hotel\n\nRochelle channeled sophistication in an autumnal orange trouser suit which she teamed with a black pair of £743 Balenciaga Knife Patent Pumps.\n\nThe loose-fitting fabric accentuated the former The Saturdays singer's curves with a almost ankle-length matching cloth belt adding a dramatic effect as it cinched in her waist.\n\nTo accessorise, she wore thick golden hoops as a dash of golden orange eye shadow and a glossy nude lip finished off the look.\n\nShe was joined by her husband Marvin who looked suave in a grey check suit, crisp white shirt, and a dark purple patterned tie.\n\nSophistication: Rochelle channeled sophistication in an autumnal orange trouser suit which she teamed with a black pair of £743 Balenciaga Knife Patent Pumps\n\nIt comes after the couple spent a weekend away from their daughters Alaia-Mai, six, and Valentina, two, to enjoy each other's company in Venice, Italy, in September.\n\nThe pair enjoyed Aperol spritz cocktails and a gondola ride with celebrity make-up artist Francesca, who the Lorraine presenter branded as her 'other love'.\n\nMarking 10 years since they embarked on a romance, loved-up Rochelle captioned images on her Instagram: 'The best weekend with you in our favourite city ♥️ 10 years in and you just get better #luckygirl.'\n\nRoyals: The This Morning presenter and her husband joined the Duke and Duchess of Sussex for the Wellchild awards - a night to celebrate the UK's seriously ill children and young people\n\nThe showbiz couple are close friends with Francesca and London coffee chain Grind founder David Abrahamovitch, with Rochelle serving as a bridesmaid at their wedding in September 2018, while Marvin played the role of an officiant.\n\nThe group continued to soak up the sights of the picturesque city as they dined at a rooftop bar.\n\nTheir jam-packed itinerary also included a trip to St Mark's Basilica - the cathedral church of the Roman Catholic Archdiocese of Venice.", "description": "Rochelle Humes, 30, and husband Marvin, 34, cosy up on the purple carpet as they join the Duke and Duchess of Sussex at the WellChild Awards in London.", "authors": ["Emer Scully For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/23/19760244-0-image-a-93_1571177257335.jpg", "published_at": "2019-10-16"}