{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/american-airlines-tampering-charge-mechanic-miami-take-off-a9094296.html", "downloaded_at": "2019-09-06 12:08:59.538201+00:00", "title": "Airline mechanic charged with sabotaging plane that had 150 people onboard", "language": "en", "text": "An American Airlines mechanic has been charged with tampering with a plane’s navigation system before it was due to take off with 150 people onboard.\n\nThe jet was due to fly from Miami, Florida, to Nassau, Bahamas, when the sabotage was discovered.\n\nWhen the the plane’s engines were powered up, an error message was triggered in the cockpit.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe airline mechanic, Abdul-Majeed Marouf Ahmed Alani, was upset over stalled union contract negotiations, according to a court affidavit.\n\nAs a result, the plane aborted its take-off and was taken out of service, reports the Miami Herald. No one was injured.\n\nShape Created with Sketch. Top ten airlines of 2019 Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Top ten airlines of 2019 1/10 10. Thai Airways According to the Skytrax World Airline awards AFP/Getty 2/10 9. Lufthansa According to the Skytrax World Airline awards Getty 3/10 8. Qantas Airways According to the Skytrax World Airline awards Getty 4/10 7. Hainan Airways According to the Skytrax World Airline awards Getty Images 5/10 6. EVA Air According to the Skytrax World Airline awards Getty Images 6/10 5. Emirates According to the Skytrax World Airline awards Getty 7/10 4. Cathay Pacific According to the Skytrax World Airline awards Getty 8/10 3. ANA All Nippon Airways According to the Skytrax World Airline awards Getty 9/10 2. Singapore Airlines According to the Skytrax World Airline awards Getty 10/10 1. Qatar Airways According to the Skytrax World Airline awards Getty 1/10 10. Thai Airways According to the Skytrax World Airline awards AFP/Getty 2/10 9. Lufthansa According to the Skytrax World Airline awards Getty 3/10 8. Qantas Airways According to the Skytrax World Airline awards Getty 4/10 7. Hainan Airways According to the Skytrax World Airline awards Getty Images 5/10 6. EVA Air According to the Skytrax World Airline awards Getty Images 6/10 5. Emirates According to the Skytrax World Airline awards Getty 7/10 4. Cathay Pacific According to the Skytrax World Airline awards Getty 8/10 3. ANA All Nippon Airways According to the Skytrax World Airline awards Getty 9/10 2. Singapore Airlines According to the Skytrax World Airline awards Getty 10/10 1. Qatar Airways According to the Skytrax World Airline awards Getty\n\nAccording to court documents, Alani glued foam inside a tube in the nose gear that would block the aircraft’s navigation system. If the plane had taken off, the pilots would have had to fly the plane manually.\n\nThe mechanic’s intention was not to cause harm to passengers or the aircraft – rather to cause a flight delay or cancellation so he could work overtime.\n\nAlani is charged with “willfully damaging, destroying or disabling an aircraft” and will appear in court in Miami today.\n\nAn American Airlines spokesperson confirmed to The Independent: “On July 17, flight 2834 from Miami to Nassau, Bahamas, returned to the gate due to a maintenance issue. Passengers boarded a new aircraft which then re-departed for Nassau.\n\n“At American we have an unwavering commitment to the safety and security of our customers and team members and we are taking this matter very seriously.\n\n“At the time of the incident, the aircraft was taken out of service, maintenance was performed and after an inspection to ensure it was safe the aircraft was returned to service. American immediately notified federal law enforcement who took over the investigation with our full cooperation.”", "description": "An American Airlines mechanic has been charged with tampering with a plane’s navigation system before it was due to take off with 150 people onboard. The jet was due to fly from Miami, Florida, to Nassau, Bahamas, when the sabotage was discovered. When the the plane’s engines were powered up, an error message was triggered in the cockpit. The airline", "authors": ["Cathy Adams"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/06/12/istock-1024561678.jpg", "published_at": "2019-09-06"}