{"pub": "metro", "url": "https://metro.co.uk/2019/10/28/woman-41-raped-terrified-underage-boy-more-than-20-times-11000199", "downloaded_at": "2019-10-28 23:32:22.380426+00:00", "title": "Woman, 41, ‘raped terrified underage boy more than 20 times’", "language": "en", "text": "Spring Turner reportedly raped an underage boy more than 20 times, got pregnant with the youngster’s twins, and told him she would have him fired and kicked out of his home if he refused to have sex with her (Pictures: Facebook/Volusia County Sheriff’s Office)\n\nA 41 year-old woman blackmailed a frightened 15 year-old boy into letting her rape him more than 20 times, police say.\n\nSpring Turner spent two years molesting the youngster, beginning when he was 15, and ultimately gave birth to her alleged victim’s twins in March this year, it is alleged.\n\nTurner, of Orlando in Florida, was arrested and charged with sexual battery and sexual conduct with a minor last Thursday, and remains in Volusia County Jail without bail.\n\nAfter being picked up by investigators, Turner reportedly claimed she ‘only’ had sex with the boy when he turned 17.\n\nBut that is still a year lower than the age of consent in Florida, with the age gap meaning any type of sexual relationship would automatically be classed as statutory rape.\n\nTurner reportedly began abusing her alleged victim at a house in this street in DeLand, Florida (Picture: Google Maps)\n\nTurner’s Facebook page describes herself as ‘a mom of a wonderful 17 year-old son…and two beautiful twins…love you 3.’\n\nAdvertisement\n\nAdvertisement\n\nShe lists her relationship status as ‘single’.\n\nHer alleged abuse was exposed after a friend of the victim’s family, Amber Montgomery, sent Volusia County Sheriff’s Office an email detailing the claims.\n\nDeputies spoke to the boy, who confirmed the allegations, and told deputies that he hated having sex with Turner.\n\nHe said his alleged abuser would get him high on marijuana before taking advantage of him, according to The Daytona Beach News-Journal.\n\nThe boy said that Turner warned him she would have him kicked out of his home and fired from his job if he refused her sex on Independence Day 2018.\n\nHe told deputies he was fearful she would follow-through, and then let her continue to abuse him.\n\nDNA swabs were taken from Turner and her alleged victim.\n\nThey confirmed that he is the father of her twin babies, a boy and a girl.", "description": "Spring Turner of Orlando in Florida reportedly threatened to have her alleged victim fired and kicked out of his house if he refused her sex", "authors": ["Jimmy Mccloskey"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/comp-1572286985_1572292032.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-28"}