{"pub": "breitbart", "url": "https://breitbart.com/news/one-year-commemoration-of-synagogue-shooting-marked", "downloaded_at": "2019-10-28 00:28:44.245284+00:00", "title": "One-year commemoration of synagogue shooting marked", "language": "en", "text": "PITTSBURGH (AP) — The first anniversary of the deadliest attack on Jews in U.S. history was being marked around the world Sunday with community service projects, music and an online remembrance.\n\nThe shooting on Oct. 27, 2018, killed 11 worshippers and wounded seven at the Tree of Life synagogue in Pittsburgh’s Squirrel Hill neighborhood, where a steady stream of people stopped by Sunday. Lining the fence outside the closed Tree of Life building were 11 flowerpots, each one bearing the name of one of those killed. People also piled bouquets and crocheted hearts at the site and hung signs on the fence saying the city was “stronger than hate” and calling diversity its strength.\n\n“Today we remember those we lost and come together as a commonwealth to stand united as neighbors,” said a Twitter message from Governor Tom Wolf, who is scheduled to attend a memorial service in Pittsburgh on Sunday evening.\n\nPittsburgh’s sports teams joined other organizations in honoring the victims. Steelers president Art Rooney II said Sunday that fans will be asked at Monday night’s game to stand for a moment of silence for the victims and their families. The Pittsburgh Penguins said “Hatred and discrimination have no place in Pittsburgh or anywhere else,” and the Pittsburgh Pirates echoed that sentiment, saying the memory of the victims “will always be a reminder that hatred has no place in our world.”\n\nThe synagogue’s three congregations now worship at two nearby synagogues. Last week, Tree of Life leaders unveiled their vision for the damaged building: a rebuilt space for places of worship; memorial, education and social events; and classrooms and exhibitions.\n\nThe commemoration’s theme is “Remember. Repair. Together.” It includes a private Jewish service, studying the portion of the Torah that was to be read when the shooting happened, opportunities to do community service, and a public memorial service.\n\nSeveral hundred people had registered to volunteer at various community organizations on Sunday. In Germany, the Clarion Quartet, comprised of Pittsburgh Symphony Orchestra musicians, was to perform at a special event in Berlin.\n\nThousands were expected to participate in Sunday’s remembrance through Pause With Pittsburgh, a virtual memorial event created by the Jewish Federations of North America.\n\nAuthorities charged Robert Bowers, 47, a truck driver from Baldwin, Pennsylvania, in the massacre. Investigators say he used an AR-15 rifle and other weapons, and posted criticism of an immigrant aid society on social media before the attack, claiming the Jewish charity “likes to bring invaders that kill our people.”\n\nFederal prosecutors are seeking the death penalty.", "description": "PITTSBURGH (AP) — The first anniversary of the deadliest attack on Jews in U.S. history was being marked around the world Sunday with community service", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/27/60b3dd_aptopix-synagogue-shooting-anniversary-21171-mother-hugs-her-son-in-memorial-640x335.jpg", "published_at": "2019-10-27"}