{"pub": "bbc", "url": "https://bbc.com/news/entertainment-arts-49550580", "downloaded_at": "2019-09-11 14:02:32.600119+00:00", "title": "Toronto Film Festival 2019: How Sarah Paulson bagged The Goldfinch role", "language": "en", "text": "Image copyright Getty Images Image caption Sarah Paulson has previously starred in Ocean's 8 and Bird Box\n\nNothing was going to stop Sarah Paulson from bagging a role in the film adaptation of a novel she had so loved.\n\nThe US actress appears in The Goldfinch, based on the 2014 Pulitzer-winning novel by Donna Tartt. The movie had its premiere in Toronto on Sunday.\n\nPaulson, who plays Xandra, told BBC News she was \"obsessed\" with the book, but knew when auditioning she wouldn't be the director's first choice.\n\n\"I don't think I was at the top of the ideas that were percolating,\" she said.\n\n\"I had read it years ago when it first came out. And I just remember saying out loud, 'If they make a movie of this, I would love to play Xandra'.\n\n\"And I was not the choice of [director] John Crowley at the beginning. I think he had a particular image in mind, which is the image you see in the movie, which is not how I [usually] present.\"\n\nXandra could not be further as a character from Marcia Clark, the whip-smart lawyer Paulson played in The People v OJ Simpson, a role that bagged her an Emmy Award for outstanding lead actress in a limited series.\n\nImage copyright TIFF Image caption Paulson said Xandra is not the kind of role she normally plays\n\nHer character in The Goldfinch is the gum-chewing, scantily-clad, spray-tanned girlfriend of protagonist Theo's father, but she knew the character was a departure from her usual roles.\n\n\"So I hired someone to put a wig on my head, I got a spray tan, I brought cigarettes into my audition, spent an hour in my car screaming to make my voice have a bit of a rasp, because that's how Donna Tartt describes Xandra's speaking voice,\" Paulson says.\n\n\"I did all that and made the tape and I got a call saying, 'Uh-oh, you did very well'. And they weren't expecting that. Sometimes I think you have to change your physical appearance... I understand why it was hard for people to make the jump [from playing Marcia Clark].\"\n\nMore from Toronto:\n\nCrowley told BBC News he was \"a huge fan\" of Paulson. \"But when she was mentioned for Xandra I was like 'really?' She's great but I couldn't quite see that,\" he said.\n\n\"But boy, is the last laugh on me. She went at it with a great character actor's eye for detail, a love for the book, and she just colonised that role in a way that was amazing.\"\n\nEven when her audition tape was approved by Crowley, however, Paulson's casting still had to be signed off by the film studio.\n\n\"I still had to wait for Warner Brothers. Everybody had to approve everything and I was like, urgh, I just did Ocean's 8 for them!\" she laughs. \"I wanted the part so badly and they made me wait it out for so long.\"\n\nImage copyright TIFF Image caption Nicole Kidman also stars in The Goldfinch\n\nThe finished product premiered at the Toronto International Film Festival. But while it was originally considered a serious awards contender, some critics were not convinced.\n\n\"It's neither a rousing success nor an embarrassing failure, falling somewhere in between, closer to admirable attempt,\" wrote Benjamin Lee in The Guardian.\n\n\"[The storyline] is like taking a long road trip that reaches a dead end, and as the film starts to wrap up, there's not enough of a throughline to justify both the film's mammoth length and its grand sense of self.\"\n\nWriting in Collider, Matt Goldberg said: \"The Goldfinch is not only a vapid prestige picture; it's also grotesque. Rather than exploring tragedy and grief in any meaningful or thoughtful way, it offers a vague homily. It seeks to comfort without compassion.\"\n\n\"A gauzy, bloated slab of Oscar bait\" is how the movie was described by Dave Ehrlich in IndieWire.\n\n\"The big problem with The Goldfinch - a lifeless film that doesn't consist of scenes so much as it does an awkward jumble of other, smaller problems stacked on top of each other like kids inside a trench coat - is that it mistakes its source material for a great work of art.\n\n\"Crowley's simple direction flattens the entire story into a styleless mash, while [Peter] Straughan's nonlinear screenplay knots it into a self-conflicted tangle. The result is a stately, lugubrious mess that feels at odds with such an eccentric adventure.\"\n\nImage copyright Getty Images Image caption Author Donna Tartt took a hands-off approach to the film adaptation\n\nDonna Tartt herself took a fairly hands-off approach to the film. Most of the cast members had no contact with her during filming, and nor have they had feedback directly from her.\n\nAs the director, Crowley is one of the few who met Tartt - an author who rarely does interviews and doesn't keep a high profile.\n\n\"I met her once,\" says Crowley, \"which was when I was being interviewed for the job. I had a series of interviews with the producer and Warner Brothers, and the last stage of that was being sent to meet Donna in Charlottesville.\n\n\"We had lunch together, which was fantastic. There was already a first draft of the script at this point. I talked about my approach to it as much as one can in an hour, but gave her the essential elements that I felt were important to maintain. And I got back on a plane and by the time I got back to London the next day, it had been announced in the press that I got the thumbs up!\n\n\"She was in the middle of writing her next novel, so she wasn't involved in the practical details, so I didn't have any contact with her from that point on. She presumably gave me her blessing, and that was the end of that.\"\n\nFollow us on Facebook, on Twitter @BBCNewsEnts at bbcnewsents. If you have a story suggestion email entertainment.news@bbc.co.uk.", "description": "Sarah Paulson won the part thanks to a wig, a spray tan, cigarettes and an hour screaming in her car.", "authors": ["Steven Mcintosh", "Entertainment Reporter At The Toronto Film Festival"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/E258/production/_108744975_paulsongett.jpg", "published_at": "2019-09-11"}