{"pub": "businessinsider", "url": "https://businessinsider.com/white-house-official-trump-ukraine-call-crazy-frightening-2019-10", "downloaded_at": "2019-10-09 01:06:45.223521+00:00", "title": "A White House official who listened in on Trump's Ukraine call described it as 'crazy' and 'frightening'", "language": "en", "text": "A White House official who heard President Donald Trump's July 25 phone call with Ukrainian President Volodymyr Zelensky told a whistleblower they found it \"crazy\" and \"frightening,\" ABC News reported.\n\nThe official was also \"visibly shaken\" by the conversation, the report said, citing notes taken by the whistleblower.\n\nThe whistleblower went on to file an official complaint against Trump, accusing him of abusing his power for personal gain.\n\nDuring his call with Zelensky, Trump repeatedly pressured his Ukrainian counterpart to launch a corruption investigation into former Vice President Joe Biden and his son.\n\nThe complaint is at the center of a congressional impeachment inquiry examining whether Trump urged a foreign country to intervene in the 2020 race for his own political benefit.\n\nVisit Business Insider's homepage for more stories.\n\nA White House official who listened in on President Donald Trump's July 25 phone call with Ukrainian President Volodymyr Zelensky told a whistleblower they found it \"crazy\" and \"frightening,\" ABC News reported.\n\nThe official was also \"visibly shaken\" by the conversation, the report said, citing notes taken by the whistleblower.\n\nThe whistleblower, believed to be a CIA officer, went on to file an official complaint against Trump, accusing him of abusing his power for personal gain.\n\nDuring the call, Trump repeatedly pressured Zelensky to launch a corruption investigation into former Vice President Joe Biden and his son. Biden is a 2020 Democratic front-runner and one of Trump's chief political rivals.\n\nIn addition to accusing Trump of abusing his power and violating federal law, the complaint said Trump's personal lawyer Rudy Giuliani was a \"central figure\" in Trump's effort and that Attorney General William Barr \"appears to be involved as well.\"\n\nRead more: The State Department blocked Ambassador Gordon Sondland from testifying to Congress about the Ukraine scandal\n\nThe phone call is at the heart of a rapidly growing congressional impeachment inquiry into whether the president urged a foreign country to intervene in the 2020 election.\n\nTrump and his allies have attacked the whistleblower, suggesting the person is disloyal to the US and committed espionage against Trump, despite the fact that they followed the law in reporting their complaint. The president has also repeatedly called for the whistleblower's identity to become public.\n\nA White House summary of the call confirms the main details of the complaint, and Trump's handpicked spy chief testified to Congress that the complaint is \"in alignment\" with the memo.\n\nThe intelligence-community watchdog, moreover, deemed the complaint \"urgent\" and \"credible.\" Last week, Trump confirmed the complaint's central allegation — that he wanted a foreign government to investigate a political opponent — when he publicly called for both Ukraine and China to look into the Bidens.", "description": "The official was also \"visibly shaken\" by the conversation, ABC News reported, citing notes taken by the whistleblower.", "authors": ["Sonam Sheth"], "top_image": "https://image.businessinsider.com/5a6ba903cf84106d018b4e89?width=1200&format=jpeg", "published_at": "2019-10-08"}