{"pub": "euronews", "url": "https://euronews.com/2019/09/29/snl-season-premiere-takes-trump-s-impeachment-woes-n1060006", "downloaded_at": "2019-10-11 00:16:57.389664+00:00", "title": "'SNL' returns for 45th season, targets Trump impeachment", "language": "en", "text": "By Dennis Romero with NBC News Entertainment • last updated: 29/09/2019\n\nSketch comedy showcase \"Saturday Night Live\" opened its 45th season with a play on President Donald Trump's White House woes as he confronts a formal impeachment inquiry over his attempts to get Ukraine's president to investigate political rival Joe Biden's son.\n\nIn the show's cold open Alec Baldwin returns to his recurring role as the president, this time embattled and seeking the counsel of his personal attorney, Rudy Giuliani, portrayed by Kate McKinnon.\n\n\"I'm being impeached,\" Trump says. \"It's the greatest presidential harassment of all time.\"\n\nGiuliani responds, \"Nobody is going to find out about our illegal side dealings with the Ukraine. Or how we tried to cover up those side dealings. Or how we tried to cover up the cover up.\"\n\n\"Where are you right now?\" Trump asks.\n\nGiuliani: \"I'm on CNN.\"\n\nTrump eventually seeks the advice of North Korean leader Kim Jong Un, played by new featured player Bowen Yang.\n\n\"You have a big ocean in your country?\" Kim says. \"Send whistleblower to the bottom of there.\"\n\nThe president finally reaches out to the man he thinks is Ray Donovan, the Hollywood fixer from Showtime's eponymous program, but Trump ends up talking to the actor who plays Donovan, Liev Schreiber.\n\nSchreiber, in a cameo, says he doesn't work as a fixer in real life. But when Trump asks him about Liam Neeson, the actor says, \"Actually, Liam might do it.\"\n\n\"SNL\" stayed on topic with a spoof of CNN's election town halls, this one titled, \"Impeachment Town Hall,\" featuring so many Democratic presidential candidates that New Jersey U.S. Sen. Cory Booker, played by Chris Redd, is told he could leave early to beat traffic.\n\nThe host for the evening, Woody Harrelson, portrays former Vice President Joe Biden, and ex-cast member Maya Rudolph returned to Studio 8H to play U.S. Sen. Kamala Harris.\n\nMcKinnon's Sen. Elizabeth Warren expresses confidence in her role as one of the top candidates.\n\n\"I hope you guys enjoyed hot girl summer,\" she says, \"because now it's school librarian fall.\"\n\nLarry David returned to play Sen. Bernie Sanders, who says, \"I'm so excited to be back and to ruin things a second time.\"\n\nRudolph's Harris appears to be auditioning for a crime drama rather than the White House.\n\n\"I'm America's cool aunt,\" she says. \"Give you weed but then arrest you for having weed. I'm a walking, talking TNT show. 'Kamala,' Sundays on TNT.'\n\nBiden tries to appeal to voters' need for stability.\n\n\"Look, I'm like plastic straws,\" he says. \"I've been around forever. I've always worked. But now you're mad at me. Drink up, America.\"\n\nNews segment \"Weekend Update\" hammered the impeachment theme, with co-host Colin Che fretting over the length of the process.\n\n\"I bet someone explained how long impeachment takes to John Wilkes Booth and he said, 'All right, well, where's he at right now?'\" Che says.\n\nA spoof of a current affairs talk show, \"Inside the Beltway,\" looked at Trump's ability to emerge from past controversies that some pundits said would end his political career.\n\n\"SNL\" musical guest Billie Eilish and host Woody Harrelson during promos in Studio 8H this week. Rosalind O\\'Connor\n\nAs the show flashes back to Trump's remarks about Mexican immigrants (\"rapists\") and late Sen. John McCain (\"I like people who weren't captured\") and to the investigation into Russian influence on the 2016 election, a commentator played by Kenan Thompson predicts the correct outcome every time.\n\n\"Ain't nothin' gonna' happen,\" he says. And that's his prescription for impeachment: \"He's gonna win again.\"\n\nBillie Eilish made her SNL debut as the musical guest.", "description": "Rudy Giuliani, played by Kate McKinnon, comforts Trump on live TV: \"Nobody is going to find out about our illegal side dealings with the Ukraine.\"", "authors": [], "top_image": "https://static.euronews.com/articles/4193360/1000x563_nbc-1909280-snlcoldopen-kf-1250a_0f2b2578a72d1a3956a17c4232a5c499.jpg", "published_at": "2019-09-29"}