{"pub": "npr", "title": "What You Need To Know About Foreign Interference And The 2020 Election", "url": "https://npr.org/2019/09/01/737978684/what-you-need-to-know-about-foreign-interference-and-the-2020-election", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:32:57.098859+00:00", "text": "What You Need To Know About Foreign Interference And The 2020 Election\n\nEnlarge this image toggle caption Marcus Marritt for NPR Marcus Marritt for NPR\n\nForeign interference didn't begin in 2016. It didn't end with that election. And U.S. officials expect it to remain an issue through the 2020 elections as well.\n\nHere's what you need to know.\n\nWhat is it?\n\nGovernments always have sought to shape political and other conditions around the world to their own benefit. Most recently, foreign governments have used cyberattacks and agitation on social media to influence the information environment in the United States and Europe.\n\nFor Americans, the best-known case is that of Russia in 2016, which sought to keep Hillary Clinton from being elected and to help Donald Trump win. Other governments also have been detected in clandestine attempts to influence opinion in the U.S., including those of Iran and China.\n\nHow does it work?\n\nSeveral ways:\n\nCyberattacks\n\nIn 2016, Russian intelligence officers launched a wave of cyberattacks against a number of political targets inside the United States. They stole huge amounts of data they knew would embarrass those involved and released it via WikiLeaks and other ways.\n\nMeanwhile, other cyberattacks targeted state election infrastructure around the U.S., including the state-level governments and their vendors responsible for conducting elections.\n\nAlthough there were a number of compromises of various kinds, U.S. officials do not believe anyone's vote was changed — that is, no one who cast a ballot for Clinton, they say, had it later changed electronically to one for Trump.\n\nBut revelations about this keep trickling out, and they have sparked a national conversation about confidence in elections.\n\nSocial media agitation\n\nAnother ongoing strain of interference involves agitation on social networks whipped up by specialists who pose as American users on Facebook, Twitter and other platforms.\n\nIn 2016, this work crossed over from the digital realm into the real world many times, including when Russian influence specialists, for example, scheduled pro- and anti-Muslim rallies for the same place and time, directly across from each other.\n\nThe office of former Justice Department special counsel Robert Mueller identified what it called \"dozens\" of such rallies around the United States, starting in November of 2015 and continuing after Election Day.\n\nSocial media agitation continues by Russia and other foreign powers on big social network platforms; Facebook and Twitter, for example, have said since the 2016 election that they've continued purging bots and fake accounts linked to attempts to influence Americans.\n\nOther techniques\n\nThere may be other types of influence that aren't publicly known. There also are overt avenues by which foreign governments spread their messages, including state-controlled TV, radio and online outlets.\n\nThese don't only have to originate in their home countries. The Russian and Chinese governments, for example, sponsor broadcasts on radio networks that can reach many Americans inside the United States.\n\nKey questions to understand\n\nSo foreign interference is mostly about information — or disinformation?\n\nSo far, yes.\n\nThe worry expressed by U.S. officials and outside experts is that weak cybersecurity somewhere could open up the workings of an election to further mischief. Imagine precinct officials on Election Day losing access to their voter rolls, or, in places where there is no paper record of a person's vote, a ballot actually being changed after the fact from Candidate X to Candidate Y.\n\nFederal officials say the disparate variety of systems and procedures across the country mean that a U.S. election as a whole is almost impossible to hack — but an adversary doesn't need to affect the whole country. All it needs to do is affect small numbers of people in key places; the 2020 election is expected to turn on three or four key swing states.\n\nPlus the discovery of that interference anywhere could have a corrosive effect on Americans' faith in their elections everywhere.\n\nWhat is the government doing to safeguard elections?\n\nPresident Trump goes back and forth about what he accepts about foreign interference and how seriously he treats the issue. Sometimes he scoffs; sometimes he vows that interference will be counteracted very strongly.\n\nLeaders of the U.S. intelligence community and law enforcement say they're working on making sure that elections are secure. The FBI has vowed to call out interference. The Department of Homeland Security is extending help to state and other elections officials. U.S. intelligence and military agencies also are reportedly doing more work behind the scenes.\n\nCongress has provided more funding for election systems upgrades, but there are some jurisdictions that don't have paper backups for voters' ballots.\n\nAt the same time, members of Congress haven't been able to agree on legislation proposed since 2016 based on the discoveries about what took place then.\n\nProposals have included mandating more reporting about political spending on social media; requiring paper ballot backups everywhere; and requiring that campaigns report contacts with foreigners to the FBI. Members of Congress are likely to continue debating these and other proposal through the 2020 election, but they don't appear on track to become law by Election Day.\n\nWill 2020 be a repeat of 2016?\n\nProbably not.\n\nFor one thing, Americans are on their guard about foreign interference in a way they weren't before. For another, the tactics and techniques are evolving.\n\nAlthough cyberattacks and social media agitation may return, security officials' new concerns involve high-quality fake video or audio, which didn't play a big role in the stories from earlier elections.\n\nThere's also no way to know in advance whether the Russian government in particular, which wanted to put Trump into office because it liked his support for an improved relationship, would continue to support him for a second term in the same way.", "description": "The threat from cyberattacks and social media agitation isn't going away, security officials warn — but there could be new twists as President Trump battles Democrats for the White House.", "authors": ["Philip Ewing"], "top_image": "https://media.npr.org/assets/img/2019/08/31/npr-politics---foreign-interference-final_wide-b09ed7059c9b056addc909c39d8a9a67741ed528.png?s=1400"}