{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/nationals-hope-stephen-strasburg-can-break-nlds-ga", "downloaded_at": "2019-10-09 02:41:58.856079+00:00", "title": "Nationals hope Strasburg can break NLDS Game 5 curse", "language": "en", "text": "When it comes to a win-or-go-home Game 5, the Washington Nationals have usually found themselves holding a losing hand over the course of their playoff history.\n\nBut this October, the Nationals hope they have an ace in the hole: Stephen Strasburg is slated to make his first start in a deciding playoff contest.\n\nThe right-hander from San Diego takes the mound Wednesday against the Dodgers in the National League Division Series with an impressive postseason resume. He is 3-2 with a 0.64 ERA in five career postseason games, with four starts, and has allowed just 19 hits in 28 innings with 38 strikeouts and four walks.\n\n“I’ve said this before,” Strasburg said. “I think it’s something that you train for, you dream about as a kid and you want to have those opportunities to just see how your stuff stacks up. When you’re in the moment and stuff it’s a great feeling, just going out there and competing against the best.”\n\nStrasburg’s best wasn’t always there in the past for the Nationals.\n\nHe was famously shut down late in the 2012 season after he had come back from elbow reconstruction surgery. The Nationals lost in Game 5 at home of the NLDS that year to the St. Louis Cardinals as Gio Gonzalez started and the Nationals lost leads of 6-0 and 7-5.\n\n“Try not to look in the past, try not to look in the future, really just try and be in the moment,” Strasburg said. “Once you start thinking about how things could have been or what things might happen, it takes your focus away from what your job is.”\n\nStrasburg didn’t pitch in 2016 after Sept. 7 due to an injury and the Nationals lost in five games, again, to the Dodgers, who won the clincher at Nationals Park.\n\nThe right-hander started and won Game 4 of the NLDS in 2017 over the Chicago Cubs. But the Nationals lost Game 5 at home as Max Scherzer came out of the bullpen and was tagged with the loss after Gio Gonzalez started and lasted just three innings.\n\nNationals pitching coach Paul Menhart, who took the job in early May, did not rule out using Max Scherzer out of the bullpen Wednesday.\n\n“It would be worth discussing with him,” Menhart told The Washington Times late Monday. “I wouldn’t rule it totally out.”\n\nBut the Nationals hope Strasburg can go deep into the game after a stellar campaign.\n\nHe won a career-high 18 games in the regular season and posted a 3.32 ERA in 33 starts.\n\nStrasburg pitched three scoreless innings out of the bullpen in the wild card win over the Milwaukee Brewers on Oct. 1.\n\nOn Friday, he was masterful, giving up just one run on three hits in six innings to beat the Dodgers in Game 2. Strasburg fanned 10 batters with no walks in that outing.\n\nThe Nationals have come back all season, from starting the year 19-31 to rallying from a deficit in the wild card game to their win Monday over the Dodgers.\n\nWithout mentioning the name of Bryce Harper, Strasburg pointed out the Nationals have excelled this season even after losing the All-Star outfielder via free agency to the Philadelphia Phillies.\n\n“I mean it’s funny because like you go into the season and obviously, we lost a major part of the franchise in the offseason,” Strasburg said. “But I think it just showed the makeup that we have as an organization and to get back there and to be in a similar situations in the past, to have an another opportunity to move on, when you appreciate it a lot more, especially when you played a little bit longer, you start to realize how hard it is to get there. All you can really do is just give it everything you have.”\n\nThe first pitch for Wednesday’s Game 5 at Dodger Stadium is set for 8:37 p.m.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "When it comes to a win-or-go-home Game 5, the Washington Nationals have usually found themselves holding a losing hand over the course of their playoff history. But this October, the Nationals hope they have an ace in the hole: Stephen Strasburg is slated to make his first start in a deciding playoff contest.", "authors": ["The Washington Times Http", "David Driver", "Special To The Washington Times"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/08/108_2019_nlds-nationals-dodgers-b-288201_c0-0-2914-1699_s1770x1032.jpg?fc31ebc1f81a7e9000953bbb700cdfc7bf9303e7", "published_at": "2019-10-08"}