{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7611573/Drinkers-enjoy-longer-pub-opening-hours-VE-Day-year-celebrate-Britains-war-heroes.html", "downloaded_at": "2019-10-25 02:28:04.781635+00:00", "title": "Drinkers will enjoy longer pub opening hours on VE Day next year to celebrate Britain's war heroes", "language": "en", "text": "Drinkers are due to be given extra time to raise a glass to Britain’s war heroes next year.\n\nThe Government plans to extend pub closing hours to 1am on two nights next May when the country marks the 75th anniversary of VE Day.\n\nPubs, licensed bars and clubs across England and Wales will be given automatic permission to serve late on Friday May 8 and Saturday May 9.\n\nGovernment plans to extend pub closing hours to 1am on two nights next May when the country marks the 75th anniversary of VE Day (file image)\n\nThe anniversary falls on the 8th. Ministers have already announced the early May Bank Holiday will be moved from the 4th to the 8th to mark Britain’s victory over the Nazis.\n\nHome Secretary Priti Patel said: ‘VE Day is a landmark day in our history.\n\n‘Extending licensing hours will pave the way for commemorative events across the UK, so we can pay tribute to the courage and determination of the millions who fought for our freedom or supported the war effort at home.’\n\nMinisters are yet to reveal full plans for ‘VEDay75’, a series of commemorations which are expected to replicate the massive scale of the D-Day events earlier this year, as well as their power and emotion.\n\nClosing times have previously been extended to mark national occasions such as the Queen’s Diamond Jubilee in 2012 and the monarch’s 90th birthday in 2016.\n\nLast orders were also extended for the 2014 World Cup and the Royal Weddings in 2011 and last year.\n\nThe extension of pub opening hours will be subject to a consultation with police, licensing authorities, veterans organisations and other groups before being finalised. It will also have to be debated in Parliament.\n\nA happy group marches down a street in London to celebrate VE day on May 8 1945\n\nAlthough licensing hours were reformed by the Labour government under Tony Blair in 2003 - allowing pubs and bars to open round the clock - many have stuck with the traditional 11pm closing time.\n\nThe Licensing Act allows the Home Secretary to make an across the board extension to opening hours on occasions of ‘exceptional international, national or local significance’.\n\nIn June, when ministers said the 2020 early May Bank Holiday would be shifted, calendar and diary manufacturers said the announcement had been made too late.\n\nMillions of items had already been printed with the wrong information.\n\nAndrew Bennett, managing director of Hertfordshire-based printer Allan & Bertram, said at the time: ‘We’re totally in agreement with changing the date. Just not changing it with 11 months notice, when you’ve had 74 years to prepare for this event.’", "description": "Drinkers will be given longer hours to raise a glass to Britain's war heroes when the country celebrates the 75th anniversary of VE Day on May 8. Pub closing hours will be extended to 1am.", "authors": ["David Barrett Home Affairs Correspondent For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/23/20157338-0-image-a-36_1571956607932.jpg", "published_at": "2019-10-24"}