{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/3/mcdavid-draisaitl-lead-oilers-past-canucks-3-2-in-", "downloaded_at": "2019-10-03 07:30:16.709735+00:00", "published_at": "2019-10-03", "title": "McDavid, Draisaitl lead Oilers past Canucks 3-2 in opener", "language": "en", "text": "EDMONTON, Alberta (AP) - Leon Draisaitl doesn’t look satisfied with the career-high 50 goals and 105 points he amassed last season.\n\nDraisaitl had a goal and two assists, Connor McDavid snapped a third-period tie and Edmonton opened the new season with a 3-2 victory over the Vancouver Canucks in Dave Tippett’s debut as Oilers coach Wednesday night.\n\n“We made it easy on each other,” Draisaitl said. “We played simple, we played hard, and we did what we had to do to beat this team.”\n\nMcDavid broke a 2-all deadlock with 5½ minutes to play, splitting the defense before beating goalie Jacob Markstrom to the blocker side on a strong solo effort.\n\nZack Kassian also scored for the Oilers and added an assist. Mike Smith made 31 saves in his first game with Edmonton.\n\n“Leon was a horse, as he always is,” McDavid said. “Kass brought a lot of energy tonight, like he does as well. It was a real good start for those two and something I look forward to watching all season long.”\n\nTippett was impressed by Draisaitl’s play.\n\n“What you like about him is he’s a dominant player out there,” Tippett said. “You’re in a tight game. He’s got lots of juice, so we kept (putting) him out there.”\n\nAlexander Edler and Tanner Pearson had the goals for the Canucks, who won their previous five openers.\n\n“There were a couple of minutes that we’d like to have back,” Pearson said. “That’s the way it goes. Those minutes can cost you the game.”\n\nThe Oilers started the scoring nearly six minutes into the first period when Kassian won a battle in the crease and fed the puck out to Draisaitl, who beat Markstrom.\n\nSmith kept that lead intact through the first, making a huge toe save on J.T. Miller.\n\nVancouver tied the game 12 minutes into the second shortly after a power play expired as a long-range shot by Edler appeared to hit something in front before getting past Smith.\n\nThe Canucks took a 2-1 lead midway through the third when a point drive by Tyler Myers was tipped past Smith by Pearson.\n\nJust more than a minute later, the Oilers knotted the game back up as Kassian picked the top corner after taking a pass from Draisaitl.\n\n“It was a huge team win,” Smith said. “We never crumbled when we got down 2-1. You love to win, so it feels good to get that first one under our belts.”\n\nNOTES: Markstrom stopped 19 shots. … Tippett won 553 games in his first 14 seasons as an NHL coach with the Coyotes and Stars. … Veteran forward James Neal also made his Edmonton debut. … Among those making their debuts for the Canucks were rookie defenseman Quinn Hughes, forwards Micheal Ferland and Miller, and defensemen Myers and Jordie Benn. … It is the 50th season for the Canucks, who have opted not to officially name their captain until the home opener.\n\nUP NEXT\n\nCanucks: At the Calgary Flames on Saturday.\n\nOilers: Host the Los Angeles Kings on Saturday.\n\n___\n\nThis story has been corrected. A previous version indicated the Oilers had won six season openers in a row.\n\n___\n\nMore AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Leon Draisaitl doesn’t look satisfied with the career-high 50 goals and 105 points he amassed last season.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/03/canucks_oilers_hockey_54953_c0-127-2130-1368_s1770x1032.jpg?2bfa2be67b17da82ea0b971bf3e3b786c02330c9"}