{"pub": "cnbc", "title": "Warren Buffett: Developing this skill can make 'a major difference in your future earning power'", "url": "https://cnbc.com/2019/08/30/warren-buffett-why-you-should-focus-on-your-communication-skills.html", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:12:26.109145+00:00", "text": "That's because, \"what's really essential is being able to get others to follow your ideas,\" the Berkshire Hathaway chairman and CEO told Segal. \"If you're a salesperson, you want people to follow your advice. If you're a management leader, you want them to follow you in business.\"\n\nHoning this skill could even increase your worth by 50%, Buffett said in a video posted on LinkedIn last year .\n\n\"A relatively modest improvement can make a major difference in your future earning power, as well as in many other aspects of your life,\" he told Gillian Zoe Segal in an interview for her 2015 book, \"Getting There: A Book of Mentors.\"\n\nIf you want to get ahead, focus on your communication skills, billionaire investor Warren Buffett advises.\n\nWhat's really essential is being able to get others to follow your ideas.\n\nCommunication isn't something that came naturally to Buffett. \"Up until the age of 20, I was absolutely unable to speak in public,\" he told Segal. \"Just the thought of it made me physically ill.\" When he was at Columbia Business School, he decided to do something about it and paid $100 to take a Dale Carnegie public speaking course.\n\nThe class met once a week for a couple of months, but Buffett continued to practice public speaking even after it ended. \"As soon as the course was over, I went to the University of Omaha and said, 'I want to start teaching,'\" he recalled. \"I knew that if I did not speak in front of people quickly I would lapse back to where I'd started. I just kept doing it, and now you can't stop me from talking!\"\n\nTo this day, the 89-year-old considers that $100 class one of the best investments he's ever made.\n\n\"The impact that class had on my life was huge,\" said Buffett.\n\nHe doesn't have his diploma from the University of Nebraska or Columbia on display in his office, but he does have the Dale Carnegie graduation certificate visible. It \"gave me the most important degree I have,\" he said, adding: \"It's certainly had the biggest impact in terms of my subsequent success.\"\n\nDon't miss: Warren Buffett, Melinda Gates and Sheryl Sandberg agree: This is the most important decision you'll ever make\n\nLike this story? Subscribe to CNBC Make It on YouTube!", "description": "If you want to get ahead and grow your net worth, focus on your communication skills, billionaire investor Warren Buffett advises.", "authors": ["Kathleen Elkins"], "top_image": "https://image.cnbcfm.com/api/v1/image/105882560-1556636028162gettyimages-168103168.jpg?v=1560364777"}