{"pub": "arstechnica", "url": "https://arstechnica.com/science/2019/09/rocket-report-blue-origin-crew-flights-may-slip-to-2020-final-soyuz-fg-launch", "downloaded_at": "2019-10-05 10:41:06.615240+00:00", "title": "Rocket Report: Water-propulsion tests promising, Senate shows EUS the money", "language": "en", "text": "Welcome to Edition 2.16 of the Rocket Report! It's been a busy week in space, with the launch of the first person from the United Arab Emirates as well as the final launch of a venerable Russian rocket. By my favorite story this week is a recollection by Wayne Hale about one contingency NASA never had to put in place with the space shuttle—a crew member riding home in the payload bay.\n\nAs always, we welcome reader submissions, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.\n\nBlue Origin to conduct two more uncrewed test flights. The company expects to fly its New Shepard space tourism rocket at least two more times before it puts the first people on board, Chief Executive Bob Smith said this week. This probably will necessitate a slip into 2020 for the first crewed flights, CNBC reports.\n\nWhat is driving the delays? ... \"It's really the robustness of our entire system. It's not one individual thing that's driving [these delays],\" Smith said. \"It's us being cautious and thorough with the total systems we need to verify.\" It's understandable that a company flying people into space would be cautious. Any accidents would undoubtedly put a damper on customer enthusiasm. (submitted by danneely and Ken the Bin)\n\nVirgin Orbit ships rocket to launch site. Virgin said this week that it has shipped the rocket that will fly its first mission into space from the company's factory in Long Beach. At its test site in Mojave, the company says it will begin the rocket's launch campaign. A launch could come late in 2019, provided testing goes well.\n\nOff to the skies ... \"In the coming weeks, we'll run through a number of critical exercises, including loading and fueling with our mobile ground-support equipment,\" Virgin said. \"We are prepping and practicing, making sure we know how to do everything we could conceivably ever need to do. Then, it's off to the skies—first for a captive carry flight, and then for the launch itself.\" We're eager to see LauncherOne take to the skies. (submitted by Unrulycow)\n\nThe Rocket Report: An Ars newsletter The easiest way to keep up with Eric Berger's space reporting is to sign up for his newsletter, we'll collect his stories in your inbox. Sign Me Up!\n\nFirefly releases updated Payload User's Guide. At first glance, the document appears to contain few significant changes. The Alpha rocket, with a maximum capacity of 1 ton to low Earth orbit, is still being offered to customers for $15 million a launch. The guide also provides information about the larger Beta rocket under development, but it does not provide a price.\n\nOngoing stage tests ... Meanwhile, Firefly has continued to conduct a series of stage tests for the Alpha vehicle. The company indicated last week that it had put a full cluster of four Reaver 1 engines on a test stand in Texas, in the same configuration as for an Alpha launch. The first Firefly mission now appears likely to launch sometime during the first quarter of 2020 from Vandenberg Air Force Base. (submitted by Unrulycow)\n\nWater plasma propulsion shows promise. Silicon Valley startup Momentus says it has had success in on-orbit testing of water plasma propulsion and other key elements of its Vigoride in-space transportation vehicle, SpaceNews reports. Since July, the company has been firing the water plasma thruster and performing in-space maneuvers on a 16-unit Cubesat.\n\nEarly results are promising ... \"This successfully demonstrates for the first time in-space water plasma propulsion, and also demonstrates the technology, which has the highest specific impulse among other water-based propulsion,\" the company said. One promising application for the technology is moving satellites from the orbit where they are dropped off by large rockets conducting rideshare missions to their optimal orbital locations. On-orbit testing will continue.\n\nSoyuz FG makes final ride into space. The venerable Soyuz FG rocket launched for the 70th time on Wednesday, lofting Oleg Skripochka (Russia), Jessica Meir (United States), and Hazzaa Al Mansouri (United Arab Emirates) to the International Space Station. The Soyuz FG variant served as a bridge between the older Soyuz-U and the newer Soyuz 2 rocket variants, NASASpaceFlight.com reports. The FG launched for the first time in May 2001.\n\nServed NASA and the Russians well ... The Soyuz FG has been the only Russian rocket to launch humans to the International Space Station for the last 17 years, and since the retirement of the US Space Shuttle fleet in July 2011, it has been the only rocket capable of transporting people to the International Space Station. The rocket's only failure came in 2018, when the crew had to make an emergency landing.\n\nJapanese rocket safely launches after pad issue. A Japanese H-2B rocket flew into orbit Tuesday from the Tanegashima Space Center, Spaceflight Now reports. The automated cargo freighter was loaded with 4.1 tons of batteries, experiments, spacewalk equipment, water, and provisions for the International Space Station.\n\nSurviving a fire ... The launch followed a first attempt September 10, when a dramatic fire on the launchpad halted the countdown. Officials determined the fire was likely caused by static electricity and high concentrations of oxygen that dripped from the rocket's main engines during the September 10 countdown. After instituting unspecific \"corrective actions,\" Mitsubishi Heavy Industries returned the H-2B rocket to the launchpad a half-day before Tuesday's launch to begin a new countdown. (submitted by Ken the Bin)\n\nFalcon Heavy rocket is now fully certified. Now that the Falcon Heavy rocket built by SpaceX has flown three flights, it is \"fully certified\" for Air Force missions. However, work remains to make the vehicle eligible to fly missions to all of the Department of Defense's reference orbits, Lt. Gen. John Thompson, commander of the Air Force Space and Missile Systems Center, told SpaceNews.\n\nMore work to go ... \"It's not certified for all of our most stressing national security space orbits,\" Gen. Thompson said. \"We continue to work with SpaceX to mature their design, and I think that's going well.\" Launch vehicle systems are certified for specific mass and orbit combinations. Eventually, the Falcon Heavy is likely to be certified for all nine of the DOD reference orbits. (submitted by Ken the Bin and Unrulycow)\n\nSenate budget fully funds Exploration Upper Stage. The US Senate has continued to make its priorities for NASA clear, as budget writers provided $2.586 billion for the Space Launch System, which is more than $400 million above 2019 levels. The additional SLS funding includes $300 million for work on the Exploration Upper Stage planned for the Block 1B version of the SLS, funding that the administration did not seek in its original funding request, SpaceNews reports.\n\nA message from Shelby ... At the same time, the Senate budget provides $744 million for lunar landers, well short of the $1 billion NASA said it needed to keep the Artemis Program on track to send humans to the Moon by 2024. This appears to be Senate Appropriations Committee Chairman Richard Shelby's (R-Ala.) not-so-subtle way of reminding NASA who is really in charge of the agency.\n\nRiding home from space in the shuttle's payload bay. In a blog post this week, former space shuttle program manager Wayne Hale shared a delightful story about emergency plans, which were never used, to bring home an astronaut inside the space shuttle's payload bay. It's quite a read.\n\nWait, really? ... \"There was a good place to strap down at the bottom of the payload bay aft of the SpaceLab module. It would be a short wait from finishing up with the doors until the de-orbit burn, probably no more than an hour and a half. From de-orbit burn to the ground was about an hour, and in normal flight the g loading was light, nothing more than 1.5g.\"\n\nNext three launches\n\nOct. 10: Pegasus XL | ICON | Skid Strip, Cape Canaveral Air Force Station | 01:30 UTC\n\nOct. 10: Proton | Eutelsat 5 West B & MEV 1 | Baikonur Cosmodrome, Kazakhstan | 10:26 UTC\n\nOct. 21: Antares | Cygnus mission to supply ISS | Wallops Island, Virginia | 18:39 UTC", "description": "\"We continue to work with SpaceX to mature their design.\"", "authors": ["Eric Berger"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2018/07/Rocket-Report-Intro-3-760x380.jpg", "published_at": "2019-09-27"}