{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/food/it-might-be-trendy-again-but-orange-wine-is-nothing-new--and-nothing-to-scoff-at/2019/09/27/5ed1864e-e061-11e9-be96-6adb81821e90_story.html", "downloaded_at": "2019-09-27 16:24:01.292290+00:00", "title": "It might be trendy again, but orange wine is nothing new — and nothing to scoff at", "language": "en", "text": "\n\nKevin Wade, of Georgian Wine House, pouring wines at the Amber Revolution wine event at Maydan in Washington. (Maya Oren)\n\nOrange wines aren’t going anywhere, even if the New Yorker would like them to disappear. The magazine fired a broadside at this once-and-future style of wine in early September, in an essay titled, “How the Orange-Wine Fad Became an Irresistible Assault on Pleasure.” The author, Troy Patterson, recounted how he encountered an orange wine in a “purposely archaic” Italian restaurant in Brooklyn that seemed to illustrate everything that is wrong in New York society.\n\n“An intense whirligig of tannins metallically attacked my mouth and, on the finish, there was an astringent sizzle, with undertones of acid reflux,” Patterson wrote. “ . . . While I waited for the wine’s acrid smack to wear off, I meditated on how this chic but peculiar elixir reflected the terroir of the urban social landscape.”\n\nOkay, so Patterson earns creative writing points on the tasting note. But his critique is too narrow. He gives a salutary nod to the diverse styles of orange wine, yet his beef seems to be with the category’s most zealous adherents rather than the wine itself.\n\nSome context: Orange wine describes an ancient winemaking method that originated centuries ago in Georgia, which enjoys a friendly competition with Armenia for the earliest archaeological evidence of winemaking. It refers to the technique of fermenting a white wine on the grape skins, which gives color and tannin to the wine. Traditionally, these wines were fermented and aged in clay vessels called qvevri.\n\nThe technique is so old it cannot credibly be called a fad. But it has become trendy in the past decade or so as part of the natural wine movement, a counter to post-World War II industrial viticulture. Modern white wines are made by draining the grape juice off the skins immediately after pressing, to preserve clarity and freshness. Skin-fermented whites can be aged in stainless steel, oak or earthen vessels. They range in color from pale copper to golden, or amber or even brown depending on how long the juice is left on the skins and how much the wine is exposed to oxygen. The flavors imparted by skin fermentation range from a slight tannic bite to spices and, in the extreme, weirdly earthy and funky. That extreme is where Patterson anchored his critique.\n\n“The geekiness — the fact that orange wine is challenging, that its appeal is more cerebral and gastronomic than carnal and epicurean — is central to its identity,” he writes. It’s the Emperor’s New Clothes — if you like orange wines, you are “in,” but if you can’t recognize their virtues, you just don’t get it.\n\n“A wine with a finish like sucking on a grapefruit rind is not a wine to drink for enjoyment,” Patterson writes. “It is a wine to suffer through — the suffering is proof that the drink is morally improving — and then to enjoy talking about. The talking is the proof of the drinker’s good taste.”\n\n\n\nNoel Brockett of Georgian Wine House brings some bottles to pour at the Amber Wine Revolution tasting at Maydan restaurant in Washington DC. (Maya Oren)\n\nThese wines were more popular than geeky at a recent tasting I attended in Washington, D.C., called Amber Revolution. (Some adherents prefer calling these amber wines rather than orange, because, well, they aren’t made with oranges.) More than 80 people crammed into the tiny Maydan restaurant to sample about three dozen skin-fermented white wines from Georgia. There was only one I might say tasted like “sucking on a grapefruit rind.” My notes contained descriptions like tannic, nutty, citrus rind and spices such as cloves and nutmeg. Nothing so snarky and negative as Patterson’s descriptions.\n\nThere is still some resistance to skin-fermented white wines in the retail market, though that is changing, says Noel Brockett, director of sales and operations for Georgian Wine House, a Washington-based importer. His portfolio includes 35 amber wines out of 100 from Georgia, plus some from other countries, distributed in 13 markets across the United States. Brockett dismissed the New Yorker diatribe as a “last gasp” critique by defenders of modern wine orthodoxy.\n\nFor Brockett, Patterson represents “people who know what they like in wine and don’t want other people telling them something else is good.”\n\nMany people view amber wine as “the symbol for weird wine,” says Maria Bastasch, beverage director for Maydan and Compass Rose restaurants in Washington, where amber wines feature prominently on the lists. But she cites consumer acceptance of natural wines and wines from countries such as Bolivia and Mexico as evidence that diners are open to more choices.\n\nCall them orange or amber, skin-fermented white wines are here to stay. Not just because wines have been made this way for 8,000 years, but also because more winemakers today are adopting the technique. Some are also incorporating it into more traditional (as in, modern) winemaking. I recently tasted an outstanding roussanne from Yangarra winery in Australia’s McLaren Vale region. Winemaker Peter Fraser fermented about half the grapes on the skins, and aged the wine in egg-shaped ceramic vessels. Roussanne, a white grape from southern France, is rich and low in acid. The wines can be broad and flabby, but Fraser’s version was taut and lively, with a tannic snap that made it refreshing and complex.\n\nNo fad, no pretense. Just delicious.", "description": "One of the oldest winemaking traditions is making a comeback.", "authors": ["Dave Mcintyre", "September At Pm", "Dave Mcintyre Writes About Wine Weekly. He Also Blogs At"], "top_image": "https://www.washingtonpost.com/resizer/_rXu0x-CXJFE3KPW3WecHqzkQ_A=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/63AIL5W7WUI6TPT7JTEFAF6DN4.jpg", "published_at": "2019-09-27"}