{"pub": "cnn", "url": "https://edition.cnn.com/2019/09/17/health/alzheimers-aerobic-exercise-wellness/index.html", "downloaded_at": "2019-09-22 06:02:37.676128+00:00", "title": "Regular aerobic exercise may slow Alzheimer's progression", "language": "en", "text": "(CNN) A half hour of aerobic exercise four to five times a week may prevent or slow cognitive decline in older adults who are at a high risk of developing Alzheimer's, according to a study published Tuesday in the Journal of Alzheimer's Disease.\n\n\"This is the first randomized and controlled trial ... to assess effects of exercise on brain structure, function and amyloid burden in older adults who have memory problems, thus, high risks of Alzheimer's disease,\" said lead author Rong Zhang, a neurology professor at UT Southwestern Medical Center.\n\nThe study was a small proof-of-concept trial of people ages 55 and older with mild cognitive impairment. Subjects were randomized to 12 months of aerobic exercise or stretching and toning. Both aerobic and stretching may prevent or slow cognitive decline, according to the researchers, but aerobic exercise had more benefits on reducing hippocampal shrinkage than stretching. The hippocampus is a region of the brain crucial for memory.\n\nNeither type of exercise prevented amyloid clumps -- a hallmark of Alzheimer's disease -- from continuing to develop in the brains of the 70 adults who participated in the study. But MRI and PET imaging showed those who did aerobic exercise had slower degeneration in the hippocampus than those who did flexibility training.\n\n\"The brains of participants with amyloid responded more to the aerobic exercise than the others,\" Zhang said.\n\nRead More", "description": "A proof-of-concept study shows regular aerobic exercise may prevent or slow cognitive decline in older adults at risk for Alzheimer's.", "authors": ["Sandee Lamotte"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190122101724-01-alzheimers-super-tease.jpg", "published_at": "2019-09-17"}