{"pub": "euronews", "url": "https://euronews.com/2019/10/28/giant-and-eerie-display-of-halloween-pumpkin-heads-in-bucharest", "downloaded_at": "2019-10-28 23:47:31.051459+00:00", "title": "Giant and eerie display of Halloween pumpkin heads in Bucharest", "language": "en", "text": "It's a tough job, but here in the Romanian capital everyone here has their knives, at the ready, to carve.\n\nThis entire festival is dedicated to Halloween and visitors also get to sample the local food and wine.\n\nOrganisers of this \"Pumpkin Fest\" claim the final display is one of the biggest in Europe.\n\nFor six euros you get to design one of your own.\n\nThe celebration of All Hallows Eve on October 31st originally comes from ancient Celtic customs.\n\nIt was once believed there was a veil between world of ghosts and spirits and our world. On Halloween, the Eve of All Hallows, the veil was at it's thinnest and all the dead could roam with the living.\n\nIn Romania, Saint Andrew's Eve on November 29 evokes similar magical myths of the dead re-entering the world of the living for one night.\n\nAccording to popular beliefs, troubled spirits rise from the grave and roam the land frightening people.\n\nBut the pumpkins themselves don't have to look demonic, Teodora Gagu says: \"I wanted to carve a cat, it's like a cat attempt, I think it's pretty okay for a first attempt, I'm pretty happy with it and yes, I struggled a bit, but it's fine.\"\n\nThe final display is pretty impressive when it comes to life in the dark with each of the thirty thousand fiendish vegetables lit up individually.", "description": "It's Halloween later this week and festivities are already in full swing in Bucharest where people are busy carving thousands of pumpkins.\nThey're aiming to create a giant display of the ghoulish pumpkin heads for All Hallows Eve.", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/26/44/34/1000x563_cmsv2_f2f1dec0-5266-5c69-b25d-e8de42006e25-4264434.jpg", "published_at": "2019-10-28"}