{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7553777/The-forgotten-palaces-Eerie-video-shows-north-Londons-abandoned-billionaires-row.html", "downloaded_at": "2019-10-09 12:48:19.886449+00:00", "title": "The forgotten palaces: Eerie video shows north London's abandoned billionaires' row", "language": "en", "text": "Advertisement\n\nNew footage has emerged of the crumbling £350 million mansions left abandoned in north London's billionaires' row.\n\nBishops Avenue in Hampstead is one of the most exclusive roads in the country, but many of its 66 mansions lie vacant.\n\nEerie video captured by documentary makers Beyond The Point earlier this month shows murky swimming pools and creepy abandoned gardens filled with pricey sculptures.\n\nBishops Avenue in Hampstead, north London, is one of the most exclusive roads in the country, but many of its 66 mansions lie vacant\n\nEerie images captured by documentary makers Beyond The Point earlier this month show creepy abandoned gardens filled with pricey sculptures\n\nA pond in the gardens of a crumbling mansion, where weeds now sprout between the gaps in the paving stones and trees are left overgrown\n\nMany of the houses were bought for around £1m in the late 80s but some were never lived in and allowed to rot while others were barely used\n\nFurther unseen footage show a perfectly kept living room left to ruin in one of these multi-million pound mega mansions.\n\nBeautiful antiques furnish the house and magazines lay on the floor as if the house's millionaire owners would return at any moment.\n\nOther clips reveal graffiti strewn windows which looked into a ballroom with a majestic grand gold staircase which has been overtaken by ferns and the ceiling collapsed.\n\nAn investigation by the Guardian in 2014 found that the row of mansions are collectively worth around £350million.\n\nMany were bought for around £1m in the late 80s but some were never lived in and allowed to rot while others were barely used.\n\nCurrently many of the sites on the street have been converted in plush apartments and offices but a number of these crumbling mansions are boarded up and derelict.\n\nThe Guardian found that 16 of the mansions on the road have been abandoned while others are used for short periods.\n\nIt discovered a third of these once majestic mansions were empty with more than 120 bedrooms in the vacant houses.\n\nCurrently many of the sites on the street have been converted in plush apartments and offices but a number of these crumbling mansions are boarded up and derelict\n\nA sculpture in the back garden of one of the properties, which would have once been home to a wealthy family\n\nFurther unseen footage show a previously perfectly kept living room left to ruin in one of these multi-million pound mega mansions\n\nOne row of ten mansions worth at least £73m were never used after being reportedly purchased on behalf of the Saudi royal family between 1989 and 1993. Pictured is one of the many homes on the street\n\nAnvil Varma, a leading property developer, described it as 'one of the most expensive wastelands in the world'.\n\nOne row of ten mansions worth at least £73m were never used after being reportedly purchased on behalf of the Saudi royal family between 1989 and 1993.\n\nIn 2016, it was reported that Justin Bieber was renting a historic 15-bedroom mansion on The Bishops Avenue for £108,000 a month.\n\nAnd in 2008, the former President of Kazakhstan Nursultan Nazarbayev bought a home on the exclusive street for £50million, making it one of the most expensive houses in the UK.\n\nThe average house price in the UK is £230,776 which is 65 times less than the average £15million mansion on Bishop's Avenue.\n\nMany owners are thought to live abroad, while some residents of the non-abandoned houses only visit for short periods.\n\nThe average house price in the UK is £230,776 which is 65 times less than the average £15million mansion on Bishop's Avenue", "description": "Bishops Avenue in Hampstead is one of the most exclusive roads in the country, but many of its 66 mansions lie vacant.", "authors": ["Rory Tingle For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/11/19486998-0-image-a-2_1570618524942.jpg", "published_at": "2019-10-09"}