{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/16/maya-moore-dedicating-wnba-hiatus-to-criminal-just", "downloaded_at": "2019-09-16 11:59:50.587630+00:00", "title": "Maya Moore dedicating WNBA hiatus to criminal justice reform", "language": "en", "text": "NEW YORK (AP) - Maya Moore shocked the basketball world when she stepped away from the WNBA earlier this year before the season began. She’s spent a lot of her time away from the game trying to help a family friend, Jonathan Irons, get his conviction overturned.\n\nIrons has been incarcerated since 1997 after he was convicted in the nonfatal shooting of a homeowner during a burglary. He’s serving a 50-year sentence but has asked a judge to reopen his case and will have an evidentiary hearing on Oct. 9 in Missouri. Moore, who plans to be in the courtroom next month, said there was no physical evidence - no DNA, fingerprints or footprints - linking Irons to the crime.\n\n“I’ve known Jonathan for over a decade, and I’m fighting to make sure his case gets a fair review. I’m trying to call attention to the prosecutorial misconduct that I believe resulted in his being wrongfully sent to prison for 50 years as a teenager,” Moore told The Associated Press in a phone interview Sunday night. “This hearing will hopefully give us a perfect opportunity to show why this conviction lacks integrity for so many different reasons.”\n\nMoore has kept a low profile during her time away from basketball. She had done only one interview , talking to the New York Times over the course of a few months to chronicle Irons’ story.\n\nIrons, then 16, had been seen in O’Fallon, Missouri - a suburb of St. Louis - on the evening of Jan, 14, 1997, with a gun, according to court records cited by the Times. The victim returned home and confronted a burglar, the records said. Shots were fired and the victim was hit in the right temple. A week later, Irons was arrested. The detective in the case said Irons confessed, but the detective wasn’t available to be cross-examined at trial because he was ill. He has since died.\n\nMoore spent time over the weekend in Washington speaking to the Congressional Black Caucus. She started a petition on Change.org to further spread the word about Irons.\n\n“Maya’s petition has become one of the fastest-growing petitions on the site this week, as thousands of people respond to her call for a fair trial for Jonathan Irons, and a fairer justice system for all Americans,” said Michael Jones, managing director of Change.org.\n\nMoore, who turned 30 this summer, also started a social action campaign called Win With Justice . She hopes it will call attention to the power wielded by prosecutors and their obligation to use it responsibly.\n\n“Hopefully this will educate people to do something when they feel doomed and get outraged,” Moore said. “While it’s hard for people to grasp the 10,000 people who are wrongfully convicted of serious crimes each year, Jonathan’s case helps bring it down for people to connect with. You can connect with one man’s story.”\n\nBy taking time away from basketball, Moore said she’s been able to dive into things that she’s wanted to do for a long time. She’s spent more time with her mom in Atlanta and with her ministry.\n\n“I’ve been engaged in so many meaningful things,” she said. “I’ve been full with family and ministry things. When you invest in something for so long and you stop and have nothing to fill that space, it can be more of a crisis of identity. For sure I miss the people I didn’t get to spend every day with this year that otherwise I would have.”\n\nAs far as returning to the basketball court, Moore said she’s still uncertain.\n\n“I’ll figure it out when the time’s right. Definitely not thinking about it right now. There’s so much on my plate to prioritize. When I released the Player’s Tribune article I said I wanted to take a full year. I won’t be a pro basketball player for a year. Maybe sometime this spring I’ll figure out what’s next. For now I’m trying to be in the moment. It’s a wild journey I’m on. Trying to take it literally one week at a time.”\n\n___\n\nFollow Doug Feinberg on Twitter at https://twitter.com/DougFeinberg\n\n___\n\nMore AP sports: https://apnews.com/apf-Sports and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Maya Moore shocked the basketball world when she stepped away from the WNBA earlier this year before the season began. She's spent a lot of her time away from the game trying to help a family friend, Jonathan Irons, get his conviction overturned.", "authors": ["The Washington Times Http", "Doug Feinberg"], "top_image": "", "published_at": "2019-09-16"}