{"pub": "nymag", "url": "https://vulture.com/2019/09/tekashi-69-update-rapper-admits-to-years-of-domestic-abuse.html", "downloaded_at": "2019-09-10 23:37:12.353760+00:00", "title": "Tekashi 6ix9ine Confesses to Years of Domestic Abuse", "language": "en", "text": "Photo: Shareif Ziyadat/WireImage\n\nEarlier this year, Tekashi 6ix9ine pleaded guilty to nine federal counts in a racketeering case, which is the latest bullet point in his very controversial career. The rapper, born Daniel Hernandez, is cooperating with the Feds in the hopes of landing a reduced sentence. (He currently faces anywhere from 47 years to life in a federal prison). Hernandez is set to testify in court next week against members of the Nine Trey Gangsta Bloods gang, but at ﻿a final pretrial hearing on Tuesday morning in Manhattan, the rapper admitted to years of domestic abuse against women, according to Complex. “A section of 6ix9ine’s cooperation agreement with the government,” the report says, “listed a number of crimes that he committed, and for which the government agreed not to prosecute him.” The report, which was not made public until now, also states that Hernandez “admits domestic violence from 2011 to November, 2018.” As such, any accusation of domestic violence cannot be brought up during his testimony.\n\nHernandez previously admitted to the Feds that he became a member of the “violent” Nine Trey Gangsta Bloods in fall 2017, and that “as a member of Nine Trey, the enterprise engaged in such activities including shooting at people, robbing people, and at times drug trafficking.” His ex-manager, who has also admitted he was a member of the gang, pleaded guilty to the federal racketeering case. Hernandez will have to wait until January 2020 to receive a sentencing decision.", "description": "The rapper Tekashi 6ix9ine has admitted to years of domestic violence at a pre-trial hearing in Manhattan.", "authors": ["Devon Ivie"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/10/10-tekashi-6ix9ne.w1200.h630.jpg", "published_at": "2019-09-10"}