{"pub": "breitbart", "url": "https://breitbart.com/news/with-dhs-head-departing-unclear-who-will-be-in-charge", "downloaded_at": "2019-10-30 23:53:48.317951+00:00", "title": "With DHS head departing, unclear who will be in charge", "language": "en", "text": "WASHINGTON (AP) — A day before the acting Homeland Security secretary is set to leave his job, it remains unclear who will be tapped to run the sprawling agency tasked with national security, disaster response and protection of the president and his family.\n\nKevin McAleenan, the fourth man to hold the job, had told colleagues that he would be departing Thursday. While he could choose to stay on, a goodbye party to fete him was scheduled for Wednesday afternoon.\n\n“I’m not going to discuss any pre-decisional personnel matters,” McAleenan told a House Committee Wednesday when asked about plans for the department. Still, he said he was prepared to stay on if asked.\n\n“If necessary, I’ll absolutely ensure a smooth transition,” he said.\n\nFor weeks, various factions have been looking for legal blocks and work-arounds as they spar over who is eligible to succeed McAleenan in the role. Federal vacancy rules that place restrictions on the position had been thought to bar immigration hardliner Ken Cuccinelli, currently the acting head of U.S. Citizenship and Immigration Services, and Mark Morgan, the current acting commissioner of U.S. Customs and Border Protection, from taking the job.\n\nBut officials have recently identified a “loophole” in which Trump could appoint otherwise ineligible individuals by first tapping them to lead the Countering Weapons of Mass Destruction Office — a post that is vacant. The discovery of the work-around was first reported by The New York Times.\n\nIn addition to Cuccinelli and Morgan, the White House has also been weighing Chad Wolf, former chief of staff to ex-Secretary Kirstjen Nielsen, as a possible McAleenan successor. Another name that has been mentioned is Kenneth Rapuano, a longtime counterterrorism official who is currently the assistant secretary of defense for homeland defense and global security, and previously served as deputy homeland security adviser to President George W. Bush.\n\nThat is according to more than a half dozen current and former administration officials and people close to the White House who spoke on condition to anonymity in order to discuss private deliberations.\n\nCuccinelli was asked about the job Wednesday during an appearance on Capitol Hill. He responded that he wasn’t prepared to answer. But when pressed, he said he wouldn’t take any post if it violated the law.\n\nThe sprawling 240,000-person Department of Homeland Security oversees a huge portfolio that includes election and cyber security, disaster response, child trafficking investigations, the U.S. Coast Guard and the U.S. Secret Service.\n\nBut in Trump’s universe, DHS has typically meant one thing: immigration enforcement.\n\nMcAleenan, who led U.S. Customs and Border Protection before taking on his current job, had years of experience on the border and was viewed at the White House as someone who could get the job done.\n\nHe successfully brokered agreements with Central American nations, which other secretaries could not, and oversaw a dramatic drop in border crossings during his six-month tenure.\n\nBut McAleenan often disagreed with the president’s public messaging, and his style stood in marked contrast with the department’s two immigration leaders — both acting — who are fervent and very vocal supporters of Trump’s policies. The jockeying for power caused friction between McAleenan and his component heads.\n\nWhoever replaces McAleenan will be the fifth person to lead the department since Trump took office.\n\nSpeaking Wednesday on the Hill, McAleenan, who officially tendered his resignation earlier this month, said he was closing this stage of his government career.\n\nDuring the hearing, House Homeland Security Committee Chairman Bennie Thompson, D.-Miss., voiced concerns about the leadership void at the 240,000-member department, which has experienced unpresented churn under Trump and currently has numerous officials serving in “acting capacities,” with many positions unfilled.\n\n“It has been 203 days since the Department last had a confirmed secretary,” he said. “And even though Acting Secretary McAleenan is leaving tomorrow, the president has yet to announce who his replacement will be.”\n\n“What is the delay?” he asked.\n\n__\n\nAssociated Press writers Eric Tucker in Washington and Philip Marcelo in Boston contributed to this report.\n\n__\n\nFollow Long and Colvin on Twitter at https://twitter.com/ctlong1 and https://twitter.com/colvinj", "description": "WASHINGTON (AP) — A day before the acting Homeland Security secretary is set to leave his job, it remains unclear who will be tapped to run the sprawling", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/30/f97d20_congress-homeland-security-85277-christopher-wray-kevin-mcaleenan-acting-640x335.jpg", "published_at": "2019-10-30"}