{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/24/book-review-on-fire", "downloaded_at": "2019-09-25 04:41:21.888721+00:00", "title": "BOOK REVIEW: 'On Fire'", "language": "en", "text": "ANALYSIS/OPINION:\n\nIf you didn’t have to die before coming back as somebody else, Naomi Klein’s “On Fire” is a book that just might make you believe in reincarnation. Reading her emotionally charged rant about how capitalism is killing the planet and how the latter can only be saved by driving a stake through the heart of the former, I came away convinced that, if Bernie Sanders had been born two generations later than he was — but in Canada, and as a woman — he would probably have been Naomi Klein.\n\nMs. Klein’s parents, progressive lefties and self-identified anti-war “hippies,” fled from the United States to Canada in 1967, a few years before their daughter’s birth. Her grandparents were communists. Doubtless, like the peerless Bernie, Ms. Klein’s forebears are ardent admirers of the Moscow subway system and other heroic socialist achievements aimed at making all of us run on time.\n\nThat family history helps us understand where Naomi Klein is coming from, and why her impassioned call for a Green New Deal is as much about dismantling Western democratic capitalism as it is about saving the planet. Ms. Klein pooh poohs the notion that “by linking climate action with so many other progressive policy goals, conservatives will be more convinced that global warming is a plot to smuggle in socialism, and political polarization will deepen.”\n\nOn the contrary, she writes, “one of the greatest benefits of approaching the climate emergency as a vast infrastructure and land regeneration project” would be a big government bonanza “bringing jobs and resources to hurting communities.”\n\nSqueaky green “free stuff” would buy votes since, even though “[s]ome people will still be convinced that climate change is a hoax … if it’s a hoax that creates good jobs and detoxifies the environment, especially in regions where the only other economic development on offer is a supermax prison, who really cares?”\n\nLike most radical ideologues, Ms. Klein sees “climate change” as a handy weapon in the struggle against their pet hate — the free market democracies that have brought progress, prosperity, and a better life to not only advanced Western nations, but the human race in general. Tyranny, corruption, and man’s inhumanity to man are as old as history itself. But the revolutionary breakthroughs in health, literacy, rising living standards, lower infant mortality rates and other vital social measures have all originated in advanced western societies and spread from them to the more backward parts of the globe.\n\nYet for people like Naomi Klein, the source of all progress becomes the source of all evil. “It’s going to take an all-out war on pollution and racism and colonialism and despair all at the same time,” she writes. As for those who disagree with her, “[o]verwhelmingly, climate deniers are not only conservative but also white and male, a group with higher-than-average incomes. And they are more likely than other adults to be highly confident in their views, no matter how demonstrably false.”\n\nIf only she could get rid of all those “highly confident” white males with decent salaries, and win an “all-out war” on racism and colonialism, she could create a green utopia with central authority re-allocating personal property and resources for the general welfare, a sort of feminist Comintern where Big Mother is watching you, enforcing “equality,” and defining truth for the rest of us.\n\nWe’ve already seen how that scenario plays out when applied — as it inevitably has to be — by force. Indeed, the most polluted industrial environments of the 20th century were also the most state-managed: Smoke-spewing, stream-fouling, radiation-spilling (and money-losing) disaster zones otherwise known as the Soviet Union and its satellite states. Most of them are still generations behind clean technologies developed and applied by private sectors in the democratic West.\n\nThe only hope for those, like the author, who would like to dismantle the successful Western economic model under the banner of environmentalism is — you guessed it — the most naive, impressionable and easily manipulated segment of society: School kids. Feed them a one-sided curriculum on climate change and the sins of capitalism, flatter them into believing that they — and their teachers — are morally superior to the parents who feed and support them, and encourage them to play hooky as a kind of feel-good, punishment-free form of civil disobedience and you may create a social climate in which “a great many young people are ready for this kind of deep change.”\n\nMany, perhaps. But probably not most. Kids — unlike rabid ideologues — have a way of growing up. If they didn’t, the human race would have destroyed itself a long time ago.\n\n• Aram Bakshian Jr., a former aide to Presidents Nixon, Ford and Reagan, has written widely on politics, history, gastronomy and the arts.\n\n• • •\n\nON FIRE: THE (BURNING) CASE FOR A GREEN NEW DEAL\n\nBy Naomi Klein\n\nSimon & Schuster, $27, 320 pages\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Like most radical ideologues, Ms. Klein sees \"climate change\" as a handy weapon in the struggle against their pet hate -- the free market democracies that have brought progress, prosperity, and a better life.", "authors": ["The Washington Times Http", "Aram Bakshian Jr."], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/24/SAXoPicture-06F15384-684939059_c0-0-878-511_s1770x1032.jpg?6d32a95e7b1635f0101061f3b85a16213b477a26", "published_at": "2019-09-24"}