{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/paloma-faith-channelled-inner-coronation-street-star-play-evil-bet-sykes-pennyworth-10956610", "downloaded_at": "2019-10-21 15:02:00.991992+00:00", "title": "Paloma Faith channelled inner Corrie star to play Bet in Pennyworth", "language": "en", "text": "Bet Sykes is like Vera Duckworth with a switchblade (Picture: Epix/ITV)\n\nPaloma Faith may be a popstar but even she can’t resist a night in front of the telly watching Corrie – and it turns out that came in super useful for her when landing a new role in Pennyworth.\n\nThe actress will turn menace in the Batman prequel to play gangster Bet Sykes, running into Thomas Wayne (Ben Aldridge) and Alfred Pennyworth (Jack Bannon) in 1950s London, years before they headed to Gotham city.\n\nWith a strong northern twang and a no messing mentality, her vicious character is essentially a much meaner Vera Duckworth, with a switchblade.\n\nWhen Metro.co.uk exclusively asked her if the iconic Corrie character provided some inspiration for her northern accent, Paloma burst out laughing and told us: ‘That’s what I did!’\n\n‘Someone’s sussed it!’ leading man Jack chimed in.\n\n‘Well I lived in Leeds for a while, and so the Corrie [accent] is quite true to life,’ Paloma explained.\n\nAdvertisement\n\nAdvertisement\n\n‘So I lived there and spent the whole time taking the p**s and copying the way they spoke, and it came good. It’s so satisfying!’\n\nBet is Paloma’s first on-screen acting role since a one-off part in PG Wodehouse series Blandings in 2013, as she focused on her successful music career.\n\nBut when she decided to return to the screen, the star wanted to shake off her bubbly persona for something a little more dramatic.\n\n‘The character I was given, I didn’t know she was a villain, I didn’t know she was a dark character,’ Paloma explained to us.\n\nPaloma’s northern twang appeared straight out of Corrie (Picture: Epix)\n\n‘I actually said to my agent, it was quite weird, that what I really wanted to do was the opposite to me as a popstar person. I wanted to be in Mike Leigh films, Ken Loach. Gritty, gritty stuff.’\n\n‘I sort of tried to play [Bet] like that. Doing it as if I was in an independent British film about depressing England,’ the star continued.\n\n‘It wasn’t really until I started shooting a few weeks before that I kind of realised that [Pennyworth] was a dramatic, hyper-real version of that.\n\nMore: Paloma Faith Paloma Faith is raising her child to be socially conscious: ‘God knows we need it' Batman spin-off series Pennyworth has a trailer and Gotham fans are in luck Paloma Faith 'threatened to kill neighbour's dog' while in character as Pennyworth killer\n\n‘I thought I got it because I was a great subtle actress, but then they were like “no, we picked you because you overact to everything!”,’ she laughed.\n\nAdvertisement\n\nAdvertisement\n\n‘I thought I was playing the downtrodden, highbrow roles!’\n\nPennyworth premieres in full on 25 October on StarzPlay via Amazon Prime Video.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Paul Dano ‘cast as The Riddler’ in The Batman after Jonah Hill talks ‘break down’\n\nMORE: Could The Batman be as dark as Joker?", "description": "Paloma Faith took inspiration from Corrie icons including Vera Duckworth to play Bet Sykes in Batman prequel, Pennyworth.", "authors": ["Tilly Pearce"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/palomafaith-vera-duckworth_1571669330.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-21"}