{"pub": "rt", "url": "https://rt.com/news/471662-russian-military-police-syria-turkey/ ", "downloaded_at": "2019-10-23 23:22:29.596023+00:00", "title": "WATCH Russian military police arrive in Manbij & Kobani after deal on Syrian-Turkey border (VIDEOS)", "language": "en", "text": "RT’s video agency Ruptly has captured the arrival of Russian military to the Syrian frontier town of Kobani. Another unit was filmed arriving to Manbij, a key town some 30 km from the border with Turkey in the Aleppo province.\n\nThe footage shows military police vehicles with Russian flags patrolling the streets of Manbij on Wednesday, following the agreement struck on Tuesday between Ankara and Moscow. The Russian forces first arrived in Manbij in mid-October alongside the Syrian Army to ensure the safety of the population after the area was abandoned by the US troops.\n\nMeanwhile, another video captured the arrival of Russian military police to the border town of Kobani. It also showed Russian officers talking to their Syrian counterparts upon arrival.\n\nThe deployment is carried out as part of the deal presidents Recep Tayyip Erdogan and Vladimir Putin reached in Sochi on Tuesday.\n\nUnder the agreement, Russian military police and Syrian border guards are assigned to facilitate the withdrawal of YPG forces 30km away from the border within 150 hours. That will be followed by joint Russian-Turkish patrols to the west and the east of the areas occupied as part of the Turkish ‘Operation Peace Spring.’\n\nAlso on rt.com ‘Taking legal action’: Iraq pleads with UN to kick unauthorized US forces out of country\n\nThink your friends would be interested? Share this story!", "description": "RT’s video agency Ruptly has captured the arrival of Russian military to the Syrian frontier town of Kobani. Another unit was filmed arriving to Manbij, a key town some 30 km from the border with Turkey in the Aleppo province.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5db08d802030277cd85d2105.png", "published_at": "2019-10-23"}