{"pub": "fox", "url": "https://foxnews.com/science/ancient-curse-of-the-dancer-deciphered-revealing-backstabbing-rivals", "downloaded_at": "2019-10-08 09:58:24.211862+00:00", "title": "Ancient 'curse of the dancer' deciphered, revealing backstabbing rivals", "language": "en", "text": "A Greek engraving on a 1,500-year-old lead tablet discovered in the ruins of an ancient theater in Israel has finally been deciphered, revealing a curse that may rival the modern-day backstabbing between athletic opponents.\n\nThe curse calls upon numerous demons to inflict harm on a dancer named Manna, who likely performed at the famous Caesarea Maritima theater in Israel, which was built by Herod the Great.\n\nThe fact that the tablet was found in the ruins of such a prestigious theater suggests that Manna \"must have been a famous artist and therefore the prize would have been considerable, not to mention the fame and reputation that were at stake,\" for the winner of a dance competition, wrote Attilio Mastrocinque, a professor of Roman history at the University of Verona, detailing his translation of the Greek curse in an article published in the book \"Studies in Honour of Roger S.O. Tomlin\" (Libros Pórtico, 2019)\n\nRelated: Cracking Codes: 5 Ancient Languages Yet to Be Deciphered\n\nAnd the person cursing Manna wasn't messing around: \"Tie the feet together, hinder the dance of Manna,\" the curse tablet, inscribed in Greek, reads, according to Mastrocinque's translation. \"Bind down the eyes, the hands, the feet, which should be slack for Manna when he will dance in the theatre…\"\n\nTo do this, the curse asks for the assistance of several gods including Thoth, an ancient Egyptian god of magic and wisdom. It also calls upon the \"demons of the sky, demons of the air, demons of the earth, underworld demons, demons of the sea, of the rivers, demons of the springs…\" to hurt Manna.\n\n\"Twist, darken, bind down, bind down together the eyes…\" of Manna the inscription says. \"He should move slowly and lose his equilibrium\" and \"he should be bent and unseemly…\"\n\nThe curse tablet was discovered by an Italian archaeological team sometime between 1949 and 1954, but the inscription was difficult to make out. It was only recently that Mastrocinque deciphered it, using a method called Reflectance Transformation Imaging (RTI). With RTI, a computer program creates numerous photographs of an artifact — taken from different lighting angles — to create an enhanced image.\n\nThe curse tablet dates to the sixth century, a time when the Byzantine Empire controlled the city.\n\nTaking that period into account, it's possible that Manna and the curse-writer were from warring factions. In the Byzantine Empire, people competing in dance or other competitions were sometimes part of rival factions — such as the \"blue\" and \"green\" factions — and the competition between these factions could be intense, sometimes even resulting in public riots, Mastrocinque wrote.\n\nWhatever the reason, the curse tablet is lengthy, containing 110 lines. While the Byzantine Empire used Christianity as its official religion, and Christianity didn't worship Thoth and other \"pagan\" gods often named in curse tablets, this didn't stop the use of curse tablets, Mastrocinque wrote, noting that if anything these tablets became longer and more detailed.\n\n\"This [curse tablet] along with many others issued in the late imperial period and in the early Middle Ages, confirms that the Christianization of the Roman Empire did not stop the maleficent magical arts… on the contrary, these increasingly spread and became more sophisticated,\" Mastrocinque wrote.\n\nThe tablet was given to the team by the Israeli government and it is now in the Archaeological Museum of Milan.\n\nOriginally published on Live Science.", "description": "A Greek engraving on a 1,500-year-old lead tablet discovered in the ruins of an ancient theater in Israel has finally been deciphered, revealing a curse that may rival the modern-day backstabbing between athletic opponents.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/curse-of-the-dancers.jpg", "published_at": "2019-10-07"}