{"pub": "fox", "url": "https://foxnews.com/us/florida-judge-temporarily-blocks-law-limiting-ex-convicts-right-to-vote-in-state", "downloaded_at": "2019-10-20 12:31:15.817930+00:00", "title": "Florida judge temporarily blocks law limiting ex-convicts' right to vote in state", "language": "en", "text": "A Florida judge on Friday temporarily blocked a new law that prevents ex-convicts from voting in the state until they have paid all of their fees, fines and restitution, according to a report.\n\nU.S. District Court Judge Robert Hinkle said the law, passed by the Republican-controlled legislature this year, could be unconstitutional, Central Florida's News 13 reported.\n\nFLORIDA’S FELONS FACE UNEXPECTED OBSTACLES BEFORE VOTING IN 2020\n\nFlorida “cannot deny restoration of a felon’s right to vote solely because the felon does not have the financial resources to pay the other financial obligations,” Hinkle ruled.\n\nThe judge added that Florida must establish a way for felons to register to vote if it’s determined they are “genuinely unable” to pay their fees and restitution, according to News 13.\n\nLast fall, Florida voters approved Amendment 4 that restores voting rights to some ex-convicts. Lawmakers said they were clarifying the amendment with the new law.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSecretary of State Laurel Lee and Republican Gov. Ron DeSantis had asked that the lawsuit brought by 17 complainants be thrown out.\n\nThe Florida State Conference of the NAACP, the Orange County Branch of the NAACP, and the League of Women Voters of Florida -- who are representing felons in the suit -- claim it is unconstitutional to condition voting rights on the payment of fees.\n\nThe case will head to the Florida Supreme Court, News 13 reported.", "description": "A Florida judge on Friday temporarily blocked a new law that prevents ex-convicts from voting in the state until they have paid all of their fees, fines and restitution, according to a report.", "authors": ["Brie Stimson"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/11/voting-booth.jpg", "published_at": "2019-10-20"}