{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-100-greatest-players-richie-mccaw-interview-best-japan-2019-a9113196.html", "downloaded_at": "2019-09-20 13:02:57.309806+00:00", "title": "Richie McCaw interview: A journey back through the career of the Rugby World Cup's greatest player", "language": "en", "text": "“Ah great,” says Richie McCaw. The former All Blacks captain has just been told that he has come out on top in a vote to decide the greatest player in the history of the Rugby World Cup. No theatrics, no hullaballoo, just another thing to take in his stride. “Good stuff,” he adds.\n\nBy all accounts it is just another day for Richie McCaw, the helicopter pilot. When we speak, McCaw is preparing for work just like any other day. In a month’s time, he will head to Japan for the Rugby World Cup, but for the first time in 20 years, it will be a tournament without him.\n\nThe discussion for once is not about the All Blacks, or who will win the World Cup. It is about him, because in our countdown of the top 100 players to have graced the Rugby World Cup, McCaw emerged as the greatest.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“It’s a bit different to four years ago, and the time before that,” McCaw tells The Independent. “But it’s quite nice to be able to think, sit back and look and go ‘wow that World Cup is pretty open’ and not have the nervousness of ‘have I got everything sorted?’ It’s nice to sit and actually watch and I’m looking forward to watching it because I think it’s quite wide open this one.”\n\nThey weren’t that wide open during McCaw’s time, at least during the second half of his career, that’s for sure. For more than two decades, the All Blacks failed to deliver on their potential as the best team on the planet, and incredibly the best they had to show across five World Cups was one single final appearance in the 1995 defeat.\n\nThis is the Richie McCaw story, told by the man himself.\n\nShape Created with Sketch. RWC100: 100-1 greatest players Show all 101 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. RWC100: 100-1 greatest players 1/101 Rugby World Cup greatest 100 player of all time Who is the greatest player to feature at the Rugby World Cup? It's a question that has been asked time and time again, and will continue to be asked as long as the sport continues, with the true greats of rugby union shining on the biggest platform when it matters most. Ahead of the 2019 Rugby World Cup in Japan, we asked out team of rugby experts to come up with the the top 100 players of the Rugby World Cup era, beginning with 1987 and running through to the 2015 tournament. Here's the definitive list that they came up with. Getty 2/101 100: Michael Leitch The Japan captain is preparing to lead the side into yet another World Cup, but he proved an inspiring figure in 2015 as his phenomenal work-rate set the example for those around him. He will forever be remembered as the man who lead the side that defeated the Springboks. Getty Images 3/101 99: Lewis Moody A member of the 2003 winning squad, Moody went on to feature on the 2007 run to the final before captaining the ill0fated 2011 campaign. However, with three tournaments under his belt and his sheer bravery in every one of his performances, he just squeezes onto the list. Getty Images 4/101 98: Ben Franks The two-time Rugby World Cup winner lined up in the same front-row as younger brother Owen to help the All Blacks to back-to-back world championships, before heading to Europe. Getty Images 5/101 97: Diego Dominguez A legend of the Italian game. Dominguez played at three consecutive World Cups between 1991 and 1999 and displayed a talent at fly-half that is yet to be displayed since. Getty Images 6/101 96: Toutai Kefu It takes something special to oust Willie Ofahengaue from the Australian No 8 shirt, but Kefu was able to do exactly that to play a pivotal role as the Wallabies' starting No 8 at the triumphant Rugby World Cup. Getty Images 7/101 95: Va'aiga Tuigamala 'Inga the winger' has the unusual accolade of playing at two Rugby World Cups for two different nations. He arrived on the scene with New Zealand in 1991, but it was his role in 1999 with Western Samoa that really caught the eye as he helped them defeat Wales. AFP/Getty Images 8/101 94: Sebastien Chabal A World Cup winner he is not, but Chabal provided one of the great moments in the tournament's history as he lead the confrontation to the Haka ahead of France's 2007 World Cup quarter-final victory over the All Blacks. AFP/Getty Images 9/101 93: Mamuka Gorgodze Probably no better example of a man who has carried a national team on his own shoulders. Gorgodze was famously named man of the match against New Zealand, and his reaction said all that you needed to know about what it means to him to play for Georgia. AFP/Getty Images 10/101 92: Mickey Skinner Who can forget 'The Tackle'? Mick 'The Munch' Skinner sent Marc Cecillon in reverse with one fo the great World Cup tackles during England's quarter-final victory at the 1991 tournament. Getty Images 11/101 91: Stephen Donald Not New Zealand's first choice, or second, or third, but the fourth-choice fly-half who wasn't even named in the All Blacks squad for the 2011 World Cup. Injuries meant he was drafted in for the final against France, where he wrote his name into the history books by kicking the final-winning penalty to end the All Blacks' 24 years of hurt. AFP/Getty Images 12/101 90: Takudza Ngwenya Bryan Habana was considered that fastest man at the World Cup - until Ngwenya turned up and completely roasted him on the outside. The United States may have gone on to lose the match, but the moment remains one of the 2007 tournament highlights. AFP/Getty Images 13/101 89: Thierry Lacroix Lacroix's international career never really took off until the 1999 World Cup when a scintillating 30-minute display paved the way for the All Blacks's dramatic exit. AFP/Getty Images 14/101 88: Karne Hesketh If this list was judged on moments alone, Hesketh would be No 1 on the list. The Japan wing finished one of the great tries to secure their first ever victory over the Springboks, a moment where everyone who was watching remembers exactly where they were at that moment in time. Getty Images 15/101 87: Andrew Sheridan Sheridan played in two World Cup, but is fondly remembered for the way he dismantled the Australian scrum in 2007 to form the basis for England's quarter-final victory. Getty Images 16/101 86: Josh Lewsey Lewsey was one-third of England's elite back-three at the 2003 World Cup, but his tournament highlight came in 2007 when he scored inside 80 seconds in the semi-final victory over France. Getty Images 17/101 85: Will Genia An Australian centurion who was first-choice scrum-half in both 2011 and 2015, where he claimed third and second-place finishes respectively. Will 2019 be the year he goes one better? Getty Images 18/101 84: Will Greenwood The centre enjoyed a phenomenal World Cup try-scoring record of seven in nine matches across 1999 and 2003, going on to help England triumph Down Under. Getty Images 19/101 83: Gavin Hastings Arguably Scotland's greatest ever player, who featured across three World Cups - the final one in 1995 as captain - before hanging up his boots after their quarter-final defeat against the Springboks. Getty Images 20/101 82: David Pocock The main reason that Australia made it to the 2015 Rugby World Cup final, Pocock starred playing out of position in a partnership with Michael Hooper that has strongly influenced the 2019 tournament as other teams follow suit. Getty Images 21/101 81: Tendai Mtawarira Despite his nickname of 'The Beast', Tendai Mtawarira is possibly one of the most understated greats of the game. Fans love him and for good reason, having helped South Africa to third place in 2015. Getty Images 22/101 80: Israel Dagg A double-World Cup winner who made the full-back berth his own as the All Blacks cemented their dominance at the top of world rugby. Getty Images 23/101 79: Wayne Shelford One of the greats from the originals, Shelford played in six of seven games as the All Blacks won the 1987 Rugby World Cup. Remembered as the man who revitalised the Haka, his legacy in the sport will go on long after he is gone. Getty Images 24/101 78: Jeremy Guscott Guscott featured in three World Cup campaigns, the first two of which produced a final and semi-final appearance. He could have added to that record had injury not ended his 1999 campaign, where an England side without him crashed out. Getty Images 25/101 77: Serge Betsen A formidable opponent who was highly respected by his opponents, such was his talent. However, he features low on the list due to featuring at just one World Cup due to injury. AFP/Getty Images 26/101 76: Brian Lima 'The Chiropractor' by name, Brian Lima was a World Cup force to be reckoned with - just ask Derick Hougaard. The centre became the first player ever to appear at five Rugby World Cups, starring at the 1991, 1995, 1999, 2003 and 2007 tournaments, and was inducted into the Hall of Fame four years later. AFP/Getty Images 27/101 75: Tony Daly The Australian was a key part of the victorious 1991 Wallabies side and also featured at the 1995 campaign. Getty Images 28/101 74: Alun Wyn Jones The veteran lock will feature at his fourth World Cup in Japan since his first appearance in 2007, and was a key part of Wales's run to the semi-finals in 2011. Getty 29/101 73: Brad Thorn The lock was a linchpin in the 2011 Rugby World Cup-winning New Zealand side, starting all but one of the games including the final against France, and he also played at the 2003 event eight years before, though missed out on the 2007 tournament. Getty Images 30/101 72: Jannie de Beer Killed off England's hopes in 1999 with his memorable five drop-goals in the quarter-final, writing his name into World Cup folklore. Getty Images 31/101 71: Fourie du Preez The scrum-half was South Africa's starting No 9 for three World Cup in a row, an was instrumental in their kick-heavy strategy at the 2007 World Cup that saw the Springboks defeat England in the final. Getty Images 32/101 70: Mils Muliaina The 100-cap full-back was a mainstay of the All Blacks side tat went through the toil of the 2003 and 2007 World Cups, only to secure a fitting farewell by winning the 2011 tournament. A lethal finisher who also had the defensive craft to match, Muliaina was the standout No 15 for much of the noughties. Getty Images 33/101 69: Thierry Dusautoir Inspired France's 2011 campaign when the players took control from coach Marc Lievremont and played the style of rugby they wanted to play. Dusautoir always led by example as one of the best No 7s to play the game. Getty Images 34/101 68: Owen Franks A two-time World Cup winner who proved pivotal to the All Blacks' back-to-back triumphs. Franks changed the game with how tighthead props play, and was unlucky to miss out on a third tournament after being overlooked for 2019. Getty Images 35/101 67: Mike Tindall His brutal dump tackle on George Gregan in the 2003 final showed all the hallmarks of England's defiance in that campaign. Unlucky to miss the 2007 tournament with a broken leg, and although the less said about 2011 the better, his exploits in Australia eight years before cement his place on the list. Getty Images 36/101 66: Keven Mealamu Another member of the All Blacks' double-World Cup winners club, Mealamu was heralded for his performance off the bench in the 2015 final. Getty Images 37/101 65: Glen Osbourne Osborne's best displays of his career came at the Rugby World Cup, scoring five tries in six games across 1995 and 199. Getty Images 38/101 64: Rory Underwood Underwood starred for England at the first three World Cups, with the nation's all-time record try-scorer claiming 11 World Cup tries throughout his illustrious career. Getty Images 39/101 63: Josh Kronfeld One of the great back-row forwards of his generation, Kronfeld went through the agony of twice seeing New Zealand's World Cup aspirations fall short in 1995 and 1999, though it was through no lack of trying on his part. Getty Images 40/101 62: Brian O'Driscoll The lack of Irish players can easily be put down to their dismal knockout record, but O'Driscoll simply has to be on the list for his exploits across the 2003 and 2011 World Cups. For a player of his talent, his World Cup record is no doubt disappointing, but he remained a joy to watch. Getty Images 41/101 61: Willie Ofahengaue 'Willie O' was a giant of the game who helped the Wallabies to World Cup glory in 1991, leading the pack from No 8 with distinction. He retired with the rare accolade of having beaten the All Blacks more times than losing to them. Getty Images 42/101 60: Dan Crowley Crowley (far right) is one of just five Australians to have won the Rugby World Cup twice, and started the 1999 final against France before hanging up his international boots. AFP/Getty Images 43/101 59: Emile Ntamack A three-time World Cup attendee, Ntamack's versatility came in great use for the French on their run to the 1999 final, where he started at centre despite spending most of his international career in the back-three. Getty Images 44/101 58: Shane Williams One of the most lethal finishers in the game's history, Williams enjoyed a breakthrough tournament in 2003, starring against New Zealand and England, and picked up where he left off in 2007 with a stunning try over Fiji. Getty Images 45/101 57: Daniel Herbert The other part of the famous Australian centre partnership with Tim Horan, Herbert was a star of the 1999 Rugby World Cup, having also featured at the 1995. Getty Images 46/101 56: Nick Farr-Jones The skipper of the 1991 World Cup winners, Farr-Jones demonstrated phenomenal strength and passing even for a scrum-half, while his leadership skills saw the Wallabies become the dominant force of the era. AFP/Getty Images 47/101 55: Jason Leonard Mr Dependable when it came to his World Cup exploits, playing for England in 1991, 1995, 1999 and 2003 when he finally became a much-deserved World Cup-winner. Getty Images 48/101 54: Sonny Bill Williams A two-time wrecking ball of a World Cup winner, Williams' ability to offload in contact is matched by no other. However, he stole the show in 2015 when he gave his winners' medal to a young fan who ran onto the pitch to hug him. One of the good guys of the sport. Getty Images 49/101 53: Ben Kay Had he finished that try in the 2003 World Cup final, he would've been a lot higher in the list. But perhaps he can take credit for producing that thrilling extra-time final in Melbourne. Either way, he formed a formidable partnership with Leicester teammate Martin Johnson. Getty Images 50/101 52: Neil Back Part of the famous English back-row os 2003, Back had a unique ability to play openside flanker his way, while he was never short of a trick or two to help his side out. Getty Images 51/101 51: Abdelatif Benazzi Hugely influential in helping France to the 1999 World Cup final, in what was his third appearance at the global gathering. A towering lock who never failed to let his presence be known. AFP/Getty Images 52/101 50: Andrew Merhtens Came within a whisker of becoming a World Cup winner in 1995, only for the Springboks and Joel Stransky to deny him. Sadly his World Cup career ended in 1999 as he was overlooked for the 2003 tournament, but by then he had already left a solid impression on the sport. Getty Images 53/101 49: Rupeni Caucaunibuca Arguably the most eye-catching player in World Cup history, Caucau took the 2003 tournament by storm with three devastating tries in two games. Had he had more discipline, we may have seen even more from him at other tournaments, but his 2003 showcase is enough to leave a lasting memory in itself. Getty Images 54/101 48: Phil Vickery A World Cup winner in 2003, Vickery emerged as the somewhat surprising man to captain England to the 2007 World Cup, where an unexpected resurrection saw them come within a whisker of retaining the Webb Ellis Cup. Arguably England's best tighthead prop. Getty Images 55/101 47: Sam Warburton Thrown in at the deep end as Wales captain in 2011, Warburton was one of the stars of the tournament as they reached the semi-finals - only for his red card against France seeing the wheels fall off. That said, he lead the team fantastically once again in 2015 as they knocked England out in the pool stage, and remains one of the most pleasant individuals to have played the game. Getty Images 56/101 46: Joe Roff Selected for the 1995 World Cup at just 19 years old, Roff made an impressive start to his international career before starring at the successful 1999 edition. Roff made a third World Cup in 2003, though had to make do with a role as a replacement for the latter stages. Getty Images 57/101 45: Tony Woodcock One of the more unheralded All Blacks of the double-World Cup triumph, but with 118 caps to his name Woodcock's worth to New Zealand cannot be done justice. One of the great loosehead props of all time. Getty Images 58/101 44: Juan Martin Hernandez A magician with the ball in his hands of one the end of his boot, Hernandez it up the 2007 World Cup as Argentina announced their arrival as a force to be reckoned with. A member of the four World Cups club, Hernandez remains one of the most exciting and attacking-minded players to have graced the game. AFP/Getty Images 59/101 43: Matt Burke The Australian full-back was instrumental in the 1999 World Cup victory, with his ability to kick goals for fun proving a key weapon in the Wallabies armoury. He also helped Australia to the 2003 final, though lost his place in the 15 shirt to Chris Latham by that point. Getty Images 60/101 42: Ayumu Gorumaru The man who pulled the strings in the 'Miracle of Brighton', Goromaru scored a brilliant 24 points to inspire the victory over the Springboks in what was a very successful campaign for the fly-half in 2015. Getty Images 61/101 41: Matt Giteau A genius with the ball who filled no fewer than five positions during his career with the Wallabies. Giteau was just 20 when he made his World Cup debut in 2003, but such was his worth to Australian rugby, the ARU changed the rules to bring him back for a fourth World Cup in 2015. Getty Images 62/101 40: Phil Kearns Known for his fiery character and physical approach, Kearns was hugely influential not just in 1991 but in 1999 too. Even though injury curtailed his third World Cup campaign, Kearns was a key figure in helping the Wallabies win the World Cup for the second time. Getty Images 63/101 39: George Smith Smith never won the World Cup, making his Wallabies debut after the 1999 triumph, but there are few players who deserved to do so. He changed the game for openside flankers, and the respect he earned from back-row opponents stemmed from what a formidable force he was to compete against. Getty Images 64/101 38: Ruben Kruger Scored the try in the controversial 1995 semi-final that kept the Springboks on course for glory. Sadly, Kruger passed away at the start of the decade after a 10-year battle with brain cancer. AFP/Getty Images 65/101 37: Sam Whitelock Incredibly, Whitelock could become one of three players who win the World Cup for a third consecutive time this tournament alongside Kieran Read and Sonny Bill Williams, and he is young enough to have a crack at 2023 too. Whitelock is sometimes overshadowed by his younger teammate Brodie Retallick, but what he has given the All Blacks should not be underestimated. Getty Images 66/101 36: Jerome Kaino One of the most powerful and physically-dominating blindside flankers the game has seen, Kaino brought a ferocious intensity to the game that helped him to World Cup wins in 2011 and 2015. Getty Images 67/101 35: Percy Montgomery South Africa's goal-kicking full-back of the 2007 World Cup triumph, Montgomery was one of the best all-round players of his time - represented by the fact he finished his career with 102 caps to his name. Getty Images 68/101 34: Jason Little The other part of the Australian centre pairing that dominated the 1990s, Little often competed with Daniel Herbert to partner Tim Horan. Getty Images 69/101 33: Bakkies Botha A Goliath on the pitch and not someone you wanted to run into, Botha formed a formidable partnership with Victor Matfield as South Africa won the 2007 World Cup. His lineout presence was intimidating enough before he'd even left the ground, while he wasn't half-bad at carrying either. Getty Images 70/101 32: Christophe Lamaison His performance against New Zealand in 1999 semi-finals remains one of the great individual displays in World Cup history. Lamaison was stereotypical of what French rugby is about: gifted athleticism, natural ability and a flare that was delightful to watch. His impact on Kiwi rugby remains to this day. AFP/Getty Images 71/101 31: Lawrence Dallaglio One of the players who learned from the errors of 1999 to dazzle in 2003. Remembered for making the break that set-up Jason Robinson's try in the World Cup final, but contributed so much more to England's campaign. Getty Images 72/101 30: Schalk Burger If Bakkies Botha wasn't bad enough, South Africa also possessed the mean Schalk Burger in their pack that inflicted plenty of punishment in opponents. Not always on the right side of the law, Burger remains one of the most combative flankers seen in the game, relying on his brute strength and athletic ability to wreak havoc at the breakdown. Getty Images 73/101 29: Joel Stransky Kicked all 15 points in South Africa's triumphant 1995 World Cup final effort, with his extra-time drop-goal going down in history as one of the epic World Cup moments. Getty Images 74/101 28: Conrad Smith One half of New Zealand's almighty centre pairing that proved pivotal in the 2011 and 2015 triumphs. Smith was never the most exciting or most dangerous player on the field, but he was the glue that held the back line together and without him, the All Blacks would not be what they are today. Getty Images 75/101 27: John Smit South Africa's 2007 World Cup-winning captain made the brave decision to convert from a prop to a hooker and reaped the rewards by leading his country to glory. Lead by example as he never shied away from battle on the pitch, but a gentleman off it. Getty Images 76/101 26: Victor Matfield His experience, leadership and calmness under pressure were big factors in South Africa's success over the decade he featured in. Came out of retirement for one last crack in 2015, though his best days were behind him by then. Getty Images 77/101 25: Richard Hill Played just three matches at the 2003 Rugby World Cup, but so important was he to England's hopes that Sir Clive Woodward was happy to carry him through the tournament knowing how much they needed him in the final. However, it was his semi-final return from injury that really stood out, keeping England's World Cup hopes alive against Wales. Getty Images 78/101 24: Zinzan Brooke One of the most gifted players in history. A No 8 with the carrying ability of a tight-forward and the passing and kicking skills of an out-half. A World Cup winner who spent a decade at the top of the game. Getty Images 79/101 23: Ma'a Nonu The other half of New Zealand's unrivalled centre pairing, Nonu overcame early struggles in his international career to become a force to be reckoned with. He provided one of the moments of the 2015 World Cup when he scored from nearly halfway in the final against Australia. Getty Images 80/101 22: Serge Blanco An enigma on the field who played with panache that befitted French rugby at the time. The full-back starred at the 1987 World Cup where France just came up short in the final, and hung up his boots after one last crack at it in 1991. AFP/Getty Images 81/101 21: Kieran Read The man who emerged from the shadow of Richie McCaw to lead the All Blacks, Read was a key figure in the 2011 and 2015 World Cup efforts. Getty Images 82/101 20: Os du Randt The only Springbok to win the 1995 and 2007 World Cup, Du Randt displayed a longevity rarely seen in the modern-day game. For years he was the first pick in any World XV side, and his importance to Springbok history cannot be understated. AFP/Getty Images 83/101 19: Stephen Larkham Larkham formed a dominant partnership with George Gregan in 1999 to lead the Wallabies to victory with his brilliant vision and ability to read the game to create opportunity after opportunity for his teammates. Moved to centre for the 2003 World Cup, displaying his versatility at the highest level, and unlucky not to end his career as a two-time World Cup winner. Getty Images 84/101 18: Francois Pienaar Would be the lead candidate to captain many all-time XVs, given his importance to not just the Springboks but to South Africa as a whole. What he achieved with Nelson Mandela in 1995 is unlikely to be repeated. AFP/Getty Images 85/101 17: Chester Williams Where Pienaar was the leader, the late Chester Williams was the inspiration. His presence single-handedly brought millions of black South Africans to support the Springboks, and his four tries in the quarter-final victory over Samoa showed just how important he was to that team. His sad death earlier this month - and the outpouring of emotion that followed - only went to strengthen how important he has been to South Africa changing its ways. Getty Images 86/101 16: George Gregan Without doubt a genius of the game. Gregan had craft, vision and intelligence that saw him grow into one of the best Australian captains of all time, having learned his trade under John Eales in the 1999 World Cup before leading the Wallabies to the 2003 final where they just fell short. Getty Images 87/101 15: Jason Robinson The raw emotion of his try in the 2003 final is hard to rival for English supporters as the great moments in World Cup history. Arguably brought something to the game that had never been seen before, and his sheer defiance to go again in 2007 - dislocated shoulder and all - can only be applauded. Getty Images 88/101 14: John Kirwan The outside backs start to come thick and fast at the top end of the list. Kirwan was very much the original World Cup finisher, with his breath-taking try in the 1987 World Cup opener going down in history as one of the most stunning tries ever seen. AFP/Getty Images 89/101 13: David Campese 'Campo' was never shy when it came to having a thing or two to say, but he got away with it because of what he could do on the pitch. The trademark goosestep inspired a new generation of wings as he took agility to a new level, and his ability to score almost at will was crucial to Australia's 1991 success. Getty Images 90/101 12: Michael Lynagh The brains behind the brawn, Lynagh could do just about anything with the ball in his hands. He marshalled the 1991 side with complete authority and was not too bad at scoring himself. Getty Images 91/101 11: Joost van der Westhuizen A joy to watch throughout his career as he starred at three World Cups, including the 1995 success on home soil. His ability to be nimble around the ruck caught out countless opponents, while he possessed a rocket of a pass too. Getty Images 92/101 10: Tim Horan One of the all-time great Wallabies who shone in 1991 and 1999. The double-World Cup winner is arguably the greatest centre of all time. Getty Images 93/101 9: Bryan Habana \"Habana! Habana!\" How many times did you hear his name ring out across the four World Cups that he featured in? 15 to be exact, as he remains the highest try-scorer in World Cup history alongside Jonah Lomu, and one of just three men to score eight in a tournament alongside Lomu and Julian Savea. Getty Images 94/101 8: Martin Johnson The ultimate leader on the field, Johnson was inspirational in the 2003 World Cup triumph for England. Things didn't go the way he hoped when he returned in 2011 as head coach, but the way that he lead his country eight years previous remains one of the most inspiring campaigns around. AFP/Getty Images 95/101 7: Michael Jones Almost single-handedly won the All Blacks the inaugural World Cup, and all while refusing to play on Sunday's due to his religious faith. Jones was unstoppable at times during that 1987 campaign, and thankfully returned to the side for the Saturday World Cup final to seize his crowning glory. Getty Images 96/101 6: John Eales It takes something special to be nicknamed 'Nobody', because 'Nobody's Perfect'. But Eales really was a player of the ilk we have not seen since: formidable in all aspects of the game, a natural leader and a goal-kicking forward. There may never be another player like him. AFP/Getty Images 97/101 5: Sean Fitzpatrick A rookie in 1987, Fitzpatrick immediately found his feet on the international stage to play a big role in New Zealand's World Cup triumph. He soon inherited the captaincy, and although further success alluded his teams, his influence on the game could not be questioned. AFP/Getty Images 98/101 4. Jonny Wilkinson The man responsible for the greatest moment in English rugby history, Wilkinson was simply incredible in 2003. Yet the way that he battled career-threatening injuries to return for the 2007 campaign - and come within a whisker of winning another World Cup - and also rack up a fourth appearance in 2011, adds far more worth to his World Cup greatness. AFP/Getty Images 99/101 3: Jonah Lomu There is no other player who has transcended the sport quite like Jonah Lomu. Non-rugby fans know who he is, those who followed the game enjoyed every second of his career and those who faced him genuinely feared what he could do. Lomu not only changed the way that wings played, but he changed the way the game was played as no one had ever seen someone - or something - quite like him. He is sadly gone, but will never be forgotten. Getty Images 100/101 2: Dan Carter The agony of missing the 2011 knockout stages were eradicated by his virtuoso performance in the 2015 World Cup final, with his snap drop-goal providing the moment that killed off the Wallabies once and for all. Having featured at four World Cups during his career, Carter remains the highest points-scorer in World Cup history. Getty Images 101/101 1: Richie McCaw Can a two-time World Cup-winning captain not be top of the list. Not according to us. McCaw was, simply put, brilliant. A breakdown master, incredible athlete, inspirational leader and a man with a remarkable ability to talk referees onto his side, McCaw had everything. And perhaps what makes the fact that he goes down in our list as the greatest to have played the game is the fact that he was so normal off the field. As Steve Hansen put in in 2015 upon his farewell appearance, he's \"just a decent bloke\". Getty Images 1/101 Rugby World Cup greatest 100 player of all time Who is the greatest player to feature at the Rugby World Cup? It's a question that has been asked time and time again, and will continue to be asked as long as the sport continues, with the true greats of rugby union shining on the biggest platform when it matters most. Ahead of the 2019 Rugby World Cup in Japan, we asked out team of rugby experts to come up with the the top 100 players of the Rugby World Cup era, beginning with 1987 and running through to the 2015 tournament. Here's the definitive list that they came up with. Getty 2/101 100: Michael Leitch The Japan captain is preparing to lead the side into yet another World Cup, but he proved an inspiring figure in 2015 as his phenomenal work-rate set the example for those around him. He will forever be remembered as the man who lead the side that defeated the Springboks. Getty Images 3/101 99: Lewis Moody A member of the 2003 winning squad, Moody went on to feature on the 2007 run to the final before captaining the ill0fated 2011 campaign. However, with three tournaments under his belt and his sheer bravery in every one of his performances, he just squeezes onto the list. Getty Images 4/101 98: Ben Franks The two-time Rugby World Cup winner lined up in the same front-row as younger brother Owen to help the All Blacks to back-to-back world championships, before heading to Europe. Getty Images 5/101 97: Diego Dominguez A legend of the Italian game. Dominguez played at three consecutive World Cups between 1991 and 1999 and displayed a talent at fly-half that is yet to be displayed since. Getty Images 6/101 96: Toutai Kefu It takes something special to oust Willie Ofahengaue from the Australian No 8 shirt, but Kefu was able to do exactly that to play a pivotal role as the Wallabies' starting No 8 at the triumphant Rugby World Cup. Getty Images 7/101 95: Va'aiga Tuigamala 'Inga the winger' has the unusual accolade of playing at two Rugby World Cups for two different nations. He arrived on the scene with New Zealand in 1991, but it was his role in 1999 with Western Samoa that really caught the eye as he helped them defeat Wales. AFP/Getty Images 8/101 94: Sebastien Chabal A World Cup winner he is not, but Chabal provided one of the great moments in the tournament's history as he lead the confrontation to the Haka ahead of France's 2007 World Cup quarter-final victory over the All Blacks. AFP/Getty Images 9/101 93: Mamuka Gorgodze Probably no better example of a man who has carried a national team on his own shoulders. Gorgodze was famously named man of the match against New Zealand, and his reaction said all that you needed to know about what it means to him to play for Georgia. AFP/Getty Images 10/101 92: Mickey Skinner Who can forget 'The Tackle'? Mick 'The Munch' Skinner sent Marc Cecillon in reverse with one fo the great World Cup tackles during England's quarter-final victory at the 1991 tournament. Getty Images 11/101 91: Stephen Donald Not New Zealand's first choice, or second, or third, but the fourth-choice fly-half who wasn't even named in the All Blacks squad for the 2011 World Cup. Injuries meant he was drafted in for the final against France, where he wrote his name into the history books by kicking the final-winning penalty to end the All Blacks' 24 years of hurt. AFP/Getty Images 12/101 90: Takudza Ngwenya Bryan Habana was considered that fastest man at the World Cup - until Ngwenya turned up and completely roasted him on the outside. The United States may have gone on to lose the match, but the moment remains one of the 2007 tournament highlights. AFP/Getty Images 13/101 89: Thierry Lacroix Lacroix's international career never really took off until the 1999 World Cup when a scintillating 30-minute display paved the way for the All Blacks's dramatic exit. AFP/Getty Images 14/101 88: Karne Hesketh If this list was judged on moments alone, Hesketh would be No 1 on the list. The Japan wing finished one of the great tries to secure their first ever victory over the Springboks, a moment where everyone who was watching remembers exactly where they were at that moment in time. Getty Images 15/101 87: Andrew Sheridan Sheridan played in two World Cup, but is fondly remembered for the way he dismantled the Australian scrum in 2007 to form the basis for England's quarter-final victory. Getty Images 16/101 86: Josh Lewsey Lewsey was one-third of England's elite back-three at the 2003 World Cup, but his tournament highlight came in 2007 when he scored inside 80 seconds in the semi-final victory over France. Getty Images 17/101 85: Will Genia An Australian centurion who was first-choice scrum-half in both 2011 and 2015, where he claimed third and second-place finishes respectively. Will 2019 be the year he goes one better? Getty Images 18/101 84: Will Greenwood The centre enjoyed a phenomenal World Cup try-scoring record of seven in nine matches across 1999 and 2003, going on to help England triumph Down Under. Getty Images 19/101 83: Gavin Hastings Arguably Scotland's greatest ever player, who featured across three World Cups - the final one in 1995 as captain - before hanging up his boots after their quarter-final defeat against the Springboks. Getty Images 20/101 82: David Pocock The main reason that Australia made it to the 2015 Rugby World Cup final, Pocock starred playing out of position in a partnership with Michael Hooper that has strongly influenced the 2019 tournament as other teams follow suit. Getty Images 21/101 81: Tendai Mtawarira Despite his nickname of 'The Beast', Tendai Mtawarira is possibly one of the most understated greats of the game. Fans love him and for good reason, having helped South Africa to third place in 2015. Getty Images 22/101 80: Israel Dagg A double-World Cup winner who made the full-back berth his own as the All Blacks cemented their dominance at the top of world rugby. Getty Images 23/101 79: Wayne Shelford One of the greats from the originals, Shelford played in six of seven games as the All Blacks won the 1987 Rugby World Cup. Remembered as the man who revitalised the Haka, his legacy in the sport will go on long after he is gone. Getty Images 24/101 78: Jeremy Guscott Guscott featured in three World Cup campaigns, the first two of which produced a final and semi-final appearance. He could have added to that record had injury not ended his 1999 campaign, where an England side without him crashed out. Getty Images 25/101 77: Serge Betsen A formidable opponent who was highly respected by his opponents, such was his talent. However, he features low on the list due to featuring at just one World Cup due to injury. AFP/Getty Images 26/101 76: Brian Lima 'The Chiropractor' by name, Brian Lima was a World Cup force to be reckoned with - just ask Derick Hougaard. The centre became the first player ever to appear at five Rugby World Cups, starring at the 1991, 1995, 1999, 2003 and 2007 tournaments, and was inducted into the Hall of Fame four years later. AFP/Getty Images 27/101 75: Tony Daly The Australian was a key part of the victorious 1991 Wallabies side and also featured at the 1995 campaign. Getty Images 28/101 74: Alun Wyn Jones The veteran lock will feature at his fourth World Cup in Japan since his first appearance in 2007, and was a key part of Wales's run to the semi-finals in 2011. Getty 29/101 73: Brad Thorn The lock was a linchpin in the 2011 Rugby World Cup-winning New Zealand side, starting all but one of the games including the final against France, and he also played at the 2003 event eight years before, though missed out on the 2007 tournament. Getty Images 30/101 72: Jannie de Beer Killed off England's hopes in 1999 with his memorable five drop-goals in the quarter-final, writing his name into World Cup folklore. Getty Images 31/101 71: Fourie du Preez The scrum-half was South Africa's starting No 9 for three World Cup in a row, an was instrumental in their kick-heavy strategy at the 2007 World Cup that saw the Springboks defeat England in the final. Getty Images 32/101 70: Mils Muliaina The 100-cap full-back was a mainstay of the All Blacks side tat went through the toil of the 2003 and 2007 World Cups, only to secure a fitting farewell by winning the 2011 tournament. A lethal finisher who also had the defensive craft to match, Muliaina was the standout No 15 for much of the noughties. Getty Images 33/101 69: Thierry Dusautoir Inspired France's 2011 campaign when the players took control from coach Marc Lievremont and played the style of rugby they wanted to play. Dusautoir always led by example as one of the best No 7s to play the game. Getty Images 34/101 68: Owen Franks A two-time World Cup winner who proved pivotal to the All Blacks' back-to-back triumphs. Franks changed the game with how tighthead props play, and was unlucky to miss out on a third tournament after being overlooked for 2019. Getty Images 35/101 67: Mike Tindall His brutal dump tackle on George Gregan in the 2003 final showed all the hallmarks of England's defiance in that campaign. Unlucky to miss the 2007 tournament with a broken leg, and although the less said about 2011 the better, his exploits in Australia eight years before cement his place on the list. Getty Images 36/101 66: Keven Mealamu Another member of the All Blacks' double-World Cup winners club, Mealamu was heralded for his performance off the bench in the 2015 final. Getty Images 37/101 65: Glen Osbourne Osborne's best displays of his career came at the Rugby World Cup, scoring five tries in six games across 1995 and 199. Getty Images 38/101 64: Rory Underwood Underwood starred for England at the first three World Cups, with the nation's all-time record try-scorer claiming 11 World Cup tries throughout his illustrious career. Getty Images 39/101 63: Josh Kronfeld One of the great back-row forwards of his generation, Kronfeld went through the agony of twice seeing New Zealand's World Cup aspirations fall short in 1995 and 1999, though it was through no lack of trying on his part. Getty Images 40/101 62: Brian O'Driscoll The lack of Irish players can easily be put down to their dismal knockout record, but O'Driscoll simply has to be on the list for his exploits across the 2003 and 2011 World Cups. For a player of his talent, his World Cup record is no doubt disappointing, but he remained a joy to watch. Getty Images 41/101 61: Willie Ofahengaue 'Willie O' was a giant of the game who helped the Wallabies to World Cup glory in 1991, leading the pack from No 8 with distinction. He retired with the rare accolade of having beaten the All Blacks more times than losing to them. Getty Images 42/101 60: Dan Crowley Crowley (far right) is one of just five Australians to have won the Rugby World Cup twice, and started the 1999 final against France before hanging up his international boots. AFP/Getty Images 43/101 59: Emile Ntamack A three-time World Cup attendee, Ntamack's versatility came in great use for the French on their run to the 1999 final, where he started at centre despite spending most of his international career in the back-three. Getty Images 44/101 58: Shane Williams One of the most lethal finishers in the game's history, Williams enjoyed a breakthrough tournament in 2003, starring against New Zealand and England, and picked up where he left off in 2007 with a stunning try over Fiji. Getty Images 45/101 57: Daniel Herbert The other part of the famous Australian centre partnership with Tim Horan, Herbert was a star of the 1999 Rugby World Cup, having also featured at the 1995. Getty Images 46/101 56: Nick Farr-Jones The skipper of the 1991 World Cup winners, Farr-Jones demonstrated phenomenal strength and passing even for a scrum-half, while his leadership skills saw the Wallabies become the dominant force of the era. AFP/Getty Images 47/101 55: Jason Leonard Mr Dependable when it came to his World Cup exploits, playing for England in 1991, 1995, 1999 and 2003 when he finally became a much-deserved World Cup-winner. Getty Images 48/101 54: Sonny Bill Williams A two-time wrecking ball of a World Cup winner, Williams' ability to offload in contact is matched by no other. However, he stole the show in 2015 when he gave his winners' medal to a young fan who ran onto the pitch to hug him. One of the good guys of the sport. Getty Images 49/101 53: Ben Kay Had he finished that try in the 2003 World Cup final, he would've been a lot higher in the list. But perhaps he can take credit for producing that thrilling extra-time final in Melbourne. Either way, he formed a formidable partnership with Leicester teammate Martin Johnson. Getty Images 50/101 52: Neil Back Part of the famous English back-row os 2003, Back had a unique ability to play openside flanker his way, while he was never short of a trick or two to help his side out. Getty Images 51/101 51: Abdelatif Benazzi Hugely influential in helping France to the 1999 World Cup final, in what was his third appearance at the global gathering. A towering lock who never failed to let his presence be known. AFP/Getty Images 52/101 50: Andrew Merhtens Came within a whisker of becoming a World Cup winner in 1995, only for the Springboks and Joel Stransky to deny him. Sadly his World Cup career ended in 1999 as he was overlooked for the 2003 tournament, but by then he had already left a solid impression on the sport. Getty Images 53/101 49: Rupeni Caucaunibuca Arguably the most eye-catching player in World Cup history, Caucau took the 2003 tournament by storm with three devastating tries in two games. Had he had more discipline, we may have seen even more from him at other tournaments, but his 2003 showcase is enough to leave a lasting memory in itself. Getty Images 54/101 48: Phil Vickery A World Cup winner in 2003, Vickery emerged as the somewhat surprising man to captain England to the 2007 World Cup, where an unexpected resurrection saw them come within a whisker of retaining the Webb Ellis Cup. Arguably England's best tighthead prop. Getty Images 55/101 47: Sam Warburton Thrown in at the deep end as Wales captain in 2011, Warburton was one of the stars of the tournament as they reached the semi-finals - only for his red card against France seeing the wheels fall off. That said, he lead the team fantastically once again in 2015 as they knocked England out in the pool stage, and remains one of the most pleasant individuals to have played the game. Getty Images 56/101 46: Joe Roff Selected for the 1995 World Cup at just 19 years old, Roff made an impressive start to his international career before starring at the successful 1999 edition. Roff made a third World Cup in 2003, though had to make do with a role as a replacement for the latter stages. Getty Images 57/101 45: Tony Woodcock One of the more unheralded All Blacks of the double-World Cup triumph, but with 118 caps to his name Woodcock's worth to New Zealand cannot be done justice. One of the great loosehead props of all time. Getty Images 58/101 44: Juan Martin Hernandez A magician with the ball in his hands of one the end of his boot, Hernandez it up the 2007 World Cup as Argentina announced their arrival as a force to be reckoned with. A member of the four World Cups club, Hernandez remains one of the most exciting and attacking-minded players to have graced the game. AFP/Getty Images 59/101 43: Matt Burke The Australian full-back was instrumental in the 1999 World Cup victory, with his ability to kick goals for fun proving a key weapon in the Wallabies armoury. He also helped Australia to the 2003 final, though lost his place in the 15 shirt to Chris Latham by that point. Getty Images 60/101 42: Ayumu Gorumaru The man who pulled the strings in the 'Miracle of Brighton', Goromaru scored a brilliant 24 points to inspire the victory over the Springboks in what was a very successful campaign for the fly-half in 2015. Getty Images 61/101 41: Matt Giteau A genius with the ball who filled no fewer than five positions during his career with the Wallabies. Giteau was just 20 when he made his World Cup debut in 2003, but such was his worth to Australian rugby, the ARU changed the rules to bring him back for a fourth World Cup in 2015. Getty Images 62/101 40: Phil Kearns Known for his fiery character and physical approach, Kearns was hugely influential not just in 1991 but in 1999 too. Even though injury curtailed his third World Cup campaign, Kearns was a key figure in helping the Wallabies win the World Cup for the second time. Getty Images 63/101 39: George Smith Smith never won the World Cup, making his Wallabies debut after the 1999 triumph, but there are few players who deserved to do so. He changed the game for openside flankers, and the respect he earned from back-row opponents stemmed from what a formidable force he was to compete against. Getty Images 64/101 38: Ruben Kruger Scored the try in the controversial 1995 semi-final that kept the Springboks on course for glory. Sadly, Kruger passed away at the start of the decade after a 10-year battle with brain cancer. AFP/Getty Images 65/101 37: Sam Whitelock Incredibly, Whitelock could become one of three players who win the World Cup for a third consecutive time this tournament alongside Kieran Read and Sonny Bill Williams, and he is young enough to have a crack at 2023 too. Whitelock is sometimes overshadowed by his younger teammate Brodie Retallick, but what he has given the All Blacks should not be underestimated. Getty Images 66/101 36: Jerome Kaino One of the most powerful and physically-dominating blindside flankers the game has seen, Kaino brought a ferocious intensity to the game that helped him to World Cup wins in 2011 and 2015. Getty Images 67/101 35: Percy Montgomery South Africa's goal-kicking full-back of the 2007 World Cup triumph, Montgomery was one of the best all-round players of his time - represented by the fact he finished his career with 102 caps to his name. Getty Images 68/101 34: Jason Little The other part of the Australian centre pairing that dominated the 1990s, Little often competed with Daniel Herbert to partner Tim Horan. Getty Images 69/101 33: Bakkies Botha A Goliath on the pitch and not someone you wanted to run into, Botha formed a formidable partnership with Victor Matfield as South Africa won the 2007 World Cup. His lineout presence was intimidating enough before he'd even left the ground, while he wasn't half-bad at carrying either. Getty Images 70/101 32: Christophe Lamaison His performance against New Zealand in 1999 semi-finals remains one of the great individual displays in World Cup history. Lamaison was stereotypical of what French rugby is about: gifted athleticism, natural ability and a flare that was delightful to watch. His impact on Kiwi rugby remains to this day. AFP/Getty Images 71/101 31: Lawrence Dallaglio One of the players who learned from the errors of 1999 to dazzle in 2003. Remembered for making the break that set-up Jason Robinson's try in the World Cup final, but contributed so much more to England's campaign. Getty Images 72/101 30: Schalk Burger If Bakkies Botha wasn't bad enough, South Africa also possessed the mean Schalk Burger in their pack that inflicted plenty of punishment in opponents. Not always on the right side of the law, Burger remains one of the most combative flankers seen in the game, relying on his brute strength and athletic ability to wreak havoc at the breakdown. Getty Images 73/101 29: Joel Stransky Kicked all 15 points in South Africa's triumphant 1995 World Cup final effort, with his extra-time drop-goal going down in history as one of the epic World Cup moments. Getty Images 74/101 28: Conrad Smith One half of New Zealand's almighty centre pairing that proved pivotal in the 2011 and 2015 triumphs. Smith was never the most exciting or most dangerous player on the field, but he was the glue that held the back line together and without him, the All Blacks would not be what they are today. Getty Images 75/101 27: John Smit South Africa's 2007 World Cup-winning captain made the brave decision to convert from a prop to a hooker and reaped the rewards by leading his country to glory. Lead by example as he never shied away from battle on the pitch, but a gentleman off it. Getty Images 76/101 26: Victor Matfield His experience, leadership and calmness under pressure were big factors in South Africa's success over the decade he featured in. Came out of retirement for one last crack in 2015, though his best days were behind him by then. Getty Images 77/101 25: Richard Hill Played just three matches at the 2003 Rugby World Cup, but so important was he to England's hopes that Sir Clive Woodward was happy to carry him through the tournament knowing how much they needed him in the final. However, it was his semi-final return from injury that really stood out, keeping England's World Cup hopes alive against Wales. Getty Images 78/101 24: Zinzan Brooke One of the most gifted players in history. A No 8 with the carrying ability of a tight-forward and the passing and kicking skills of an out-half. A World Cup winner who spent a decade at the top of the game. Getty Images 79/101 23: Ma'a Nonu The other half of New Zealand's unrivalled centre pairing, Nonu overcame early struggles in his international career to become a force to be reckoned with. He provided one of the moments of the 2015 World Cup when he scored from nearly halfway in the final against Australia. Getty Images 80/101 22: Serge Blanco An enigma on the field who played with panache that befitted French rugby at the time. The full-back starred at the 1987 World Cup where France just came up short in the final, and hung up his boots after one last crack at it in 1991. AFP/Getty Images 81/101 21: Kieran Read The man who emerged from the shadow of Richie McCaw to lead the All Blacks, Read was a key figure in the 2011 and 2015 World Cup efforts. Getty Images 82/101 20: Os du Randt The only Springbok to win the 1995 and 2007 World Cup, Du Randt displayed a longevity rarely seen in the modern-day game. For years he was the first pick in any World XV side, and his importance to Springbok history cannot be understated. AFP/Getty Images 83/101 19: Stephen Larkham Larkham formed a dominant partnership with George Gregan in 1999 to lead the Wallabies to victory with his brilliant vision and ability to read the game to create opportunity after opportunity for his teammates. Moved to centre for the 2003 World Cup, displaying his versatility at the highest level, and unlucky not to end his career as a two-time World Cup winner. Getty Images 84/101 18: Francois Pienaar Would be the lead candidate to captain many all-time XVs, given his importance to not just the Springboks but to South Africa as a whole. What he achieved with Nelson Mandela in 1995 is unlikely to be repeated. AFP/Getty Images 85/101 17: Chester Williams Where Pienaar was the leader, the late Chester Williams was the inspiration. His presence single-handedly brought millions of black South Africans to support the Springboks, and his four tries in the quarter-final victory over Samoa showed just how important he was to that team. His sad death earlier this month - and the outpouring of emotion that followed - only went to strengthen how important he has been to South Africa changing its ways. Getty Images 86/101 16: George Gregan Without doubt a genius of the game. Gregan had craft, vision and intelligence that saw him grow into one of the best Australian captains of all time, having learned his trade under John Eales in the 1999 World Cup before leading the Wallabies to the 2003 final where they just fell short. Getty Images 87/101 15: Jason Robinson The raw emotion of his try in the 2003 final is hard to rival for English supporters as the great moments in World Cup history. Arguably brought something to the game that had never been seen before, and his sheer defiance to go again in 2007 - dislocated shoulder and all - can only be applauded. Getty Images 88/101 14: John Kirwan The outside backs start to come thick and fast at the top end of the list. Kirwan was very much the original World Cup finisher, with his breath-taking try in the 1987 World Cup opener going down in history as one of the most stunning tries ever seen. AFP/Getty Images 89/101 13: David Campese 'Campo' was never shy when it came to having a thing or two to say, but he got away with it because of what he could do on the pitch. The trademark goosestep inspired a new generation of wings as he took agility to a new level, and his ability to score almost at will was crucial to Australia's 1991 success. Getty Images 90/101 12: Michael Lynagh The brains behind the brawn, Lynagh could do just about anything with the ball in his hands. He marshalled the 1991 side with complete authority and was not too bad at scoring himself. Getty Images 91/101 11: Joost van der Westhuizen A joy to watch throughout his career as he starred at three World Cups, including the 1995 success on home soil. His ability to be nimble around the ruck caught out countless opponents, while he possessed a rocket of a pass too. Getty Images 92/101 10: Tim Horan One of the all-time great Wallabies who shone in 1991 and 1999. The double-World Cup winner is arguably the greatest centre of all time. Getty Images 93/101 9: Bryan Habana \"Habana! Habana!\" How many times did you hear his name ring out across the four World Cups that he featured in? 15 to be exact, as he remains the highest try-scorer in World Cup history alongside Jonah Lomu, and one of just three men to score eight in a tournament alongside Lomu and Julian Savea. Getty Images 94/101 8: Martin Johnson The ultimate leader on the field, Johnson was inspirational in the 2003 World Cup triumph for England. Things didn't go the way he hoped when he returned in 2011 as head coach, but the way that he lead his country eight years previous remains one of the most inspiring campaigns around. AFP/Getty Images 95/101 7: Michael Jones Almost single-handedly won the All Blacks the inaugural World Cup, and all while refusing to play on Sunday's due to his religious faith. Jones was unstoppable at times during that 1987 campaign, and thankfully returned to the side for the Saturday World Cup final to seize his crowning glory. Getty Images 96/101 6: John Eales It takes something special to be nicknamed 'Nobody', because 'Nobody's Perfect'. But Eales really was a player of the ilk we have not seen since: formidable in all aspects of the game, a natural leader and a goal-kicking forward. There may never be another player like him. AFP/Getty Images 97/101 5: Sean Fitzpatrick A rookie in 1987, Fitzpatrick immediately found his feet on the international stage to play a big role in New Zealand's World Cup triumph. He soon inherited the captaincy, and although further success alluded his teams, his influence on the game could not be questioned. AFP/Getty Images 98/101 4. Jonny Wilkinson The man responsible for the greatest moment in English rugby history, Wilkinson was simply incredible in 2003. Yet the way that he battled career-threatening injuries to return for the 2007 campaign - and come within a whisker of winning another World Cup - and also rack up a fourth appearance in 2011, adds far more worth to his World Cup greatness. AFP/Getty Images 99/101 3: Jonah Lomu There is no other player who has transcended the sport quite like Jonah Lomu. Non-rugby fans know who he is, those who followed the game enjoyed every second of his career and those who faced him genuinely feared what he could do. Lomu not only changed the way that wings played, but he changed the way the game was played as no one had ever seen someone - or something - quite like him. He is sadly gone, but will never be forgotten. Getty Images 100/101 2: Dan Carter The agony of missing the 2011 knockout stages were eradicated by his virtuoso performance in the 2015 World Cup final, with his snap drop-goal providing the moment that killed off the Wallabies once and for all. Having featured at four World Cups during his career, Carter remains the highest points-scorer in World Cup history. Getty Images 101/101 1: Richie McCaw Can a two-time World Cup-winning captain not be top of the list. Not according to us. McCaw was, simply put, brilliant. A breakdown master, incredible athlete, inspirational leader and a man with a remarkable ability to talk referees onto his side, McCaw had everything. And perhaps what makes the fact that he goes down in our list as the greatest to have played the game is the fact that he was so normal off the field. As Steve Hansen put in in 2015 upon his farewell appearance, he's \"just a decent bloke\". Getty Images\n\nFor McCaw, his emergence onto the international scene came in the run up to the 2003 event.\n\n“If I’m honest I probably didn’t 100 per cent understand how big and different a World Cup can be. That was my second full season at international level and the first year had gone ok, and similarly the Tri Nations leading up to the World Cup in Australia had gone pretty smoothly.\n\n“So I was just thinking we’d roll into a World Cup and it’ll be exciting and we’ll go see if we can win it. It was exciting, but I probably didn’t have the realisation of what it takes.”\n\nTwo things went against the All Blacks 16 years ago. One, as McCaw explains, was the failure to adequately prepare for the road that lay ahead. The second, and much more prominent reason, was the schedule. New Zealand didn’t face the trickiest of pools with Italy, Canada, Tonga and Wales joining them. But the Wales game came last, and it didn’t exactly go their way.\n\nEarly in the second half, New Zealand found themselves 37-33 behind and locked in a humdinger of a match. “That was a hell of a match,” says McCaw. “When I look back, we ended up scoring 53 points but midway through the second half they were only a bit behind on the scoreboard and we’d both scored 30-odd in an open and fast game of footy, and I just remember thinking ‘wow’.”\n\nThe problem came in that the ensuing quarter-final came against the Springboks, who had been beaten by England in the pool stage and found themselves in New Zealand’s way as a result. “We were really up for that game because with the South Africans it’s a big challenge and you don’t want to go home in a quarter-final – no one wanted to do that. So we had a massive game, and I thought we played really well, we were really physical, all of those sort of things.” But going back to back in energy-sapping encounters had taken its toll.\n\n“It’s the old story of sport, you’ve got to be able to back that performance up with the next one,” says McCaw as he recalls the semi-final against Australia. “There were a couple of key plays early in the game and a 14-point turnaround with the intercept from Mortlock which they got and they took. We missed that opportunity early probably through the eager defence. Straight away we missed those opportunities and the Aussies got their noses ahead and we just couldn’t get back into the game – I don’t think through a lack of trying but they just did really well.”\n\nWhen New Zealand fail at the World Cup, the ramifications are felt at home. The All Blacks had at least made it to the last four, and gone out of the competition to what was the best Australian side seen in the last 20 years, so for McCaw, the pain and agony wasn’t too bad.\n\n“I was only 22 and I suppose from a selfish personal point of view I felt like I’d played reasonably good rugby throughout that year and within that tournament, so it probably didn’t … it wasn’t such a big deal as it perhaps was the following World Cup.”\n\nIt wasn’t just McCaw who had that feeling. John Mitchell, then the head coach, was sacked, and Graham Henry was brought in that gave the All Blacks the feeling of a fresh start. With this appointment disappeared the accountability for the 2003 failure on behalf of the players, and although McCaw was appointed captain and a Lions series whitewash followed, the lessons hadn’t been learnt.\n\nThe onset of professionalism in rugby union had taken its time to make a real impact in New Zealand, but by 2007 the All Blacks were starting to really feel the positives. Players were managed through the Super Rugby season to reach the World Cup in peak fitness, the Kiwis had been the pacesetters on the global stage for the last three seasons, and they looked a safe bet for the World Cup in France.\n\nBut that Gallic thorn in New Zealand’s side returned. Eight years after the remarkable World Cup semi-final, the French pulled off yet another upset over the All Blacks in Cardiff.\n\n“We got through the pool and we hadn’t had any real challenges and I guess we were looking at it like ‘to win this thing you’ve got to win three knockout games’.\n\n“The reality is that you can’t look past one game and that’s the quarter-final. You play that like a final, and then you have another chance, whereas if you have any thoughts about that knockout game you find yourself in a bit of trouble and that’s one of the reflections that we had.”\n\nMuch of that result resided in the All Blacks’ failure to contain replacement Frederic Michalak. “I sometimes think we tried to plan for everything, like we expected it all to be perfect if you know what I mean? And sometimes when you adapt to when things don’t go your way or when Freddie comes on, you’ve got to be able to adapt.\n\n“It was one of those things where perhaps we’d been in those situations in the past and someone or the team has always found a way to do something to get the points you needed. But as the game got tighter and the scoreboard runs up as the clock runs down, you start to think about it: ‘oh we might not get there’.\n\n“That starts to make people do funny things like you try and do it all on your own, there were little bits of that, and then things like taking drop-goals of whatever, we didn’t really discuss that to the point that you needed to and when you’re in a knockout game and need to find three points, you need to think about how you’re going to hold on in there and find a way to win.\n\n“We just perhaps assumed that what we’d done in the past was going to be good enough and it wasn’t though a lack of trying – and the French had the belief too. When they got on top of us and had the momentum, it’s difficult to actually get that back. Things like that that you perhaps take for granted, but we hadn’t really addressed.”\n\nThe response back home, this time, was seismic, to the point that the New Zealand economy crashed. McCaw copped plenty of criticism, with his leadership heavily questioned and calls for both him and coach Henry to fall on their sword. “The New Zealand Rugby Union made a brave decision to stick with the coaches for another period and I guess I was lucky to get another crack as well,” he remembers.\n\nBut six years after his international debut, and eight away from retirement, McCaw had reached a turning point. The foundations of what was to come were laid in the very aftermath of that World Cup failure.\n\n“It was certainly the management’s and the senior players’ problem of how to deal with a World Cup when the heat comes on. I guess that forced us to have a look at us.\n\n“There was no hiding behind it being someone else’s problem, it was like ‘right, we have to look pretty deeply at what we didn’t get right and what we need to change and what we need to work on’. That was four years work and that wasn’t just thinking about the 2011 World Cup. It was looking away from the campaign and looking at what you wanted and needed to be better at, and a lot of it wasn’t the playing, it was when the pressure points come, what have you done to ensure you can handle it?”\n\nIf pressure was the issue for the All Blacks, then a home World Cup would be the last thing they would’ve wanted to see on the horizon. The pressure of wearing the silver fern ramps up at home, where under no circumstances is it acceptable for the All Blacks to lose. So what did McCaw do? He turned it into a positive.\n\n“We reframed it a little bit,” he explains. “People talk of the extra pressure of playing at home and in front of your own fans, but we turned it around and said ‘well if you wanted to play somewhere, why wouldn’t you want to play at home in front of your fans?’\n\n“It was great when we did that, you love playing at home and we were lucky we got the opportunity to do that, so we tried to refocus it that way, and then people would say ‘what if you don’t win this one?’, we would go straight back at them and say ‘but what if we do?’”\n\nThe All Blacks were also having to carry the hopes of a nation trapped in tragedy. The 2011 Christchurch earthquakes decimated McCaw’s home town, killing 185 and leaving thousands homeless in a city that still shows the impact of the natural disaster today. Suddenly, the All Blacks had to bring the feel-good factor back to the entire country, not just the rugby fans.\n\nBut the ultimate test of that came in how New Zealand coped with the loss of world class fly-half Dan Carter – and then his replacement Colin Slade, and his replacement Aaron Cruden – leaving them with a fourth-choice option in Stephen Donald. In circumstances that could easily faze other players – good players at that – McCaw just made it as simple as possible. Donald had played more than 20 Tests by that point of his career and knew what he was doing, so his skipper welcomed him into camp, and told him: “right you’re in charge of running that ship as our No 10 and we’ve got full faith in you. If you need me to do anything to help just say, but get on with it.”\n\nIt worked. Donald kicked the match-winning penalty in the final, and 24 years of World Cup heartache had finally come to an end.\n\n“It was pure relief to be honest. The first thought when the final whistle went was ‘I’m meant to be happy?’ but I was just so relieved. Then the excitement came a wee bit later but it was like ‘ooph thank goodness’.”\n\nFrom that point on, McCaw’s All Blacks went into overdrive. The flanker won 41 of the 46 games he played in between World Cup finals, losing just three match at a win ratio more than 89 per cent.\n\n“A lot of the work had been done and we were ready,” he says. “We’d obviously had a good period up to that point, but that didn’t count for anything. To achieve what we wanted to, to get to the right spot, the guys were excited by the chance to do something that no other team had done, to go and win it again.\n\n“From a personal point of view I knew it was going to be a last crack at international rugby, so I wanted to make sure we did it right.”\n\nThe All Blacks did exactly that, making World Cup rugby look easy to the point that the only time they looked in real danger was the semi-final against the Springboks.\n\n“There was a couple of key moments – we stole a lineout and DC [Carter] got a drop-goal at a pretty key time – there were things like that and it just came down to holding our nerve. I thought all of our guys did a pretty good job of that with reasonable control, and even though it may not have looked like it towards the end of the game, it felt like we were the ones who were giving the pressure and they were in that mode where you’re waiting for a mistake to get an opportunity, and we managed to not give them one.”\n\nNew Zealand did not score a single point in the final quarter of the semi-final, with Pat Lambie’s 68th-minute penalty closing the lead to just two points. But where they had faltered before, the All Blacks displayed the mental resilience that defined McCaw: take it in their stride, do what they wanted to do and above all, keep a calm head on.\n\nSomehow New Zealand came up against a rejuvenated Australia side who had seen off England, Wales, Scotland and Argentina, but the Wallabies were never really a match for their great rivals.\n\n“We had the Wallabies on the ropes in the second half, and to their credit they hung in there.” Australia scored two quick tries to make a contest of it, but New Zealand pulled away in the closing stages and as the old guard of McCaw, Carter, Non et al prepared to bow out, the new guard emerged with Beauden Barrett scoring the final try of the match. “It was one that we didn’t want to finish because it was fun at the end,” remembers McCaw. “We were enjoying ourselves, and we’d gone from four years earlier from just hanging in there and surviving to actually loving it and wishing it wouldn’t end.\n\n“In my mind I knew that was going to be my last game, but I didn’t shut the door just in case because I didn’t know what was going to happen and I didn’t want to make any big calls.\n\n“I remember this distinct feeling as soon as the final whistle went thinking ‘wow that’s it, it’s done’, and for a brief moment I thought it was disappointing that this was going to be it, but then actually it was ‘just enjoy this’.\n\n“I reflected afterwards that it was the perfect time to finish. Maybe I could’ve played on a bit longer but I knew that while I’d never get sick of playing it was becoming harder and harder to get yourself to the point of being able to perform like that every week. It was just the right time for the team, me and everyone and the last game of rugby being a World Cup final at Twickenham that you win is not a bad way to finish.”\n\nIt signed off what has been voted the greatest career of any player at the World Cup, according to our countdown, and in a fitting way to crown it, McCaw was the man to display the Webb Ellis Cup at the opening ceremony for Japan 2019. The cup doesn’t belong to any one individual, but if it did, it should probably be Richie’s.", "description": "“Ah great,” says Richie McCaw. The former All Blacks captain has just been told that he has come out on top in a vote to decide the greatest player in the history of the Rugby World Cup. No theatrics, no hullaballoo, just another thing to take in his stride. “Good stuff,” he adds.", "authors": ["Jack De Menezes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/20/10/richie-mccaw.jpg", "published_at": "2019-09-20"}