{"pub": "fox", "url": "https://foxnews.com/us/exclusive-russia-investigation-origins-probe-expands-white-house-dems-war-over-trump-impeachment-escalates", "downloaded_at": "2019-10-09 10:41:16.713518+00:00", "title": "Exclusive: Russia investigation 'origins' probe expands; White House-Dems war over Trump impeachment escalates", "language": "en", "text": "Good morning and welcome to Fox News First. Here's what you need to know as you start the day ...\n\nExclusive: Russia investigation ‘origins’ probe expands\n\nJohn Durham, the U.S. attorney reviewing the origins of the 2016 counterintelligence investigation into Russia and the Trump campaign, is probing a wider timeline than previously known, according to multiple senior administration officials. Fox News previously reported that Durham would be reviewing the days leading up to the 2016 election and through the inauguration. However, based on what he has been finding, Durham has expanded his investigation adding agents and resources, the senior administration officials said.\n\nThe timeline has grown from the beginning of the probe through the election and now has included a post-election timeline through the spring of 2017, up to when Robert Mueller was named special counsel. Click here for more on our top story.\n\nWhite House announces it will not comply with House Dems' 'illegitimate and unconstitutional' impeachment inquiry\n\nThe White House said in a defiant eight-page letter to House Speaker Nancy Pelosi and top Democrats on Tuesday that it will not participate in their “illegitimate and unconstitutional” impeachment inquiry, charging that the proceedings have run roughshod over congressional norms and the president's due-process rights. The letter, written by White House counsel Pat Cipollone and obtained by Fox News, tees up a head-on collision with Democrats in Congress, who have fired off a slew of subpoenas in recent days concerning the president's alleged effort to get Ukraine to investigate political foe Joe Biden during a July phone call with Ukraine's leader. This means no additional witnesses under administration purview will be permitted to appear in front of Congress or comply with document requests, a senior White House official told the Associated Press. (Read the White House letter here.)\n\nThe White House argues the formal impeachment inquiry is not legitimate because the House has not voted to begin an investigation into Trump. Pelosi argues that House is acting within the rules under the Constitution to conduct oversight of the executive branch. Click here for more on this story.\n\nIn other developments in the Trump impeachment inquiry: House Democrats have subpoenaed Gordon Sondland, the U.S. ambassador to the European Union, for testimony and documents related to their inquiry on Trump's July 25 phone call with the Ukrainian President Volodymyr Zelensky. The Trump administration ordered Sondland not to appear at a scheduled closed-door deposition on Tuesday. President Trump tweeted that he would \"love to send Ambassador Sondland [...] but unfortunately, he would be testifying before a totally compromised kangaroo court.\"\n\nAlso, the Senate Intelligence Committee on Tuesday issued a report urging Trump to warn the public about efforts by foreign governments to interfere in U.S. elections and take steps to prevent hostile nations from using social media to meddle in the 2020 vote. Also, in an attempt to show Democrats' hypocrisy, Tucker Carlson on Tuesday's edition of \"Tucker Carlson Tonight\" highlighted a 2004 comment from John Kerry, then a candidate for president, claiming foreign leaders told him how much they wanted him to oust then-President George W. Bush.\n\nExclusive: Mueller was pursuing FBI director job when he met with Trump in 2017, administration officials say\n\nWhen Robert Mueller met with President Trump in May 2017, he was pursuing the open post as the director of the FBI – something the former Russia probe special counsel denied under oath during congressional testimony this summer, multiple administration sources told Fox News. These officials also told Fox News that government documents showed Mueller was pursuing the job as a candidate himself. At the time of the infamous May 16, 2017, meeting, James Comey had been fired as FBI director. Mueller was named special counsel to oversee the Trump-Russia probe the very next day.\n\nNBA Commissioner Adam Silver heads to China to salvage relationship: report\n\nNBA Commissioner Adam Silver is going to Shanghai to try and repair the league's relationship with China, according to TMZ. Silver spoke with the media on Tuesday to discuss China essentially blackballing the Houston Rockets after team general manager Daryl Morey tweeted out support for protesters in Hong Kong. China's basketball association suspended cooperation with the Rockets over the tweet. In addition, the tweet drew a public rebuke from Rockets owner Tilman Fertitta and an apologetic initial statement from the NBA, which, in turn, rankled several U.S. politicians who felt the league cared more about its financial interests and was kowtowing to a brutal regime known for human rights violations.\n\nSilver said he won't bend when it comes to protecting freedom of expression. \"The NBA will not put itself in a position of regulating what players, employees and team owners say or will not say on these issues,\" he said. \"We simply could not operate that way.\"\n\nJury finds Johnson & Johnson must pay $8B in Risperdal case\n\nJohnson & Johnson, still reeling from settling two Ohio opioid-related lawsuits for more than $20 million, was slapped with an $8 billion judgment Tuesday over its antipsychotic drug Risperdal. A jury in Philadelphia, according to legal web site Law360, hit the drug giant with the staggering payout “after agreeing the company had recklessly ignored the risks that the antipsychotic drug Risperdal could lead to breast growth in adolescent boys as it pushed the medication for use in children.” The drug comes from a J&J subsidiary, Janssen Pharmaceuticals Inc. The judgment came about on behalf of Nicholas Murray, a Maryland resident who grew breasts after he started using Risperdal as a nine-year-old in 2003 to help control symptoms related to autism.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nTODAY'S MUST-READS\n\nKavanaugh controversy: Senate Republicans want update on criminal referrals over dubious accusations.\n\nWarren faces mounting questions: Was she fired for being pregnant?\n\nCalifornia governor signs large-scale law capping rent increases.\n\nTHE LATEST FROM FOX BUSINESS\n\nPG&E to cut about 800,000 Californians' power.\n\nSouthwest Airlines grounds two Boeing planes with cracked critical part.\n\nFirst Lady to meet with children affected by vaping.\n\n#TheFlashback: CLICK HERE to find out what happened on \"This Day in History.\"\n\nSOME PARTING WORDS\n\nFox Sports 1 host Jason Whitlock says the controversy over Houston Rockets general manager Daryl Morey expressing public support for the Hong Kong pro-democracy protests reveals how dependent the NBA has become on China.\n\nNot signed up yet for Fox News First? Click here to find out what you're missing.\n\nClick here to find out what's on Fox News and Fox News Radio today.\n\nFox News First is compiled by Fox News' Bryan Robinson. Thank you for joining us! Enjoy your day! We'll see you in your inbox first thing on Thursday morning.\n\n", "description": "", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/TrumpBarrDurham100919.jpg", "published_at": "2019-10-09"}