{"pub": "yahoo", "url": "https://news.yahoo.com/organizers-expect-thousands-yorks-youth-154758080.html", "downloaded_at": "2019-09-21 07:15:02.999021+00:00", "title": "'This Is an Emergency. Our House Is on Fire.' Greta Thunberg Addresses New York's Climate Strike", "language": "en", "text": "On Friday, hundreds of thousands of young people around the world took part in strikes to demand action on climate change. More than 4,500 strikes were planned worldwide in over 120 countries, and more than 500 strikes are registered in the U.S. alone.\n\nThe strike, which is organized by The Climate Strike Coalition, was intended to kick off a week events to highlight climate change.\n\nOne of the flagship protests on Friday was in New York City, three days before the U.N. Climate Summit. Tens of thousands of people turned out for the strikes with climate group 350.org estimating that as many as 300,000 attended. New York’s strike was held jointly with a Puerto Rico Day of Action; Friday marks the second anniversary of Hurricane Maria, which experts estimate killed at least 2,975 people on the island.\n\nI ❤️ NY\n\n60,000 and counting marching for change.#ClimateStrike pic.twitter.com/L6ERem8Cit\n\n— Mayor Bill de Blasio (@NYCMayor) September 20, 2019\n\nThis is what #FridaysForFuture look like in New York City!#ClimateStrike pic.twitter.com/1kTvaQh4YW — City of New York (@nycgov) September 20, 2019\n\nPeople march to demand action on the global climate crisis on September 20, 2019 in New York City. | Spencer Platt—Getty Images More\n\nThe New York protest culminated in a rally featuring speeches from several prominent climate leaders, including Greta Thunberg, the 16-year-old Swedish climate activist who launched the global Fridays for Future — which led to the climate strike — movements last year. In August of 2018, Thunberg began protesting in front of the Swedish parliament, rather than attending school, to demand action on climate change. Her actions soon sparked a movement and led young people around the world to start to “strike” from school on Fridays to demand action.\n\nTo reach the United States, Thunberg sailed across the Atlantic for two weeks in a racing sailboat designed to be emissions free.\n\nLast week, the New York City Department of Education announced it would grant excused absences with parental consent of all students participating in the New York climate strike.\n\nThe estimated number in New York is over 250’000! They closed the park because there were too many people... I’m speaking soon at Battery Park. #ClimateStrike pic.twitter.com/YOD80SxHaa — Greta Thunberg (@GretaThunberg) September 20, 2019\n\n“This is an emergency. Our house is on fire,” Thunberg told the crowd. “We will do everything in our power to stop this crisis from getting worse.” “Why should we study for a future that is being taken away from us. That is being sold for profit.” “Everywhere I have been the situation is more or less same. The people in power, their beautiful words are the same,” she said. The number of politicians and celebrities who want to take selfies with us are the same. The empty promises are the same. The lies are the same, and the inaction is the same.”\n\n“The eyes of the world” will be on the world leaders at the climate summit on Monday for the U.N. Climate Summit, she said. “They have a chance to prove that they too are united behind the science, they have a chance to take leadership, to prove they actually hear us,” she said to chants.\n\n“It should not be that way. We should not be the ones who are fighting for the future, and yet here we are,” she continued.\n\n“We demand a safe future,” she said. “Is that really too much to ask?”\n\nEduardo Munoz Alvarez—AP More", "description": "Organizers expect thousands to turn out, and 16-year-old climate activists Greta Thunberg is scheduled to speak.", "authors": ["Madeleine Carlisle"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ucbgP065b1t1DZC5UmTmLA--~B/aD0xNjAwO3c9MjQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/time_72/3340eac27c29b3fec9cffe519ae121de", "published_at": "2019-09-20"}