{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7574193/Police-hunt-hooded-man-18-year-old-woman-raped-Manchester-woodland.html", "downloaded_at": "2019-10-15 08:11:35.770334+00:00", "title": "Police hunt hooded man after 18-year-old woman is raped in Manchester woodland", "language": "en", "text": "Detectives investigating a rape in woodland in Manchester are looking for this man\n\nPolice are hunting a hooded man after an 18-year-old woman was attacked and raped in woodland in Greater Manchester.\n\nDetectives released a CCTV image of a man they want to speak to following the sex attack in Bailey's Wood in Blackley, north Manchester in July.\n\nPolice described the incident, which took place at around 9.15pm on July 20 this year, as 'horrific' and 'terrifying'.\n\nDetective Constable Karen Benson said: 'No one should be subjected to such a terrifying attack, and we have been carrying out numerous enquiries since this incident to find the person responsible.\n\n'We are now appealing for the public's help in identifying the person in this photo as we want to speak to him in connection with what happened. Please get in touch if you think you might know him.'\n\nThe teenager was raped in Baileys Wood in the Blackley area of Manchester in July\n\nA police spokesman said: 'Shortly before 9:30pm on Saturday 20 July 2019, police were called to Charlestown Road in Blackley to reports that an 18-year-old woman had been raped.\n\n'It is believed the incident happened in the Baileys Wood area around 9.15pm.\n\n'Specially trained officers are continuing to provide support to the woman. No arrests have been made.'\n\nAnyone with information should contact contact police on 0161 856 1146, or the independent charity Crimestoppers, anonymously, on 0800 555 111.", "description": "Detectives released a CCTV image of a man they want to speak to following a sex attack in Bailey's Wood in Blackley, north Manchester in July.", "authors": ["Richard Spillett", "Crime Correspondent For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/08/19728698-0-image-a-13_1571125323940.jpg", "published_at": "2019-10-15"}