{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7629039/City-s-Guardiola-warns-against-thinking-winning-Carabao-Cup-soon.html", "downloaded_at": "2019-10-30 04:45:28.119811+00:00", "title": "City´s Guardiola warns against thinking about winning...", "language": "en", "text": "Pep Guardiola claimed it was too early to start thinking about winning the Carabao Cup for a third successive year, but his side showed few signs of weakness as they brushed aside Southampton 3-1 to reach the quarter-finals.\n\nSergio Aguero marked his 350th City appearance with a brace after Nicolas Otamendi opened the scoring at the Etihad Stadium.\n\nThough the Saints showed some fight only days after their 9-0 thrashing at the hands of Leicester, getting a goal back through Jack Stephens, they were always second best in a game where City enjoyed 77 per cent possession.\n\nBut though few would bet against City in a competition in which they have not lost in over three years, 14 games and counting, Guardiola said he and his players are not yet thinking about a three-peat.\n\n“They are not playing and thinking about winning the tournament,” Guardiola said. “It’s only when you play the semi-final or the final you start to think about that.\n\n“For the players who didn’t play it’s good for their rhythm and for myself to see that they are fit, that they are good.”\n\nSouthampton boss Ralph Hasenhuttl was happy to escape the Etihad without suffering another drubbing, admitting it was about the last place he wanted to go on the back of Friday’s result.\n\nThe bad news is his team are back in the east of Manchester again on Saturday in the Premier League.\n\n“Defending was the most important thing,” he said. “It was a defeat but a reaction after a very difficult evening on Friday. To come here and play against one of the strongest sides on the planet showed the guys were committed.”\n\nFriday’s tormentors Leicester advanced with a 3-1 win over Burton, who will have no repeat of last season’s journey to the semi-finals.\n\nAlso advancing were Everton, 2-0 winners over Watford; Colchester, who won 3-1 at Crawley; and Oxford, who beat Sunderland on penalties after a 1-1 draw.\n\nAttention now switches to Wednesday’s fixtures, with three ties to come.\n\nManchester City manager Pep Guardiola says his side are not thinking about winning the Carabao Cup just yet (Martin Rickett/PA)\n\nLiverpool host Arsenal, Chelsea take on Manchester United and Aston Villa and Wolves meet in a battle of near neighbours, if not exactly fierce rivals.\n\nThere will be no Granit Xhaka for Arsenal at Anfield, but manager Unai Emery has indicated that is unrelated to the club captain’s angry reaction towards supporters who mockingly cheered his substitution against Crystal Palace on Sunday.\n\nInstead Emery will shuffle his pack, as will opposite number Jurgen Klopp, who has included teenager Harvey Elliott in his squad after the 16-year-old completed a 14-day FA ban for using offensive language in a video mocking Tottenham striker Harry Kane.\n\nElliott became the youngest player to start a senior Liverpool match when he played in the last round against MK Dons aged 16 years and 174 days.\n\nAs United travel to Chelsea, much has changed for both sides since the Red Devils opened the season with a 4-0 rout of Frank Lampard’s side at Old Trafford.\n\nWhile United have won only four of 13 games since, Lampard’s side go into the game having won seven in a row in all competitions.\n\nThe draw for the quarter-finals will follow on Thursday morning, after which Guardiola may or may not allow himself to think about another trip to Wembley in March.", "description": "His comments came after the Mancunians beat Southampton.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/04/wire-20360156-1572410060-162_636x382.jpg", "published_at": "2019-10-30"}