{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/09/19/hezbollah-scout-identified-possible-targets-terror-group", "downloaded_at": "2019-09-20 02:27:14.240881+00:00", "title": "Hezbollah agent scouted targets including the White House and Statue of Liberty for terror group", "language": "en", "text": "A man named Alexei Saab was arrested in July and today the Department of Justice revealed the reason. Saab has been charged with nine counts of supporting the terror group Hezbollah. This isn’t a case where a disgruntled American became radicalized by viewing online videos and reached out to a terror group. On the contrary, Saab allegedly joined Hezbollah, received training, and rose in its ranks years before he entered the United States in 2000.\n\nSaab joined Hizballah in 1996. Saab’s first Hizballah operation occurred in Lebanon, where he was tasked with observing and reporting on the movements of Israeli and Southern Lebanese Army soldiers in Yaroun, Lebanon. Among other things, Saab reported on patrol schedules and formations, procedures at security checkpoints, and the vehicles used by soldiers. In approximately 1999, Saab attended his first Hizballah training. The training focused on the use of firearms, and Saab handled and fired an AK-47, an M16 rifle, and a pistol, and threw grenades. In 2000, Saab transitioned to membership in Hizballah’s unit responsible for external operations, the IJO, and he then received extensive training in IJO tradecraft, weapons, and military tactics, including how to construct bombs and other explosive devices. In 2004 and 2005, Saab attended explosives training in Lebanon during which he received detailed instruction in, among other things, triggering mechanisms, explosive substances, detonators, and the assembly of circuits.\n\nThe feds claim that Saab applied for naturalized citizenship in the U.S. in 2005 in order to facilitate his real mission, which was scouting American landmarks for security and structural weaknesses he could transmit back to Hezbollah:\n\nIn 2005, Saab applied for naturalized citizenship and falsely affirmed, under penalty of perjury, that he had never been “a member of or in any way associated with . . . a terrorist organization.” In August 2008, Saab became a naturalized U.S. citizen. While living in the United States, Saab remained an IJO operative, continued to receive military training in Lebanon, and conducted numerous operations for the IJO. For example, Saab surveilled dozens of locations in New York City—including the United Nations headquarters, the Statue of Liberty, Rockefeller Center, Times Square, the Empire State Building, and local airports, tunnels, and bridges—and provided detailed information on these locations, including photographs, to the IJO. In particular, Saab focused on the structural weaknesses of locations he surveilled in order to determine how a future attack could cause the most destruction. Saab’s reporting to the IJO included the materials used to construct a particular target, how close in proximity one could get to a target, and site weaknesses or “soft spots” that the IJO could exploit if it attacked a target in the future. Saab conducted similar intelligence gathering in a variety of American cities. The FBI recovered photographs from Saab’s electronic devices reflecting his surveillance activities, including photographs of New York City landmarks.\n\nIn addition to the Statue of Liberty, NBC reports Saab also scouted sites around the country including the White House and Fenway Park in Boston.\n\nDuring interviews, Saab told agents he took photographs of buildings and locations including Quincy Market and the Prudential Center in Boston and the Capitol Building, Congress and the White House in Washington, D.C., according to a criminal complaint filed in Manhattan federal court. A video of Fenway Park that authorities say was recovered from one of Saab’s electronic devices was included in the complaint.\n\nSaab also reportedly attempted to murder a man he believed was an Israeli agent:\n\nIn addition to his attack-planning activities in the United States, Saab conducted operations abroad. For example, Saab attempted to murder a man he later understood to be a suspected Israeli spy. Saab pointed a firearm at the individual at close range and pulled the trigger twice, but the firearm did not fire. Saab also conducted intelligence-gathering for Hizballah in Istanbul, Turkey.\n\nHezbollah was founded by Iran in Lebanon to act as a proxy for attacks against Israel. The group has not carried out any attacks in the United States but was responsible for the 1983 Beirut barracks bombing which killed 241 U.S. Marines.", "description": "\"...landmarks including the Statue of Liberty, the White House and Boston's Fenway Park\"", "authors": ["John Sexton", "Ed Morrissey", "Hot Air Staff"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/Statue-of-Liberty.jpg", "published_at": "2019-09-19"}