{"pub": "cnbc", "url": "https://cnbc.com/2019/09/17/senators-want-review-of-chinese-telecoms-approvals-to-operate-in-us.html", "downloaded_at": "2019-09-17 08:25:42.093743+00:00", "title": "Senators want review of Chinese telecoms' approvals to operate in US", "language": "en", "text": "An office worker talks on a mobile phone in front of a China Unicom logo in Beijing, China on January 5, 2012.\n\nTwo U.S. senators on Monday asked the FCC and national security agencies to review whether two Chinese state-owned telecom companies should be allowed to operate in the United States, at a time of heightened concern about possible Chinese spying.\n\nSenate Democratic Leader Charles Schumer and Senator Tom Cotton, a Republican, asked Federal Communications Commission chairman Ajit Pai to review approvals in the early 2000s that allow China Telecom and China Unicom to\n\noperate in the United States.\n\n\"These state-owned companies continue to have access to our telephone lines, fiber optic cables, cellular networks and\n\nsatellites in ways that could give it (China) the ability to target the content of communications of Americans or their\n\nbusinesses and the U.S. government, including through the 'hijacking' of telecommunications traffic by redirecting it\n\nthrough China,\" the senators wrote in a letter that was also sent to the departments of defense and homeland security.\n\nThe FCC in May voted unanimously to deny another state-owned Chinese telecommunications company, China Mobile, the right to provide services in the United States, citing risks that the Chinese government could use the approval to conduct espionage against the U.S. government. The FCC disclosed at the time that it was reviewing existing approvals.\n\nPai \"has made it clear that the Commission is reviewing other Chinese communications companies such as China Telecom and China Unicom,\" FCC spokesman Brian Hart said.\n\nChina Telecom spokesman Ge Yu said the company \"has been providing telecom services to U.S. corporations for almost 20 years. We make the protection of our customers' data a priority, and have built a solid reputation as one of the best telecom companies in the world.\" He added that the company works to maintain \"good standing with all regulatory agencies.\"\n\nFCC Commissioner Brendan Carr in May said \"evidence suggested\" the commission should go further than denying China\n\nMobile's application, noting that the commission's decision cited reports that \"China Telecom has been hijacking U.S.\n\ntraffic and redirecting it through China.\"\n\nChina Unicom said in a statement it operates its international telecommunications business \"strictly in compliance with the international and local laws and regulations.\"", "description": "Federal Communications Commission chairman Ajit Pai \"has made it clear that the Commission is reviewing other Chinese communications companies such as China Telecom and China Unicom,\" spokesman Brian Hart said.", "authors": [], "top_image": "https://image.cnbcfm.com/api/v1/image/104604054-GettyImages-136433832.jpg?v=1568690131", "published_at": "2019-09-17"}