{"pub": "cryptocoin", "url": "https://cryptocoin.news/token-news/october-23-2019-zilliqa-zil-down-1-97-2nd-consecutive-down-day-31477", "downloaded_at": "2019-10-23 10:54:04.396200+00:00", "title": "October 23, 2019: Zilliqa (ZIL): Down 1.97%; 2nd Consecutive Down Day", "language": "en", "text": "Zilliqa Price Update\n\nZilliqa is down by approximately 1.97% from the previous day, with its price currently hovering around $0.005119 USD. Zilliqa is currently in a down, and it should be noted that this is now the the 2nd consecutive day that price has been down. Moreover, Zilliqa is now 7.51% below its 20 day moving average. In terms of an expected trading range, the Bollinger bands on Zilliqa suggest price may bounce between $0.004885 and $0.006184 based on its momentum and volatility over the past 14 days. Price’s current proximity to the bottom of the range may make buying an attractive opportunity to traders interested in trading the range.\n\nTrade Zilliqa (ZIL) and over 500 other cryptos across ten different exchanges — all from one app. Try Quadency.\n\nThe market capitalization of Zilliqa, or the amount of US dollars it would take to buy up all the circulating coins, is currently estimated to be $45 million.\n\nDaily Engagement Metrics Update\n\n28 transactions amongst holders of Zilliqa occurred yesterday. In terms of estimating the number of holders, over the past day the total number of wallets holding Zilliqa has gone up by approximately 4. Our engagement rank, which combines weekly percentage growth in number of holders and number of transfers, has Zilliqa ranked 32 out of the 35 Ethereum tokens we’re tracking.\n\nJust How Rich are Zilliqa’s Richest Holders?\n\nIn terms of wealth concentration, the richest 1,000 wallets own 98.16% of the coin’s total money supply. Drilling down to just exchanges, the top 1,000 wallets that are exchanges control 3.77% of the currency’s money supply. In terms of growth rates, the share of total supply of the richest 1,000 wallets has grown by -0.12% over the past week. For the exchange wallets within the richest 1,000 wallets, their share has grown by -6.27%.\n\nHow Active are the Software Developers?\n\nIn terms of how active the software development team working on Zilliqa is, it may be worth observing that the last time any work pertaining to code was done on their GitHub code repository was on October 21, 2019, or approximately 2 days before. Growth rates for open issues — a “”to-do list”” of sorts and watchers (“”subscribers”” following a code repository) for Zilliqa are growing by 0.13 and 1.03, respectively, over the past 30 days.\n\nWhat’s Going on Social Media?\n\nTwitter appears to be the most popular place to follow the company, and thus may be worth monitoring. You can follow Zilliqa on Twitter here.\n\nWhere to Buy\n\nYou can trade Zilliqa, listed under the symbol ZIL, through the following exchanges: Gate, Yobit, Binance, DDEX, Ethfinex.\n\nArticle by SixJupiter", "description": "", "authors": [], "top_image": "https://cryptocoin.news/wp-content/uploads/2019/04/zilliqa.jpg", "published_at": "2019-10-23"}