{"pub": "zdnet", "url": "https://www.zdnet.com/article/this-is-what-consumers-around-the-world-think-about-autonomous-vehicles", "downloaded_at": "2019-10-11 12:33:43.179586+00:00", "title": "This is what consumers around the world think about autonomous vehicles", "language": "en", "text": "Are consumers ready for autonomous cars? According to a new survey, the answer is a resounding yes.\n\nThe survey was commissioned by ANSYS, an engineering simulation company that works in sectors like aerospace and wearable tech and has become a virtual developing grounds for several self-driving car companies. On behalf of ANSYS, Atomik Research, an independent market research firm, executed an online survey of 22,041 adults aged 18+ in countries considered to be prime targets for autonomous vehicle technology.\n\nThe firm found that seven out of 10 consumers believe autonomous cars drive better than humans or will surpass human abilities by 2029. Following large-scale reevaluation on the part of regulators and developers of the pace of AV adoption following high-profile accidents, the results of the survey should be encouraging.\n\n\"Automated driving has been a dream of engineers and travelers since at least the 1950s, but the hardware and software required to make it a practical reality has only approached a sufficient level of maturity in the past decade,\" said Sam Abuelsamid, principal research analyst, Navigant Research. \"For automated driving to become a commercial reality that people trust for safe transportation, consumers will need to be convinced that algorithms can consistently drive more reliably than humans.\"\n\nIn the popular imagination, at least, it looks like we're already there. Among other things, the survey found that 71 percent of global respondents believe autonomous cars are better at driving than humans or will surpass human abilities within 10 years, with 77 percent saying they'd be comfortable riding in an autonomous car at some point during their lifetime.\n\nLeading the pack in consumer confidence was Japan. Respondents from that country were more confident in AVs than their global counterparts, with 83 percent believing autonomous cars will be better drivers than humans within a decade. A full 38 percent of Japanese respondents believe we've already crossed that threshold.\n\nNot surprisingly, young people were more bullish on autonomous cars than their older counterparts, with 87 percent of 18- to 24-year-old respondents and 88 percent of 25- to 34-year-old respondents reporting feeling comfortable with autonomous cars in their lifetime. By contrast, 43 percent of respondents over the age of 65 said they would never ride in an autonomous car.\n\nIt may seem a foregone conclusion that self-driving cars on the way, but we've heard less about autonomous aircraft. Following the recent crashes related to failures in autonomous systems onboard Boeing's 737MAX, you might expect consumer confidence to have eroded significantly. However, an ANSYS study found that wasn't the case.\n\nIn fact, 70 percent of consumers say they are ready to fly in autonomous aircraft in their lifetime.\n\n\"Autonomous aircraft are likely to enter service over the next decade, targeting both intra-city and inter-city travel, primarily used in air freight and air taxi business models. Further automation in large commercial jets will be gradual, first starting with single pilot operations, followed by fully autonomous operations,\" said Priyanka Chimakurthi, senior research analyst at Frost & Sullivan. \"Undoubtedly, automation will continue to transform air transport, as it has done over the past few decades. However, it will have to overcome numerous challenges, starting with passenger perception, practical constraints as well as battery and propulsion technologies.\"", "description": "A new survey on global perception of autonomous vehicles unveils a strong trend.", "authors": ["Greg Nichols"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/10/10/ed9509f5-0d75-4c25-b76a-366ff9060b81/thumbnail/770x578/99dfabbd5ea363de5b38b5690a46052e/auto-driving.jpg", "published_at": "2019-10-11"}