{"pub": "scmp", "url": "https://yp.scmp.com/news/hong-kong/article/114599/hong-kong-protests-police-ask-facebook-remove-%E2%80%98defamatory%E2%80%99-posts", "downloaded_at": "2019-10-30 07:53:56.977989+00:00", "title": "Hong Kong protests: Police ask Facebook to remove ‘defamatory’ posts on officers’ handling of demonstrations", "language": "en", "text": "Police in Hong Kong are facing accusations of interferring with free speech after it was reported that they have asked Facebook to remove posts containing what they claimed were defamatory or unfounded allegations about their handling of anti-government protests.\n\nThe social media giant will not delete any of the posts flagged by police despite two formal requests demanding it do so, which also included a call for the company to surrender all relevant information for investigation.\n\nA message by opposition lawmaker Alvin Yeung Ngok-kiu, of the Civic Party, was among those complained about to Facebook. Yeung said he had simply relayed what television media had reported on the shooting of a student.\n\nReporter slams police brutality after journalists injured while covering protests\n\nPolice raised concerns in a letter dated October 9 about posts published the previous month, including one alleging officers harassed a female protester during a car search in Tung Chung.\n\nAnother accused police of “killing Hong Kong people” in a campaign urging internet users to file complaints with the White House about what they called “police brutality”.\n\nThe force also highlighted a post tagged “live shot fired to kill citizen”, claiming the author of the message had sought to “make up facts” and distort the aim of the police operation.\n\nMany people disagree with the way riot police have handled the protests. Photo: SCMP/ Edmond So In its letter, publicly available on its official website, the force said: “As a global social media platform, Facebook absolutely has the responsibility to ensure that contents dispatched by its users are factual and in the public interest.”\n\nFacebook apparently did not heed the police’s demands and the force issued another letter last Thursday, expressing “extreme disappointment” with the company’s inaction.\n\nIn the second letter, the force referred to more “defamatory” posts and again insisted Facebook act decisively against “inaccurate reports” and posts that “provoke hatred”.\n\n“We strongly demand the Hong Kong office of Facebook remove such content and hand over relevant information to police for further investigation,” the October 24 letter read.\n\nOn October 1, Yeung shared an online report about a young student being shot by police during a clash in Tsuen Wan under a social media post titled “live shot fired to kill citizen”.\n\n“I was not approached by Facebook to remove the post. And I am not going to remove the post,” Yeung said on Tuesday.\n\n“Hong Kong people do not need police to teach us what we should read on social media.”\n\nHenry Chan Wan-hoi, a critic of the Hong Kong government who is described as an online influencer, said the force’s reaction amounted to interference with basic freedoms.\n\nIn a post on Tuesday, Chan wrote: “It is an open challenge to press and speech freedoms.”", "description": "The action has lead to accusations of interfering with Hongkongers' right to free speech, though the social media giant refused to remove the posts.", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/23ae8b30-fa55-11e9-acf9-cafedce87d15imagehires145110.jpg", "published_at": "2019-10-30"}