{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7606949/The-Islamic-State-used-popular-teenage-app-TikTok-share-torture-videos.html", "downloaded_at": "2019-10-24 08:06:19.894180+00:00", "title": "The Islamic State used popular teenage app TikTok to share torture videos", "language": "en", "text": "The Islamic State has turned to the popular video app TikTok, which is predominantly used by teenagers to share dance and music videos, to post clips that depict grisly beheadings and torture.\n\nThe Islamic State's TikTok videos were first discovered this week and were initially believed to be propaganda clips, shared from a dozen accounts. Only later was it discovered that some of the videos depicted the violence and horror of ISIS, showing torture and murder bizarrely juxtaposed with lighthearted emoji stickers.\n\nThose videos were flagged and removed by the company.\n\nThe shocking clips showed militants wearing balaclavas torturing captives by pushing them to the ground and beheading them with machetes, according to the Wall Street Journal. Other videos shows assailants shooting people at close range.\n\nThe Islamic State has turned to the popular video app TikTok, which is predominantly used by teenagers to share dance and music videos, to post clips that depict grisly beheadings and torture. An image from a video of a purported Islamic State supporter posted on TikTok pictured above with the message: 'Come back soon, God willing.' TikTok has deleted the video\n\nThis screenshot of an ISIS propaganda video was bizarrely edited with pink hearts as if in an attempt to appeal to the app's young users. The message says: 'We will send a message to the whole world'\n\nIn this screenshot a woman is labeled a 'jihad lover' and carries the Islamic State flag. Experts believe these clips were designed to target young girls\n\nThe clips were disturbingly edited to include youthful flair, like a burst of colorful confetti, stickers of pink hearts, or peace sign emojis.\n\nThe execution videos were shared from three different accounts that boasted between 175 to 1,000 followers. Each of the execution videos received a range of 25 to 125 likes.\n\nThe clips first started to emerge on TikTok three weeks ago and the most recent videos were posted two days ago.\n\nOne of those accounts is purported to be owned by a woman. That account posted Islamic State propaganda videos as well as songs and photos of guns.\n\nUsing TikTok was likely a strategic choice by ISIS militants as the app exploded with popularity in 2018 and is the third most installed app in the world. About 30 percent of the users are under the age of 18.\n\nISIS has tried to spread their extremist agenda on Facebook, Twitter, Alphabet and YouTube in the past.\n\nTikTok has banned terrorist and criminal organizations from using the video sharing app.\n\n'DO NOT use TikTok to promote and support these organizations,' the company said in its guidelines.\n\n'This content is abhorrent, a clear violation of our policies and has been removed from our platform,' a spokesperson for TikTok said on the terror videos.\n\nThe spokesperson says that TikTok works with experts to protect against malicious behavior on the app and filter out terrorist-related content and accounts.\n\nTikTok is owned by Beijing-based Bytedance Ltd.\n\nThe revelation of the violent torture videos comes after the Islamic State’s propaganda videos were discovered earlier this week.\n\nUsing TikTok was likely a strategic choice by ISIS militants as the app exploded with popularity in 2018 and is the third most installed app in the world. About 30 percent of the users are under the age of 18\n\nThose clips depicted corpses paraded through the streets and showed Islamic Sate fighters armed with guns, and highlighted women who called themselves 'jihadist and proud'.\n\nMany of those videos were set with Islamic State songs playing in the background. One video posted in recent weeks plays a song in Arabic in which the phrase 'We pledge allegiance til death' is heard.\n\nIn the same bizarre fashion as the torture videos, these propaganda clips included TikTok filters and stickers of stars and hearts in an attempt to appeal to the app’s young audience.\n\nThose propaganda videos come from two dozen accounts, which were identified by social media intelligence company Storyful.\n\nThe Islamic State is known to aggressively use social media its its propaganda campaign to lure in followers.\n\nBut experts say that these TikTok clips aren’t recruitment videos, Elisabeth Kendall, an Oxford University expert on extremism said to the WSJ. She says the purpose of those clips was to rouse enthusiasm and support for the Islamic State.\n\n'The rhyme, beat, evocative lyrics and punchy delivery are especially appealing to youth. This catchy sing-along method for propagating ISIS ideology means it spreads quickly and sticks in the collective memory. It tends to be far more effective than sermons or theological debate and treatises,' she said.\n\nThese propaganda accounts were used to broadcast updates about the extremist group’s news, sharing screenshots of statements from Amaq. One message posted on October 11 claimed the Islamic State detonated a car bomb in Northeast Syria.", "description": "The Islamic State has turned to the popular video app TikTok, which is predominantly used by teenagers to share dance and music videos, to post clips that depict grisly beheadings and torture.", "authors": ["Marlene Lenthang For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/01/20109654-0-image-a-11_1571875332392.jpg", "published_at": "2019-10-24"}