{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/2019/10/16/trump-asks-harry-dunns-parents-to-meet-with-anne-sacoolas/3995325002", "downloaded_at": "2019-10-16 20:32:31.758630+00:00", "title": "Trump tried to broker meeting with accused hit-and-run driver Anne Sacoolas and parents of victim Harry Dunn", "language": "en", "text": "CLOSE President Trump says his meeting with the parents of a British teen killed in a traffic accident involving an American diplomat's wife was \"beautiful.\" (Oct. 16) AP\n\nWASHINGTON – President Donald Trump stunned the British parents of a hit-and-run victim Tuesday by trying to set up a sudden meeting with the accused driver, the wife of a U.S. diplomat.\n\nCharlotte Charles and Tim Dunn, whose 19-year-son Harry was killed in an August accident, told reporters that Trump dropped a \"bombshell\" shortly after they began their meeting at the White House: The accused driver, Anne Sacoolas, was in the next room.\n\nCharles, who said she and Dunn were \"shocked\" by Trump's offer, declined the meeting under such unusual circumstances. They said any such meeting should happen back in the United Kingdom.\n\n\"It’s not appropriate to meet her without therapists and mediators for us as a family,\" she said, adding that it would also be unfair for Sacoolas as well. \"How can it be comfortable for her to be thrown into a situation like that without therapists and mediators?”\n\nTrump: 'Secret' Trump note seen in photo says wife of US diplomat won't go back to UK to answer for fatal accident\n\nSacoolas, who is married to an American diplomat, left the United Kingdom shortly after the August accident.\n\nTrump told reporters Wednesday he thought a meeting between the driver and the parents would be a good idea. He suggested that the parents declined because \"lawyers\" are involved in the case.\n\nHis solo meeting with the parents \"was beautiful in a certain way,\" Trump said, and he praised them for their fortitude. \"They lost their son,\" he said.\n\nTrump also expressed sympathy for Sacoolas, saying she was apparently confused because the British drive on the left-hand side of roads. \"It happens to a lot of people,\" Trump said.\n\nThe president would not say whether the driver should return to the United Kingdom.\n\nThe parents and British lawmakers have demanded extradition of Sacoolas as the incident is being investigated; Trump has declined, saying he hopes that something can be worked out.\n\nCharlotte Charles, mother of Harry Dunn, who died after his motorbike was involved in an August 2019 accident in Britain, speaks at news conference; she is joined by Dunn's father Tim Dunn, far right, and other family members and supporters. (Photo: Craig Ruttle, AP)\n\nSpeaking with reporters outside the White House on Tuesday, the parents said they did not think Trump's offer was a stunt, and that he sincerely wants to resolve the situation.\n\nHarry Dunn was riding a motorbike on Aug. 27 when he was struck by a car driving on the wrong side of the road.\n\nSpeaking with reporters outside the White House, Charles said Trump claimed he would look at the matter again and \"try to push it from a different angle.\"\n\nShe also said: \"We still want justice for Harry.\"\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/2019/10/16/trump-asks-harry-dunns-parents-to-meet-with-anne-sacoolas/3995325002/", "description": "The parents of a 19-year-old man killed in an apparent hit-and-run said they were shocked by Donald Trump's offer.", "authors": ["David Jackson", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/16/USAT/2330d229-d6d1-46d4-b9f7-937c1c266be9-AP_Britian_US_Diplomats_Wife.JPG?crop=3815,2146,x0,y51&width=3200&height=1680&fit=bounds", "published_at": "2019-10-16"}