{"pub": "americanconservative", "url": "https://reviewjournal.com/news/nation-and-world/chinas-hypersonic-missile-a-challenge-to-us-others-1860750", "downloaded_at": "2019-10-08 02:16:27.352481+00:00", "title": "China’s hypersonic missile a challenge to US, others", "language": "en", "text": "Military planners in Washington and elsewhere will be taking note of new missile technology displayed by China, particularly a hypersonic ballistic nuclear missile believed capable of breaching all existing anti-missile shields deployed by the U.S. and its allies.\n\nMilitary vehicles, carrying DF-17, roll down as members of a Chinese military honor guard march during the parade to commemorate the 70th anniversary of the founding of Communist China in Beijing, Tuesday, Oct. 1, 2019. China's military has shown off a new hypersonic ballistic nuclear missile believed capable of breaching all existing anti-missile shields deployed by the U.S. and its allies. The vehicle-mounted DF-17 was among weapons displayed Tuesday in a massive military parade marking the 70th anniversary of the founding of the Chinese state.(AP Photo/Ng Han Guan)\n\nMilitary vehicles carrying DF-100 roll down as members of a Chinese military honor guard march during the celebration to commemorate the 70th anniversary of the founding of Communist China in Beijing, Tuesday, Oct. 1, 2019. (AP Photo/Ng Han Guan)\n\nMilitary vehicles roll down as members of a Chinese military honor guard march during the parade to commemorate the 70th anniversary of the founding of Communist China in Beijing, Tuesday, Oct. 1, 2019. (AP Photo/Ng Han Guan)\n\nMilitary vehicles roll down during a parade to commemorate the 70th anniversary of the founding of Communist China in Beijing, Tuesday, Oct. 1, 2019. (AP Photo/Ng Han Guan)\n\nMilitary vehicles roll down as members of a Chinese military honor guard march during the parade to commemorate the 70th anniversary of the founding of Communist China in Beijing, Tuesday, Oct. 1, 2019. (AP Photo/Ng Han Guan)\n\nBEIJING — Military planners in Washington and elsewhere will be taking note of new missile technology displayed by China, particularly a hypersonic ballistic nuclear missile believed capable of breaching all existing anti-missile shields deployed by the U.S. and its allies.\n\nThe vehicle-mounted Dong Feng 17, or DF-17, was the standout among weapons showed off at a military parade on Tuesday marking the 70th anniversary of the founding of the Chinese state. Those also include the Dong Feng 41, or DF-41, an intercontinental ballistic missile with a range of 15,000 kilometers (9,300 miles) — China’s longest-range weapon — that that could reach the United States in 30 minutes.\n\nAlso featured at the event were the JL-2 submarine-launched strategic missile believed to be standard weaponry for China’s nuclear-powered subs, as well as the CJ-100 cruise missile.\n\nBeijing insists all are homegrown, and though China is believed to have benefited from industrial spying and imported technologies, its massive military research and development program and the size of its economy have put its weapons technology at the forefront along with Russia and the U.S.\n\n“The overall combat ability of China’s missile force has been enhanced significantly,” said Song Zhongping, a military commentator for Hong Kong’s pro-China Phoenix TV.\n\n5 times speed of sound\n\nThe DF-17 hyper-glide vehicle can be launched from a missile and once separated can reach more than five times the speed of sound, according to analysts. That speed, and its use of multiple independently targetable reentry vehicles, a technology known as MIRV, to deliver its warheads makes it far more difficult to detect and intercept.\n\nIt also flies at a much lower altitude just prior to delivering its warhead, further frustrating attempts to detect and intercept.\n\nSome analysts have called the missile a threat to regional stability because its speed allows far less time to determine whether to fire nuclear weapons in response.\n\nAs with the DF-17, little has been officially released about the DF-41, which was shown publicly for the first time. It was loaded aboard a formation of launch vehicles but is also transportable by train. Analysts say they believe it may be housed in silos in the country’s northeast.\n\nThe Center for Strategic & International Studies in Washington says the missile may have the world’s longest range at 15,000 kilometers (9,400 miles). Flying at 25 times the speed of sound, it might be able to reach the United States in 30 minutes and send up to 10 warheads to separate targets using MIRV technology.\n\nPrimary missile upgraded\n\nChina also displayed an upgrade of its mainstay missile, the Dongfeng 31, which has a range of more than 11,200 kilometers (6,990 miles) that puts most of the continental United States within reach. The second-generation Dongfeng-31AG, which like the DF-41 uses solid fuel for ease of deployment and speed of launch, comes with “high mobility and precision,” according to the official Xinhua News Agency.\n\nDisplayed for the first time, the JL-2 is the standard weapon for China’s Jin class nuclear-powered subs, each of which can deploy 12 missiles with one warhead each. Their range of 7,200 kilometers (4,473 miles) makes more of a threat regionally than to the continental United States.\n\nChina’s latest CJ-100 supersonic cruise missile also made its public debut Tuesday, carried aboard 16 trucks in formation. Little is known about the weapon that is speculated to be a replacement for the PLA’s current CJ-10 cruise missile which has an estimated range of about 1,500 kilometers (930 miles).\n\nThe CJ-100s are “characterized by a long range, high precision and quick responsiveness and are the latest addition to the CJ missile series,” Xinhua reported.\n\nAll those weapons seemed intended to imbue China with the ability to back up its territorial claims with credible threats, especially against the possibility of U.S. intervention. Many, including the already deployed DF-21D anti-ship ballistic missile, are seen as standoff weapons to keep U.S. aircraft carriers at bay while subjecting bases such as Guam to the possibility of attack.\n\nChina has also responded to what it sees as U.S. moves in the region that threaten its own security. That includes the deployment of the advanced THAAD air defense system in South Korea and Washington’s stated determination to deploy a land-based intermediate-range missile in the Asia-Pacific “sooner rather than later,” following its withdrawal last week from the Intermediate-Range Nuclear Forces Treaty.\n\nChina said in August it “will not stand idly by” and would take countermeasures if the U.S. goes ahead with those plans.\n\n“China should develop missiles that can hit any corners of the world especially the U.S. as a means of counter-attack,” Yue Gang, retired colonel and military commentator said. “China must have the deterrent to curb the use of nuclear weapons … China has been forced to do so by the situation.”\n\nThe renewed attention focused on China’s missile programs comes largely following the formation in 2015 of the latest branch of the People’s Liberation Army, the Rocket Force. Tuesday’s military parade featured 350 members of the force in their dark green uniforms and was their first group participation in such an event.\n\nOther weapons displayed\n\nApart from missiles, China also showed off new technologies, such as its “Sharp Sword” unmanned aerial vehicle believed capable of attacking targets such as radar stations and military bases, as well as drone submarines that could reach depths far deeper than those of crewed subs.\n\nDrones are becoming increasingly important for the Chinese military in a range of fields, including for use by artillery units in reconnaissance and damage evaluation, TVBS’s Song said.\n\nTechnology gaps still remain with the U.S. and Russia, who have had longer to develop their strategies, especially in the nuclear field, Song said.\n\nHowever, the advances align with commander of the armed forces and President Xi Jinping’s calls for a military that is capable of fighting and winning wars under modern conditions.\n\nObserving the new hardware first from his staff car then from the viewing platform atop Tiananmen Gate, he gave off an aura of satisfaction, although he said little on the matter in his address other than that “no force” could block China’s progress.", "description": "Military planners in Washington and elsewhere will be taking note of new missile technology displayed by China, particularly a hypersonic ballistic nuclear missile believed capable of breaching all existing anti-missile shields deployed by the U.S. and its allies.", "authors": ["Christopher Bodeen The Associated Press", "Bernard Condon The Associated Press", "The Associated Press", "David Sharp The Associated Press", "Jill Lawless", "Raf Casert The Associated Press", "Larry Neumeister The Associated Press", "Mark Sherman The Associated Press", "Eric Tucker", "Richard Lardner"], "top_image": "https://www.reviewjournal.com/wp-content/uploads/2019/10/12785085_web1_12785085-befb69bb05fe47c6ae248f81fe1e8999.jpg", "published_at": "2019-10-01"}