{"pub": "fox", "url": "https://foxnews.com/politics/squad-members-not-all-in-on-sanders-endorsement-at-least-not-yet", "downloaded_at": "2019-10-17 08:06:40.735184+00:00", "title": "‘Squad’ members not ‘all in’ on Sanders endorsement -- at least not yet", "language": "en", "text": "Is there dissension in the ranks of “The Squad”?\n\nOne day after reports emerged that the group of far-left House Democrats planned to endorse Sen. Bernie Sanders in the 2020 presidential race, it seemed only one of them – Rep. Ilhan Omar, D-Minn. – was officially aboard the Bernie Bus:\n\nAs for the others:\n\n-- Rep. Alexandria Ocasio-Cortez had made no official endorsement but was still rumored to be attending a Sanders rally scheduled for this weekend in Queens, N.Y. – one of two New York city boroughs that include a portion of Ocasio-Cortez’s home district.\n\nBIDEN DISMISSIVE OF OCASIO-CORTEZ'S EXPECTED ENDORSEMENT OF BERNIE SANDERS\n\n-- Rep. Rashida Tlaib, D-Mich., clarified Wednesday that she had not yet endorsed a 2020 presidential candidate – even though CNN and Omar claimed Tlaib had backed Sanders.\n\n-- Rep. Ayanna Pressley, D-Mass., also hadn’t made an endorsement.\n\nPressley’s camp stressed that while the Squad members support one another in Congress, they don’t necessarily speak with one voice on all issues.\n\n“Ayanna has tremendous respect for her sisters-in-service,” a Pressley spokesperson told Vox. “Ultimately, these political decisions are made as individuals.”\n\n“Ayanna has tremendous respect for her sisters-in-service. Ultimately, these political decisions are made as individuals.” — Spokeswoman for U.S. Rep. Ayanna Pressley, D-Mass.\n\nOne factor possibly stalling a Pressley endorsement of Sanders: She hails from the same state as Sen. Elizabeth Warren, so she might not be as eager to oppose a presidential candidate from her home area – the way that Sen. Dianne Feinstein, D-Calif., for example, backed former Vice President Joe Biden instead of her fellow Californian, Sen. Kamala Harris.\n\nAccording to Boston.com, Pressley’s ties to the Sanders campaign aren’t as strong as those of Ocasio-Cortez and Omar, with Pressley having backed Hillary Clinton over Sanders in 2016. In addition, Pressley has worked with Warren on legislation in Congress and also has close relationships with Harris and Sen. Cory Booker, D-N.J., who have been seeking her endorsement, the report said.\n\nTlaib, meanwhile, hasn’t ruled out a Sanders endorsement down the road, telling the Detroit Free Press she will host the U.S. senator from Vermont in her district later this month – just as she recently did recently with Warren. (Warren posted video from that visit online Wednesday -- and Tlaib retweeted it.)\n\n\"I am looking forward to bringing Senator Sanders to Michigan on Oct. 27 for a tour of our district that will highlight economic justice issues and corporate tax giveaways, and (include) a roundtable with housing justice advocates,” Tlaib said. “I need to know that anyone I choose to endorse will fight for my residents, and I appreciate the opportunity for them to have a dialogue with Sen. Sanders about these critically important issues.”\n\n“I need to know that anyone I choose to endorse will fight for my residents, and I appreciate the opportunity for them to have a dialogue with Sen. Sanders about these critically important issues.” — U.S. Rep. Rashida Tlaib, D-Mich.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBut regardless of what Tlaib and Pressley ultimately decide to do, the Sanders endorsement by Omar – and rumored endorsement by Ocasio-Cortez – were blows to the Warren campaign, coming on the same night that the senator fended off fierce attacks from fellow Democrats at the party’s presidential debate in Ohio.\n\nAs Boston.com noted, Warren has courted Ocasio-Cortez, having lunch with her in March, writing a blurb for Ocasio-Cortez’s entry in Time magazine’s “Time 100” listing, and filming a video with Ocasio-Cortez in which the pair reviewed the final episode of “Game of Thrones.”", "description": "One day after reports emerged that the group of far-left House Democrats planned to endorse Sen. Bernie Sanders for president, it seemed only one of them – Rep. Ilhan Omar, D-Minn. – was officially aboard the Bernie Bus.", "authors": ["Dom Calicchio", "Spokeswoman For U.S. Rep. Ayanna Pressley", "U.S. Rep. Rashida Tlaib"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/16/694940094001_6095214729001_6095219483001-vs.jpg", "published_at": "2019-10-17"}