{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/home/4-bad-reasons-to-keep-clothes-you-dont-wear/2019/09/23/7789e420-d570-11e9-9610-fb56c5522e1c_story.html", "downloaded_at": "2019-09-24 13:48:41.038607+00:00", "title": "4 bad reasons to keep clothes you don’t wear", "language": "en", "text": "Fall is the optimal time to clean out your closet, and I’ve been helping a lot of people do just that in recent weeks. I’ve noticed that even when people feel motivated to purge, they still have a tough time parting with clothes. They’ll often point to one of the following reasons as justification for why they just have to keep a particular item.\n\nFond memories\n\nMany people will gaze at a dress or pair of shoes and wistfully tell me how they wore the dress on a fabulous vacation or that they bought a particular pair of shoes in a special store that doesn’t exist anymore — and for those reasons they feel compelled to keep the items. I get it; some belongings are special. A wedding dress and one or two other items are certainly okay to keep for sentimental reasons, but you can’t keep everything just because it reminds you of something. If we took this approach to cleaning, we would never get rid of anything. Your memories will remain with you. Focusing on upcoming events and the importance of creating space for what you might like to purchase is helpful when you’re attempting to free yourself from old clothes.\n\n[9 habits of naturally organized parents]\n\nWhen I lose weight\n\nIt’s okay to have the goal of losing weight to fit back into a certain pair of jeans, but if you lose weight, chances are that you’ll want to treat yourself to something new. Plus, unless it’s a pair of pants that’s so unusual you can’t find anything similar or a dress that you just can’t live without, I would argue that having a bunch of clothes in your closet that don’t fit might be depressing and counterproductive.\n\nIf you want to keep some clothes as motivation, perhaps they can be stored away from your daily wardrobe so you don’t feel deflated each time you see them. Additionally, and depending on how much weight you’d like to lose, it could take time before the garment will fit again. You can’t have a whole wardrobe of clothes you’d like to fit into someday taking valuable closet space away from what you wear now.\n\nIt'll be fashionable again\n\nThis is hard to argue with, especially when I look around today and see so many reminders of my youth and the trends that dominated the 1980s. But even though styles and cuts of clothing may come back into style, the old pieces don’t always translate to the new look. Updated fabrics and the current fashion scene can make the vintage stuff look less retro and more just old. And your body will likely change significantly before the piece is back in style. It’s so important to try clothes on, especially older items, because they may not fit you the way you remember, and it can help you make a more informed decision. However, there are some items that typically do stand the test of time and are worth keeping if you love them, such as luxury brand shoes, bags and accessories.\n\nIt was expensive\n\nIt’s easy to feel guilty about having spent money on something that you don’t really like and won’t wear. But the money has already been spent. Keeping something just because you think you should wear it is a constant reminder of the ill-spent money. Better to give the item to a friend or family member who may enjoy it, try to consign it, or just donate it and move on. Who hasn’t made a bad decision in a store and then dithered too long about whether to keep it until it was too late to return? Don’t beat yourself up about it — just let it go.\n\nI’m not in favor of fast fashion and churning through clothes every couple of months, but I believe you should only have pieces in your closets that you’ll actually wear. It makes getting dressed easier and faster. Also, getting rid of the excess can boost your overall attitude toward your appearance. As is true of all the stuff in our homes, clothes are just clothes.", "description": "Whether your thinking is sentimental, aspirational or financial, you need to just get them out of your closet.", "authors": ["Nicole Anzia", "September At Am", "Anzia Is A Freelance Writer", "Owner Of Neatnik. She Can Be Reached At Nicole Neatnik.Org."], "top_image": "https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png", "published_at": "2019-09-23"}