{"pub": "abcnews", "url": "https://abcnews.go.com/Technology/wireStory/researchers-find-genetic-link-rare-reaction-pet-germ-65895386", "downloaded_at": "2019-09-27 15:01:53.389542+00:00", "published_at": "2019-09-27", "title": "Genetic link found after man loses parts of arms, legs and nose from pet germ", "language": "en", "text": "It's hard to regard Ellie as a menace.\n\nInterested in Animals? Add Animals as an interest to stay up to date on the latest Animals news, video, and analysis from ABC News. Add Interest\n\nWhen Greg Manteufel is frustrated or feeling down, she sits by him. At night, she sleeps under his covers. At dinner, she's there next to him, knowing he'll throw something her way. She belies the stereotype of the vicious pit bull.\n\n\"We love her like she's our daughter,\" he said of the dog.\n\nAnd yet, Ellie may be the reason Manteufel, 49, nearly died.\n\nGravely ill, he lost parts of his arms and legs, as well as the skin of his nose and part of his upper lip. The cause was capnocytophaga (cap-noh-seye-TOE'-fah-gah), a germ from Ellie's mouth or from another dog he encountered.\n\nCapnocytophaga is commonly found in the saliva of cats and dogs and almost never leads to people getting sick, unless the person has a compromised immune system. But Manteufel was perfectly healthy. In fact, he doesn't think he'd ever used his health insurance before he fell ill.\n\nThe case is extremely rare and doctors at his hospital, Froedtert & the Medical College of Wisconsin, had no explanation for why he got so sick. But over the last 10 years there have been at least five other healthy people who have had severe reactions to the germ. A team of researchers connected with Harvard Medical School has developed a theory on why — a gene change in all the victims.\n\nAnd their finding means doctors can't rule out the capnocytophaga bacteria could strike Manteufel and other victims again.\n\n———\n\nGreg Manteufel thought he was getting the flu in June of 2018. He had a fever, vomiting and diarrhea. But when he started getting confused, his family took him to the hospital.\n\nDoctors did blood cultures and found capnocytophaga, which caused sepsis, a severe blood infection that led to his blood pressure dropping and many of his organs shutting down.\n\n\"Do what you have to, to keep me alive,\" he told the doctors.\n\nHe had so much to live for — foremost, his wife of 16 years, Dawn, and 26-year-old son, Mike. He was just starting to get really good at his day job, painting houses. He cherished his Harley Davidson Electra Glide. He was in the middle of fixing up his '66 El Camino. And of course there was Ellie, the pup.\n\nAnd so he persisted, through more than 20 surgeries, including amputations of his left and right arms just below the elbow, and legs through the middle of the knee.\n\nHis wife and son stayed optimistic, because he was.\n\n\"Greg said he didn't come this far to lay down and let this beat him,\" Dawn Manteufel said.\n\nHe was out of the in-patient rehab unit in about two weeks, learning to move from his wheelchair to the bed, toilet and car. The usual stay is three to four weeks, said Dr. David Del Toro, medical director for the inpatient rehab unit at Froedtert.\n\nManteufel made similar quick advances using his arm prosthetics and leg prosthetics.\n\n\"He does not seem like any other patient I've met before,\" Del Toro said. \"He's just, you know, full speed ahead.\"\n\nMeanwhile, researchers at Brigham and Women's Hospital in Boston, connected to Harvard Medical School, as well as Dana-Farber Cancer Institute and Beth Israel Deaconess Medical Center had been investigating cases like his.\n\nThe team has done genetic testing on five otherwise healthy people who suffered capnocytophaga infections to see if they could find anything in common. They discovered all had a gene connected to the immune system that was working differently — a genetic variant.\n\n\"It was a really thrilling moment,\" said Elizabeth Fieg, a genetic counselor at Brigham and Women's Hospital. \"The stakes are so high with these cases and the patients have gone through so much.\"\n\nThey believe it makes those people more susceptible to developing severe medical problems from capnocytophaga. But they are also trying to determine if there are other risk factors.\n\nOf the five in the study, three survived with amputations and two did not. Fieg hopes their research can determine why some did not survive.\n\nShe also hopes if their theory is confirmed, it will help diagnose cases faster, and perhaps save lives and limbs.\n\nThat's why Greg Manteufel jumped at the chance to take part when he was approached in August.\n\nResearchers need to gather more evidence, but hope to publish their study in the next year to 18 months.\n\n———\n\nManteufel's life now includes frequent occupational therapy appointments to perfect his use of arm prosthetics — the kind with metal moveable hooks at the end. He's using a fork regularly and he's now working on picking up the TV remote, opening doorknobs, cutting vegetables and doing the dishes.\n\nHe's using shortened leg prosthetics, called stubbies, to get his body conditioned to eventually use to full-sized ones. Those are expected to arrive any day.\n\nPlastic surgeons plan another surgery to perfect his nose. They've already moved skin from his forehead there. It looks oversized now, but it will eventually fit in with the rest of his face.\n\nHe plans to get his car revamped so he can drive with prosthetics. He wants to get a special pole so he can go fishing again. He is even considering going back to work painting.\n\nHe's also become less quiet and a lot more outgoing. \"Now everybody I see wants to hear something or talk to me. I tell them a 15-minute story about what happened. They probably want me to leave, you know,\" he said, chuckling.\n\nEllie's often by his side.\n\n\"She loves kids. She loves puppies. Other dogs,\" Manteufel said.\n\nAs harmless as she seems, she may have capnocytophaga germ.\n\nThe results of Manteufel's genetic tests are expected in three to four months. Fieg said people with the gene variant are at increased risk for recurrent capnocytophaga or other infections in the future.\n\nWhile Manteufel doesn't like the sound of that, he said Ellie's accidentally scratched him since he's been home and even licked his mouth. He's been fine.\n\nAnd even if he does have the gene variant, he said, it changes nothing.\n\n\"We didn't even bother testing her,\" said Manteufel. \"We weren't going to get rid of her if it was her that caused it anyway.\"\n\n\"We just love her to death.\"\n\n———\n\nThis version of the story corrects to say Harley Davidson Electra Glide motorcycle instead of Electric Glide.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Health/WireAP_2487f378c67947daba93a51085a089ff_16x9_992.jpg"}