{"pub": "metro", "url": "https://metro.co.uk/2019/10/28/parents-are-outraged-by-beyond-inappropriate-bride-costume-for-girls-10997666", "downloaded_at": "2019-10-29 00:20:54.780421+00:00", "title": "Parents are outraged by ‘beyond inappropriate’ bride costume for girls", "language": "en", "text": "Child bride Halloween costume criticised by parents (Picture: KMart)\n\nChildren’s clothing, toys, and books have been slammed in the past for reinforcing gender tropes that may be limited.\n\nAs kids grow up consuming these messages, parents have voiced their concerns over their children internalising the ideas.\n\nAnd with Halloween fast approaching, some mums and dads are not happy with some of the costumes available.\n\nOne bride costume for girls has recently caught the attention of a woman who called it ‘beyond inappropriate’.\n\nThe white dress that comes with a veil is aimed at little girls aged between four and six was being sold at a Kmart store in Australia for $6 (£3.19).\n\nBut the woman, Shannon B, felt it was insensitive considering ’12 million children (girls as young as 6 years old — the same size as this “costume”) are sold or married off by their family without their consent,’ she wrote.\n\nSo she started a Change.org petition which received 507 supporters.\n\nAdvertisement\n\nAdvertisement\n\nDetails of the petition were shared on Twitter where users were polarised. Responding to the backlash, Kmart then decided to pull the costume from its shelves.\n\nAsk Kmart to remove child bride costume from its shelves – Sign the Petition! https://t.co/2V4raCTcp3 via @ChangeAUS — David Hill (@davidmhill) October 22, 2019\n\nOn the Change.org petition, Sharon wrote: ‘One-third of girls in the developing world are married before the age of 18 and 1 in 9 are married before the age of 15.\n\n‘Child marriage means child abuse and torture in its worst forms: pedophilia, child slavery, child sex trafficking. Kmart — take this child bride costume off your shelves.’\n\nIn response, Kmart wrote: ‘Kmart Australia regrets the decision to range the bride costume. It was not intended to cause offense and we sincerely apologize. We have made the decision to withdraw this product.’\n\nBut some people on social media didn’t see the fuss. One person wrote: ‘What is wrong with a little girl wanting to dress up as a bride? Is it wrong for a girl to aspire to be a bride? I was under the impression that girls could be anything they wanted to be.’\n\nAnother echoed the thoughts saying: ‘It is sad those things happen, but my daughters used to dress up and pretend to get married all the time. There’s NOTHING wrong with it.’\n\nAdvertisement\n\nAdvertisement\n\nSome did agree with Shannon, saying: ‘I agree on the recall for a child bride costume. It is not acceptable. How sad it is that society has become so desensitized that they can’t see the forest for the trees.’\n\nWhat are your thoughts?\n\nMORE: ‘Sexist’ clothing line told boys to ‘ride bikes’ and girls to ‘pick flowers’\n\nMORE: Outrage at ‘sexist’ clothing line with rainbows for girls and trains for boys\n\nMORE: People aren’t impressed by these ‘sexist’ cards that say flowers are for girls and sandwiches are for boys\n\nAdvertisement Advertisement", "description": "The white dress that comes with a veil is aimed at little girls aged between four and six was being sold at Kmart Australia for $6 (£3.19).", "authors": ["Faima Bakar"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_93239824_1572277937.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-28"}