{"pub": "npr", "title": "Meet The Residents Of A Norwegian Island Who Want To Kill Time — Literally", "url": "https://npr.org/2019/06/23/735237020/meet-the-residents-of-a-norwegian-island-who-want-to-kill-time-literally", "language": "en", "published_at": "2019-06-23", "downloaded_at": "2019-09-02 07:16:44.022166+00:00", "text": "Meet The Residents Of A Norwegian Island Who Want To Kill Time — Literally\n\nEnlarge this image toggle caption Joe Raedle/Getty Images Joe Raedle/Getty Images\n\nEditor's note: We got duped. After this story was published, a press official for the Embassy of Norway in Washington, D.C. contacted NPR to let us know that the campaign by residents on the Norwegian island of Sommaroy to do away with timekeeping was \"a well-planned PR stunt aimed at getting more tourists to northern Norway.\" The stunt \"certainly fooled me,\" said the official, Jon-Åge Øyslebø. For his part, Kjell Ove Hveding, an organizer of the effort, told The New York Times, \"It is not a joke, it is something that we seriously want.\"\n\nIt's midnight in Sommaroy, but the sun is still shining on this Norwegian island. The clock strikes 12, but the island's residents are playing, working, fishing and socializing. Nighttime commands sleep, but Sommaroy doesn't want to listen.\n\nIf the 350 residents of Sommaroy get their way, the clocks will stop ticking and the alarms will cease their noise. A campaign to do away with timekeeping on the island has gained momentum as Norway's parliament considers the island's petition.\n\n\"Why do we need time and clocks when there is no night?\" reads the campaign's Facebook page. During a 70-day period leading up to and following the summer solstice, from May 18 to July 26, darkness never falls across the sky.\n\n\"There's always less wind at night here, perfect to paint the garage. Fishermen are out half the night, after all. If we get tired, we're fit to go after a nap on the sofa. Why don't we just sign out of time, throw away all the clocks and forget about them? Life would be so much easier,\" the Facebook post continues.\n\nScience Time Is Constant, But How We Perceive It Varies Time Is Constant, But How We Perceive It Varies Listen · 29:59 29:59\n\nKjell Ove Hveding spearheaded the No Time campaign and presented his petition to a member of parliament on June 13. During the endless summer days, islanders meet up at all hours and the conventions of time are meaningless, Hveding says.\n\nHe wants to formally eradicate time and boost residents' flexibility.\n\n\"When people in the government of Norway are talking about wintertime and summertime and moving the clock, we have a good laugh up here,\" Hveding says.\n\nSommaroy's main income comes from tourism and fishing. Becoming the world's first time-free zone would certainly provide a boon to the island's tourism allure.\n\nCurrently, when visitors cross the bridge into Sommaroy, they see a railing covered in wristwatches. The island is sending a clear message to tourists as it petitions to make \"time a thing of the past.\"\n\nUnburdened by darkness, Sommaroy has adapted to create new social conventions.\n\n\"Now, we make signs for every house in the village,\" Hveding says. \"Whenever you put out the sign, all people who see the sign can knock on your door and say, 'I see the sign. I know that we are most welcome.' And that is the way of living, and we love it.\"\n\nBecause Sommaroy spends November to January in darkness, residents sleep less in the summer and want to spend their newfound daylight time accordingly.\n\n\"We want to spend more time just being alive,\" said Hveding on behalf of the island's residents.\n\nStill, Hveding acknowledges that Sommaroy's situation is unique.\n\n\"Here, you don't need to tell the kids to come in before it gets dark, because if you do that, you will not see them before August,\" Hveding says. \"That is a funny way of living.\"\n\nJosh Axelrod is NPR's Digital Content intern.\n\nNPR's Peter Breslow and Barbara Campbell produced and edited this story for broadcast.", "description": "Can time become a thing of the past? An island that sits north of the Arctic Circle enjoys 70 days of unending sunlight, and its residents argue that time is meaningless there.", "authors": ["Josh Axelrod"], "top_image": "https://media.npr.org/assets/img/2019/06/23/gettyimages-77656601_wide-fcb557800b8e841fb543ad1f1aaa02074608e22c.jpg?s=1400"}