{"pub": "townhall", "url": "https://townhall.com/columnists/derekhunter/2019/09/03/a-bipartisan-bill-to-fight-socialized-medicine-n2552503", "downloaded_at": "2019-09-03 23:40:43.498998+00:00", "title": "A Bipartisan Bill To Fight Socialized Medicine", "language": "en", "published_at": "2019-09-03", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nEvery progressive Democrat running for their party’s nomination for president has endorsed some form of socialized medicine, be it “Medicare for All” or some other euphemism for essentially the same thing. There’s little question that, should they take the White House and the Senate, either next year or at any point in the future, they will blow out any and all Senate rules and impose their will on an unsuspecting public. That’s why it’s important for any Member of Congress to act now, to offer and implement alternatives. The more free market principles and individual liberty put in place before that happens, the harder it will be to obtain the majority needed to rip them away.\n\nOne idea that is gaining traction is Heath Savings Accounts for seniors enrolled in Medicare.\n\nHeath Care Savings Accounts are a great innovation. They came into being in 2003, allowing Americans to put aside money tax-free to pay for almost any out-of-pocket medical expenses. The best feature was any unspent money was rolled over every year. The interest-bearing account could grow over time. Over a person’s working life, that money could really add up.\n\nBut government, as is always the case, found a way to limit innovation.\n\nAt age 65, any leftover money would go into the pockets of seniors tax free. But what if seniors who enroll in Medicare at 65 want to keep their Health Savings Accounts, and if they’re still working, want to both enroll in Medicare and keep putting money aside for out-of-pocket medical expenses?\n\nUnder current law, they can’t. A Health Savings Account is “cashed out” at age 65. But not everyone retires at age 65. And Medicare comes with significant out-of-pocket costs as well.\n\nSo why not extend them for a person’s entire life, extending the same tax benefits and savings to our seniors?\n\nThat's exactly what the “Health Savings for Seniors Act of 2019” seeks to do.\n\nIt’s an actual bipartisan piece of legislation, introduced by Republican Congressman Jason Smith of Missouri and Democratic Congressman Ami Bera of California.\n\nKevin McKechnie, executive director of the American Bankers Association's Health Savings Accounts Council, rightly pointed out in The Hill, “Families nationwide are struggling with high deductibles and gaps in coverage, and seniors face these challenges and more under Medicare. Deductibles can be close to $2,000 combined, and other out-of-pocket costs in Medicare are often not a flat co-pay but a percentage of the charges, which makes it difficult to budget and plan ahead.”\n\nAllowing Health Savings Accounts to continue into Medicare age can help significantly, if not completely, alleviate that uncertainly for millions of seniors and their families. Incentivizing people to plan ahead for the unexpected means less stress when it happens, and as much as we’d all like to pretend it won’t happen, no one lives forever.\n\nThe vast majority of Medicare’s costs are spent on a relatively small percentage of patients. End of life care is expensive. While politicians promise everything under the sun, there’s no way around this reality. If people were empowered to save their whole lives, not just until Medicare age, for medical expenses, families would be in a significantly better position to handle whatever comes their way.\n\nEnacting something like the “Heath Savings for Seniors Act” would reduce financial strain on families, as would allowing people to keep contributing to their accounts past Medicare eligibility age. No one wants to be a burden on their families, financially or emotionally. The piece of mind this would bring is worth it alone.\n\nMore importantly, as people are allowed to be more responsible for the spending of their health care dollars in the future, the more they will become savvy customers, saving more money by asking about costs beforehand.\n\nAll this individual responsibility and empowerment is the opposite of what progressives want. But when people get it, and use it, they like it. That makes them less likely to embrace policies and politicians who want to take it away from them.\n\nThis bill would empower individuals and give people options, rather than the one-size-fits-all solutions that will completely eliminate private health insurance. This bill will face an uphill fight in the House of Representatives, which is why Republicans and moderate Democrats should be extolling its virtues every chance they get.\n\nThe best and only real antidote to socialism is individual liberty. Washington has steadily been inching the health care system away from that concept for decades. If those who embrace liberty don’t get their act together and fight for the concept in health care now, it will be too late soon. Then it’s anyone’s guess which area of our society they’ll set their sights on next.\n\nDerek is the host of a free daily podcast (subscribe!) and author of the book, Outrage, INC., which exposes how liberals use fear and hatred to manipulate the masses.", "description": "Every progressive Democrat running for their party’s nomination for president .09/03/2019 19:36:54PM EST.", "authors": ["Derek Hunter", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/253/cbc02ebd-039e-4631-b996-478a8e8b3632.jpg"}