{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/15/england-players-stronger-sofia-experience-gareth-southgate", "downloaded_at": "2019-10-15 23:05:52.757510+00:00", "title": "Gareth Southgate and England take strength from odious Sofia experience | David Hytner", "language": "en", "text": "Jadon Sancho walked towards the tunnel of the Vasil Levski Stadium in the bitter and slightly surreal aftermath of England’s Euro 2020 qualifying win over Bulgaria – a match in which the football had seemed almost incidental. Ten yards in front of him were two of his black teammates, Tyrone Mings and Marcus Rashford, and a group of Bulgarian children were shouting for their shirts.\n\nMings and Rashford had been targeted for abhorrent racial abuse from a section of the home support, with the former saying he first heard the monkey chants when he went out for the warm-up, and they kept on walking, eyes fixed on the exit door a little way away. That is when they heard the noises, yet another round of them, from the so-called grown-ups in the vicinity. It is inconceivable Sancho did not hear them.\n\nPaltry fines and spineless words helped create the scenes in Sofia | Barney Ronay Read more\n\nA couple of steps later, it was the turn of Sancho . “Jadon, Jadon,” the local kids yelled. They wanted his shirt. Sancho, who had come on as a 73rd-minute substitute, sized up the situation, the most jarring juxtaposition of innocence and ignorance, and made the decision. He peeled off his shirt, strolled over and handed it to one of the youngsters.\n\nIt was a simple gesture, one that recognised the joy a footballer can bring to a child, but it also chimed with one of the themes of a bleak occasion from an England perspective: defiance in the face of disgusting provocation; collective strength in adversity.\n\nIt was a night of shame for Bulgaria, whose football union has now been charged over the racist behaviour of the country’s fans – when the right-minded majority in the wonderful city of Sofia cringed at the dunderheads. They included the journalists who tutted and scoffed during Greg Clarke’s post-match press conference, when the Football Association chairman outlined his outrage at what he had seen and heard. “Exaggeration,” one of them shouted.\n\nThe counterpoint would come from Ivelin Popov, the Bulgaria captain, who had remonstrated with home fans at half-time, urging them to calm down. “I don’t want it to be like this, it’s not good for us, the federation and our country,” Popov said. “What happened was terrible. It must stop. It doesn’t matter your colour, we are all the same, we are one very big family in football. Only if we are together can we stop these bad things.”\n\nBefore the game it had not been difficult to spot the group of about 50 trouble-makers. They were dressed almost entirely in black and grouped together in a well-stewarded section by one of the corner flags. They were ejected just before half-time. Why let them in at all? That said, there were pockets of the similarly unenlightened in other areas.\n\nEngland’s black players had heard monkey taunts on their previous visit to this stadium – for a European Championship qualifier in 2011 – and the punishment from Uefa was a £34,230 fine. Those sort of measures simply have not worked and nor, on Monday’s evidence, have partial stadium closures. The stadium had 5,000 seats cordoned off for England’s visit because of the actions of their supporters in the June qualifiers against the Czech Republic and Kosovo.\n\nGareth Southgate had noted in the aftermath of last Friday’s shock defeat against the Czechs in Prague that his squad faced “an interesting few days because we have not had a result or a performance like that”. Many of the younger players had not experienced the backlash which always accompanies an England misstep. It is ferocious and the first idea, according to Southgate, had been to “repair the confidence of the whole group”. That was hard enough.\n\nJordan Henderson says England wanted to make racist fans ‘suffer’ Read more\n\nIn addition, the manager and the squad had to prepare for the possibility of racial abuse because it had happened to them in Montenegro last March. Back then they had not been properly briefed; they were not abreast of Uefa’s protocols. This time they were and it meant carrying further emotional baggage.\n\nThe weight on Southgate has been immense and the one-time rather reluctant accepter of the England manager’s job has added a fresh layer to his responsibilities; he has become one of the country’s most high-profile ambassadors. “The job is a remarkable one in terms of the breadth of what you have to deal with,” he said. “I can’t think of too much that’s like it. We’ve had to go through an incredible amount in 72 hours – football, non-football, everything else.”\n\nAs usual, his delivery has been note perfect. He did not want to get into what he thought Uefa ought to do in order to combat racism more effectively but he did accept it had to try something different. “It was as big an operation as there has been in Sofia and the sad reality is that we weren’t able to stop incidents happening,” Southgate said. “Something clearly within the investigation has got to take that next step.”\n\nSouthgate admitted that with 10 minutes of the first half to play and the monkey chants continuing despite an appeal over the PA for them to stop, he was “not confident we would be finishing the game”. There would be two stoppages in play, as England drew attention to the racism but no walk-off, no abandonment. Southgate and his players made their statements by staying on and through the quality of their football and their dignity.\n\n“The players’ response, their focus, the way they played though the stoppages and back into it, were remarkable,” Southgate said. “Bizarrely, I think they’ve gained strength from the experience.”", "description": "England’s firm but dignified handling of the shameful scenes in Sofia was character-building in the extreme", "authors": ["David Hytner"], "top_image": "https://i.guim.co.uk/img/media/977a0143586f65fae156eed1f1dee1b757b8f035/0_174_4407_2644/master/4407.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=beeece9de398f928302f59d4356312bb", "published_at": "2019-10-15"}