{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7604563/Brynmawr-crash-killed-Sophie-Brimble-injured-boyfriend-Jay-Bayliss-raced-80mph-30mph.html", "downloaded_at": "2019-10-23 12:28:03.058487+00:00", "title": "Brynmawr crash killed Sophie Brimble injured boyfriend Jay Bayliss after he raced 80mph in 30mph", "language": "en", "text": "Neil Brooks (pictured outside Cardiff Crown Court), 49, is accused of causing death by dangerous driving and serious injury by dangerous driving in relation to the deaths of Sophie Brimble and Jay Bayliss\n\nA 20-year-old woman was killed in a horror crash after her boyfriend raced another driver at 80mph through a residential 30mph zone, a court heard.\n\nSophie Brimble was in the front passenger seat of her boyfriend Jay Bayliss's Volkswagen Polo when it smashed into a lamppost on July 26 2017.\n\nCardiff Crown Court heard Mr Bayliss entered into an 'impromptu' street chase with Neil Brooks, 49, between Ebbw Vale and Brynmawr, South Wales.\n\nThe court was told the two drivers reached speeds of up to 80mph before Mr Bayliss's vehicle crashed, seriously injuring him and killing Miss Brimble.\n\nThe jury heard Mr Bayliss was so badly injured he will 'probably never be fit to face trial'.\n\nBrooks, of Beaufort, Ebbw Vales, denies causing death and serious injury by dangerous driving.\n\nJurors were told the crash happened at around 12.20am on July 26 2017.\n\nProsecutors allege Mr Bayliss and Mr Brooks are both responsible for the death of Miss Brimble, but Mr Bayliss is unfit to appear before a court.\n\nPrior to the crash, both men had been driving along the A4047, King Street, in the direction of Brynmawr.\n\nThe road is a single carriageway, with one lane in each direction, linking Ebbw Vale to Brynmawr, the court was told.\n\nProsecuting, Matthew Cobbe said: 'The speed limit along the particular section of road is 30mph.\n\n'The section of A4047 is known as Beaufort Hill, turning into King Street, as it continues towards Brynmawr.\n\nSophie Brimble was in the front passenger seat of her boyfriend Jay Bayliss's Volkswagen Polo when it smashed into a lamppost on July 26 2017. She died at the scene\n\n'It's the prosecution case that Mr Bayliss was travelling way above the speed limit in the lead up to the collision.\n\n'You will see that he had been driving at excessive speed through a residential area in excess of 80mph.'\n\nMr Bayliss eventually lost control of the vehicle, causing his car to rotate and slide towards a lamppost, jurors were told.\n\nMr Cobbe said the result of this led to a 'catastrophe', causing Miss Brimble to die at the scene as a result of her injuries.\n\n'It is the prosecution case that Mr Bayliss is not solely responsible for the collision,' added Mr Cobbe.\n\nHe continued: 'It's the prosecution case that Mr Bayliss was driving at excessive speed because he had got himself into an impromptu race with the defendant. It started about half a mile before the point of the collision.'\n\nAs he drove, Brooks is said to have found himself behind two cars - the car at the front he recognised as the vehicle belonging to Mr Bayliss and the car directly in front of him belonged to a man named Gareth Mapstone.\n\nThe route from Ebbw Vale took them towards a roundabout before going up a road known locally as 'the incline' that leads on to the A4047.\n\nMr Cobbe said: 'It's the prosecution case that aggressive driving by both Mr Bayliss and the defendant as they made their way up the incline deteriorated into the impromptu race that in turn caused the catastrophe.\n\n'They both drove at high speed along that road. You will hear that they pushed their vehicles hard through this residential area, both of them reaching speeds of 80mph.'\n\nMr Cobbe explained the race took them to a section of residential housing that ends with a Murco garage on the left hand side, nearby where the defendant's girlfriend lives.\n\nIt is alleged Brooks had slowed down by the time he had reached the Murco garage, but he was still travelling close to 60mph in what was still a 30mph zone.\n\nBy this point Mr Cobbe said 'the damage had been done'.\n\n'He had played an important part in that race along the A4047,' added Mr Cobbe.\n\n'Dangerously driving well above the speed limit, encouraging Mr Bayliss to do the same - the one driver was by his actions egging the other on.\n\n'It's the race that led to the collision that in turn led to the death of Ms Brimble.\n\n'It's the prosecution case that they share responsibility for her death; it's the prosecution case that they both caused her death by dangerous driving.\n\n'Mr Bayliss suffered life changing injuries as a result of the collision. He's not fit to attend court and it's likely he never will be.'\n\nGareth Mapstone and his passenger were said to be friends with Mr Bayliss.\n\nThe trial continues.", "description": "Sophie Brimble was in the front passenger seat of her boyfriend Jay Bayliss's Volkswagen Polo when it smashed into a lamppost on July 26 2017. She died at the scene.", "authors": ["Lara Keay For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/12/20080394-0-image-a-121_1571830295023.jpg", "published_at": "2019-10-23"}