{"pub": "washingtonpost", "url": "https://washingtonpost.com/us-policy/2019/10/17/latest-failed-senate-vote-sets-up-big-fight-over-border-wall-budget", "downloaded_at": "2019-10-18 01:11:47.588075+00:00", "title": "Failed Senate vote sets up big fight over border wall, budget", "language": "en", "text": "The budget fight is expected to get even messier. Trump is not interested in signing other domestic spending bills until there is agreement on the border wall, according to a senior administration official who spoke on the condition of anonymity to discuss confidential deliberations. Funding for many federal agencies expires Nov. 21, and an impasse would lead to a sizable government shutdown, bigger in scope than what happened less than one year ago.\n\nAD\n\nAD\n\nThe official said Democrats essentially have two options: Give the president the wall money he has asked for, or the president will again use executive authority to get the funds from other accounts. The official said that the White House priority in budget negotiations is to ensure the president can complete the promised border wall, and that the president is committed to having the resources available in the 2020 budget year to do so. The official described this goal as a “red line.” Democrats, though, have described the White House’s demand as a non-starter.\n\nTrump earlier this year declared a “national emergency” on the southern border to unilaterally move several billions of dollars from the Pentagon and instead use it to finance barriers along the U.S.-Mexico border. He took the step after Congress refused to give him the money he wanted for his wall. That dispute led to last winter’s record-long 35-day partial government shutdown.\n\nThe president vowed during his 2016 campaign to build a wall along the Mexico border, though he said at the time the wall would be financed by Mexico. Since taking office, he has pivoted to seeking U.S. taxpayer money to fund its construction.\n\nAD\n\nAD\n\nNow, with government funding for many agencies set to expire Nov. 21, budget talks between Republicans and Democrats are stalled over the same issue once again. Trump has demanded an additional $5 billion for more wall construction, which Democrats refuse to grant. Democrats have decried the wall as an ineffective vanity project for the president. But for Trump, showing progress on the wall is an important campaign promise to fulfill as he seeks reelection, and he has said it is necessary to prevent migrants from coming across the southern border.\n\nWhite House officials have said that if lawmakers don’t appropriate the funds that Trump has demanded for the wall, they will circumvent Congress again and move money away from the military budget. Lawmakers from both parties say that until the White House and congressional leaders can reach agreement on the key issue of the wall, no real progress can be made on a broader budget deal that is needed to fund most parts of the government through the 2020 budget year, which began Oct. 1.\n\n“That is the linchpin,” Senate Appropriations Committee Chairman Richard C. Shelby (R-Ala.) said of the border wall. Trump is “very interested in the wall, very adamant about it.”\n\nAD\n\nAD\n\nShelby said spending negotiations with the House are in a “prolonged slump.” But the necessary high-level negotiations between the White House and congressional leaders have yet to occur. And the general chaos that has overtaken the Capitol over impeachment and Trump’s Syria policy has injected additional uncertainty into the budget negotiations. Combined, the factors make it likely that Congress will resort to passing another short-term spending bill after the current one expires Nov. 21 to at least keep the government from shutting down for several more weeks.\n\n“We are not going to fund the wall,” said House Appropriations Committee Chairwoman Nita M. Lowey (D-N.Y.). But Lowey held out hope for compromise. “Let me just say that the appropriations process can do extraordinary things,” she said.\n\nThus far, with the fiscal year underway, the Senate has not passed even one of the 12 annual spending bills that must become law to fund the portions of the government whose budget Congress controls, such as the Pentagon and other federal agencies. Senate Majority Leader Mitch McConnell (R-Ky.) announced Thursday that some bills will come up for votes next week, and he called on Democrats to “make good on all the talk about bipartisanship and support them\" — but that still would leave the wall issue no closer to resolution.\n\nAD\n\nAD\n\nOn the ground, construction on the wall is not progressing as quickly as Trump would like, and last week a federal court in El Paso ruled against his “national emergency” approach. There were 71 miles of new replacement barrier completed as of last week; Trump has promised 500 miles by the end of next year, a goal that may not be realistic.\n\nWhite House officials say Trump’s emergency declaration allowed him to take $3.6 billion from the Pentagon’s budget to use on the barriers, in addition to $1.375 billion Congress appropriated for the project in 2019. Along with billions of dollars from other Pentagon and Treasury accounts that did not require an emergency declaration, that added up to a total of about $8.1 billion for the wall for the 2019 fiscal year.\n\nTrump’s decision to take money from the military construction budget angered lawmakers of both parties, partly because it overrode Congress’ constitutional authority over spending, while resulting in the cancellation or delay of some important military construction projects across the country and internationally. That led the House and Senate to twice pass resolutions to overturn the national emergency declaration, both of which Trump vetoed; an earlier veto override vote failed in the House in March. But the White House has said that it is eyeing an additional $3.6 billion from the military construction budget in 2020, if Congress does not give the president the money he wants.\n\nAD", "description": "Amid the chaos of impeachment and President Trump's Syria withdrawal, another crisis looms: A government shutdown a month from now unless lawmakers and Trump agree on a new spending deal. Once again Trump's border wall is the sticking point as the president pushes for billions more and Democrats say they will refuse to pay for his wall.", "authors": ["Erica Werner", "Congressional Reporter Focusing On Economic Policy"], "top_image": "https://www.washingtonpost.com/resizer/Pq5UfxNtUHDen3TX1EGgjE6GLN4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KVOM7AXK5YI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-17"}