{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/philadelphia-eagles-fans-and-the-thrill-of-defeat.html", "downloaded_at": "2019-09-25 04:35:05.035958+00:00", "title": "The Thrill of Defeat", "language": "en", "text": "A disappointed Philadelphia Eagles fan. Photo: Screenshot via Fox\n\nWhen history tells the ugly story of this particular era of American history, I do hope that this is the GIF that is chosen to best illustrate what it was like to be alive right now:\n\nWhen someone brings over cheesesteaks but you really wanted roast pork pic.twitter.com/BEiB3F4tEy — Deadspin (@Deadspin) September 22, 2019\n\nIf you’re reading lips you can make out what he’s saying — “What are you looking at? BOOOOOOO! What the fuck are you looking at?” — but honestly, the sentiment transcends mere words? That face is what it feels like to log on in the year 2019: Everyone is constantly doing that, all the time, about everything. And they’re not even necessarily wrong to.\n\nThe gentleman in the clip is a Philadelphia Eagles fan, disgusted by something that happened during the Iggles’ 27-24 loss to the Detroit Lions. It is perhaps all you need to know about Philadelphia Eagles fans that our sleeveless protagonist is not a bouncer at a dance club, nor a butcher at your local Wegman’s. It is Eric Furda, who, when he’s not venting his spleen on national television at sporting events, is in fact the dean of admissions at the University of Pennsylvania. Furda, Philly through and true, made no apology for his outburst, writing on Twitter: “I will not lose my passion for Philadelphia and Penn sports!” Jake Tapper, not unreasonably, argued that Furda should get the key to the city.\n\nWhat I found particularly amusing about Furda’s rage is that, well, Furda is a Philadelphia Eagles fan. And while Philadelphia fans are notorious for their well-boiled fury at their sports teams — also on Sunday, a man who saved a child’s life by catching him being thrown from a burning building made sure his heroics were documented with a dig at the Eagles — one would think they would be in somewhat of a better mood. That’s to say: Didn’t the Eagles just win the Super Bowl?\n\nThey did! It has been 18 months since the Eagles shocked the sports world by beating the hated Tom Brady and the Patriots and winning the franchise’s first ever Super Bowl. The win, which released Eagles fan from a downright barbaric four-plus decades of their favorite team torturing them, unleashed a sports celebration the likes of which we have never seen and, with any luck, will never see again. Remember, the city of Philadelphia actually pre-greased light poles in the city to make sure no one climbed them … and people did anyway! One Eagles fan ate horse manure at the victory parade. And let us never forget what they did to the poor Philadelphia Ritz-Carlton awning.\n\nThat was as delirious as I have ever seen a sports fan base, the culmination of years of suffering finally being released. And here we are 18 months later … and they’re angrier than they ever were in the first place. It is so hard to keep sports fans happy.\n\nPhiladelphia sports fans are perhaps not the best example, you say? Well, the Red Sox just fired their general manager a year after they won the World Series. The Cubs won the World Series — the Cubs won the World Series! — less than three years ago after 108 years in the wilderness, an achievement many considered impossible and one that’s almost certainly the biggest sports story of the decade. But after they were swept out of the playoff chase this weekend by their hated rivals in St. Louis, they are about to clean house entirely, firing their once-lovable manager Joe Maddon and, perhaps, team architect Theo Epstein. And if the Patriots don’t win the Super Bowl again this year, getting Tom Brady his seventh championship ring, their fans are going to be out for blood in every comment section on this planet. Come to think of it: Boston sports fans have celebrated 12 championships this century. How happy do those people seem to you?\n\nFormer sportswriter Bill Simmons once wrote about sports fans having a five-year grace period after their team won a championship, five years where they cannot complain about anything because their team won a title and winning a title is incredible. (Trust me.) But that five-year grace period seems helplessly outdated at this point, and not just in Boston. When sports fans spend years in the wilderness, begging their team to justify their lifelong fandom with a championship, they tell themselves that one title is all they need, that one is enough. But that’s of course not how human consumption works. George Carlin was once asked what it felt like to do cocaine. “It makes you feel like doing more cocaine,” he said. No matter how much winning you get, you always want more.\n\nBeing a sports fan has always been an irrational concept. You are rooting, out of nothing more concrete than geographic happenstance or familial nostalgia, for a multi-billion dollar business (usually owned by legacy trust-fund kids or a faceless, bloodless corporation) that has no connection to you at all other than its desire to separate you from your money. You would never be friends with any of the players you cheer for — you wouldn’t like them, and they wouldn’t like you — and you can make a pretty strong argument that spending time worrying about sports in this time of global peril is irresponsible and maybe immoral. But we do it because what a sports team is is different than what it means to fans. My team winning makes me and the people I care about who also cheer for them happy, and that is all that matters. You deal with all the rest of the junk because the highs are so high.\n\nBut the highs don’t seem as high these days, do they? If Eagles fans — the most pained of all NFL fans — are going from climbing up greased light poles at their moment of highest joy to having rage strokes on national television in 17 months flat, well then shit, what’s the point of all of this? Cubs fans spent 108 years waiting for a championship and couldn’t even enjoy it for three whole years until they were running the bums out of town. And this is the return on investment you get when your investment pays off! This is what happens when being a sports fans works. Maybe the idea of a grace period was always a fallacy. After all, who watches sports for grace? It turns out that the thrill of victory is never much of a match for the agony of defeat. We want sports to make us feel happy. But mostly we want them to make us feel something. In a pinch, rage will have to do.", "description": "We want sports to make us feel happy. But mostly we want them to make us feel something. In a pinch, rage will have to do. Like one Philadelphia Eagles fan, who was disgusted by something during the Iggles’ 27-24 loss to the Detroit Lions on Sunday.", "authors": ["Will Leitch"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/24/24-eric-furda-eagles-fan.w1200.h630.jpg", "published_at": "2019-09-24"}