{"pub": "cnn", "url": "https://bleacherreport.com/articles/2856164-joe-maddon-reportedly-finalizing-3-year-contract-to-be-next-angels-manager?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-10-16 20:43:38.993074+00:00", "title": "Ex-Cubs Manager Joe Maddon Hired by Angels on Reported 3-Year Contract", "language": "en", "text": "Scott Kane/Associated Press\n\nFor the third consecutive year, the Los Angeles Angels will open the year with a different manager.\n\nOn Wednesday, the Angels announced they reached a deal with Joe Maddon to become the manager.\n\n\"We are thrilled that Joe is coming back home and bringing an exciting brand of baseball to our fans,\" general manager Billy Eppler said, per USA Today's Bob Nightengale. \"We believe Joe will be a great asset for our club and look forward to him leading the team to another World Series Championship.\"\n\nWhen Mike Scioscia's 19-year run with the Angels ended following the 2018 season, Brad Ausmus took over the team.\n\nThings never came together under Ausmus, due in no small part to injuries. Andrelton Simmons, Shohei Ohtani, Mike Trout and Albert Pujols all missed at least 28 games. The starting rotation didn't have one pitcher reach 20 starts. Trevor Cahill was the only hurler to throw more than 100 innings.\n\nBeyond the injuries, the Angels also endured a tragedy in 2019 when Tyler Skaggs died on July 1 at age 27 when he was found unresponsive in the team's hotel before a game against the Texas Rangers.\n\nLos Angeles finished the year in fourth place in the American League West at 72-90, its worst single-season record since 1999 (70-92). Ausmus was fired on Sept. 30, one day after the end of the regular season.\n\nDespite their record last season and missing the playoffs in each of the last five years, the Angels offer an attractive managerial job.\n\nThey play in a great location with an owner, Artie Moreno, who has spent at least $150 million on payroll in five of the past six years, and 28-year-old Mike Trout remains the sport's best player and is under contract through 2030.\n\nMaddon returns to the organization that gave him his start as a manager. He had two brief interim stints with the Angels in 1996 and 1999, going 27-24 in 51 games. The Pennsylvania native also worked as a coach for the team from 1994 to 2005.\n\nFor the past five seasons, Maddon managed the Chicago Cubs. He led them to four postseason appearances in each of his first four years, including three straight trips to the NLCS and the 2016 World Series title.\n\nThe Angels will hope Maddon has the same type of impact on them. They are facing an uphill climb, as they play in the same division as the Houston Astros and Oakland Athletics, two franchises that combined to win 204 games in 2019.\n\nIt won't be easy, but Maddon is the first big domino to fall in an offseason that should see them do everything possible to get back in the playoff mix in 2020.", "description": "For the third consecutive year, the  Los Angeles Angels  will open the year with a different manager.     On Wednesday, the Angels  announced  they reached a deal with  Joe Maddon  to become the manager...", "authors": ["Adam Wells"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/833/375/hi-res-4a48ef532d8004ecb08a7d7fe6292e6f_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-16"}