{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7529989/The-hidden-meanings-Meghan-Markles-low-key-royal-tour-jewels.html", "downloaded_at": "2019-10-05 06:58:02.710768+00:00", "title": "The hidden meanings behind Meghan Markle's low-key royal tour jewels", "language": "en", "text": "The Duchess of Sussex has made headlines with her low key royal tour wardrobe - and her jewellery collection for the 10 day trip was similarly pared back.\n\nMeghan, 38, swapped glittering diamonds - including her £140,000 engagement ring - for simple pieces from a range of high street, local and lesser-known designers as she carried out engagements in Cape Town and Johannesburg.\n\nMany of the pieces carry hidden or symbolic meanings. The turquoise stone on the ring she wore in place of her engagement band, for example, is said to bring strength to the wearer, while a necklace and bracelet set she wore is designed to ward away evil.\n\nHere, a closer look at what her jewellery means...\n\nTURQUOISE STONES FOR STRENGTH\n\nNotably absent from the Duchess of Sussex's royal tour jewellery collection was her glittering diamond engagement ring, thought to be worth as much as £140,000. Instead she wore a far more discreet £200 turquoise band by American celebrity jeweller Jennifer Meyer, pictured\n\nThe handcrafted marquise ring features a marquise cut turquoise stone set in the middle of an 18-karat yellow gold band. Meghan wore the ring layered with her gold wedding ring, pictured\n\nNotably absent from the Duchess of Sussex's royal tour jewellery collection was her glittering diamond engagement ring, thought to be worth as much as £140,000.\n\nThroughout the tour the sparkler was replaced by a far more discreet £200 turquoise band by American celebrity jeweller Jennifer Meyer, whose pieces Meghan has worn on a number of previous occasions.\n\nOn several days of the tour Meghan added a diamond and turquoise earrings by Meyer\n\nThe handcrafted marquise ring features a marquise cut turquoise stone set in the middle of an 18-karat yellow gold band. Meghan wore the ring layered with her gold wedding ring.\n\nTurquoise is a stone that carries several meanings, according to gemologists, and has been used in amulets and jewellery for thousands of years.\n\nAmong the meanings of turquoise are 'strength', 'friendship' and 'protection'. It is also said to help alleviate stomach problems and cramp.\n\nOn several days of the tour Meghan doubled the power of the stone by adding a pair of dainty diamond and turquoise earrings by Meyer, who counts a string of A-listers among her close friends.\n\nThe diamond bezel earrings features a single diamond and turquoise marquise cut stone set in a polished 18-karat gold bezel.\n\nBRACELETS TO SUPPORT LOCAL ORGANISATIONS\n\nOn the first day of the tour Meghan and Harry both sported beaded bracelets emblazoned with 'Justice' for their visit to a Cape Town township (left). On Wednesday Meghan wore a second beaded bracelet gifted to her by local schoolgirls at a club (right)\n\nThe simple beaded bracelet worn by Meghan and Harry, pictured on Meghan's arm, are sold to raise money for Justice Desk, a human rights initiative. It was a way to support their work\n\nThe Duchess of Sussex was keen to shine a light on grass roots programmes and organisations during her time in South Africa, and used her jewellery to help highlight her message.\n\nOn the first day of the tour Meghan and Harry both sported beaded bracelets emblazoned with 'Justice' for their visit to a Cape Town township.\n\nThe simple pieces are sold to raise money for Justice Desk, a human rights initiative which teaches children about their rights, self-awareness and safety, and provides self-defence classes and female empowerment training to young girls in the community.\n\nOn Wednesday Meghan wore a second beaded bracelet as she stepped out for engagements in Johannesburg.\n\nIt was later revealed the bracelet was gifted to her by schoolchildren she met yesterday during a visit to The Teddy Bear Clinic, a club that supports girls aged 12 to 16.\n\nEARRINGS THAT REPRESENT AN 'INNER JOURNEY'\n\nThe Duchess of Sussex wore the Labyrinth earrings from local designer Pichulik for her visit to ActionAid in Johannesburg (left). The earrings (seen right) represent a 'journey into the centre of how we know ourselves', according to the brand's website\n\nWhile much of the royal tour wardrobe is planned in advance, Meghan picked up a few pieces while she was travelling.\n\nThe Duchess was also seen in a distinctive pair of studded black earrings from the brand called 'Magi on a visit in Johannesburg\n\nAmong them were two pairs of stylish earrings from local designer Pichulik, which cost less than £100 each - a bargain for a Duchess who usually glitters in diamonds.\n\nThe brand takes its inspiration from 'ancient traditions, myth and an experimental use of materials' and 'celebrates empowering feminine narratives' - perfect for the feminist duchess.\n\nThe Labyrinth pair worn by the Duchess to ActionAid in Johannesburg carried particular significance as they 'represent our hero's journey into our centre to know ourselves intimately so that we may venture out in the world strong, clear and wise,' according to the brand's website.\n\nThe Duchess was also seen in a distinctive pair of studded black earrings from the brand called 'Magi' on a visit to a Johannesburg creative hub the previous day.\n\nNECKLACE AND RING TO WARD AWAY EVIL\n\nThe Duchess of Sussex wore a £450 necklace on tour in South Africa that's adorned with an 'evil eye' and a 'hamsa' symbol (left). She later added a matching bracelet (right)\n\nThe Duchess of Sussex wore a £450 necklace on tour in South Africa that's adorned with an 'evil eye' and a 'hamsa'.\n\nThe symbols on the necklace, pictured, are said to ward away evil\n\nIts creator, the Turkish-inspired jewellery designer Alemdara, explains on its website: 'As per Ottoman legend, an evil eye on your person wards off jealousy from others.'\n\nIt adds that the symbol helps 'dispel negative thoughts and energy'.\n\nThe Duchess wore the 18-carat gold chain as she gave a speech at the Nyanga township in Cape Town on the first day of the tour, and two of her engagements the following day.\n\nLater in the tour Meghan wore a £775 bracelet from the brand featuring the same symbols.\n\nAlemdara, which was founded by former Tatler journalist Mariella Tandy, specialises in hand-crafted items made in the ancient markets of Istanbul.\n\nA spokesman confirmed to Richard Eden of the Daily Mail: 'We are very pleased to see the Duchess of Sussex wearing one of our necklaces, but we simply don't comment on our individual customers.'", "description": "Meghan, 38, swapped glittering diamonds for simple pieces from a range of high street, local and lesser-known designers as she carried out engagements in Cape Town and Johannesburg.", "authors": ["Stephanie Linning For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/07/19241158-0-image-a-2_1570085119045.jpg", "published_at": "2019-10-03"}