{"pub": "businessinsider", "url": "https://businesstimes.com.sg/banking-finance/ubs-cutting-40-banking-jobs-in-asia ", "downloaded_at": "2019-10-21 04:09:07.683577+00:00", "title": "UBS cutting 40 banking jobs in Asia", "language": "en", "text": "UBS Group is cutting about 40 jobs in Asia Pacific as part of a global push to trim costs and combine its trading units, according to a person familiar with the matter.\n\n[HONG KONG] UBS Group is cutting about 40 jobs in Asia-Pacific as part of a global push to trim costs and combine its trading units, according to a person familiar with the matter.\n\nThis comes days after the announcement that Choo Oi Yee, managing director and head of Singapore corporate client solutions, will leave to join Singapore digital securities iSTOX next January. Last month, Edmund Koh, president of UBS Asia-Pacific, also told The Business Times that the wealth manager is actively reviewing certain sectors or geographies in which it has exposure in this region.\n\nThe staff reductions are roughly split between UBS's markets and investment-banking teams with a majority at the level of vice-president or below, the person said, asking not to be identified because the details aren't public. The Asian divisions - led by Hong Kong-based Taichi Takahashi and David Chin - will see smaller cuts than those planned in Europe because UBS sees the region as a growth driver, they said.\n\nUBS has embarked on a sweeping overhaul of its investment bank, reshuffling senior management and combining trading operations in changes that may ultimately eliminate hundreds of positions, people with knowledge of the plan said earlier. Citigroup, Deutsche Bank and HSBC Holdings are also cutting staff to rein in costs as the industry deals with difficult trading conditions, sputtering economies and the impact of trade tensions on cross-border deals.\n\nsentifi.com Market voices on:\n\nMark Panday, a Hong Kong-based spokesman at UBS, declined to comment.\n\nAs part of its global restructure, Ros L'Esperance and Javier Oficialdegui are being given charge of the newly-named global banking division, which will house public capital markets, private financing and mergers and acquisitions. A combined global markets operation including equities and foreign exchange, rates and credit will be run by Jason Barron and George Athanasopoulos.\n\nGreg Peirce is taking over as global head of mergers and acquisitions, the first time that role will be based in Hong Kong, the person said. The Asian staff reductions have already begun, with a fresh round expected later this month, they said.\n\nBLOOMBERG", "description": ": THE BUSINESS TIMES Banking & Finance - [HONG KONG] UBS Group is cutting about 40 jobs in Asia-Pacific as part of a global push to trim costs and combine its trading units, according to a person familiar with the matter. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/21/AK_ubs_2110.jpg?itok=pDh52cWO", "published_at": "2019-10-21"}