{"pub": "washingtonpost", "url": "https://washingtonpost.com/powerpost/mcconnells-august-of-missed-opportunities-gives-way-to-a-fierce-fall-session/2019/09/04/1336f16e-cf46-11e9-87fa-8501a456c003_story.html", "downloaded_at": "2019-09-05 10:29:50.097606+00:00", "title": "McConnell’s August of missed opportunities gives way to a fierce fall session", "language": "en", "text": "Senate Majority Leader Mitch McConnell (R-Ky.) speaks to the news media in June after the weekly Republican Party caucus lunch meeting on Capitol Hill. (Leah Millis/Reuters)\n\nSenate Majority Leader Mitch McConnell has been out of sight for more than a month.\n\nThe Kentucky Republican has not held a public event since fracturing his shoulder Aug. 4 in a fall outside his Louisville home. Since follow-up surgery in mid-August, McConnell has been recuperating at home over a long Senate break that originally had the 77-year-old barnstorming his state in pursuit of a seventh term next year, as well as touring the nation to raise money for himself and other Republicans.\n\nInstead, according to advisers, McConnell has worked the phones and email in between physical rehabilitation sessions as he prepares for a fierce fall legislative session dominated by the question of whether he will act on any legislation to stem gun violence after a month marked by mass shootings.\n\nMcConnell is expected to wear a shoulder brace for several more weeks after he returns Monday to Capitol Hill.\n\nHe could not attend a joint fundraiser he was to host a few weeks ago in Louisville for Sens. Susan Collins (Maine), Cory Gardner (Colo.) and Martha McSally (Ariz.), three of the most endangered Republicans in 2020. He stayed home when President Trump flew to Louisville for events two weeks ago, although people involved said his original plan would have had him out of state anyway on fundraising travels.\n\nIn his most personal disappointment of all, McConnell could not attend the biggest football game the University of Louisville has played in a couple years, a nationally televised Labor Day game against Notre Dame.\n\n“I watched it on TV,” McConnell told conservative radio host Hugh Hewitt in an interview Tuesday.\n\nMcConnell, whose loyalty to his alma mater’s football team is renowned, instead attended a private tailgate hosted by a friend before returning home to watch the game, according to his staff. Louisville lost 35-17, a metaphor for the kind of month McConnell has had.\n\nMcConnell defends blocking election security bill, rejects criticism he is aiding Russia\n\nThe GOP leader has used two radio interviews, one Tuesday with Hewitt and the other with a local talk show host a few days after McConnell’s initial fall, to project his views on the issues that have dominated the congressional recess.\n\nMcConnell remains as irritated as ever over some of the attacks against his “legislative graveyard” in the Senate, particularly the “Moscow Mitch” moniker Democrats have tagged him with for declining to act on election security legislation following Russian cyberattacks on the 2016 U.S. presidential contest.\n\n“It’s modern-day McCarthyism. Unbelievable for a Cold Warrior like me who spent a career standing up to the Russians to be given a moniker like that,” McConnell told Hewitt on Tuesday.\n\nHe continued to promise to block Democratic proposals on climate change and health care that would change “us into a socialist country.” After mass shootings in El Paso and Dayton, Ohio, he declined to bring the Senate back into session to vote on bills to tighten gun limits that the House passed in February. He remains neutral on whether to advance any legislation to deal with the mass shooting epidemic that has only grown worse during the past five weeks. He does not intend to hold a debate until Trump fully signs on to a deal that has bipartisan support and is assured of becoming law.\n\nThe only issue he guaranteed to receive his undivided attention? Continuing the stampede of confirming more conservative jurists to the federal judiciary.\n\n“Oh, yeah. We’re not going to leave a single vacancy behind by the end of next year,” McConnell told Hewitt.\n\nLiberal activists have come to view the 35-year Senate veteran as a crony and a Trump enabler, making him a political fundraising tool for Democrats. “It’s hard to think about, let alone list, all the examples of willful cruelty by this administration that McConnell does nothing to stop,” Carole King, the singer-songwriter, wrote in a fundraising email Wednesday for the Democratic Senatorial Campaign Committee.\n\nTo be sure, McConnell’s staff is adamant that his long-term health is fine and that he is running full steam ahead for another term.\n\n“The Leader has been working from home throughout the month and looks forward to seeing everyone on Monday at the Capitol,” David Popp, his spokesman, said in a statement.\n\nHe has been doing rehabilitation sessions twice a day at home, according to one adviser, and his team is trying to make clear this will not resemble the Harry M. Reid situation.\n\nOn Jan. 1, 2015, as he got ready to switch from majority leader to minority leader, Reid (D-Nev.) critically injured himself while exercising, in an accident that left him without vision in his right eye, broken bones in his face and broken ribs.\n\nHe eventually returned to the Senate, but a few months later, he announced he would not seek reelection in 2016.\n\nAdvisers to McConnell insist the sling around his left shoulder will be the only noticeable sign of the fall, which happened as McConnell’s old Nike sneakers got stuck on his patio and prompted the accident.\n\nA polio survivor, McConnell has always had a slow, steady gait and regularly uses elevators in the Capitol to avoid stairs.\n\nAssuming a full recovery, the biggest political hit to McConnell might be in his fundraising haul. The August recess is traditionally peak season for raising money, particularly that month in the odd year ahead of the election season.\n\nOne political adviser estimated that McConnell’s injury led to the postponement of “multiple events worth multiple millions” to benefit the GOP leader and other Republican candidates. Those postponed events are likely to be slowly worked back into the schedule.\n\nCongress’s August recess turns into a political cudgel in gun debate\n\nMcConnell already has raised more than $11 million for his 2020 reelection bid, for which he is favored to win but only after a very expensive race that Democrats are targeting.\n\nHis last public appearance came Aug. 3 at Fancy Farm, one of the biggest annual events in Bluegrass State politics. At the small-town event in southwestern Kentucky, thousands of partisans on both sides gather to hear speeches from the state’s leading politicians, all while getting heckled.\n\nDemocrats jeered him as he took the stage and waved “Moscow Mitch” signs.\n\n“I’m going to spend as much time talking about them as Kentuckians will voting for them this November — none,” McConnell said.\n\nThe next day, McConnell took the fall that sent his August into a strange period of hibernation. After weeks of being cooped up at home, he says he is ready to get back into the fight.\n\n“We’ll be ready to go to work again,” McConnell told Hewitt.\n\nRead more from Paul Kane’s archive, follow him on Twitter or subscribe to his updates on Facebook.", "description": "The Senate majority leader, recuperating from shoulder surgery, faces questions about whether he will act on any legislation to stem gun violence or bolster election security.", "authors": ["Paul Kane", "Senior Congressional Correspondent", "September At Am", "Paul Kane Is The Washington Post'S Senior Congressional Correspondent", "Columnist. His Column About Congress", "Pkcapitol", "Appears Throughout The Week", "On Sundays. He Joined The Post In"], "top_image": "https://www.washingtonpost.com/resizer/DuaJTarhZTiN7DyT-MqTaCKuhoM=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UL6EJQGPPAI6TB72QUA2IVWAAM.jpg", "published_at": "2019-09-04"}