{"pub": "reuters", "url": "https://in.reuters.com/article/uk-britain-royals-burrell/love-will-help-harry-and-meghan-avoid-fate-of-charles-and-di-ex-butler-says-idINKBN1X22UX", "downloaded_at": "2019-10-24 00:37:54.147648+00:00", "title": "Love will help Harry and Meghan avoid fate of Charles and Di, ex-butler says", "language": "en", "text": "NEW YORK (Reuters) - Britain’s Prince Harry and wife Meghan Markle are well placed to ride out the media storm around them and avoid the pitfalls that tore apart his parents, Charles and Diana, for the simplest of reasons, Diana’s former butler said: They love each other.\n\nPaul Burrell, a longtime royal servant who became Princess Diana's personal assistant and confidante, speaks during an interview in New York, U.S., October 23, 2019. REUTERS/Brendan McDermid\n\nPaul Burrell, a longtime royal servant who became Princess Diana’s personal assistant and confidante, has watched as Harry has pushed back against media intrusion and sought to protect his wife, the American-born, biracial Duchess of Sussex.\n\n“They (Charles and Diana) didn’t have what Harry and Meghan have,” Burrell told Reuters on Wednesday. “They didn’t have love. And they (Harry and Meghan) love each other. It’s quite obvious when you see them together.”\n\nHarry’s parents, Charles, the Prince of Wales, and Diana, divorced in 1996 after 15 years of largely unhappy marriage, and his mother was killed in a 1997 road accident while being chased by paparazzi.\n\nBurrell, 61, has become a frequent commentator on Diana and the royal family since leaving the palace after Diana’s death, and was in New York promoting a documentary at a contentious time for Prince Harry.\n\nHarry, 35, said in a recently aired ITV interview that he would “not be bullied into playing a game that killed my mum.” He and Meghan are also taking legal action against media groups to protect their privacy.\n\nPrince William and his wife Kate Middleton have enjoyed a smoother ride from the palace and the press because their future is largely predetermined, Burrell said.\n\nPrince William, 37, is second in line, after Prince Charles, 70, to the throne of Queen Elizabeth, 93. Harry is sixth in line, behind William’s children.\n\nThe two brothers are often called “the heir and the spare,” which Harry hates, Burrell said, and Harry also admitted to ITV that some distance had grown between them.\n\n“Harry said that (he and William) are on different paths. I know what he means by that. William and Kate have a map in front of them. They’re headed for monarchy,” Burrell said, adding that the Queen and Charles have left Harry to find his way.\n\n“There’s no guidance. There’s no support. There’s no rulebook,” Burrell said.\n\nTo escape the glare, Harry and Meghan are considering buying a home in California, British media have said.\n\n“I hope we don’t lose Harry and Meghan (to California) because they are a tremendous asset to the royal family, and to Britain,” Burrell said.", "description": "Britain's Prince Harry and wife Meghan Markle are well placed to ride out the media storm around them and avoid the pitfalls that tore apart his parents, Charles and Diana, for the simplest of reasons, Diana's former butler said: They love each other.", "authors": ["Angela Moore", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191024&t=2&i=1444306853&w=1200&r=LYNXMPEF9N00E", "published_at": "2019-10-24"}