{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/pride-britain-2019-heartbreaking-stories-20746098", "downloaded_at": "2019-10-28 23:35:21.447712+00:00", "title": "Pride of Britain 2019: Heartbreaking stories of two very different little heroes", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThey are two small children who have made a huge difference: one hilariously extroverted, the other adorably shy.\n\nDante Marvin dazzled in the spotlight, happy to show off his dance moves with Ashley Banjo, sing with Anne Marie and tell the room packed full of celebrities about how he will not let a brittle bone disease get in the way of his fundraising efforts.\n\nAnd then little Jaydee-Lee Dummett, in her best party dress, so bashful that she accepted her child of courage award with only a sweet smile after a video of her saving her four-year-old brother’s life left the audience in tears and in awe of her actions.\n\nThe Daily Mirror’s Pride of Britain Awards, in partnership with TSB, celebrates the children who like to shine and the ones who would happily stay in the background. In days when the nation needs a bit of cheering up, maybe we all need to be more Dante.\n\n(Image: Andy Stenning/Daily Mirror)\n\n(Image: Andy Stenning/Daily Mirror)\n\nSeeing him beaming and working hard to spread happiness to others through his work as an ambassador for children’s charity Variety, despite his own debilitating illness, inspires everyone he meets.\n\nHearing him remind people of his motto: “There are no disabilities, just abilities” lifts them out of any gloom and reminds us to focus on the special things we can all do.\n\nDressed in a tiny white tuxedo that was the envy of star Ashley Banjo, Dante zoomed around in a wheelchair covered in wrestling stickers.\n\nHe was a pocket rocket of positivity, taking to the stage with a loud: “What’s up London?” like a rock star.\n\nDante, 11, from Liverpool, has endured much more than most.\n\n(Image: Daily Mirror)\n\n(Image: Andy Stenning/Daily Mirror)\n\nHe had 16 broken bones in his mum Rachael’s womb and was born with brittle bone disease and scoliosis.\n\nHe has broken 92 bones in his life – as a sneeze or high-fiving one of his siblings can injure him – and has endured 17 separate operations to insert rods in his limbs. Rachael says: “I don’t stop Dante doing anything – he just gets on with it.\n\n“He hates seeing other children sad. If I take him to hospital he is more bothered about the child in the bed opposite who is crying and tries to reassure them. I am so proud of him.”\n\nDante is so grateful for his new yellow wheelchair that had been donated by Variety. He said: “My message to anyone with a disability is, ‘don’t give up’.”\n\nA huge fan of Coronation Street the lad was invited on to the cobbles to be surprised by Jack P Shepherd who plays David Platt. He said: “I don’t have the words to describe how much I love David Platt. He has the same personality as me.\n\n(Image: Roland Leon Sunday Mirror)\n\n“I was so shocked to see Jack I had to go away and have a little cry.”\n\nPresenting his Child of Courage award, Jason Manford asked if he’d like to be a comedian – and Dante told him he never stops laughing.\n\nJaydee-Lee is a special little seven-year-old from Fochriw, South Wales.\n\nShe might not be the first to shout out in class, but she listens so intensively in class that she learned an important and life-saving lesson.\n\nWhen Wales and West Utilities visited her school to give a talk on gas safety, she remembered not only the warning signs of odourless carbon monoxide poisoning but even the emergency phone number.\n\nThree weeks later, Jaydee-Lee went to bed as usual but woke in the middle of the night to find her four-year-old brother Laylan acting strangely and disorientated.\n\n(Image: Andy Stenning/Daily Mirror)\n\n(Image: Daily Mirror)\n\nShe recognised the signs of carbon monoxide poisoning, alerted mum Lindy and urged her to call for help.\n\nLindy said: “Jaydee-Lee came out on the landing and said ‘Mam, what’s that red light?’ So we went to look at it and she said, ‘Mam that’s the carbon monoxide alarm’”. Jaydee-Lee added: “I told Mummy to call. I knew the number – 0800 111 999.”\n\nA gas engineer was soon with them and praised Jaydee-Lee’s quick-thinking – and even offered her a job.\n\nWithout Jaydee-Lee her family would have been among the 50 people in the UK killed by carbon monoxide poisoning this year.\n\nThe Pride of Britain Awards gives us all a chance to say, to the small wonders who make a big difference across the county: thank you.", "description": "While Dante Marvin danced on stage at Pride of Britain 2019 ceremony, Jaydee-Lee Dummett accepted her award with a sweet smile", "authors": ["Julie Mccaffrey", "Image", "Andy Stenning Daily Mirror", "Daily Mirror", "Roland Leon Sunday Mirror"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20746117.ece/ALTERNATES/s1200/0_POB-Awards.jpg", "published_at": "2019-10-28"}