{"pub": "afr", "url": "https://afr.com/property/residential/lendlease-urges-new-train-link-to-buttress-15b-london-development-20191025-p5344b", "downloaded_at": "2019-10-25 16:00:14.079133+00:00", "title": "Lendlease urges new train link to buttress $15b London development", "language": "en", "text": "The mayor of London's office has indicated it will release a planning framework for the area in \"the winter of 2019\" – presumably around Christmas – for a two-month consultation.\n\nOfficial documents suggest the framework will call for an extension into Thamesmead of the Docklands Light Railway (DLR).\n\nThe Docklands Light Railway initially linked the City to Canary Wharf, but now covers 38km and 45 stations.\n\nThe DLR is a driverless train network initiated under the Thatcher government and has since grown to cover a large swathe of east and south-east London, including the Canary Wharf financial district.\n\nThe proposed extension is \"sometimes called DLR to Thamesmead, but we don’t want to pre-empt it,” Transport for London community partnerships lead Gary Nolan reportedly told a community forum earlier this year.\n\nHis cautious phrasing reflects the glacial and often interrupted progress of London's efforts to meaningfully expand its Tube and rail network.\n\nThe new Elizabeth Line, formerly known as CrossRail, will terminate just south of the Thamesmead site, at Abbey Wood. It will take commuters to central London in about 20 minutes, and will ultimately also serve Heathrow Airport and the western commuter belt.\n\nAdvertisement\n\nBut it has been beset by delays and cost blowouts. Although the £17 billion-plus line was supposed to open last December, it will now open no earlier than late 2020, probably early 2021.\n\nThe Thamesmead project envisages not only residential development but also a revitalised town centre. The district's population is about 45,000, and Peabody owns about two-thirds of the land.\n\nThe existing housing stock dates from the 1960s in the south, and mostly from the 1980s and 1990s in the town's north and west.\n\nThe 760-hectare site is about the size of central London. There are about 75 hectares of green space, five kilometres of Thames river frontage – of which 2.5 kilometres forms part of Peabody's development site – plus seven kilometres of canals and five lakes.", "description": "The developer has inked its 50-50 joint venture with Peabody to build 11,500 homes at Thamesmead, but needs the London authorities to do their bit.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.4177%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_112/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/7187701fced70c464eb7c0ad79ffda61001eae52", "published_at": "2019-10-25"}