{"pub": "euronews", "url": "https://euronews.com/2018/10/19/taste-explores-the-unique-qualities-of-soy-milk-cream", "downloaded_at": "2019-10-15 04:25:41.902103+00:00", "title": "\"Taste\" explores the unique qualities of Soy Milk Cream", "language": "en", "text": "Japan is an important producer and consumer of soya, and master of transforming the humble staple into the tastiest of dishes. Soy milk cream is used in both savories and sweets, and \"Taste\" has gone to Japan to find out more about it.\n\nJapan is a gastronomic treasure house with exceptional food products, and it works wonders with soya and Soy milk cream, which is rich in vegetable protein and easily digestible.\n\nThis is why euronews' Sophie Claudet chose a dance studio in Tokyo to begin her investigation, as few people are as health and weight conscious as dancers. Soy milk cream is a healthy, protein-loaded alternative to animal-derived products favoured by those looking after their diet and figure, like ballerinas.\n\nAfter their dance lesson, the ballerinas go and have lunch in a restaurant, right next door to the studio. Dishes are varied, mostly Italian-inspired. The risottos, like the spaghetti carbonara are prepared with soy milk cream.\n\nSophie Claudet, euronews:\n\n\"Chef, tell us why do you like cooking with soy milk cream?\n\n\"Generally speaking and when compared to animal-derived products, soy milk cream has a lot of proteins, few calories and is low in fat. Also, as you can see here, it’s an ingredient that works well with savory and sweet dishes,\" says the Executive Chef at the Dance Cube cafe, Mitsuhiro Tanishika.\n\nChef Tanishika’s dishes have certainly won over the dancers.\n\n\"I’m eating spaghetti carbonara prepared with soy milk cream, and it tastes exactly like regular carbonara, only lighter! And it’s very good!,\" says one.\n\nThe dance instructor, who used to be a professional dancer, savours a tiramisu.\n\n\"Tofu and soy milk cream contain a lot of proteins, which is really good for physically active people. Soy milk cream can also be used in desserts. Sweets make me happy and that’s why I love soy milk cream!\" she says.\n\nSoy milk cream, which is also called tonyu cream, is not only an ingredient of choice here in Japan. Western chefs are also starting to cook with it.\n\nTo discover the recipe of a French Michelin-starred chef who works in Tokyo, we are once again joined by Thierry Voisin.\n\n\"I’m going to prepare a poultry tiramisu using tonyu cream instead of mascarpone. You still get the same mascarpone-like texture but it’s tonyu,\" he explains.\n\n\"Put four egg yolks in a large pan, add water, a pinch of salt and beat the mixture until it gets creamy. Once you have a nice emulsion, add gelatine.\"\n\nThe chef then adds in pureed poultry, and soy milk cream.\n\n\"Now you add the soy milk cream, tonyu, and delicately mix. Here we are Sophie, that’s our tiramisu. I let it harden a bit in the refrigerator. Let’s place some carved lobster on top and then top it off with lobster aspic. Add a few flower petals...\"\n\nSophie Claudet:\n\n\"It's beautiful!\"\n\n\"And here it is. I’ll let you taste it Sophie,\" smiles Voisin.\n\nSophie Claudet:\n\n\"My pleasure, chef! It’s delicious, very fresh on the palate. The full recipe is on euronews.com.\"", "description": "Japan knows how to use soya like no other nation, and soy milk cream can be used in both sweet and savory dishes, as \"Taste\" discovered.", "authors": ["Sophie Claudet"], "top_image": "https://static.euronews.com/articles/stories/03/35/92/12/1000x563_cmsv2_b72299c9-77c0-56a4-b9d3-7c40f63f7384-3359212.jpg", "published_at": "2018-10-19"}