{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/fred-responds-stinging-criticism-man-20535063", "downloaded_at": "2019-10-08 09:59:24.736112+00:00", "title": "Fred responds to the stinging criticism from Man Utd legends after Newcastle defeat", "language": "en", "text": "Get the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFred has conceded the criticism being aimed at him from Manchester United legends is justified because they \"won many titles with this club\".\n\nThe Red Devils have been poor this season and Fred has been slammed for not living up to his huge billing after he was signed for £52million in 2018.\n\nLast time out Manchester United were beaten 1-0 by Newcastle at St James' Park, in a drab match in which they registered just three shots on target.\n\nFred's performance was once again criticised, but the Brazilian insists he's keen to listen to what pundits have to say so that he can improve his game.\n\n(Image: Getty Images)\n\n\"They are within their rights, they've won many titles with this club. We have to shut up and work on the pitch,\" Fred told Esporte Interativo.\n\n\"Some critics are pointless - but many can offer me lessons. I like to read what people are saying about my performances. With that, I can try to get better.\"\n\nOn what it means to play for Man United, he added: \"I do understand it.\n\n\"Every day when I arrive at the training ground, when I see those big letters with the name of the club, I pinch myself.\n\n\"So I know this club is gigantic. I like to read about its history, best players and historical moments.\n\n(Image: Action Images via Reuters)\n\n\"It hasn't been great times for us — our rivals are winning titles and we're not even in the Champions League. It makes our fans sad and I feel sad as well.\n\n\"This club deserves silverware and we're going to fight to get better. We have to put United back in the place it should never have left.\"", "description": "The Brazilian midfielder was poor in Manchester United's recent defeat by Newcastle in the Premier League", "authors": ["Jake Polden", "Image", "Getty Images", "Action Images Via Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20531556.ece/ALTERNATES/s1200/0_Newcastle-United-v-Manchester-United-Premier-League.jpg", "published_at": "2019-10-08"}