{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-hongkong-protests/hong-kong-office-workers-schoolmates-denounce-police-shooting-of-teen-idUKKBN1WH02F", "downloaded_at": "2019-10-02 12:54:17.953452+00:00", "published_at": "2019-10-02", "title": "Hong Kong office workers, schoolmates denounce police shooting of teen", "language": "en", "text": "HONG KONG (Reuters) - Hong Kong office workers and high-school students turned out in their hundreds under a sweltering midday sun on Wednesday to denounce a policeman for shooting and wounding a teenager during the most violent clashes in nearly four months of unrest.\n\nThe office workers marched to Chater Garden in the Central business district as the students, some in the same class as the wounded 18-year-old, demonstrated outside his New Territories school.\n\nMore than 100 people were wounded during Tuesday’s turmoil, the Hospital Authority said, as anti-China demonstrators took to the streets across the Chinese-ruled territory, throwing petrol bombs and attacking police who responded with tear gas and water cannon. Five remained in a serious condition with 35 stable.\n\nThirty police were injured, with five in hospital.\n\nDuring one clash, an officer shot an 18-year-old school student in the chest with a live round after coming under attack with a metal bar, video footage showed. The teen was in stable condition in hospital on Wednesday.\n\nProtesters outside the wounded student’s school, the Tsuen Wan Public Ho Chuen Yiu Memorial College, chanted “Free Hong Kong”, condemned the police and urged a thorough investigation.\n\n“(It’s) ridiculous, it can’t happen, and it should not be happening in Hong Kong,” said one 17-year-old who goes to the same school.\n\n“It really disappointed me and let me down about the policeman. I don’t know why they took this action to deal with a Form Five student. Why do you need to shoot? It’s a real gun.”\n\nProtesters have previously been hit with anti-riot bean-bags rounds and rubber bullets and officers have fired live rounds in the air, but this was the first time a demonstrator had been shot with a live round.\n\nPolice said the officer involved was under serious threat and acted in self-defence in accordance with official guidelines.\n\nPolice said they arrested 269 people - 178 males and 91 females - aged 12 to 71 during the Tuesday turmoil, while officers fired about 1,400 rounds of tear gas, 900 rubber bullets and six live rounds.\n\nThe protests, on the 70th anniversary of the founding of the People’s Republic of China, were aimed at propelling the activists’ fight for greater democracy onto the international stage and embarrassing the city’s political leaders in Beijing.\n\nThe former British colony has been rocked by months of protests over a now-withdrawn extradition bill that would have allowed people to be sent to mainland China for trial but have evolved into calls for democracy, among other demands.\n\nThe outpouring of opposition to the Beijing-backed government has plunged the city into its biggest political crisis in decades and poses the gravest popular challenge to President Xi Jinping since he came to power.\n\nA figurine of a Hong Kong anti-government protester is held up as people gather at West Kowloon Law Courts Building to show their support to 96 anti-government protesters who were arrested days ago in Hong Kong, China, October 2, 2019. REUTERS/Athit Perawongmetha\n\nThe pro-establishment Democratic Alliance for the Betterment and Progress of Hong Kong condemned Tuesday’s violence and urged the government to impose emergency laws to resolve the crisis.\n\n‘CHILLING DISREGARD’\n\nMany shops and business closed on Tuesday in anticipation of the violence, which is taking a growing toll on the city’s economy as it faces its first recession in a decade and the central government grapples with a U.S.-China trade war and a global slowdown.\n\nStandard & Poor’s cut its Hong Kong economic growth forecast on Tuesday to 0.2 percent for this year, down from its forecast of 2.2 percent in July, blaming tension in the city for plunging retail sales and a sharp dip in tourism.\n\nThe Hong Kong General Chamber of Commerce condemned the violence.\n\n“Extremists’ chilling disregard for the rule of law is not only affecting Hong Kong’s reputation as an international financial and business centre, but also crippling many small businesses and threatening the livelihoods of hundreds of thousands of ordinary citizens,” it said in a statement.\n\nThe protesters come from wide-ranging backgrounds. Of 96 charged after violence on Sunday, eight were under 18, some were students, others had jobs ranging from waiter, teacher and surveyor to sales manager, construction worker and a hotel employee.\n\nProtesters are angry about what they see as creeping interference by Beijing in their city’s affairs despite a promise of autonomy in the “one country, two systems” formula under which Hong Kong returned to China in 1997.\n\nSlideshow (25 Images)\n\nChina dismisses accusations it is meddling and has accused foreign governments, including the United States and Britain, of stirring up anti-China sentiment.\n\nThe protesters are increasingly focusing their anger on mainland Chinese businesses and those with pro-Beijing links, daubing graffiti on store fronts and vandalising outlets in the heart of the financial centre.\n\nThe Bank of China (Hong Kong) said two of its branches came under attack on Tuesday.\n\n“The bank expresses its deepest anger and strongly condemns this illegal, violent behaviour,” it said in a statement.", "description": "Hong Kong office workers and high-school students turned out in their hundreds under a sweltering midday sun on Wednesday to denounce a policeman for shooting and wounding a teenager during the most violent clashes in nearly four months of unrest.", "authors": ["Clare Jim", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191002&t=2&i=1436153893&w=1200&r=LYNXMPEF910FD"}