{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7598923/Scarlett-Johansson-reveals-Black-Widow-movie-brought-closure-needed-talk-show.html", "downloaded_at": "2019-10-22 13:53:33.440756+00:00", "title": "Scarlett Johansson reveals Black Widow movie 'brought a closure to me that I needed' on talk show", "language": "en", "text": "Scarlett Johansson vowed that her Marvel character Black Widow is really and truly dead Monday during a visit on The Tonight Show Starring Jimmy Fallon.\n\nThe 34-year-old actress swore that Black Widow sacrificed herself in Avengers: Endgame just as audiences saw when it was released in April.\n\nScarlett said she had just finished filming Black Widow, a prequel, in London and it reportedly will be released May 1, 2020.\n\nBusy star: Scarlett Johannson during a chat show visit Monday talked about the upcoming Black Widow movie as well as two new film projects\n\nThe New York City native described shooting Black Widow as a cathartic experience, especially since she'd been grappling with her character's death.\n\n'It brought a closure to me that I needed, 'cause I was kind of wiped out after that last one—emotionally and literally,' Scarlett said.\n\nMany fans didn't want to believe her character was gone, she acknowledged, and some had even tried to convince her that Black Widow existed in an alternate universe.\n\n'But no, I think death is the final thing,' she emphasized.\n\nCathartic experience: The 34-year-old actress said the Black Widow movie was a 'cathartic experience' after her character made the ultimate sacrifice in Avengers: Endgame\n\nNext year: Scarlett, shown as Black Widow in Avengers: Endgame, will star in her own Black Widow movie due out on May 1, 2020\n\nJimmy congratulated Scarlett on her recent engagement to Saturday Night Live's Colin Jost, 37, noting that his co-host on Weekend Update, Michael Che, wanted to throw his bachelor party.\n\n'Oh no,' Scarlett said. 'I don't think that's a good idea. I feel like if he throws it, it's gonna be by the Port Authority, and it's gonna be very local.'\n\n'Michael,' she jokingly threatened. 'I know where you work, Michael.'\n\nBachelor party: Jimmy Fallon congratulated Scarlett on her recent engagement to Saturday Night Live's Colin Jost, 37, noting that his co-host on Weekend Update, Michael Che, wanted to throw his bachelor party\n\nShe then spoke about her new film with Adam Driver, Marriage Story, out December 6.\n\n'People have an experience when they watch it, I think, because if you haven't gone through a divorce, lucky you, then either your parents have or you know someone.'\n\nScarlett herself has been divorced twice, from actor Ryan Reynolds, 42, in 2011, and journalist Roman Dauriac, 37, in 2017.\n\nComing soon: The New York City native also spoke about her new film with Adam Driver, Marriage Story, out December 6\n\n'The thing about this film is that there's a lot of love in this movie,' she insisted. 'I'm really proud of it.'\n\nScarlett also promoted her latest film, Jojo Rabbit, out last week, in which she plays the mother of a 10-year-old boy in Nazi Germany, who envisions that he's friends with a Hitler-type character.\n\nShe sensed the audience might have a weird reaction to her description of the film.\n\nBlack comedy: Scarlett struggled to describe her new satirical black comedy movie Jojo Rabbit set in Nazi Germany\n\n'Stop!' she cried. 'I'm trying! Just go see it. It's so unusual. It's so fun. It's so powerful.'\n\nShe bonded with Roman Griffin, the actor who played her son, calling him 'so funny and great in the movie, his delivery is so charming and natural and great.'\n\n'The movie has so much heart, it has so much hope, it's so unique and original,' Scarlett enthused. 'And audiences love it. They love it.'\n\nUnique film: The actress said Jojo Rabbit 'has so much heart, it has so much hope, it's so unique and original'\n\nScarlett earlier joined Jimmy and Democratic presidential candidate Pete Buttigieg, 37, for a game of True Confessions.\n\nEach of them read a statement about themselves that was either true or false, then the other players could ask them questions about it to determine its veracity.\n\n'I got stung by a jellyfish on my face while swimming off the coast of Italy,' Scarlett said, reading her own card.\n\nGame time: Scarlett earlier joined Jimmy and Democratic presidential candidate Pete Buttigieg, 37, for a game of True Confessions\n\nIn answer to questions, she said it happened near Sicily, in 2009.\n\n'You know what you're supposed to do when a jellyfish stings you,' Jimmy offered. 'Did you follow protocol?'\n\n'You want to know whether somebody p***ed on my face,' Scarlett clarified, noting that she did not go to a doctor.\n\nTrue story: The actress read her own card stating, 'I got stung by a jellyfish on my face while swimming off the coast of Italy' and it turned out to be true\n\nHer opponents astutely guessed that she was telling the truth about the incident, which she said left her with a swollen face that was 'Goonies bad.'\n\nJimmy said he once gave a Heimlich to Jerry Seinfeld at a wine tasting in the Hamptons, when the two of them were attending a charity event.\n\nHe sounded credible, so Scarlett wasn't sure whether to believe him.\n\nDance moves: Scarlett showed off some dance moves as she took her seat\n\n'It is a lie,' he confessed. 'Jerry would kill me if I ever touched him.'\n\nPete's card said he once ate an ice cream sundae 'made entirely out of pork,' which had him explaining that BBQ sauce stood in for fudge and mashed potatoes for ice cream.\n\nThey guessed, correctly, that he ate it.", "description": "The 34-year-old actress vowed that her Marvel character Black Widow is really and truly dead Monday during a visit on The Tonight Show Starring Jimmy Fallon.", "authors": ["Dailymail.Com Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/08/20025034-0-image-a-146_1571729807509.jpg", "published_at": "2019-10-22"}