{"pub": "yahoo", "url": "https://news.yahoo.com/hong-kongs-leader-territory-not-062149830.html", "downloaded_at": "2019-10-15 09:44:03.928171+00:00", "title": "Hong Kong's leader: Territory not becoming a police state", "language": "en", "text": "Hong Kong Chief Executive Carrie Lam listens to a journalist's question during a press conference at the government building in Hong Kong, Tuesday, Oct. 15, 2019. A homemade, remote-controlled bomb intended to \"kill or to harm\" riot control officers was detonated as they deployed against renewed violence in Hong Kong over the weekend, police said Monday, in a further escalation of destructive street battles gripping the business hub. (AP Photo/Mark Schiefelbein)\n\nHONG KONG (AP) — Hong Kong's leader said Tuesday that \"it's totally irresponsible and unfounded\" to suggest the semi-autonomous Chinese territory is becoming a police state as her government grapples with protests now in their fifth month.\n\nIn a spirited defense of Hong Kong's 30,000-strong police force and her handling of the protests in response to criticism from visiting U.S. senators, Carrie Lam challenged the notion that the territory is losing its freedoms, unique in China, as police battle demonstrators in the streets.\n\n\"I would challenge every politician to ask themselves if the large extent of violent acts, and all those petrol bombs and arson and deadly attacks on policemen, happened in their own country, what would they do? What would their policemen do?\" Lam said. \"So my simple response is: To describe Hong Kong as a police state is totally unfounded.\"\n\nHer comments came as a Hong Kong court addressed one of the most startling cases of violence so far, involving an 18-year-old charged with intentional wounding for a slashing attack on a police officer Sunday.\n\nThe court adjourned what would have been a first hearing for Hui Tim-lik, because the secondary school student is still in a hospital in the wake of his arrest. Police said the charge carries a possible sentence of up to life imprisonment.\n\nThe teen was initially detained on a preliminary charge of attempted murder. Although not the first case during the protests of intentional wounding, the attack has attracted particular attention because it involved a sharp blade, described as a box cutter by Hong Kong media, and was caught on news media video.\n\nPolice said the riot control officer required surgery for the cut that severed a nerve. The court adjourned the case to Friday or earlier if Hui is discharged from the hospital before then. About a dozen friends, neighbors and supporters of the teen, some in black, which has become the color of protest in Hong Kong, were in court for Tuesday's brief proceedings.\n\nThe protests started in June over a contested extradition bill that would have allowed some criminal suspects to be sent for trial in mainland China's Communist Party-controlled courts. They have snowballed into an anti-government, anti-police and anti-China movement.\n\nThe demonstrations have increasingly ended in violence between hardcore demonstrators and police, who are now widely detested even by more moderate protesters for their riot-control methods and nearly 2,600 arrests.\n\nPolice on Monday said a homemade, remote-controlled bomb intended to \"kill or to harm\" riot officers was detonated as they deployed against a renewed surge of violence and widespread vandalism of subway stations, China-linked businesses and other targets on Sunday. Police said the device exploded not far from a police vehicle, but there were no injuries or substantial damage.\n\nDespite repeated government appeals for people not to side with mobs involved in vandalism, throwing gasoline bombs and other violence, the protest movement is still rousing determined support from more moderate demonstrators, broadly worried about the future and freedoms of the former British colony that reverted to Chinese rule in 1997, with promises from Beijing that it would largely be its own boss, its way of life unchanged.\n\nOn Wednesday, Lam will deliver an annual policy speech to address some underlying problems in Hong Kong that have also fueled discontent, including its wealth gap and shortage of affordable housing.", "description": "Hong Kong's leader said Tuesday that \"it's totally irresponsible and unfounded\" to suggest the semi-autonomous Chinese territory is becoming a police state as her government grapples with protests now in their fifth month.  In a spirited defense of Hong Kong's 30,000-strong police", "authors": ["John Leicester"], "top_image": "https://s.yimg.com/uu/api/res/1.2/I3Zq.pi6S_C5AARWaNxDQQ--~B/aD0zMzMzO3c9NTAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/f83785d4e93efad706e40fdcf79eff87", "published_at": "2019-10-15"}