{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910248969/fed-boosts-amount-of-liquidity-offered-to-financial-system", "downloaded_at": "2019-10-24 15:01:06.024471+00:00", "title": "Fed Boosts Amount of Liquidity Offered to Financial System", "language": "en", "text": "By Michael S. Derby\n\nThe Fed's expanded offerings of liquidity to the financial system saw strong demand Thursday from eligible banks.\n\nThe Federal Reserve Bank of New York intervened twice Thursday morning with what is called an overnight repurchase-agreement operation and via a 14-day repo operation. The New York Fed had said Wednesday it was raising its minimum offerings for overnight repos to $120 billion from a minimum of $75 billion, with the next two-term repo operation increased to $45 billion from a minimum of $35 billion.\n\nThe Thursday term repo saw dealers submit $62.15 billion in securities and the Fed take in $45 billion in Treasurys, agency and mortgage securities. The overnight operation was also well bid, with dealers offering and the Fed taking $89.154 billion in securities. The Thursday overnight repo operation was much bigger than the one-day operation Wednesday, where the Fed added $49.845 billion in one-day liquidity.\n\nFed repo interventions take in Treasury and mortgage securities from eligible banks in what is effectively a loan of central bank cash, collateralized by dealer-owned bonds. The bill purchases permanently add reserves to the financial system and are seen as a more-enduring fix for potential market volatility.\n\nThe expansion of temporary liquidity comes as the Fed is about to meet in a policy gathering next week that is likely to result in a cut in short-term rates. It is also month's end, when short-term rates often face pressure as banks and companies sort out their financial liquidity needs.\n\nWrite to Michael S. Derby at michael.derby@wsj.com\n\n(END) Dow Jones Newswires\n\nOctober 24, 2019 09:58 ET (13:58 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-24"}