{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/19/milb-owners-balk-mlbs-request-improved-facilities-lower-levels", "downloaded_at": "2019-10-19 13:33:47.059360+00:00", "title": "MiLB owners balk at MLB’s request for improved facilities at the lower levels", "language": "en", "text": "“Clubs want their players to play in stadiums with medical facilities, training facilities, locker rooms and playing fields suitable for elite professional baseball players,” Major League Baseball deputy commissioner Dan Halem said in a statement to The Washington Post. “It always has been the responsibility of the Minor League owner to provide first class facilities in geographical areas that do not impose unreasonable travel burdens on our players. Many of the current stadiums, primarily in the lower levels, are in worse shape than the facilities players played in during college, and in some cases high school, and require significant travel by bus to stage games. This is a significant issue for MLB that we are seeking to address in these negotiations.”\n\nAD\n\nAD\n\n“MLB’s agreement with the National Association has not been materially changed since 1990, and a lot has changed in professional baseball since that time,” Halem said. “The agreement needs to be updated to reflect the increased emphasis by our Clubs on player development, the need to improve player working conditions and compensation, and the facility requirements necessary to appropriately develop players in 2020 and beyond.”\n\nMLB, citing MiLB’s estimated $100 million in profit, proposed a revenue-sharing plan that would result in minor league teams in better financial standing contributing to teams with less financial stability. MLB says that plan would help the lower-level teams pay for facility upgrades.\n\nO’Conner states in the letter that the 40 teams affected by MLB’s proposal would lose their asset value by an average of 80 percent.\n\nAD\n\nAD\n\nThe idea to contract 40 teams with substandard facilities, however, came from the minor league owners arranging the new PBA, according to a person with knowledge of the situation, who says the owners are approaching the negotiations with an “every man for themselves” mentality. The person also says minor league owners “want the status quo” rather than upgrade facilities among lower-level teams.\n\n“Although we understand that MLB projects that the 120 plan will ‘save’ the 30 Major League clubs an aggregate of about $20M a year, the loss to the future of the game would be exponentially greater,” O’Conner wrote in his letter.\n\nCurrently, MLB pays the salaries of the minor league players, coaches and staffs. Meanwhile, minor league teams are responsible for the maintaining their facilities up to MLB standards, according to Rule 58 of the MLB rule book. Failure to comply with the agreed upon standards could result in fines up to $250,000 and suspensions of owners and/or personnel.\n\nAD\n\nAD\n\n“MLB recognizes the benefits that organized baseball provides to communities, and is discussing with the Minor Leagues some innovative league formats for locations that may be at risk of losing an affiliate because of the conditions of their facilities, the lack of fan support, or geography that makes scheduling affiliated games difficult,” Halem said.\n\nMLB has proposed the Dream League, a league in which “undrafted players, players from diverse backgrounds who played other sports in college, local star baseball players, and players from countries trying to develop professional baseball, compete for contracts with Major League Clubs,” Halem said. “The players on each team would be selected, managed and coached by aspiring general managers, former MLB players, and diverse individuals seeking front office and on-field positions with Clubs.”\n\nMLB also wants to improve MiLB geographically in terms of travel accommodations for the teams as well as the proximity of the minor league teams to their major league affiliates. Currently the Washington Nationals’ Class AAA affiliate, the Fresno Grizzlies, play almost 2,700 miles from Nationals Park.\n\nAD\n\nAD\n\nThe league also proposed increasing pay by up to 50 percent for the lowest levels of the minor leagues.\n\nThe ideas proposed have come over the course of three cursory meetings and minor league owners have yet to propose a counteroffer, according to a person with knowledge of the negotiations.\n\n“During each negotiation with the Minor Leagues, our Clubs commit to the overall number of Minor League teams they will staff with players during the agreement,” Halem said in his statement. “The considerations in making that determination include the suitability of existing stadiums to develop Major League players, the number of minor league players we expect to have in the system based on the length of our draft (which is bargained with the Players Association), the length of time it takes for players to reach the Majors, and the number of affiliates each of our Clubs believe are necessary for player development, which has become more sophisticated in recent years based on technology and analytics. Minor League owners are free like any other employer to supplement the players our Clubs supply with their own players.”\n\nMore MLB:\n\nAD", "description": "With the end of the labor deal looming, minor league baseball owners say Major League Baseball’s proposal could result in the loss of 40 teams.", "authors": ["Jake Russell", "Sports News Aide"], "top_image": "https://www.washingtonpost.com/resizer/Ae-TLEJDpkACl5vLLYQazLPcNMI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2Q7MXQEGEYI6THLT4K5GXPY3TM.jpg", "published_at": "2019-10-19"}