{"pub": "realclearpolitics", "url": "https://usatoday.com/story/news/politics/elections/2019/09/12/democratic-debate-biden-guns-harris-yang-likely-focus-houston/2279450001", "downloaded_at": "2019-09-12 11:33:20.895506+00:00", "title": "5 questions the Democratic debate may answer, including: Is Biden a fragile front-runner?", "language": "en", "text": "CLOSE The top ten Democratic presidential contenders will finally be on one debate stage Thursday night in Houston. The three-hour showdown will be the first time Joe Biden and Elizabeth Warren have appeared on the same stage. (Sept. 11) AP, AP\n\nWASHINGTON – Ten candidates. One night. And five questions that the Democratic debate Thursday may help answer about a presidential race that is steadily accelerating.\n\nFor the first time, the field's consistent leader, Joe Biden, will face off on stage with his fastest-rising rival, Elizabeth Warren. Standing on Biden's other side will be Bernie Sanders, the final candidate in the trio that make up the top tier. Seven other contenders scoring in single digits in national and statewide polls will be on stage as well, vying to command the eloquence or deploy the fisticuffs that could get them attention and, they hope, traction.\n\nThe field is winnowing – cut in half from the 20 candidates who qualified for the first two rounds of debates, which means the debate can be held on one night instead of two – and the clock is ticking. In five months, the Iowa caucuses will open a sprint for the nomination to challenge President Donald Trump's bid for a second term.\n\nHere's what we could learn from the Houston debate.\n\n1. Is Biden a fragile front-runner?\n\nDemocratic presidential candidate and former Vice President Joe Biden greets supporters during a campaign event at Keene State College in Keene N.H., on Saturday, Aug. 24, 2019. (Photo: Michael Dwyer, AP)\n\nFormer Vice President Joe Biden has displayed some of the same qualities he did in his previous two presidential bids, in 1988 and 2008, including a loquacious nature and a tendency for gaffes. Unlike those campaigns, that hasn't undermined his support. Bolstered by the argument that he is the contender best able to defeat Trump, Biden remains at the top of the Democratic field.\n\nSo far.\n\nEven some of Biden's backers, including a top New Hampshire supporter, worry that he is a fragile front-runner, that he needs to make his appearances more energetic and his answers less long-winded. In a phone call with reporters last week, senior Biden campaign aides argued that the Iowa caucuses weren't a \"must-win\" for him – which was not exactly an expression of confidence. Massachusetts Sen. Warren has drawn bigger and more enthusiastic crowds on the campaign trail.\n\nUSA TODAY/Suffolk poll: Americans dread the election; Biden maintains his lead\n\nWarren's challenge: Democrats' belief that women face tougher fight against Trump\n\nFor Biden, more than any other candidate, Thursday's debate will be a test: of his ability to give crisp answers, to respond to likely attacks and to demonstrate energy through the duration of a forum that is scheduled to last three hours.\n\n2. How will mass shootings shape the debate?\n\nSince the Democratic debate six weeks ago, nine people enjoying the evening in an entertainment district were killed in a mass shooting in Dayton, Ohio; 22 people shopping at a Walmart were killed in a mass shooting in El Paso, Texas; seven passersby were killed in a mass shooting near Odessa, Texas.\n\n'People are on edge': Mass violence threats have surged since El Paso, Dayton\n\nCLOSE In the aftermath of two mass shootings, a new poll reveals the stress and fear Americans have over potentially being the victim of another tragedy. Buzz60\n\nThat spate of violence catalyzed the debate over proposals widely supported by Americans to expand background checks on gun buyers and to enact so-called red-flag laws, bolstering the ability of law enforcement to take steps against those suspected of contemplating violence. It has also fueled a more divisive discussion over mandatory \"buybacks\" of assault-style weapons, a proposal opponents criticize as gun confiscation in violation of rights established in the Second Amendment.\n\nUSA TODAY/Suffolk Poll: Americans don't expect Congress will act on gun laws\n\nFormer congressman Beto O'Rourke, who is from El Paso, has made gun violence his signature issue, calling for a mandatory buyback program and licensing for all firearms. Biden, Sanders and Warren have endorsed only a voluntary buyback program.\n\n\"We've got a big enough lift here,\" cautioned Pete Buttigieg, the mayor of South Bend, Indiana.\n\n3. How long can Warren and Sanders be friends?\n\nSens. Bernie Sanders of Vermont and Elizabeth Warren of Massachusetts represent the far left of the Democratic Party. (Photo: Justin Sullivan/Getty Images)\n\nVermont Sen. Sanders and Warren are more than New England neighbors. They are also the two most outspoken liberals in the Democratic field. Their embrace of far-reaching proposals such as Medicare for All and the Green New Deal stand in contrast to Biden's more centrist approach. Each wants to be the alternative to the left of the former vice president.\n\nEven so, Sanders and Warren declined the opportunity to criticize each other when they were side-by-side on stage at the debate in July, and they haven't taken potshots on the stump. That nonaggression pact presumably will be strained by the need to differentiate themselves from one another.\n\nAt the moment, they seem more likely to take on Biden. Warren criticized positions taken by Biden as too cozy with big business at the expense of consumers, including a bankruptcy bill he backed in 2005.\n\nThis debate will be her first opportunity to take that battle to him face-to-face during this campaign.\n\n4. Does lightning strike?\n\nFormer Vice President Joe Biden and Sens. Bernie Sanders and Kamala Harris debate on June 27, 2019. (Photo: Wilfredo Lee/AP)\n\nIn the first debate, in June, California Sen. Kamala Harris scored the evening's viral moment in an emotional exchange with Biden over his political record – and her personal experiences – with school busing. That fueled interest in her campaign until she failed to be as sure-footed in the second debate, when her own record as a former California attorney general was under attack.\n\n'That little girl is me': Harris attacks Biden with personal story about race\n\nIn a preview of her debate strategy this time, spokesman Ian Sams said, \"Kamala will take on Donald Trump directly\" – not really the sort of surprise stance that could grab headlines in a Democratic debate, where the Republican president isn't likely to have defenders.\n\nShe'll have competition for the spotlight. New Jersey Sen. Cory Booker, former Housing Secretary Julian Castro, Minnesota Sen. Amy Klobuchar, Buttigieg and O'Rourke also hope for a breakthrough moment that helps propel them from the second tier to the first.\n\n5. Who is Andrew Yang?\n\nThe Democratic field is still big, but it's smaller than it was. Since the last debate, New York Sen. Kirsten Gillibrand, Washington Gov. Jay Inslee and former Colorado Gov. John Hickenlooper have dropped out. Prominent Democrats who are still running – among them Hawaii Rep. Tulsi Gabbard, Montana Gov. Steve Bullock, Colorado Sen. Michael Bennet, New York Mayor Bill de Blasio and Ohio Rep. Tim Ryan – didn't meet the polling and funding threshold to qualify for this debate.\n\nBillionaire activist Tom Steyer didn't make this debate but has met the conditions for the next one, in October.\n\nAndrew Yang will be on stage Thursday.\n\nDemocratic presidential candidate Andrew Yang buys lemonade for some of his staff and supporters during the Iowa State Fair on August 9, 2019. (Photo: Chip Somodevilla, Getty Images)\n\nAndrew Yang?\n\nHe has never been elected to office; indeed, he has never run for office. But the 44-year-old entrepreneur, who founded the nonprofit Venture for America, has struck a chord with a fervent band of supporters with his proposals to provide a \"universal basic income\" of $1,000 a month to every American and to address the automation of jobs.\n\nHe seems to be the candidate having the most fun. Witness the video of him at an Asian American political forum in Costa Mesa, California, on Sunday – crowd surfing.\n\nDancing on the trail: How Andrew Yang ended up in a viral video dancing the Cupid Shuffle\n\n'John Yang?': Andrew Yang pokes fun at MSNBC for flubbing his name in broadcast\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/elections/2019/09/12/democratic-debate-biden-guns-harris-yang-likely-focus-houston/2279450001/", "description": "Ten candidates. One night. And five questions that may be answered in the Democratic debate Thursday, including: Is Joe Biden a fragile front-runner?", "authors": ["Susan Page", "Published A.M. Et Sept."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/04/USAT/528a25d5-8941-4b49-a6ab-e90180b7f348-Dems_Composite.jpg?crop=3270,1839,x0,y170&width=3200&height=1680&fit=bounds", "published_at": "2019-09-12"}