{"pub": "arstechnica", "url": "https://arstechnica.com/gaming/2019/10/google-cant-fulfill-all-stadia-pre-orders-for-nov-19-launch", "downloaded_at": "2019-10-24 00:33:04.018876+00:00", "title": "Google can’t fulfill all Stadia preorders for Nov. 19 launch", "language": "en", "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\nGoogle has announced that it won't be able to fulfill all preorders for its Google Stadia streaming service in time for its previously announced November 19 launch date.\n\nThe company's carefully worded launch announcement last week technically hinted at that fact, saying that the Founder's Edition preorder hardware bundle would only \"start arriving on gamers’ doorsteps on November 19.\" Only \"the first gamers who preordered and have received your Founder’s Editions\" were promised the ability to log in to Stadia starting at 9am Pacific Time that day.\n\nGoogle also says that the Founder's Edition bundle—originally introduced as the only way to play Stadia at launch—has now sold out across all 14 launch countries. Users can still order a substantially similar (and previously announced) Premiere Edition for the same price to \"get into Stadia this year.\"\n\nGoogle said in a tweet this morning that it \"can’t wait to welcome all of our Founders to play Stadia on November 19,\" suggesting that those Founder's Edition preorders may be shipped on time. But a Google representative would only tell Ars Technica that Founder's Edition shipping \"starts the 19th and will be fulfilled in order received,\" with Premiere Edition shipments shipping \"in order after Founders.\"\n\nIn a statement to the Verge, Google clarified that it expects all Founder's and Premiere Edition preorders to be shipped within the first two weeks of launch. But Google's online store currently shows Premiere Edition bundles shipping in December with free Standard shipping. To get a \"November\" estimated shipment, you currently have to pay $14 for Priority shipping or $20 for Expedited shipping.\n\nLaunch confusion\n\nThe Founder's and Premiere Editions of Google Stadia both retail for $130 in the US, and both include a Chromecast Ultra, Google Stadia controller, Stadia access to Destiny 2, and a three-month subscription to Stadia Pro (which provides higher resolution stream access and monthly freebies, usually for $10 a month). But only Founder's Edition buyers get an exclusive dark blue controller, a three-month Stadia Pro pass for a friend, first choice of a Stadia username for your account, and a Founder's Badge on that account.\n\nUsers who want to access Stadia without purchasing either package will have to wait until a free tier is offered sometime in 2020 (or until Google offers unbundled subscriptions to Stadia Pro, which it has yet to announce). All Stadia preorder shipments will come with an emailed code to access the Stadia service, which should theoretically work on a PC or smartphone even without access to the Stadia Controller and Chromecast Ultra in the preorder package.\n\nWhen that hardware does come, though, it will be somewhat limited at launch. As we noted last week , the Google Stadia controller will only work wirelessly with the Chomecast Ultra and can't be used as a generic Bluetooth controller with a phone or Web browser (or to stream wireless game audio ) at launch. Full bluetooth support on the controller \"may be implemented at a later date,\" as Google notes on its product page\n\nThe Stadia Controller can be used as a wired controller with a USB connection on phones and PCs. However, a Google Community manager has clarified that the Stadia Controller will be the only way to play Stadia games on a TV through Chromecast Ultra (generic third-party USB controllers will work for Stadia on phones and PCs).\n\nRight now, it's hard to say whether the slow, staggered roll-out of Stadia preorders is simply a case of mismatched hardware supply and demand or a more deliberate effort to limit the initial strain on the streaming servers. In any case, the confusing messaging and slow drip of information is not a great look for a major new service hoping to make a big splash.\n\nListing image by Kyle Orland", "description": "Wireless Stadia Controller will also lack Bluetooth functions at launch.", "authors": ["Kyle Orland"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/06/e3-2019-9-760x380.jpg", "published_at": "2019-10-23"}