{"pub": "breitbart", "url": "https://breitbart.com/news/eu-uk-find-the-will-to-get-a-brexit-deal-work-on-the-way", "downloaded_at": "2019-10-11 12:48:01.559221+00:00", "title": "EU, UK find the will to get a Brexit deal, work on the way", "language": "en", "text": "BRUSSELS (AP) — The European Union said Friday that talks with the U.K. to find an amicable divorce deal were back on track, despite huge challenges and a looming end-of-month deadline for Britain to leave the bloc.\n\nEU Council President Donald Tusk said he has “received promising signals” from Irish Prime Minister Leo Varadkar that a Brexit deal is still possible, so he has extended a deadline to continue the Brexit talks.\n\nTusk, speaking in Nicosia, said “for the first time” Varadkar and British Prime Minister Boris Johnson saw a pathway toward a deal, adding that “even the slightest chance must be used” to avoid a no-deal Brexit.\n\nImmediately, the wheels of the negotiating machinery started churning again. Johnson’s Brexit Secretary, Stephen Barclay, got a warm welcome from EU negotiator Michel Barnier before they started almost two hours of talks around breakfast.\n\n“If there is a will, there is, of course, a way. Otherwise people would not be working on this,” said EU Commission spokeswoman Mina Andreeva.\n\nOriginally, Tusk said he was planning to pull the plug Friday on the Brexit talks, but because of the breakthrough he can now see talks going through the weekend, ahead of the EU’s two-day summit, which starts next Thursday.\n\nTusk said “there is no guarantee of success and the time is practically up” but insisted both sides should use every opportunity available ahead of Britain’s scheduled Oct. 31 departure date.\n\n“A no-deal Brexit will never be the choice of the EU,” Tusk said.\n\nJohnson said late Thursday there was a “pathway” to a belated agreement to stave off a chaotic, costly no-deal Brexit on Oct. 31, while Varadkar said the meeting was “very positive.”\n\nAfter meeting with Barclay, Barnier said it was essential to keep focus.\n\n“Brexit is like climbing a mountain. We need vigilance, determination and patience,” said the man who once organized the 1992 Winter Olympics in his Savoie region of France.\n\nThe main stumbling block remains how to handle the U.K.’s only land border with the EU, which is on the border between Northern Ireland and Ireland.\n\nThe challenge of keeping this border invisible — something that has underpinned both the local economy and the region’s peace deal — has dominated Brexit discussions for three years, ever since U.K. voters chose in 2016 to leave the EU.\n\nTusk insisted “even the slightest chance must be used” to avoid an acrimonious split since both the EU and the U.K. would be hit hard economically.\n\nOne way to do that could be to extend the Oct. 31 deadline so that negotiators have more time to work things out in legally-binding detail. But Johnson has insisted that Britain is leaving on Oct. 31 “do or die” — with or without a divorce deal.\n\nFrance has also long said that deadlines cannot be extended forever, since Britain was originally slated to leave the bloc on March 31.\n\nIn Paris, France’s European affairs minister, Amelie de Montchalin, had another take on the debate, saying that a no-deal Brexit “is probable, at this stage.”\n\nDe Montchalin told France Inter radio that she does not see an obvious reason to grant a further extension to the U.K.\n\n“I have a fundamental question: why give more time. If it is time for the sake of time? It has taken one year, even three years, and we don’t really get it,” she said.\n\n___\n\nMenelaos Hadjicostis contributed from Nicosia.\n\n___\n\nFollow AP’s full coverage of Brexit and British politics at https://www.apnews.com/Brexit", "description": "BRUSSELS (AP) — The European Union said Friday that talks with the U.K. to find an amicable divorce deal were back on track, despite huge challenges and a", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/11/5663f3_aptopix-belgium-eu-brexit-20591-european-union-chief-brexit-negotiator-640x335.jpg", "published_at": "2019-10-11"}