{"pub": "huffpost", "url": "https://huffpost.com/entry/joe-kennedy-iii-massachusetts-senate-markey_n_5d86a584e4b070d468cdb12b", "downloaded_at": "2019-09-22 00:26:08.674819+00:00", "title": "Joe Kennedy III Launches Campaign To Primary Ed Markey for U.S. Senate", "language": "en", "text": "Sept 21 (Reuters) - U.S. Representative Joseph Kennedy III, a member of the famed political dynasty, on Saturday launched a 2020 primary challenge against fellow Democrat Edward Markey for his U.S. Senate seat in Massachusetts.\n\nKennedy, the 38-year-old grandson of former Senator RobertKennedy who was assassinated in 1968 while running for president, has served in the House of Representatives since2013.\n\n“This isn’t a time for waiting, for sitting on the sidelines, or for playing by rules that don’t work anymore,“Kennedy wrote on Twitter on Saturday. “This is the fight of our lives, the fight of my generation — and I’m all in.”\n\nMarkey, 73, who had a long career in the House before filling a vacancy in the Senate in 2013, last won re-election in2014 by a comfortable margin.\n\nDuring his House career, Markey was one of a handful of lawmakers who led the fight for legislation, which narrowly passed the House in 2009, to bring down carbon emissions that contribute to climate change.\n\nKennedy will bring his family’s star power to next year’s race, potentially giving Markey one of the toughest contests of his political career.\n\nMassachusetts is a strong Democratic state and the winner of the party primary next year is likely to win in the Nov. 3,2020, general election.\n\nOther members of the Kennedy family who have won Senate seats, in addition to Robert Kennedy, were his brothers John F.Kennedy and Edward Kennedy. John Kennedy subsequently was elected president in 1960. Edward Kennedy held his Senate seat for nearly 47 years until his death in 2009.(Writing by Daniel Wallis in New YorkEditing by Matthew Lewis)", "description": "The member of the famed political dynasty launched a 2020 primary challenge against fellow Democrat Edward Markey in Massachusetts.", "authors": [], "top_image": "https://img.huffingtonpost.com/asset/5d86a6592300005700d350ed.jpeg?cache=mptk6uvxd6&ops=1778_1000", "published_at": "2019-09-21"}