{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/09/20/bernie-bros-angry-working-families-party-staff-receive-hateful-messages-endorsing-warren", "downloaded_at": "2019-09-20 22:51:37.960177+00:00", "title": "Bernie Bros are angry: Working Families Party receives hateful messages after endorsing Elizabeth Warren", "language": "en", "text": "The Working Families Party is a fringe, left-wing party with a little over 57,000 members in the United States. Earlier this week the WFP announced that after a complicated voting process it had decided to endorse Elizabeth Warren for president. That was a big disappointment to fans of Bernie Sanders because the group had overwhelmingly voted to endorsed Sanders in 2016.\n\nThe reaction from some on the far left was swift and furious. Jacobin magazine published a piece titled “The Working Families Party Has Written Itself Out of History” which suggested the WFP was hiding something. Meanwhile, WFP staff began receiving hateful messages online from angry Sanders supporters. From Time magazine:\n\nMaurice Mitchell, the National Director of the Working Families Party (WFP) and an organizer with the Movement for Black Lives, received messages calling him a “half man” and “Uncle Tom,” and telling him to “go back to his slave masters,” according to emails and tweets reviewed by TIME. WFP organizer Ember Ollom, a rape survivor who has tweeted about her assault, received a message that said: “We were raped by this process, so I’m happy it happened to you.”… “I do not personally think that Bernie Sanders would condone this behavior,” says Ollom. “It’s not all Bernie supporters, but people are doing this in his name. A lot of people have their picture as his profile picture. When it seems to come from a collection of people speaking on behalf of this candidate, it definitely looks bad.”\n\nIt definitely looks bad and yesterday Sanders issued a rebuke which, without being specific, seemed to be aimed at some of his own unhinged supporters.\n\nThis campaign condemns racist bullying and harassment of any kind, in any space. We are building a multiracial movement for justice — that’s how we win the White House. — Bernie Sanders (@BernieSanders) September 19, 2019\n\nToday the National Director for the WFP spoke about the harassment in an interview with the Hill’s Krystal Ball:\n\n“There’s been good faith debate and conversations on the Internet — and I’m here for all of it,” Maurice Mitchell, National Director of the Working Families Party, told Hill.TV. “Public leadership is about public accountability and engaging in those conversations.” “Also, there has been some of the most violent, disgusting, racist and sexist attacks against myself, against Nelini Stamp — another leader in our party — and many, many of our staff people, every day working people who are trying to make this world better and that’s unacceptable,” he added… “I’m really happy that folks in the Sanders campaign said that these people don’t represent our campaign at all and I think that’s the proper tone,” he said.\n\nDespite thanking Sanders for telling his own people to settle down, Mitchell tried to give the Sanders’ camp an out saying, “wherever that’s coming from, it might be a troll farm in Russia, it might be a fever swamp of some sort of cultish people who aren’t attached to any campaign…It might be coming from the sort of 4chan dark web.”\n\nWell, it might be any of those things but it also might be exactly what it looks like, i.e. Bernie Bros. angry about an endorsement that didn’t go their way. That’s probably what Sanders thought which is why he decided to tweet out a statement telling them to cool it.\n\nMetaphorically speaking, this is that moment in the movie where progressives being terrorized by a hateful hater shouting racist things over the phone is actually calling from inside the house.", "description": "\"...it definitely looks bad.\"", "authors": ["John Sexton", "Ed Morrissey", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/Bernie-angry.jpg", "published_at": "2019-09-20"}