{"pub": "cnn", "url": "https://cnn.com/travel/article/beijing-daxing-international-flights-intl-hnk/index.html", "downloaded_at": "2019-10-29 02:20:45.848891+00:00", "title": "Beijing Daxing Airport's first international flights take off", "language": "en", "text": "(CNN) — Beijing's much-hyped Daxing International Airport (PKX) has now lived up to its name with the first flights departing to foreign climes.\n\nThe Zaha Hadid-designed airport opened just ahead of country-wide celebrations of the 70th anniversary of the founding of the People's Republic of China on October 1.\n\nThe airport's first outbound international flight, a China Airways route to Bangkok, took off at 7:50 a.m. local time on October 27.\n\nThe first inbound international arrival, British Airways flight 39 from London landed at the airport at about an hour and a half later at 9:13 a.m.\n\nRelated content China's largest airport hotel opens in the new Beijing Daxing International Airport\n\nThe airport, which has already been nicknamed \"the starfish\" for its multipronged look, was officially opened for business by Chinese President Xi Jinping\n\nChina Southern and China Eastern airlines will make Daxing their home base, while Air China will be primarily based at Beijing Capital International Airport (PEK).\n\nAccording to state-run broadcaster CCTV, there are currently 12 flights a day from Daxing going to Macao, Hong Kong and Taiwan, accounting for about 3% of total airport traffic.\n\nThe goal is to have that number increase to 22 flights per day by March 2020.\n\nRelated content More cities in China to offer 144-hour visas\n\nThere's more to Daxing than airplanes however. It is also home to Aerotel Beijing , the country's largest airport hotel.\n\nCurrently, PEK airport is the second busiest in the world, behind only Atlanta's Hartsfield Jackson Airport in the United States. Shanghai's Pudong airport (PVG) ranks at number nine.\n\nBy current projections, China will pass the United States to become the world's top aviation market by the year 2023.\n\nAs well as the addition of a brand-new airport, China has other plans for boosting tourism to the country.", "description": "Beijing's much-hyped Daxing International Airport (PKX) has now lived up to its name with the first flights departing to foreign climes.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F190918142914-beijing-daxing-skylight-super-tease.jpg", "published_at": "2019-10-28"}