{"pub": "yahoo", "url": "https://sports.yahoo.com/nfl-opted-against-full-blown-233900927.html", "downloaded_at": "2019-09-30 02:18:40.399921+00:00", "title": "NFL opted against full-blown replay review of Chiefs-Lions Hail May", "language": "en", "text": "The last play of the Chiefs-Lions game included an attempt by Detroit to do what Green Bay did in that same building four years ago. The attempt failed.\n\nBut the game now has something it didn’t have when Packers quarterback Aaron Rodgers nearly grazed the rafters at Ford Field with the game-winning Hail Mary in 2015: Replay review for pass interference calls and non-calls.\n\nOn Sunday, the visual evidence showed Chiefs safety Daniel Sorensen apparently shoving Lions receiver Marvin Jones to the ground as the ball was making its descent toward the cluster of players. No flag was thrown.\n\nScroll to continue with content Ad\n\nPer a source with knowledge of the situation, NFL senior V.P. of officiating Al Riveron looked at the play but decided not to conduct a full-blown replay review.\n\nRiveron previously explained in an appearance on the #PFTPM podcast that replay review in Hail Mary situations will entail the same relaxed standard that applies on the field when a team launches a wing and a prayer.\n\n“For the most part, everyone understands what’s allowed, what’s not allowed on a Hail Mary,” Riveron said regarding an unofficial exception to pass interference that appears nowhere in the rulebook. “It’s probably fortunate that we’re not putting this play into a box because it’s something when we see it, and when I say ‘we’ I mean the football community from fans to coaches to players to officials, we’ll all agree that that’s a Hail Mary and we’ll understand what’s allowable and what’s not.”\n\nSome would say that an apparent shove to the ground of a receiver who may have had a shot at making the catch would justify at least a closer look at whether the shove happened deliberately or incidentally.\n\nStory continues\n\nIf the play had been reviewed and overturned, the officials would have had to bring both teams out of the locker room for an untimed down from inside the Kansas City five yard line. Chiefs tight end Travis Kelce told PFT by phone after the game that he wouldn’t have been surprised by such an outcome, given the crazy, unpredictable way that the game unfolded.", "description": "The last play of the Chiefs-Lions game included an attempt by Detroit to do what Green Bay did in that same building four years ago. The attempt failed. But the game now has something it didn't have when Packers quarterback Aaron Rodgers nearly grazed the rafters at Ford Field with the game-winning", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/9J5cHLbKea9wz1Dr_EvOXA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjAuMDg3MDUxMTQyNTQ2Mg--/https://s.yimg.com/uu/api/res/1.2/TfCTk94A4avixuOy3WsvSA--~B/aD01MTc7dz05MTk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/profootballtalk.nbcsports.com/b94d0b706358324b37d9a86ae7133b3a", "published_at": "2019-09-29"}