{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/sep/06/texas-gun-laws-mass-shootings-greg-abbott", "downloaded_at": "2019-09-06 12:13:17.755024+00:00", "title": "After its latest mass shootings, Texas leads the way – in loosening gun laws", "language": "en", "text": "Four of 10 deadliest massacres in the modern US occurred in the state but its governor has stuck to the NRA playbook\n\nHours after Texas suffered its latest mass shooting, when a gunman drove through Odessa on Saturday shooting randomly from an assault-style rifle and killing seven people, the state’s Republican governor, Greg Abbott, declared that he’d had enough.\n\n“I have been to too many of these events as governor,” he said. “I am tired of the dying in Texas. Too many Texans have lost their lives. The status quo in Texas is unacceptable and action is needed.”\n\nHis sense of urgency was all too understandable. Texas has been the scene of four of the 10 most deadly mass shootings in modern US history, including the Walmart massacre in El Paso last month in which a white supremacist murdered 22 people.\n\nAbbott’s call to action was surprising given the unique position he holds within the US gun debate. Under his leadership, Texas Republicans have forged a template for the rightwing response to mass shootings that has been emulated across the country and found a willing accomplice in Donald Trump on the national stage.\n\nThat template was fully on display on Sunday, the day after the Odessa shooting. As he was proclaiming that he’d had enough, nine new laws were coming into force – all of them signed by Abbott, all of them loosening gun controls.\n\nFacebook Twitter Pinterest Governor Greg Abbott attends a press briefing on 3 August with other Texas officials, following the mass shooting at a Walmart in El Paso. Photograph: Joel Angel Juarez/AFP/Getty Images\n\nThe new laws allow more armed marshals to patrol Texas schools. They permit citizens without a license to carry handguns in the middle of disaster zones, and they give the green light to licensed weapons being stored inside cars in school parking lots.\n\nAnother new rule clears the way for licensed handguns to be carried inside churches and other places of worship. The law comes into effect almost two years after the massacre at Sutherland Springs where 27 worshippers were gunned down as they prayed inside their Baptist church.\n\nAbbott’s template for dealing with mass shootings hails directly from the National Rifle Association (NRA), the pro-gun lobby that wields outsized influence over Republican politicians by funding their campaigns and grading their performances (the NRA gives Abbott an A+). One of the NRA’s key slogans is: “The only way to stop a bad guy with a gun is a good guy with a gun.”\n\nWhere action is to be taken, it is focused entirely on intercepting and punishing shooters. Since the Odessa rampage Abbott has proposed fast-tracking executions of mass shooters.\n\nOn Thursday he introduced eight executive orders designed to improve detection of suspicious activity by potential attackers. In all these moves, however, one thing has been conspicuously lacking – any attempt to tackle the root of the problem: easy access to powerful weapons that can kill large numbers within seconds.\n\nCritics of this approach argue that the idea that the answer to gun violence is to encourage more guns is perverse and a threat to public safety. “Until we see our leadership stand up to the NRA and implement basic solutions, we are going to have additional loss of life,” said Victoria Neave, a Democrat who represents Dallas in the Texas house (she gets a D grade from the NRA).\n\nNeave wrote to Abbott last month in the wake of the El Paso tragedy calling on him to convene a special session of the Texas legislature to “pass real reform that can save the lives of our fellow Texans”. She hasn’t received a reply.\n\nFacebook Twitter Pinterest Demonstrators open-carry rifles while holding flags during a pro-gun rally on the sidelines of the National Rifle Association annual meeting in Dallas, Texas, on 5 May 2018. Photograph: Laura Buckman/Bloomberg via Getty Images\n\nOne of the reforms that Neave and fellow Democrats want to see is the closure of a loophole in the system of background checks that regulates gun sales. As things stand in Texas, anyone can buy any number of deadly weapons – including AR-15-style rifles of the sort used in Odessa as well as an unlimited amount of ammunition in high-capacity clips – through the internet, at a gun show or even from a stranger on the street, no questions asked.\n\nClosing that loophole is one of the most basic demands of gun control advocates. They want every gun sale to be subject to federal background checks under the eye of the FBI to ensure deadly weapons do not fall into the wrong hands.\n\nThat is not an academic desire. The gunman in Saturday’s killing spree in Odessa had a criminal record as well as a history of mental illness, and had already failed a background check once. Yet he appears to have acquired his semi-automatic rifle legally from a private seller who was permitted under state law to make the exchange without any inspection.\n\n“We are in an extreme crisis situation,” Neave said. “Until we close those loopholes we are going to have more tragic events like Odessa.”\n\nTrue to his glowing NRA ranking, Abbott has consistently rebuffed efforts to introduce standard gun controls in his state. There are no “red flag laws” in Texas that would allow the temporary confiscation of weapons from a person who poses a threat to themselves or others.\n\nFacebook Twitter Pinterest People hold candles at the end of the prayer vigil at the University of Texas of the Permian Basin (UTPB) for the victims of the Odessa mass shooting on 1 September. Photograph: Cengiz Yar/Getty Images\n\nOnline gun sales are doing a raging business. A survey by Everytown for Gun Safety found that in 2018 there were more than 60,000 postings offering firearms for sale in Texas with no background checks required, more than 4,000 of which were of the semi-automatic style often used by mass shooters.\n\nYou can go on to the online salesroom Armslist.com and quickly find a dealer in Texas to sell you a military-looking semi-automatic rifle with extended clip for under $1,000. The firearms are listed as on sale through a “private party” and thus are exempt from all scrutiny.\n\nWithin months of taking office as governor in January 2015, Abbott stated his ambition: dramatically to increase gun ownership in the state. “I’m embarrassed,” he wrote in a tweet in 2015, noting that new gun purchases were running at a higher level in California. “Let’s pick up the pace Texans. @NRA”, he wrote.\n\nTexans duly obliged, with the number of active gun licenses shooting up from about 215,000 in 2000 to more than 1 million in 2018. There are now almost 1.4 million people with active firearms licenses in Texas.\n\nAs the number of guns has escalated, so too has gun violence. As the Giffords Law Center has pointed out, data compiled by the Centers for Disease Control shows that the gun murder rate in Texas has increased every year since 2014.\n\nFacebook Twitter Pinterest Gun enthusiasts look at rifles during the annual NRA convention in Dallas, Texas. Photograph: Lucas Jackson/Reuters\n\nThe annual death toll from firearms in the state now stands at more than 3,500 people. “In Texas we have seen the state not only refuse to pass safer gun laws, they’ve actually done the opposite – they’ve made gun laws even weaker and put Texans’ lives at risk,” said Peter Ambler, executive director of Giffords, the advocacy group led by the former US congresswoman and shooting survivor Gabby Giffords.\n\nIt’s not just the sheer number of guns swirling around that is the result of the Republican-NRA response to mass shootings. Abbott has also spearheaded a relentless drive towards loosening restrictions on where and how you can carry your weapons.\n\nIn June 2015, Abbott signed into law a provision that allows license holders to carry handguns openly in a holster in most public places (it was already legal to openly carry rifles). On the same day he exposed the campuses of all public universities and colleges to the concealed carry of licensed handguns.\n\nTo add insult to injury, the date on which that campus law kicked in was 1 August 2016 – 50 years to the day after a student-turned-gunman opened fire from the campus tower of the University of Texas at Austin, killing 17 people. The massacre went down as the first mass shooting in modern America.\n\nJennifer Glass, a liberal arts professor at the University of Texas at Austin, said she now walks through campus knowing anyone could be armed. “It’s anybody, anytime. People you see by the creeks, people you see late at night. We’ve had to acclimatize ourselves to the fact that any situation could be dangerous.”\n\nFacebook Twitter Pinterest A Texas flag flies at half mast during a prayer services at the La Vernia high school football stadium for the 26 victims killed at the First Baptist church of Sutherland Springs on 7 November 2017. Photograph: Scott Olson/Getty Images\n\nGlass was one of three professors who challenged the campus carry law on grounds that it violated their terms of employment and free speech rights. The case was dismissed last year, but she believes the stand they made was important.\n\n“As a university we are supposed to be committed to open dialogue,” she said. “But how can you openly discuss issues that have generated violence in the past – like abortion or race – knowing that some people in the lecture hall are packing loaded weapons?”\n\nAbbott and his Republican allies are playing a dangerous game by sticking so stubbornly to the purist NRA-approved template while more and more Texans die. Recent opinion polls have found that 72% of Texans now support a red-flag law, while 49% think gun laws should be more strict compared with only 17% who want to see them loosened.\n\nGlass believes that the Republicans are running against the desires of most Texans. “A minority of people who are armed to the teeth are imposing their views on the rest of us. They tell us the only way to protect ourselves from a lunatic with a firearm is to carry a gun, but we don’t want that – that’s why we have the police.”", "description": "Four of 10 deadliest massacres in the modern US occurred in the state but its governor has stuck to the NRA playbook", "authors": ["Ed Pilkington"], "top_image": "https://i.guim.co.uk/img/media/338426761c3132726669c56b39b4d3cd915eeb43/156_96_2562_1537/master/2562.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d6bb157707021964d002f7efe69be587", "published_at": "2019-09-06"}