{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/2/democrats-push-irs-nras-tax-exempt-status", "downloaded_at": "2019-10-02 15:29:09.690553+00:00", "published_at": "2019-10-02", "title": "Democrats push IRS on NRA's tax-exempt status", "language": "en", "text": "Senate Democrats on Wednesday called on the IRS to look into whether the NRA should be stripped of its tax-exempt status.\n\nSenate Minority Leader Charles E. Schumer and Sen. Ron Wyden, the ranking member on the Senate Finance Committee, questioned in a letter to the IRS whether the NRA’s “interactions” with Maria Butina, the Russian woman who was sentenced to prison for failing to register as a foreign agent and plotting to infiltrate the NRA and conservative U.S. political groups, and her Russian patron Alexander Torshin “violated the organization’s social welfare requirements.”\n\n“Specifically, in addition to multiple meetings between Russian individuals and NRA officials that took place within the U.S., NRA officials and donors met with a number of Russian companies, government officials and oligarchs closely connected to the Kremlin during the 2015 trip to Moscow,” the senators said in the letter. “The individuals and companies involved in the Moscow meetings included some that were the subject of U.S. sanctions at the time of those meetings.”\n\nThose findings were part of a 76-page investigative report that Mr. Wyden and Democrats on the Senate Finance Committee released last week that found that the NRA “became a foreign asset” for Russia ahead of the 2016 election.\n\nThe NRA last week dismissed the report as politically motivated.\n\nOn Wednesday, Mr. Schumer, of New York, and Mr. Wyden, of Oregon, said in the letter to the IRS that the report “confirms that some members of the NRA delegation participated in the Moscow trip primarily or solely for the purpose of advancing personal business interests, rather than advancing the NRA’s tax-exempt purpose.”\n\n“Given this report’s concerning findings and other allegations of potential violations of tax exempt law by the NRA, it is incumbent on the IRS to fully investigate the organization’s activities to determine whether the NRA’s tax exemption should be disallowed,” they wrote.\n\nThe Democrats said they are concerned that foreign adversaries could exploit tax-exempt groups “to undermine American interests.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Senate Democrats on Wednesday called on the IRS to look into whether the NRA should be stripped of its tax-exempt status.", "authors": ["The Washington Times Http", "Seth Mclaughlin"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/13/nra_board_meeting_38476_c0-0-2972-1732_s1770x1032.jpg?da9b8fa72323c94ef6f57cfe95e51bb4eed8a8e0"}