{"pub": "reuters", "url": "https://in.reuters.com/article/china-economy-loans/china-bank-loans-up-in-august-more-stimulus-expected-idINKCN1VW1C4", "downloaded_at": "2019-09-11 14:09:54.136569+00:00", "title": "China bank loans up in August, more stimulus expected", "language": "en", "text": "BEIJING (Reuters) - China’s banks extended new yuan loans in August as policymakers ratcheted up support for the slowing economy, and further policy easing is expected in coming weeks as the Sino-U.S. trade dispute takes a bigger toll on the economy.\n\nFILE PHOTO: A clerk counts Chinese 100 yuan banknotes at a branch of a foreign bank in Beijing, China January 4, 2016. REUTERS/Kim Kyung-Hoon/File Photo\n\nChinese regulators have been trying to boost bank lending and lower financing costs for more than a year, especially for smaller and private companies, which generate a sizeable share of the country’s economic growth and jobs.\n\nBut some analysts say credit demand has not picked up as much as expected, possibly because of weak domestic orders and the deepening U.S.-China trade war. That has reinforced views the government must roll out more stimulative measures to spur investment and stabilise economic activity.\n\n“August lending data is in line with market expectations. It shows increased support for the real economy. In the next step, monetary policy is expected to be preemptive and flexible, there is room for cutting interest rates and reserve requirements,” said Wen Bin, economist at Minsheng Bank in Beijing.\n\nBanks extended 1.21 trillion yuan ($170 billion) in new loans in August, up from July and exceeding analyst expectations, People’s Bank of China (PBOC) data showed on Wednesday.\n\nAnalysts polled by Reuters had predicted new yuan loans would rise to 1.2 trillion yuan in August, up from 1.06 trillion yuan the previous month and compared with 1.28 trillion yuan a year earlier.\n\nHousehold loans, mostly mortgages, rose to 653.8 billion yuan in August from 511.2 billion yuan in July, while corporate loans climbed to 651.3 billion yuan from 297.4 billion yuan.\n\nBroad M2 money supply in August grew 8.2% from a year earlier, above estimates of 8.1% forecast in the Reuters poll. It rose 8.1% in July.\n\nOutstanding yuan loans grew 12.4% from a year earlier - in line with expectations but slower than July’s 12.6%. Some analysts say the annual comparison is a better way to assess trends in China’s credit growth, rather than more volatile monthly readings.\n\nMORE EASING EXPECTED\n\nLast week, China’s central bank announced it would cut the amount of cash that banks must hold as reserves for the third time this year, releasing 900 billion yuan ($126.35 billion) in liquidity.\n\nAnalysts expect more policy easing in coming weeks as the world’s second-largest economy faces growing pressure from escalating U.S. tariffs and sluggish domestic demand.\n\nThe central bank is widely expected to cut one or more of its key policy interest rates in mid-September - for the first time in four years - as it seeks to cut corporate funding costs.\n\nGrowth of outstanding total social financing (TSF), a broad measure of credit and liquidity in the economy, rose 10.7% in August from a year earlier, unchanged from the pace in July.\n\n“Looking ahead, credit growth should start to edge up again if, as we expect, the PBOC supplements last week’s announced RRR cuts with lower rates on its lending facilities,” analysts at Capital Economics said in a note, referring to the cut in the reserve requirement ratio.\n\n“However, the pick-up is likely to remain smaller than during past easing rounds.”\n\nTSF includes off-balance sheet forms of financing that exist outside the conventional bank lending system, such as initial public offerings, loans from trust companies and bond sales.\n\nIn August, TSF rose to 1.98 trillion yuan from 1.01 trillion yuan in July. Analysts polled by Reuters had expected August TSF of 1.55 trillion yuan.\n\nChina has allowed local governments to issue more debt this year as part of a plan to accelerate infrastructure spending and stoke domestic demand.\n\nLast week, the cabinet said local governments would be allowed to issue special purpose bonds earlier than normal next year to help steady growth.\n\nThe United States began imposing 15% tariffs on a variety of Chinese goods on Sept. 1 - including footwear, smart watches and flat-panel televisions - as China began imposing new duties on U.S. crude, the latest escalation in the trade war.\n\nChina’s economic growth slowed to a near 30-year low of 6.2% in the second quarter, with analysts expecting some stabilisation as earlier stimulus measures start to kick in.\n\nBut the latest tariff threat is likely to weigh further on exporters and their domestic supply chains, pointing to more weakness in China’s exports while consumption slows.", "description": "China's banks extended new yuan loans in August as policymakers ratcheted up support for the slowing economy, and further policy easing is expected in coming weeks as the Sino-U.S. trade dispute takes a bigger toll on the economy.", "authors": ["Judy Hua", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190911&t=2&i=1428658182&w=1200&r=LYNXNPEF8A0ST", "published_at": "2019-09-11"}