{"pub": "breitbart", "url": "https://breitbart.com/entertainment/2019/10/02/john-legend-trump-is-threatened-by-women-who-are-not-submissive-to-him", "downloaded_at": "2019-10-05 06:01:11.532842+00:00", "title": "John Legend: Trump Is ‘Threatened’ By Women Who Are Not ‘Submissive to Him’", "language": "en", "text": "Grammy-winning artist and prominent left-winger John Legend said during an interview with NPR on Tuesday that President Donald Trump is “threatened” by women who are not “submissive to him.”\n\nThe “All of Me” singer made the claim in response to question about his wife, Chrissy Teigen, who has had an ongoing beef with Trump, recently calling him a “pussy ass bitch.”\n\n“He called her a filthy-mouthed wife. So he called me a boring singer. John Legend and his filthy-mouthed wife didn’t praise him,” Legend said. “He just wanted to mention her because I think she’s been a foil to him in the past. He’s blocked her in the past, and I think he’s always threatened by women that have their own voice and aren’t submissive to him.”\n\nA social media war exploded following Legend and Teigen’s participation in a criminal justice reform town hall on NBC this month.\n\n“Guys like boring musician John Legend and his filthy-mouthed wife, are talking now about how great it is — but I didn’t see them around when we needed help getting it passed,” Trump tweeted.\n\nWhen all of the people pushing so hard for Criminal Justice Reform were unable to come even close to getting it done, they came to me as a group and asked for my help. I got it done with a group of Senators & others who would never have gone for it. Obama couldn’t come close…. — Donald J. Trump (@realDonaldTrump) September 9, 2019\n\n….musician @johnlegend, and his filthy mouthed wife, are talking now about how great it is – but I didn’t see them around when we needed help getting it passed. “Anchor”@LesterHoltNBC doesn’t even bring up the subject of President Trump or the Republicans when talking about…. — Donald J. Trump (@realDonaldTrump) September 9, 2019\n\nTrump did not tag Teigen, driving the tweet in which she described the president as a “pussy ass bitch.”\n\nlol what a pussy ass bitch. tagged everyone but me. an honor, mister president. — christine teigen (@chrissyteigen) September 9, 2019\n\nthe absolute best part of his tweet is I literally didn't speak in the special, nor was I mentioned. I'm cackling at the pointless addition of me because he cannot not be a bitch pic.twitter.com/9ZkV7bh4FA — christine teigen (@chrissyteigen) September 9, 2019\n\n“It’s because she basically called him out for – because he atted (ph) me. You know, people that do Twitter a lot, you understand what atting means, which basically you mention their Twitter handle so that they see it in their mentions. He atted me. He atted Van Jones. He atted, you know, several other people. And the only person he did not actually at in that was filthy-mouthed wife,” Legend told NPR.\n\n“She was basically like, why didn’t you at me?… That’s how that got trending,” the Grammy-winner added.\n\nLegend told NPR that there are days he refuses to look at his mentions on Twitter, particularly when there is a story drawing the attention of so-called “the MAGAS.”\n\n“I often will go through days where I don’t look at my mentions, particularly when I know there’s some story that brought me to the attention of the MAGAs out there,” he said. “When they kind of mobilize around hating you, your Twitter mentions are just an utter mess. And so there’s some days where I just won’t look at it, and it’s fine.”\n\nThis is hardly the first time the Oscar-winning singer has lashed out at the president.\n\nLegend described Trump as a “flaming racist,” “piece of shit,” and “evil fucking canker sore on America’s whole landscape” during a brief interview with TMZ over the summer.", "description": "John Legend said during an interview with NPR on Tuesday that President Trump is \"threatened\" by women who are not \"submissive to him.\"", "authors": ["Hannah Bleau"], "top_image": "https://media.breitbart.com/media/2017/04/JohnLegendTrumpCorrupt.jpg", "published_at": "2019-10-02"}