{"pub": "nationalreview", "url": "https://cincinnati.com/story/news/politics/2019/05/01/cincinnati-flying-pig-marathon-dont-cheat-man-might-catch-you/3640249002/?fbclid=IwAR1FhsxDKqP7BcFfwJ_ykXaImcgDBb8aPelTnw8ah9DrbfuFV9dHU0h6oZg", "downloaded_at": "2019-10-05 06:05:45.167413+00:00", "title": "Marathon cheaters, beware. This man is out to catch you.", "language": "en", "text": "CLOSE The Flying Pig Marathon weekend is a treasured Cincinnati tradition the first week in May in Greater Cincinnati. Melanie Laughman, mlaughman@enquirer.com\n\nDerek Murphy was suspicious even before he knew the man’s name.\n\nSitting on the couch in his living room, Murphy squinted at the color-coded spreadsheet on his laptop, checking and re-checking the finish times for this year’s Boston Marathon. Something about the time for runner No. 9974 didn’t add up.\n\nThe first race checkpoint recorded the man running a pace of about 11 minutes per mile, yet his 3-hour finish meant he had to average a 7-minute pace the entire way.\n\nThen Murphy noticed something else: The same runner missed almost every other checkpoint between the start of the race and the finish line. It was as if he’d vanished for most of the 26.2 miles.\n\nMurphy was sure now. He’d caught another cheater.\n\n“Sometimes,” he said. “You just know.”\n\nDerek Murphy, a financial analyst from Lebanon, Ohio, is pictured, Wednesday, April 24, 2019, at Bechtold Park in Sycamore Township. A runner himself, he is behind marathoninvestigation.com, looking into those who cheat while running marathons. (Photo: Kareem Elgazzar/The Enquirer)\n\nMurphy’s hunches are right more often than not. The middle-aged dad from suburban Lebanon is a financial analyst, a runner of modest talent and the world’s most prolific hunter of people who cheat at marathons.\n\nHe didn’t set out to be that guy, the one pointing fingers at liars and course-cutters who take home medals they don’t deserve and brag on Instagram about finish times they didn’t earn.\n\nMore: Flying Pig streakers are a thing – but it's probably not what you think\n\nYet here he is, race after race, outing cheaters on his website, marathoninvestigation.com. He does it after most big races, as well as some small ones, and he’ll do it again Sunday when he downloads the official results of Cincinnati’s Flying Pig Marathon.\n\nMurphy describes his detective work as a hobby, but that isn’t entirely right. Stamp collecting is a hobby. Knitting is a hobby.\n\nCatching cheaters is something else entirely. What Murphy does is more of a calling. He pushes back against the notion that a little cheating here or there is no big deal, that dishonesty is just part of the game, or, in this case, the race.\n\n“It’s a slap in the face to the people who put the work in,” Murphy said. “It gets at me.”\n\nHe fights back with all the tools at his disposal: Official results, checkpoint times, course maps, a runner’s race history, eyewitness accounts and photos from the day of the race. He relies on intuition, too, as he did with runner No. 9974 in Boston.\n\nIn that case, the numbers told the story. But the clincher, for Murphy, was the photo after the race, in which the runner smiled for the camera as his finisher’s medal rested on a belly that seemed unlikely to belong to a 3-hour marathon runner.\n\n“He didn’t look the part,” said Murphy, who’s never finished a marathon in less than 5 hours. “He’s kind of built like me.”\n\nDerek Murphy, a financial analyst from Lebanon, Ohio, is pictured, Wednesday, April 24, 2019, at Bechtold Park in Sycamore Township. A runner himself, he is behind marathoninvestigation.com, looking into those who cheat while running marathons. (Photo: Kareem Elgazzar/The Enquirer)\n\nLooking out for honest runners\n\nMurphy, a veteran of about a dozen marathons and ultra-marathons, has no delusions about his running ability. “I can move very slowly for a long time,” he said.\n\nBut he’s a world-class talker when the subject is something he’s passionate about, like running or Excel spreadsheets. Or Excel spreadsheets about running. The words fly when he talks about his work.\n\nMurphy sees in numbers a way to get at a quantifiable truth, something he can measure when other details are muddy. People might lie. But numbers, those he can trust.\n\nSo when Murphy got curious about marathon cheating in 2015, he knew his spreadsheets were the way to get to the bottom of things.\n\n“It started out as an interest,” he said. “A fascination about why people did it and how they did it.”\n\nHe’s confident most runners would rather burn their favorite shoes than claim a time they didn’t earn. But if thousands of runners participate in a marathon, Murphy knows the odds are good a few cheaters are in the mix.\n\nIt may be a sad commentary on human nature, but it’s good for Murphy’s website, which can earn him $1,000 or more a month in advertising and donations, depending on how the cheat-catching business is going.\n\nThe week after the Boston Marathon, his site averaged about 50,000 views a day. The article he wrote about runner No. 9974 got 145,000 views.\n\nHe gets his material from race results and tipsters, who fill his inbox with news of racing malfeasance. One day it’s a woman in Duluth who swapped racing bibs with a faster runner. The next it’s a man in New Orleans who cut short the course in a half-marathon.\n\nRunners who follow the rules flock to the site to vent about the scofflaws. “I find cheating so frustrating,” one commenter wrote after finding out about runner No. 9974.\n\nOthers take it personally: “Him smiling with that medal … what a turd,” wrote another.\n\nThough there’s no shortage of righteous indignation among his readers, Murphy usually lets the numbers do the talking. He said he’s less interested in shaming cheaters than in helping runners who, because of those cheaters, finish lower in the official results, miss out on an age-group medal or fail to qualify for a premier marathon like Boston.\n\nThe runners who suffer are rarely elite. They are dentists and warehouse workers, accountants and cops, people whose greatest athletic achievement is crossing a marathon finish line. Murphy knows them because he’s one of them.\n\n“That’s really why I do it,” he said.\n\nThe Boston Marathon, a race he’s certain he’ll never qualify for, is particularly close to Murphy’s heart. People work hard to make the field of 30,000, he said, so he works hard to catch bogus qualifiers who might take the spots of legitimate runners.\n\n“If I can stop 50 people from missing Boston,” he said, “it’s worth it.”\n\nFrom Rosie Ruiz to Mrs. Manziel\n\nBoston is where it started for Murphy. After the 2015 race, he heard rumors about people cheating in qualifying marathons and wondered how often it happened.\n\nHe started digging into the results, comparing qualifying times from marathons in places like Chicago and Cincinnati to the same runners’ times at Boston. If there was a big difference, Murphy dug deeper.\n\n“I was trying to find people who shouldn’t have been there,” he said.\n\nAnd he did. At least 60 runners were, in his view, stone cold cheaters. In most cases, he found they ran slower, probably legitimate times at Boston, but they cut the course or cheated in some other way in the qualifying race to get to Boston.\n\nMurphy was surprised to find so many, if only because cheating is harder than ever. Courses are monitored, cameras are everywhere and computer chips in the runners’ bibs track not only their finish times but their times at various checkpoints.\n\nRosie Ruiz, America’s most notorious marathon cheat, would find it impossible today to jump into the Boston Marathon a mile from the finish and claim victory, as she did in 1980.\n\n“It’s pretty closely monitored,” said Iris Simpson Bush, executive director of the Flying Pig. Only a handful of discrepancies have come up over the years in Cincinnati, she said, and none were confirmed as cheating.\n\n“It does happen, you could never deny it does,” she said. “But it isn’t prevalent.”\n\nStill, cheaters find a way. Murphy has written about people who slip in and out of races, about a wife who switched bibs with her husband to win age-group medals, and about a man who carried a stack of bibs during a race so slower runners could qualify for Boston with his time.\n\nSometimes, Murphy even encounters a D-list celebrity or two. He broke out his spreadsheets in March when fitness model Bre Tiesi, soon-to-be ex-wife of quarterback Johnny Manziel, was accused of cutting the course in a half-marathon.\n\nMurphy found Tiesi would have had to run a 4-minute mile pace for the second half of the race to post the finishing time she claimed. Either Tiesi had just run six miles faster than any human in history, or she’d cheated.\n\nHow do runners like Tiesi react when he calls them out? Murphy shrugged.\n\n“It’s not usually positive,” he said.\n\n'Play by the rules'\n\nMurphy said he tries to contact runners with questionable results before posting a story about them. Sometimes there’s an explanation for the discrepancies – a wrong turn on the course, a malfunctioning chip, an honest mistake.\n\nSometimes cheaters admit what they did and disqualify themselves, and sometimes there are excuses or more deception. Murphy believes one runner went so far as to fake GPS data from her watch to cover her tracks.\n\n“If they admit it and withdraw, I don’t write about it,” Murphy said. “It’s when they double down that it gets interesting.”\n\nEvery now and then, things get ugly. One person threatened Murphy’s wife on Facebook and another made references to mass shootings while griping about him.\n\nThe confrontations are the hardest part for Murphy. He enjoys the chasing more than the catching.\n\n“I like doing the work, figuring it all out,” he said. “I don’t like conflict.”\n\nMurphy doesn’t speculate about why runners cheat. He knows some are desperate to qualify for Boston, but for the rest, the motive seems to be little more than a desire to post a photo on social media and bring home a medal.\n\nJack Lesyk said that sounds about right. He’s a runner and a clinical psychologist at the Ohio Center for Sports Psychology.\n\nHe said people driven primarily by internal forces set personal goals and work to achieve them, while those driven by external forces want validation from others in the form of trophies, praise and Facebook likes.\n\nIt’s that latter group, he said, that’s most likely to cheat. And although some might consider course-cutting or bib-swapping a victimless crime, Lesyk said there’s value in Murphy’s work.\n\n“I really do think we should take a strong stand,” he said. “If you’re going to play, play by the rules.”\n\nBut does Murphy’s sleuthing really matter, or is it, as some of the people he’s caught have claimed, just another form of public shaming? Should he take the advice he hears most often from them and just “get a life”?\n\nOn his bad days, Murphy wonders about that himself. “Sometimes I get burned out on it,” he said. “I step away a little.”\n\nBut then he’ll get a tip about an egregious case, or he’ll skim some race results and see a few numbers that don’t add up. He’ll think about the runners who do things the right way, the ones, like him, who train long hours and run long distances and expect nothing more than an honest race.\n\nAnd he’ll just know. It’s time to get back to work.\n\nRead or Share this story: https://www.cincinnati.com/story/news/politics/2019/05/01/cincinnati-flying-pig-marathon-dont-cheat-man-might-catch-you/3640249002/", "description": "Cincinnati's Flying Pig Marathon is Sunday. Derek Murphy will be watching to make sure everyone follows the rules.", "authors": ["Dan Horn", "Published P.M. Et May"], "top_image": "https://www.gannett-cdn.com/presto/2019/05/01/PCIN/5db358bd-0973-4d4c-80fc-a1ee099243c8-042419_MARATHONINVESTIGATOR_12.jpg?crop=4452,2492,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-05-01"}