{"pub": "cbc", "url": "https://cbc.ca/news/politics/scheer-provincial-free-trade-challenges-1.5321887", "downloaded_at": "2019-10-16 08:29:55.249070+00:00", "title": "Interprovincial free trade within 100 days? History isn't on Scheer's side | CBC News", "language": "en", "text": "The date has been set, even if the formal invitations have yet to be sent out.\n\nNow all that remains is for Andrew Scheer to find a way to deliver on a promise that has eluded every Canadian prime minister since Confederation.\n\nOn Tuesday, the Conservative leader offered a preview of what he hopes to accomplish during his first 100 days in office — should he win the Oct. 21 election. And at the head of the list is a vow to broker a new, internal free-trade agreement that would eliminate all interprovincial barriers.\n\n\"These barriers prevent the free flow of people, goods and services across provincial borders. They make it more expensive to run a business. They hurt consumers with higher prices and less competition and they discourage and frustrate big dreaming innovators who want to change the world,\" Scheer said during a campaign stop in Quebec City. \"It should not be easier to trade with other countries than between Canadian provinces. We are one free country. We should have one free market.\"\n\nThe meeting between Scheer and the premiers is tentatively scheduled for Jan. 6, 2020, in Ottawa, 77 days after a presumed Conservative victory.\n\nBut even if the Tory leader manages to get everyone around the table, forging a consensus on coast-to-coast-to-coast free trade will prove somewhere between difficult and practically impossible.\n\nThe last interprovincial deal , concluded in 2017 after two years of federal-provincial-territorial negotiations, resulted in an agreement that has \"free trade\" in the title but hardly anywhere in the fine print, with each party listing dozens of protectionist carve-outs.\n\nEconomist Daniel Schwanen, the vice-president of research for the C.D. Howe Institute, says that was actually progress.\n\n\"The good thing about the last deal is that it does list the exceptions. It's actually transparent,\" he says. \"And that at least sets the agenda for future talks.\"\n\nSchwanen believes that there might be some momentum toward freer interprovincial trade — a number of \"pro-business\" provincial governments have been elected; Alberta's Jason Kenney and Manitoba's Brain Pallister have both talked about unilaterally lifting some of their own barriers; and the uncertainty surrounding the recent NAFTA negotiations gave everyone a good scare. But that's probably not enough to overcome ingrained, institutionalized protectionism in areas like trucking, or supply-managed products like poultry, eggs and dairy.\n\n\"Everyone agrees that free trade is a good thing. Then the rubber hits the road,\" says Schwanen. \"Honestly, it's tricky.\"\n\nSylvain Charlebois, a professor in food distribution and policy at Dalhousie University, says he doesn't perceive any provincial desire to start dismantling the country's powerful marketing boards.\n\n\"It's a big deal. You would need the consent of all 10 provinces to revise the Canadian Dairy Act,\" he says. \"Poultry and eggs, the same thing.\"\n\nCharlebois cites the barriers against interprovincial trade of alcohol as an example of the obstacles in Scheer's chosen path. Wineries and craft brewers from B.C. to Nova Scotia would love to be able to compete against each other in the open market and ship their products directly to consumers across the country. But each province sets its own rules for distribution, often requiring producers to use Crown liquor agencies as a middleman.\n\nLast year, Gerard Comeau, a New Brunswick man who was fined $292.50 by the RCMP for driving across the provincial border with Quebec to buy 14 cases of suds and three bottles of booze, took his quest to \"free the beer\" all the way to the Supreme Court of Canada and lost . The justices unanimously ruled that provinces and territories have the constitutional right to restrict the importation of goods across provincial and territorial borders — as long as the primary aim of the restriction is not to impede trade.\n\nLiberalizing the trade of alcoholic beverages was something the provinces tried — and failed — to do during the negotiations for the 2017 deal. And they've been working on the problem ever since. Ottawa removed the final federal barrier to the cross-country trade of booze in last spring's budget. But so far, the only measurable progress from the provinces has been the unveiling of an \"action plan\" which promises to establish working groups and an online information hub.\n\nThe crux, says Charlebois, is that there doesn't seem to be much desire for change in Ontario and Quebec, where most of the country's food processing happens, and the provinces control large and profitable liquor monopolies.\n\n\"I don't see how Mr. Scheer could be successful,\" he says. \"I'm glad it's coming up as an issue, but I'm not sure that it has any retail political value. I don't think that most Canadians care about interprovincial barriers.\"\n\nStephen Harper paid lip service to internal Canadian free trade, but could hardly bring himself to attend first ministers meetings during his just-short-of-a-decade in power. Justin Trudeau has taken a friendlier tack, but has made little progress on the national trade file.\n\nThat stasis is now something of a Canadian tradition, says Brian Lee Crowley, the managing director of the Macdonald-Laurier Institute, an Ottawa think-tank.\n\n\"Interprovincial free trade was part of the reason that Confederation came into being in 1867,\" he says. \"We've literally been talking about it since the beginning.\"\n\nIn 2018, Crowley co-authored an op-ed with Manitoba Premier Brian Pallister calling on the federal government to introduce a Charter of Economic Rights and enshrine barrierless trade in the Constitution.\n\n\"It's the only way we're going to make progress,\" says Crowley. \"Calling the premiers around the table again without putting pressure on them is not going to get results.\"\n\nOf course, such a power play — Crowley calls it the \"nuclear option\" — would raise hackles; especially in Quebec.\n\nThe question then becomes whether a Prime Minister Scheer would have the taste for confrontation, should co-operation fail yet again.\n\nEither way, the smart money says that it will take a fair sight longer than 100 days to finally achieve free trade within Canada.\n\nAfter all, the original 1867 promise is now 55,623 days old and counting.", "description": "Conservative leader Andrew Scheer has already set a date for a premiers meeting on interprovincial free trade. But the cross-country barriers will be difficult to dismantle.", "authors": ["Jonathon Gatehouse", "Has Covered News", "Politics At Home", "Abroad", "Reporting Dozens Of Countries. He Has Also Written Extensively About Sports", "Including Seven Olympic Games", "A Best-Selling Book On The Business Of Pro-Hockey."], "top_image": "https://i.cbc.ca/1.5321916.1571173730!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/fedelxn-campaign-20191015.jpg", "published_at": "2019-10-16"}