{"pub": "time", "url": "https://time.com/5548047/how-an-italian-hospital-saved-patients-from-nazis-by-inventing-a-fake-disease", "downloaded_at": "2019-09-10 07:43:06.325123+00:00", "title": "How an Italian Hospital Saved Patients From Nazis by Inventing a Fake Disease", "language": "en", "text": "This post is in partnership with History Today. The article below was originally published at History Today.\n\nBehind the closed doors of the Fatebenefratelli hospital in Rome was a ward filled with patients being treated for K Syndrome. This new and unfamiliar disease — whose name evoked Koch Syndrome (tuberculosis) — was a strong deterrent to the occupying Nazi soldiers who carried out routine searches of the hospital for Jews, partisans and anti-fascists. Fearing infection, the Nazis did not dare enter the ward, turning their attention elsewhere.\n\nPatients in this ward had been hospitalized and classified as suffering from K Syndrome in late 1943. On Oct. 16 of that year, the Nazis combed the Jewish ghetto and other areas of Rome, deporting about 1,200 Jews. Only 15 survived the camps. After this, the hospital’s doctors and friars welcomed ever-increasing numbers of patients. These patients were, however, refugees. K Syndrome was an invented illness.\n\nIt was created by Giovanni Borromeo, the hospital’s head physician, with the assistance of its other doctors, with the intention of saving those Jews and anti-fascists who sought refuge there. Born in 1898, Borromeo was an avowed anti-fascist. Before taking his post at Fatebenefratelli, he had been offered the position of head physician in two other hospitals, but rejected both as they required that he become a member of the Fascist Party. He accepted the job at Fatebenefratelli as it was run by Catholic friars and, according to an agreement between the Catholic Church and the fascist regime, was therefore considered a private hospital, detached from state regulations. It did not require its employees to belong to a political party.\n\nAt the hospital, Borromeo hired many physicians who had been discriminated against by the regime for various reasons. Among them was the Jewish doctor Vittorio Emanuele Sacerdoti, who hid some of the survivors from the events of Oct. 16 in the hospital. In the following months, it became a center of political resistance.\n\nBut anti-fascist resistance at Fatebenefratelli was not confined to K Syndrome. In collaboration with the friars, Borromeo and his allies installed a radio station inside the hospital and used it to communicate with partisans in order to organize their fight. When Borromeo and the friars realized that the Nazis had identified the position of the radio, they threw everything in the Tiber.\n\nHistory Newsletter Stay on top of the history behind today’s news. View Sample Sign Up Now\n\nFatebenefratelli’s position on Tiber Island and its proximity to the ghetto created suspicion among Nazi officials. Borromeo and his colleagues prepared for the inevitable visit. Hospitalized Jews (and other “political” patients) were listed in official documents as suffering from K Syndrome. The name, however, was also something of a risky joke: Borromeo named the fictitious disease “K” after either Albert Kesselring or Herbert Kappler. Kesselring was the Nazi Commander-in-Chief South, and ordered Kappler, who was Nazi police chief of Rome, to undertake the massacre at the Ardeatine Caves, where 335 people (soldiers and civilians) were killed. Both Kesselring and Kappler were tried for war crimes and convicted after its end.\n\n“K Syndrome” soon became a code which referred to the people hidden in the hospital. Adriano Ossicini (who later became Italy’s Minister of Health in the 1990s), among others, wrote messages to Borromeo asking for a precise number of beds to be reserved for K patients, who would arrive at the hospital within the following days. The hospital accepted refugees until the day the allies entered and liberated Rome.\n\nPietro Borromeo, Giovanni’s son, revealed that, as expected, at the end of October, the Nazis carried out a search for Jews and anti-fascists at Fatebenefratelli. Borromeo took them around the hospital and described, in detail, the terrible effects K Syndrome had on its victims. Having done so, he invited them to search the wards. The Nazis, who Pietro Borromeo says were accompanied by a doctor, rejected the invitation and left without further inquiry.\n\nThere are different versions of how the Nazis searched for the Jews in the hospital, different accounts of Borromeo’s misdirection and varied estimates of the numbers of lives saved. Each version confirms the invention of K Syndrome. Pietro Borromeo suggested that the entire venture was a planned and systematized campaign in the fight against fascism, while the physicians Ossicini and Sacerdoti conversely suggested that it was mostly improvised, one of the many forms of spontaneous and unorganized resistance to the dictatorship.\n\nWhatever the reality of the story, we know that K Syndrome kept the Nazis away from the “patients” and that the invented disease saved many lives. Borromeo’s bravery has been recognized in both Italy and internationally. In 2004, years after his death in 1961, Yad Vashem, Israeli’s official memorial to the victims of the Holocaust, recognized him as one of the Righteous among the Nations, an honor bestowed on gentiles who risked their lives to save Jews during the Holocaust.\n\nLike other men and women who hid the Jews in their homes, in public spaces, or who lied to save them, the doctors and friars at Fatebenefratelli put their own lives and freedom at serious risk. But the story also shows the ambivalent role of the Catholic Church under fascism: it was an institution that sometimes pretended not to see what was happening in Mussolini’s Italy, but at other times supported the fight against tyranny.\n\nNazi officials in Rome never became aware that K Syndrome did not exist. This was one instance where disinformation, fear and ignorance worked as a force for good.\n\nFrancesco Buscemi is a cultural historian. His latest book is From Body Fuel to Universal Poison (Springer, 2018).\n\nContact us at editors@time.com.", "description": "In one Italian hospital, an invented disease helped save hundreds of patients from the occupying Nazis. Here's how it happened.", "authors": ["Francesco Buscemi", "History Today"], "top_image": "https://timedotcom.files.wordpress.com/2019/03/tiber.jpeg?quality=85&w=1200&h=628&crop=1", "published_at": "2019-03-08"}