{"pub": "yahoo", "url": "https://sports.yahoo.com/the-antonio-brown-drama-has-a-new-chapter-hes-unhappy-the-raiders-fined-him-152415827.html", "downloaded_at": "2019-09-04 23:48:13.946229+00:00", "published_at": "2019-09-04", "title": "Antonio Brown unhappy Raiders fined him for missing practice", "language": "en", "text": "If you thought Antonio Brown would be quiet and play after the summer he’s had, you’d be wrong.\n\nHaving already gotten what he wanted, forcing the Pittsburgh Steelers to trade him to an acceptable team and get that team, the Oakland Raiders, to give him a raise, then starting drama over his helmet that required two grievances against the NFL (he lost both) and missed training camp practice time plus the infamous freeze burns on his feet that also contributed to his missing time, Brown still isn’t happy.\n\nScroll to continue with content Ad\n\nAnd he’s taking his unhappiness public.\n\nOver $50,000 in fines\n\nAntonio Brown complained on Instagram that the Oakland Raiders fined him for missing a training camp practice and walkthrough. (AP)\n\nOn Wednesday, Brown posted a photo to his Instagram stories of a letter he received from Raiders general manager Mike Mayock.\n\nIn it, Mayock details that Brown is being fined $13,950 for not participating in the team’s August 22 walkthrough, and since it was an unexcused absence, the team is docking him the amount allowed by the collective bargaining agreement.\n\nThe letter also says that Brown had been fined $40,000 previously, for skipping training camp on August 18.\n\nAugust 18 is the day that Mayock finally spoke out about the team’s frustrations with Brown, saying the team had supported Brown through his helmet ordeal but that it was “time for him to be all in or all out.”\n\nOn August 22, Brown and the Raiders were in Canada to play a preseason game against the Green Bay Packers later that night. As noted by former NFL offensive lineman Geoff Schwartz, that walkthrough Brown skipped was very likely in a conference room in the team hotel around midday.\n\nSo Brown is upset at the team for fining him for intentionally missing work. Sounds pretty on brand.\n\n‘Your own team want to hate’\n\nBrown added some text to the photo of the letter, writing, “When your own team want to hate but there’s no stopping me now...Devil is a lie. Everyone got to pay this year...So we clear.”\n\n[Watch live local and primetime NFL games free with the Yahoo Sports app]\n\nIn this case, it looks like Brown is the only one paying.\n\n(Antonio Brown/Instagram)\n\nOr maybe Oakland is too, for believing that Brown wouldn’t be a pill.\n\nFines aren’t always collected\n\nFormer Raiders team president Amy Trask, who offers insight and opinion on league matters, tweeted that often teams don’t actually collect fines, but that the letters are sent to reserve their right to do so.\n\nBut the Raiders did collect the $53,950, according to ProFootballTalk.\n\nMore from Yahoo Sports:", "description": "Brown posted a fine letter from GM Mike Mayock on Instagram.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/CXGwCaFileSz.MQamLGNIQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/LywKbxSH245lYy4CUWhndw--~B/aD0yMDAxO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/cc793340-cf27-11e9-bbaf-c7741e8fd6e2"}