{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1WG4NZ-OCASP", "downloaded_at": "2019-10-02 00:38:20.012305+00:00", "title": "Brazier destroys the field to clinch first 800 meters title for U.S.", "language": "en", "text": "DOHA (Reuters) - Donavan Brazier stormed home and broke the world championship record to claim a first-ever world title for the United States in the men’s 800 meters on Tuesday.\n\nAthletics - World Athletics Championships - Doha 2019 - Men's 800 Metres Final - Khalifa International Stadium, Doha, Qatar - October 1, 2019 Donavan Brazier of the U.S. celebrates winning gold REUTERS/Ahmed Jadallah\n\nThe 22-year-old, running in his first world or Olympic final, destroyed the field as he raced past Puerto Rican Wesley Vazquez with 300 meters left to win in one minute 42.34 seconds.\n\nBosnia’s Amel Tuka, who won the bronze in Beijing in 2015, went one better by taking the silver, his country’s best-ever result in any event at the championship, and Kenya’s Ferguson Cheruiyot Rotich got the bronze.\n\nBrazier’s win came less than 24 hours after Alberto Salazar, the head coach at the Nike Oregon Project (NOP) where he trains, was banned for four years by the U.S. Anti-Doping Agency for “orchestrating and facilitating prohibited doping conduct”.\n\nSalazar has denied wrongdoing and vowed to appeal and sportswear giant Nike has said it will stand by the 61-year-old American.\n\nBrazier said he had not been distracted by the Salazar issue. “Not at all, I mean he’s not my coach,” he told reporters, adding that his coach was Pete Julian.\n\n“The only contact I’ve had with Alberto has been pleasant. I like Alberto, he’s a cool guy... I’m just really happy to win the race and get a gold medal out of today.”\n\nBrazier was left out of the U.S. team for the Rio de Janeiro Olympics as a 19-year-old and then eliminated in the semi-finals at the world championships in London two years ago. Last year, he was hampered by injury but this season he has found his form.\n\n“I’ve said all season that my goal was to get the gold here and to break this record, and that’s what I did,” he said. “It means the world to me. To be world champion at 22 years old, I can’t believe it.”\n\nThe race was left wide open after Botswana’s Nijel Amos, one of the favorites, withdrew before his opening heat on Saturday with an Achilles injury and titleholder Pierre-Ambroise Bosse was eliminated in the semi-finals.\n\nVazquez quickly took the initiative and led at the bell with Brazier tucked in behind and Tuka in third.\n\nThere was never any doubt above the outcome when Brazier made his move down the back straight while Vazquez was also overhauled by Tuka and Rotich on the final bend.", "description": "Donavan Brazier stormed home and broke the world championship record to claim a first-ever world title for the United States in the men's 800 meters on Tuesday.", "authors": ["Brian Homewood", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191001&t=2&i=1435995119&w=1200&r=LYNXMPEF903CK-OCASP", "published_at": "2019-10-01"}