{"pub": "yahoo", "url": "https://sports.yahoo.com/for-cc-sabathia-title-aspirations-come-before-personal-goals-183226827.html", "downloaded_at": "2019-09-19 06:04:32.094510+00:00", "title": "Whether he makes Yankees roster or not, CC Sabathia just wants one more World Series win", "language": "en", "text": "NEW YORK – The pursuit of a storybook ending to his career, complete with another World Series win, allows CC Sabathia to swallow his pride for the greater Yankee good.\n\nThe Yankees, whose magic number is one to clinch their first AL East title since 2012, will soon determine their ALDS roster.\n\nWhether Sabathia, who has battled injuries while posting the second-highest ERA of his career, will be part of such roster is a question hanging over the team.\n\nScroll to continue with content Ad\n\nNo matter the decision, Sabathia is OK with the outcome.\n\n“I want to win a World Series more than anybody here, I think. If that means I’m off the roster, I don’t mind that at all — at all,” Sabathia told Yahoo Sports. “I don’t think it’s about really me. This team has the chance to do something special. We’ve been doing special things all year. I’ve been a part of that. I don’t think me being on or off the playoff roster will change what I’ve been or done or meant around here. I’ll be just as excited, especially if we win.”\n\nSep 18, 2019; Bronx, NY, USA; New York Yankees starting pitcher CC Sabathia (52) reacts after being taken out of the game against the Los Angeles Angels during the third inning at Yankee Stadium. Mandatory Credit: Andy Marlin-USA TODAY Sports\n\nFinding the right 25 men\n\nSabathia, 39, announced last offseason that this season would be his last, allowing for one final season in New York to chase a second championship. Sabathia and Brett Gardner are the only remnants from the Yankees’ 2009 title team, the only Yankees team to win a championship since the 2000 season.\n\nWhile it would seem cruel if the Yankees keep Sabathia off the roster in his final season considering all he’s meant to this organization in his 11 seasons in the Bronx, the harsh reality is the playoffs are not for sentimentality.\n\nIt’s about winning 11 or 12 games. These same Yankees even famously dropped Alex Rodriguez to the eighth hole once.\n\nStory continues\n\nTeams put together what they believe is their best 25-man roster for that particular series, and due to ineffectiveness and injuries, Sabathia’s potential postseason role is in question. He owns a 4.99 ERA after allowing two runs in 2.2 innings in his potential final outing at Yankee Stadium on Wednesday in a 3-2 loss to the Angels.\n\nA postseason start seems unlikely, and that will leave the front office to decide whether Sabathia can serve as a reliever. Sabathia has only pitched once in relief in 583 career outings, although that relief appearance came during the 2011 playoffs.\n\nSabathia held lefties to a .198/.266/.465/.731 slash line entering Wednesday, which could make him a potential LOOGY (aka left-handed one-out guy) in the middle innings. The Yankees will have short leashes for their starters this postseason.\n\nIf the Yankees want Sabathia to serve as a reliever, all he asks is that the team lets him pitch in relief in these final nine games to let him prepare.\n\n“(The roster decision is) out of my hands. Yankees make those decisions, manager, front office guys. Whatever happens, happen,” Sabathia said Tuesday afternoon. “I’m sure we’ll put the best team out there to win 11 games in October. If I’m part of that, I’ll do my job, be out there and try to get outs. If not, I’ll do everything behind the scenes to try to help guys get ready and be ready to pitch.”\n\nJul 9, 2019; Cleveland, OH, USA; New York Yankees pitcher CC Sabathia visits American League pitcher Aroldis Chapman (not pictured) of the New York Yankees on the mound during the ninth inning in the 2019 MLB All Star Game at Progressive Field. Mandatory Credit: Ken Blaze-USA TODAY Sports\n\nStaying healthy for one last shot\n\nIn addition to evaluating how Sabathia’s stuff will play in October, the Yankees also need to be sure that Sabathia’s body will cooperate.\n\nThat Sabathia is even healthy enough to be in play for a postseason roster spot is a victory considering it seemed he may have thrown the last pitch of his 19-season career on Aug. 30 against the Athletics.\n\nSabathia’s right knee flared up that night, and Sabathia appeared downtrodden after the game, recognizing that his body might not allow him to pitch this October.\n\nThose fears proved to be graver than the reality of the situation, and Sabathia returned last Wednesday against Detroit.\n\nWhile Sabathia does not view his final outings this year as October auditions, he will have to show that he’s past those latest knee issues.\n\nHe acknowledged there have been times he wasn’t sure he’d be in this position where his health would allow him to be an option for October.\n\n“It’s a long season and I wanted to be healthy and be here for the end. We’ve seemed to accomplish that so far,” Sabathia said. “We’ll see how it goes.”\n\nTeammate Didi Gregorius hopes Sabathia will be on the team’s postseason roster.\n\n“Oh, yeah, definitely,” Gregorius said. “He’s a warrior, man.”\n\nSep 18, 2019; Bronx, NY, USA; New York Yankees starting pitcher CC Sabathia (52) is hugged by a teammate after being taken out of the game against the Los Angeles Angels during the third inning at Yankee Stadium. Mandatory Credit: Andy Marlin-USA TODAY Sports\n\nA proper sendoff for a legend\n\nAs he enters the stretch run of his career, Sabathia said that the finality of it all is not weighing on him. He did appreciate the sendoff he received Wednesday with the crowd giving him a standing ovation, and his teammates waiting for him.\n\nSabathia tipped his hat to the crowd knowing he may never pitch in the Bronx again.\n\n“Walking off was cool. Seeing my mom, my wife, my kids happy. That was pretty cool,” Sabathia said. “When I saw (Yankees reliever) Dellin Betances, first person I saw, I got a little emotional. That’s my little brother. “\n\nHe added: “That was amazing. Nothing like the Bronx and New York City and put the pinstripes on. Got to do that for 11 years. Definitely a blessing.”\n\nAfter the game, Sabathia and his teammates gathered to watch the end of the Dodgers-Rays game in hopes they could celebrate an AL East title. The Rays beat the Dodgers, 8-7, in 11 innings to delay the Yankees’ celebrations.\n\nClinching the AL East is what Sabathia hopes will be just the first of several significant steps for this team with the ultimate goal of a title.\n\nIf he contributes to that championship, all the better. If not, he’s OK with that too.\n\nSabathia just wants this final season to end with a 28th Yankees title.\n\n“This is what I came back for. I knew this team would be really good and this team was going to win a lot of games and I wanted to be a part of it,” Sabathia said. “It would be awesome to be here (on the roster) at the end, for sure.”\n\nMore from Yahoo Sports:", "description": "CC Sabathia starts Wednesday, and it's uncertain if he will be  part of the Yankees' postseason roster.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/YogoN8olSyr8mb5aTVCshA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NzAuNA--/https://s.yimg.com/uu/api/res/1.2/OKPz1t6ASRqEY_mXzEZY1Q--~B/aD0xMjkwO3c9MTg5NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/ee5f79c0-da89-11e9-b7ad-6fef9aeb85ee", "published_at": "2019-09-18"}