{"pub": "cnbc", "url": "https://cnbc.com/2019/09/10/experts-say-trump-probably-cant-manipulate-economic-data-for-2020-bid.html", "downloaded_at": "2019-09-10 23:30:04.374418+00:00", "title": "Trump can spin economic numbers – but he likely can't manipulate them, experts say", "language": "en", "text": "US President Donald Trump speaks to the press before he departs for North Carolina on the South Lawn of the White House on September 9, 2019 in Washington, DC. (Photo by Chen Mengtong/China News Service/VCG via Getty Images) Chen Mengtong | Visual China Group | Getty Images\n\nPresident Donald Trump can spin the numbers, but he can't fudge them. Experts and former top economic officials say that the economic data that underpins major government programs and forms the basis for private financial forecasts is likely safe from presidential interference. Questions about the integrity of government data arose following a report in The New York Times on Monday that said Commerce Secretary Wilbur Ross threatened to fire senior officials at a federal scientific agency his department oversees after the agency contradicted the president's claims about Hurricane Dorian. In the wake of that report, some former officials worried that it could suggest a willingness on the part of the Trump administration to intervene in other independent federal agencies, such as those that maintain the nation's economic data. The Bureau of Economic Analysis, for example, produces quarterly reports on the nation's gross domestic product, a data point Trump has touted as a metric of his performance as president and a credential for his 2020 reelection bid. But, those with knowledge of the inner workings of the agencies and the White House economic advisory process say that any attempt to do so likely wouldn't work. In short, the people who work at those agencies likely wouldn't put up with any kind of data manipulation. \"Let me put it this way — if they tried to do anything with the data, I think they would get caught,\" said Dean Baker, a senior economist at the Center for Economic and Policy Research in Washington. In a statement, a Commerce Department spokesperson said the report in the Times was \"false.\" The White House did not respond to a request for comment.\n\nLong tradition of independence\n\nThe main thing standing in the way of political interference in the work of the government's statistical agencies is the long tradition of independence at the bureaus, according to Katharine Abraham, a former commissioner of the Bureau of Labor Statistics. The BLS, which is under the Labor Department, and the BEA and Census Bureau, which are both under the Commerce Department, produce the major government statistics. \"There is, at all of these agencies, a culture of extreme independence,\" Abraham said. \"In all of these places, people talk to reporters.\" There are also procedural safeguards against the White House playing with the numbers, she said. No one outside of the BLS — and even most of those inside the agency — sees the most politically fraught figures, such as jobs data, until the commissioner and a relatively small group of career officials have written the accompanying press release. The White House receives the numbers, with the release, the night before the public.\n\nIn all of these places, people talk to reporters. Katharine Abraham former BLS commissioner\n\n\"There are a lot of things that I worry about under this current administration. There are a lot of terrible things this administration has done. But I have never had any doubt that any of the economic data from BLS or BEA is legitimate,\" said Jacob Leibenluft, a former deputy director of the National Economic Council under President Barack Obama, and the head of Hillary Clinton's 2016 economic policy team during the general election campaign. \"I have high confidence that if there was political pressure put on those agencies to juice the stats, that we would hear about it,\" Leibenluft said. On top of the procedural barriers, it would require a great deal of coordinated, specialized work to swap in new numbers without people immediately noticing, experts said. Baker, the CEPR economist, pointed out that in some of the surveys, the underlying data behind the top-level numbers are released to the public. \"You've collected this survey from 60,000 households, and if you didn't have someone go in and change at least a substantial portion of them, people would catch it,\" Baker said. He added that it would take a well-coordinated \"large-scale conspiracy\" to pull it off. \"You would have to have a lot of people in on it,\" he said. \"And they would have to know what they were doing.\" The last president known to attempt to interfere in the work of the Bureau of Labor Statistics was Richard Nixon, who ordered an aide to tally the number of Jews and Democrats who worked at the agency, then had a number of them removed from their posts. Nixon's efforts were documented in the 1976 book \"The Final Days\" by Bob Woodward and Carl Bernstein.\n\nEyes on final jobs report before 2020 election", "description": "Experts and former top economic officials say the economic data that underpins major government programs and forms the basis for private financial forecasts is likely safe from presidential interference.", "authors": ["Tucker Higgins"], "top_image": "https://image.cnbcfm.com/api/v1/image/106121824-1568127753284gettyimages-1173510012.jpeg?v=1568128105", "published_at": "2019-09-10"}