{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7543841/The-secret-designer-makes-Kate-look-great-Pippa-loves-too.html", "downloaded_at": "2019-10-07 00:17:28.286068+00:00", "title": "The secret designer who makes Kate look great: And Pippa loves her, too!", "language": "en", "text": "On a quiet London street just behind Marble Arch, a select group of women make their way to the door of Suzannah Crabb. For A-listers and senior royalty — including the Duchess of Cambridge — she is their secret weapon.\n\nHer pieces have vintage charm, with a modern edge. Like body armour, they make the wearer feel as comfortable as possible ‘but just push the edge a little bit’, she explains.\n\nWhether for the BAFTAs, Royal Ascot, a family wedding or a royal engagement, they can be sure they’ll look impeccable.\n\nThe Duchess of Cambridge's secret fashion weapon is designer Suzannah Crabb, who has a small shop based in Marylebone\n\nHer sister Pippa Middleton is also known to be a fan of the designer, and is shown here wearing one of her dresses to the christening of Prince George in St James's Palace, London\n\nAt this year’s Wimbledon, the Duchess of Cambridge looked beautiful in her white crepe button-up Flippy Wiggle dress. Back in 2014, she wore a green and white Suzannah tea dress for Prince George’s first birthday portraits. It looked like a floral print, but actually, the motif was a budding heart.\n\n‘All my prints have character,’ says Suzannah. ‘There’s always a bit of a twist.’ You sense it’s a way of making a famous woman look modern and fashion-relevant without scaring the horses.\n\nThe Duchess’s sister, Pippa Middleton, is also a fan. She wore Suzannah’s mint-green floral tea dress to Wimbledon and, on another occasion, a Thirties-inspired ivory and pink Monaco dress with a ruffled hemline.\n\nSophie Wessex, meanwhile, has chosen a succession of Suzannah’s coat and tea dresses for royal events. ‘She is a loyal client of ours, and really lovely and supportive. And a great brand ambassador: she’s so elegant,’ says the designer. ‘She’s got very good taste and is quite bold. She’s got her own sense of style.’\n\nBlonde, ultra-discreet, but with a distinctive, throaty laugh, Crabb, 44, makes clothes that are almost couture.\n\nPippa Middleton pictured sporting a beautiful Suzannah Crabb dress at Wimbledon in 2015\n\nThe Countess of Wessex, shown here at a 2016 charity dinner in Broadgate, London, is also a fan and has worn her dresses for royal events\n\nIn her private atelier, she creates exquisite pieces for her bespoke clients and, in her Suzannah boutique across the street, she sells ready-to-wear — the perfect Forties-inspired navy shift coats and variations of her bestselling silk tea dresses for around £900.\n\nNo, they’re not cheap. That’s because the designer sources her fabrics mostly from Italy, supervising the dyeing, weaving and printing before every garment is lined in silk. These are heirlooms for the future.\n\nSuzannah Crabb said that she creates all her pieces bespoke for clients, in order to achieve the perfect fit\n\n‘We make mannequins in the size of the client and fit the piece as we go. The fabrics are precious and exclusive. They have to be cut with precision.’\n\nEverything is lovingly designed from scratch, from shoulder pads to buttons. The Swarovski crystal buttons on her new Courtauld dress are like an art piece.\n\nDesigns are a reinterpretation of vintage classics rather than slavish copies. She’ll take apart a 1940s couture dress to understand the construction, then exaggerate the silhouette, as our shoulders and waists are wider today.\n\nShe rations black. Her clients, she believes, need bolder colours and beautiful neutrals. Many prints are collaborations with artists. The print on her floaty Carousel dress, made from Italian silk organdie, looks like flowers, but is actually tiny flies — ‘so it’s a quirky print, although it looks demure.’\n\nEven with the ready-to-wear, she’ll make only a handful of pieces. So it’s ‘pretty rare’ to meet someone at a party in the same dress. Handy if you’re a duchess.\n\nEach season, Suzannah adapts the tea dress, a bestseller for 13 years, changing the print designs, neckline and sleeve length. ‘Some of the ladies have collected all of them. They call it their uniform.’\n\nSuzannah fans include, clockwise from above, the Duchess of Cambridge, pictured here with Prince William on George’s first birthday. Kate is wearing a Suzannah Crabb dress\n\nFor this winter, she’s designed many midi lengths. ‘You don’t have to worry about your tights, or whether you have tanned legs. I always wear nice sneakers, and they look great with that length.’\n\nCrabb grew up in Hull, where her mother taught her to sew. She later studied textiles and then fashion at the Universities of York and Southampton.\n\nShe worked as a designer at Karen Millen, Esprit and Oasis, travelling to factories and cloth mills around the world, and later joined Marks & Spencer as head of womenswear trend forecasting. In 2006, she opened her first shop.\n\nBut the real success did not come for another five years. It was after Prince William and Kate Middleton’s wedding in 2011, she says, that business boomed: people wanted to dress up and look ‘polished’ again. ‘Women shop with us for occasions when they have to be at their most confident in life. We work tirelessly to get the ultimate fit for each garment.’\n\nEveryone in the street benefits from our clientele. They say: “Oh, crikey, was that such and such? Was she in your shop?” And I just smile\n\nSome clients want to make a splash; others to be chic, but anonymous (for example, at a friend’s wedding). ‘People say: “I want to feel my absolute best, but I don’t want to stand out.” So we choose a more demure piece, maybe take the colour down a bit.’\n\nAs well as various members of the Royal Family and actresses such as Helen Mirren and Emilia Fox, Suzannah dresses serious professional women who may not have time to change after work.\n\nThe Evangeline white and navy dress in her new collection, for example, is a brilliant modernist piece with a high neck (‘so you’re very covered’), but it skims the body in a very feminine way.\n\nWith a six-year-old daughter, Stella, she understands juggling work and the school run. She wears every prototype herself. ‘We road-test everything: does it crease, can I sit in it, is it too short?’\n\nSuzannah also makes bridal wear and, when she married her banker boyfriend, Adam, in 2011, she designed her own Thirties-style, full-length, corseted dress.\n\nJust before her wedding, journalist Mary Wakefield (now the wife of Boris Johnson’s political strategist Dominic Cummings) ricocheted into the shop, saw Suzannah’s popular Astor dress and begged to be fitted for her own version. Two days before Suzannah got hitched, she was on her hands and knees stitching Mary’s dress.\n\nSince moving into Marylebone, Suzannah has found local businesses to be supportive. ‘Everyone in the street benefits from our clientele. They say: “Oh, crikey, was that such and such? Was she in your shop?” And I just smile.’", "description": "Senior royalty and A-listers use Marylebone designer Suzannah Crabb as their secret weapon. She creates dresses with vintage charm that use bold colours and neutrals, while rationing black.", "authors": ["Liz Hoggard For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/21/19370904-0-image-a-52_1570394086463.jpg", "published_at": "2019-10-06"}