{"pub": "hotair", "url": "https://hotair.com/archives/ed-morrissey/2019/10/11/breaking-yovanovitch-arrives-house-depositions", "downloaded_at": "2019-10-11 19:52:35.994080+00:00", "title": "Breaking: Yovanovitch arrives at the House for depositions; Update: Blasts administration, Giuliani", "language": "en", "text": "Update: The New York Times offers the first look at Marie Yovanovitch’s testimony, and it’s not at all complimentary to the Trump administration. Her opening statement accused the White House and State Department as operating US diplomacy in service to personal interests rather than national interests, and called her removal a result of “totally fictitious” allegations from allies of Rudy Giuliani:\n\nMs. Yovanovitch’s searing account, delivered at the risk of losing her job, could lend new momentum to the impeachment inquiry that imperils Mr. Trump. She said undermining loyal diplomats would embolden “bad actors” who will “see how easy it is to use fiction and innuendo to manipulate our system” and serve the interests of adversaries, including Russia. “Today we see the State Department attacked and hollowed out from within,” she said. She said the allegations that she was disloyal to Mr. Trump, circulated by allies of Rudolph W. Giuliani, the president’s personal lawyer, were totally “fictitious.” “I do not know Mr. Giuliani’s motives for attacking me,” she said. But people associated with Mr. Giuliani “may well have believed that their personal financial ambitions were stymied by our anti-corruption policy in Ukraine,” she said. … She warned that private influence and personal gain have usurped diplomats’ judgment, threatening to undermine the nation’s interests and drive talented professionals out of public service.\n\nOn the other hand, Yovanovitch might not have moved the ball forward by much, at least not for now:\n\nHer opening statement revealed no new details about Mr. Trump’s effort to pressure Volodymyr Zelensky, the new president of Ukraine, to investigate Hunter Biden, the son of Joseph R. Biden Jr. It also offered no details about Lev Parnas or Igor Fruman, two businessmen who helped Mr. Giuliani mount a campaign for her removal. Both were arrested late Wednesday on charges of campaign finance violations. The indictment charged that they were working for one or more Ukrainian officials who wanted her out of Kiev.\n\nIt’s going to be a long day for Trump and Mike Pompeo.\n\nOriginal post follows …\n\n======\n\nSurprise, surprise, surprise. Despite repeated declarations from the White House that they would not cooperate with impeachment investigations until a full House vote to authorize them, the star witness du jour arrived moments ago anyway. Former US ambassador to Ukraine Marie Yovanovitch entered into the Capitol building on her way to sit down with three committees looking into Ukraine-gate:\n\nJUST IN: Former US ambassador to Ukraine, Marie Yovanovitch, has arrived on Capitol Hill to testify as part of the impeachment inquiry, despite White House assertion that the Trump admin. would no longer cooperate with the inquiry. pic.twitter.com/yORV3XCyPV — MSNBC (@MSNBC) October 11, 2019\n\nFormer U.S. ambassador to Ukraine Marie Yovanovitch has arrived on Capitol Hill for a deposition in the Democrats’ impeachment inquiry despite President Donald Trump’s position that his administration won’t cooperate with the probe. Yovanovitch was recalled from her post in May and is now a State Department fellow at Georgetown University. Trump said earlier this week that he would block officials from testifying. Democrats are investigating Trump’s direct pleas to Ukrainian officials to launch investigations of political rival Joe Biden and his family. The Associated Press reported Thursday that a former diplomat, recalling a recent conversation with Yovanovich, said she was removed after insisting that the requests for investigations be relayed according to long-established protocol. Yovanovitch was recalled from Kyiv in May as Rudy Giuliani — who is Trump’s personal attorney and has no official role in the U.S. government — pushed Ukrainian officials to investigate baseless corruption allegations against the Bidens.\n\nIt’s curious that the administration never applied their executive privilege to Yovanovitch. NBC News points out that her still-current boss Mike Pompeo explicitly threatened to exclude her from House questioning after their threats last week, especially with their conditions that attorneys could not be present. “[T]he committee has not issued any subpoenas for depositions,” Pompeo wrote at the time, “and we are not aware of any other authority by which the committee could compel appearance at a deposition.”\n\nAnd yet, Yovanovitch showed up anyway. Either she’s defying Pompeo to testify or Pompeo and Donald Trump figure a fight over her testimony isn’t worth the political capital it would expend. Either option would be rather strange, but the latter especially. They had no trouble telling Gordon Sondland to hold out for a subpoena, even though they think his testimony isn’t likely to be damaging, so why not Yovanovitch?\n\nAt any rate, House Democrats got what they want, or at least what they think they want. What happens if everyone’s wrong about Yovanovitch and she has more to say about the Bidens than has been assumed? That’s the only way that the White House’s lack of action here makes any sense.\n\nUpdate: Will the White House be as accommodating with Bill Taylor?", "description": "\"This is a very serious person.\"", "authors": ["Ed Morrissey", "John Sexton", "Karen Townsend", "Jazz Shaw"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/msnbc-yovanovitch.png", "published_at": "2019-10-11"}