{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/20/anderson-pitches-6-scoreless-brewers-stretch-wild-", "downloaded_at": "2019-09-21 07:15:16.408350+00:00", "title": "Anderson pitches 6 scoreless, Brewers stretch wild-card lead", "language": "en", "text": "MILWAUKEE (AP) - Chase Anderson hadn’t pitched past the fourth inning in any start in nearly a month. On Friday night, with his team in the heat of a playoff race, the Milwaukee Brewers right-hander stepped up.\n\nAnderson pitched six scoreless innings, Trent Grisham hit a bases-loaded triple and the Brewers routed the Pittsburgh Pirates 10-1 to strengthen their grip on the NL wild card.\n\n“He threw the ball really, really well,” said manager Craig Counsell, who earned his 400th victory. “Never in trouble. Just attacking the strike zone. Very efficient with his pitches. Putting the ball where it needed to be. It was a really nice outing.”\n\nMilwaukee is 8-2 since NL MVP Christian Yelich broke his right kneecap on a foul ball and pulled two games ahead of the Cubs for the second wild card after Chicago fell to St. Louis 2-1 earlier in the day. The Brewers trail Washington by a game for the top wild card and are three back of the NL Central-leading Cardinals.\n\nThe Pirates fell to 65-89 with their seventh straight loss. The Brewers‘ final three regular season opponents - Pittsburgh, Cincinnati and Colorado - began Friday a combined 203-256.\n\nAnderson (7-4) allowed three hits, struck out four and walked one while matching his longest outing of the season. He said he cut down on the time between pitches in order to keep Pirates‘ batters off balance.\n\n“I think they had to call time a couple times because I was working too quick,” Anderson said. “I took a little bit of that from (teammate) Brent Suter. It throws their timing off. It helps my delivery with the rhythm, the tempo. It creates a little increase in velocity and crispness on my pitches. I’m going to stick with it.”\n\nAnderson’s outing also allowed Milwaukee to rest its heavily used bullpen.\n\n“As much as anything, this was a night off for a lot of guys,” Counsell said.\n\nGrisham, a 22-year-old rookie, tripled down the right field line as part of a four-run burst in the seventh that put the game out of reach. Grisham entered an inning earlier as a pinch-hitter and walked during a three-run rally.\n\nOutfielder Lorenzo Cain, who left Thursday’s game against San Diego with a sore left ankle, returned to the leadoff spot. He drew a first-inning walk off Steven Brault (4-6), stole second and hustled home with a head-first slide to score on Mike Moustakas’ single.\n\nRyan Braun followed with his 400th career double and, after a strikeout, two more runs scored on a throwing error by shortstop Kevin Newman.\n\nKeston Hiura’s run-scoring single extended the Brewers‘ lead to 4-0 in the sixth. The Brewers tallied two more runs in the inning when Manny Pina was hit by a pitch and pinch-hitter Ben Gamel drew a walk, both with the bases loaded.\n\nAdam Frazier’s leadoff homer in the seventh against Milwaukee reliever Devin Williams broke up the shutout.\n\nBrault, who gave up 10 runs in 2 2/3 innings to the Chicago Cubs in his last outing on Sept 13, surrender six hits and six runs (four earned) in 5 1/3 innings.\n\n“The thing that wasn’t his friend tonight was only four batters were retired on three pitches or less,” Pirates manager Clint Hurdle said. “They strung out some counts and his command really wasn’t as sharp as we’ve seen in the past.”\n\nTRAINER’S ROOM\n\nPirates: C Jacob Stallings returned to the lineup after missing a week with back tightness.\n\nBrewers: Counsell said trainers used various taping methods in an attempt to alleviate Cain’s ankle pain. Cain has also dealt with thumb and knee soreness this season. … RHP Brandon Woodruff, who experienced some arm soreness after his first outing in two months Tuesday after being sidelined with a left oblique strain, will make his next start Sunday. … Yasmani Grandal returned to the lineup after resting Thursday. He started at first base and is expected to catch on Saturday and Sunday.\n\nWISCONSIN FIRST\n\nThe Brewers say Wisconsin residents will have first crack at purchasing postseason tickets, potentially blocking neighboring Chicago Cubs‘ supporters from scooping them up if both teams make the playoffs.\n\nPOWER RESTORED\n\nThe Pirates had gone six consecutive games and 64 consecutive innings since hitting their last home run, a shot by Stallings in San Francisco on Sept. 12, before Frazier went deep. Pittsburgh had been out-homered 19-0 during the drought.\n\nUP NEXT\n\nPirates: James Marvel (0-2, 9.00 ERA) will make his third career start. Marvel surrendered seven runs in four innings in his last start on Saturday against the Cubs.\n\nBrewers: Zach Davies (10-7, 3.70) will make his 30th start of the season. Davies is 2-0 with a 2.31 ERA in four starts against Pittsburgh this season.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Chase Anderson hadn't pitched past the fourth inning in any start in nearly a month. On Friday night, with his team in the heat of a playoff race, the Milwaukee Brewers right-hander stepped up.", "authors": ["The Washington Times Http", "Rich Rovito"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/20/pirates_brewers_baseball_06199_c0-158-3768-2354_s1770x1032.jpg?f7b7516cea57ab56678447143e90eb7ca339b952", "published_at": "2019-09-20"}