{"pub": "time", "url": "https://time.com/5672384/weather-service-defends-forecasters-alabama-trump-dorian", "downloaded_at": "2019-09-09 23:18:00.022915+00:00", "title": "NWS Head Defends Correcting Trump's Hurricane Dorian Claim", "language": "en", "text": "(HUNTSVILLE, Ala.) — The head of the National Weather Service issued a strong public defense Monday of forecasters who contradicted President Donald Trump’s claim that Hurricane Dorian posed a threat to Alabama as it approached the United States.\n\nDirector Louis Uccellini said forecasters in Birmingham did the right thing Sept. 1 when they tried to combat public panic and rumors that Dorian posed a threat to Alabama. It was only later that they found out the source of the mistaken information, he said. Speaking at a meeting of the National Weather Association, Uccellini said Birmingham forecasters “did what any office would do to protect the public.”\n\n“They did that with one thing in mind: public safety,” said Uccellini, who prompted a standing ovation from hundreds of forecasters by asking members of the Birmingham weather staff to stand. Earlier, the president of the 2,100-member association, Paul Schlatter, said any forecast office “would have done the exact same thing” as the Birmingham forecast office.\n\nTrump has defended his tweet about Alabama, and he displayed an altered forecast map in the Oval Office last week in an attempt to make his point. Apparently siding with the president, the National Oceanic and Atmospheric Administration issued an unsigned statement critical of the Birmingham forecasters Friday.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\nRead more: NOAA Disputes Its Own Experts, Siding With President Trump Over Hurricane Dorian and Alabama. Here’s a Full Timeline of the Controversy\n\nBut Alabama had never been included in hurricane advisories and Trump’s information, based on less authoritative computer models than an official forecast, was outdated when he sent a tweet saying Alabama could be affected by Dorian.\n\nDiscussing the flurry of social media contacts and phone calls that followed Trump’s tweet, Uccellini said Birmingham forecasters used “an emphasis they deemed essential to shut down what they thought were rumors” when they posted on social media that Alabama’s wasn’t at risk.\n\n“Only later, when the retweets and politically based comments started coming to their office, did they learn the sources of this information,” he said.\n\nContact us at editors@time.com.", "description": "The head of the National Weather Service defended those who contradicted Trump's claim that Hurricane Dorian posed a threat to Alabama.", "authors": ["Jay Reeves"], "top_image": "https://timedotcom.files.wordpress.com/2019/09/trump-national-weather-service-dorian-alabama.jpg?quality=85&w=1024&h=628&crop=1", "published_at": "2019-09-09"}