{"pub": "yahoo", "url": "https://news.yahoo.com/homeland-security-white-supremacy-extremism-online-214131887.html", "downloaded_at": "2019-09-22 15:29:24.081267+00:00", "title": "DHS Warns Against Growing Threat Of White Supremacist Extremism Online", "language": "en", "text": "The Department of Homeland Security is sounding the alarm on the growing danger of white supremacy across the country, warning of the internet’s ability to serve as a meeting space and a breeding ground for nationalist extremism.\n\nIn a 37-page report called the Strategic Framework for Countering Terrorism and Targeted Violence released Friday, the department emphasized the ease at which potential domestic terrorists can network, drawing a parallel to foreign threats.\n\n“Similar to how ISIS inspired and connected with potential radical Islamist terrorists, white supremacist violent extremists connect with like-minded individuals online,” the report read.\n\n“In addition to mainstream social media platforms, white supremacist violent extremists use lesser-known sites like Gab, 8chan, and EndChan, as well as encrypted channels. Celebration of violence and conspiracy theories about the ‘ethnic replacement’ of whites as the majority ethnicity in various Western countries are prominent in their online circles.”\n\nThe report comes less than two months after a gunman killed 22 people at a Walmart in El Paso, Texas. The suspect later admitted to having targeted Mexicans, and is believed to have acted on a white supremacist manifesto shared on 8chan minutes before his rampage began. The currently de-platformed site ― which was dumped by its host, Cloudflare, following the shooting ― was widely known to be a hotbed of extremism.\n\nGab ― another site where white supremacy runs free ― entered the news in 2018 following the Pittsburgh Tree of Life synagogue shooting. Shortly before the attack, the alleged gunman posted anti-Semitic messages on the site, accusing a Jewish charity helping refugees of bringing “invaders in that kill our people.”\n\nIn a speech Friday at the Brookings Institution in Washington, D.C., Acting DHS Secretary Kevin McAleenan identified white supremacist extremism as “one of the most potent ideologies driving acts of targeted violence in this country.”\n\n“In our modern age, the continued menace of racially-based violent extremism, particularly white supremacist extremism, is an abhorrent affront to our nation, the struggle and unity of its diverse population, and the core values of both our society and our department,” he said.\n\nHowever, DHS’ concern over white supremacy appears to be at odds with President Donald Trump’s sometimes racist rhetoric, which has notoriously targeted lawmakers of color, immigrants, a Muslim Gold Star family and President Barack Obama ― to name a few examples.\n\nAccording to a CNN report published in August, DHS officials had to spend over a year convincing the White House that more attention needed to be given to domestic threats.\n\nRelated coverage\n\nHate Has Flourished In 2 Years Since 'Unite The Right' Rally In Charlottesville\n\nWhite Nationalist Arrested For Threatening To Attack Jewish Center In Ohio, Police Say\n\nMass Shootings Are 'Just Getting Worse' As FBI Fights To Keep Up\n\nLove HuffPost? Become a founding member of HuffPost Plus today.\n\nThis article originally appeared on HuffPost.", "description": "The agency says the internet has become a breeding ground for domestic terrorism, following hate-based mass shootings in the U.S.", "authors": ["Amy Russo"], "top_image": "https://s.yimg.com/uu/api/res/1.2/KpTAdWmiBU1PoPtzdAkC2A--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5d86906b2300003100d32547.jpg", "published_at": "2019-09-21"}