{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/15/world-series-schedule", "downloaded_at": "2019-10-16 03:57:29.908624+00:00", "title": "What you need to know about 2019 World Series", "language": "en", "text": "Who will the Nationals play?\n\nThat’s to be determined. Washington will play the winner of the American League Championship Series between the Houston Astros and New York Yankees. The Astros lead the series 2-1 after a 4-1 victory Tuesday evening. The earliest the Astros can clinch is Thursday. The earliest the Yankees can clinch is Saturday. A potential Game 7 to decide the AL’s representative in the Fall Classic would take place Sunday.\n\nAD\n\nAD\n\nWhat’s the format of the World Series?\n\nLike the ALCS and NLCS, the World Series is a best-of-seven series. The first two games will be played at the American League pennant winner’s ballpark. The Nationals will host Games 3 and 4, as well as Game 5, if necessary, at Nationals Park. Washington would play potential Games 6 and 7 on the road.\n\nWhat determined home-field advantage?\n\nMajor League Baseball officials wised up after the 2016 season, when they began awarding home-field advantage (and four potential home games) in the World Series to the participant with the better regular season record. From 2003 to 2016, the winner of the MLB All-Star Game determined home-field advantage. Before that, home-field advantage alternated between the AL and NL. The Nationals, who advanced to the playoffs with a wild-card berth, won 93 games during the regular season. Both the Yankees (103) and Astros (107) won more.\n\nAD\n\nAD\n\nWhat’s the deal with the designated hitter?\n\nSince 1973, baseball has operated with different rules for the National and American Leagues. In the NL, pitchers hit. In the AL, a designated hitter is employed instead. During the World Series, as in interleague play during the regular season, the home team’s rules will be used. That is, Games 1, 2, 6 and 7 will feature designated hitters for both teams, while pitchers will hit in Games 3, 4 and 5.\n\nHow can I watch?\n\nEvery game of the World Series will be broadcast on Fox. Simulcasts may be streamed on the Fox Sports app, with authenticated access. Information about other streaming options is available here.\n\nAD\n\nWorld Series schedule\n\nx-if necessary.\n\nTuesday, Oct. 22\n\nGame 1 (Fox), TBA\n\nWednesday, Oct. 23\n\nGame 2 (Fox), TBA\n\nFriday, Oct. 25\n\nGame 3 (Fox), TBA\n\nSaturday, Oct. 26\n\nAD\n\nGame 4 (Fox), TBA\n\nSunday, Oct. 27\n\nx-Game 5 (Fox), TBA\n\nTuesday, Oct. 29\n\nx-Game 6 (Fox), TBA\n\nWednesday, Oct. 30\n\nx-Game 7 (Fox), TBA\n\nRead more from The Post:\n\nAD", "description": "The Nationals are going to the World Series. Here's the schedule, how to watch and more.", "authors": ["Scott Allen", "Reporter Covering D.C. Pro", "Local College Sports"], "top_image": "https://www.washingtonpost.com/resizer/kraXPVRDP2MpJQORBOEqmAwfVBo=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/AOBEXPHO3YI6TO362IBG5YGBTE.jpg", "published_at": "2019-10-15"}