{"pub": "euronews", "url": "https://euronews.com/living/2019/10/10/carbon-negative-jumper-lets-you-adopt-sheep-that-the-wool-came-from", "downloaded_at": "2019-10-10 18:55:22.281389+00:00", "title": "Carbon negative jumper lets you \"adopt\" sheep that the wool came from", "language": "en", "text": "London based company, Sheep Inc., are creating \"carbon negative\" jumpers that feature a tag which will allow you to get regular updates on the well being of sheep at farms providing the wool for their clothing.\n\nFounders Edzard van der Wyck, Michael Wessely and Gavin Erasmus created the unisex product with a hope that it would fit into anyone’s wardrobe to spread the message of sustainability to as many people as possible. After you buy one of the brand’s £190 jumpers, you can scan a tag found in the hem using your phone to be allocated a sheep in one of the flocks providing their Merino wool. Sheep Inc. will send you updates on the day to day life of the animal you adopt letting you know information like when it gets a haircut, if it has lambs, and where it is.\n\nThe Unisex Sheep Inc. Sweater Sheep Inc.\n\nAs well as allotting you your very own sheep, the tag will also unlock details about the carbon footprint and manufacturing journey your new jumper has been on. Sheep Inc. is hoping that their transparency will help those that buy their only product to become more in touch with where their clothing comes from. They will show customers them each stage of the process from the welfare of their sheep to the spinning of the wool in northern Italy to the manufacture in Spain alongside all of the efforts they are making to minimise their carbon footprint.\n\nRead More | Gucci goes fully carbon neutral as London Fashion Week commences\n\nWhilst transparency in clothing manufacture is a positive step in the right direction, the Pulse of the Fashion Industry report published by the Global Fashion Agenda highlights wool as one of the “materials with the overall highest environmental impact” with ethical concerns about animal welfare also listed as a concern in its use. According to the New Zealand Ministry for the Environment, methane from the country’s roughly 30 million sheep contributes around 10% of the country’s CO2e emissions.\n\nFounder Michael Wessely said, \"Simply being sustainable is not good enough anymore - we have to start fixing things. Part of this means behaving in the most sustainable way possible as a business. The other is by aiming to have a regenerative effect on the environment. By investing in biodiversity projects that take carbon out the atmosphere. With Sheep Inc., we want to demonstrate that you can offer fashion items that don’t only feel and look good but also do good.”\n\nThe company claims it is \"the first carbon-negative fashion brand on earth\" as 5% of the revenue taken for the symbolic “adoption” will be donated to biodiversity projects that offset the carbon emissions created by the jumper’s manufacture. Although 35kg of CO2 equivalents are generated by each item, the projects funded by the £9.50 donated remove a minimum of 325kg of carbon dioxide from the environment offsetting the jumpers footprint tenfold.", "description": "Sheep Included want to help consumers be more in touch with where their materials come from", "authors": ["Rosie Frost"], "top_image": "https://static.euronews.com/articles/stories/04/22/20/34/1000x563_cmsv2_db4fff39-2646-55b7-9871-3c6361696187-4222034.jpg", "published_at": "2019-10-10"}