{"pub": "fox", "url": "https://foxnews.com/entertainment/todd-chrisley-wife-georgia-tax-investor-settlement", "downloaded_at": "2019-10-15 16:51:57.341854+00:00", "title": "Todd Chrisley and wife, Julie, sue Georgia tax investigator following court settlement", "language": "en", "text": "The Chrisleys are fighting back.\n\nTodd Chrisley and wife Julie Chrisley have filed a lawsuit against the state of Georgia’s tax investigator, claiming he used his power to “aggressively pursue and prosecute bogus tax evasion claims against the Chrisleys,” according to legal documents obtained by Page Six. Earlier this month, the Chrisleys settled allegations that they failed to pay hundreds of thousands of dollars in income taxes to Georgia, paying a little under $150,000 to resolve the situation.\n\nThe reality TV couple alleges Director Joshua Waites of the Georgia Department of Revenue’s Office of Special Investigation targeted Todd’s estranged daughter, Lindsie, in an effort to get her to reveal compromising information about Todd and Julie’s financials. They also claim when Lindsie didn’t give him the information he needed, Waites exposed her parents’ confidential tax information “in an effort to gain her trust or to intimidate her into cooperation.”\n\nTODD CHRISLEY, WIFE JULIE SETTLE $2 MILLION GEORGIA TAX-EVASION CASE\n\nThe lawsuit, filed in the U.S. District Court for the Northern District of Georgia, includes alleged text messages sent between Waites and Lindsie that show they remained in close contact for at least 18 months. The alleged texts also reveal the “compromising” information Waites told Lindsie.\n\n“So the IRS completed there [sic] audit for the criminal side and then turned over the returns to us so we could bill them as well,” Waites allegedly texted. “The Feds are pushing it because they are saying the 75 million deal is for real. Including a show for your grandma by herself.”\n\nIn another text message exchange, Waites appeared to ask Lindsie to open up about her estranged father.\n\nTODD CHRISLEY DENIES EXTORTING DAUGHTER OVER SEX VIDEO WITH 'BACHELORETTE' STAR\n\n“So. Some stuff happened today and we have a meeting the first of the year that is super big and is all about todd like serious,” he allegedly texted. “So. I want to know if you would be willing to talk about him or her.”\n\n“What is it in regards to,” Lindsie purportedly responded.\n\n“What do you think,” he wrote back. “So. It will be a Fed and state meeting hosted by the Feds.”\n\nTodd, 50, and Julie, 46, are asking for unspecified compensatory and punitive damages, as well as attorney’s fees; however, they’ve pledged to donate any funds they recover in damages to programs designed to assist Georgia taxpayers who have suffered similar treatment.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nA rep for the Georgia Department of Revenue’s Office didn’t immediately return Page Six’s request for comment.\n\nThis article originally appeared in Page Six.", "description": "The Chrisleys are fighting back.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/julie-chrisley-todd-chrisley-knows-best-getty.jpg", "published_at": "2019-10-15"}