{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/social-issues/lawsuits-possible-bankruptcy-declining-members-is-there-a-future-for-the-boy-scouts/2019/09/11/54699d6a-ce53-11e9-8c1c-7c8ee785b855_story.html", "downloaded_at": "2019-09-12 07:10:40.886035+00:00", "title": "Lawsuits. Possible bankruptcy. Declining numbers. Is there a future for the Boy Scouts?", "language": "en", "text": "Parents clutched shiny new folders and shuffled 7-year-olds through crowded, brick-walled hallways. Past the booth with the spirit-wear sale and sign-up forms for the PTA stood Julie Bostian, tan uniform tucked into army-green shorts, ready to recruit.\n\n“You guys thinking about Scouts?” she said to a mother and her son.\n\n“I can’t do Mondays,” one mother said apologetically.\n\n“Football,” said another, shaking her head while walking past.\n\n“Just come in to visit,” said Bostian, 53. “See if it works out.”\n\nHere at back-to-school night at Lewistown Elementary School in Thurmont, Md., a rural town at the foothills of the Catoctin Mountains, Bostian was building a pipeline for a local Boy Scout troop she continues to support long after her sons, now in their 20s, have aged out of the program.\n\n\n\nDaniel Dutrow, 18, a leader with Troop 270. (Marvin Joseph/The Washington Post)\n\nAs the new school year begins, Bostian and Scout leaders across the country are trying to safeguard the future of an organization facing unprecedented threats from several corners.\n\nLooming over the Boy Scouts are lawsuits that threaten to tarnish its image, reports of a potential bankruptcy and a struggle to define what it means to be a Scout today. Most recently, a group of lawyers claimed to have uncovered hundreds of previously unreported cases of sexual abuse at the nearly 110-year-old organization.\n\nIt has been a tumultuous time for the Boy Scouts of America. Youth membership has declined more than 26 percent in the past decade. Then, last year, the Church of Jesus Christ of Latter-day Saints announced it would be cutting ties with the organization. The church had been the largest participant in the Boy Scouts program in the United States, making up nearly 20 percent of all youth members.\n\nOver the past decade, victim lawsuits and media investigations have revealed thousands of internal Boy Scout documents, detailing generations of alleged abusers accused of preying on vulnerable Scouts. An investigator hired by the Scouts revealed in January that her team had identified 12,254 victims and 7,819 perpetrators in internal documents from 1946 through 2016.\n\nBut critics of the organization say that these files are incomplete and that hundreds if not thousands more victims of sexual abuse in the Boy Scouts were never documented by the organization.\n\n[Boy Scouts failed to stop hundreds of sexual predators, a lawsuit alleges]\n\nIn a statement, the Boy Scouts of America apologized to “anyone who was harmed during their time in Scouting.”\n\n“We are outraged that there have been times when individuals took advantage of our programs to abuse innocent children,” the statement read. “We believe victims, we support them, we pay for counseling by a provider of their choice, and we encourage them to come forward. It is BSA policy that all incidents of suspected abuse are reported to law enforcement.”\n\nAsked about the path forward for the organization, given the threats it is facing, the Boy Scouts of America pointed to studies showing that Scouting “helps young people become more kind, helpful and prepared for life, and as long as those values remain important to our society, Scouting will continue to be an invaluable partner to families.”\n\nNow, in cities across the country, troops are ramping up for a new school year, and leaders such as Bostian are tasked with convincing parents and youths that, in 2019, it is still worthwhile to be a Boy Scout.\n\nA lifelong Girl Scout, Bostian became involved with the Boy Scouts when her two sons were young. Sixteen years later, she is still the committee chair for her local boys troop and girls troop. Her fellow Scouting parents are some of her closest friends. Her uniform is covered in pins for the six Eagle Scouts she has mentored — not including her two Eagle Scout sons.\n\nShe has traveled and camped with her Scouts across the country, showing them “parts of the United States they wouldn’t otherwise see.” She worries that the national organization’s lawsuits and financial fears could jeopardize all of that. But until then, she said, she is going to “Scout till they tell me I can’t Scout anymore.”\n\n“It’s unsettling, but I don’t dwell on it,” Bostian said. “Does it make it harder? Sure. Are we going to stop? Absolutely not.”\n\nIn Pa., a lawsuit hits home\n\nThe Boy Scouts’ past with sexual abuse is no secret to the organization or the public, but in the #MeToo era, a wave of allegations from decades ago are coming to the forefront.\n\nSeveral states, including New York and New Jersey, are changing their statute-of-limitations laws to allow victims of child sexual abuse an opportunity to seek justice, opening the door to hundreds of potential lawsuits against the Boy Scouts. Last year, The Washington Post reported that the organization had hired lobbyists in several states to push back against potential statute-of-limitations changes.\n\nMichael Pfau, a lawyer who specializes in abuse cases and who has litigated against the Boy Scouts for more than 17 years, said he was representing dozens of victims in New York state, which has just opened a year-long legal window that allows victims of childhood sexual assault to sue long after the state’s original statute of limitations has passed. Pfau and his colleagues have already filed six lawsuits in the state and were preparing more in New Jersey, which opens its own legal window on Dec. 1.\n\nIn addition, a December report in the Wall Street Journal that the Boy Scouts were considering filing for bankruptcy, which could give potential victims a limited amount of time to come forward for compensation, prompted lawyers to gather new cases in earnest.\n\nThe Boy Scouts would not confirm the bankruptcy reports. But regarding a potential “financial restructuring,” the organization said it was “working with experts and exploring all options available so we can live up to our social and moral responsibility to fairly compensate victims . . . while also ensuring that we carry out our mission to serve youth, families and local communities through our programs.”\n\nIn response to the report, a coalition of lawyers known as Abused in Scouting began gathering clients earlier this year by airing television ads across the country.\n\nHundreds of people responded to the commercials. In August, Abused in Scouting filed a lawsuit on behalf of one of those men, identified only as S.D. of Wilkes-Barre, Pa., claiming the Boy Scouts neglected to protect him from an alleged sexual predator in the 1970s.\n\n[Victims of sexual abuse in the Boy Scouts were encouraged to come forward. Hundreds responded.]\n\nThe suit says the abuse took place at an assistant scoutmaster’s home and at Camp Acahela, a Scout retreat in eastern Pennsylvania. S.D. says that beginning when he was 12 or 13 years old, his alleged abuser groomed him before subjecting him to “hundreds of instances of fondling, hundreds of incidents of oral sexual assault and repeated attempts of anal penetration.” The lawsuit further claims that “BSA knew for decades that sexual predators of boys had infiltrated scouting” and “knew or should have known the dangers” that men such as S.D.’s abuser posed.\n\nIn Wilkes-Barre, the allegations are hardly a point of conversation for local Boy Scout troops. But the lawsuit could make recruitment even more difficult for leaders facing dwindling membership.\n\nGary Curran has lived in ­Wilkes-Barre his entire life and still has a photograph of a banquet dinner from his time as a Cub Scout in the area. In those days, his pack had as many as 40 members. When he first started leading his sons’ Boy Scout troop in the same town, about 15 to 20 boys were registered. Now, that troop has about eight active Scouts, and the Cub Scout pack is almost nonexistent, said Curran, who recently stepped down as the troop’s scoutmaster after his sons aged out.\n\nThe schools in his area have not allowed the local Scouting groups to recruit anymore, he said. He knows many single parents who find it hard to juggle busy jobs with the demands of their children’s extracurricular activities. Scouting, he said, “is not like basketball practice where you drop off your kid and go home. You need to be involved.”\n\n“I’ve heard phrases like, ‘If we keep going the way we’re going, we’ll be gone by 2025,’ ” he said of the Boy Scouts.\n\nMike Magistro, a scoutmaster for a troop in nearby Swoyersville, Pa., said he feels frustrated by all of the changes at the national level. The inclusion of girls in the namesake program, Magistro argued, was “all about money,” a way to grapple with declining membership and looming bankruptcy threats.\n\nMagistro, a letter carrier for the U.S. Postal Service and a father of a 15-year-old Eagle Scout, said he was relieved his chartering organization, a local volunteer fire department, had not started up a girls troop yet.\n\n“I was 15 years old. I know what can happen when girls are around. To me, that’s just a bad mixture,” Magistro said. “I don’t think in this environment that the Boy Scouts should be taking that kind of a risk.”\n\n'We're booming'\n\nMagistro acknowledged that he is more outspoken on this issue than most Scout leaders. And across the country, other troops paint an entirely different portrait. The Boy Scouts of America is still among the largest youth organizations in the United States, and in many counties, troop membership continues to thrive — buoyed even more by newly founded girls troops.\n\nAs of last year, 2.18 million youth members were registered in the organization. More than 77,000 girls ages 5 through 10 have joined the Cub Scouts, and nearly 23,000 older girls have signed up for troops through the namesake program, now re-branded as Scouts BSA.\n\n“We’re booming,” said Michael Perkins, scoutmaster for Troop 162 in Arlington, Va.\n\nSo many new members have joined his troop in recent years that he might have to start holding back in recruitment, he said. About 60 boys are registered in his troop, and about 30 girls have joined the affiliated girls troop.\n\nThe troop is part of the National Capital Area Council, one of the largest councils in the country. It also has one of the highest retention rates, at more than 81 percent.\n\nAaron Chusid, chief communications officer for the council, attributed this success in large part to the parents and volunteers in the region. It helps that many parents in the Washington area have a military background or work for federal agencies — jobs and skill sets that “fit very well” with the Scouting structure, Chusid said. He told the story of one Scouting unit that earned an aviation badge — a troop leader happened to run the Federal Aviation Administration.\n\nFor those troops that are successful at retaining members, incentives are key, Chusid said. Signing up Scouts for summer camp or high-adventure trips is essential to keeping teenagers interested in the program. “When they start hitting 13, 14 years old,” Chusid said, “they’re saying, ‘Why should I stick around?’ ”\n\nOver the years, the Boy Scouts of America has enacted extensive policies to prevent abuse, including mandatory youth protection training and criminal background checks for leaders.\n\nOne-on-one contact between adult leaders and youth members is prohibited inside and outside of Scouting, including over email or other forms of communication. In most Boy Scout programs, adults and youths must tent separately, and youths sharing tents must be no more than two years apart in age.\n\n[Scouts’ recruitment war raises questions about what it means to be a girl or a boy]\n\nFor any activity involving girls, a registered female leader over the age of 21 must be present — a rule that Stephanie Curb, a mother from Springfield, Va., said has made planning difficult for her 15-year-old daughter, Cordelia, a member of a girls troop. Cordelia was hoping to go on a Scout hiking trip to the Grand Canyon with her father. But because she can’t find a female leader to go and her mother has a bad knee, Cordelia will not be able to make the trip.\n\n“Whenever these kinds of terrible things happen, there’s always more regulation that comes in place,” Curb said. “So we’re waiting to see if there’s something else that comes out that restricts more of what we can do.”\n\nBut at a meeting for two troops in Thurmont, the ongoing scandals felt far away as a group of about 12 boys and girls saluted an American flag outside a brick “Scout House,” where troops have been meeting for more than half a century.\n\nMosquitoes filled the air as Alex Contreras, 14, taught two girls, Ellen Hossain, 11, and Charlotte Young, 9, how to tie a clove hitch knot around a long wooden stick.\n\nHe nodded approvingly as Charlotte successfully tied the knot. “Nice job,” Alex said as the feisty blond Scout gave the tall teenager a hard high-five.\n\nAs the sun lowered behind the foothills, the troop circled up around the flagpole as one of the Scout leaders, Chris Nield, a curly-haired 15-year-old with braces and football pants, gave the group a pep talk.\n\n“Take that same energy that you guys had today . . . into every day,” Chris said at the center of the circle. “Just keep on trucking.”", "description": "As the new school year begins, Scout leaders on the ground are vying for the future of an organization facing threats from all sides.", "authors": ["Samantha Schmidt", "Reporter Covering Gender", "Family Issues", "Kayla Epstein", "Embedded Audience Editor On The National Desk", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/07Cfcie14oonwSurvtOUHbv9nC0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MB2SGSGLM4I6TFQVR4NDFFROAQ.jpg", "published_at": "2019-09-11"}