{"pub": "thehill", "url": "https://thehill.com/policy/defense/465242-mcmaster-its-absolutely-not-appropriate-to-solicit-foreign-help-in-us", "downloaded_at": "2019-10-10 18:38:34.962810+00:00", "title": "McMaster: 'It's absolutely not' appropriate to solicit foreign help in US elections", "language": "en", "text": "Retired Lt. Gen. H.R. McMaster, who was ousted as President Trump Donald John TrumpDemocrats request testimony from Trump's former Russia adviser Trump adviser: 'He should stop saying things that are untrue' US moves British ISIS suspects from Syria amid Turkish invasion MORE’s national security adviser in 2018, said Thursday “it’s absolutely not” appropriate to solicit foreign interference in U.S. elections.\n\nSpeaking at an event hosted by the Foundation for Defense of Democracies, where he now serves as a chairman for one of its centers, McMaster said he never witnessed Trump solicit foreign help in domestic political issues during his time at the White House.\n\nADVERTISEMENT\n\n“In all of the conversations, all of the meetings I was privy to, there was never any incident, I’ll just tell you, never any incident of the president soliciting any kind of assistance for anything domestic, political,” said McMaster, who served as national security adviser from February 2017 to April 2018.\n\n“It just didn’t happen when I was there or in any conversation that I was privy to and part of, which was I think almost all the, really all the head of state calls,” he added.\n\nBut when asked generally if it is appropriate to solicit foreign interference in the political process, McMaster replied, “Of course, no. No, it’s absolutely not.”\n\n“Of course what has to happen here is seeing our democracy play out, the separation of powers play out, and for the American people, through their representatives and their representatives in Congress, has to make a judgment as to whether or not that happened,” he added.\n\nMcMaster demurred when asked for his reaction to a rough transcript of a call between Trump and Ukraine’s president, as well as a whistleblower complaint alleging Trump pressured the Ukrainians to investigate former Vice President Joe Biden Joe BidenDemocrats request testimony from Trump's former Russia adviser Pence open to releasing transcripts of call with Ukraine Trey Gowdy joins Trump's legal team MORE and his son Hunter. McMaster said he read the documents but couldn’t “really add anything” to what has already been said about them.\n\nHouse Democrats opened an impeachment inquiry into Trump after an intelligence community whistleblower alleged the president pressured his Ukrainian counterpart to investigate Biden, a leading 2020 presidential candidate, and his son.\n\nA rough transcript of a July 25 call between Trump and Ukrainian President Volodymyr Zelensky released by the White House last month showed Trump asked Zelensky to work with his personal attorney Rudy Giuliani Rudy GiulianiTrey Gowdy joins Trump's legal team Trump asked Tillerson to interfere in DOJ case against Giuliani client: report Barr to speak at Notre Dame law school on Friday MORE and Attorney General William Barr William Pelham BarrBarr to speak at Notre Dame law school on Friday Giuliani predicts Senate Judiciary will call on Biden to testify on Ukraine Trump confidant: Impeachment inquiry is a 'mortal threat' to presidency MORE to investigate Biden’s role in the firing of a Ukrainian prosecutor during the Obama administration.\n\nTrump has maintained that he did nothing wrong, repeatedly characterizing his call with Zelensky as “perfect.”\n\nOn Tuesday night, White House counsel Pat Cipollone sent a letter to Speaker Nancy Pelosi Nancy PelosiDemocrats request testimony from Trump's former Russia adviser Trey Gowdy joins Trump's legal team Tillis says impeachment is 'a waste of resources' MORE (D-Calif.) and three House committee chairmen stating that the administration would not cooperate with any of their requests related to the impeachment inquiry.\n\nThe following day, Trump said he might be willing to cooperate with the probe if House Democrats hold a formal vote to outline rules for the investigation and if those rules \"are fair.\"", "description": "Retired Lt. Gen. H.R. McMaster, who was ousted as President Trump’s national security adviser in 2018, said Thursday “it’s absolutely not” appropriate to solicit foreign interference in U.S. elections.", "authors": [], "top_image": "https://thehill.com/sites/default/files/blogs/trumpmcmaster.jpg", "published_at": "2019-10-10"}