{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7580105/Pentagon-joins-White-Houses-defiance-Democrats-impeachment-subpoenas.html", "downloaded_at": "2019-10-16 21:38:28.340977+00:00", "title": "Pentagon joins White House's defiance on Democrats' impeachment subpoenas", "language": "en", "text": "The Pentagon joined the list of those defying a subpoena from Democrats as part of their impeachment inquiry into Donald Trump.\n\nIn a letter to the three Democratic committees leading the investigation, the Pentagon cites a 'number of legal and practical concerns' as their reason for not complying, including the lack of a full House to authorize the impeachment inquiry and they argue some of the requested information is 'potentially protected by executive privilege.'\n\nIt was a noted shift as a few days ago Defense Secretary Mark Esper indicated the Pentagon would cooperate.\n\nThe Pentagon said it won't cooperate with Democrats subpoena - a shift after Defense Secretary Mark Esper indicated he would\n\nMeanwhile, Michael McKinley, a former top aide to Secretary of State Mike Pompeo, arrived on Capitol Hill to testify\n\nKurt Volker, former special U.S. envoy to Ukraine, made a surprise appearance on Capitol Hill Wednesday morning\n\nDemocrats were seeking information related to U.S. aid the Ukraine. Trump faces allegations he threatened to with hold nearly $400 million in funding unless the Ukraine agreed to launch an investigation into Joe and Hunter Biden.\n\nSeveral other administration officials and members of the president's team announced their defiance of Congress as the White House goes on the offensive against the inquiry into the president.\n\nVice President Mike Pence, Secretary of State Mike Pompeo, Trump personal attorney Rudy Giuliani and acting OMB director Russell Vought will not be complying with their congressional subpoenas, they've announced.\n\nEnergy Secretary Rick Perry also has been subpoenaed.\n\nPerry said he will follow the recommendation of the department's general counsel.\n\n'The House has sent a subpoena over for the records that we have. And our general counsel and the White House counsel are going through the process right now. And I’m going to follow the lead of the, of my counsel on that,' he told FOX Business Network on Wednesday.\n\nHouse Intelligence Committee Chairman Adam Schiff is entertaining a number of ways to deal with the defiance - including fining the individuals - but has not announced exactly how Democrats will proceed.\n\nOfficials can be held in contempt of Congress for not complying with a subpoena and the matter can go to the courts, which can be a long and costly process.\n\nMeanwhile, Michael McKinley, a former top aide to Secretary of State Mike Pompeo, arrived on Capitol Hill to testify behind closed doors.\n\nMcKinley resigned from the State Department last week and is expected to be asked about Pompeo's leadership at Foggy Bottom.\n\nAnd Kurt Volker, former special U.S. envoy to Ukraine, made a surprise appearance on Capitol Hill Wednesday morning to review his testimony from last week.\n\nVolker offered up a series of texts between administration officials discussing President Trump's relationship with Ukrainian President Zelensky as part of his testimony.\n\nU.S. Ambassador to the European Union Gordon Sondland, who appears in text messages, will testify on Thursday.\n\nPresident Donald Trump has begun an offense into the impeachment inquiry\n\nThursday also marks the day for Giuliani associates Giuliani associates Lev Parnas and Igor Fruman to comply with a congressional subpoena. The two men are in jail in Virginia on campaign finance charges and will remain in detention until they secure a $1 million bond.\n\nOn Friday, Laura Cooper, the deputy assistant secretary of defense for Russia, Ukraine and Eurasia, will testify.", "description": "Pentagon joined the list of those defying a subpoena from Democrats as part of their impeachment inquiry into Donald Trump after Defense Secretary Mark Esper indicated cooperation.", "authors": ["Emily Goodin", "U.S. Political Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/16/19793908-0-image-a-29_1571239040193.jpg", "published_at": "2019-10-16"}