{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/brexit-deal-hopes-hang-on-british-breakfast-with-barnier", "downloaded_at": "2019-10-11 05:59:05.263112+00:00", "title": "Brexit deal hopes hang on British breakfast with Barnier", "language": "en", "text": "Britain and Europe's top Brexit negotiators sit down together on Friday to test what British and Irish leaders say might be a \"pathway\" to a deal.\n\n[BRUSSELS] Britain and Europe's top Brexit negotiators sit down together on Friday to test what British and Irish leaders say might be a \"pathway\" to a deal.\n\nTechnical talks on an agreement to govern Britain's EU divorce are stalled, just days before what had been billed as a last chance European summit.\n\nNow, British Brexit minister Stephen Barclay and chief European Union negotiator Michel Barnier are to hold a working breakfast on Friday.\n\nThere have been many false dawns in the talks, but Prime Minister Boris Johnson and his Irish counterpart Leo Varadkar are holding out hope.\n\nsentifi.com Market voices on:\n\nAfter meeting in northwest England on Thursday, Mr Johnson and Mr Varadkar said they had \"agreed that they could see a pathway to a possible deal\".\n\nSpeaking to reporters, Mr Varadkar later said the meeting was \"very positive\", suggesting it would be a \"short pathway, rather than a long one\".\n\nIf the path is to lead to a deal before Britain crashes out of the European Union on October 31, it had better be a short one.\n\nThe next European Council summit for Johnson, Mr Varadkar and their colleagues from the other EU capitals starts on October 17 next week.\n\nAnd, in normal circumstances, European diplomats would want draft texts of any agreements to be prepared before close of business on Friday.\n\nEven if, as UK officials hope, Brussels shows flexibility on the timeline, they have yet to enter the \"diplomatic tunnel\" of final text negotiations.\n\nAfter his \"stock taking\" breakfast with Barclay, Mr Barnier will brief ambassadors from the other EU members on the state of play.\n\n\"Barnier will have to say whether we can or can't start negotiating a text,\" a European source told AFP.\n\n\"After that, it's a long road. It's wacky to think we'd have a treaty text before the October 17 and 18 summit.\"\n\nBut Mr Varadkar appears to be looking slightly further forward, implying that he and Mr Johnson are now aiming for a deal in the next three weeks.\n\n\"I think it's possible for us to come to an agreement, to have a treaty agreed ... by the end of October,\" he said.\n\nBut he cautioned there could still be obstacles along the way, after a more than three-year game of high-stakes political snakes and ladders.\n\n\"There's many a slip between cup and lip,\" he warned.\n\nMr Johnson has vowed Britain will end its five-decade membership of the EU on October 31, with or without agreeing exit terms.\n\nBut he could be forced to seek a third delay to Brexit if he fails to agree a deal by October 19, thanks to a law passed by rebellious MPs.\n\nSome European sources in Brussels have suggested that EU leaders may offer Britain an extension even if Johnson does not ask for one.\n\nIRISH BORDER DISPUTE\n\nSince the 2016 British referendum vote for Brexit, negotiations have bounced back and forth between London and Brussels.\n\nBut Ireland has been a key player because of the issue of the UK's only land border, between its province of Northern Ireland and Ireland.\n\nMr Johnson and Mr Varadkar met at Thornton Manor, a venue more commonly used for luxury weddings than discussing international divorce terms.\n\nTheir talks \"concentrated on the challenges of customs and consent\", their joint statement said.\n\nAfter British MPs rejected a \"backstop\" plan in a previous withdrawal agreement to keep the border open, Johnson presented a new proposal last week.\n\nHe proposes Northern Ireland stay aligned to the EU's single market but remain in a separate UK-wide customs territory, envisaging customs but no regulatory checks on the frontier.\n\nNorthern Ireland's opt-in to the plan would be open to four-yearly review by the province's devolved assembly and executive.\n\nBut Brussels is adamant it will not agree to any plan that undermines the single market - which allows free movement of goods across Europe - or exacerbates tensions on the island of Ireland.\n\nA free-flowing border is considered vital to maintaining peace in Northern Ireland, which was plagued by three decades of violence, largely brought to an end with the 1998 Good Friday peace accords.\n\nAFP", "description": ": THE BUSINESS TIMES Government & Economy - [BRUSSELS] Britain and Europe's top Brexit negotiators sit down together on Friday to test what British and Irish leaders say might be a \"pathway\" to a deal. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/11/nz_brexit_111051_0.jpg?itok=ba-Z_I-0", "published_at": "2019-10-11"}