{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/house-democrats-texts-show-concerns-about-withhold", "downloaded_at": "2019-10-04 12:35:33.582013+00:00", "title": "House Democrats: Texts show 'concerns' about withholding of military assistance for Ukraine", "language": "en", "text": "House Democrats late Thursday released a series of text messages between American and Ukrainian officials they said reflected concerns that military assistance to Ukraine was being withheld to try to pressure the country into launching “politically motivated” investigations.\n\nThe text messages reflect communications between Ambassador Kurt Volker, the former special representative for Ukraine negotiations, and others including Gordon Sondland, the U.S. ambassador to the European Union, and Andrey Yermak, an aide to Ukrainian President Volodymyr Zelensky.\n\nThe messages “reflect serious concerns raised by a State Department official about the detrimental effects of withholding critical military assistance from Ukraine, and the importance of setting up a meeting between President Trump and the Ukrainian President without further delay,” wrote Reps. Eliot L. Engel, Adam B. Schiff, and Elijah E. Cummings, the chairmen of the House Foreign Affairs, Intelligence, and Oversight committees, respectively.\n\n“He also directly expressed concerns that this critical military assistance and the meeting between the two presidents were being withheld in order to place additional pressure on Ukraine to deliver on the President’s demand for Ukraine to launch politically motivated investigations,” the lawmakers wrote in a letter to colleagues.\n\nA whistleblower complaint alleging that President Trump pressured Mr. Zelensky in a July 25 phone call into digging up dirt on former Vice President Joseph R. Biden is at the heart of House Democrats’ newly formalized impeachment inquiry.\n\nIn one text exchange, dated July 19, Mr. Volker said in part to Mr. Sondland and William Taylor, Charge d’Affaires at the U.S. Embassy in Ukraine: “Most impt is for Zelensky to say that he will help investigation - and address any specific personnel issues - if there are any”\n\nIn another, on the morning of the phone call, Mr. Volker texted Mr. Yermak: “Good lunch - thanks. Heard from White House - assuming President Z convinces trump he will investigate/’get to the bottom of what happened’ in 2016, we will nail down date for visit to Washington. Good luck! See you tomorrow- kurt”\n\nIn another exchange, dated Sept. 9, Mr. Taylor and Mr. Sondland discussed the notion of withholding military aid for political reasons.\n\n“As I said on the phone, I think it’s crazy to withhold security assistance for help with a political campaign,” Mr. Taylor said.\n\nMr. Sondland replied: “Bill, I believe you are incorrect about President Trump’s intentions.”\n\n“The President has been crystal clear no quid pro quo’s of any kind,” he said. “The President is trying to evaluate whether Ukraine is truly going to adopt the transparency and reforms that President Zelensky promised during his campaign.”\n\nHe then suggested they stop the “back and forth by text.”\n\nOn Sept. 1, Mr. Taylor had asked: “Are we now saying that security assistance and WH meeting are conditioned on investigations?”\n\n“Call me,” Mr. Sondland replied.\n\nThe chairmen said that selected portions of the texts had been leaked to the press “out of context,” but that the additional excerpts are still “only a subset of the full body of the materials, which we hope to make public after a review for personally identifiable information.”\n\nMr. Volker, who resigned last week, testified on Capitol Hill on Thursday. Republicans said the appearance did little to advance Democrats’ impeachment inquiry.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "House Democrats late Thursday released a series of text messages between American and Ukrainian officials they said reflected concerns that military assistance to Ukraine was being withheld to try to pressure the country into launching \"politically motivated\" investigations.", "authors": ["The Washington Times Http", "David Sherfinski"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/03/Trump_Impeachment_46663.jpg-3f4f7_c0-0-4800-2798_s1770x1032.jpg?0aacc355d3836007a553f95273cd6e9ec177a301", "published_at": "2019-10-04"}