{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/boat-fire-on-the-conception-kills-8-off-california-coast.html", "downloaded_at": "2019-09-03 23:41:28.298320+00:00", "title": "Everything We Know About the California Boat Fire That Killed at Least 25", "language": "en", "published_at": "2019-09-03", "text": "The 75-foot Conception, based in Santa Barbara Harbor, burns after catching fire early September 2, 2019, while anchored off Santa Cruz Island, California. Photo: Handout/Getty Images\n\nAround 3:28 a.m. on Labor Day, the Coast Guard responded to a catastrophic fire on a 75-foot commercial scuba-diving vessel, the Conception, moored in a harbor north of Santa Cruz Island, about 30 miles south of Santa Barbara, California. Shortly after dawn, the boat sank in 64 feet of water, just 20 yards offshore. As of early Tuesday, 25 are confirmed dead, and another nine still missing. Five crew members survived.\n\nOn Monday, Coast Guard captain Monica Rochester said in a press conference that the search will continue through the night, but that “we should all be prepared to move into the worst outcome.” According to a public-information officer from the Santa Barbara County Fire Department, authorities will “make the unfortunate transition [from search and rescue] to recovery.”\n\nBelow is what we know about how the fire started, the status of rescue efforts, and the early stages of the investigation.\n\nThe blaze starts\n\nThe Coast Guard picked up a mayday call from the Conception around 3:15 a.m., dispatching two helicopters and several boats to Platts Harbor, where the boat was moored. At the time of the fire, 39 people were on the Conception — 33 passengers and six crew members. Passengers slept in bunk beds in a room belowdecks, with narrow staircases leading to the exits. “You couldn’t have asked for a worse situation,” said Santa Barbara county sheriff Bill Brown. “They would have been sound asleep when this fire started.”\n\nFive of the six crew members, who had been sleeping on the top deck, escaped the fire on a dinghy. They found safety on a nearby private fishing vessel, the Grape Escape, which was moored in the same harbor. From the boat, the crew also called emergency services. In audio from the call to a Coast Guard base in Los Angeles, the dispatcher asked a crew member several alarming questions about the fire on the Conception. Per CNN:\n\n“Can you get back onboard and unlock the boat?” the dispatcher asked.\n\nIn another question, the Coast Guard asked if there was an “escape hatch for any of the people onboard.”\n\nIn audio from Broadcastify, the Coast Guard dispatcher also questioned the crewmember about firefighting equipment onboard.\n\n“You don’t have any firefighting gear at all? No fire extinguishers or anything?\n\nOn Monday, rescue crews searched the waters south of Santa Barbara and west of Los Angeles for survivors. The remains of four victims were recovered from the boat by rescue teams Monday, in addition to another four victims sighted “on the ocean floor in close proximity to the vessel,” according to Sheriff Brown.\n\n“I could see the fire coming through holes on the side of the boat,” Bob Hansen, the owner of the Grape Escape, said in an interview. “There were these explosions every few beats. You can’t prepare yourself for that. It was horrendous.”\n\nThe Conception’s last tour\n\nThe 75-foot boat was on a three-day tour to Channel Islands National Park, a remote chain of five islands with sea caves and diverse wildlife. The boat left the Santa Barbara coast on Saturday and toured several diving spots on Santa Cruz Island, the largest island in the park. Onboard was a fire-suppression system in the engine room, as well as a built-in barbecue, according to the operator’s website. The Conception was owned by an outfitter called Truth Aquatics, which, according to recreational divers in the region who spoke to the New York Times, had a “good reputation and appeared careful about safety.” Indeed, the California Diving News once described the vessel as “California’s crown jewel of live-aboard dive boats.”\n\n“They are the biggest company in California — they should pass everything very easily,” local scuba operator Bill Zhang told the Times, noting that because the Conception was on an overnight trip, it most likely had two captains onboard.\n\nThe investigation begins\n\nAs the search-and-rescue transitions to recovery, the National Transportation Safety Board has dispatched a team to determine the cause of the fire. An independent government investigative agency, the NTSB looks at accidents involving sea vessels as well as incidents involving aviation, pipelines, and rail.\n\nOn Monday, Captain Rochester noted that it was too early to state that negligence could have been involved in the start of the fire, and that the “vessel has been in full compliance.” Commercial boats as large as the Conception have to pass Coast Guard inspection every year to maintain their license.\n\nAccording to the AP, Coast Guard records show that Truth Aquatics was prompt in addressing safety violations on the vessel, including two recent violations related to fire safety.", "description": "On Monday, the Coast Guard responded to a fire on a 75-foot commercial scuba diving vessel, the Conception, moored north of Santa Cruz Island 30 miles south of Santa Barbara, California.", "authors": ["Matt Stieb", "Adam K. Raymond"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/02/conception_fire.w1200.h630.jpg"}