{"pub": "guardian", "url": "https://theguardian.com/books/2019/oct/26/dear-europe-letters-from-jk-rowling-neil-gaiman-may-beard-and-more", "downloaded_at": "2019-10-26 09:28:18.127744+00:00", "title": "Dear Europe: letters from JK Rowling, Neil Gaiman, Mary Beard and more", "language": "en", "text": "Writing home\n\nJK Rowling\n\nThe letter was written on thin, pale blue paper. The handwriting was neat and rounded. My brand-new German pen friend, Hanna, introduced herself in excellent English. Our schools had decided that Hanna and I would be a good fit as pen pals because we were both, not to put too fine a point on it, swots. In a matter of months, I’d be going to stay with her Stuttgart-based family for a week, and shortly after that, she’d come and stay on the Welsh border, with me. I was 13. The whole thing was thrilling.\n\nHer house was warm, spotless and deliciously different. I remember ornamental candles, and rugs on a tiled floor, the furniture sleek and well-designed, and a shining upright piano in the corner, which Hanna, of course, played very well. On arrival, Hanna’s mother asked me what I wanted for breakfast, and when I didn’t immediately answer, she began listing all the foodstuffs she had available. Around about item six or seven, I recognised the German for cake, so I said, “Cake, please.”\n\nHanna’s mother was a magnificent cook. I particularly remember the clear soup with dumplings and the sausage with lentils, and every morning of my visit, presumably because she thought that’s what I was used to, she gave me cake for breakfast. It was glorious.\n\nI kept in touch with Hanna for years, and when I was 15, the family invited me, with incredible generosity, to accompany them on a month-long trip to Italy. So, it was with Hanna and her family that I first saw the Mediterranean and first tasted shellfish.\n\nI came home from Italy thirsty for more European adventures. I got myself a French pen pal called Adele, with whom in due course I went to stay in Brittany. There I watched her mother make crêpes, the region’s speciality, on the bilig, a large, circular griddle: they were the most delicious things I’d ever eaten, even including the Italian lobster. When out of sight of adults, I took advantage of the cheapness of French cigarettes and practised my nascent smoking habit, trying really hard to like Gitanes, and almost succeeding.\n\nWhen I turned 16, my best friend and I cooked up the idea of going backpacking in Austria for a couple of weeks. Looking back, I do slightly wonder what our parents were thinking, letting us go: two schoolgirls with a smattering of German heading off on a coach with no fixed plans and no accommodation booked. We emerged from the experience unscathed: we successfully read the foreign train timetables, always managed to find accommodation, swam in ice-cold mountain lakes under brilliant sunlight and travelled from town to town as the fancy took us.\n\nAs I grew older, my determination to cross the Channel, even if alone or with insufficient funds, grew. If you had an Interrail ticket, surely one of the best inventions of all time, you could simply catch another train if you couldn’t find a room, or else doze in the station until the next one arrived. I took off alone at 19 to wander around France, a jaunt that ended abruptly with the theft of my wallet.\n\nMany children, including my own eldest daughter, wouldn’t have been born without the frictionless travel the EU gave us\n\nHowever, I was soon back again, because I spent a year in Paris as part of my French degree. My mother, a quiet Francophile with a half-French father, was delighted to visit me there; my father, possibly less so, given my perennially unsuccessful pleas to waiters to understand that bien cuit in his case meant there must be no pink at all in the middle of the steak.\n\nI was 25 when my mother died, at which point I stopped pretending I wanted any kind of office job. Now I did what came most naturally: grabbed the dog-eared manuscript of the children’s book I’d been writing for a few months and took off across the Channel again. Disorientated with grief, I’d chosen one of the three teaching jobs offered to me almost at random. It was in Portugal, a country I didn’t know, and where I couldn’t speak a word of the language.\n\nTeaching English abroad is a perfectly respectable profession, but nobody who has done it can deny that it attracts its fair share of misfits and runaways. I was both. Nevertheless, I fell in love with Porto and I love it still. I was enchanted by fado, the melancholy folk music that reflects the Portuguese themselves, who in my experience had a quietness and gentleness unique among Latin peoples I’d encountered so far. The city’s spectacular bridges, its vertiginous riverbanks, steep with ancient buildings, the old port houses, the wide squares: I was entranced by them all.\n\nWe all have shining memories of our youth, made poignant because they’re freighted with knowledge of what happened later to companions, and what lay ahead for ourselves. Back then we were allowed to roam freely across Europe in a way that shaped and enriched us, while benefiting from the longest uninterrupted spell of peace this continent has ever known. Lifelong friendships, love affairs and marriages could never have happened. Several children of my acquaintance, including my own eldest daughter, wouldn’t have been born without the frictionless travel the EU gave us.\n\nAt the time of writing, it’s uncertain whether the next generation will enjoy the freedoms we had. Those of us who know exactly how deep a loss that is, are experiencing a vicarious sense of bereavement, on top of our own dismay at the threatened rupture of old ties.\n\nI think again of my teenage pen friend Hanna, as I reach for a quotation by Voltaire. She rarely let me get away with anything, so she’d probably have accused me of choosing a French philosopher in a spirit of pure provocation.\n\nWell, Hanna was right about many things, but on this she’d be wrong. The truth is that I’m thinking of her now because she was my first friend from continental Europe, and because the words of Voltaire that hold so much meaning for me now are these: “L’amitié est la patrie.” “Where there is friendship, there is our homeland.” And Hanna, I really don’t want to lose my homeland.\n\nIn the passport queue\n\nJeffrey Boakye\n\nIt’s always at the airport. In that queue waiting to show your passport and be given entry into the country in question, with a sprint of thoughts rushing through the mind, competing fears about how and if you are going to be accepted. In that final step you always feel so other, so different, clinging to your British identity, leather-bound in red, hoping it will keep you buoyant in unfamiliar seas. That’s the point when you feel most far from home; the wrong colour, in the wrong country, with the wrong language and feeling the wrong cocktail of apprehensions.\n\nBut then, you get to the Perspex booth, and something happens. There’s a smile, or a chat, or a comment – some kind of exchange that reminds you that you belong, at least, to this moment. That it’s not always aggression or suspicion. That sometimes, it’s a welcome. You collect those moments, because they are valuable. You hope that they won’t become rare.\n\nNear Year’s Eve, Berlin\n\nShami Chakrabarti\n\nIt was the late 1980s and my long vacation from law studies at the LSE. I worked as a short order cook at a coffee shop in Golders Green. Colette was our manager and she hailed from Ireland. French Sarah and Marie waited tables and there were many others whose names have sadly faded. I was born in London of Indian parents, but we were all young Londoners full of curiosity for our city and the wide world beyond. We spent much of our spare time together, in bedsits and shared houses.\n\nThen one day, Sarah became bored or homesick or both. She was taking off for her mother’s house in the south of France and I was invited. I had already been to Paris several times, had a French A-level and a little reading of Camus, Sartre and De Beauvoir. Yet there is nothing quite like the opportunity to stay with a family, sharing their food, shelter and stories. That kindness – repeated many times in the years that followed – helped shape me.\n\nSome months later Anya, a German friend and fellow law student, invited a few of us, first to her home in Frankfurt and then to Berlin to celebrate New Year’s Eve. What a night. During the day there were all sorts of restrictions on how to cross the divide via the Brandenburg Gate or Checkpoint Charlie, depending on your nationality. As midnight approached, the sheer numbers of revellers made policing redundant. I found myself hauled up by human hydraulics and then, moments later, I was in the East. I went home to London with beautiful graffitied fragments from the once so brutally permanent wall that was not to last the year.\n\nFacebook Twitter Pinterest Liverpool v Borussia Mönchengladbach in the 1973 Uefa Cup final. Photograph: Ullstein Bild/Getty Images\n\nYou’ll never walk alone\n\nFrank Cottrell Boyce\n\nDear Europe,\n\nRemember that time in 1973 when Uncle Billy went to watch the Reds beat Borussia Mönchengladbach 3–2 (on aggregate) in the final of the Uefa Cup? After the match, the Prussian police herded thousands of ecstatic scousers on to the waiting charter planes. It was only when he came down to earth with a bump at Liverpool airport that Billy remembered he’d gone to the match in his van. The van that was – he hoped – still neatly parked in the shade of the maples in the Bunter Garten a thousand miles away.\n\nThat night was the start of our love affair with Europe. Until then, Liverpool’s gaze was fixed the other way – over the sea to Ireland, New York, Valparaíso – the old sea routes our fathers had travelled, returning with the monkeys and parrots that played around our tenement balconies long after those trades had stopped.\n\nIt was football that bounced Europe into our lives. Liverpool often felt disconnected from the rest of England, but football connected us to Europe like a perfectly weighted pass. Young men who might barely have travelled beyond their own neighbourhoods became familiar with the bus and metro routes of Paris, Rome, Amsterdam and of course Mönchengladbach. I remember sitting in the Liverpool Irish Centre one evening when a whole crowd of slightly merry Dutch fans in orange burst in, saying, “Irish!? We’re with you. Orange and Green, yes?” As though in Ireland the orange and green were just two colours that went together well, rather than the blazons of an ancient blood feud. Everyone cheered them and bought them pints. I ended up driving four of them to Anfield.\n\nI have lived in France and Spain. I’ve worked in Italy. But I always end up back here in my hometown. I’m rooted, as Yeats said, in “one dear perpetual place”. But I hold in my heart a truth that our current leaders are constantly trying to erase – the truth that you can dedicate yourself to one place while revelling in the fact that it is part of something greater, that we never walk alone.\n\nLove and kisses from Liverpool.\n\nA larger life\n\nAlan Hollinghurst\n\nIt’s hard now to remember the boat-train and even the ferry itself, beyond the unstoppable moment when it cast off, the catch of the breath as the quay stepped sideways and everything realigned. What will never be forgotten is the sense of impatience for the other side, for Calais, Amiens, Paris. To learn how to get from the Gare du Nord to the Gare de Lyon, to find a room and order a beer and a croque monsieur, was to take command of a larger life, something we’d been raised and readied for and where we felt at once we belonged.\n\nMile after mile, night after day, the journey went on: Marseille, Ventimiglia, Turin, Milan, possibilities turning to practical certainties, even Venice itself. This was something much larger and deeper than a holiday. We knew we belonged in Europe as our own country belonged there; all my adult life has been spent as a citizen of Europe as well as of Britain, each thing felt keenly to be both a privilege and a right. The mood, the madness, of our time is to destroy concord, cooperation, and as an inevitable result to destroy ourselves. If it’s already too late to halt the destruction, it is also too late to efface the knowledge that we share in our millions, that we are Europeans.\n\nA new European song\n\nMary Beard\n\nMy career as an academic can be measured against the history of the Common Market, the EEC and the EU. I left school in 1972, and over those last forty-something years, what I do, the context in which I do it, and how I define myself and my job has changed dramatically, taking a decidedly European turn that is, without doubt, a turn for the better.\n\nI now expect to find students from all over Europe in my classes. Some of my closest colleagues in my department in Cambridge come from Italy, Germany and Greece. It’s two-way traffic as our staff and students have come simply to assume that “the Continent” – as we used to call it, as if it wasn’t us – is as open to them as the UK is. It’s open for conversation, for resources and for collaboration. This doesn’t just add to the local colour; the mix of cultures and languages, of educational backgrounds and different traditions of expertise has widened all our horizons.\n\nAnd it has changed how we think about our subject, our opportunities, and even about the very nature of education itself. To put it another way, whereas back in the 1980s I would have introduced myself as a British academic, maybe even an English one, I now also think of myself and call myself European, and I mean also. You don’t give up feeling British when you start to feel European.\n\nWe didn’t work hard enough over the decades to share the benefits of Europe of which we were so rightly proud\n\nBut there’s another less optimistic side to this, and that comes down to the question of who exactly the beneficiaries of what I’m calling this New European culture have been. It’s all very well for intellectuals to enjoy the new linguistic Babel of their common rooms, or of the students at elite universities to take advantage of the new horizons that come with cultural European collaboration. But none of that means very much to the unemployed of, say, Boston, Lincolnshire.\n\nThose of us who have been the beneficiaries of New Europe must face the uncomfortable fact that we are partly to blame for the vote going, in our terms, so badly wrong. Because we didn’t stop, or we didn’t stop long enough, to think of those who are on the other side of the cultural divide. We didn’t work hard enough over the decades, not just over the months of the referendum campaign, to share the benefits of which we were so certain and so rightly proud.\n\nNot someone like you\n\nMichel Faber\n\n“Oh, it won’t come to that, surely?” This is a phrase I’ve heard many times in the last three years. It’s uttered by friendly, cultured, open-minded people in my town – the sort of people who woke up on the morning of 24 June 2016 blinking in disbelief at finding their values outvoted. Since that day, they’ve reassured themselves that the fracture in our society can be reversed, as if a pane of glass can be talked out of the crack in it, as if a burst balloon can be made to see that staying intact is the best thing all round.\n\nI tell them that Brexit reclassifies me an illegal alien, officially “Unsettled”, unless I apply to Britain’s xenophobic government for permission to stay. “But you’re British, surely?” No, I am not British. “But you’ve lived here for so long.” Yes, but that’s not the point. This whole business is about rejecting multiculturalism, sorting out who’s Us and who’s Them. I am not Us. “Well, can’t you just apply?” Of course I can apply. But I don’t want to. It’s wrong. It stinks. “You’ve got nothing to worry about, surely? I mean, come on, they’re not going to send police to your flat to deport you. Not someone like you.” I don’t know what to say to these soft-hearted British Europhiles with their quaint notions of where the march of history will be too principled to go, their feeling that a Dutchman who speaks English ever so well and wrote The Crimson Petal and the White would surely be exempted from government regulations.\n\nI wonder where I’ll go, if I have to leave. The obvious place is the Netherlands, where I was born. But I remember almost nothing from the first seven years of my life. They were spent in Den Haag, apparently, but Den Haag to me is just a railway station.\n\nTwo decades ago, when the Dutch translation of Under the Skin was about to be published and I travelled to Holland to help promote it, a local journalist drove me to the neighbourhood where I spent my early years. He was intrigued by what I’d said in interviews about childhood trauma, the factors that led my parents to cut themselves off from their other children and emigrate with me to Australia, the frighteningly blank spaces in my memory where most people have formative stories. He was convinced that if he took me to the place where I’d lived, parked me in the street where I’d played, something would come back to me. We sat in the car for a while, with the tape recorder running. I thanked him for his kindness. Then we returned to the hotel, and I packed my bag for the airport.\n\nA love letter to Europe? I already wrote it, 26 years ago, to Britain, and I thought the answer was yes.\n\nFacebook Twitter Pinterest German troops retreat in Copenhagen in 1945. Photograph: Hulton Archive/Getty Images\n\nOn peace and quiet\n\nSandi Toksvig\n\nIn 1939, when the second world war broke out, my grandparents were living in Copenhagen, writing and acting. Although Germany and Denmark share a border, at first the conflict stayed south. Then, on 9 April 1940 the Germans moved north and invaded Denmark. Life for the Danes changed for ever.\n\nIn the first year or so of occupation what the Germans called the “Jewish problem” was not raised with the Danes. Denmark did not have a large Jewish population. There were just under 8,000 members of the community living across the country. As far as I am aware my grandparents didn’t know any Jews personally but, in the autumn of 1943, word was leaked that the Jews of Denmark were to be deported to concentration camps. On 29 September the Danish Jews were warned by the chief rabbi of Denmark to go into hiding immediately.\n\nFarfar (Danish for Father’s father) built a false wall in the apartment and painted it to look like the end of their sitting room. Behind this theatrical piece of set he and Farmor (Father’s mother) concealed Jewish families on the run. My father, still a little boy, went door to door, removing Jewish names from doorbells and replacing them with ordinary Danish ones. One day my grandparents got word that the German authorities were coming to raid the apartment. Farmor took a knife and cut her legs, applying theatrical makeup to the wounds. When the men arrived, she was lying on a sofa. The terrible running sores on her legs persuaded the invaders they did not want to stay. The apartment was not searched, and the hidden family not found.\n\nSweden was neutral in the war and, on 2 October that year, the Swedish government announced its willingness to take all Danish Jews. This land of freedom lay just 10 miles or so across open water. Fishermen up and down the coast gathered with any boat they could find. Across the Øresund the exodus of the Jews began. Not every Dane behaved well and not every German behaved badly. Life is not that clear-cut. But in the end over 99% of Danish Jews escaped the Holocaust. It was the finest example of cooperation in the face of injustice. My family had no reason to risk their lives for strangers, but when I asked my father why they had done it he simply shrugged and said: “It was the right thing to do.”\n\nI think of this when I walk on that beach and look out to the stretch of sea that was once the site of that astonishing rescue. I hope I would have the same courage to do the right thing. I tell the story because history matters. Since the end of the second world war and the wonderful decision by European countries to work together, we have had peace. Almost 75 years of it. I love peace and quiet. I love Europe.\n\nOdyssey\n\nTony Robinson\n\nThe first book I ever remember reading was about Odysseus and his agonisingly long journey home. Then I encountered Theseus and the Minotaur, Jason and his fleece, and the other musclebound ancient Greek heroes and sometimes vengeful, always long-suffering heroines.\n\nIn my teens, to the accompaniment of the Beatles’ “I Wanna Hold Your Hand” and wearing a Ban the Bomb badge, I absorbed myself in Camus, Sartre, De Beauvoir and Malraux. They dripped with meaning, although I wasn’t quite sure what the meaning was.\n\nAt 19 I played the middle-aged dupe Orgon in Molière’s excoriating play Tartuffe, my hair plastered with white liquid makeup, and sporting a limp and a stick to indicate my character’s advanced years. I worked alongside Donald Sinden in Ibsen’s majestic Enemy of the People, a play that should be required reading in these dark days.\n\nIn my kaftan, and through heavily smudged John Lennon glasses, I read Hermann Hesse, Günter Grass and Thomas Mann. Then Cervantes, Goethe and Dante until in my 50s I finally realised I’d been imbibing far too much testosterone and turned my attention to writers such as Colette and George Sand. I am currently feasting on Elena Ferrante’s glorious Neapolitan novel sequence.\n\nOn this odyssey I’ve never once thought of any of the above authors as exotic, foreign or outside my sphere of understanding. They are as much part of me as Shakespeare, the Brontës and the Beatles. They shaped me, moulded me, wrought me. I am British and I am European. Neither diminishes the other. Both enhance the other.\n\nA love letter to Europe\n\nNeil Gaiman\n\nDear Europe,\n\nI loved feeling part of you. That feeling that we were together, our differences combining to make something bigger than either of us. Something unique, something neither of us could have been on our own. We were workmates who became closer than that.\n\nI loved knowing that, even though we were a couple, we were still very much ourselves. You weren’t asking me to change the things about myself that I didn’t want to.\n\nI loved you when they lied about you. I loved the things you gave me: the peace and the prosperity, the knowledge that in a fight you’d have my back. I loved that you saw me as odd, ill fitting, awkward in our relationship, but you accepted what made me special, even seemed to appreciate it.\n\nWith you, I could go anywhere. I loved the people you brought into my world, and loved going places with you. I heard things, tasted things, delighted in things I would never have encountered without you. If we had children, they had so many places they would have been at home, so many places they could have lived.\n\nI don’t know why I’m leaving you, but I know how it goes. I said things I can’t take back. I did things I regret. I wish things could be like they were.\n\nThat’s all I want for both of us.\n\nThat things could be like they used to be.\n\nBut you’ll be fine without me, my love. How I’ll be, without you, I’m not so sure …\n\nstill love\n\nNeil\n\n• A Love Letter to Europe (Coronet) is published next week.", "description": "From Paris to Berlin, fado to football, boat trains to pen friends … public figures reflect on their lifelong relationship with Europe", "authors": ["Jk Rowling", "Neil Gaiman", "Jeffrey Boakye", "Shami Chakrabarti", "Frank Cottrell Boyce", "Alan Hollinghurst", "Michel Faber", "Sandi Toksvig", "Tony Robinson", "Mary Beard"], "top_image": "https://i.guim.co.uk/img/media/03dbbe4903b9d456f7cbf8319ecb760c068f333c/0_0_5221_3134/master/5221.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=dffcb0d72677c03cd716356ddd34a83c", "published_at": "2019-10-26"}