{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/the_americas/theres-nothing-left-storm-reduces-paradise-to-a-miserable-heap/2019/09/04/fb30683c-cf60-11e9-a620-0a91656d7db6_story.html", "downloaded_at": "2019-09-05 00:39:44.182429+00:00", "published_at": "2019-09-04", "title": "‘There’s nothing left’: In the Bahamas, Hurricane Dorian reduces paradise to a miserable heap", "language": "en", "text": "“We didn’t leave because we’d been through other storms,” said Craig Curry, 55. “But not this. This was nothing like we’ve ever seen.”\n\nCurry spent two days battling Hurricane Dorian in his home. When howling winds blew the first window out, he nailed his dining room table to the hole. Two more windows exploded, and then his door. He took shelter in his basement.\n\nAD\n\n“We fought that storm for two days,” he said. “Now we’re homeless. There’s nothing left.”\n\nAD\n\nGreen Turtle Cay is a tightknit community of about 500 people. Everyone here is family — either because they’re related, or because they’ve lived here together for so long.\n\nNow their island paradise has turned to hell. Islanders are struggling without power, without water, without a steady supply of food.\n\nThe Coast Guard staged rescues earlier Wednesday. Chef José Andrés and his World Central Kitchen nonprofit group dropped off boxes of chicken and rice. The government sounded the all-clear, lifting storm warnings for the Abacos, Grand Bahama, Bimini and other battered islands.\n\nAD\n\nBut fear here is spreading.\n\n“We need tarps. We need medical supplies. We need more water. We need chain saws,” said boat captain Rontonio Levarity, 35. “We can’t do this alone.”\n\nLevarity’s Mako yacht was smashed to pieces in the storm.\n\nAD\n\nBahamas lifts Hurricane Dorian storm warnings, assesses ‘catastrophic’ destruction as death toll rises to 20\n\nThe Washington Post flew to the Abacos islands on a helicopter chartered by World Central Kitchen. The island came into view 25 minutes out of Nassau: the white sand beaches and turquoise waters of the northern half, largely spared Dorian’s wrath. In the south, watery cays and island scrub show nature’s blitzkrieg.\n\nMuch of the island is still flooded. Homes remain submerged. Inland brush has turned to marshland. There are forests of fallen trees.\n\nAD\n\nMarsh Harbour lived off tourism. But the infrastructure has been flattened. Two power plants were crippled. The marinas, destroyed. Abacos Big Bird, the local chicken farm, was leveled.\n\n“People are desperate,” said Travis Kelly, a 33-year-old boat captain.\n\n“There’s a fleet of 100 fishing boats, wrecked, on the streets,” Kelly said. The water supply is contaminated with gasoline and feces.\n\nAD\n\nKelly said the apartment where he has been staying since his house was destroyed was robbed on Tuesday. Stolen, he said, were his cellphone, batteries, food, water.\n\nHis feet were cut and infected from days in flooded streets.\n\nHe said the community also pulled together, sharing food, water and shelter.\n\nAD\n\n“There’s no curfew, because there is no one here to enforce it,” he said. “We’re four days in and they are still ‘assessing the situation.’ ”\n\nSeventeen of the Bahamas’ 20 confirmed deaths from Dorian have been on the Abacos. Prime Minister Hubert Minnis described the losses: 60 percent of houses in Marsh Harbour damaged. The Mudd, a shantytown of Haitian workers, destroyed. The airport underwater.\n\nBut there was misery on other islands. The storm, which struck Sunday as a Category 5 hurricane, spent 40 slow hours from Sunday to Tuesday grinding across Grand Bahama.\n\nAD\n\nThe death count was expected to rise as search efforts spread to more areas that were flattened by the storm.\n\nAD\n\nCoast Guard helicopters airlifted patients from the hardest-hit islands to medical facilities in Nassau, the capital. The British Royal Navy, aid groups and volunteers joined in rescue and relief efforts.\n\n“The magnitude of destruction is catastrophic,” said Lt. Cmdr. Kristopher Ensley, the captain of the 154-foot Coast Guard Cutter Paul Clark. “It’s tragic.”\n\nThis fisherman lost everything in Hurricane Dorian, including his wife\n\nIn Nassau, spared the worst of the storm, concerned relatives gathered at the international airport in the hope of receiving loved ones evacuated from the northern islands — or, at least, word that they were okay.\n\nSandra Cooke has family living on cays near the Abacos. Communication has been difficult, she said, and their situation is dire.\n\nAD\n\nAD\n\n“It’s all gone,” she said. “They, the prime minister, the authorities, aren’t even talking about those keys, they haven’t even flown over those cays. It’s flat like the ground we’re standing on.”\n\nIn Freeport on Grand Bahama, 60-year-old Gail Woon described a “taxing” night in a shelter. Someone opened a window, and the roof collapsed.\n\nWoon and the others there ran to a church — one of the few structures, she said, that didn’t collapse or flood.\n\n“Buildings here are only built to withstand 150-mph winds,” she said. “We have no chance.”\n\nWoon returned to her flooded home on Wednesday, to salvage what she could. A generator chugged power.\n\nShe had lived through Hurricanes Frances and Jeanne in 2004.\n\nAD\n\n“This was nothing like those,” she said. “This was something that we never experienced before.”\n\nMaria Sacchetti aboard the U.S. Coast Guard Cutter Paul Clark in the Atlantic Ocean and Jasper Ward in Nassau contributed to this report.\n\nAD\n\nCORRECTION : This story has been updated to correct a reference to the Abaco islands, which an initial version called “Grand Abaco.”\n\nHurricane Dorian leaves terrible destruction in Bahamas as it rolls toward U.S.\n\nSlow-moving Hurricane Dorian pounds Bahamas for third punishing day; children among the dead\n\n‘Bahamas is presently at war’: Slow-moving Dorian wreaks devastation across island nation\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "Some in the closely knit community on Green Turtle Cay tried to ride out the storm. Now fear is spreading.", "authors": ["Anthony Faiola", "Correspondent Covering Latin America", "Venezuela", "Argentina", "Brazil", "Human Rights", "Poverty", "Globalization"], "top_image": "https://www.washingtonpost.com/resizer/COIFygMKpiiP_LjAhARH34DJxYU=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BLR2QJGPM4I6TDA4PSHOPBNYKU.jpg"}