{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/9/elizabeth-warren-releases-environmental-justice-pl", "downloaded_at": "2019-10-09 18:33:43.852825+00:00", "title": "Elizabeth Warren releases 'environmental justice' plan", "language": "en", "text": "Sen. Elizabeth Warren on Wednesday released a plan intended to deliver “environmental justice” to communities most affected by climate change - one of the key priorities for activists championing the Green New Deal being pushed by Ms. Warren and other liberals in Congress.\n\nMs. Warren, a leading 2020 Democratic presidential contender, wants the federal government to better map at-risk communities across the U.S. and direct at least $1 trillion to the most vulnerable communities over the next decade.\n\nShe also plans to transform the White House’s Council on Environmental Quality into a broader Council on Climate Action and bring community leaders to the White House within 100 days of taking office for an “environmental justice summit.”\n\nShe also is vowing to provide job training and guaranteed wage and benefit “parity” for fossil fuel workers transitioning to new industries, bolster work safety regulations, and empower the Environmental Protection Agency to “aggressively” pursue cases of “environmental discrimination” and go after corporate polluters.\n\nMs. Warren also wants to hold the financial industry “accountable” for “its role in the climate crisis” and require banks and other companies to disclose their greenhouse gas emissions and price their exposure to “climate risk” into their valuations.\n\nShe re-introduced a “climate risk disclosure” bill earlier this year.\n\nShe also plans to work with Congress to expand “clean energy bonds” for community groups, put more money into clean water efforts, and make it easier for vulnerable residents to move out of flood-prone areas - a “higher ground” pitch that 2020 Democratic presidential rival Andrew Yang has made.\n\nHer campaign also said a Warren administration would better monitor post-disaster recovery to head off “climate gentrification.”\n\nThe plan gives multiple shout-outs to Washington Gov. Jay Inslee, a former 2020 presidential candidate who made climate change the central issue of his campaign.\n\nMs. Warren is a co-sponsor of the Green New Deal and has already introduced other policy proposals with an eye toward climate change, including a $2 trillion plan to invest in “green” manufacturing.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Sen. Elizabeth Warren on Wednesday released a plan intended to deliver \"environmental justice\" to communities most affected by climate change - one of the key priorities for activists championing the Green New Deal being pushed by Ms. Warren and other liberals in Congress.", "authors": ["The Washington Times Http", "David Sherfinski"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/09/Election_2020_Elizabeth_Warren_43773.jpg-5ae06_c0-229-5472-3419_s1770x1032.jpg?6f9ce78ee1a3a25672569ab4bf84dc3559d8855e", "published_at": "2019-10-09"}