{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1WA2YN-OCASP", "downloaded_at": "2019-09-25 23:28:06.602202+00:00", "title": "76ers expect Simmons to launch 3-point shots", "language": "en", "text": "Philadelphia 76ers point guard Ben Simmons has never made a 3-pointer during his two NBA seasons.\n\nFILE PHOTO: May 9, 2019; Philadelphia, PA, USA; Philadelphia 76ers guard Ben Simmons (25) smiles with his team duringa break in the fourth quarter in game six of the second round of the 2019 NBA Playoffs against the Toronto Raptors at Wells Fargo Center. Mandatory Credit: Bill Streicher-USA TODAY Sports\n\nThat 0-for-17 accuracy rate hasn’t deterred an offseason experiment where Simmons shot bushels of 3s in hopes of becoming a factor from behind the arc.\n\nSixers coach Brett Brown says the 23-year-old All-Star point guard will be counted on to hoist long-range shots this season.\n\n“The time that he has invested over the course of this summer is the best by a long shot that he ever has,” Brown told reporters on Wednesday at a media luncheon. “His awareness of this thing in the marketplace, he’s prideful, he gets it. His confidence that I saw when he came back to Philadelphia and played in our gym over the last few weeks just stood out, it shone as if he had invested time and he was looking forward to showing us.”\n\nSimmons, who averaged 16.9 points last season, has been reluctant to fire up 3-pointers, even when teams back off and leave him open by five feet and sometimes up to 10 or more.\n\nBrown said that will change. He just wants Simmons to make smart decisions while showing more aggressiveness in taking them.\n\n“With Ben, we’re not going to hunt 3s,” Brown said. “When they are available, I want him to shoot them. The reckless use of 3s doesn’t tie into my initial statement of our team being huge.\n\n“I do think we can play a style of play that is just smash-mouth defense and bully-ball offense, I think this team has the ability to do that. And so it leans more toward that than, let’s come down and crank out 3s.”\n\nBrown said that Simmons hiding near the baseline on offense will no longer be a regular occurrence. Simmons will now venture into the corners and, as he gains confidence, he may be situated by the 3-point line in the middle of the floor.\n\n“You’re not going to see me put him down there at the start of the year,” Brown said of the baseline. “I want to give him a chance to be spaced. You’re probably going to see him in one of the corners, but I’m going to start there.\n\n“We’re going to encourage him to shoot 3s, and we’re going to encourage him ... if he sees a straight-line drive, take off and eat it up. I think I can help him use the space in both of those ways.”\n\nBrown also indicated that the health of All-Star center Joel Embiid will again be a priority. Embiid played in a career-best 64 regular-season games last season, which means he still didn’t play in 22 percent of the contests.\n\nEmbiid averaged 27.5 points, 13.6 rebounds and 3.7 assists last season when he registered 58 double-doubles. He has experienced foot and knee issues since entering the NBA and has played in just 158 games since being the No. 3 overall pick of the 2014 NBA Draft.\n\n—Field Level Media", "description": "Philadelphia 76ers point guard Ben Simmons has never made a 3-pointer during his two NBA seasons.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190925&t=2&i=1433909217&w=1200&r=LYNXMPEF8O25W-OCASP", "published_at": "2019-09-25"}