{"pub": "townhall", "url": "https://townhall.com/tipsheet/mattvespa/2019/10/04/reports-wealthy-democrats-quietly-saying-theyll-back-trump-if-warren-is-the-nom-n2553776", "downloaded_at": "2019-10-04 23:46:39.053519+00:00", "title": "Reports: Wealthy Democrats Quietly Saying They'll Back Trump If Warren Is The Nominee", "language": "en", "text": "Elizabeth Warren may be hauling in cash, not as much as the Republicans, but she may bring new headaches to the Democratic Party should she win the nomination. For starters, she’s avoided like the plague the question about her health care plan and whether it will increase taxes on the middle class. Of course, they will. There’s no way this Democratic action item works without everyone’s taxes going up in exchange for sub-par quality health care. She finally admitted that her Native American heritage claim was straight trash, though she owed it to family stories as the explanation for the mix-up. As Charlemagne tha God of New York’s Breakfast Club noted, Warren is the original Rachel Dolezal, a white woman who faked being black four years ago. Yet, Warren could also face lackluster support from traditionally deep-pocketed donors from within the Democratic Party.\n\nCNBC reported recently that were rumbles that Wall Street Democrats might either withhold donation or even support Trump should Warren win the nomination. In an election year that’s going to be expensive and exceptionally brutal, you need every penny you can put in the war chest. Trump and the GOP are going to have a billion-dollar war chest easy. The Republican National Committee raised $125 million in the third quarter; the Republicans have the small donor army now. So, Warren can either risk losing access to a lot of cash or hold a pow wow with this crew and downplay their concerns that she’s pretty much Lenin in a dress (via CNBC):\n\nDemocratic donors on Wall Street and in big business are preparing to sit out the presidential campaign fundraising cycle — or even back President Donald Trump — if Sen. Elizabeth Warren wins the party’s nomination. In recent weeks, CNBC spoke to several high-dollar Democratic donors and fundraisers in the business community and found that this opinion was becoming widely shared as Warren, an outspoken critic of big banks and corporations, gains momentum against Joe Biden in the 2020 race. “You’re in a box because you’re a Democrat and you’re thinking, ‘I want to help the party, but she’s going to hurt me, so I’m going to help President Trump,’” said a senior private equity executive, who spoke on condition of anonymity in fear of retribution by party leaders. The executive said this Wednesday, a day after Speaker Nancy Pelosi announced that the House would begin a formal impeachment inquiry into Trump. […] The business community’s unease about Warren’s candidacy has surged in tandem with her campaign’s momentum. CNBC’s Jim Cramer said earlier this month that he’s heard from Wall Street executives that they believe Warren has “got to be stopped.” Warren later tweeted her response to Cramer’s report: “I’m Elizabeth Warren and I approve this message.” Some big bank executives and hedge fund managers have been stunned by Warren’s ascent, and they are primed to resist her. “They will not support her. It would be like shutting down their industry,” an executive at one of the nation’s largest banks told CNBC, also speaking on condition of anonymity. This person said Warren’s policies could be worse for Wall Street than those of President Barack Obama, who signed the Dodd-Frank bank regulation bill in the wake of the 2008 financial meltdown.\n\nHey, folks, we’re a big tent party—all are welcome. It just shows how the business community knows that Warren and the Democrats could wreck the economy, which has been going strong since 2016. Consumer and small business confidence have reached records highs. Paychecks are bigger. Jobs are being created, over three million thus far. Unemployment hit 3.5 percent under the Trump administration, a 50-year low.\n\nBreaking News: Unemployment Rate, at 3.5%, drops to a 50 YEAR LOW. Wow America, lets impeach your President (even though he did nothing wrong!). — Donald J. Trump (@realDonaldTrump) October 4, 2019\n\nFor women, the unemployment rate dropped to 3.4percent, the lowest since 1953. And Hispanic unemployment was reduced to 3.9 percent. The previous all-time low for this demographic was 4.8 percent. A sure way to torch all of this: electing a Democrat in 2020, especially Lie-a-Watha Warren.", "description": ".10/04/2019 19:43:32PM EST.", "authors": ["Matt Vespa", "Beth Baumann", "Julio Rosas", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/248/1a3beffe-dc66-4752-baae-3f0c2d1c1ce0.png", "published_at": "2019-10-04"}