{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7614389/MMA-legend-Randy-Couture-insists-alive-suffering-heart-attack.html", "downloaded_at": "2019-10-25 22:36:00.613032+00:00", "title": "MMA legend Randy Couture insists he is 'alive and well' after suffering heart attack", "language": "en", "text": "Mixed martial arts legend and UFC Hall of Famer Randy Couture says he is 'alive and well' as he recuperates in intensive care after suffering a heart attack and having emergency surgery on Thursday.\n\nCouture updated fans and explained the circumstances behind the episode in a statement given to TMZ.\n\n'Contrary to recent rumors I have not kicked the bucket yet,' he said. 'I am alive and well.'\n\nCouture checked himself into Cedars Sinai Hospital in Los Angeles on Thursday after he began to feel ill during a workout at a nearby gym.\n\n'Special thanks to the amazing staff at Cedars Sinai Hospital,' he continued. 'From the ER to cardiac ICU thanks for taking care of me.\n\n'I'm one of those people that has crazy thick blood and nominally high bad cholesterol. Unfortunately, those 2 factors combined to create a nice clot occluding my Diagonal artery.\n\n'The Cath lab at Cedars got right on it, cleared it out and placed a stint in its place.'\n\nMixed martial arts legend and UFC Hall of Famer Randy Couture (right, with actress girlfriend Mindy Robinson) says he is 'alive and well' as he recuperates in intensive care after suffering a heart attack and having emergency surgery. Couture updated fans and explained the circumstances behind the episode in a statement given to TMZ. 'Contrary to recent rumors I have not kicked the bucket yet,' he said. 'I am alive and well'\n\nMMA legend Randy Couture (left) built his reputation largely with impressive wins over other MMA legends, such as Chuck Liddell (right), Tito Ortiz, and Vitor Belfort\n\nCouture concluded with a message for his fans: 'Live your lives to the fullest. You never know when you’ll draw that last breath in!'\n\nAs first reporter by TMZ, Couture checked himself into the hospital after he began to feel ill while working out at Unbreakable Performance Center, a gym owned in part by Fox Sports' Jay Glazer and former Chicago Bears linebacker Brian Urlacher.\n\nSources close to the three-time UFC Champion told TMZ that he was treated immediately at the hospital and was expected to recover.\n\nBorn in Washington state, Couture now lives in Las Vegas as a retiree, although he does do some color commentating for MMA bouts.\n\nAfter an impressive high school wrestling career, Couture joined the army, where he was introduced to Greco-Roman wrestling, and ultimately served as a three-time Olympic team alternate.\n\nCouture was a three-time NCAA Division I All-American and two-time NCAA Division I runner up while wrestling for Oklahoma State\n\nHe was also a three-time NCAA Division I All-American and two-time NCAA Division I runner up while wrestling for Oklahoma State University in 1991 and 1992.\n\nCouture is best remembered for his years fighting on UFC cards, earning a 19-11 lifetime record, including seven wins by knockout and another four by submission.\n\nHe built his reputation largely with impressive wins over other MMA legends, such as Chuck Liddell, Tito Ortiz, and Vitor Belfort.\n\nCouture became a coach after retirement, and even tried his hand at acting, appearing in the movie The Expendables and both of its sequels in addition to some television work.\n\nHe also did a season of ABC's Dancing With The Stars.\n\nCouture was previously married and has three children: sons Ryan and Caden, and daughter Aimee. He is currently romantically involved with actress Mindy Robinson, according to multiple reports.\n\nRyan, 37, is also an MMA fighter.", "description": "Mixed martial arts legend and UFC Hall of Famer Randy Couture says he is 'alive and well' as he recuperates in intensive care after suffering a heart attack in Los Angeles on Thursday.", "authors": ["Alex Raskin Sports News Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/17/20189012-0-image-a-2_1572021351774.jpg", "published_at": "2019-10-25"}