{"pub": "afr", "url": "https://afr.com/brand/life-and-leisure/sydney-symposium-explores-architecture-with-a-light-touch-20190927-p52vgv", "downloaded_at": "2019-10-05 05:59:22.069426+00:00", "title": "Sydney symposium explores architecture with a light touch", "language": "en", "text": "“For me, it is important to identify the limits of what architecture can be,” he says. “Lightness and transparency are part of my architecture, but they do not represent its absolute values. For example, some of my projects have even pursued weight and opacity to greater degrees.”\n\nThe weight and opacity Ishigami is referring to are manifest in the house and restaurant he devised in the Yamaguchi prefecture not far from Hiroshima. This labyrinthine underground complex was created by pouring concrete into holes in the ground, which acted as a semi-porous mould. The surrounding earth was then excavated to reveal a globular matrix of grotto-like spaces.\n\nJunya Ishigami's Japanese Pavilion in the Giardini della Biennale in Venice.\n\n“In order to realise experimental construction, a space may deviate from the general values we understand to represent ‘architecture’,” says Ishigami. “However, if there is no comfort then there is no architecture. In that sense, in order to realise experimental construction, a primary need must be to pursue innovation and meet comfort anew.”\n\nOdile Decq, whilst inhabiting another point on the creative spectrum, agrees on the importance of comfort – even when devising uncompromising architectural gestures.\n\n“Architecture is about creating contexts within which people can forget about the harshness of their lives outside,” she says. “No matter how bold, it has to have a humanistic approach, whether housing or offices or a public structure.”\n\nOdile Decq's GL Events building in Lyon appears gauzy thanks to a photographic cladding. Roland Halbe\n\nIn Decq’s deft hands, form doesn’t slavishly follow function.\n\n“There always has to be something in addition to the functional program in order to provide people with something better, more comfortable, more engaging.”\n\nHer buildings are at once industrial, tough, but strangely effervescent.\n\nAdvertisement\n\nFor all its robust I-Beam structural composition, Decq’s GL Event building in Lyon is virtually transparent, almost gauzy – its entire facade is covered by ethereal black and white photographs by Swiss artist Felice Varini.\n\nThe recently opened Le Cargo building for business startups, on the north-eastern outskirts of Paris, features a four-storey parapet which appears to bubble up the façade. An oversized, globular red volume floats above the reception area, creating a dramatic mezzanine. (Black and white offset by red are an identifiable Decq palette.)\n\nOdile Decq is both architect and educator. Franck Juery\n\nDecq, who has been a practising architect for some 40 years and an educator for 20, recently set up her own school to combat the conservatism and sexism of the architecture system. With 35 students from around the world – “60 percent male to 40 percent female, we’re not there yet” – Confluence holds no courses but teaches students to research, analyse and express opinions. “Then we repeat the process each semester for five years until they know how to do it by themselves,” she says.\n\n“Sometimes it feels like a crazy undertaking, but I was tired of always having the same conversations about how the profession is broken,” she says, “so I decided to do something about it instead of just talk.”\n\nSou Fujimoto, who is a member of the advisory board at Confluence, is also a professor of architecture at the Illinois Institute of Technology in Chicago. Open-ended, porous, sometimes vitally wall-less, his buildings manifest new ways of being in the city.\n\nThe installation by Junya Ishigami in London's Kensington Gardens.\n\nFujimoto designed the Serpentine Summer Pavilion in 2013, creating an ethereal, cloud-like structure from a white lattice of steel poles. Ishigami’s Serpentine Pavilion – a swooping wing composed of 61 tonnes of Cumbrian slate – is installed in Kensington Gardens until next Monday, six days before he delivers his keynote address as part of SCCI’s 2019 Architecture Hub.\n\nDr Gene Sherman (the doctorate is in early 20th-century French literature) launched the SCCI think tank last year with a focus on architecture and fashion. (The next Fashion Hub will take place next April.) This trio of keynote speakers was selected by herself and two advisory curators for various reasons.\n\n“I am attracted to the combination of playfulness and precision in Fujimoto-san’s work,” says Sherman.\n\n“Ishigami is a poet at heart and a deeply imaginative artist.”\n\nDecq, Sherman notes, is a trail-blazing female architect in a profession where women rarely rise to the top.\n\n“Her vision is clear, idiosyncratic and opinionated. She has chosen provocation as a stance rather than conciliation or compromise,” says Sherman.\n\nNEED TO KNOW\n\nSCCI Architecture Hub features 50 thinkers in architecture. The 10-day program will be held at various venues across Sydney from October 10.", "description": "Three keynote speakers at next week’s Architecture Hub share a common purpose: coexistence with the landscape.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2119%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/a4940ca219c0027e9bcb60d3d7c08a8e1964c4b3", "published_at": "2019-09-27"}