{"pub": "thenextweb", "url": "https://thenextweb.com/apps/2019/10/30/sony-playstation-vue-shut-down", "downloaded_at": "2019-10-30 23:16:46.462118+00:00", "title": "Sony pulls the plug on PlayStation Vue", "language": "en", "text": "Sony today announced that it’s shuttering its Vue TV streaming service, apparently not being able to make it work despite numerous price increases. The service will end early next year.\n\nVue’s gimmick was that, like Sling TV, you could pay only for the channels you wanted. It was primarily aimed at PlayStation 4 users, a compliment to PS4’s suite of other entertainment options. While it might have seemed like a bargain when it first debuted, Sony‘s pushed the price up and up. Most recently, it pushed the price up by $5 this July, blaming it on “costs rising each year.”\n\nThere’s a scent of bitterness in the announcement, as John Kodera, Deputy President of Sony Interactive Entertainment says: “Unfortunately, the highly competitive Pay TV industry, with expensive content and network deals, has been slower to change than we expected. Because of this, we have decided to remain focused on our core gaming business.” He later adds, “We had ambitious goals for how our service could change how people watch TV, showcasing PlayStation’s ability to innovate in a brand-new category within the Pay TV industry.”\n\nThis clearly wasn’t as successful an experiment as Sony would have liked. Recent scuttlebutt has it that the company was looking for a buyer for Vue, but no one was nibbling. The Information reports Sony approached FuboTV, another such service, as a potential buyer, but no dice. The sale would have included a 500,000-household subscriber list — which doesn’t seem like a lot to me. Then again, Vue hasn’t been as big of a staple of the PlayStation brand recently as, say, PlayStation Now.\n\nMovies and TV content will still be available to PlayStation users via apps like Netflix and such. But if you’re one of the people who was using Vue as a standalone service, then you’re out of luck. There are alternatives, but given how Vue slipped into the red despite having the backing of such a big corporation as Sony, it kind of raises questions about how long the other services are going to last.\n\nPlayStation Vue service officially shuts off on January 30, 2020.\n\nRead next: Jack Dorsey: Twitter will stop all political ads next month", "description": "", "authors": ["Rachel Kaser"], "top_image": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2016%2F09%2Fplaystation-vue-.jpg&signature=399913e88c4d137eb7eed8f053bd94ab", "published_at": "2019-10-30"}