{"pub": "businessinsider", "url": "https://businessinsider.com/wework-glossier-and-rent-the-runway-host-summer-camps-2019-10", "downloaded_at": "2019-10-15 15:20:21.327448+00:00", "title": "Startups like Glossier and Rent the Runway love throwing Instagrammable 'summer camps' for employees — but WeWork's version has become a cautionary tale", "language": "en", "text": "First came the escape rooms, then came the glamping trips.\n\nLavish corporate retreats, particularly among a certain subset of buzzy startups, are becoming less of an anomaly and more of an imperative for companies looking to attract young talent. What was once an afternoon away from the office to break bread and participate in team bonding activities (trust fall, anyone?), corporate retreats have since ballooned into multi-day offsite extravaganzas.\n\nWhile corporate retreats can be impactful in helping to incentivize employees and providing face time with colleagues and key company leaders, they can also end up becoming raucous, substance-infused parties. The recent downfall of WeWork exemplifies how the corporate retreat can run amok, becoming incubators for wild behavior, heavy drinking, and exorbitant company spending. And while it's an extreme example, WeWork isn't the only tech startup to plan such a lavish off-site retreat for employees.\n\nCastles, palaces, and sex tents\n\nThough company outings vary broadly in scope and can prove integral to team building and employee growth, WeWork employees told Business Insider last month that the company's annual \"Summer Camp\" was brimming with sex and drugs. Several of the employees expressed shock at the inappropriate behavior and the costly and over-the-top nature of the event, which included performances from high-profile acts like Lorde and Florence and the Machine.\n\nRead more: Sex, tequila, and a tiger: Employees inside Adam Neumann's WeWork talk about the nonstop party to attain a $100 billion dream and the messy reality that tanked it\n\n\"We're talking people having sex in the bushes, people openly popping pills, railing lines [of drugs] in the middle of crowds while watching Bastille perform,\" an employee requesting anonymity told Business Insider's Julie Bort and Meghan Morris. \"You could hear people audibly having sex in their tents all day and night. People peeing all over the place, and pulling down their pants and defecating in between the tents because they are so drunk they can't even make it to the bathroom.\"\n\nCorporate retreats have a storied history in American society, but only in the past few decades have they grown quite as elaborate as WeWork's. While tech companies like Microsoft have been sending employees on annual mountain retreats for decades, by the early 2000s brands had started booking out European palaces, hosting thousands of professionals for \"incentive trips,\" the New York Times reported.\n\n\"Built as fortresses to repel attackers, castles now have the welcome mat out for a different sort of invader, as American companies and associations rent them — as well as palaces and manor houses — for meetings, conferences, gala dinners, product introductions and incentive programs to reward or motivate employees or outside salespeople,\" Sharon McDonnell wrote in her 2005 article on the trend.\n\nGlitzy corporate retreats took a bit of a backseat during and immediately after the recession, with the exception of companies like AIG, which spent $440,000 on an employee spa retreat in 2008, shortly after receiving a bailout from the federal government. But now offsite outings are making a major comeback, both for better and for worse.\n\nGlamping at the 'big Glossier wedding'\n\nWhile not all retreats skew so deviant, that doesn't mean they're not equally as lavish. For companies like Glossier and Rent the Runway, activities like \"glamping\" (a portmanteau of glamour and camping) have become top-billed events.\n\nAt Glossier, employees are invited to \"Camp Glossier,\" an annual event that in recent years has \"sent shock waves across social media\" with its \"epic games of human bubble soccer\" and personalized swimsuits, Lindsay Talbot wrote in Domino in 2017.\n\n#CampGlossier 2016 has commenced. #ultimateOOO #teamquartz A post shared by Emily Weiss (@emilyweiss) on Aug 22, 2016 at 2:26pm PDT Aug 22, 2016 at 2:26pm PDT\n\nHeld in idyllic locations like the Berkshires and Cedar Lakes Estate in upstate New York, employees lounge in pool floaties, make friendship bracelets, and propel across the water in millennial pink Glossier-branded canoes.\n\nI hope you danceeeeeee 🤗💃🏾😅⛺️💓. [📸: @em_gil] #campglossier #glossier #happygirl A post shared by Diarrha N'Diaye (@diarrhaxo) on Jul 28, 2018 at 8:27am PDT Jul 28, 2018 at 8:27am PDT\n\nOh Camp Glossier, you were just a peach. @glossier #campglossier A post shared by Mary Martha Stasinopoulos (@marymarthastas) on Jul 25, 2019 at 4:59pm PDT Jul 25, 2019 at 4:59pm PDT\n\n#campglossier 2019: we’ll never be the same A post shared by jules (@cangelosi) on Jul 24, 2019 at 6:59pm PDT Jul 24, 2019 at 6:59pm PDT\n\nThe event has even inspired merchandise and Spotify playlists for the brand's most devoted followers.\n\nAs requested: the extremely limited edition #campglossier t-shirt. Many will enter, two will win. Tag your pal 👭 CONTEST ENDED winner has been contacted via DM 😀👋 A post shared by Glossier (@glossier) on Jul 31, 2017 at 10:04am PDT Jul 31, 2017 at 10:04am PDT\n\nThere are more than 400 posts tagged with the hashtag #CampGlossier on Instagram, a testament to the brand's DNA, which was founded largely thanks to the power of social-media word of mouth. Building upon Camp Glossier, founder Emily Weiss told Quartz in 2016 that she had formerly toyed with the idea of incentivizing top performing staff members with a \"Glossier Coachella.\" Glossier declined Business Insider's request for comment.\n\nMeanwhile, Rent the Runway recently held a \"Camp RTR\" event of its own, though the company does not have a designated annual retreat, according to a company spokesperson. Instead, it conducts regular surveys as part of its internal culture program to gauge interest in group activities and outings, leading to events ranging from ski retreats in upstate New York to beach days in the Hamptons.\n\nOOO 🐚⛱ #RTRCC #RTRbeachday #companybonding #weouthere A post shared by Erica Rothen (@erothen) on Aug 4, 2016 at 2:11pm PDT Aug 4, 2016 at 2:11pm PDT\n\nPerfect day in the Hamptons with my fashiony friends📷⛱ #rtrbeachday A post shared by MacKenzie Fanaro (@kenziefanaro) on Aug 2, 2018 at 4:32pm PDT Aug 2, 2018 at 4:32pm PDT\n\nTypical work day #rtrapresski2019 A post shared by Victoria Stabile (@victoriastabile) on Mar 7, 2019 at 1:43pm PST Mar 7, 2019 at 1:43pm PST\n\nski in fashión ⛷👑 #renttherunway A post shared by Amanda Grier ✨ (@agpow) on Mar 7, 2019 at 2:09pm PST Mar 7, 2019 at 2:09pm PST\n\nUltimately, for Glossier's Weiss, gatherings like Camp Glossier's \"two days of cool\" and outings like team dinners serve as a symbolic showing of dedication to the brand.\n\n\"We had a kickoff 2019 dinner that was kind of like, I was joking as I stood there, it looked like a vow renewal ceremony of working at Glossier,\" Weiss said at Recode's Decode conference in January 2019. It was like a big wedding, like, a big Glossier wedding. And it kind of was. It was like, the new year, it was like, 'So, you're all back, we're recommitting for the year ahead.'\"", "description": "The demise of WeWork is shining a light on raucous party culture and exorbitant offsite events like corporate retreats at startup companies.", "authors": ["Bethany Biron"], "top_image": "https://image.businessinsider.com/5d84dea02e22af051b1b553c?width=1200&format=jpeg", "published_at": "2019-10-15"}