{"pub": "fox", "url": "https://foxnews.com/media/bret-baier-democrats-growing-anxious-about-joe-bidens-weak-frontrunner-status-ahead-of-2020", "downloaded_at": "2019-09-05 00:07:09.419445+00:00", "published_at": "2019-09-04", "title": "Bret Baier: Democrats growing anxious about Joe Biden's 'weak frontrunner status' ahead of 2020", "language": "en", "text": "Democratic circles are anxious about former Vice President Joe Biden’s status as the 2020 frontrunner, “Special Report” host Bret Baier said Wednesday.\n\nBaier’s comments come following remarks from a senior campaign adviser who told reporters Tuesday that Iowa, which holds the first nominating contest in the nation, is not a must-win state on the path to the presidential nomination.\n\n“Do I think we have to win Iowa? No,” the adviser said. “We think we’re going to win. We think it’s going to be a dogfight… but we think there are several candidates in this field, there’s probably three or four, that are going to go awhile.”\n\nThe advisers have also said that they’ve laid the groundwork in early voting states, but are “now ramping up for Super Tuesday and beyond.”\n\nBIDEN CAMPAIGN DOWNPLAYS EXPECTATIONS IN BOTH IOWA AND NEW HAMPSHIRE\n\n“We feel we are going to be in a very dominant spot,” after the first four early states, another adviser said.\n\nAppearing on “America’s Newsroom,” Baier told host Julie Banderas, “If you’re the frontrunner, you’re expected to win every place. So, when you start saying in September that it’s not necessary for you to win Iowa -- you don’t have to win it -- that’s not exactly the best message out there.”\n\n“Problem is: by the time you get there, it could be too late,” he added.\n\n“There are candidates who obviously have skipped Iowa and gone on to win and become president. However, usually in recent history, it is a pivotal state,” Baier added.\n\nTRUMP TRAILING BIDEN IN CRUCIAL 2020 BATTLEGROUND STATE OF WISCONSIN: POLL\n\nIn addition, Biden’s campaign advisers underscored his lead in the polls and argued he holds the “broadest reach” of the competitors.\n\nBaier, however, said he believes that Biden has to play well in Iowa to be at the top.\n\n“What happens is inevitability…the ability to beat Donald Trump, the ability to be the best candidate…If suddenly the Democratic caucus, the Democratic primary voters decide, ‘You know what, he’s not the best and we think there’s somebody better,’ that inevitability thing starts running out pretty quickly,\" Baier said.\n\nBiden’s status as the frontrunner to be nominated has also taken several blows over the past few weeks after a series of public misstatements and gaffes.\n\nKARL ROVE: JOE BIDEN THE SUBJECT OF 'TENSION' INSIDE THE DEMOCRATIC PARTY\n\nIn response, campaign advisers labeled accusations of the 76-year-old Biden being out of step with the party “complete nonsense.”\n\nOn \"America's Newsroom,\" Baier commented: “In performing and when he talks about stories where he forgets the states, where he forgets whether he was vice president or senator at the time of some trip overseas, or talking to kids -- a school shooting…those are big things. Those are not small ‘remembrances.’”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“There’s angst. There’s anxiousness in the Democratic circles about Joe Biden and his frontrunner status. It is a weak frontrunner status,” he noted.\n\n“And, if you’re going to make your campaign…going against President Trump for his lack of truth-telling as Democrats do pretty much every day, you’re going to be in a weaker position with someone who has his own problems telling stories,” Baier concluded.", "description": "Democratic circles are anxious about former Vice President Joe Biden’s status as the 2020 frontrunner, “Special Report” host Bret Baier said Wednesday.", "authors": ["Julia Musto", "Julia Musto Works With Fox News Channel'S", "America'S Newsroom."], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/04/694940094001_6083422901001_6083424173001-vs.jpg"}