{"pub": "afr", "url": "https://afr.com/world/south-america/chile-s-protests-aren-t-like-other-latin-american-protests-20191024-p533pw", "downloaded_at": "2019-10-23 23:20:35.812208+00:00", "title": "Chile's protests aren't like other Latin American protests", "language": "en", "text": "Nor are deepening misfortunes the likely culprit, as some hot takes suggested. Chilean income inequality, while still stubbornly high by the standards of the rich nations comprising the Organisation for Economic Cooperation and Development, has been easing for many years. Poverty, too, continues to fall, even as it worsens across the region.\n\nWhat about corruption? While hardly exempt from graft and fraud, Chile's headline scandals seem modest compared with those sparking the backlash against the ruling establishment in Argentina, Brazil, Ecuador and Peru. Chile is the one big South American economy to mostly escape the curse of Odebrecht, the giant Brazilian contractor that raised pay-to-play to a Latin American art form.\n\nA demonstrator holds a Chilean flag toward an armoured police vehicle Chile's capital, Santiago, this week. AP\n\nFor sure, Chilean democracy is flawed, and some of its reforms have fallen short. Still, Chileans are the second most upbeat in Latin America about their social progress after Bolivians, and lead the region in perceptions of economic well-being. Only 16 per cent described themselves as badly off economically.\n\nMajority support democracy\n\nChileans also do not share their crankier neighbours' gloom over representative democracy. Nearly six in ten Chileans (58 per cent) say they support democracy, compared with the Latin American average of less than half (48 per cent). Only 15 per cent say they are indifferent to democracy versus any other form of government. For all the funk in the public square, the country ranked 26th most contented of 156 nations listed on Gallup's latest World Happiness Report.\n\nSo if not graft, a bum economy and a widening gap between poverty and plenty, what went wrong enough to send tens of thousands amok, prompt President Sebastian Pinera to declare a state of emergency and order tanks to the streets for the first time since generalissimo Augusto Pinochet?\n\nHere's where Chile's troubles loop back into those of the region. From Quito to Santiago, and La Paz to Buenos Aires, leaders appear to have fallen behind society, which wants timely relief from everyday indignities and more expedient gains than well-intentioned reforms can offer.\n\nAdvertisement\n\nChile scores well by many official metrics, but the numbers tell just so much. \"Chile has improved overall living conditions and reduced poverty, but averages also hide things,\" University of the Andes economist Juan Nagel told me. \"There's still a sense of two Chiles which coexist in sharp contrast.\"\n\nChileans may be tired of hearing they are the best among the least. Chile's educational system is a Latin American beauty, but the dog of the OECD, whose achievements Chile has yet to emulate. Innovation and productivity also have underwhelmed.\n\nLikewise, Santiago's metro is a gem and justifiably the pride of Latin American public transport. Yet by telling Chileans, as Pinera did about the protests, that \"we are at war\", or that commuters vexed over higher peak metro fares could get up earlier, as the economy minister suggested, the governing class has proven itself tone deaf.\n\nPinera also did himself no favours by boasting earlier that Chile was \"an oasis\" of balanced economics and democratic stability in a continent roiled by recession, populism and political upheaval.\n\nPinera fights for political survival\n\nPinera didn't order Chileans to pay more to ride the metro on a neoliberal whim. An independent board of bureaucrats did, based on dispassionate accounting. But if Latin American leaders have learnt anything lately, it's the distance between being right and being politic.\n\nThe same sort of willful technocracy led Argentina's Mauricio Macri to bet that incremental fiscal containment was reform enough, and Lenin Moreno of Ecuador to suddenly ditch fuel subsidies on the faith that eventual compensation to the poor for spiking fuel prices would buy him support. Both well-meaning leaders misread the financial markets and the zeitgeist, managing mostly to discredit reformism. Like them, Pinera has had to walk back policy - he has since apologised, scrapped the fare hike and appealed to \"dialogue\" - and fight instead for political survival.\n\nHe might reflect on the pains of a neighbour. In 2013, Brazilians rose in rage against an equally modest rise in bus fares. There, too, the experts were flummoxed: Living standards had surged while poverty and inequality had plunged in previous years. Recent research shows that those who took part in those protests were far better off than those who disapproved.\n\nAdvertisement\n\nPerhaps it was the glimpse of possibility and progress that set up Brazil for a fall when expectations soured and political leaders underperformed. \"The evidence tells us that falling inequality can be problematic, especially when politicians lose favour,\" said Brazilian economist Marcelo Neri of the Getulio Vargas Foundation.\n\nChile has been there. Student rebels besieged Pinera's first government (2010-2014) with their mass protests for free universal higher education. They won that battle, pressuring congress to reinstate tuition-free university for low-income earners in 2016. They also won the right to discounted public transport and so were exempted from the recent metro fare hike. Now Chile's youth is back at the barricades. Their latest outburst suggests that they want a lot more than a cheap metro seat.\n\nMac Margolis is a Bloomberg Opinion columnist covering Latin and South America. He was a reporter for Newsweek and is the author of The Last New World: The Conquest of the Amazon Frontier.\n\nBloomberg", "description": "Chile's youth is back at the barricades. Their latest outburst suggests that they want a lot more than a cheap metro seat.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.6252%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_713%2C$y_314/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/773b980b4b4f754f48fe269fe7c2ef7f8f4355c4", "published_at": "2019-10-23"}