{"pub": "nymag", "title": "Martha Stewart’s Feud With Gwyneth Paltrow Is Still Going Strong", "url": "https://vulture.com/2019/08/martha-stewart-and-gwyneth-paltrow-feud-still-going-on.html", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:26:55.372918+00:00", "text": "Photo: Kevin Mazur/WireImage\n\nThere’s nothing more delicious than a long-standing feud (aside from a long con), especially when it’s between two extremely famous, extremely rich people. Since at least 2013, Martha Stewart has been dissing Gwyneth Paltrow, with low-key shade and petty barbs, mostly due to Paltrow cementing her role as a leader in the lifestyle industry, which, as we all know, has always been Stewart’s realm.\n\nAs E! reports, Stewart appeared on a recent episode of Alex Rodriguez’s podcast, The Corp. Interestingly, after talking about “haters,” Stewart was asked what she thought about Goop. “How would you describe what Gwyneth Paltrow is doing today versus what Martha Stewart created years ago?” she was asked. “I don’t follow Goop,” she replied. “Sometimes I look at products that she’s selling … I wish every young entrepreneur well and I hope that there are many, many, many different kinds of entrepreneurs … if they’re movie stars or hardworking women like I am, who are not movie stars. If they have a good idea, I want them to be able to succeed. So, good luck, Gwyneth.” So, good luck, Gwyneth. We can taste the salt from here.\n\nWe imagine Stewart at home, scrolling through the Goop website, tightly gripping a tissue until her fingers bleed, like Goldie Hawn in Death Becomes Her. The thing is, Stewart may have more in common with Paltrow than she thinks. At least when it comes to them both not knowing or remembering anyone. The Goop lifestyle empire may be worth over $250 million, but Martha Stewart isn’t buying any of those damn jade eggs.", "description": "During an episode of Alex Rodriguez’s The Corp podcast, Martha Stewart appeared to still have distaste for Gwyneth Paltrow’s Goop brand. The lifestyle business mogul has been throwing shade at Paltrow for years.", "authors": ["Marie Lodi"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/08/27/27-paltrowstewart.w1200.h630.jpg"}