{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/09/17/not-pimp-american-soldiers-arent-prostitutes-saudi-arabia-says-tulsi-gabbard-trump", "downloaded_at": "2019-09-17 23:23:29.387252+00:00", "title": "“You are not our pimp”: American soldiers aren’t your prostitutes for Saudi Arabia, says Tulsi Gabbard to Trump", "language": "en", "text": "I thought Sunday’s admonition to Trump to stop being Saudi Arabia’s “bitch” was as harsh as she would get with him. But she was just warming up.\n\nWe can’t be more than a day away from her calling Trump the Kingdom’s cuck.\n\nYou can see from this, though, why Gabbard is unusually popular on the right for a left-wing Democrat. It’s not just that she’s a veteran or a nationalist who’s largely in sync with Tucker Carlson’s sensibilities. It’s not just that she’s a little better than most lefties about abortion or border enforcement either. This sort of hard rhetorical shot is distinctly populist precisely because it’s so hard. Grassroots activists pride themselves on not pulling their punches. Gabbard doesn’t pull them either, even when she’s swinging at the alpha-male-in-chief.\n\nHere’s the presidential tweet that has her exercised. It really is terrible.\n\nSaudi Arabia oil supply was attacked. There is reason to believe that we know the culprit, are locked and loaded depending on verification, but are waiting to hear from the Kingdom as to who they believe was the cause of this attack, and under what terms we would proceed! — Donald J. Trump (@realDonaldTrump) September 15, 2019\n\nThe last phrase, “under what terms we would proceed,” particularly reeks of subservience. Trump would doubtless say that he simply meant he’d coordinate with the Saudis on any reprisal against Iran, but he held a less nuanced view of U.S./Saudi cooperation back in 2014:\n\nSaudi Arabia should fight their own wars, which they won't, or pay us an absolute fortune to protect them and their great wealth-$ trillion! — Donald J. Trump (@realDonaldTrump) August 31, 2014\n\nI think the Times is right about his evolution: The difference between the Saudis and other U.S. allies is that Trump understands keenly how a rift between our country and theirs might affect oil prices. And spiraling oil prices are a dangerous thing for a president who’s laser-focused on an economic pitch for his reelection.\n\nIt was hard to imagine him allowing NATO, or a European ally, such latitude to determine how the United States should respond. But for Mr. Trump, the Saudis have always been a special case, their economic import having often overwhelmed other considerations in his mind… [His tweet] was strange for many reasons. Mr. Pompeo had already named the Iranians as the culprits; Mr. Trump did not. But the seeming abdication of fact-finding and decision-making to the Saudis gave Democrats a moment to argue that the president was willing to let the Saudi monarchy make decisions for the United States… “It’s not remotely normal for a president to talk publicly about that, to use language that sounds as if we aren’t making our own decisions about whether to use force — or trusting our own intelligence,” [natsec analyst Heather Hurlburt] said. “And it’s completely unprecedented with a country that is not a treaty ally.”\n\nRemember what his answer was last year to complaints that he was letting the Saudis off scot-free for murdering an American resident, Jamal Khashoggi, who’d criticized the regime? “They buy a lot of weapons from us.”\n\nSo long as they keep the money and oil flowing, sure, we’ll act as their mercenary army in the Middle East. News is breaking just this afternoon, in fact, that American and Saudi investigators have jointly concluded that the attack on the Kingdom’s oil facilities last week was launched from an Iranian base near the border with Iraq, not by the Iranian-backed Houthi rebels fighting the Saudis in Yemen. A reprisal will be required. I doubt Tulsi and Tucker will like how it plays out.\n\nHere’s Gabbard laying into Trump for his deference towards MBS. It should go without saying at this point that she’s in no position to criticize others for being stooges of foreign powers.", "description": "\"You are unfit to serve as our commander-in-chief.\"", "authors": ["John Sexton", "Jazz Shaw", "Ed Morrissey"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/tg-2.jpg", "published_at": "2019-09-17"}