{"pub": "reuters", "url": "https://in.reuters.com/article/us-storm-dorian/search-for-bodies-continues-in-hurricane-ravaged-bahamas-idINKCN1VU1AV", "downloaded_at": "2019-09-09 23:30:21.532828+00:00", "title": "'You can't break down': Bahamas keeps up search of Dorian-devastated island", "language": "en", "text": "MARSH HARBOUR, Bahamas (Reuters) - Rescue workers wearing white hazard suits carried out a grim search for bodies and survivors in the hurricane-ravaged Bahamas on Monday, as relief agencies worked to deliver food and supplies over flooded roads and piles of debris.\n\nPersonnel from the Royal Bahamas Police Force remove a body recovered in a destroyed neighbourhood in the wake of Hurricane Dorian in Marsh Harbour, Great Abaco, Bahamas, September 9, 2019. REUTERS/Loren Elliott\n\nThe Royal Bahamas Police Force said at least 45 people died after Hurricane Dorian hit the Bahamas on Sept. 1, tossing cars and planes around like toys. The death toll is likely climb.\n\nDorian was one of the most powerful Caribbean storms on record, a Category 5 hurricane with winds of 200 miles per hour (320 kph). It rampaged over the Bahamas for nearly two days, becoming the worst disaster in the nation’s history.\n\nLarge swaths of Greater Abaco Island were destroyed. Reuters journalists saw search crews using geotagging technology to mark the locations of bodies in the hard-hit Mudd section of Marsh Harbour on that island.\n\nOne Bahamian rescue worker said it is becoming hard to keep composed when surrounded by death.\n\n“If you’re not in touch with yourself then you lose it. You have to be mentally stable because when you’re seeing these things, and when people who lost loves ones are crying on your shoulder you can’t break down on them,” said one hazmat-suited Bahamian police office who could not give his name. “These families need this, they need someone to talk to.”\n\nBahamian officials said 4,800 people had been evacuated from the archipelago’s several islands, most from Abaco. Free flights will continue to evacuate people who choose to leave the Bahamas, but there are no mandatory evacuations, officials said.\n\n“The plan is not to move everyone out,” said Carl Smith, a spokesman National Emergency Management Agency, during a news conference on Monday.\n\nThousands of people poured into the capital, Nassau, where a week after the storm shelters were straining to house evacuees from worse-hit areas. Hundreds more have fled to the United States in search of safety and resources.\n\nShelters are housing about 1,100 people, the agency said; more are staying with friends and relatives. The agency was asking residents whose homes were intact to open them up to people displaced by the storm.\n\nSome 90% of the homes, buildings and infrastructure in Marsh Harbour were damaged, the World Food Programme said. Thousands of people were living in a government building, a medical center and an Anglican church that survived the storms, it said, but had little or no access to water, power and sanitary facilities.\n\nSome 70,000 people were in need of food and shelter, the WFP estimated. Private forecasters estimated that some $3 billion in insured property was destroyed or damaged in the Caribbean.\n\nU.N. High Commissioner for Human Rights Michelle Bachelet opened a Human Rights Council session in Geneva on Monday with a minute of silence for hurricane victims.\n\n“Small island nations are among those suffering the most catastrophic effects of climate change, although they contribute very little to fuelling the problem,” Bachelet said. “Just this past week, yet another devastating hurricane hit the Bahamas, taking a terrible toll in human life and destroying precious development gains.”", "description": "Rescue workers wearing white hazard suits carried out a grim search for bodies and survivors in the hurricane-ravaged Bahamas on Monday, as relief agencies worked to deliver food and supplies over flooded roads and piles of debris.", "authors": ["Zachary Fagenson", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190909&t=2&i=1428077500&w=1200&r=LYNXNPEF881R7", "published_at": "2019-09-09"}