{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/18/ex-catalan-leader-carles-puigdemont-belgian-authorities-arrest-warrant", "downloaded_at": "2019-10-18 08:59:15.565804+00:00", "title": "Ex-Catalan leader appears before Belgian authorities over arrest warrant", "language": "en", "text": "Carles Puigdemont, the former Catalan president who led the region’s failed bid for independence two years ago, has appeared before judicial authorities in Belgium in response to the reactivation of an international arrest warrant against him earlier this week.\n\nHis appearance came as Catalonia braced for a general strike and a huge demonstration in Barcelona following a fourth night of violent protests triggered by the jailing of nine pro-independence leaders by the Spanish supreme court on Monday.\n\nNew generation, new tactics: the changing face of Catalan protests Read more\n\nPuigdemont, who led the region between January 2016 and October 2017, fled to Belgium to avoid arrest after being sacked by the Spanish government for staging a unilateral referendum and making a unilateral declaration of independence.\n\nIn a statement, Puigdemont’s office said: “[Carles] Puigdemont, accompanied by his lawyers, has appeared, voluntarily, before the Belgian authorities in response to the European arrest warrant issued by the Spanish supreme court.”\n\nIt added that he was complying with the warrant but remained opposed to being extradited.\n\nSpain’s supreme court reissued the warrant – for the alleged offences of sedition and misuse of public funds – on Monday after Puigdemont’s former vice-president and eight other independence leaders were jailed for the same offences.\n\nThousands of people who have marched from across Catalonia are due to converge in Barcelona on Friday afternoon to to protest against the verdict and call for the leaders to be freed.\n\nPeaceful protests, which have long been the hallmark of the pro-independence movement, have been eclipsed this week by violent unrest and running battles between protesters and police.\n\nBarcelona had its worst night of violence on Thursday as pro-independence supporters clashed with police and rightwing groups in skirmishes that lasted into Friday morning.\n\nAfter another large demonstration broke up, groups of protesters fought police, throwing stones and at least one petrol bomb in an apparent attempt to reach the seat of the Spanish government in the city. A clothing shop was set on fire and a bank vandalised.\n\nOne pro-independence protester was badly beaten by a group of rightwing supporters while once again the streets were acrid with the smell of bonfires of burning rubbish. Numerous injuries were reported.\n\nAs the unrest continued, Catalan TV and the main Barcelona TV channel ceased broadcasting news, as did at least one of the online dailies, in support of Friday’s general strike.\n\nNinety-seven people have been arrested across Catalonia since the protests began, and dozens injured.\n\nThe supreme court’s decision to jail the nine leaders for secession and misuse of public funds over their roles in the failed push for independence has provoked uproar among many Catalans.\n\nSpain’s interior minister, Fernando Grande-Marlaska, has said no criminal activity would go unpunished, adding that Catalonia had experienced widespread “material and reputational damage” caused by “minority groups who are perfectly organised”.\n\nCatalonia’s pro-independence regional president, Quim Torra, has been criticised for being slow to condemn the violence – and for calling for civil disobedience while sending in Catalan riot police to restore order.\n\nOn Wednesday night, Torra said the violence had to stop, but blamed it on “infiltrators” who wanted to sully the good name of the pro-independence movement.\n\n“We cannot allow such groups who infiltrate and provoke to harm the image of a movement which counts millions of Catalans,” he said.\n\nTorra has described the supreme court’s decision to jail the nine leaders as “ignominious” and suggested that another unilateral referendum on Catalan independence should be held.\n\n“If we have been sentenced to 100 years in prison for putting out the ballot boxes, the response is clear: we’ll have to put them out again for self-determination,” he told the regional parliament on Thursday.\n\n\n\n", "description": "Spain seeks to extradite Carles Puigdemont as Catalonia braces for general strike", "authors": ["Sam Jones", "Carles Puigdemont"], "top_image": "https://i.guim.co.uk/img/media/f67e40702de30b955f45312b2b3b142a8f0ea908/0_52_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=08b5d24fedd299915753fea89aecc7bc", "published_at": "2019-10-18"}