{"pub": "afr", "url": "https://afr.com/life-and-luxury/travel/spicers-retreats-homing-in-on-zero-waste-20190923-p52u0v", "downloaded_at": "2019-10-05 05:47:12.077998+00:00", "title": "Spicers Retreats homing in on zero waste", "language": "en", "text": "When your job gives you access to citizens of the world, naturally you’re going to press them for those all-important tips. Yet, I’d never thought to drill down into how your average eco-minded Rich Lister approaches recycling.\n\nThe September 21 climate strike coincided with a (carbon offset) trip from Sydney to rural southern Queensland to chat to Jude Turner about her 13 Spicers hotels and retreats across Queensland and NSW. We started with a one-hour tour of the Spicers Hidden Vale Wildlife Centre, a joint venture with the University of Queensland to breed and study threatened native species.\n\nJude and Graham Turner want to make tourism more environmentally friendly. James Brickwood\n\nOver lunch, we got chatting about all things eco, not least how the travel industry is in the firing line. It’s to be expected, although many don’t realise aviation accounts for only 2 per cent of all carbon emissions, according to the International Air Transport Association.\n\nTurner talks openly about how to make tourism more environmentally friendly. The Hidden Vale resort has significantly reduced its waste, and the wildlife centre has dropped its weekly disposal from a skip to just one bin. Her Brisbane boutique hotel, Spicers Balfour in New Farm (pictured above), is on track to become the nation’s first zero-waste hotel.\n\nTurner has committed the Spicers portfolio to zero net emissions and zero waste by 2030. Like many hotels today, Spicers properties have in-room recycling options, and there is an “end-of-life” plan for almost every object.\n\nShe has even roped in husband “Skroo”, co-founder of Flight Centre, who now jogs to business meetings around Brisbane rather than driving. “We had to sign some documents the other day and he turned up at the lawyers’ offices in his running gear,” Turner says. “He was a bit sweaty, but I thought good on him.”\n\n“Jog to meetings” now tops my life-tips list.\n\nAdvertisement\n\nJude Turner's eco tips\n\nSpicers Balfour in Brisbane is on track to become the nation's first zero-waste hotel. Supplied\n\nHave an organic compost bin at home. Soft plastics can be cleaned and taken to Coles or Woolworths, which both subscribe to the RedCycle program. (You can deposit anything that can be scrunched up, such as chip packets and cling wrap.) Co-mingled recycling bins are a time-effective, easy option. Items such as empty cosmetic containers and toothpaste tubes can be disposed of for recycling using a communal Terracycle collection bin. Get a green waste bin through your local council.\n\nTravel briefs\n\nFly gently\n\nWith many airlines scrambling to showcase their environmental credentials, the first step for passengers is to read up on the best ways to get eco friendly in the air.\n\nA bamboo toothbrush is a more eco-friendly option than plastic. iStock\n\nWebsite alternativeairlines.com has a section on how to be a more environmentally conscious passenger. Tips include packing light, taking non-plastic items such as bamboo toothbrushes, and buying carbon offset credits. Once on the plane, lower the shade and order a vegan or vegetarian meal.\n\nAdvertisement\n\nThe site points out that in the scheme of things, air travel is not so bad. The average fuel consumption per passenger is below four litres per 100 kilometres, and this figure is being improved on every year.\n\nSweet Dreamliners\n\nWe are seeing an increasing number of eco ratings for airlines. Winners are usually low-cost carriers with the newest fleets, given these tend to be more fuel-efficient models such as Dreamliners.\n\nNot-for-profit German organisation atmosfair produces an annual airline eco index, which British low-cost carrier TUI has won two years in a row. (The bad news is its Premium Club seats aren't on par with standard business class.)\n\nQantas, which operates a number of Dreamliners and has more on order, ranks in the top 50. Its website provides detailed information for passengers looking to make informed choices.", "description": "Jude and Graham Turner are an example of how your average eco-minded Rich Listers approach recycling.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1906%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_16/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/0af506adeab975a5b36db92c80df70f10f060463", "published_at": "2019-09-23"}