{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/homeless-man-goes-being-invisible-20465442", "downloaded_at": "2019-10-05 12:24:48.525849+00:00", "title": "Homeless man goes from being 'invisible' to overnight sensation thanks to designer bags", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA homeless man has gone from being \"invisible\" to an overnight sensation after he began designing and selling cotton bags in Birmingham.\n\nKevin World has managed to sell more than 200 of his hand-drawn bags in the city, with his sudden success taking him somewhat by surprise.\n\nMr World said his life is transformed after his bags - for which he only asks a \"donation from the heart\" - became an unexpected hit.\n\nEach bag is uniquely designed, featuring puns. There is no fixed fee charged for the artwork but Kevin says on average people pay about £3 for a bag.\n\nKevin became homeless five years ago due to a family tragedy, reports Birmingham Live .\n\nLife on the streets has not been easy for him, as he suffers from depression and anxiety.\n\nBut since starting to draw less than a year ago, it has helped him cope.\n\nHe decided to combine the need to save on plastic bags and help the environment with his artistic skills.\n\nKevin said: “For years I've been putting on a mask and smiling but there's been a lot of tears behind that mask, now drawing is helping me interact with people.\n\n“It passes the time away because a lot of people walk past and you do feel pretty invisible.”\n\nHis bag selling business is called The Bag Issue, a pun on The Big Issue magazine which is also sold by street vendors.\n\nHe said: “Instead of giving handouts to homeless people you get something back in return, one of these bags.\n\n“You wouldn't believe how crazy it's gotten over the last two to three weeks, it's just exploded.”\n\nThe designs on the bags are based on his ‘wacky’ sense of humour and include gags like 'give peas a chance' with a design of them picketing.\n\nArt students constantly complimented his work at the start of his short sketching career and that is when he noticed he had real talent.\n\nHe has become a successful and popular figure around Birmingham's Navigation Street.\n\nKevin even advertises The Bag Issue.\n\nHe pays £5 for someone with a bag plastered in his logos to walk around the area and drum up interest.\n\nThe bags have done so well that people have told Kevin they are already being resold on the internet for between £60-£80 which he says makes him feel proud but a little cheated.\n\nHomeless charity The Red Bag Co is trying to get Kevin his own stall to sell his work at the German Market which starts on November 7.\n\nKevin said: \"It would be brilliant to get a stall on German Market.\n\n“We want people to be proud that it started in Birmingham, that it was born in Birmingham and take it to other cities.”\n\nBefore this latest venture, he sold more than 100 sketches made on paper.\n\nKevin said he was accepted on to the Housing First list in February but is still waiting to see a property\n\n“I shouldn't be sitting out there on the street I should have been in my own place months ago. People that I've gotten to know on the street don't talk to me now because they think that I've been telling a pack of lies.”\n\nIT consultant Greg Wright, 57, supplies Kevin with the cotton bags and had the idea of using his artistic ability to make a difference a month ago.\n\nHe said: “Kev's always had this entrepreneurial spirit, he is unique.\n\n“He was the first homeless person I met who gave me something before I gave him something and that really stuck in my mind.\n\n\"You can see the spirit of the guy, he's a go-to person around here for people living on the streets, he cares about people.”\n\nHe met Kevin six months ago and bought a sketch from him on industrial Birmingham.\n\nGreg framed it in his office as one of his prized possessions.\n\nHe reckons his artistic buddy has a big future in store.\n\n“One day a film is going to be made about us and I'm going to be played by George Clooney and I think he may get Richard Gere.\"\n\nKevin's bags are available for home delivery on Bagissue.org .", "description": "Birmingham homeless man Kevin World has set up a business and sold more than 200 cotton bags", "authors": ["Kamal Sultan"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20465476.ece/ALTERNATES/s1200/0_Homeless-Kev-World.jpg", "published_at": "2019-10-05"}