{"pub": "indiatimes", "url": "https://indiatimes.com/entertainment/kajol-recreates-her-iconic-ddlj-train-pose-as-ddlj-completes-24-years-of-release-378166.html", "downloaded_at": "2019-10-19 13:33:22.429470+00:00", "title": "DDLJ:Kajol Recreates Her Iconic DDLJ Train Pose As DDLJ Completes 24 Years Of Release!", "language": "en", "text": "Kajol Recreates Her Iconic DDLJ Train Pose As DDLJ Completes 24 Years Of Release!\n\nKajol Recreates Her Iconic DDLJ Train Pose As DDLJ Completes 24 Years Of Release!\n\n\"Agar woh tumse pyaar karti hai toh woh pakka mudegi..\" Well, these iconic lines by SRK are etched in everyone's memories. As 1995 blockbuster 'Dilwale Dulhania Le Jayenge' completed 24 years on Saturday, Kajol evoked the past sweet memories of essaying the role of Simran in the film.\n\nTo commemorate 24 years of 'Dil Wale Dulhania Le Jayenge' (DDLJ), the actor paid a special tribute to the film with megastar Shah Rukh Khan.\n\nShe recreated her pose from the flick's famous poster in which she can be seen reading a book wearing round frame spectacles donning a yellow dress.\n\nKajol posted a clip taking to Instagram, in which she can be seen reading a book wearing almost similar glasses and a yellow sweatshirt.\n\nSharing the clip, the actor wrote, \"Still got the specs & still reading in weird places even after 24 years. #24YearsOfDDLJ.\"\n\nAditya Chopra's maiden film as director, DDLJ released on October 19, 1995. It won 10 Filmfare Awards, including Best Film, Best Actor, Best Actress and Best Director at the 1996 edition of the ceremony.\n\nDon't Miss 27.3 K SHARES 3.9 K SHARES 2.1 K SHARES 1.9 K SHARES 2.2 K SHARES\n\n'Dilwale Dulhania Le Jayenge' narrates the moving love story of Raj, played by Shah Rukh and Simran. While the young hearts fall in love at a vacation in Europe Simran's father thereafter takes her to India to marry her to another boy as promised.\n\nAs DDLJ ended with Raj and Simran's union despite many hurdles, the film redefined romance for every 90s kid.\n\nInputs From ANI", "description": "As 1995 blockbuster 'Dilwale Dulhania Le Jayenge' completed 24 years on Saturday, Kajol evoked the past sweet memories of essaying the role of Simran in the film. To commemorate 24 years of 'Dil Wale Dulhania Le Jayenge' (DDLJ), the actor paid a special tribute to the film with megastar Shah Rukh Khan. She recreated her pose from the flick's famous poster in which she can be seen reading a book we", "authors": [], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/24_years_of_ddlj_1571483554_800x420.jpg", "published_at": "2019-10-19"}