{"pub": "dailymail", "url": "https://dailymail.co.uk/money/investing/article-7541447/Can-REALLY-rich-going-green-make-money-stick-principles.html", "downloaded_at": "2019-10-05 23:18:37.568696+00:00", "title": "Can you REALLY get rich by going green? How to make money and stick by your principles", "language": "en", "text": "If you've wondered whether you can profit from your principles, then this could be the week to act. This weekend marks the beginning of Good Money Week, when consumers are encouraged to save, spend and invest with sustainability in mind.\n\nWe may be happy switching to bamboo toothbrushes, marching with Greta Thunberg and packing reusable shopping bags, but the ethical investment revolution has been slower to start, with the Investment Association putting the sector at less than 2 per cent of total funds in the UK.\n\nJohn Ditchfield, head of the Ethical Investment Association, blames the financial services industry for the apparent lethargy towards the sector. Just 80 of the 26,000 financial advisers operating in the UK are part of the Ethical Investment Association.\n\nResearch suggests that 11 out of 16 UK-focused ethical funds outperformed the average return delivered by funds investing in the UK stock market\n\nHe says: 'It feels like people who are in the financial services industry aren't terribly interested in the environment.'\n\nFor investors who do want to embrace a greener future, though, ethical investment can be profitable. Ditchfield, now head of responsible investment at wealth manager Helm Godfrey, cites the example of the workplace pension scheme he set up for Vivienne Westwood's employees in 2014.\n\nHe says: 'She was passionate about avoiding fossil fuels,' he explains. Over a five-year period, the pension, invested in the fund LionTrust Sustainable Future, delivered returns of almost 80 per cent, against a conventional fund Aviva Diversified Assets that would have delivered 67 per cent.\n\nMarket analysts Good With Money produced a recent study showing that sustainable investing pays. The study, based on data to August this year, monitored ethical investment funds against those without a sustainable strategy.\n\nIt found that 11 out of 16 UK-focused ethical funds outperformed the average return delivered by funds investing in the UK stock market. Over five years, the average UK fund rose 37 per cent but the ethical UK funds went up by 47 per cent. During the same period, the FTSE All-Share Index rose 18 per cent.\n\nOver one year, the average UK fund fell 1 per cent while ethical funds were up nearly 3 per cent.\n\n'Investing for positive impact can improve returns,' says Lisa Stanley, Good With Money founder.\n\nWHAT IT REALLY MEANS TO BE GREEN\n\nBecoming an 'ethical' or 'sustainable' investor is more complicated than buying a reusable metal straw or switching to renewable energy. Many investment funds claim to be 'sustainable' or 'ethical', but there is no official definition of what that actually means.\n\nTriodos' Pioneer Impact Fund has large holdings in solar and wind energy projects\n\nWhitni Thomas, head of investor relations at ethical bank Triodos, says there is a problem with 'greenwashing' – where some funds simply pay lip service to environmental and ethical criteria. She says: 'There are a number of funds being badged as 'green', 'sustainable' or 'environmental', but when you look closer you might think, 'That isn't at all what I thought I was getting'. '\n\nDitchfield highlights the fact that many of the leading ethically badged funds simply invest in large companies with what they deem the worst filtered out.\n\n'So they will screen out fossil fuel companies but replace them with US tech giants like Amazon even though it isn't exactly an environmental company with all that packaging and driving around.'\n\nHe says: 'That's not what most people think of when they consider sustainable investing.'\n\nInteractive Investor, the investment platform, has decided to act to improve information for investors in this area by applying its own classifications to the funds that claim green credentials. Interactive Investor's Moira O'Neill says: 'Our objective is to cater to a growing number of investors seeking to invest for good by providing a menu of high-quality ethical choices.'\n\nThe three categories are badged as 'exclude' – those funds that simply exclude specific types of company when making up a portfolio such as tobacco or oil; 'consider' – those that take in to consideration the ethical practice of companies when selecting them; and 'embrace' – those that actively invest in companies that are delivering positive environmental and social results.\n\nThere is some Europe-wide work underway looking at enforcing the use of categories for sustainable funds, but until this has developed further the onus is really on investors to do their own homework in the hunt for investments that meet their sustainability aims.\n\nHOW TO TURN YOUR PORTFOLIO GREEN\n\nGood With Money's Stanley suggests aiming for a portfolio that makes a positive contribution to the planet, rather than just picking one that essentially tries to 'do no harm'.\n\nShe says: 'The options for the investor wanting to use their money to make a positive impact on climate change are far more varied than simply avoiding fossil fuels or investing in clean energy and is a practical proposition if you know where to look.'\n\nStocks and shares\n\nInvesting in individual stocks and shares that set out to help the planet can be tricky as one person's ethical is another investor's no-no. There is a specific stock market index – FTSE4Good – which claims to only track the performance of ethical companies.\n\nThere is a specific stock market index – FTSE4Good – which claims to only track the performance of ethical companies. However its main constituents in the UK are HSBC, Shell, GlaxoSmithKline and AstraZeneca\n\nHowever, its main constituents in the UK are HSBC, Royal Dutch Shell, and pharmaceutical companies GlaxoSmithKline and AstraZeneca – not everyone's obvious idea of green investing. But there are some individual companies that are listed on the stock market that are benefiting from the groundswell towards a more sustainable future.\n\nThese include Smurfit Kappa, a big player in the paper packaging industry that is creating sustainable solutions to replace plastic trays and films. Others include Macquarie AB Dynamics, an engineering firm pioneering technology for use in battery-operated electric vehicles and Greencoat UK Wind, a listed renewable infrastructure fund.\n\nFunds that are more than 'greenwash'\n\nAs the variety of individual shares shows, it can be hard to devise a portfolio on your own. An easier way to get a broad exposure to companies with sustainable characteristics is via a fund that will diversify your money for you across many different stocks and shares.\n\nAmong those featuring on the broker Interactive Investor's 'embrace' list is the Impax Asian Environmental Markets fund, which it classes as a fund for adventurous investors. If you invested £1,000 in the fund five years ago, it would be worth £1,560 today.\n\nJohn Ditchfield recommends the Montenaro Better World Fund, launched in 2018. The fund has a positive impact calculator, showing how much good its investments are doing in the world, and a number of external environmental awards. Had you invested £1,000 a year ago, it would now be worth £1,015.\n\nM&G's Positive Impact fund has been awarded a five-star rating by Good With Money. It likes the fact it has a bespoke impact reporting app – keeping you informed of the efforts being made by the underlying companies. A £,1000 investment made six months ago at launch would be worth £1,078 now.\n\nSustainable banking group Triodos opens up the opportunity of investing in smaller sustainable companies via its Pioneer Impact Fund. This has large holdings in solar and wind energy projects.\n\nHad you invested £1,000 five years ago, it would now be worth £1,620. It also has a larger companies option – the Global Equities Impact fund – which has turned £1,000 into £1,780 over five years.", "description": "For investors who do want to embrace a greener future, ethical investment can be profitable. Market analysts Good With Money produced a recent study showing that sustainable investing pays.", "authors": ["Rosie Murray-West For The Mail On Sunday", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/18/19338612-0-image-a-136_1570297131426.jpg", "published_at": "2019-10-05"}