{"pub": "yahoo", "url": "https://finance.yahoo.com/news/edwards-lifesciences-heart-felt-breakout-100000710.html", "downloaded_at": "2019-10-16 23:46:04.164069+00:00", "title": "Edwards Lifesciences- A Heart-Felt Breakout", "language": "en", "text": "Edwards Lifesciences (EW), based in Irvine, Ca., makes heart valve systems and repair products for a patient's diseased or defective heart valve, notes breakout stock specialist Leo Fasciocco, editor of Ticker Tape Digest.\n\nEW provides medical instruments for patient with heart disease and in need of critical care monitoring. Annual revenues are $3.7 billion.\n\nMore from Leo Fasciocco: FTI Consulting: A Breakout in Corporate Finance\n\nIts products are categorized into three areas: Transcatheter Heart Valve Therapy, Surgical Heart Valve Therapy and Critical Care. The company also develops hemodynamic monitoring systems used to measure a patient's cardiovascular function in a hospital.\n\nThe stocks 12-month performance chart shows the stock up 50% versus a 1% gain for the stock market. The long-term chart shows the stock climbing from $31 in 2013 to a peak near $121 by late 2016.\n\nThe stock went into a basing pattern and then emerged in late 2017. It has since surged higher and recently made a new high. The shares have since put down a tight flat base. The technical setup is ideal and the stock's momentum indicator is strongly bullish.\n\nThis year, analysts are forecasting a 14% increase in net to $5.34 a share from the $4.70 the year before. The stock sells with a price-earnings ratio of 41. That is high for the growth rate.\n\nQuarterly earnings growth will show a modest acceleration. Currently, 12 analysts follow the stock. The highest estimate is at $1.26 a share.\n\nSee also: A Safe Haven in Swiss Stocks\n\nNet for the third quarter should be up 14% to $1.22 a share from the $1.07 the prior year. For the fourth quarter, the Street sees a 21% leap in net to $1.41 a share from the $1.17 the prior year. Looking out to 2020, the Street projects an 11% rise in net to $5.92 a share from the anticipated $5.34 this year.\n\nWe are targeting the stock for a move to $270 within the next few months, or sooner. A protective stop can be placed near $220. We consider the stock to be suitable for aggressive bulls.\n\nMore From MoneyShow.com:", "description": "Edwards Lifesciences (EW), based in Irvine, Ca., makes heart valve systems and repair products for a patient's diseased or defective heart valve, notes breakout stock specialist Leo Fasciocco, editor of Ticker Tape Digest.", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-15"}