{"pub": "fox", "url": "https://foxnews.com/media/trump-impeachment-democrats-history-ken-starr", "downloaded_at": "2019-10-28 23:32:39.642007+00:00", "title": "History will judge Democrats harshly for impeachment of Trump, Ken Starr says", "language": "en", "text": "History will judge congressional Democrats harshly for their handling of President Trump's impeachment inquiry due to their lack of public debate and failure to be transparent with the American people, former special prosecutor Ken Starr said on \"America's Newsroom\" Monday.\n\n\"The text of the Constitution just entrusts [impeachment] to the good judgment, whether it's being exercised or not, to the House of Representatives,\" Starr said.\n\n\"But history will, I think, judge this not well. It should judge it not well. [You] didn't have a full debate on the floor of the House -- and that just lends itself to, 'then to let's go to court and have this litigated.'\n\n\"And of course, the chairman then says, 'you go to court, you're in contempt.'\"\n\n'THIS IS JUST WRONG': STARR SAYS DEMS DOING DISSERVICE TO AMERICA BY SHROUDING INVESTIGATION IN SECRECY\n\nStarr urged House Intelligence Committee Chairman Rep. Adam Schiff, D-Calif., to strive for the appearance of fairness and chastised him for already declaring the president guilty, and attempting to sway public opinion.\n\n\"For [Schiff to] essentially declare guilt... is another procedural irregularity. He should try his best... to give the appearance of fairness and open-mindedness,\" he said.\n\n\"He's already declared the president substantively guilty, as well as procedurally guilty.\"\n\nStarr also commented on the investigation of the investigators, being led by U.S. Attorney John Durham, into corruption within the federal government and it's intelligence agencies, as well as any unauthorized leaks or political bias.\n\n\"During the [Richard] Nixon years, we had an attorney general go to jail. We've had FBI Directors who have been discredited. And that's our system,\" he said. \"We have checks and balances.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Let's not declare anyone guilty -- as Chairman Schiff just basically did,\" Starr added. \"That's incompatible with our system of fundamental fairness... but I believe there's a housecleaning underway... If criminal charges are brought, we'll be able to read the indictment, just as we did during the Mueller investigation.\n\n\"We can read those indictments, evaluate them and of course, see what happens.\"", "description": "History will judge congressional Democrats harshly for their handling of President Trump's impeachment inquiry due to their lack of public debate and failure to be transparent with the American people, former special prosecutor Ken Starr said on \"America's Newsroom\" Monday.", "authors": ["Nick Givas", "Nick Givas Is A Reporter With Fox News. You Can Find Him On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/PelosiSchiffAP100719.jpg", "published_at": "2019-10-28"}