{"pub": "mirror", "url": "https://mirror.co.uk/3am/style/3am-fashion-celebrity-beauty/how-rid-bags-dark-circles-10155759", "downloaded_at": "2019-10-28 23:36:42.894818+00:00", "title": "How to get rid of eye bags without the need for surgery", "language": "en", "text": "Get the biggest Weekly Fashion stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nWe all accumulate unwanted baggage on the journey through life, but the sort under the eyes is among the most unwelcome. So first things first: why do we get eye bags?\n\n\"They’re largely down to genetics,\" says cosmetic surgeon Alex Karidis . ‘Our eyes are cushioned by fat and in some people these fat pads naturally protrude more, even from a young age. In other cases, the fat pads become visible when collagen and elastin begin breaking down. There’s less to hold the fat in place so it starts to bulge and sag down.’\n\nAt the same time, the face is losing deeper volume, especially around the eyes and cheeks, which makes those small prominent surface pockets look even more obvious.\n\nBefore you get to the point where the skin is sagging, eye bags can seem to come and go thanks to fluid retention.\n\n\"It’s definitely something we see on shoots,\" says makeup artist Victoria Bond . \"If somebody is dehydrated, tired or has eaten too much salt their eyes can really puff up.\" (The solution to all of the above is pretty obvious.)\n\nBags can also be made worse by sinus problems, which affect lymphatic drainage. If you think this might be a contributory factor, it’s worth consulting your GP.\n\nBut whatever the cause of your eye bags, what you really want to know is how to fix them. We asked the experts for their advice.\n\nFast fix 1: Deflate eye bags with massage\n\nVictoria swears by massaging eye bags with a jade roller, starting from the inside corners and rolling outwards to stimulate lymphatic drainage.\n\n\"They cost less than a tenner on Amazon, and I see a real instant difference when I use them,\" she says.\n\nMakeup artist and Youtuber Lisa Eldrige advises making a strong cup of green tea, freezing it in an ice cube tray then wrapping the cubes in a fine cloth and gently smoothing them over bags.\n\nYoutube stars Sam and Nic Chapman swear by popping on cooling eye patches on puffy areas. Try Skyn Iceland Hydro Cool Firming Eye Pads , £30 for 8 pairs, or Masque Bar Eye Puffiness Minimising Patches , £10 for 5 treatments.\n\nFast fix 2: Disguise eye bags with clever makeup tricks\n\nA lot of women have dark circles and bags, says Victoria. \"If that’s you, cover the circles first. Don’t mistake an illuminating pen for concealer, you’ll just create the illusion of bulgier bags.\" We rate It Cosmetics Bye Bye Undereye, £21 , and Rimmel Wake Me Up Concealer, £5.49 .\n\nUse a concealer that’s an exact match for your skin tone, and if the dark circles are still showing, try a peachy or orange colour corrector first. \"The darker your skin, the darker the shade you need. You’ll know it’s the right shade if it seems vanishes into your skin,\" says Victoria. MUA Correct & Conceal, £6 , is a nice budget palette to play with.\n\nTo minimise the bags themselves, Victoria advises looking down into a mirror and using a superfine brush to paint a slightly lighter matte concealer directly onto the bulgy area. \"Make sure you do this in a good, direct light and use a fingertip to gently tap and blend.\"\n\nFast fix 3: Smooth out eye bags with filler injections\n\nIf you’re looking for a more dramatic improvement, injecting hyaluronic acid fillers into the ‘tear trough’ area can reduce the look of bagging eyes. \"Obviously you don’t want to add more volume to the bags themselves,\" explains leading cosmetic doctor Tapan Patel, founder of the Phi Clinic . \"However, where you have a loss of deeper volume making surface bags look worse, you can use filler to restore that volume and create a smoother transition between the eye and cheek area.\n\n\"The improvement can be very significant,\" he adds. \"Stopping the patient looking tired and sad instantly changes the whole message the face is sending out.\"\n\nThe exact technique varies from patient to patient, but Dr Patel treated our case study by injecting tiny amounts into the tops of her cheeks, directly underneath her bags. Tear trough fillers start from £750 at the Phi Clinic and results last 18-24 months.\n\nHowever, he urges patients to do their research and have a thorough consultation before going ahead with any treatment. It’s never advisable to book a consultation and treatment on the same day - give yourself time to think.\n\n\"This is a highly specialist treatment,\" he says. \"The skin is the tear trough area is delicate and there is a risk of leaving visible lumps, so this treatment should only be done by somebody very experienced. And if the skin is sagging significantly, surgery is the only answer.\"\n\nCase study: How I packed my bags with fillers\n\nWriter Susanna Galton, 40, trials tear trough injections to revive her eyes...\n\n\"Being endlessly told I look knackered is not good for morale. Yes I've had three kids, and yes I am partial to the odd late night and glass of wine. But I've had eyebags long before I started 'earning' them. Even at primary school I looked tired.\n\nI've spent hours Googling 'eye bag removal surgery' and once bought an online voucher before coming to my senses and conceding plastic surgery via Groupon was not wise. However I must admit I was impressed by the Phi Clinic’s ‘before and after’ pictures of eye bags treated with injectable fillers. And it seemed a lot less drastic than going under the knife.\n\nAfter peering at my face from all angles, Dr Tapan Patel confirmed my issue wasn't about ageing but a 'constitutional' one - ie it's simply the way my face is made. He was confident fillers injected into the ‘tear trough’ area (the bit that looks dark and shadowy) would make an improvement and even assured me the results could be reversed in the very unlikely event I wasn’t happy.\n\nNumbing cream was applied to my under eye area, so I barely felt a thing. I've had more painful facials. I walked out half an hour later thrilled with the results. I didn't look weird or like I'd had anything 'done,' just less haggard.\n\nI didn't tell most people what I'd done, but soon was enjoying comments that I 'seem well'. It was as if people could tell I looked better, they just weren’t sure why.\n\nI can't deny I am overjoyed with the result. When I catch my reflection in shop windows my heart doesn't sink any more. I still look my age (and that's fine) but I appear less laden with woes. I feel the 'exterior' me reflects the upbeat person I've always felt inside. And it really is wonderful not having strangers tell me I look tired all the time.\"\n\nAnd finally… When is surgery the only option?\n\nThere’s only so much makeup, massage and needles can do. For more severe eye bags, lower blepharoplasty surgery is your only option if you’re serious about removing them.\n\n\"The technique depends on what the main issue is,\" explains Mr Karidis. \"If you have bags without too much loose skin, the fat is removed or re-draped through an incision inside the lower eyelid.\n\n\"If there is loose skin that needs to be trimmed too, the incision is made just underneath the eyelashes and extends outwards about a centimetre. It’s hardly visible and tends to heal very well.\"\n\nExpect 10-14 days of hiding away. Done well, surgery can make a dramatic improvement to appearance and confidence but it’s expensive (around £3,500) and there are all the usual risks of a general anaesthetic as well injection, asymmetry and an unnatural or tight look if done poorly.\n\nFor more information and before and after photos, see karidis.co.uk", "description": "Want to disguise, minimise or even remove puffy, baggy eyes? Here’s how to fix them with makeup and non-invasive treatments (and how to tell when only a knife will help)", "authors": ["Lynne Hyland"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article10196644.ece/ALTERNATES/s1200/Susanna-Galton.jpg", "published_at": "2019-10-28"}