{"pub": "metro", "url": "https://metro.co.uk/2019/10/11/avengers-endgame-theory-suggests-tony-stark-still-alive-not-okay-10902339", "downloaded_at": "2019-10-11 20:11:44.832814+00:00", "title": "Avengers: Endgame theory says Tony Stark is still alive", "language": "en", "text": "Fans were heartbroken to see him go (Picture: Marvel Studios/Kobal/REX)\n\nAvengers: Endgame theories have been rife since the movie’s release but the Marvel fandom has been left reeling by one which suggests that Tony Stark could still be alive.\n\nDon’t tell us we went through all that pain for nothing.\n\nFans were absolutely heartbroken when Iron Man (Robert Downey Jr) met his tragic end after sacrificing himself to defeat Thanos and most of us were in denial for weeks.\n\nBut Reddit user ankitkvishwakarma has taken it to an entirely new level.\n\n‘TONY STARK is backed up in form of an A.I. ! Possible proofs from ENDGAME. Endgame’s scene no one noticed,’ they wrote. Consider us intrigued.\n\nThey cite a scene near the end of the movie, which sees a hologram of Tony speak to Pepper (Gwyneth Paltrow) and his daughter Morgan (Lexi Rabe) from beyond the grave.\n\nAdvertisement\n\nAdvertisement\n\nWhile it’s assumed he recorded the unique message to say goodbye to his family for him in the event of his death, the fan was suspicious about the way the hologram makes eye contact with Morgan, with its eyes darting between his wife and child.\n\n‘How would Tony know that Morgan would be sitting on the Sofa when Pepper and Morgan would be watching the Hologram and also how would he know the location from where the hologram was getting projected?’ they asked.\n\nThe fan referenced the tragic hologram scene (Picture: Marvel)\n\n‘Not just the location but how would a 3D hologram make an eye contact with a human (Morgan). How would Tony know the locations before recording?’\n\nWith the fan theorising that a version of Tony’s brain was backed up in his helmet, they went on to point out that it’s entirely possible after an Iron Man AI was introduced in the 2015 Ironheart comic books.\n\nWe wouldn’t put it past him TBH.\n\nHe might return to screens in the Black Widow movie (Picture: Getty Images)\n\nDespite it being tempting to bring the beloved character back by any means, fans might see this as a bit of a cop-out after such an apt ending for him.\n\nIt’s already been claimed that Robert could be set to return to screens as Tony in the Black Widow movie as the film takes place after Civil War but before Infinity War.\n\nAdvertisement\n\nAdvertisement\n\nMeanwhile, we could actually see the star come back as an AI after sources told We Got This Covered that Marvel is keen to explore the story of Riri Williams’ Ironheart.\n\nSo never fear guys, Tony could be back before we know it.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Avengers’ Elizabeth Olsen recalls ‘horrible’ Game Of Thrones audition after trying out for Daenerys\n\nMORE: Avengers’ Mark Ruffalo slams Ellen DeGeneres’ explanation for hanging with George W Bush", "description": "Avengers: Endgame theory says Tony Stark is still alive and Marvel fans are obsessed.", "authors": ["Louise Griffin"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_89440564_1570801128.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-11"}