{"pub": "investing.com", "url": "https://investing.com/news/economy/malaysia-wont-raise-tax-even-as-trade-war-halts-fiscal-plan-1995690", "downloaded_at": "2019-10-14 05:16:58.423698+00:00", "title": "Malaysia Won’t Raise Tax Even as Trade War Halts Fiscal Plan", "language": "en", "text": "(Bloomberg) -- Malaysia’s finance minister said the government won’t raise taxes unnecessarily even as the trade war between two of its largest trading partners hampers Malaysia’s goal of achieving a balanced budget.\n\nThe government will spend within its means and won’t add taxes just to fund certain infrastructure projects, Finance Minister Lim Guan Eng said in a Bloomberg Television interview with Haslinda Amin, after announcing the 2020 budget Friday. To raise funds, Malaysia will sell samurai bonds early next year, and continue its pursuit of assets lost in the 1MDB state investment-fund scandal, he said.\n\nThe government remains committed to reducing the fiscal deficit in the medium term, and could reach a balanced budget in five years if trade tensions between the U.S. and China are resolved, Lim said.\n\nThe government widened its deficit target for 2020 to 3.2% of gross domestic product, from a previous target of 3%, to get the fiscal space it needs to support economic growth. On Friday, Lim announced larger development spending for next year and offered a slew of incentives to win over investors amid the trade war, which he described as a unique opportunity for Malaysia to attract investment.\n\nSpecial Channel\n\nA special channel aims to make it easier for Chinese investors to enter the Malaysian market starting next year, Lim said in the interview Monday in Kuala Lumpur. He expects foreign-direct investment from China to reach levels of investment from the U.S. and Europe in coming years.\n\nSoon after Prime Minister Mahathir Mohamad returned to power last year, Malaysia halted or canceled major projects and slashed spending to rein in debt. That tone has changed since Lim said in February that he was nearly done cleaning house. The government raised next year’s transport allocation by 8.8% to fund a Kuala Lumpur mass rapid transit project and the Pan-Borneo Highway, while allocating 10 billion ringgit ($2.4 billion) to help Malaysians buy homes.\n\nMalaysia will raise funds by selling yen-denominated bonds in the first quarter of next year, with the size to be determined after talks with Japan, Lim said. The government raised 200 billion yen ($1.85 billion) this year at a coupon of 0.53%, lower than the 0.65% he indicated before the sale. Lim said he’s open to other types of bonds.\n\n“It’s always a pricing issue.” he said. “We are willing to consider all issues provided the price is right.”\n\nReparation Payments\n\nMahathir has made it a mission to bring back money believed to be lost through 1MDB. Lim reiterated that he wants Goldman Sachs Group Inc (NYSE: ). to make “reparation payments” amounting to $7.5 billion for the bank’s role in arranging bond sales for the troubled state fund. Until then, Malaysia will continue legal proceedings against the U.S. bank and its 17 current and former directors, Lim said.\n\n“I hope they back up their words with deeds,” he said, referring to comments from Goldman President and Chief Operating Officer John Waldron, who said last month the bank wants to get the Malaysian people the money they deserve.\n\n“If they want to make Malaysians happy, then back it up with reparation payments,” Lim said.\n\n(Updates with details from interview throughout.)", "description": "Malaysia Won’t Raise Tax Even as Trade War Halts Fiscal Plan", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic48bc492b25da92e4d5d7d7e3eb97bdb0.jpg", "published_at": "2019-10-14"}