{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7492545/Manchester-United-news-Rio-Ferdinand-confronts-YouTubers-shouted-Ole-him.html", "downloaded_at": "2019-10-05 08:21:28.057259+00:00", "title": "Manchester United news: Rio Ferdinand confronts YouTubers who shouted 'Ole out' at him", "language": "en", "text": "Rio Ferdinand has leaped to the defence of Manchester United manager Ole Gunnar Solskjaer after fans called for the Norwegian boss to be sacked.\n\nFerdinand confronted several YouTubers from his car window after one fan shouted 'Ole out' following United's disappointing performance in the 2-0 defeat to West Ham on Sunday.\n\nThe Red Devils are on a poor run of form that has seen them win just three times in their last 13 Premier League games but Ferdinand believes calls for Solskjaer to step down is a 'knee-jerk' reaction.\n\nRio Ferdinand has confronted fans who think Ole Gunnar Solskjaer should be sacked\n\nThe Manchester United great defended Solskjaer when talking to YouTubers on Sunday\n\nFerdinand gave his view on why it would be the wrong decision to sack Solskjaer given that supporters weren't complaining when the club registered wins against Leicester and Chelsea.\n\nFollowing the suggestion that Solskjaer should step down from his role as boss, Ferdinand responded: 'Where's that coming from? Ole out for what?\n\n'Are we just going to keep changing managers every week, is that what everyone wants: You get a bad result, you change [the manager].\n\nSolskjaer has only managed three wins in his last 13 Premier League games as United manager\n\n'Two weeks ago I didn't see people saying we want Ole out. And now it's changed after two weeks, come on man.\n\n'It's too knee-jerk – sometimes you've just got to let a thing play out.'\n\nAndriy Yarmolenko and Aaron Cresswell condemned United to their second defeat of the season which saw Solskjaer's men condemned for their lacklustre display.\n\nTheir performance was pilloried by ex-captain Roy Keane and former boss Jose Mourinho during Sky Sports' coverage of the clash.\n\nBut Solskjaer refused to throw his players under the bus despite their latest disappointment, saying: 'The players are doing what I'm asking them to.\n\nThe Red Devils produced a lacklustre display as West Ham went on to win 2-0 on Sunday\n\nEx-United captain Roy Keane pilloried the performance from Solskjaer's men on Sky Sports\n\n'There are key moments in games that can tip these games in our favour compared to theirs and you make maybe a bad decision on a pass - left, right, centre - but the attitude and desire is there.\n\n'That's not the problem. It's the quality in our decision-making, sometimes in the execution. It's a good group to work with. They are determined. Sometimes along the road, we are going to hit some bumps, as we've said, some highs and lows.\n\n'This group is out there determined, they showed the desire, it was a good atmosphere in the dressing room. They've got the focus right.'", "description": "Ferdinand confronted several YouTubers from his car window after one fan shouted 'Ole out' following United's disappointing performance in the 2-0 defeat to West Ham on Sunday.", "authors": ["Sam Mcevoy For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/22/23/18798774-0-image-a-103_1569191444385.jpg", "published_at": "2019-09-22"}