{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7586825/Helen-Mirren-rules-turquoise-gown-aquamarine-maxi-coat-Catherine-Great-premiere-LA.html", "downloaded_at": "2019-10-18 07:06:50.890039+00:00", "title": "Helen Mirren rules in turquoise gown with aquamarine maxi coat at Catherine The Great premiere in LA", "language": "en", "text": "She starred as Elizabeth I in a HBO mini series in 2005.\n\nAnd now, Helen Mirren is back on HBO as another major female ruler - Catherine The Great.\n\nAnd on Thursday, the British actress headlined a special screening for series at LA's Hammer Museum.\n\nIn the spotlight: Helen Mirren, 74, was the star at a premiere in Los Angeles on Thursday night for her HBO mini series Catherine The Great\n\nMirren, 74, who won an Oscar for her portrayal of Elizabeth II in The Queen, plays the legendary Empress of Russia in the four-part series premiering on the premium subscription channel on October 21.\n\nNaturally, she chose a regal ensemble for her night in the spotlight.\n\nShe opted for a full-length turquoise dress with aquamarine maxi coat that had voluminous long sleeves and fanned out around her as she posed for photos.\n\nMirren accessorized with a statement necklace and matching pendant earrings.\n\nHer hair was in a bouffant style blown back from her forehead and she carried a small purple clutch.\n\nRegal: The British actress opted for a full-length turquoise dress with aquamarine maxi coat that had voluminous long sleeves and fanned out around her as she posed for photos\n\nBorn to rule: She accessorized with a statement necklace and matching pendant earrings\n\nLikes thrones: Mirren, who won an Oscar for her portrayal of Elizabeth II in The Queen, plays the legendary Empress of Russia in the four-part series premiering on HBO on October 21\n\nJoining Mirren at the screening was her co-star Jason Clarke who plays military leader and statesman - and Catherine's longtime lover - Grigory Potemkin.\n\nThe Australian actor, 50, wore a gray two-piece suit with pale blue shirt and black tie.\n\nClarke and Mirren showed off their real-life chemistry as they posed up a storm together for the cameras.\n\nHer right hand man: Joining Mirren at the screening was her co-star Jason Clarke who plays military leader and statesman - and Catherine's longtime lover - Grigory Potemkin\n\nCo-stars: Clarke and Mirren showed off their real-life chemistry as they posed up a storm together for the cameras\n\nDapper: The Australian actor, 50, wore a gray two-piece suit with pale blue shirt and black tie\n\nPals: Clarke even planted a sweet kiss on Mirren as she leaned towards him\n\nCatherine The Great reigned from 1762 until her death at age 67 in 1796.\n\nShe came to power after orchestrating a coup against her husband Peter II, whom she forced to abdicate.\n\nA few days after signing the instrument of abdication, Peter II was assassinated.\n\nUnder her leadership, Russia grew to be one of the great powers of Europe but as a female ruler, Catherine relied heavily on the men around her to lead her armies, implement her foreign policy and meet her carnal desires.\n\nThe mini series charts the latter years of the empress' 34-year reign and was filmed in Russia, Latvia and Lithuania.\n\nRuthless: Catherine The Great reigned from 1762 until her death at age 67 in 1796. She came to power after orchestrating a coup against her husband Peter II, whom she forced to abdicate", "description": "Mirren, 74, stars as the legendary Empress of Russia Catherine The Great in the four-part series premiering on HBO on October 21.", "authors": ["Rachel Mcgrath For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/05/19869168-0-image-a-27_1571371352396.jpg", "published_at": "2019-10-18"}