{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/03/of-great-significance-north-korea-hails-submarine-launch-of-ballistic-missile", "downloaded_at": "2019-10-03 07:18:47.327842+00:00", "published_at": "2019-10-03", "title": "‘Of great significance’: North Korea hails submarine launch of ballistic missile", "language": "en", "text": "State media says test-firing ushers in ‘new phase’ in country’s defence systems, ahead of nuclear talks with US\n\nNorth Korea says it successfully test-fired a new type of submarine-launched ballistic missile (SLBM) from the sea off its east coast.\n\n“The new-type ballistic missile was fired in vertical mode” in the waters off Wonsan Bay on Wednesday, the North’s KCNA state news agency reported.\n\nAnalysts say the launch may be used as leverage in talks due to resume with the US on the weekend. A proven submarine-based missile capability would take Pyongyang’s arsenal to a new level, allowing deployment far beyond the Korean peninsula and a second-strike capability in the event of an attack on its military bases.\n\nOusted John Bolton attacks Trump's approach to 'dangerous' North Korea Read more\n\n“The successful new-type SLBM test-firing comes to be of great significance as it ushered in a new phase in containing the outside forces’ threat to the DPRK [Democratic People’s Republic of Korea] and further bolstering its military muscle for self-defence,” the state news agency said.\n\nThe test “had no adverse impact on the security of neighbouring countries,” it added, but Japan said the missile had landed inside its exclusive economic zone, but there were no immediate reports of damage to shipping or aircraft.\n\nSouth Korea’s joint chiefs of staff said the missile travelled about 450km (280 miles) in an easterly direction at a maximum altitude of 910km.\n\nFacebook Twitter Pinterest The North Korean government issued a photo of what it said was an underwater-launched ballistic missile. Photograph: í©ëNí êMé–/AP\n\nPhotos of the launch in the official newspaper Rodong Sinmun showed a black-and-white painted missile emerging from the water and flying into the grey sky.\n\nNorth Korean’s leader Kim Jong-un “sent warm congratulations” to those who had carried out the successful test-firing, KCNA said, indicating that Kim was not at the site.\n\nA State Department spokeswoman called on Pyongyang to “refrain from provocations” and to remain committed to the nuclear negotiations.\n\nSouth Korea expressed strong concern and the Japanese prime minister, Shinzo Abe, condemned the launch, saying it was a violation of UN security council resolutions.\n\nNorth Korea rejects those resolutions that ban Pyongyang from using ballistic missile technology, saying they are an infringement of its right to self-defence.\n\nThe launch was the ninth since Donald Trump and the North Korean leader, Kim Jong-un, met at the heavily guarded demilitarised zone (DMZ) between the two Koreas in June, and came soon after Pyongyang announced it would hold working-level talks with the US on Saturday – a development that could potentially break months of stalemate over North Korea’s nuclear weapons programme.\n\nTalks aimed at dismantling North Korea’s nuclear and missile programmes have been stalled since the second summit between Trump and Kim in Vietnam in February ended without a deal.", "description": "State media says test-firing ushers in ‘new phase’ in country’s defence systems, ahead of nuclear talks with US", "authors": ["Guardian Staff"], "top_image": "https://i.guim.co.uk/img/media/8b4f158ff6d23f8878daaecfad4d1c50ecb424e2/0_92_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=aa4eb6c79187eb7020a424d0bcf151cd"}