{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-news-live-impeachment-testimony-ukraine-vindman-tweets-today-a9175531.html", "downloaded_at": "2019-10-29 14:15:57.339658+00:00", "title": "Trump news live: Latest impeachment updates as Ukraine expert to testify over ‘national security’ threat", "language": "en", "text": "The president himself was in Chicago on Monday to address the International Association of Chiefs of Police Conference and Exposition at which he insulted the Windy City’s top law enforcement official, saying “Afghanistan is a safe place by comparison”, and imitated cops taking out the Dayton mass shooter in August.\n\nHaving repeatedly criticised Chicago's record on crime, Trump improably described himself as law enforcement's \"greatest and most loyal champion\" before accusing police chief Eddie Johnson of putting \"criminals and illegal aliens before the city of Chicago\" as he called for an end to so-called \"sanctuary cities\" that he says are knowingly releasing jailed immigrants accused of violent crime.\n\n\"Get 'em the hell out of our country and bring them home, let them take care of them,\" Trump told his audience of police officials. \"Countries love sending their worst to us. They don't have to bother with them.\"\n\n\n\nTrump attacked Johnson for \"not doing his job\" in a city that the president has often ridiculed as a \"war zone\" for its high murder rate (there have been 425 homicides there so far this year). Chicago is \"embarrassing to us as a nation\" and \"Afghanistan is a safe place by comparison\", he said.\n\n\n\nAfter linking the case of Empire actor Jussie Smollett, who faked a racist assault by MAGA cap-wearing Trump supporters for publicity, to the impeachment inquiry (both \"scams\", he said), the president went on to praise the police responders in Ohio after Connor Betts opened fire with a AR-15 rifle in the early hours of 4 August, killing nine people and injuring 27.\n\n\"Boom, boom, boom\", the president said. \"They were out there. Perfect. There was no fear. There was no anything. They reacted.\"\n\nHere's Alex Woodward's report.", "description": "Alexander Vindman, the top Ukraine expert at the US National Security Council, will tell the House impeachment inquiry on Tuesday that he raised concerns about Donald Trump’s 25 July phone call with Volodymyr Zelensky having already warned superiors about the administration’s bid to pressure the country into investigating the son of domestic political rival", "authors": ["Joe Sommerlad"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/29/09/donald-trump.jpg", "published_at": "2019-10-29"}