{"pub": "thehill", "url": "https://thehill.com/policy/healthcare/466205-warren-faces-tougher-sell-with-medicare-for-all", "downloaded_at": "2019-10-17 10:31:54.332151+00:00", "title": "Warren faces tougher sell with 'Medicare for All'", "language": "en", "text": "Sen. Elizabeth Warren Elizabeth Ann WarrenButtigieg tweeted support for 'Medicare for All' in 2018 Overnight Health Care — Presented by National Taxpayers Union — House Dems change drug pricing bill to address progressive concerns | Top Republican rejects Dem proposal on surprise medical bills | Vaping group launches Fox News ad blitz Hillicon Valley: FCC approves T-Mobile-Sprint merger | Dems wrangle over breaking up Big Tech at debate | Critics pounce as Facebook's Libra stumbles | Zuckerberg to be interviewed by Fox News | Twitter details rules for political figures' tweets MORE’s (D-Mass.) main health care proposal is losing support in the polls, posing a challenge to the emerging front-runner as “Medicare for All” comes under fresh attacks from fellow presidential candidates, hospitals, doctors and insurers.\n\nOpposition to Medicare for All was on full display at Tuesday night’s Democratic primary debate, where moderate candidates called the plan a “pipe dream” and an “obliteration” of the private health insurance system.\n\nThe bulk of those attacks came from moderates like South Bend, Ind., Mayor Pete Buttigieg Peter (Pete) Paul ButtigiegButtigieg tweeted support for 'Medicare for All' in 2018 Overnight Health Care — Presented by National Taxpayers Union — House Dems change drug pricing bill to address progressive concerns | Top Republican rejects Dem proposal on surprise medical bills | Vaping group launches Fox News ad blitz Democrats have reason to worry after the last presidential debate MORE, Sen. Amy Klobuchar Amy Jean KlobucharHillicon Valley: FCC approves T-Mobile-Sprint merger | Dems wrangle over breaking up Big Tech at debate | Critics pounce as Facebook's Libra stumbles | Zuckerberg to be interviewed by Fox News | Twitter details rules for political figures' tweets Progressive action group defends Warren over dodging of 'Medicare for all' questions The Hill's 12:30 Report: Trump seeks distance from Syria crisis MORE (D-Minn.) and former Vice President Joe Biden Joe BidenTrump says lawmakers should censure Schiff Schiff says committees will eventually make impeachment inquiry transcripts public Trump threat lacks teeth to block impeachment witnesses MORE, who accused Warren of being evasive on how she would pay for the proposal.\n\nADVERTISEMENT\n\n“There’s still been no explanation for the multitrillion-dollar hole in this plan,” Buttigieg said Wednesday on CNN. “I have a lot of respect for Sen. Warren, but last night she was more specific and forthcoming about the number of selfies she’s taken than about how this plan is going to be funded.”\n\nSeveral polls showed support dropping or plateauing for Medicare for All throughout the summer. Those shifts in public opinion came amid Democratic debates that spent significant time on the issue, and a well-funded opposition campaign launched by the health care industry.\n\nThe declining support creates a challenge for Warren, who gambled on not devising her own health care plan, like other candidates, but instead telling voters “I’m with Bernie” on Medicare for All.\n\nThe overall plan, authored by Sen. Bernie Sanders Bernie SandersOvernight Health Care — Presented by National Taxpayers Union — House Dems change drug pricing bill to address progressive concerns | Top Republican rejects Dem proposal on surprise medical bills | Vaping group launches Fox News ad blitz Democrats have reason to worry after the last presidential debate Krystal Ball on Sanders debate performance: 'He absolutely hit it out of the park' MORE (I-Vt.) and popularized during his 2016 presidential run, has gained more public exposure in the 2020 cycle.\n\nDemocratic presidential candidates like Sens. Kamala Harris Kamala Devi HarrisHillicon Valley: FCC approves T-Mobile-Sprint merger | Dems wrangle over breaking up Big Tech at debate | Critics pounce as Facebook's Libra stumbles | Zuckerberg to be interviewed by Fox News | Twitter details rules for political figures' tweets Democrats have reason to worry after the last presidential debate 2020 Democrats recognize Pronouns Day MORE (D-Calif.) and Cory Booker Cory Anthony Booker2020 Democrats recognize Pronouns Day Third-quarter fundraising sets Sanders, Warren, Buttigieg apart The Hill's 12:30 Report: Trump seeks distance from Syria crisis MORE (D-N.J.) launched their campaigns in support of Medicare for All but toned down their rhetoric as polls increasingly showed voter discomfort with it.\n\nA Kaiser Family Foundation (KFF) tracking poll released Tuesday showed support has dropped 5 points, and opposition increased 8 points, since April, two months before the first Democratic primary debate.\n\n“We know some arguments commonly made against Medicare for All push people to oppose it. I think it’s a possibility that people hearing more of that discussion and hearing more of those arguments could be leading to a softening in support,” said Liz Hamel, director of public opinion and survey research for KFF.\n\nADVERTISEMENT\n\nArguments from Republicans and moderate Democrats that Medicare for All would increase taxes for the middle class and eliminate private health insurance appear to be breaking through with voters.\n\n“I don’t understand why you believe the only way to deliver affordable coverage to everybody is to obliterate private plans,” Buttigieg said at Tuesday’s debate, addressing Warren.\n\nSupport for Medicare for All typically declines when voters are told it would end private insurance. Sanders’s proposal would ban the sale of private insurance plans that cover the same services as the new national health care plan.\n\nWarren and Sanders argue that private insurance companies profit by denying care to their customers, driving up health care costs for millions of Americans.\n\nBut Warren sidestepped questions Tuesday, as she did in previous debates, about whether Medicare for All would lead to tax increases for the middle class. She argues overall costs would go down for middle class families because Medicare for All would do away with the deductibles, copays and premiums associated with private insurance.\n\nMeanwhile, industry groups such as the Partnership for America’s Health Care Future, a coalition of doctors, hospitals and insurers opposed to Medicare for All, are spending millions of dollars on ads attacking the proposal in early voting states like Iowa. The group has also aired ads before, during and after some of the debates.\n\n“I do think it has had an impact on public opinion. But what’s interesting is how much money it’s taking to try to sow doubt in people’s minds,” said Rep. Pramila Jayapal Pramila JayapalOvernight Health Care — Presented by National Taxpayers Union — Buttigieg targets Warren, Sanders on health care ahead of debate | Judge overturns ObamaCare transgender protections | Poll sees support drop for 'Medicare for All' Democrats see whistleblower report as smoking gun House Democrats say memo of Trump call bolsters impeachment case MORE (D-Wash.), the sponsor of the Medicare for All bill in the House.\n\n“But I also think that the crisis of the situation is keeping support very high,” she said.\n\nMedicare for All still has the support of the majority of the public — 51 percent said they favored it in October, compared to the 53 percent who said the same in September, according to KFF tracking polls. Fifty-six percent in April said they supported it.\n\nThat support mainly comes from Democrats and independents, but it’s dropping among both groups: 71 percent of Democrats and 51 percent of independents said they supported Medicare for All in October, compared with 77 percent of Democrats and 53 percent of independents who said the same last month.\n\nStill, support for Medicare for All varies depending on how questions are asked in polls.\n\nA CBS poll released Tuesday, and conducted in late September and early October, showed 66 percent favored a Medicare-like “national, government-administered plan” that would “cover all individuals.”\n\nOnly 32 percent said they thought a national health insurance system would work better if it replaced private insurance.\n\nBut a Morning Consult poll conducted June 29 to July 1 showed that 46 percent of voters surveyed said they supported Medicare for All if it “diminished” the role of private insurers.\n\nWhen asked if they would support a Medicare for All plan that diminished the role of private insurers but allowed patients to keep their “preferred doctor and hospital,” support shot up to 55 percent.\n\n“It really depends on how you word it and frame it,” said Celinda Lake, a leading Democratic pollster. “If you talk about Medicare for All in the positive — that there is no copay, you get to choose your own doctor and everyone is covered, that is very positive with voters.\n\n“If you talk about it doing away with insurance, raising taxes … then of course it’s unpopular.”", "description": "Sen. Elizabeth Warren’s (D-Mass.) main health care proposal is losing support in the polls, posing a challenge to the emerging front-runner as “Medicare for All” comes under fresh attacks from fellow presidential candidates, hospitals, doctors and insurers.", "authors": [], "top_image": "https://thehill.com/sites/default/files/warrenelizabeth_101619getty.jpg", "published_at": "2019-10-17"}