{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/nicky-morgan-brexit-boris-johnson-remain-vote-referendum-a9105091.html", "downloaded_at": "2019-09-14 11:19:33.237567+00:00", "title": "Boris Johnson cabinet minister Nicky Morgan says she would vote Remain in second Brexit referendum: 'It is not a result I was comfortable with'", "language": "en", "text": "Cabinet minister Nicky Morgan has revealed she would vote for Remain in a second referendum, leading to accusations of her \"putting career before conscience\" for remaining in government.\n\nDespite serving in Boris Johnson's administration – with a pledge to deliver Brexit by 31 October with or without a deal – the culture secretary added she was not \"comfortable\" with the result of the 2016 referendum at the time.\n\nAppearing on BBC Breakfast, Ms Morgan, who accepted a job in Mr Johnson's cabinet in July, insisted she had accepted the EU referendum result and it was the duty of MPs and parliament to deliver on it.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBut asked directly how she would vote in a second Brexit referendum - now backed by all the opposition parties at Westminster - Ms Morgan replied: \"I would vote to Remain.\"\n\nPressed on why she was then serving in Mr Johnson's cabinet, despite her own personal view, the minister continued: \"I'm also a democrat, because I think one on the fundamental tenants of our democracy is that when the public vote... it is not a result I was comfortable with but I have accepted it.\n\nShape Created with Sketch. Protesters take to streets after Boris Johnson suspends parliament Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Protesters take to streets after Boris Johnson suspends parliament 1/11 Anti Brexit protesters march on Whitehall EPA 2/11 Many of the protesters carried placards AP 3/11 A demonstrator wears a Boris Johnson mask during a London rally AFP/Getty Images 4/11 An anti-Brexit demonstrator wields an EU flag during a London rally. AFP/Getty Images 5/11 The protesters also marched to Trafalgar Square, where they blocked traffic AP 6/11 John McDonnell addressed crowds in Whitehall. PA 7/11 A small group of Brexit supporters attempted to stage a counter protest in central London. AP 8/11 Three people were arrested in London, including a woman who sat on the road near Trafalgar Square. AP 9/11 In Oxford, locals and students gathered outside Balliol College, Boris Johnson's alma mater, to protest. PA 10/11 Thousands of people gather in central Glasgow to protest against the prime minister. AFP/Getty Images 11/11 Jeremy Corbyn spoke to protesters in central Glasgow. Getty 1/11 Anti Brexit protesters march on Whitehall EPA 2/11 Many of the protesters carried placards AP 3/11 A demonstrator wears a Boris Johnson mask during a London rally AFP/Getty Images 4/11 An anti-Brexit demonstrator wields an EU flag during a London rally. AFP/Getty Images 5/11 The protesters also marched to Trafalgar Square, where they blocked traffic AP 6/11 John McDonnell addressed crowds in Whitehall. PA 7/11 A small group of Brexit supporters attempted to stage a counter protest in central London. AP 8/11 Three people were arrested in London, including a woman who sat on the road near Trafalgar Square. AP 9/11 In Oxford, locals and students gathered outside Balliol College, Boris Johnson's alma mater, to protest. PA 10/11 Thousands of people gather in central Glasgow to protest against the prime minister. AFP/Getty Images 11/11 Jeremy Corbyn spoke to protesters in central Glasgow. Getty\n\n\"When there is a result, whether it is a referendum or election, that MPs in parliament fulfil that mandate.\"\n\nBut the Labour MP David Lammy seized on her remarks, posting on his Twitter account: \"Repeat after me. Nicky Morgan put her own career progression before her conscience, constituents and country.\"\n\nLater on BBC Radio 4's Today programme, Ms Morgan insisted she did not support \"having another referendum\" and as a result \"it's not something I spend an awful lot of time dwelling on\".\n\n\"My instinct is that I'm sorry the Remain campaign didn't win in 2016 and that really I'm sorry we've seen all the division and uncertainty over the last three and a half years.\n\nAsked what motivated her choice to back Remain should there be a second referendum, she added: \"Well I think the same reasons that I felt very firmly back in 2016 that I campaigned for Remain.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\n\"Partly economic, partly more geopolitical devices that I felt that being part of the EU was so geopolitically the right decision.\"\n\nJustifying her decision to serve in Mr Johnson's cabinet and stand by the commitment to leave without a deal should one not be in place by 31 October, Mr Morgan said: \"I think generally in life when you're offered an opportunity to serve in the cabinet it's an element of public service.\n\n\"I think you should do what you can to accept that. I think the reason people ask these questions today is to misunderstand the nature of representative democracy and representation.\n\n\"There are always times when you're a minister or MP when you have your own personal view on something, but actually you have to take a broader view on what is right for the country.\"", "description": "Cabinet minister Nicky Morgan has revealed she would vote for Remain in a second referendum, leading to accusations of her \"putting career before conscience\" for remaining in government. Despite serving in Boris Johnson's administration – with a pledge to deliver Brexit by 31 October with or without a deal – the culture secretary added she was not \"comfortable\" with the result", "authors": ["Ashley Cowburn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/14/09/screen-shot-2019-09-14-at-08.56.51.png", "published_at": "2019-09-14"}