{"pub": "metro", "url": "https://metro.co.uk/2019/10/13/apprentice-investigates-lottie-lion-racism-accusations-told-rival-shut-ghandi-10911610", "downloaded_at": "2019-10-13 23:36:54.700097+00:00", "title": "The Apprentice 'investigates Lottie Lion' over racism accusations", "language": "en", "text": "Lottie has shut down claims that she’s racist after WhatsApp messages from the Apprentice group chat came to light (Picture: BBC/PA)\n\nThe Apprentice’s Lottie Lion is reportedly being investigated by show bosses over claims of racist comments towards a fellow contestant.\n\nThe 19-year-old wannabe entrepreneur told 33-year-old Lubna Farhan to ‘shut up, Ghandi’ in an argument in the group WhatsApp.\n\nLottie has adamantly denied being racist, homophobic or transphobic, but following a complaint from a fellow contestant, Fremantle Media are reportedly now looking further into it, according to The Sun on Sunday.\n\n‘We are currently looking into the circumstances regarding a complaint,’ a spokesperson for the team has said.\n\nMetro.co.uk has contacted The Apprentice and the BBC for further comment.\n\nIn the chat, according to The Sun, Lottie claimed she’d never spoken to a black person before, which Lubna debunked by sending a picture of the candidate with a friend alongside the dig: ‘I thought she’d never met a “black person”.’\n\nAdvertisement\n\nAdvertisement\n\n‘Seriously f*** off Lubna before I f**king knock you out at our press training,’ Lottie wrote back.\n\n‘Lubna I f***ing swear if you disrespect me again I will f*** you up, you embarrassing failure of a businesswoman.’\n\n‘Shut up Ghandi (sic) that doesn’t even make sense.’\n\nLottie says her comment to Lubna, of Pakistani descent, was ‘taken out of context’ (Picture: Fremantle)\n\nWhen the clash became public, Lottie did not deny the arguments but said that the Ghandi comment was ‘taken out of context’.\n\n‘My use of the word Gandhi was misinterpreted, it was as candidates in the group chat had been quoting Gandhi previously,’ she told PA.\n\nMore: The Apprentice The Apprentice finally clears up what happens to profits from tasks after 15 years on air The Apprentice's Lord Sugar fires Kenna Ngoma after boys lose again The Apprentice candidates 'banned' from having WhatsApp group chat\n\n‘The comments were taken out of context, and I ask the public not to make judgment without knowing the full context.\n\n‘At the moment, I would like my focus to be on the show, and I’m not interested in negative media attention.’\n\nThe Apprentice continues Wednesday at 9pm on BBC One.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: The Apprentice finally clears up what happens to profits from tasks after 15 years\n\nAdvertisement\n\nAdvertisement\n\nMORE: The Apprentice candidates ‘banned’ from having WhatsApp group chat after Lottie Lion’s ‘racist’ message", "description": "Lottie Lion came under fire after it emerged that she told an Apprentice rival to 'shut up Ghandi' and claiming she'd never met a black person", "authors": ["Tilly Pearce"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88998701_1570993036.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-13"}