{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/grieving-family-gatecrash-sisters-secret-20645556", "downloaded_at": "2019-10-18 07:06:10.821332+00:00", "title": "Grieving family 'gatecrash' sister's secret funeral held by 'husband who let her die'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFour siblings 'gatecrashed' their own sister's funeral after her husband set up a secret ceremony after allowing his wife to die in agony.\n\nNeil Crilley was charged with killing his wife Maureen in September 2017 but won an extraordinary court battle that enabled him to bury her.\n\nSisters Katie Friel, Margaret Colquhoun, May Mackie and Helen Jamieson found out about the funeral in Clydebank, Scotland, after a tip-off, the Daily Record reports.\n\nThey paid their respects at the ceremony, which took place six months after their sister died.\n\nOddball Crilley tried to put his wife to rest with only himself and one other couple in attendance.\n\n(Image: Jamie Williamson)\n\nCrilley, 77, escaped jail on a controversial Not Proven verdict despite admitting he had allowed Maureen, 67, to die in agony after lying on a floor in their home for eight weeks as her life ebbed away.\n\nHe refused to phone an ambulance until Maureen was close to death, by which time her brain was infected with pus and she had bed sores the size of saucers on her back, as well as a broken leg from a fall. She died of spinal meningitis .\n\nHe admitted at Glasgow High Court that he had “totally failed” his wife and wished he was dead.\n\nBut the jury cleared him of culpable homicide by majority verdict, resulting in the sisters confronting him as he left court.\n\n(Image: Jamie Williamson)\n\nKatie Friel shouted at Crilley: “You evil b******. You killed my sister” as he walked to his car.\n\nKatie, 58, told the Record: “We wanted to bury our sister in dignity but the legal process and the police investigation meant it was six months before the funeral took place.\n\n“After Neil took us to court we were devastated when a sheriff took his side and said he could look after the funeral arrangements.\n\n\"We had already booked our own undertakers and we would have had a regular ceremony that would have people who loved Maureen in attendance.”\n\n(Image: Jamie Williamson)\n\nKatie had booked with Co-op Funeralcare but the funeral director later informed her that Crilley had been in with a legal document to state he had responsibility for her funeral.\n\nThe procurator fiscal was notified of the challenge and a decision was made that Maureen’s body should not be released until the matter was sorted out.\n\nIn a writ, Crilley also sought to compel the Lord Advocate James Wolffe to intervene and rule in his favour.\n\nIn the meantime he bought a headstone which he erected in December 2017 at a plot at North Dalnottar Cemetery in Clydebank.\n\n(Image: Daily Record)\n\nThe former BAE Systems worker regularly visited the plot and laid flowers , despite the fact his wife’s body was being held in cold storage at a hospital miles away.\n\nKatie said: “Before the service, Neil told staff at the hospital, where Maureen’s body was stored, that she had no immediate family. He was determined to have his secret service and to cut us off completely, just as we had been when Maureen was alive.\n\n“We found out from a source when the graveside ceremony was taking place at the last minute and we were able to turn up.\n\n\"Neil just ignored us but we took our place at the gravestone and we were able to throw earth on the coffin. There wasn’t much he could do about it to be honest.\n\n(Image: Jamie Williamson)\n\n“We shouldn’t have been forced to do that. It was like gatecrashing our own sister’s funeral was inhuman to deny us the right to be there.”\n\nKatie claimed Maureen had been cut off from her family by loner Crilley.\n\nThe service at the graveside was only attended by two other people, a couple that Neil had invited along.\n\nKatie said: “We always believed that Neil was a controlling and manipulative man.\n\n(Image: Iain McLellan/Spindrift Photo Agency)\n\n“What kind of man leaves his wife lying on a floor for eight weeks when she is clearly dying?\n\n“We had to hear the details as they came out and it was appalling to hear what he had allowed to happen.\n\n“Neil also asked an ambulanceman if he was going to get the jail as he finally arranged for Maureen to go to hospital.\n\n\"That doesn’t sound like remorse to me. He was thinking about himself, not Maureen and her suffering. We can hardly believe he got away with this.”\n\nCrilley’s legal case at Glasgow Sheriff Court was based on the fact he had not been convicted of any crime and therefore was Maureen’s rightful next of kin.\n\nHe told Katie he would be seeking to carry out his wife’s wishes to be buried with only him at the graveside.\n\nKatie said sisters Margaret, 68, May, 65, and Helen, 63, earlier told how they were perplexed to see Crilley lay flowers at Maureen’s graveside before she had been buried.", "description": "Neil Crilley refused to call an ambulance for his wife Maureen until she was so ill her brain was infected with puss", "authors": ["Mark Mcgivern", "Matthew Dresch", "Image", "Daily Record", "Jamie Williamson", "Iain Mclellan Spindrift Photo Agency"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20645600.ece/ALTERNATES/s1200/1_PAY-sct_JW_52594JPG.jpg", "published_at": "2019-10-18"}