{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7629453/Labour-MPs-dont-want-Jeremy-Corbyn-PM.html", "downloaded_at": "2019-10-30 10:09:35.746694+00:00", "title": "Labour MPs 'don't want to back Jeremy Corbyn as PM'", "language": "en", "text": "Jeremy Corbyn faces a huge battle to keep Labour together during the snap election today amid claims some of his own MPs don't want to see him as PM.\n\nThe veteran left-winger insists he is 'ready' for the dramatic pre-Christmas contest, describing it as a 'once in a generation chance for change'.\n\nBut the scale of infighting within the party was underlined last night when more than 100 of his own MPs ignored his orders to back holding a snap election.\n\nMeanwhile, former leadership contender Owen Smith has announced he will not be standing in his Pontypridd constituency, citing 'political and personal reasons'.\n\nLabour MPs have ridiculed Mr Corbyn and his aides for believing they are on the 'brink of a brave new socialist dawn', despite grim polls for the party and him personally.\n\nOne told MailOnline: 'They think it is going to happen, he will be walking into No10. A lot of Labour MPs don't even want that.'\n\nLabour was effectively dragged kicking and screaming into backing an election last night.\n\nFor weeks the shadow cabinet and backbenchers had been holding back Mr Corbyn and his closest allies, who were desperate for a poll that is widely seen as the 70-year-old's last chance for power.\n\nBut despite voting down a motion to call an election on Monday, Labour was outflanked when it became clear Boris Johnson had secured Liberal Democrat and SNP support for a Bill triggering a ballot in December.\n\nJeremy Corbyn (pictured leaving his London home today) insists he is 'ready' for the dramatic pre-Christmas contest, describing it as a 'once in a generation chance for change'\n\nFormer leadership contender Owen Smith has announced he will not be standing in his Pontypridd constituency, citing 'political and personal reasons'\n\nMr Corbyn then performed a dramatic volte face by declaring that No Deal had been taken off the table by the EU granting a Brexit extension, and an election could safely be held.\n\nHowever, more than 100 of his MPs – almost a half of them – still defied their leader and did not vote for the December 12 election.\n\nSome 11 Labour MPs, including Margaret Beckett, Ann Clwyd, David Lammy, Barry Sheerman and Owen Smith, actually voted against the election.\n\nAnother 104 Labour MPs abstained in the vote or did not record one for another reason.It meant only 127 Labour MPs voted with Mr Corbyn in favour of an election.\n\nShadow chancellor John McDonnell insisted the party can still win the election regardless of the massive splits.\n\n'We're going to have a real go at this and I think we'll win,' he told BBC Radio 4's Today programme. 'I think we'll have a majority government by Christmas, so I can't think of a better Christmas present basically.'\n\nMr McDonnell hailed Mr Corbyn as 'one of the best campaigners I've ever seen'.\n\nBut he flannelled when asked how Labour would respond to questions about whether it is pro-Brexit or pro-Remain.\n\n'We're saying let the people decide,' he said.\n\nLast night more than 100 of Mr Corbyn's MPs – almost a half of them – defied their leader and did not vote for an election on December 12. Another 11 voted no\n\nHe admitted there were 'a range of views' in Labour 'like every political party', adding: 'The basic principle for us, not like the Lib Dems who are just saying 'we're just going to revoke, that's it', not like the Tories who are saying 'we're going to foist upon you virtually a no deal to damage the economy', we're saying - democracy, let the people decide.'\n\nAs Labour infighting raged yesterday, Mr Sheerman said frontbenchers and whips were on the verge of resigning over the poll.\n\nHe said it was 'sheer madness to hold the General Election in December and on Boris Johnson's agenda', with the party under the twin threat from the Lib Dems – who are targeting Remainers – as well as the Brexit Party.\n\nHe told Sky News: 'The first person I bumped into as I came into the Palace of Westminster this morning said he was resigning as a whip.\n\n'I'm picking up that there's deep discontent on the frontbench and in the Whips' Office.'\n\nHe added that Mr Corbyn had only been persuaded to back a snap poll by two of his closest aides, Seumas Milne and Karie Murphy.\n\n'A clear majority of our Shadow Cabinet were against a December election yesterday but Jeremy Corbyn has been persuaded to override them after interventions from Milne and Karie Murphy,' he tweeted.\n\nMr Smith announced his decision to quit within minutes of the election vote last night.\n\nHe has been a vocal campaigner for a second Brexit referendum, and was one of 20 MPs to vote against the snap poll.\n\nIn a short letter to Mr Corbyn, he did not spell out his motives beyond saying they were 'political and personal'.\n\n'It has been an enormous privilege to serve as a Labour MP and I am truly proud to have represented by hometown of Pontypridd over the last decade,' he said.\n\n'I would like to thank all those in the Labour party and the wider community who have supported me.'\n\nMr Smith challenged Mr Corbyn for the leadership in the wake of the 2016 referendum, but was comfortably beaten by 313,209 votes to 193,229.\n\nMr Corbyn was forced to agree to an election yesterday morning after weeks of dithering.\n\nOn Monday he said a vote on December 12 was out of the question because it would be too dark for many voters and because some students would no longer be at university.\n\nBut yesterday morning Mr Corbyn had no choice but to say the conditions for Labour to back a Christmas-time poll in the Commons had now been met.\n\n'I have consistently said that we are ready for an election and our support is subject to a No Deal Brexit being off the table,' he said.\n\n'We have now heard from the EU that the extension of Article 50 to January 31 has been confirmed, so for the next three months, our condition of taking No Deal off the table has now been met.\n\nWe will now launch the most ambitious and radical campaign for real change our country has ever seen. This is a once in a generation chance to build a country for the many, not the few. It's time.'\n\nSome 11 Labour MPs, including Barry Sheerman, actually voted against the election\n\nDavid Lammy (left) was another Labour rebel as was Margaret Beckett (right)\n\nLater a bizarre video posted on Instagram by the Labour leader showed him clapping his hands together and urging his activists to get on the campaign trail with a thumbs up.\n\nThe pro-Corbyn Momentum movement pledged to mobilise tens of thousands of activists to knock on doors in marginal constituencies.\n\nBased on US political campaigns, they will host hundreds of campaign events, including phone bank parties, street stalls, rallies and campus events.\n\nNational coordinator Laura Parker said: 'The choice before us all is clear. On one side there is a Labour Party which will invest in hundreds of thousands of good, green jobs, unite our country and bring real change to communities across Britain.\n\n'On the other side, Tory No Deal extremists, who are happy to sow division amongst us, will sell off our public services and pitch our economy into chaos.'\n\nYesterday Labour suspended its so-called 'trigger ballots' which are being held in constituencies up and down the country to allow members to challenge sitting MPs.\n\nSo far only four MPs were triggered and none ended up being deselected. Labour veteran Dame Margaret Hodge survived her deselection vote on Monday night.\n\nIt is believed that any outstanding candidate selections will be decided by the ruling NEC.", "description": "The scale of infighting within Labour was underlined last night when more than 100 of Jeremy Corbyn's own MPs ignored his orders to back holding a snap election.", "authors": ["James Tapsfield", "Political Editor For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/23/20352120-0-image-a-90_1572390611627.jpg", "published_at": "2019-10-30"}