{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/thief-steals-duffle-bag-not-realizing-stuffed-live-snakes-10884768", "downloaded_at": "2019-10-09 00:51:23.361734+00:00", "title": "Thief steals duffle bag not realizing its stuffed with live snakes", "language": "en", "text": "Animal educator Bryan Grundy has appealed for the return of his stolen duffle bag that contained four snakes and a lizard. It was snatched as he moved his car following a show and tell at a library (Pictures: NBC Bay Area)\n\nA thief who stole a reptile breeder’s duffle bag is in for a surprise when they open it and find it stuffed with live snakes.\n\nBrian Grundy left the bag, which had four albino pythons and a 28-inch lizard inside, while moving his car after finishing an educational show involving the animals.\n\nIt was snatched from outside the parking garage at Martin Luther King Jr Library in Campbell, California, within 90 seconds of being set down.\n\nGrundy, whose business is called For Goodness Snakes, now fears for the health of his pets.\n\nHe told NBC Bay Area: ‘In the 45 seconds to a minute-and-a-half I left my gear there, somebody took my duffel bag.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\n‘Disheartening and sad to think there are people out there looking for things to steal.’\n\nAdvertisement\n\nAdvertisement\n\nGrundy has appealed for whoever stole the bag to return his reptiles.\n\nHe says the thief can do so with no questions asked, and without fear of him filing a police report, if they do so without harming the animals.\n\nRetired librarian Kathy Boyd, who helped organize Grundry’s show at the library, said local youngsters love getting to meet the snakes and lizard.\n\nShe explained: ‘The kids are thrilled to be able to see the snakes and touch them.\n\n‘It helps them lose their fear, it’s a good show.’", "description": "A thief who stole a reptile breeder's duffle bag is in for a surprise when they open it and find it stuffed with live snakes. Brian Grundy left the bag,...", "authors": ["Jimmy Mccloskey"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/comp-1570555353_1570555620.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-08"}