{"pub": "politico", "url": "https://politico.com/news/2019/10/29/schumer-impeachment-fueled-shutdown-061179", "downloaded_at": "2019-10-30 00:01:40.289806+00:00", "title": "Schumer warns Trump may shut down the government over impeachment", "language": "en", "text": "\"I'm increasingly worried that President Trump will want to shut down the government again because of impeachment,\" Schumer told reporters. \"He always likes to create diversions. I hope and pray he won’t want to cause another government shutdown because it might be a diversion away from impeachment.\"\n\nRepublicans have so far insisted the government will not shut down, though that was also their position last December when Trump kicked off the longest government shutdown in history over Democrats' refusal to fund his border wall. Without action, the government will shut down on Nov. 22.\n\nThe Senate is set to pass a package of domestic spending bills this week, but the broader effort to fund the government is in tatters.\n\nHouse Democrats will have to work out a deal with Senate leaders over funding the government amid the impeachment inquiry, a difficult task that will test Congress' ability to compartmentalize.\n\nSchumer also confirmed that Senate Democrats will reject a defense funding bill in the coming days amid a dispute over overall spending levels, a position that's drawn criticism from McConnell.\n\n\"There’s no small amount of irony associated with the fact the president is apparently being impeached over in the House for holding up aid to Ukraine and at the same time Democrats are going to filibuster the defense bill which would provide for the assistance to Ukraine,\" McConnell said on Tuesday afternoon.\n\nEarlier, he accused Democrats of using the men and women of the military as \"pawns.\" Schumer said the majority leader \"stretches\" the truth in his attacks on Democrats.\n\n\"McConnell knows the truth. Which is simply that unless you have a bipartisan negotiation on the appropriations bills then nothing will happen,\" Schumer said. \"Hopefully our Republican friends, many of whom, because of cuts in defense, will realize now that it’s time to negotiate.\"\n\n", "description": "", "authors": [], "top_image": "https://static.politico.com/db/d9/ea8796784ef5b94a8f9ffd8c5c76/20191029-chuck-schumer-ap-773.jpg", "published_at": "2019-10-29"}