{"pub": "dailybeast", "url": "https://thedailybeast.com/the-anti-hero-who-created-americas-special-forces-250-years-ago", "downloaded_at": "2019-10-26 11:15:24.635632+00:00", "title": "The Anti-Hero Who Created America’s Special Forces", "language": "en", "text": "Ever since U.S. Grant mobilized the Union’s superior numbers of men and industrial strength against the Confederacy, the American way of war has relied heavily on intensive firepower, mass production, and cutting-edge technology to defeat the enemy. It was an approach to conflict that worked exceedingly well in the world wars and in the Persian Gulf War of 1990-91, but proved far too blunt and unsubtle to prevail in unconventional conflicts like Vietnam, and our current wars in Afghanistan and Iraq.\n\nThe Global War on Terror, of course, is very much an unconventional struggle, and the United States’ most critical military asset in waging it has been our unconventional warriors—the special forces. The Special Operations Command consists of about 70,000 men and women. Their primary missions are hunt-and-kill (or capture) raids, long-range reconnaissance and intelligence gathering, and training of indigenous military forces. Green Berets, SEALs, and the Delta Force all emerged after 1950, when special forces at long last became a permanent part of the U.S. military.\n\nBut America’s unconventional warfare tradition goes back to the 17th century, when a handful of men like Benjamin Church and John Talcott in New England formed independent scouting and raiding companies of friendly Indians and colonial soldiers to defeat a major Indian rebellion in New England called King Philip’s War (1675-76).", "description": "The French and Indian War hero excelled at only one thing: He was a superb warrior—so good, in fact, that the Army’s Ranger school still uses his manual on guerrilla tactics.", "authors": ["James A. Warren"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1504307420/170901-warren-rodgers-lede_jqjuo6", "published_at": "2017-09-02"}