{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/diginex-becomes-first-asian-firm-to-join-steptoe-led-blockchain-alliance", "downloaded_at": "2019-10-09 18:31:34.885495+00:00", "title": "Diginex Becomes First Asian Firm to Join Steptoe-Led Blockchain Alliance", "language": "en", "text": "Hong Kong-based digital financial services startup Diginex has become the first firm in Asia to join the Blockchain Alliance led by Steptoe & Johnson law firm.\n\nOver 100 members in 19 countries\n\nDiginex — which claimed to be the “first fully-diversified blockchain player on Nasdaq” — has officially joined the Blockchain Alliance, a public-private forum of firms and organizations promoting the secure development of blockchain, the firm announced Oct. 9.\n\nCo-founded in 2015 by the Chamber of Digital Commerce and Coin Center and led by international law firm Steptoe & Johnson, the Alliance now has over 100 industry and government agencies in 19 countries, Diginex stated.\n\nThe association reportedly includes major international regulatory entities such as Interpol and Europol. Crypto companies Coinbase and Kraken, as well as payments firms Ripple and Circle are also among the industry members of the Alliance, according to the organization’s website.\n\nDialogue between the industry and regulators\n\nDiginex CEO Richard Byworth pointed out the important role of the Blockchain Alliance, emphasizing that the organization fosters communication between blockchain-focused firms and government authorities to minimize risks in the industry. Byworth added:\n\n“We are delighted to be the first firm in Asia to join this strong forum of experts, where we intend to be a key voice in driving dialogue between law enforcement, regulators and industry.”\n\nMeanwhile, the Blockchain Alliance is not the first blockchain-related industry body joined by Diginex. As Cointelegraph reported, the startup is also a member of the Global Digital Finance, a major industry association developing a global “Code of Conduct” for cryptocurrencies.", "description": "Hong Kong-based startup Diginex becomes the first firm in Asia to join the Blockchain Alliance led by Steptoe & Johnson law firm", "authors": ["Helen Partz"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvZDJmZGQ3NjBlNjMzMjYzZGE2OTRkMmRlNmIxOTFkY2YuanBn.jpg", "published_at": "2019-10-09"}