{"pub": "cbc", "url": "https://cbc.ca/sports/paralympics/aurelie-rivard-para-swimming-championships-gold-1.5280195", "downloaded_at": "2019-09-12 07:13:24.225236+00:00", "title": "Sports-no-CBC", "language": "en", "text": "Led by Aly Van Wyck-Smart's Americas record in the women's 100-metre backstroke S2, the Canadian team shifted into high gear on Day 3 of the 2019 world para swimming championships with an impressive medal and record haul.\n\nOverall, the Canadians ended the third day of competition with three silver medals and one bronze, one Americas and three national records.\n\nIn the 200 back S2, Van Wyck-Smart broke the Canadian and Americas standards for the second time in just over a month. In her maiden world championship race, the 16-year-old from Toronto clocked in at two minutes, 39.27 seconds to claim silver and better the time of 2:41.98 she posted last month at the Canadian championships.\n\n\"It feels absolutely amazing. I'm so excited,\" said Van Wyck-Smart. \"All the hard work that I put in with my coaches is paying off. I couldn't be happier.\"\n\nWATCH | Van Wyck-Smart earns silver:\n\nCanada's Aly Van Wyck-Smart set an Americas record and claims a silver medal in the women’s 100m backstroke. 1:43\n\nOther Canadian medallists on Wednesday evening included Tess Routliffe of Caledon, Ont., who claimed silver in the women's 100 breaststroke SB7, Aurélie Rivard of St-Jean-sur-Richelieu, Que., second in the women's 400 freestyle S10, and Alec Elliot of Kitchener, Ont., who captured bronze in the men's 400 free S10.\n\nIn the women's 100 breast SB7, Routliffe posted a 1:32.39 to lower London 2019 teammate Abi Tripp's national mark of 1:32.51.\n\n\"I'm thrilled with my race. It really couldn't have gone better. I'm ecstatic for that Canadian record, excited for that best time. I really like the breaststroke, I'm having a lot of fun with it,\" said Routliffe.\n\nWATCH | Rivard adds to medal with silver:\n\nCanadian Aurélie Rivard wins silver in the women's 400m freestyle S10. 2:07\n\nDays after claiming her 10th career world championship medal, gold in the 50 freestyle, Rivard was hoping to add a fourth world title to her resume in the women's 400 free S10, but was edged by Poland's Oliwia Jablonska, who prevailed in 4:29.65. Rivard was right behind in 4:30.42.\n\nIn the men's 400 free S10 final, Elliot made up ground in the second half of the race to take bronze in 4:08.34. The 2016 Paralympian was overjoyed to reach his first world championship podium.\n\n\"The entire race strategy was to stay close in the first 200 and, exactly like in training, finish the final 200 really strong. Once I took the lead for third place I wasn't letting anything take it back,\" said the 23-year-old from Quebec City. \"It just feels amazing to have this first world championship medal.\"\n\nThe championships, which also serve as the first qualifying opportunity for Tokyo 2020, run until Sunday at the London Aquatics Centre. Finals will be streamed daily beginning at 1 p.m. ET on CBCSports.ca.\n\nWATCH | Complete coverage of Day 3:", "description": "The Canadian team shifted into high gear on Day 3 of the 2019 world para swimming championships with an impressive medal and record haul.", "authors": ["Cbc Sports"], "top_image": "https://i.cbc.ca/1.5280330.1568245550!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/van-wyck-smart.jpg", "published_at": "2019-09-11"}