{"pub": "washingtonpost", "url": "https://washingtonpost.com/entertainment/theater_dance/youll-groove-to-the-pop-hits-in-this-stage-revival-of-footloose-and-nothing-else/2019/10/11/9a6ac44c-ec26-11e9-85c0-85a098e47b37_story.html", "downloaded_at": "2019-10-11 20:02:42.430654+00:00", "title": "'Footloose' at the Kennedy Center: A flat-footed stage musical", "language": "en", "text": "\n\nJ. Quinton Johnson, left, and Peter McPoland in “Footloose,” at the Kennedy Center through Monday. (Jeremy Daniel/The Kennedy Center)\n\nTheater critic\n\nThe world had pretty much forgotten that “Footloose” was turned into a mediocre stage musical — until the Kennedy Center took it upon itself to remind us. Well, one would have to posit that this was not the intention in the arts center’s affectionately energetic concert revival of a 1998 show that ran for a year and a half on Broadway — and garnered zero Tony awards.\n\nStill, over the 2¼ hours it burns up in the Eisenhower Theater, the musical reveals only that it is dispiritingly flat-footed. Aside from the inclusion of a few pop hits from the 1984 date-night flick on which it is based, “Footloose,” choreographed by Spencer Liff and directed by Walter Bobbie, who also staged the original production, comes across as singularly undistinguished. Not offensive, not intolerable, just relentlessly bland — a vanilla concoction lacking anything approaching a bona fide sugar high.\n\nThe production launches the third installment of the Kennedy Center’s Broadway Center Stage series, and it’s the first real misfire. Each season, the program revives three musicals of various pedigrees and ages, the organizing principle being simply a roster of shows with some strong whiff of showbiz merit, or better, and the ability to strike a positive popular chord.\n\n[How the Kennedy Center’s theater chief sniffs out Broadway-worthy winners]\n\nThe previous seasons have offered some inspired restagings, such as the sizzling “The Who’s Tommy” that director-choreographer Josh Rhodes conjured earlier this year. And even shows with seriously checkered pasts — including “Chess,” the kickoff show of the series in February 2018 — have lived up to the buzzworthiness that Broadway Center Stage seeks to engender. That entry was helped by a spectacular cast featuring Raúl Esparza, Karen Olivo, Ramin Karimloo, Ruthie Ann Miles and Bryce Pinkham.\n\n“Footloose” continues the newly minted tradition of top-flight Broadway talent settling in on the Potomac for a week of performances, many still clutching their rehearsal binders. (That’s by the rule book for this “semi-staged” concert format.) This time around, veterans Rebecca Luker, Judy Kuhn and Michael Park are joined by vibrant, younger actor-singers such as Isabelle McCalla and J. Quinton Johnson, and a mixed ensemble of old hands and newcomers.\n\n\n\nIsabelle McCalla and Michael Park in “Footloose.” (Jeremy Daniel/The Kennedy Center)\n\nYou just wish they all had something more interesting to do and, in the case of the great Kuhn, almost anything to do; one of the truly remarkable voices of the contemporary stage is apportioned exactly one-third of one unmemorable song. The score, grafted onto a bare-bones story of a preacher (Park) who spearheads a local ordinance banning public dancing and its attendant joys, is nostalgia-driven: It features earworm songs from the movie — “Holding Out for a Hero”; “Let’s Hear It for the Boy”; “Almost Paradise” — plus a bunch of lugubrious ballads added by Tom Snow and Dean Pitchford. (Bobbie and Pitchford also adapted the movie script.)\n\nJohnson plays Ren, the rabble-rousing city kid transplanted to a repressive, conservative town, where all the teens just happen to have the moves of members of the Paul Taylor Dance Company. Johnson is perfectly fine in the role, although casting a young black man leaves open and unacknowledged the question of why he’s greeted with such hostility in a small, mostly white backwater. (Kevin Bacon played Ren in the film.) I like to think we can chalk this up to colorblind casting progress, but you do wonder whether this revival doesn’t have the responsibility to at least address the issues it lays at our feet.\n\nAs for the feet in “Footloose”: They’re set in motion with athletic appeal by choreographer Liff, especially in “Holding Out for a Hero” and the frisky title number that opens and closes the show. Set designer Paul Tate dePoo III follows the template for the concert productions: An eight-member band conducted by Sonny Paladino skillfully pumps out the accompaniment for the pounding pop and honky-tonk numbers from atop a scaffolding. Behind this skeletal structure, projections materialize to suggest the landmarks of mythical Bomont, located somewhere in the American heartland.\n\nNot much effort is committed to devising a believable psychological landscape — why, for instance, Park’s Rev. Moore requires only one paragraph of plaintive beseeching by Ren to undo all the punitive measures he has inflicted on Bomont. McCalla — an endearing player in last season’s “The Prom” on Broadway — is given ample opportunity to display vivacity as frustrated teenager Ariel, but Park, Luker and Kuhn are saddled with playing poor, unfortunate grown-ups stuck in a tired tale in which the high schoolers are the real teachers. If you’re holding out for a hero entertainment, maybe wait and see what turns up at the Kennedy Center next.\n\nFootloose, music by Tom Snow, lyrics by Dean Pitchford, stage adaptation by Walter Bobbie and Pitchford. Additional music by Eric Carmen, Sammy Hagar, Kenny Loggins and Jim Steinman. Directed by Bobbie. Choreography, Spencer Liff; music direction, Sonny Paladino. Sets and projections, Paul Tate dePoo III; costumes, David C. Woolard; lighting, Cory Pattak; sound Jon Weston. With Michael Mulheren, Nicole Vanessa Ortiz, Peter McPoland. $59-$185. About 2¼ hours. Through Monday at the Kennedy Center. 202-467-4600. kennedy-center.org.\n\nRead more by Peter Marks:\n\nIn ‘The Great Society,’ history marches numbingly on, and on, and on, and on\n\nIt’s a hard-knock life, but often a funny one, in August Wilson’s ‘Jitney’ at Arena", "description": "The Kennedy Center’s musicals-in-concert series hits a road bump with this 1998 show.", "authors": ["Peter Marks", "Theater Critic", "October At Pm", "Peter Marks Joined The Washington Post As Its Chief Theater Critic In Previously", "He Worked For Nine Years At The New York Times", "On The Culture", "Metropolitan", "National Desks", "Spent About Four Years As Its Off-Broadway Drama Critic."], "top_image": "https://www.washingtonpost.com/resizer/wcUMPZjv5qgwhFb3ZzLwdvbuzOY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/A4RCJIHLVEI6THDNINVA35HTDU.jpg", "published_at": "2019-10-11"}