{"pub": "bbc", "url": "https://bbc.com/news/world-europe-49719284", "downloaded_at": "2019-09-16 23:14:26.857096+00:00", "title": "Turkey says three million could return to safe zone in Syria", "language": "en", "text": "Image copyright AFP/Getty Images Image caption Turkey is hosting more than 3.6 million Syrians who have fled the civil war\n\nTurkey's president has said that up to three million Syrian refugees could return to their country to live in a \"safe zone\" in the north.\n\nRecep Tayyip Erdogan said the zone - which is already being set up in co-operation with the US - needed to be extended for the goal to be met.\n\nUS-backed Kurdish fighters earlier moved back from a strip of Syrian territory along the Turkish border.\n\nTurkey regards the Kurdish forces as terrorists.\n\nMr Erdogan's comments came after talks in Ankara with the presidents of Russia and Iran, Vladimir Putin and Hassan Rouhani.\n\nThe Kurds have yet to respond to Mr Erdogan's plan, but they are almost certain to bitterly oppose it, the BBC's Alan Johnston reports.\n\nEarlier this month, Turkey warned it might reopen the route for Syrian refugees to enter Europe if it did not get more international support for the \"safe zone\" in northern Syria.\n\nTurkey is hosting more than 3.6 million Syrians who have fled the civil war that began in 2011.\n\nMedia playback is unsupported on your device Media caption Thousands of Syrians flee their homes as government forces push into the opposition's last stronghold in Idlib\n\nTens of thousands of civilians have already fled north from Idlib, a province held by rebel and jihadist forces, to the Turkish border.\n\nUnder a 2016 agreement with the EU, Turkey imposed stronger controls to curb the flow of migrants and refugees to Europe.\n\nThe deal involved an EU pledge to provide €6bn (£5.4bn; $6.6bn) in aid to Turkey to house Syrian refugees.\n\nMr Erdogan has complained that only €3bn of that has arrived so far, though the EU says €5.6bn has been provided.", "description": "Turkey's president suggests refugees could return to Syria and stay in a safe zone along the border.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/13684/production/_108829497_5eea54cc-483d-42c1-9543-7082714b0585.jpg", "published_at": "2019-09-16"}