{"pub": "businessinsider", "url": "https://businessinsider.com/famous-homes-you-can-rent-big-little-lies-house-photos-2019-7", "downloaded_at": "2019-10-18 01:08:57.873993+00:00", "title": "7 famous homes you can rent right now in the US, from the beach house in 'Big Little Lies' to Barbie's Malibu Dreamhouse", "language": "en", "text": "Business Insider rounded up seven famous homes across the US that can be yours — for a short time.\n\nThe rentals span from Iowa to California.\n\nSome of the homes have been the sites of iconic movie sets and TV shows, including Reese Witherspoon's character's stunning Malibu mansion in the hit HBO show \"Big Little Lies.\"\n\nVisit Business Insider's homepage for more stories.\n\nImagine being able to vacation in the homes from your favorite movies and TV shows.\n\nBusiness Insider took a look at famous homes that are now vacation rentals and compiled a list that includes everything from a fragile glass home in Connecticut to a baseball fan's paradise in Iowa.\n\nRead more: 6 celebrity homes you can rent right now, from Harry Houdini's sprawling Hollywood Hills estate to the Brooklyn apartment Biggie Smalls grew up in\n\nSome of the homes are perfect places to unleash your inner creativity, like John Steinbeck's California cottage — while others are perfect for quick weekend getaways, like Reese Witherspoon's Malibu beach house in the hit show \"Big Little Lies.\"\n\nWhatever your preference, these homes can be yours — for a short time. Keep reading for a look inside seven famous homes you can vacation in right now. We calculated cost per guest for the maximum number of permitted guests. Cost per night, per guest was rounded to the nearest dollar.", "description": "You can live like Reese Witherspoon's character on the hit HBO show \"Big Little Lies\" for $3,000 to $5,000 a night.", "authors": ["Libertina Brandt"], "top_image": "https://image.businessinsider.com/5d265062a17d6c0ad43b7ff2?width=1200&format=jpeg", "published_at": "2019-10-17"}