{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/mark-zuckerberg-defends-facebooks-free-speech-policy.html", "downloaded_at": "2019-10-19 10:56:48.652697+00:00", "title": "The Zuck’s Speech", "language": "en", "text": "Photo: Andrew Caballero-Reynolds/AFP via Getty Images\n\nOn Wednesday, Mark Zuckerberg announced that he was going to give a speech about Facebook. He does this occasionally, releasing big manifestos about where he stands, to portray himself as a responsible thinker about society at large. He’s written big manifestos about building global community (sure) and deciding to encrypt everything (self-serving), but this was the first time he decided to speak his thoughts rather than write them. Delivered yesterday afternoon at Georgetown’s Gaston Hall, the speech concerned voice and free expression and had a very, dare I say, presidential air.\n\nWhich is to say: The speech was embarrassing. It was convoluted, nonsensical, a greatest-hits album of the ideological inconsistencies that Facebook relies upon whenever Zuckerberg needs to defend his predatory business model as some type of global charity. It was Zuckerberg arguing with straw men and bogeymen.\n\nAlmost immediately, Zuckerberg revealed himself to be — and I am trying to say this with as little malice as possible — completely full of shit. “When I was in college, our country had just gone to war in Iraq. The mood on campus was disbelief. It felt like we were acting without hearing a lot of important perspectives,” he recalled. “I remember feeling that if more people had a voice to share their experiences, maybe things would have gone differently. Those early years shaped my belief that giving everyone a voice empowers the powerless and pushes society to be better over time.”\n\nThis is a truly wild retcon. The origin story of Facebook at this point was well-known, but given how much Zuckerberg wants to not talk about that, it’s worth restating. Facebook started as FaceMash, a web app that allowed Harvard students to choose which of two other students they thought was more attractive. Early on, as he built out Facebook’s social network, Zuckerberg referred to people trusting him with their data as “dumb fucks.” These are well-established facts, and these early transgressions would not be worth repeating endlessly if Zuckerberg were willing to own up to them. Instead he continues to retrofit new company stances onto its founding myth.\n\nIt’s this inability to cop to even the simplest things that permeates everything that Zuckerberg does. A company constantly worried about “coordinated inauthentic behavior” from Russian trolls might want to look inward at some of the inauthentic behavior in its C-suite. As the Washington Post’s Nitasha Tiku pointed out yesterday, “free speech” is not mentioned a single time in Zuckerberg’s 2012 pre-IPO letter to investors, yet apparently it’s been a core value from the beginning.\n\nVarious portions of Zuckerberg’s speech read like he Googled “free speech controversies” and paraphrased the Wikipedia entries he found. “The first Supreme Court case to seriously consider free speech and the First Amendment was in 1919,” and so on. He raised the specter of Chinese censorship, citing the fact that the current Hong Kong protests were being kept off TikTok at the behest of the Chinese government.\n\nZuckerberg tied his mission of free speech to the efforts of Martin Luther King Jr. This immediately backfired when King’s daughter tweeted that Facebook failed to understand “the challenges #MLK faced from disinformation campaigns launched by politicians. These campaigns created an atmosphere for his assassination.”\n\nI heard #MarkZuckerberg's ‘free expression’ speech, in which he referenced my father. I'd like to help Facebook better understand the challenges #MLK faced from disinformation campaigns launched by politicians. These campaigns created an atmosphere for his assassination. pic.twitter.com/h97gvVmtSZ — Be A King (@BerniceKing) October 17, 2019\n\nPerhaps the wildest part of Zuckerberg’s speech was when he defended the rights of … politicians? Facebook has come under fire recently, and rightfully so, for a platform policy that allows politicians to lie in their campaign ads. “In general, I don’t think it’s right for a private company to censor politicians or the news in a democracy,” he said, defending their right to lie. The power dynamics here are all wrong. Incumbent politicians are the ones in power, who already have easy access to traditional outlets and substantial advertising budgets. They are not an oppressed class who deserve permission to lie to their constituents. Challengers, similarly, should not be able to gain political power by lying. This feels very basic to me.\n\nMaybe Facebook should ban political ads entirely, he pondered, before rejecting the notion. “Banning political ads favors incumbents and whoever the media covers,” he asserted. Donald Trump, the current president of the United States, has spent far more on Facebook ads this year than any Democratic challenger.\n\nAgain, most civic-minded Americans would find Zuckerberg’s general stance agreeable: Free speech is good. But the content of speech is only one half of the criticism Facebook faces. There is a difference, as many have pointed out, between speech and reach. The First Amendment (which Facebook is not beholden to) protects the right to say disagreeable and untrue things. It does not say that person has a right to have those statements disseminated widely. For all of the time Zuckerberg spent defending free-speech principles, he spent no time defending the algorithmic weighting that decides what Facebook users see when they scroll through their News Feed.\n\nFor a long time, Facebook’s software preferred polarizing content that guided people to emotional extremes, increasing site engagement. And yet Zuckerberg claimed yesterday that he wants to reduce polarization. “Much of the research I’ve seen is mixed and suggests the internet could actually decrease aspects of polarization,” he said. This is great stuff. The research is inconclusive, and yet it somehow also supports Facebook’s interests.\n\nThere was one intriguing part of the speech, tucked in the middle. A tacit acknowledgment that Facebook poses a liability to modern society not just because of its political stances or platform policies, but because of its scale. “Inevitably some people will use their voice to organize violence, undermine elections or hurt others, and we have a responsibility to address these risks,” Zuckerberg acknowledged. “When you’re serving billions of people, even if a very small percent cause harm, that can still be a lot of harm.”\n\nAs someone who has listened to a lot of empty Zuckerberg statements over the years, I cannot recall him acknowledging this fact before. Facebook often signals good news in concrete numbers (“millions of users shared the inspiring dog video”) and bad news in percentages (“less than one percent of users were affected by the data breach”). What I cannot recall Facebook acknowledging prior to this is that a tiny percentage of users is still millions of people. When Facebook screws up, even on a proportionally small scale, it warps and endangers millions of people. (In contrast, consider that just a handful of injuries or deaths need to occur for a product recall in the U.S.) The scale of Facebook — billions of people on an improperly maintained, centralized platform — is the problem. I don’t anticipate Zuckerberg giving a speech on that topic anytime soon.\n\nSign Up for the Intelligencer Newsletter Daily news about the politics, business, and technology shaping our world. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "In a speech at Georgetown University, the Facebook CEO gave an overview of First Amendment rights and explained how he thinks about them in regard to Facebook.", "authors": ["Brian Feldman"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/18/18-mark-zuckerberg-georgetown.w1200.h630.jpg", "published_at": "2019-10-18"}