{"pub": "news24", "url": "https://health24.com/Diet-and-nutrition/Low-carb-diets/5-ways-to-tackle-your-carb-cravings-20191004", "downloaded_at": "2019-10-07 06:01:27.180901+00:00", "title": "5 ways to tackle your carb cravings", "language": "en", "text": "5 ways to tackle your carb cravings With so much focus on diets that promote lower carbohydrate intake, we almost feel sinful when we want carbs. But don’t start fighting those cravings just yet…\n\nKeto, Banting, low-carb, gluten-free – with so many terms, trends and diets, it’s easy to regard carbohydrates as the most evil of all foods. But some days, you simply crave a slice of bread, a pizza or a bowl of fries – and you are not alone.\n\nIf carb cravings are killing you, read on…\n\nWhy do we crave carbs in the first place?\n\nOur bodies need carbohydrates for energy. Carbohydrates, which can be in the form of sugars, starch and cellulose, are the biggest source of energy for our bodies.\n\nCarbohydrates provide fuel for our central nervous system and can have a significant effect on our mood and stress levels.\n\nCarbohydrates also trigger serotonin, dopamine and other endorphins in the brain – no wonder you crave a sweet pastry pick-me-up when you're feeling a bit low.\n\nBut if you are not smart about your carbs, you can easily learn to rely on these foods to boost your mood – and you might start making a habit of it.\n\nSo, how do we break this habit? Here are some tips:\n\n1. Choose 'good' carbs\n\nNot all carbohydrates are bad for you, of course. “Bad” carbs are simply those that are devoid of nutrition and are high in sugars and saturated fats (e.g. donuts, pastries, cake and chips). “Good” carbs such as fruit, vegetables, legumes and whole grains are not only packed with beneficial nutrients, but release their energy more slowly, avoiding that dreaded sugar crash.\n\nIf you find yourself craving carbohydrates, don’t simply reach for the obvious choices like bread. Reassess your diet and see if increasing your intake of healthy carbohydrates might help.\n\n2. Satisfy those cravings – with a healthy option\n\nWhen choosing a snack, make sure that it is something that balances healthy carbs, healthy fats and protein. Eat peanut butter on wholegrain crackers, or combine fruit, nuts and plain yogurt.\n\nWe often long for the texture of the unhealthy stuff. If it’s salty crisps you crave, try snacking on a tiny plate of almonds, cut vegetables and a hummus dip.\n\n3. Reduce your general sugar intake\n\n\n\nEating too much sugar will result in your energy spiking and dropping, causing you to crave even more sweet treats. If you rely too heavily on the sweet stuff to curb your cravings, it’s time to make some changes to your habits. A previous Health24 article tackles the topic.\n\n4. Stay hydrated\n\nOur bodies often interpret thirst as hunger. Don’t wait until you are parched until you reach for your water bottle – by that time, you are already dehydrated. When you feel peckish but you know you have recently eaten, first have a sip of water.\n\n5. Don’t get too hungry\n\nDon’t let yourself get ravenously hungry – eat small, frequent meals during the day to avoid becoming so hungry that you reach for the nearest unhealthy food option. We're often not near the kitchen or at our desks where we can keep a variety of healthy snacks. But fruit such as apples and bananas, and small bags of almonds will not immediately spoil in a car and are easy to stash in your bag or briefcase.\n\nImage credit: iStock", "description": "With so much focus on diets that promote lower carbohydrate intake, we almost feel sinful when we want carbs. But don’t start fighting those cravings just yet…", "authors": ["Marelize Wilke"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7752/670842edd02040bd9fb7a013ab0f31f3.jpg", "published_at": "2019-10-07"}