{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/09/21/pope-francis-remembers-21-christians-martyred-on-libyan-beach", "downloaded_at": "2019-10-05 06:04:02.474120+00:00", "title": "Pope Francis Remembers Christians Martyred on Libyan Beach", "language": "en", "text": "ROME — Pope Francis invited the faithful to reflect on Christian persecution this week, recalling the 21 Egyptian Christians whose throats were cut by Islamic State militants on a Libyan beach.\n\n“Martyrs give their lives, they do not hide the fact that they are Christians,” the pope told pilgrims gathered for his General Audience on Wednesday. “Let us remember, some years ago — today there are still many — but we recall four years ago, those Orthodox Coptic Christians, real workers, on the beach in Libya: all of them were slaughtered.”\n\n“But the last word they said was ‘Jesus, Jesus.’ They did not betray their faith, because the Holy Spirit was with them. These are the martyrs of today!” he said.\n\nToday’s martyrs, like the martyrs of the first years of Christianity, are filled with courage by the Holy Spirit, who strengthens them in their witness up to death, Francis said.\n\n“The Apostles did not let themselves be intimidated by anyone. They had an impressive courage!” he recalled, referring to the days after the coming of the Holy Spirit at Pentecost.\n\n“We think of them as cowards because they all ran away, they ran away when Jesus was arrested. But they were transformed from cowards into brave men. Why? Because the Holy Spirit was with them,” he said.\n\n“The same happens to us: if we have the Holy Spirit inside, we will have the courage to move forward, the courage to overcome many struggles, not by ourselves but because of the Spirit that is with us. They did not retreat in their mission as intrepid witnesses of the Risen Jesus, like the martyrs of all times, including our own,” he said.\n\nThe apostles’ determination made the “religious system” of their day tremble, he said, because “it felt threatened and responded with violence and death sentences,” something we still witness today.\n\n“The persecution of Christians is always the same: people who do not want Christianity feel threatened and thus put Christians to death,” he said.\n\nIsraeli Researchers: Turkey's Greek, Armenian, and Assyrian Christians Destroyed by ‘30-year Genocide’ https://t.co/aRjCReVK4W — Breitbart London (@BreitbartLondon) May 19, 2019\n\nThe pope went on to reflect that merely human projects all eventually fail, but God’s projects endure forever.\n\n“Human projects always fail; they have their time, as we do,” he said. “Think of so many political projects, and how they change everywhere, in all countries. Think of the great empires, think of the dictatorships of the last century: they felt very powerful, they thought they dominated the world. And then they all collapsed.”\n\n“Even today, think of today’s empires: they will collapse, if God is not with them, because the strength that men have in themselves is not lasting. Only the strength of God endures,” he continued.\n\n“Let us think of the history of Christians, including the history of the Church, with so many sins, with so many scandals, with so many bad things in these two millennia. And why didn’t it collapse? Because God is there,” he reflected.\n\n“We are sinners, and so often we give scandal. But God is with us,” he said, “and God saves us.”\n\nThe Vanishing: Report Exposes Persecution of Middle East Christians as ‘Close to Genocide’ https://t.co/Ig2NuNoPAr — Breitbart London (@BreitbartLondon) May 3, 2019\n\nFollow @tdwilliamsrome", "description": "Pope Francis reflected on Christian persecution, recalling the 21 Egyptian Christians whose throats were cut by Islamic State militants.", "authors": ["Thomas D. Williams"], "top_image": "https://media.breitbart.com/media/2019/01/Coptic-Christians-Libya-ISISAl-Hayat-Media.jpg", "published_at": "2019-09-21"}