{"pub": "investing.com", "url": "https://za.investing.com/news/commodities-news/preciousgold-pares-gains-after-decent-jobs-data-still-set-for-weekly-gain-1963731", "downloaded_at": "2019-10-04 17:11:16.298989+00:00", "title": "PRECIOUS-Gold pares gains after decent jobs data, still set for weekly gain", "language": "en", "text": "© Reuters. PRECIOUS-Gold pares gains after decent jobs data, still set for weekly gain\n\n* U.S. unemployment rate falls to 3.5% in September\n\n* Platinum on track for biggest weekly decline since May\n\n* Markets await U.S.-China trade talks next week\n\n(Adds comments, details; updates prices)\n\nBy Swati Verma\n\nOct 4 (Reuters) - Gold steadied on Friday, paring earlier gains as bets the U.S. Federal Reserve would cut interest rates aggressively this year were tempered after better-than-expected U.S. jobs data, but bullion was still on track for a weekly gain.\n\nHaving risen for the previous three sessions, spot gold was up 0.1% at $1,506.31 per ounce as of 11:05 a.m. EDT (1505 GMT). Prices are still on track for a weekly gain of about 0.8%.\n\nU.S. job growth increased moderately in September, with the unemployment rate dropping to near a 50-year low of 3.5%, assuaging concerns the slowing economy was on the brink of a recession. were expectations that we might see the worst jobs report and that did not happen. Gold is counting on the Fed cutting more interest rates,\" said Jeffrey Sica, founder and CEO of Circle Squared Alternative Investments.\n\n\"Considering how dismal the other economic numbers were, this jobs report was fairly acceptable. Yesterday, we saw a real strong sentiment towards the Fed lowering interest rates because of the economic weakness and this (jobs data) might have a reverse effect.\"\n\nU.S. short-term interest rate futures traders on Friday pared bets the Federal Reserve would cut rates at both of its two upcoming meetings. Fed is still expected to cut at least once more this year, but the December meeting remains a toss-up. The economy is not falling off a cliff and gold could see some softness, but the overall bullish trend should remain intact,\" Edward Moya, a senior market analyst at OANDA, said in a note.\n\nGold had risen to a one-week high of $1,518.50 per ounce in the previous session. Persistent weakness in global economic indicators on the backdrop of the U.S.-China trade war has led to a 17% rise in bullion prices so far this year.\n\nInvestors will be closely watching the U.S.-China trade talks which resume next week.\n\nOn Friday, White House economic adviser Larry Kudlow said the U.S. team was \"open-minded\" about the outcome of U.S.-China trade talks, which will include deputy-level meetings on Monday and Tuesday, with minister-level meetings Thursday and Friday. gold now there is more of a concern that the trade war is going to get considerably more worse. We made absolutely no progress and investors are losing confidence in U.S. and China making a deal,\" Sica said.\n\n\"As result of that, investors are buying gold in anticipation of more chaos.\"\n\nElsewhere, platinum fell 1.5% to $876.79 an ounce and was down over 5% this week, on track for its biggest weekly decline since May.\n\nSilver eased 0.2% to $17.52, and palladium climbed 1.7% to $1,681.06.", "description": "PRECIOUS-Gold pares gains after decent jobs data, still set for weekly gain", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA5T0CX_L.jpg", "published_at": "2019-10-04"}