{"pub": "reuters", "url": "https://ca.reuters.com/article/technologyNews/idCAKBN1WP2I1-OCATC", "downloaded_at": "2019-10-10 19:02:23.591713+00:00", "title": "Google secures two Android phone makers' backing in fight against EU antitrust order", "language": "en", "text": "FILE PHOTO: The logo of Google is seen at the high profile startups and high tech leaders gathering, Viva Tech,in Paris, France May 16, 2019. REUTERS/Charles Platiau\n\nBRUSSELS (Reuters) - Alphabet (GOOGL.O) unit Google’s fight against a record EU antitrust fine related to its Android mobile software received a boost after Europe’s second-highest court allowed Android phone maker Gigaset and HMD Global Oy to intervene in the lawsuit.\n\nGoogle is challenging the European Commission’s 4.34 billion euro ($4.8 billion) fine and an order to drop anti-competitive business practices aimed at blocking rivals in internet browsing at the Luxembourg-based General Court.\n\nThe EU competition enforcer in its 2018 ruling said Google gave itself an unfair advantage by pre-installing its Chrome browser and Google search app on Android smartphones and notebooks.\n\nGermany’s Gigaset Communications GmbH (GGS.DE) and Finland’s HMD Global Oy, which is the exclusive licensee of the Nokia brand for phones, can take part in the process in support of Google, the court said in a document published on Thursday.\n\nJudges also allowed tech lobbying group Application Developers Alliance, web browser Opera Software and the Computer and Communications Industry Association, which counts Google among its members, to intervene.\n\nCommission supporters allowed to intervene are the European Consumer Organisation, lobbying group FairSearch whose complaint triggered the EU case, Czech search engine Seznam, French search engine Qwant and two German publishing groups, VDZ and BDZV.\n\nCourt proceedings are expected to start next year. The case is T-604/18 Google vs European Commission.", "description": "Alphabet unit Google's fight against a record EU antitrust fine related to its Android mobile software received a boost after Europe's second-highest court allowed Android phone maker Gigaset and HMD Global Oy to intervene in the lawsuit.", "authors": ["Foo Yun Chee", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439341103&w=1200&r=LYNXMPEF991Q3-OCATC", "published_at": "2019-10-10"}