{"pub": "japantoday", "url": "https://japantoday.com/category/rugby-world-cup-2019/tragedy-injury-and-rugby-world-cup-for-all-blacks-lock-retallick", "downloaded_at": "2019-10-05 22:08:25.669492+00:00", "title": "Tragedy, injury and Rugby World Cup for All Blacks lock Retallick", "language": "en", "text": "By Talek HARRIS\n\nBrodie Retallick has faced unhappy times since winning the 2015 Rugby World Cup but the All Blacks lynchpin will make a timely return from injury on Sunday as New Zealand close in on the quarterfinals.\n\nRetallick, one of the last pieces of the jigsaw for coach Steve Hansen, will slot back into the second row alongside his old partner Sam Whitelock for their 52nd Test start together -- a Pool B mismatch against Namibia in Tokyo.\n\nThe expected bonus-point win -- even with an experimental line-up, with Jordie Barrett making his first start at fly-half -- will put the two-time defending champions on the verge of the last eight.\n\nSuch is the importance of Retallick, the 2014 World Player of the Year, that Hansen was prepared to do without him in New Zealand's early games, knowing he would be unavailable as he recovered after dislocating his left shoulder in July.\n\nThat gruesome injury, sustained in the 16-16 Rugby Championship draw with South Africa in Wellington, came after the Chiefs lock spent two months out with a wrist problem until June.\n\nHowever, injuries are comparatively low hurdles for Retallick, who suffered the pain of losing his unborn son to a miscarriage in 2017.\n\nHansen saluted the resilience of the 2.04-meter Retallick, 28, in recovering from the latest setback which threw his World Cup preparations into disarray.\n\n\"He has come back from injuries and personal tragedy in the past so he knows how to go about doing that,\" Hansen said. \"There is no doubting his work ethic, you see it when he plays and it is just an extension of that.\"\n\nRetallick admitted he was \"pretty nervous\" about his comeback, which comes ahead of schedule as he was initially only expected to return in the quarterfinals.\n\n\"I obviously want to push my case moving into the tournament by getting some game time -- it's been 10 weeks since the injury happened,\" he said. \"I'm definitely looking forward to getting out there. Although you can do a lot of running, which we have been doing, nothing compares to match fitness, so it'll be good to get some game time under the belt.\"\n\nBehind Retallick and the pack will stand makeshift fly-half Jordie Barrett, the youngest of the All Blacks' three Barrett brothers who will try out as cover for regular 10s Richie Mo'unga and his eldest sibling, Beauden.\n\nJordie Barrett, 22, has been thrown in the deep end, after being given only two days to practise at fly-half -- where he hasn't started a game since university.\n\n\"He has been doing a lot of what we have been doing at training anyway but he has not necessarily run at 10 prior to this morning,\" Hansen said on Friday.\n\n\"He has plenty of swagger. He's not short of it. I don't think you can mistake swagger or confidence with arrogance,\" he added.\n\nAsked what adjustments he had to make in the short time available, Jordie Barrett said: \"I guess there's a few but, within our game plan, the 15 often performs a 10 role in our phase play. \"So it's more just set piece and little things, timings I'll have to equip myself with over the next 48 hours so I can perform them on Sunday.\"\n\n© 2019 AFP", "description": "Brodie Retallick has faced unhappy times since winning the 2015 Rugby World Cup but the All Blacks lynchpin will make a timely return from injury on Sunday as New Zealand close in on the quarterfinals. Retallick, one of the last pieces of the jigsaw for coach Steve Hansen, will slot…", "authors": [], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/00/94/5c1d6124282bdca4f072925dd96d3e33f2a3/00945c1d6124282bdca4f072925dd96d3e33f2a3.jpg", "published_at": "2019-10-05"}