{"pub": "investingcom", "url": "https://investing.com/news/stock-market-news/auto-union-digs-in-for-gm-strike-over-pay-and-benefits-1978511#comments", "downloaded_at": "2019-09-16 13:03:31.712455+00:00", "title": "Auto Union Digs In for GM Strike Over Pay and Benefits", "language": "en", "text": "(Bloomberg) -- The United Auto Workers union is leading its first strike against General Motors Co (NYSE: ). in 12 years, digging in for a fight over jobs and benefits that could cost the carmaker dearly for an indefinite period.\n\nThe strike that took effect at midnight may cost GM about $50 million a day in earnings before interest and taxes due to lost production, Dan Levy, an analyst at Credit Suisse (SIX: ), said Sunday. The shares fell 3.2% in pre-market trading on Monday.\n\nWhile GM touted an offer to invest in plants across the U.S. and boost wages and benefits, UAW leadership has been rocked by a corruption scandal and needs to show willingness to bring the fight to an automaker that’s been scaling back its workforce.\n\n“The union is playing some hardball. It seems they are pretty far apart,” said Kristin Dziczek, vice president of the labor and economics group at the Center for Automotive Research. GM’s offer “still doesn’t address some of the union’s demands.”\n\nGM has offered $7 billion of investment in eight U.S. plants and more than 5,400 additional jobs, most of which would be new hires. But the union said GM’s proposal fell short in key areas including health care, use of temporary workers and the length of time it takes for shorter-tenured members to get to top-scale pay.\n\nThe union is seeking pay raises for entry-level workers, who currently start at less than $20 an hour, and to get them to the peak wage of almost $30 an hour in three or four years, instead of the current period of eight years.\n\n“Going into this bargaining season, our members have been very clear about what they will and will not accept from this contract,” UAW Vice President Terry Dittes said at a press conference on Sunday. “We are standing up for fair wages, we are standing up for affordable, quality health care. We are standing up for our share of the profits. We are standing up for job security for our members.”\n\nTemporary employees and those working their way up the pay scale are doing the same work for less compensation, said Ted Krumm, the head of the union’s bargaining committee. “We are fighting for the future of the middle class,” he said.\n\nGM’s Offer\n\nGM countered that it made the union a generous offer to invest in factories in four states, including a new vehicle in the Detroit-Hamtramck sedan plant that had been slated to end production in January.\n\nIn Lordstown, Ohio, where GM has idled the factory that once had three shifts of workers making Chevrolet Cruze compact cars, the automaker plans to set up the first union-represented electric-car battery plant in the U.S. There are also four electric trucks coming that other UAW plants will build.\n\nGM offered workers a signing bonus of $8,000 per member if they ratify the deal, plus wage gains or lump-sum payments in all four years of the contract. The carmaker says it’s offering to keep members’ health-care contributions the same as in the current contract.\n\n“What GM is doing is highly unusual,” said Harley Shaiken, labor professor at the University of California at Berkeley. “It’s going over the head of the UAW leadership and seeking to address the members and the public more generally. That is a highly risky strategy. It tends to galvanize the membership in support of the leadership and complicates an already tough situation.”\n\nImplicated President\n\nBefore the two sides held talks over the weekend, the UAW was distracted by federal corruption charges against leaders in a scandal implicating the union’s president, Gary Jones. While the UAW’s executive board met on Friday and discussed whether to remove him from the role, he has kept his job, a union spokesman said.\n\nJones didn’t attend the press conference but was quoted in the union’s statement that called the strike.\n\n“We told UAW GM members that we would stand up for them and their future,” Jones said in the statement.\n\nThe walkout will be just the second national work stoppage at GM since a 67-day strike in 1970. GM did have a 54-day strike at a key plant in Flint, Michigan, in 1998 that effectively shut down most of its assembly plants.\n\nThe impact of the latest strike on the U.S. economy will be negligible compared with 49 years ago, when the 400,000 workers GM employed at the time represented about 1.2% of the national payroll. The automaker now has about one-tenth the number of union-represented U.S. employees.\n\nAny deal the UAW reaches with GM would set a precedent for the jobs, wages, benefits that the union demands from Ford Motor (NYSE: ) Co. and Fiat Chrysler Automobiles NV. The union hasn’t said which carmaker it will target next for bargaining over a new contract.\n\nGM has been under attack by President Donald Trump for shrinking its U.S. workforce and idling plants in the key electoral battleground states of Michigan and Ohio. On Sunday, he sent a tweet calling for the carmaker and union to “make a deal.”", "description": "Auto Union Digs In for GM Strike Over Pay and Benefits", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/picdbda3c3ba3c74ead31e6620331e1f946.jpg", "published_at": "2019-09-16"}