{"pub": "npr", "url": "https://npr.org/2019/10/04/767445740/tesla-smart-summon-software-under-government-scrutiny-for-possible-safety-proble", "downloaded_at": "2019-10-05 04:49:38.652442+00:00", "title": "Tesla 'Smart Summon' Software Under Government Scrutiny For Possible Safety Problems", "language": "en", "text": "Tesla 'Smart Summon' Software Under Government Scrutiny For Possible Safety Problems\n\nEnlarge this image toggle caption Parth Dhebar via Reuters Parth Dhebar via Reuters\n\nA new feature for Tesla cars that allows drivers to remotely summon their parked autos is drawing scrutiny from government regulators after reports of malfunctioning software.\n\nThe National Highway Traffic Safety Administration, in a statement issued Wednesday, said that is aware of the reports that \"Smart Summon\" does not always work as promised and is in ongoing contact with the company.\n\nBut the agency did not open a formal investigation.\n\n\"The agency will not hesitate to act if it finds evidence of a safety-related defect,\" the statement read as quoted by Reuters.\n\nThe Smart Summon feature was part of a software update released last week by Tesla which said that customers \"can enable their car to navigate a parking lot and come to them or their destination of choice, as long as their car is within their line of sight.\"\n\nA driver using a smartphone app can summon the car from 200 feet away. The car will stop when the app's button is released.\n\nThe company said that drivers \"must remain responsible for the car and monitor it and its surroundings at all times.\"\n\nThe promotional video on the company's website shows a driverless car seemingly headed the wrong way in a parking lot. Videos spread on social media suggested other problems.\n\nOne \"driver\" using Smart Summon tweeted video of his Tesla nearly colliding with another car in a parking lot. Another showed the car not noticing a curb.\n\nThe new software also has its supporters who love the new feature.\n\nNo injuries related to Smart Summon have been reported and no jurisdiction has barred its use, according to The Los Angeles Times. The paper also reports that the California Department of Motor Vehicles has determined that Smart Summon and Tesla's robot systems do not amount to \"autonomous technology\" because the car is still being controlled by the operator holding the smartphone.\n\nNeither the NHTSA nor Tesla responded to emailed requests for comment.", "description": "The new software ignited a storm of social media videos demonstrating the utility and flaws of a feature that allows drivers to summon their driver-less cars.", "authors": ["Richard Gonzales"], "top_image": "https://media.npr.org/assets/img/2019/10/04/rtx75tty_wide-549e103127606162e2126b64607d2d0d16efb7cb.jpg?s=1400", "published_at": "2019-10-04"}