{"pub": "independent", "url": "https://independent.co.uk/sport/cricket/ashes/ashes-2019-david-warner-kevin-pietersen-batting-steve-smith-advice-quotes-comments-scores-latest-a9106166.html", "downloaded_at": "2019-09-15 14:27:41.703461+00:00", "title": "Ashes 2019: David Warner offered batting advice by Kevin Pietersen after ‘career-threatening’ series", "language": "en", "text": "Former England batsman Kevin Pietersen has taken to Twitter to offer Australia’s David Warner some batting advice, which the South African-born maverick believes could be career-saving.\n\nWarner has endured a torrid time in this year’s Ashes as an opener in Australia’s batting order, becoming the first cricketer in Test history to be dismissed for a single-digit score eight times in one series.\n\nThe 32-year-old finished his final innings of this year’s series with 11 runs on Sunday morning, leading Pietersen to weigh in on Warner’s sub-par performances.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“Watch[ed] Warner’s innings earlier,” Pietersen wrote on Twitter.\n\n“If he doesn’t learn very quickly to come forward and hit the ball straight back at the stumps and score straight through mid-wicket, it’s a HUGE problem and potentially Test career-threatening!”\n\nShape Created with Sketch. Fifth Ashes Test in pictures Show all 21 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Fifth Ashes Test in pictures 1/21 England vs Australia England Joe Root tosses the coin Getty Images 2/21 England vs Australia Australia's Pat Cummins appeals unsuccessfully AP 3/21 England vs Australia Australia's Pat Cummins (L) celebrates with teammates AFP/Getty Images 4/21 England vs Australia Ben Stokes bats Action Images via Reuters 5/21 England vs Australia England's captain Joe Root reacts after losing his wicket AFP/Getty Images 6/21 England vs Australia England's Joe Root reacts after losing his wicket Action Images via Reuters 7/21 England vs Australia Australia's Mitchell Marsh celebrates taking the wicket of England's Sam Curran Action Images via Reuters 8/21 England vs Australia Sam Curran walks off after being caught by Australia's Steve Smith Action Images via Reuters 9/21 England vs Australia Marnus Labuschagne attempts to stop a boundary Action Images via Reuters 10/21 England vs Australia England's Jos Buttler hits a six AFP/Getty Images 11/21 England vs Australia England's Jos Buttler raises his bat PA 12/21 England vs Australia Australia's David Warner in action Action Images via Reuters 13/21 England vs Australia Steve Smith of Australia bats Getty Images 14/21 England vs Australia Australia's David Warner leaves the pitch AP 15/21 England vs Australia A packed out Oval watches on as England build a lead on day three Getty Images 16/21 England vs Australia Joe Root has little sympathy as Joe Denly takes one in a painful area Getty Images 17/21 England vs Australia Switcheroo - Ben Stokes reverse sweeps effectively Getty Images 18/21 England vs Australia Joe Denly raises his bat after making fifty Getty Images 19/21 England vs Australia Joe Denly salutes the crowd after falling six short of a maiden Test ton Getty Images for Surrey CCC 20/21 England vs Australia Jos Buttler has his eyes on the ball AFP/Getty Images 21/21 England vs Australia Steve Smith magnificently catches Chris Woakes Getty Images 1/21 England vs Australia England Joe Root tosses the coin Getty Images 2/21 England vs Australia Australia's Pat Cummins appeals unsuccessfully AP 3/21 England vs Australia Australia's Pat Cummins (L) celebrates with teammates AFP/Getty Images 4/21 England vs Australia Ben Stokes bats Action Images via Reuters 5/21 England vs Australia England's captain Joe Root reacts after losing his wicket AFP/Getty Images 6/21 England vs Australia England's Joe Root reacts after losing his wicket Action Images via Reuters 7/21 England vs Australia Australia's Mitchell Marsh celebrates taking the wicket of England's Sam Curran Action Images via Reuters 8/21 England vs Australia Sam Curran walks off after being caught by Australia's Steve Smith Action Images via Reuters 9/21 England vs Australia Marnus Labuschagne attempts to stop a boundary Action Images via Reuters 10/21 England vs Australia England's Jos Buttler hits a six AFP/Getty Images 11/21 England vs Australia England's Jos Buttler raises his bat PA 12/21 England vs Australia Australia's David Warner in action Action Images via Reuters 13/21 England vs Australia Steve Smith of Australia bats Getty Images 14/21 England vs Australia Australia's David Warner leaves the pitch AP 15/21 England vs Australia A packed out Oval watches on as England build a lead on day three Getty Images 16/21 England vs Australia Joe Root has little sympathy as Joe Denly takes one in a painful area Getty Images 17/21 England vs Australia Switcheroo - Ben Stokes reverse sweeps effectively Getty Images 18/21 England vs Australia Joe Denly raises his bat after making fifty Getty Images 19/21 England vs Australia Joe Denly salutes the crowd after falling six short of a maiden Test ton Getty Images for Surrey CCC 20/21 England vs Australia Jos Buttler has his eyes on the ball AFP/Getty Images 21/21 England vs Australia Steve Smith magnificently catches Chris Woakes Getty Images\n\nPietersen represented England between 2004 and 2014, scoring 8,181 runs in 104 Test matches.\n\nBefore the start of this year’s fifth Ashes Test the 39-year-old criticised England’s Jack Leach for “not doing his job” and becoming a “laughing stock”.\n\nLeach, a spin bowler, earned adoration from England fans for his role in Ben Stokes’ miraculous third-Test stand at Headingley, but Pietersen was unimpressed by Leach’s deliveries.\n\nAustralia’s victory at Old Trafford in the fourth Test ensured they will retain the urn, regardless of the result of the final Test.", "description": "Former England batsman Kevin Pietersen has taken to Twitter to offer Australia’s David Warner some batting advice, which the South African-born maverick believes could be career-saving. Warner has endured a torrid time in this year’s Ashes as an opener in Australia’s batting order, becoming the first cricketer in Test history to be dismissed for a single-digit score eight", "authors": ["Alex Pattle"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/05/07/1172167911.jpg", "published_at": "2019-09-15"}