{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7554057/Coleen-Rooney-Rebekah-Vardy-FEUD-Wayne-Rooney-WARNED-Jamie-Vardy-wifes-behaviour.html", "downloaded_at": "2019-10-09 12:08:54.003934+00:00", "title": "Coleen Rooney and Rebekah Vardy FEUD: Wayne Rooney 'WARNED Jamie Vardy about his wife's behaviour", "language": "en", "text": "Wayne Rooney reportedly warned England teammate Jamie Vardy about his wife Rebekah's behavior during Euro 2016 - as Coleen Rooney accused the pregnant WAG of selling stories on her in a extraordinary Twitter rant.\n\nRecently unearthed claims in The Times suggested that Rooney, 33 had private talks with Vardy, 32, and allegedly told him to ensure Rebekah didn't distract the team's campaign with her social media posts.\n\nRebekah who wrote a newspaper column during the championship, slammed French police in a tweet, saying: 'That has to be up there with the worst experience EVER at an away game! Teargassed for no reason, caged and treated like animals! Shocking!'\n\nThrowback: Wayne Rooney reportedly warned England teammate Jamie Vardy about his wife Rebekah's behavior during Euro 2016 (above during the tournament)- as Coleen Rooney accused the pregnant WAG of selling stories on her\n\nClaim: On Wednesday, Coleen admitted she has been planting false Instagram stories on her private page and blocking all her other friends to prove that Rebekah, 37, was the guilty party (pictured 2017)\n\nRumours of a rift between Wayne and Jamie were later denied by then England manager Roy Hodgson.\n\nAsked about a feud he said: 'I haven't got a clue what you are referring to. There are absolutely no problems in football terms between Wayne Rooney and Jamie Vardy.\n\n'In fact quite the reverse, they are very close friends, both on the field and off the field. I have got no idea what you are referring to\n\n'I certainly would advise Wayne to give no comment to it because it is obviously one salacious story that someone has managed to spin. It is of no interest to us.'\n\nWord: Recently unearthed claims in The Times suggested that Rooney, 33 had private talks with Vardy, 32, and allegedly told him to ensure Rebekah didn't distract the team's campaign with her social media posts (pictured 2016)\n\nMailOnline has contacted representatives for Wayne Rooney and Jamie Vardy for comment.\n\nThe unearthed claims come after Coleen took to social media to accuse her pregnant friend Rebekah Vardy of selling stories on her private life in an extraordinary rant.\n\nColeen, 33, revealed she had been suspecting that someone had been betraying her and that she thought of a plan to find out who it was.\n\nShe admitted she has been planting false Instagram stories on her private page and blocking all her other friends to prove that Rebekah, 32, was the guilty party.\n\nOutspoken: Rebekah who wrote a newspaper column during the championship, slammed French police in a tweet (pictured 2018)\n\nPals: Rumours of a rift between Wayne and Jamie were later denied by then England manager Roy Hodgson (pictured June 2016)\n\nShe admitted that stories about her basement flooding, returning to TV and gender selection were only viewed by Rebekah and these were subsequently followed by media outlets.\n\nThe Sun has since removed their story about Coleen's basement flooding after discovering she had made it up.\n\nRebekah is currently on holiday in Dubai.\n\nColeen wrote: 'For a few years now someone who I trusted to follow me on my personal Instagram account has been consistently informing The Sun newspaper of my private posts and stories.\n\n'There has been so much information given to them about me, my friends and my family - all without my permission or knowledge.\n\nThe full statement: Coleen made these claims on social media after discovering she had been betrayed by someone close to her and wrote that it was Rebekah Vardy\n\n'After a long time of trying to figure out who it could be, for various reasons, I had a suspicion.\n\n'To try and prove this, I came up with an idea, I blocked everyone from viewing Instagram except ONE account. '\n\nShe continued: '(Those on my private account must have been wondering why I haven't had stories on there for a while).\n\n'Over the past five months I have posted a series of false stories to see if they made their way into the Sun newspaper.\n\n'And you know what, they did! The story about gender selection in Mexico, the story about returning to TV and then the latest story about the basement flood in my new house.\n\n'It's been tough keeping it to myself and not making any comment at all, especially when the stories have been leaked, however I had to. Now I know for certain which account/individual it's come from.\n\n'I don't need the money': Rebekah Vardy denied all accusations against her minutes after the post and said she had nothing to gain and had no financial motivation\n\nBetrayal: Coleen and Rebekah have been close friends for years - they were pictured together at the England vs Wales game in France\n\n'I have saved and screenshotted all the original stories which clearly show just one person has viewed them.\n\n'It's......... Rebekah Vardy's account.'\n\nShe also wrote: 'This has been a burden in my life for a few years now and finally I have got to the bottom of it......'\n\nRebekah hit back minutes later on social media and denied the accusations.\n\nAbout to share that post: Coleen was pictured before the news broke as she headed out to the cash machine in Alderley Edge on Wednesday\n\nShe wrote: 'Can't believe I'm even having to write this. I'm pregnant & on holiday & am at a loss to why she would do this.\n\n'I'm now having to take legal advice as I can't deal with this stress myself when I'm this pregnant. I'm now having to take legal advice as I can't deal with this stress myself when I'm this pregnant.'\n\nShe also shared: 'As I have just said to you on the phone, I wish you had called me if you thought this.\n\n'I never speak to anyone about you as various journalists who have asked me to over the years can vouch for.\n\n'If you thought this was happening you can could have told me & I could have changed my passwords to see if it stopped.'\n\nShe continued: 'Over the years various people have had access to my insta & just this week I found I was following people I didn't know and have never followed myself.\n\n'I'm not being funny but I don't need the money, what would I gain from selling stories on you?\n\n'I liked you a lot Coleen & I'm so upset that you have chosen to do this especially when I'm heavily pregnant.\n\n'I'm disgusted that I'm even having to deny this. You should have called me the first time this happened [broken heart emoji].'", "description": "Wayne Rooney reportedly warned Jamie Vardy about his wife Rebekah's behavior during Euro 2016 - as Coleen Rooney accused the WAG of selling stories on her in a extraordinary Twitter rant.", "authors": ["Eve Buckland", "Rebecca Davison For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/11/19486468-0-image-a-29_1570617794801.jpg", "published_at": "2019-10-09"}