{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7541961/The-Pompeii-World-War-Remains-110-soldiers-Belgian-field.html", "downloaded_at": "2019-10-05 23:04:38.663257+00:00", "title": "The Pompeii of the First World War: Remains of 110 soldiers are found in a Belgian field", "language": "en", "text": "This week more than 80 soldiers who perished during the Great War will finally be laid to rest with full military honours close to where they fell on the Western Front.\n\nThese burials, including those of 13 British soldiers who were killed more than a century ago, are the result of one of the most extraordinary archaeological discoveries of modern times.\n\nIt is a project that has yielded what the lead archaeologist on the dig describes as 'the First World War's Pompeii': an unprecedented snapshot of life on the front line from 1914 to 1918.\n\nIn fact, this rich historical find would have been lost for ever were it not for the determination of a passionate young Belgian archaeologist and his supporters, who organised a unique crowdfunding project to raise the money needed to carry out the dig on a site in Belgium little bigger than two football pitches.\n\nLord Ashcroft examines artefacts recovered from the Dig Hill 80 site in Belgium. The historical find is an unprecedented snapshot of life on the front line from 1914 to 1918\n\nThis is believed to be the first time crowdfunding has been used to pay for a wartime archaeological dig.\n\nIn the event, the scale of the discoveries from the 'Dig Hill 80' project surpassed even the archaeologists' wildest expectations: the human remains from an estimated 110 soldiers and thousands of artefacts.\n\nJust days ahead of the burials of most of these servicemen in Belgium on Thursday and Friday, I was given an exclusive insight into the secrets that the dig has yielded from Simon Verdegem, the lead archaeologist on the project.\n\nAt his first-floor office on the outskirts of the Flemish city of Bruges, Verdegem pointed to rifles, revolvers, bullets, helmets, uniforms, buttons, belt buckles and other artefacts from the dig, as well as more personal items such as watches, toothbrushes, water bottles, cooking utensils and a harmonica.\n\nEach artefact, or small group of artefacts, has been numbered from 1 to 3,300 by the discovery team.\n\nVerdegem, 36, a father-of-three, even showed me a perfectly preserved HP Sauce glass bottle that had clearly been brought to the front line by a British soldier, perhaps keen to disguise the grim taste of war-time rations.\n\nEach artefact, or small group of artefacts, has been numbered from 1 to 3,300 by the discovery team. Pictured: a pistol flare gun and medals\n\nThe original recipe of HP Sauce was invented and developed by Frederick Garton, a grocer from Nottingham, who first registered the name in 1895.\n\nHe got the initials HP from the Houses of Parliament, where he heard there was a restaurant that had started serving the brown sauce. By the outbreak of the Great War, the product was available countrywide.\n\nVerdegem, who specialises in battlefield sites, told me that part of his motivation for wanting to recover the bodies of fallen soldiers was a moving quote from a German lieutenant who served in the Great War.\n\nThe officer had written: 'The men don't fear death any more, we have made our peace with the thought of our own demise. A much heavier burden is the fear to be forgotten in foreign soil – an inglorious end for any soldier.\n\nLord Ashcroft holds a British standard issue water bottle that was unearthed during the project\n\nSwallowed by the earth, a long way from the Heimat [homeland], without a sign of remembrance, separated from one's comrades and the bereaved in the Heimat. Being forgotten – such a fate no one wishes for.'\n\nIt is a quote that Verdegem cites whenever critics of archaeologists or the Commonwealth War Graves Commission (CWGC) say that it is 'wrong' to dig up the remains of Great War soldiers and that they should be left undisturbed in the ground.\n\nVerdegem said he was deeply moved by his experiences. 'It's not when you are in the field, then you are in work mode. But driving home I always think of the human cost of war and feel very sad.'\n\nThe site that yielded the Dig Hill 80 discoveries is situated on a ridge on the outskirts of the Belgian village of Wytschaete (also spelled Wijtschate): British soldiers, struggling to pronounce it, incorrectly called it 'Whitesheet', just as they crudely renamed the Belgian city of Ypres 'Wipers' for the same reason.\n\nThis perfectly preserved HP Sauce glass bottle had clearly been brought to the front line by a British soldier, perhaps keen to disguise the grim taste of war-time rations\n\nThe site first became of interest in recent times in the spring of 2015 when developers, who were planning to build 29 new houses, called in Ruben Willaert, the archaeology company that employs Verdegem, to examine the area – a requirement under Belgian law for former frontline locations.\n\nAerial photos taken during the war suggested to Verdegem that the area would be of interest to archaeologists and a process of 'trial trenching', which saw a dozen small trenches dug by an excavator, soon discovered the remains of one British and three German soldiers.\n\nThe way the Germans were lying in a row also suggested they might be part of a mass grave, and the trial also indicated the presence of trench walls and many artefacts.\n\n'It was an exciting moment,' Verdegem told me. 'We realised there was something beneath the ground that was likely to be extraordinary.'\n\nOnce he had written up a report on his findings, the government put the building project on 'hold', but the planned dig was so substantial that it was estimated more than £150,000 – and possibly as much as £200,000 – was needed to proceed.\n\nHistorian and television presenter Dan Snow and the comedian Al Murray were among those to promote the crowdfunding.\n\nEventually, €178,000 (£162,000) was raised with hundreds of people from more than 40 countries donating to enable the dig to start in April 2018.\n\nIt eventually finished in mid-July last year after 60 days were spent working at the site. Verdegem was present on each of these days, regularly putting in 14-to 16-hour shifts.\n\nFive Flemish archaeologists worked with 50 volunteer archaeologists over the two months of the dig, while nearly 100 volunteers, with no expertise, spent up to a week with the professionals.\n\nThe volunteers, including many Britons, worked with trowels to uncover artefacts but they had to leave human-remains recovery to the experts.\n\nFurthermore, if they found suspected weapons or ammunition – particularly hand grenades – they were instructed to alert an explosives expert immediately.\n\n'Within the first 15 minutes we found a skull and then it went on from there,' said Verdegem.\n\n'By the end of the second week, we had 50 locations with human remains and that number went up and up. We had one mass grave with 25 Germans and another with ten to 15 Germans. In the end we had 135 locations with human remains and a minimum number of individuals was 110.'\n\nThousands of photographs and drawings were made of the site so that archaeologists would know the precise location of each human bone or artefact that was discovered.\n\nPottery (pictured) was also found at the site. Under Flemish law, the artefacts found belong to the owners of the land they were discovered on, but they have to preserve them for ever and keep them safe\n\nArchaeologists cleaned the bones before handing them to anthropologists and other experts, including those from the CWGC in the case of suspected British and other Commonwealth soldiers.\n\nBones were analysed and other clues, including uniforms, boots and weapons, were studied in an attempt to identify the nationalities of the soldiers.\n\nJust occasionally, ID discs, or even gallantry and service medals, can help to identify a soldier by name. If there is a reasonable chance of such a discovery, the relatives of a soldier are asked to provide DNA to prove a dead soldier's identity.\n\nExperts eventually concluded that the remains belonged to 73 German soldiers, 13 British soldiers, three French and one South African. The remains of more than 20 men could not be identified, even by nationality. None of the 13 British soldiers could be identified by name.\n\nThe discovery of the results of brutal frontline battles – described as 'hell on Earth' by one expert – included the skeletons of soldiers aged as young as 16 as well as veteran soldiers in their 40s.\n\nThe archaeologists had to give all the human bones to Belgian police who, in turn, allocated them to the CWGC or relevant organisation depending on the suspected nationality.\n\nThe German army had invaded Belgium in August 1914 and the ridge soon became a key defensive position. Most of the remains found were from soldiers killed during the First Battle of Ypres, which lasted just over a month from October to November 1914.\n\nThe majority of those who perished were German soldiers killed by Allied shell fire. At the time of the battle, they were men in their prime buried with little or no ceremony where they fell.\n\nIn fact, it was not until June 1917, at the Battle of Messines, that the Allies finally gained the key high point, only to lose it once again to the Germans in another battle the following year.\n\nAs the position was held by the German and Allied armies at different times, it explains why there are artefacts from soldiers from both sides.\n\nWhen the guns finally fell silent in November 1918, the Wytschaete battlefield was forgotten and covered with earth. It then lay undisturbed for nearly a century.\n\nProfessor Peter Doyle, a joint founder of Dig Hill 80 and a historian at South Bank University in London, shares the view that it is right to dig up the remains of soldiers so they can be reburied.\n\n'When you look at these mass graves and think of these young men, you know they had a mother and father who missed them. Yet they have never been given peace,' he said.\n\nUnder Flemish law, the artefacts found belong to the owners of the land they were discovered on, but they have to preserve them for ever and keep them safe. In practice, this means most of the finds are handed over to the regional archaeological centres.\n\nBullets and shell cases that were found as part of the dig. The site that yielded the Dig Hill 80 discoveries is situated on a ridge on the outskirts of the Belgian village of Wytschaete\n\nDuring my recent visit to the former Western Front, I also visited the French headquarters of the CWGC at Beaurains, near Arras – home to its new visitor centre, The CWGC Experience.\n\nThe organisation, which preserves 23,000 cemeteries and memorials in more than 150 countries, also seeks to identify those Commonwealth servicemen from both world wars whose remains are discovered long after they perished.\n\nEven now, typically each year the remains of some 40 Commonwealth soldiers are found in France and about half that number in neighbouring Belgium.\n\nThey are largely the result of chance finds: perhaps a farmer ploughing a field, a builder digging foundations for a new property, the construction of a new road or the de-mining of areas on or close to the former front line.\n\nRecovery teams operate 24/7 and, after reacting within an hour, they try to recover – within a day – all human remains and any clues that might eventually lead to a soldier's identity.\n\n'We cordon off the area and then we look for artefacts that are associated with a certain country – boots, badges, buttons, belt buckles, webbing equipment and weapons that will point to whether they are Commonwealth, French or German.\n\nWe are also looking for shoulder titles, which will point to a particular regiment,' said Steve Arnold, who is in charge of the human remains unit and who has worked on the Dig Hill 80 and other sites.\n\nArnold, 51, who has worked for the CWGC since he was 17, said: 'If we can eventually put a name to someone's remains, then that's the perfect scenario, but we realise that is very hard.\n\nWhether the soldier is identified or not, he will be buried, with dignity, in a cemetery and that's the best place for him, so that he is laid to rest with his old mates.'\n\nThe CWGC also liaises with the Ministry of Defence's Joint Casualty and Compassionate Centre (JCCC), which, in turn, works with anthropologists, genealogists and DNA experts to try to identify missing soldiers.\n\nRobin Schäfer, a joint founder of Dig Hill 80 and German military historian specialising in the Great War, led the research on the German soldiers whose remains were found.\n\nOne soldier was eventually officially identified from his 'dog tag' (ID disc), which contained limited information, and Schäfer is convinced he knows the name of another fallen serviceman.\n\nThe officially identified soldier was War Volunteer (the equivalent of private) Albert Oehrle, who was only 17 when he was killed. Originally from Bavaria, he had been working as a gardener until the outbreak of war, when he volunteered to fight for 'the Fatherland'.\n\nThe remains of Oehrle and 72 comrades will be buried in the German war cemetery at Langemark in West Flanders.\n\nSchäfer said his work was ongoing and he still expects interesting new revelations. 'From a historical and archaeological perspective, Hill 80 formed a unique and untouched microcosm where the whole course of the war, in all its phases, left its traces in the ground,' he told me.\n\nHe said of the project: 'It has showed what people from all over the world can achieve when they work together.\n\nIn the case of Hill 80, this work was conducted on a site where 100 years before the ancestors of those people did their utmost to kill one another.' He described the archaeological and research work as 'a moving, humbling and healing experience'.\n\nOn Thursday, the Last Post will ring out at the CWGC's Wytschaete Military Cemetery, four miles south of Ypres, which is already the resting place of more than 1,000 Commonwealth servicemen.\n\nEach of the British soldiers found at the Hill 80 site will have a coffin and a marked grave. The moving ceremony is likely to be attended by at least 100 mourners.\n\nNeither this burial for 13 British soldiers nor the one that will take place the next day for 73 German soldiers – the three French and one South African soldiers will be buried in separate official ceremonies – could have happened were it not for the painstaking work that enabled the site at Dig Hill 80 to give up the remarkable secrets it kept for a century.", "description": "The scale of discoveries from the 'Dig Hill 80' project surpassed even the archaeologists' wildest expectations. The site is situated on a ridge on the outskirts of the Belgian village of Wytschaete.", "authors": ["Lord Ashcroft For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/23/19345140-0-image-a-35_1570313855358.jpg", "published_at": "2019-10-05"}