{"pub": "axios", "url": "https://link.axios.com/trump-administration-sunday-shows-impeachment-c10c6dde-9211-4c1a-981f-8fa512ac774e.html", "downloaded_at": "2019-10-07 01:11:01.777495+00:00", "title": "Axios", "language": "en", "text": "After making the resume remark, Trump added, \"But it's going to make Kevin speaker,\" these sources said, a reference to House Minority Leader Kevin McCarthy's upside.\n\nWhy it matters: These two Trump quotes might seem like throwaways on what was a lengthy and discursive call with allies. But sources who have discussed impeachment candidly with the president say these comments perfectly encapsulate how Trump feels about it: He believes it could help him get re-elected and win back the House. But he doesn't want the history books recording Donald Trump as an impeached president.\n\nBetween the lines: Some prominent political analysts, including the New York Times' Ross Douthat, have speculated that the president might welcome articles of impeachment. Sources close to the president say this interpretation is dead wrong. Trump adamantly does not want to be impeached — because he cares, above all, about his legacy.\n\nBehind the scenes: Many of Trump's advisers, both inside and out of the White House, have given him their unpleasant prediction that he will almost certainly be impeached by the House of Representatives. But they have also told him they believe there is almost no chance the Senate convicts him.\n\nOne person who spoke to Trump in the past 10 days said he seemed resistant to that prediction and said he thought he could stop Nancy Pelosi from getting the votes to impeach. The source said Trump seemed confident that he could pile enough pressure onto House Democrats in \"Trump districts\" (where he won in 2016 but Democrats took back in 2018) that those incumbents would cave on Pelosi.\n\nBut a second person who spoke to Trump in the last few days said the president \"was not in denial\" and understood that the House is probably going to impeach him.\n\nTrump's re-election campaign and the RNC are reportedly spending $10 million on advertising targeting Joe Biden and Democrats supporting impeachment.\n\nAnd Vice President Mike Pence will be piling additional pressure onto Democrats in Trump districts, where, per the NYT, \"Mr. Pence's aides have argued that ... impeachment lacks strong support, especially when compared with kitchen-table issues.\"\n\nGo deeper: Public support for Trump's impeachment is higher than it was for Nixon and Clinton", "description": "Smart, efficient news worthy of your time, attention, and trust", "authors": [], "top_image": "https://assets.axios.com/203e9f932cc97836ac2ff4c6c982676c.png", "published_at": "2019-10-06"}