{"pub": "cbc", "url": "https://cbc.ca/thedetectives/blog/three-things-you-didnt-know-about-undercover-homicide-investigations", "downloaded_at": "2019-09-04 04:05:23.409195+00:00", "published_at": "2019-09-04", "title": "3 things you didn’t know about undercover homicide investigations", "language": "en", "text": "For decades, Canada’s influence on undercover homicide operations has been second to none.\n\nIn the early ‘90s, RCMP detectives Al Haslett and Peter Marsh developed a technique commonly known as “Mr. Big” — a uniquely effective way to get hard criminals to confess to violent crimes. The strategy involves the creation of a fake mob, supported by several undercover police operatives, designed to gain the trust of a suspected criminal to the point that he is willing to confess to the head of the gang, also known as “Mr. Big.” (Al Haslett is portrayed in CBC's The Detectives in episodes 101 & 206).\n\nThe technique turned out to be so successful that it’s been used in hundreds of cases ever since its creation. Internationally, it’s simply known as the “Canadian technique.”\n\nWhile Mr. Big isn’t the only method for conducting undercover homicide operations, it is certainly the most well-known. For the most part, these types of operations are shrouded in mystery.\n\nThat’s by design, said Detective Dave Sweet, who spent years working as an undercover operative for the Calgary Police Service.\n\n“Most undercover operators aren’t even told about the type of crime they’re investigating. They might know it’s a murder they’re investigating, but they’re not told anything else about it.”\n\nAccording to the RCMP, undercover homicide operations are widely used in Canada — because they work. In 75 per cent of cases, the targeted individual is either cleared or charged. with 95 per cent of charges resulting in convictions.\n\nHere are three common misconceptions about undercover homicide operations we can tell you about:\n\nMost undercover operatives have no idea what crime they’re investigating.\n\nFor any undercover homicide investigation, the goal is to obtain a truthful statement from the person of interest as to whether or not they’re involved in a crime. Critics of these operations contend that they elicit false confessions. The best way to avoid a false confession is by obtaining information that could not have been known by anyone other than those familiar with the crime, otherwise known as holdback. So, to maintain the integrity of any confession, investigators running an undercover operation diligently keep all holdback details hidden from the public, from their peers, and even from the other operatives investigating the case with them.\n\n“Most undercover operators aren’t even told about the type of crime they’re investigating,” said Sweet. “They might know it’s a murder they’re investigating, but they’re not told anything else about it.”\n\nUndercover work is actually safer than regular patrol duty.\n\nWorking undercover is inherently extremely dangerous. Operatives are in regular contact with highly dangerous people, often in seemingly precarious situations. Things can go very wrong, very quickly. So how can it be safer than patrol duty? Because police services take every precaution available to ensure their operatives’ safety at all times.\n\n“When I used to operate, there was always a surveillance team watching me,” said Sweet. “Because it’s real. It’s all out in the street. And then you’re getting robbed or whatever is happening. So, there’s always somebody fairly close by.”\n\nCompare that to patrol officers pulling over a car for a traffic violation. Those officers have no idea who’s in the car, whether they’re brandishing weapons, whether they’re violent offenders or any other number of variables that would be well known to undercover operatives in their assignments. The same can be said for just about any situation a patrol officer walks into. When it comes to policing, the true danger lies in the unknown.\n\nUndercover operations usually start months before any contact is made.\n\nBefore any undercover operation can get going, many factors need to be considered. Are the necessary resources available? Are they worth the potential reward? Does the nature of the crime warrant the effort required to undertake the operation?\n\nEven if everything lines up, it can take months of surveillance to get enough information about the person of interest to finally enact an actual Mr. Big-style sting.\n\n“That's when the chess match begins,” said Sweet. “It becomes very important what steps you're taking; understanding what potentially could help you and what won't help you down the road. When you show your cards, when you don’t — all that kind of stuff.”\n\nSweet adds that suspects ideally have no knowledge of the investigation until the day they’re arrested.\n\n“Then there’s no escaping it. There’s no opportunity to come up with excuses. There’s no opportunity to tamper with evidence,” Sweet said.\n\n“On the day that I feel the case is its strongest, that’s the day we arrest and there’s no more anything; they just go to jail.”\n\nDave Sweet takes us back to one of his most memorable cases in episode 207 of CBC's The Detectives.", "description": "", "authors": [], "top_image": "https://www.cbc.ca/thedetectives/content/images/DET_207_undercover_lead.jpg"}