{"pub": "morningstar", "url": "https://morningstar.com/articles/949609/investing-close-to-home-is-overrated", "downloaded_at": "2019-10-18 11:05:32.076443+00:00", "title": "Investing Close to Home Is Overrated", "language": "en", "text": "A version of this article previously appeared in the August 2019 issue of Morningstar ETFInvestor. Download a complimentary copy of Morningstar ETFInvestor by visiting the website.\n\nMost U.S. investors have a bias toward U.S. stocks. If the relative value of assets invested in U.S.-listed mutual funds and exchange-traded funds is any indication, the average U.S. investor allocated about 24% to foreign-stock funds and 76% to U.S.-stock funds at the end of June 2019 (this excludes sector and global funds). In contrast, U.S. stocks represented about 45% of the FTSE Global All Cap Index. It isn’t necessary to eliminate this bias toward U.S. stocks to reap the diversification benefits that foreign stocks offer. That said, foreign stocks should represent a considerable portion of most investors’ portfolios.\n\nHome bias isn’t unique to U.S. investors, and it’s understandable. Domestic stocks tend to have less currency risk than foreign stocks, which tends to make them slightly less volatile and more appealing, as most investors’ expenditures are predominately in their home currency. And investors are generally more familiar with local stocks, which can make owning them feel more comfortable. But a heavy bias toward U.S. stocks can hurt diversification and is often based on misconceptions.\n\nMisconceptions\n\n1. There’s sufficient diversification at home.\n\nBusiness is global. Large U.S. companies, like their foreign counterparts, do business all over the world. This may create the impression that U.S. stocks offer sufficient global diversification and that it isn’t necessary to invest in foreign-listed stocks. But that’s misleading.\n\n\n\nWhile most large U.S. stocks represent multinational firms, U.S. stocks tend to have significantly greater exposure to the U.S. market than their foreign-listed counterparts. Morningstar data suggests that the holdings of Vanguard S&P 500 ETF (VOO) generated 62% of their revenue in the United States, as shown in Exhibit 1. The corresponding value for Vanguard Total International Stock ETF (VXUS) was 15%. This suggests adding foreign-listed stocks to a U.S.-stock portfolio can better diversify local market risk.\n\nSmall-cap stocks tend to generate a greater portion of their revenue from their local markets than large-cap stocks. So, Vanguard Total Stock Market ETF (VTI), which includes U.S. stocks of all sizes, has slightly greater revenue exposure to the U.S. market than VOO.\n\n2. The U.S. is a good place to do business, and that should lead to strong stock market performance.\n\nThe U.S. has a lot going for it, so it may be attractive to some that U.S. stocks still generate most of their sales in the U.S. It has strong shareholder protections, a more-favorable regulatory environment, and better-developed capital markets than many other countries, making it easier to fire workers when appropriate, start new businesses, and innovate. That’s good for business, but it’s not news to anyone. Market prices should already reflect this information, so it isn’t sufficient to generate strong stock-market performance.\n\n\n\nUnexpected changes in the quality of the business environment in the markets where firms operate are more likely to influence their stock prices than differences in the level of quality across markets. It’s not clear that the U.S. will surprise on the upside more than other markets.\n\n3. The U.S. market will likely outperform foreign stock markets.\n\nThe U.S. has been among the world’s best-performing stock markets in recent decades, but that doesn’t necessarily mean it will continue to be in the future. From January 1995 through June 2019, the MSCI USA Index’s return ranked seventh out of 49 single-country indexes, beating the MSCI ACWI ex USA Index by a whopping 4.3 percentage points annually. This strong showing partially owed to differences in sector weightings. More-favorable stock exposure also helped, as did the strong performance of the U.S. dollar against other currencies.\n\n\n\nHowever, there’s little to suggest the U.S. market will continue to outperform foreign stocks over the long term. It may, or may not. The dollar could just as easily lag foreign currencies, and the technology and healthcare sector tilts that helped the U.S. market’s performance in the past could work against it in the future.\n\nIf anything, the higher valuations the U.S. stock market currently sports suggest it may have lower expected returns than foreign stocks. That said, differences in sector composition and accounting standards contribute to this valuation gap, which may distort the comparison.\n\nThe bottom line is that U.S. stocks are not destined to outperform, and there have been plenty of times when they haven’t, as Exhibit 2 shows. While the MSCI USA Index beat the MSCI ACWI ex USA Index from June 1994 through June 2019 by 4.33 percentage points annually, it lagged in 34% of the rolling three-year periods during that time. Most notably, it underperformed by 9.4 percentage points annually from February 2002 through May 2008. It’s tough to predict when foreign stocks will outperform, but maintaining a strategic allocation to them can help diversify risk.\n\nDiversification Potential\n\nWhile it’s clear that foreign stocks can diversify a U.S.-centric portfolio, the magnitude of that benefit has changed over time. Exhibit 3 shows that correlations between U.S. and foreign stocks climbed in the 1990s and early 2000s, as the world became more integrated. They fell in the years leading up to the global financial crisis before spiking, and remained elevated in the years that followed. These correlations have fallen in recent years, suggesting that the diversification benefits of owning foreign stocks have improved, but they will probably never return to the lower levels they exhibited in the 20th century.\n\n\n\nBecause U.S. and foreign stocks aren’t perfectly correlated, adding foreign stocks to a U.S.-centric portfolio shouldn’t significantly increase portfolio volatility, despite their higher stand-alone volatility. For example, from January 2000 through June 2019, a portfolio with a 33% allocation to the MSCI ACWI ex USA Index, which includes foreign large- and mid-cap stocks, would have exhibited only slightly higher volatility than the MSCI USA Index, as Exhibit 4 shows. This is a slightly higher allocation to foreign stocks than that of the average U.S. fund investor.\n\nWhat’s the right amount to allocate to foreign stocks? If the goal is to take full advantage of their diversification potential, and the correlations and volatility of U.S. and foreign stocks from January 2000 to June 2019 are representative of the future, the optimal allocation to foreign stocks is around 47%. [1] However, a 33% allocation over this period would have achieved 92% of the maximum diversification benefit.\n\nMore-risk-averse investors might consider a lower allocation, but if risk is the primary concern, it might also be worth considering currency-hedged exposure to foreign stocks. Currency hedging largely removes the volatility currency fluctuations create, bringing foreign stocks’ volatility slightly below that of U.S. stocks. This allows larger allocations to foreign stocks to reduce portfolio volatility (up to a point), as the diversification benefits don’t have to offset currency risk.\n\nThe downside is that currency hedging tends to be less tax-efficient than leaving the exposure unhedged, and currency-hedged funds tend to charge higher fees. Hedging can also be expensive when interest rates in foreign markets are higher than in the U.S. Currently, that’s more of an issue in emerging markets than in most foreign developed markets.\n\nFund Picks\n\nVanguard Total International Stock ETF (0.09% fee), with a Morningstar Analyst Rating of Gold, is a great place to start building a foreign-stock allocation. It includes stocks of all sizes listed in both foreign developed and emerging markets and weights them by market cap. This is one of the cheapest and best-diversified foreign-stock funds available, which makes it one of the best.\n\n\n\nForeign small-cap stocks tend to offer better diversification benefits than their larger counterparts, as they tend to be more highly leveraged to their local markets. It may be worth considering pairing Bronze-rated Vanguard FTSE All-World ex-US Small- Cap ETF (VSS) (0.12% fee) with VXUS. This is one of the cheapest funds of its kind. It offers market-cap-weighted exposure to small-cap stocks listed in both foreign developed and emerging markets and has been only slightly more volatile than VXUS over the past decade.\n\nXtrackers MSCI EAFE Hedged Equity ETF (DBEF) (0.35% fee) is a solid option for currency-hedged exposure to large- and mid-cap stocks listed in foreign developed markets. While excluding emerging-markets stocks keeps it from being as well-diversified as VXUS, including them would increase the cost of hedging.\n\nThe benefits of investing globally extend to factor strategies. The payoff to factors like value and momentum in the U.S. and foreign stock markets aren’t perfectly correlated, as Exhibit 5 shows.\n\nThose interested in taking advantage of these diversification benefits might consider Bronze-rated iShares Edge MSCI Multifactor International ETF (INTF) (0.30% fee) and Silver-rated iShares Edge MSCI Minimum Volatility EAFE ETF (EFAV) (0.20% fee). The former targets stocks with attractive value, momentum, quality, and small-size characteristics. The latter attempts to construct the least-volatile portfolio possible under a set of constraints. Both stick to large- and mid-cap stocks listed in foreign developed markets.\n\n[1] This is the allocation that maximizes the diversification ratio developed by TOBAM, which is defined as the weighted average volatility of the portfolio’s holdings to the portfolio’s volatility.\n\nDisclosure: Morningstar, Inc. licenses indexes to financial institutions as the tracking indexes for investable products, such as exchange-traded funds, sponsored by the financial institution. The license fee for such use is paid by the sponsoring financial institution based mainly on the total assets of the investable product. Please click here for a list of investable products that track or have tracked a Morningstar index. Neither Morningstar, Inc. nor its investment management division markets, sells, or makes any representations regarding the advisability of investing in any investable product that tracks a Morningstar index.", "description": "Foreign stocks have an important role to play.", "authors": [], "top_image": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blt9e0b474a170dcf25/5c76b96f14828807488f6b80/AlexBryan_1x1.jpg", "published_at": "2019-10-18"}