{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/movies/2019/10/16/scarlett-johansson-talks-single-parenthood-divorce-jojo-rabbit-marriage-story/3988273002", "downloaded_at": "2019-10-16 21:17:51.983885+00:00", "title": "Scarlett Johansson embarks on a new chapter with 'Jojo Rabbit' and 'Marriage Story'", "language": "en", "text": "CLOSE 'Jojo Rabbit' centers on a 10-year-old boy recruited into a Nazi youth camp during World War II all while his mom his hiding a Jewish girl Fox Searchlight Films\n\nLOS ANGELES – One of the most famous, highest-paid movie stars in the world gets lonely sometimes, too.\n\nIt’s an unmooring Scarlett Johansson explores in two films this fall that bookend a century: First, in WWII satire “Jojo Rabbit” (in theaters Friday in Los Angeles and New York, expanding through October and November), she plays Rosie, a German mother worrying about her 10-year-old zealot whose imaginary friend is, yes, Hitler (Taika Waititi of \"Thor: Ragnarok,\" who also directs). Then Johansson debuts Netflix’s “Marriage Story” (in theaters Nov. 6 in New York and Los Angeles, streaming Dec. 6) in which she plays Nicole, a once-famous actress rediscovering herself as she divorces her husband (Adam Driver), a decorated New York theater director.\n\nAs Johansson, 34, approached the dual roles, limbo became new, too: She was mid-divorce with her second husband, French journalist Romain Dauriac, with whom she shares a 5-year-old daughter, Rose.\n\nScarlett Johansson jokes: Keeping 'Black Widow' a secret was like 'having an affair'\n\n“I’ve felt in the past – there’s such a loneliness to being a single parent,” says Johansson, whose vibe is frank (and admittedly a bit jet-lagged) today and dressed movie-star casual: jeans, a tomato-red ribbed Alexander Wang top and black stilettos. “Obviously, it’s a lot of many different things at once, but there can be a loneliness and this constant feeling of doubt, that you don’t know what the hell you’re doing and you don’t have anyone else to bounce it off of.”\n\nScarlett Johansson, who plays single mothers in \"Jojo Rabbit\" and \"Marriage Story,\" opens up about single parenthood. \"There can be a loneliness and this constant feeling of doubt, that you don’t know what the hell you’re doing and you don’t have anyone else to bounce it off of.” (Photo: HARRISON HILL/USA TODAY)\n\nToronto Film Festival: Taika Waititi calls 'Jojo Rabbit' a 'love letter to mothers'\n\nParenting solo brings a specific kind of isolation, she notes. “You’re also spending a lot of time alone with a child, without the company of another adult, which is hard for long periods of time. You maybe have doubts about your life: How did I get here? It’s not all the time … but those moments creep in, and they creep in at weird times.”\n\nToday, of course, Johansson is engaged to “Saturday Night Live” head writer Colin Jost, 37; her egg-shaped engagement ring catches morning sunlight from her left hand as she speaks. But few knew her marriage to Dauriac was crumbling when Noah Baumbach, who wrote and directs “Marriage Story,” pitched her his semi-autobiographical divorce tale over lunch. Especially not Baumbach.\n\nScarlett Johansson plays a German mother worried over her son's adoration of Hitler in the WWII satire \"Jojo Rabbit.\" (Photo: LARRY HORRICKS/FOX SEARCHLIGHT VIA AP)\n\nShe was late that day and apologized, saying she was going through a divorce. \" 'You'll either love this or hate this,' I remember myself saying, or maybe just thinking,\" Baumbach recalled Monday night at the Elle Women in Hollywood Celebration, where he toasted Johansson. But she was in. “The thing about Scarlett is her personal situation wasn’t a reason not to do it, it was a reason to do it.”\n\nBy the time she filmed “Marriage Story,” which sees Nicole lean into the advice of her power divorce attorney (Laura Dern), Johansson found herself “in a much more settled place ... I wasn’t in it, which was a better place to be professionally. I’d processed my feelings about it so I could use them instead of being in a cloud about the whole thing.”\n\nWhere “Marriage Story” is a palpable journey of love lost, “Jojo” is a roller coaster packed with audacious satire and emotional wallops, as Rosie, who is secretly hiding a Jewish teenager in the attic, employs her devious sense of mischief to try to keep from losing her son to malevolent forces.\n\n“I already knew that she was funny, like outside of what you would see in a Marvel film or most movies,” says Waititi, describing Johansson as “goofy” offscreen. But he says she's “also very protective. She likes to look after people. She’ll make sure you’re OK, she’s got this maternal instinct, that’s who she is.”\n\nThe two films are now earning best actress and supporting actress talk for Johansson, who has spent the majority of the last decade as a founding Avenger in the Marvel blockbusters (her standalone \"Black Widow\" movie arrives May 1). And both, notably, close with a sense of hope.\n\nWhen did Johansson begin to feel hopeful for her own next chapter?\n\n“When you have a breakup of any kind, whether it’s amicable or not, you question a lot of the choices that you’ve made. ... OK, who am I now? And I had this new identity as a single mom, so what is that? How does this work? Even the logistics of it, and the emotional cadence of it. How is this going to be? And not knowing what the future holds. These are all things that trigger my anxiety,” she chuckles.\n\nBut therapy, she says, and working on projects like “Jojo” and “Marriage Story\" helped build her back up.\n\n\"It doesn’t mean I didn’t have a breakdown like either of these characters do – I still have them – but I really credit also having my daughter there,\" she says. \"When I look at her, I feel full of hope and positivity. It’s good to wallow for a little bit. And then you have to pull yourself up.”\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/movies/2019/10/16/scarlett-johansson-talks-single-parenthood-divorce-jojo-rabbit-marriage-story/3988273002/", "description": "As Scarlett Johansson prepared for \"Jojo Rabbit\" and Netflix's \"Marriage Story,\" she was mid-divorce. Now, she opens up about her next chapter.", "authors": ["Andrea Mandell", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/15/USAT/6b081881-2f61-4e45-888b-bf672167ed30-XXX_ScarJo09.JPG?crop=7089,3988,x1,y348&width=3200&height=1680&fit=bounds", "published_at": "2019-10-16"}