{"pub": "huffpost", "url": "https://huffpost.com/entry/russian-interference-trump-election-senate-intelligence-committee_n_5d9cfb01e4b06ddfc50ff12e", "downloaded_at": "2019-10-09 00:34:18.984467+00:00", "title": "Russian Operatives Popped Champagne, Said They 'Made America Great' After Trump Win", "language": "en", "text": "Russian social media trolls working to boost the candidacy of now-President Donald Trump celebrated the real estate mogul’s win on election night 2016 with champagne, according to a message disclosed in a new report from the Republican-led Senate Intelligence Committee.\n\nAccording to the committee’s report, released Tuesday, an employee of Russia’s Internet Research Agency sent a message indicating that they “uncorked a tiny bottle of champagne” when they found out that Trump had won. “We uttered almost in unison: ‘We made America great.’” The exchange was highlighted by Bloomberg.\n\nRobert Mueller’s extensive special counsel investigation laid out a mountain of evidence showing Russian interference in the 2016 presidential election. Like the Mueller investigation, the new report from the Intelligence Committee found that the Internet Research Agency “sought to influence the presidential election by harming Hillary Clinton’s chances of success and supporting Donald Trump at the direction of the Kremlin.”\n\nSen. Richard Burr (R-N.C.), the chairman of the committee, said in a statement Tuesday that Russia is “waging an information warfare campaign against the U.S. that didn’t start and didn’t end with the 2016 election” and that their goal was to “sow societal discord and erode public confidence” in government.\n\nTrump has been publicly skeptical of intelligence community conclusions about Russian interference in the 2016 election because he believes it takes away from his victory.", "description": "A report from the GOP-led Senate Intelligence Committee says that Russian trolls celebrated success on election night 2016.", "authors": ["Senior Justice Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d9cffb32100003d07ac789f.jpeg?cache=4ahrkvbyuj&ops=1778_1000", "published_at": "2019-10-08"}