{"pub": "politico", "url": "https://politico.com/news/2019/09/30/ukraine-embassy-trump-tweet-012691", "downloaded_at": "2019-10-01 00:09:28.469636+00:00", "title": "Ukrainian Embassy begs public to stop using 'the Ukraine' after latest Trump flub", "language": "en", "text": "The construction of Ukraine’s name has been politically fraught for years, as evidenced by the cheeky tone of the embassy’s tweet.\n\n\"These are the only politically correct terms that express respect to the country and its nation,\" the embassy wrote, advising readers to \"be smart and avoid Soviet style clichés.\" The tweet closed with an emoji of a skeptical-looking person wearing a monocle.\n\nLet us kindly help you to use the words related to #Ukraine correctly.\n\n\n\n- Ukraine, not “the” Ukraine\n\n- Kyiv, not Kiev\n\n\n\nThese are the only politically correct terms that express respect to the country and its nation.\n\nBe smart and avoid Soviet style clichés🧐 pic.twitter.com/C1WrSOo8ay — UKR Embassy in USA (@UKRintheUSA) September 28, 2019\n\nThat construction has also cropped up in media reports surrounding the allegations that Trump inappropriately pressured Zelensky to investigate former Vice President Joe Biden and his son, though The Associated Press, whose style guidelines have been adopted by a number of news outlets, dropped the definite article in 1991, in accordance with Ukraine's independence referendum that same year. Critics of the use of \"the Ukraine\" argue it belittles the country's status as a sovereign state, reducing it to its status as a former Soviet territory.\n\nSome news outlets use “the Ukraine” frequently, as then-President Barack Obama occasionally did in the aftermath of Russia's 2014 annexation of Ukraine’s Crimean Peninsula.\n\nAmid sparring with reporters during his trip last week to the United Nations, Trump also parroted unsubstantiated claims about the Bidens and their work in “the Ukraine.”\n\nBut Monday's reminder from the Ukrainian Embassy came shortly after a morning tweet from the man whose presidency has been dealt a major blow by his relations with Ukraine.\n\nTrump, who frequently deletes and reposts messages on his favorite social media platform, deleted a declaration that “Again, the President of the Ukraine said THERE WAS NO (ZERO) PRESSURE PUT ON HIM BY ME,” reposting it minutes later without the “the.”", "description": "", "authors": [], "top_image": "https://static.politico.com/7d/05/28d96b55443a81691406d05285dc/20190930-trump-ap-773.jpg", "published_at": "2019-09-30"}