{"pub": "zdnet", "url": "https://www.zdnet.com/article/restructuring-and-probe-resolution-costs-send-ericsson-into-hole-for-third-quarter", "downloaded_at": "2019-10-17 08:06:10.086367+00:00", "title": "Restructuring and probe resolution costs send Ericsson into hole for third quarter", "language": "en", "text": "SK Telecom and Ericsson complete end-to-end 5G standalone core test SK Telecom and Ericsson have completed testing of telecommunications using purely 5G handsets, radio stations, and cores.\n\nSwedish telco equipment manufactuerer Ericsson has posted a net loss of 6.9 billion Swedish krona, dragged down by restructuring costs and, more significantly, a 11 billion krona hit to resolve ongoing disputes with US authorities.\n\nRevenue for the company grew 6% year on year to 57 billion krona, while revenue for the nine months to the end of September increased by 14 billion krona to 161 billion krona.\n\nThe company said in its results that restructuring costs would amount to 1% of sales.\n\nThe dispute with the United States involves adhering to its Foreign Corrupt Practices Act (FCPA). The US Securities and Exchange Commission kicked off its investigation into Ericsson back in 2013, and the Department of Justice became involved in 2015.\n\nThe investigation covers a four-year period that ended in the first quarter of 2017, and according to Ericsson, revealed breaches of the FCPA and its code of business ethics in six countries: China, Djibouti, Indonesia, Kuwait, Saudi Arabia, and Vietnam.\n\nThe FCPA consists of US laws focusing on anti-bribery and accounting transparency.\n\nEricsson said last month it would allocate around 12 billion Swedish krona, approximately $1 billion, to resolve the investigations.\n\nOnce the investigation allocation and restructuring costs were excluded, Ericsson reported operating income of 6.5 billion krona, compared to a 4.2 billion krona operating loss when the costs were included.\n\nDespite the loss, the company increased its net cash to 37.4 billion krona, compared to 32 billion krona at the same time last year.\n\nPresident and CEO of Ericsson Börje Ekholm said the company's 3% organic sales growth was driven by 5G adoption in North America and North East Asia, with China expected to commence large 5G deployments next year.\n\n\"The largest market for 5G infrastructure will be China where deployments are expected to start near term. We have invested to increase our market share, however it is still too early to assess possible volumes and price levels,\" Ekholm said.\n\n\"Based on historic experience we expect to have challenging margins initially but positive margins over the lifespan of a contract.\"\n\nEkholm added 5G uptake has been faster than the company expected.\n\n\"We see initial 5G build out as a capacity enhancer in metropolitan areas,\" he said.\n\n\"However, over time, new exciting innovations for 5G will come with industrial and IoT use cases, leveraging the speed, latency and security characteristics of 5G.\"\n\nYesterday, Indian telco Bharti Airtel said it would go with Ericsson for its 5G core network.\n\nRelated Coverage", "description": "Revenue is up 6% for the Swedish telco equipment manufacturer but 10 billion Swedish krona in costs sends the company's operating income into the red.", "authors": ["Chris Duckett"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2018/03/14/d9f52454-5784-4658-a38d-fa52d86464e7/thumbnail/770x578/1b4be7ad6a2a160500906e33be4f9ef2/ziff-fibre-image.jpg", "published_at": "2019-10-17"}