{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/jeremy-corbyn-slams-boris-johnson-20579097", "downloaded_at": "2019-10-14 23:18:44.737300+00:00", "title": "Jeremy Corbyn slams Boris Johnson for failing to deal with poverty in Queen's Speech", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJeremy Corbyn has slammed Boris Johnson for failing to do anything to deal with poverty in his Queen's Speech.\n\nDelivering his response to the State Opening of Parliament, the Labour leader accused the Tories of creating a \"lost generation.\"\n\nMr Corbyn said: \"For many people the economy of this country is fundamentally weak.\"\n\nHe said: \"There was nothing in the Queen's Speech to address our stagnant economy, nothing to address low pay and insecure work, nothing to reverse the rising levels of child poverty or of pensioner poverty.\"\n\n\"We have, almost, a lost generation. Children going to school in under-staffed schools, very few teaching assistants, headteachers going out with a begging bowl to parents to try to match the school budget.\n\n\"And too many young people growing up in incredible levels of stress, of bad housing and of stress and worry about the future.\n\n\"That contributes to the mental health crisis that this country, as a whole, must address.\"\n\n(Image: UK PARLIAMENTARY RECORDING UNIT HANDOUT/EPA-EFE/REX)\n\nMr Johnson insisted the Queen's Speech, which has almost no chance of being voted through, would herald a \"new age of opportunity for the whole country.\"\n\nHe said: \"And as we prepare to get Brexit done by October 31, we are setting out now our vision of an open, global, free-trading United Kingdom.\n\n\"A high-wage, low-tax economy with the highest environmental standards, new protections for animal welfare, the best place to invest, the best place to start a business, the best place to start a family and send your kids to school.\"\n\n(Image: PRU/AFP via Getty Images)\n\nHe added: \"Without being chauvinistic or disrespectful to anywhere else in the world, in important respects, this country is the greatest place to live in the world.\"\n\nEarlier, Boris Johnson quoted Welsh rappers Goldie Lookin Chain as he paid tribute to the late Labour MP Paul Flynn.\n\nThe Newport-based group penned a song to commemorate Mr Flynn, who died aged 84 in February.\n\nMr Flynn represented Newport West for 32 years and the PM joined Labour leader Jeremy Corbyn in opening the new parliamentary session by hailing the \"much-loved and greatly missed\" MP.\n\n(Image: WalesOnline/Rob Browne)\n\nSpeaking in the Commons, Mr Johnson stopped short of rapping himself as he added: \"A proud and witty Welshman who earned this obituary from Goldie Lookin Chain, a South Wales rap ensemble straight out of Newport.\n\n\"This is what they said: 'As an MP he was well respected, since 1987 when first elected; Across the parties Paul was revered, and it's just possible he was born with that beard; Across the floor, far and wide, respected across the political divide; Regardless of your own stance, left or right, raise a glass to Paul tonight'.\n\n\"I have no ideas as to the political preferences of the band members 2Hats or Eggsy but... I have no doubt the whole House will agree with their tribute to Paul Flynn.\"\n\nGoldie Lookin Chain wrote on Twitter : \"I love it when I actually get text messages from MPs to tell me what's going on in Parliament. Knows it.\"", "description": "The Labour leader accused the Tories of creating a \"lost generation\"", "authors": ["Mikey Smith", "Image", "Afp Via Getty Images", "Uk Parliamentary Recording Unit Handout Epa-Efe Rex", "Pru Afp Via Getty Images", "Walesonline Rob Browne"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20579046.ece/ALTERNATES/s1200/0_BRITAIN-POLITICS-EU-BREXIT.jpg", "published_at": "2019-10-14"}