{"pub": "politico", "url": "https://politico.com/magazine/story/2019/09/14/when-weather-forecasts-became-political-228106", "downloaded_at": "2019-09-14 11:16:36.732545+00:00", "title": "The Nasty Political Fight Over the First Weather Forecasts", "language": "en", "text": "On October 25, 1859, a slow-moving gale churned northward toward the British Isles, winds topping 100 miles an hour in a narrow fury over the Irish Sea. That evening, the steam clipper Royal Charter also approached the coast with 500 men, women and children aboard, on what should have been the celebratory last night of a two-month journey from Australia.\n\nNot gleaning the grave danger in the atmosphere, the Royal Charter’s captain pushed on toward Wales. By midnight, the 3,000-ton behemoth was foundering. The crew anchored off the coast of Anglesey to try and ride out the gale. The port chain snapped first; the starboard chain, an hour later. Just after dawn on the 26th, the winds and waves drove the Royal Charter onto the rocky shore, breaking its iron hull to pieces. All but 41 passengers were crushed or drowned.\n\nStory Continued Below\n\nWhat became known as the “Royal Charter Storm” went down in history as the most violent storm of the 19th century in the British Isles, sinking 133 vessels and leaving more than 800 people dead, including all the women and children on the namesake ship.\n\nThe storm made history, too, for establishing the first systematic weather forecasts—until politics got in the way of public safety.\n\nFor two weeks now, Americans have watched as President Donald Trump’s refusal to admit a minor mistake about the path of Hurricane Dorian has consumed more attention than the rising death toll and humanitarian crisis in the Bahamas. Trump’s statement that Alabama could be hit by Dorian prompted a correction from the National Weather Service station in Birmingham. That was followed by the president’s alteration of a hurricane map with a Sharpie pen; an unusual, unsigned statement from the National Oceanic and Atmospheric Administration, which oversees NWS, defending Trump; then, reports that the secretary of Commerce had threatened to fire top NOAA employees if they didn’t contradict their own forecasters.\n\nStorm forecasting was born of the worst sort of politics, as the full story of the Royal Charter makes clear. Then, as now, the consequences of inaccurate or censored information about the weather can be measured in lost lives and widespread destruction of property.\n\nFive years before the Royal Charter disaster, British Vice Admiral Robert FitzRoy, who had captained HMS Beagle during Charles Darwin’s famous voyage, was named founding director of Britain’s Meteorological Office. FitzRoy had long agitated for a system of weather-data collection to allow scientists to detect storms and warn ship captains and the public. He named his concept “forecasting.” By analyzing temperature, barometric readings, and other data from ships and stations, he was convinced, scientists could detect emerging storms and post warnings—saving thousands of lives, not to mention the property lost to shipwrecks.\n\nFitzRoy was right about the science of forecasting. But the politics were beyond rational prediction. In Victorian times, the idea of forecasting struck many nonscientists as ludicrous—a con, or even an affront to God. In his book The Weather Experiment, the British historian Peter Moore recounts a telling House of Commons debate. When a science-minded member of Parliament suggested in 1854 that amassing weather observations from sea and land could someday mean “we might know in this metropolis the condition of the weather 24 hours beforehand,” laughter broke out raucously enough to stop the proceeding.\n\nThe screams from the wreck of the Royal Charter snuffed out the laughs. After the storm, FitzRoy produced a detailed report showing how the tempest could have been tracked and its path predicted, validating his model. The Meteorological Office began collecting weather data in the fall of 1860. When the office accurately predicted its first gale, in February 1861, FitzRoy became a hero to many.\n\nTo others, he was still a pariah. FitzRoy and other public meteorologists were ridiculed as the “government Zadkiel,” the pseudonym of the most famous British astrologer in Victorian times. Darker motives were also at work. The late Malcolm Walker, a long-time historian of the Meteorological Office, found that in the early 1860s, ship-salvaging and other disaster profiteers lobbied members of Parliament to complain that storm warnings were “having a damaging effect” on their livelihood.\n\nIn 1864, one member of the House of Commons, Augustus Smith, wrote that he did not think the government should “undertake the functions of Aeolus,” the Greek god of wind. Smith also had financial interests in the Isles of Scilly, off the Cornish coast. In his public response, FitzRoy noted that ever since the introduction of forecasting, the Scilly harbors had far fewer visits from vessels in distress. His implication: Smith’s real concern was loss of profits. Data collection continued, but only for another year.\n\nAcross the Atlantic, the Americans did not have the same qualms about forecasting. By 1860, 500 U.S. telegraph offices were transmitting weather data to Washington, though with the secession of the Southern states and the outbreak of civil war, the network crumbled. After the war, a petition from the Great Lakes region—where violent weather contributed to 1,914 shipwrecks in 1869 alone—urged Congress to establish a meteorology agency and national weather service that could track storms as they moved in from the west. The next year, President Ulysses S. Grant signed a resolution creating what would become the National Weather Service. Alabama’s was one of 22 original stations that telegraphed observations to Washington.\n\nTrump’s crude altering of a Hurricane Dorian map to contradict Alabama forecasters recalls the Zadkiel politics that stymied British forecasting. For Trump, vindication has always been more important than public information. But the real shame of the president’s Sharpie is that it has blacked out the most important story in the wake of Hurricane Dorian: the 1,300 souls still unaccounted for in the Bahamas. NOAA’s chief scientist and three former heads of the agency are among many who have stood to make the point that forecasting “should never be political.” There are simply too many lives at stake.\n\nThat lesson was hard-won at the dawn of forecasting, a science whose truth had to overcome the vulgar politics of its birth. On April 30, 1865, FitzRoy, hero to ship captains and the Royal Navy, died by suicide, slashing his throat with a razor. Fellow scientists believed it was the pressure of trying to make accurate weather predictions in the face of constant criticism and ridicule. FitzRoy was also anguished by the death of President Abraham Lincoln, according to Walker, the Meteorological Office historian. FitzRoy’s suicide gave his critics ammunition to convince the public and lawmakers that forecasting was an immoral pseudoscience. Parliament banned all public forecasts in England for the next 13 years, allegedly because of inaccuracies.\n\nWe can only imagine the number of lives lost at sea, all due to the politicization of storm forecasting.\n\nThis article tagged under: History Dept.", "description": "Long before Donald Trump, lawmakers in Victorian England quashed early scientific storm predictions—with deadly consequences.", "authors": ["Cynthia Barnett"], "top_image": "https://static.politico.com/09/a4/86474a064c3099f9d0b88d3f84c3/royalcharter-1.jpg", "published_at": "2019-09-14"}