{"pub": "cbs", "url": "https://cbsnews.com/news/chile-news-santiago-at-least-15-dead-in-chile-as-violent-protests-reach-5th-day-2019-10-22", "downloaded_at": "2019-10-23 08:51:26.695503+00:00", "title": "At least 15 dead in Chile as violent protests reach 5th day", "language": "en", "text": "Rioting, arson attacks and violent clashes wracked Chile for a fifth day Tuesday, as the government declared 15 people dead in an upheaval that has nearly paralyzed the South American country long seen as one of the region's most stable.\n\nAbout half of Chile's 16 regions remained under an emergency decree Tuesday, and some were under military curfew — the first, other than for natural disasters, that's been imposed since the country returned to democracy in 1990 following a bloody 17-year dictatorship.\n\nThe unrest began last week when a relatively minor, less-than-4% rise in subway fares led to students jumping station turnstiles in protest. But the defiance exploded into violence on Friday as demonstrators set fire to subway stations, buses and a high-rise building.\n\nA demonstrator protects his face from a burning barricade during the fifth day of protests in Santiago, Chile Getty\n\nDemonstrations escalated over the weekend, with protesters demanding wide-ranging improvements in education, health care and wages. The protests are fueled by frustration from Chileans who feel they have not shared in the economic advances in one of Latin America's wealthiest nations.\n\nChile has one of the region's highest rates of inequality: Many Chilean families earn $550 to $700 a month, and pensions can be as low as $159.\n\n\"I fight so that all that will end and so that all of us will have something fair,\" José Tomás López, a cook, told The Associated Press.\n\nHe said he took to the streets \"because I've seen how my mother lives, with a salary of not more than [$700 a month] to maintain my three siblings, and I know her debts and all her efforts to meet them.\"\n\nRiot police used tear gas and water cannons Tuesday to break up marches by rock-throwing demonstrators in several parts of Santiago, while soldiers and police guarded other Chileans who formed long lines at supermarkets.\n\nDemonstrators hide from the water cannon fired by the police during the fifth day of protests in Santiago, Chile. Getty\n\n\"I've walked several kilometers searching for milk, but the supermarkets remain closed and neighborhood stores have run out,\" Carmen Fuentealba, a retiree, told AP.\n\nMany stores, subway stations and banks were burned, damaged or looted during protests over the weekend. Some people have reported problems getting cash at ATMs.\n\n\"It's enough with this,\" store owner Fernando García told AP. \"They want to destroy it all. I don't sleep at night because I fear that they'll loot.\"\n\nLong lines of cars also continued to snake from gas stations as drivers worried about supplies in a country that imports nearly all its gasoline.\n\n\"People are desperate,\" gas station attendant Jacqueline Zúñiga told AP. \"They think the gasoline, the petroleum is going to end, and they keep filling and filling their tanks. ... This has all led to aggressiveness.\"\n\nAfter the protests erupted, Piñera rolled back the subway hike while also declaring a state of emergency. He said this week that Chile is \"at war with a powerful, relentless enemy that respects nothing or anyone and is willing to use violence and crime without any limits.\"\n\nDemonstrators clash with riot police on the streets of Santiago Getty\n\nHe did not identify the enemy, and the remark brought rebukes from celebrities, politicians and athletes. \"A war needs two sides,\" tweeted Chilean soccer player Gary Medel. \"And here, we're just one people who want equality.\"\n\nPiñera, a billionaire and former airline owner, then switched to a more conciliatory tone. He said the government is working on a reconstruction plan to cover the hundreds of millions of dollars in damaged infrastructure.\n\nThe president met with members of his administration and the opposition Tuesday to explore a \"social agreement\" on solving \"the problems that affect Chileans.\"\n\nBut some leftist parties boycotted the meeting to protest the use of nearly 10,000 soldiers to patrol the streets. For many Chileans, their presence brings back haunting memories of General Augusto Pinochet's 1973-1990 dictatorship, during which at least 3,095 people were killed and tens of thousands more were tortured in a repression of leftists, according to government figures.\n\nMany demonstrators in the current unrest were born after the dictatorship and have defied the military curfew. While there has been serious violence, which the government blames mostly on hooded anarchists seeking to destabilize Chile, most marches have been peaceful, with people banging on pots, a common form of protest in the region.\n\n\"I think it's a critical moment in Chile in history,\" said Joe Eldrige, an analyst at the Washington Office on Latin America. \"Are we going to go back to the old kind of right-left extremes ... or are these institutions sufficiently flexible and adaptable to address the current situation?\"", "description": "Demonstrators set fire to subway stations, buses and a high-rise building in a region once considered stable", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/22/fd7e52ff-9b96-463d-80e9-b5d626289c77/thumbnail/1200x630/caa63ba3bfa14c3ebedc2f07c058ec69/gettyimages-1177676085-1.jpg", "published_at": "2019-10-22"}