{"pub": "npr", "title": "Biology's A B*tch: 5 Reasons It's So Hard To Keep Weight Off", "url": "https://npr.org/2019/04/25/717058877/the-biology-of-weight-loss", "language": "en", "published_at": "2019-04-25", "downloaded_at": "2019-09-02 07:26:23.393983+00:00", "text": "Biology's A B*tch: 5 Reasons It's So Hard To Keep Weight Off\n\nEnlarge this image toggle caption Shannon Wright for NPR Shannon Wright for NPR\n\nThis story is based on an episode of Life Kit's guide Rethinking Weight Loss. Subscribe to Life Kit: Health on Apple Podcasts.\n\nIf you've ever tried to lose weight and found the pounds won't come off easily — or they come right back — you are not alone.\n\nThe fact is that when we shed pounds, we trigger mechanisms that make it hard to keep the weight off. Some factors are within our control, but many are not. Understanding how this works might make you look more kindly on your body.\n\nWe won't tell you how to lose weight — or whether you even need to. But we will give you five realities about biology.\n\n1. Metabolism slows when you lose weight.\n\nYour metabolism is the processes through which your body converts the food you eat into energy. Metabolism varies from person to person. Scientists don't know everything about why that is. But they do know that part of that variation has to do with the composition of fat versus muscle in your body. It also varies by gender — men have faster metabolisms because they have more muscle on their bodies — and it slows as we age.\n\nBut for everyone, metabolic energy burn occurs in three main ways:\n\nResting metabolism — the energy used to keep your organs working and, basically, stay alive. This accounts for anywhere from 50% to 70% of the total calories you burn.\n\nThermic effect of food — the energy used to digest what you eat and turn it into energy, about 10% of the calories you burn.\n\nPhysical activity, which makes up about 30% of your calorie burn. Purposeful exercise (like hitting the gym) is usually a very small portion of this energy expenditure. Mostly, we're talking about the energy used to move around.\n\nWhen you lose weight, your metabolism slows, in part through simple physics.\n\n\"Calorie burn is in some sense proportional to your body weight,\" says Kevin Hall, senior scientist at the National Institute of Diabetes and Digestive and Kidney Diseases. \"So the heavier you are, the more calories it costs to move around and the more calories it costs to kind of basically maintain that body at rest.\"\n\n2. If you choose to try to lose weight, make changes that you can live with for the long haul.\n\nIn other words, make changes that you actually like, because you'll need to stick with them to keep the weight off. That's because losing weight triggers biological mechanisms that make it harder to keep the weight off — including a slower metabolism.\n\nHall says metabolism seems to act like a spring: The more effort you put into losing weight, the more you can stretch that spring out — that is, lose weight. But if you let up the tension on the spring — by stopping whatever eating and exercise routine helped you lose weight — your metabolism will spring back and you'll regain the weight you lost.\n\n\"Your body does persistently fight back and try to make you regain the weight that you've lost,\" Hall says.\n\nThis means that whatever changes you make to your diet or physical activity have to be kept up permanently to avoid weight regain.\n\n3. Hormones in your brain conspire to make you hungrier when you lose weight.\n\nHere's another diabolical change that happens when you lose weight: Your hormones change in ways that alter your appetite. While a lot of different hormones are involved in hunger, one of them is leptin, which is released by fat cells and basically tells your brain when to eat and when to stop eating. As you lose weight, your leptin levels drop, and when that happens, \"it's like a starvation signal,\" Hall says. A lot of times, he says, people \"seem to want to eat even more than they were eating before to kind of rapidly recover that weight loss.\"\n\nEat Your Way To A Healthier Life Choose The Best Diet For You Choose The Best Diet For You Listen · 20:17 20:17\n\nSo give yourself a break: You're not a glutton, and your hunger is not a moral failing. It's just hormones.\n\n4. To lose weight, what you eat is more important than how much you exercise.\n\nFor most folks, exercise is a minor player in weight loss. The fact is that it's a lot easier to cut out 600 calories by skipping a Starbucks muffin than it is to burn it by running for an hour or more.\n\nWhat's more, people tend to use exercise as an excuse to let themselves eat more. When that happens, they tend to eat more calories as a \"reward\" than they burned off at the gym. Or they might compensate by crashing out on the sofa and moving less the rest of their day.\n\nBut that shouldn't be a reason not to exercise, Hall says. Just don't do it so you can \"earn\" a piece of chocolate cake. There are many documented benefits to exercise that have nothing to do with weight loss, including better mood, better sleep, reduced anxiety and better blood sugar levels.\n\nExercise: Learn To Love (Or At Least Like) It How To Make Exercise A Habit That Sticks How To Make Exercise A Habit That Sticks Listen · 16:50 16:50\n\nWhat's more, some evidence suggests that if you do a great deal of physical activity, your resting metabolism might slow to compensate — though this is still a theory. As Hall explains in our conversation for the Life Kit podcast (audio link at the top left of this page), the evidence for this theory comes from a hunter-gather tribe in Tanzania called the Hadza.\n\n5. On the other hand, exercise seems to play a big role in maintaining a lower weight.\n\nA lot of what we know about how people maintain weight loss over the long haul comes from the National Weight Control Registry, a database of people across the U.S. who have lost at least 30 pounds and have kept it off for at least a year.\n\nThe No. 1 thing these people have in common: They report exercising every day for about an hour on average.\n\nBut that doesn't have to mean grueling workouts. The most popular form of exercise among this group is walking, says Dr. Holly Wyatt, an associate professor of medicine at the University of Colorado Anschutz Medical Campus, who studies people on the registry. She says these long-term weight-loss maintainers also do a lot of resistance training and other activities. \"So it's not specifically one activity that's associated with success,\" Wyatt says. \"I think, more than anything, it's the volume of activity.\"\n\nOne reason exercise seems to be a key to weight-loss maintenance is that it helps counteract some of those biological mechanisms that kick in when you lose weight — decreased metabolism and increased hunger. The difference between how much you want to eat and how many calories you are burning creates an energy gap, Wyatt explains.\n\n\"You've got to fill that energy gap either by doing a lot more exercise or by eating a little bit less, forever,\" she says.\n\nMany people assume that to keep weight off long term, they have to eat less forever. Even those on the National Weight Control Registry seem to think so — they report eating an average of about 1,400 calories a day. But a recent study shows that this isn't necessarily true.\n\nThat study, published in the journal Obesity, looked at people who had lost an average of 58 pounds and had kept it off for an average of nine years. The researchers took sophisticated measurements of their metabolisms and found they were burning about 2,500 calories a day. But since their weights were stable, that meant they were also eating 2,500 calories a day — about as much as they used to consume when they were heavier.\n\nThe reason they could eat this way and not gain back the weight — despite now having slower resting metabolisms? They were now exercising way more than when they were heavier. Now they were doing the equivalent of about 40 minutes a day of moderate-to-vigorous exercise, according to Dr. Victoria Catenacci, the study's senior author, and lead author Danielle Ostendorf, both with the University of Colorado. That included short bouts of exercise, like 10-minute walks, as well as longer sessions.\n\nSo what to do with all this knowledge?\n\nKnowing how this biology works might make you decide the stress of weight loss isn't worth it, given all the hurdles. And we don't know everything about why some people manage to keep weight off when so many other people don't.\n\nOr you might decide to try to lose weight anyway. If you do, consider rethinking your end goal. Instead of trying to look like a magazine cover model, perhaps focus on changes that make you feel healthier.\n\n\"Those types of changes that you make then become rewards in their own,\" Hall says.\n\nListen to more from Life Kit on Apple Podcasts.", "description": "When we shed pounds, we trigger biological mechanisms that make it hard to keep the weight off. Understanding these systems might help you be kinder to your body.", "authors": ["Maria Godoy", "Sylvie Douglis"], "top_image": "https://media.npr.org/assets/img/2019/04/30/healthy-choices-1-_wide-ff3fa4b9b1798a93ea715a8d97675c9576efc652.jpg?s=1400"}