{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/samsung-galaxy-fold-great-tablet-bad-smartphone-2019-10", "downloaded_at": "2019-10-08 15:10:04.992932+00:00", "title": "Samsung's Galaxy Fold is trying so hard to become a tablet that it forgot to become a phone", "language": "en", "text": "Despite its revisions to become more durable and reliable, Samsung's Galaxy Fold still doesn't come highly recommended for three main reasons.\n\nIt's the first generation of a brand-new smartphone design, and first generations of anything should generally be avoided while companies work out bugs and kinks for future generations.\n\nIt's also incredibly expensive at $2,000.\n\nPlus, it's a smartphone that does a good job of being a tablet, but it forgets to be a smartphone.\n\nVisit Business Insider's homepage for more stories.\n\nSamsung made some big changes to the Galaxy Fold to make it sturdier and more reliable, and in many respects, it's the perfect device for someone like me who appreciates a large screen in a smartphone.\n\nI love having a bigger 7.3-inch screen to watch YouTube videos, read articles, and browse the web and Reddit for the train ride on my commute home — and having a larger screen in general while I'm comfortably seated in the train or at home is great.\n\nPlus, I can make a call on the Galaxy Fold. Try doing that on an iPad! No, not a FaceTime call — a full-on phone call over LTE! Indeed, the Galaxy Fold promises the best of both worlds.\n\nExcept, the Galaxy Fold in general doesn't quite fulfill the \"smartphone\" part so well. It offers something I'm not used to, and actually quite like — a tablet in my pocket. At the same time, there's a massive compromise with something that I am used to and that I still need — a regular smartphone with a full-size smartphone screen.\n\nTurns out that enlarging the smartphone screen to a tablet's size is cool in practice, but not so practical.\n\nThe answer, of course, is to fold it up and use the smaller 4.6-inch screen on the exterior for easy one-handed use. But it's not the solution. It might have been fine eight years ago when I didn't do so much on my smartphone, but it's too narrow and small to be useful today.\n\nEventually, I craved a regular smartphone, and so that's what I reached for: I dug out the OnePlus 7T and started using that instead.\n\nRead more: It's frankly amazing that Samsung's $2,000 Galaxy Fold lasted as long as it did in this brutal demonstration to test its durability\n\nNot worth the compromise\n\nThe Galaxy Fold is great at being a small tablet, but it ultimately fails at being a smartphone. Sure, we'd like a tablet we can store in our pockets, but we need the smartphone part, too! And it turns out the smartphone part is tough to compromise on.\n\nSo far, smartphone makers haven't settled on the perfect design: There's the Galaxy Fold where the main display in on the interior; then there's Huawei's Mate X with the primary screen on the exterior, which, at first glance, seems like the better design; and, sometime soon, Motorola is meant to reveal its own foldable smartphone that's said to take on the company's iconic Razr design.\n\nI'm not being pessimistic about the Galaxy Fold. Even if it fit every need, I still wouldn't recommend it, even to those who can afford its expensive $2,000 price tag. That's because it's the very first generation of a commercially available foldable smartphone, and there are too many kinks, bugs, and design issues that need to be worked out before it's ready for primetime.", "description": "Samsung's revised Galaxy Fold is more durable, but there are still three main reasons why it's not the future-phone to get.", "authors": ["Antonio Villas-Boas"], "top_image": "https://image.businessinsider.com/5d9b935d5d21aa3c686f635c?width=1200&format=jpeg", "published_at": "2019-10-08"}