{"pub": "theverge", "url": "https://theverge.com/2019/9/25/20883923/amazon-certified-for-humans-alexa-smart-home-certification-program-simple-setup-updates", "downloaded_at": "2019-10-05 13:15:50.423445+00:00", "title": "Amazon is simplifying device setup with ‘Certified for Humans’ program", "language": "en", "text": "In an attempt to make the smart home simpler, smarter, and safer, Amazon is announcing a new “Certified for Humans” program, which is designed to make it easier to set up new smart home devices. The program builds upon the “frustration-free setup” initiative that Amazon announced last year, which stored user’s Wi-Fi details to share them with compatible smart home devices.\n\nAmazon says that any device that carries this new certification will be designed to cut down the number of steps required to get them connected to Alexa. A developer page for the program lists further requirements for devices, which range from technical requirements like supporting automatic firmware updates, to another which says that certified devices must have a “high average customer review rating on Amazon.” In total, the company says that certified devices have to meet over a dozen requirements to get certified.\n\n“Alexa, discover devices”\n\nA video shown on the Amazon’s Certified for Humans page hints at how the new setup process works. It shows participants plugging in new smart home equipment and then asking Alexa to “discover devices.” After this, the devices appear to be fully functional — great if that’s really all there is to it.\n\nAmazon isn’t the only company to have tried to simplify the smart home setup process. The “Works with Apple HomeKit” certification, for example, relies on you using your phone to scan a small QR code on new smart home gadgets in order to add it to Apple’s Home app.\n\nAmazon says that it’s already got a number of smart home products signed on to the new certification program, including Philips Hue smart lights, a Hamilton Beach coffee maker, and Kasa Smart-branded products by TP-Link. Naturally, Amazon says its own smart home devices, like the Echo Glow and Smart Oven will also be certified. The company says the certification should start appearing on devices “this fall.”", "description": "In an attempt to make the smart home simpler, smarter, and safer, Amazon is announcing a new \"Certified for Humans\" program. It’s designed to make it easier to set up new smart home devices.", "authors": ["Jon Porter", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/pbsq3y2zEuhU2HNkt33110Brzk0=/0x145:2000x1192/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19232136/lcimg_54e0210b_2ea1_448e_b9de_848c63ab6662.jpg", "published_at": "2019-09-25"}