{"pub": "washingtonpost", "url": "https://washingtonpost.com/express/2019/09/04/how-bob-ross-paintings-came-out-hiding-wound-up-display-virginia", "downloaded_at": "2019-09-04 23:48:12.977707+00:00", "published_at": "2019-09-04", "title": "How 24 Bob Ross paintings came out of hiding and wound up on display in Virginia", "language": "en", "text": "\n\nWith his PBS series in the 1980s and ‘90s, the late Bob Ross encouraged viewers to find the artists inside themselves. (Bob Ross Inc.)\n\nHis soothing voice swaddled you like a cozy blanket.\n\n“We don’t make mistakes, we make happy accidents,” Bob Ross calmly reassured viewers while crafting his signature landscape paintings on “The Joy of Painting,” his long-running PBS show. Now, those “happy accidents” that made the late artist a household name will get a rare showing in Purcellville, Va.\n\n“Happy Accidents: An Exhibit of Original Bob Ross Paintings,” opening Tuesday at the Franklin Park Arts Center, marks the largest display of the artist’s work on the East Coast. Twenty-four original paintings from Ross’ memorable show will be hung for the world to see at the center, located 50 miles from D.C. in Loudoun County.\n\nSo, how did Ross’ paintings end up in a small Virginia town, anyway? Turns out, they’ve been in the area for a while now — Bob Ross Inc., the company that houses his artwork and distributes his products, is based nearby in Fairfax County. The corporation’s president, Joan Kowalski, and Franklin Park Arts Center’s managing director, Elizabeth Bracey, are members of Loudoun County’s Art Advisory Committee. After learning that the Smithsonian National Museum of American History had acquired some of Ross’ works in March, Bracey asked Kowalski if she could exhibit some of Ross’ paintings at her center.\n\n“I realized that they had never done an exhibit like this before, so this is something really tremendous,” Bracey says. “Joan was saying to me that it’s fitting to have this exhibit in a small gallery. It just fits Bob Ross.”\n\nDespite Ross’ irrefutable influence on pop culture and his sizable cult following, both of which are still going strong 24 years after his death, his creations have seldom been displayed in public. So, naturally, when free timed tickets for the exhibition went live last month, the demand was intense. Weekend passes were claimed within a couple of weeks, and spots at the one-day painting workshops — led by a certified Bob Ross instructor — filled up in about six hours.\n\n“When he did his classes and his TV show, he was more about helping other people realize their artistic potential,” Bracey says of Ross. “He didn’t really ever see himself as a famous artist, like an Andy Warhol or Monet. So having an exhibit of his work was never something that he had wanted to do as a priority or something that he had planned.”\n\nThe arts center’s exhibition features paintings from the 1993 seasons of “The Joy of Painting.” For each episode of his show, which originally ran from 1983 to 1994, Ross would paint his featured piece three times: The first version was done prior to the taping for Ross to use as a reference while on camera; the second was the painting Ross worked on during the taping; and the third was painted and photographed in various stages of completion for Ross’ series of instructional books. In each case, the best of the three was chosen for display.\n\n“He loved painting nature as opposed to people,” Bracey notes about Ross’ artwork. “He was in the armed services, and was stationed or had training in Alaska, and he was very inspired by the landscape there.”\n\nOnce the timed tickets to the exhibition are gone, that’s it — Bracey says the arts center has no intention of expanding its schedule. (There are waitlists for times that are currently at capacity.) Each timed entry will be generally limited to around 60 people to ensure that everyone gets to view Ross’ serene paintings in peace — which is most likely what the calm, cool and collected artist would have wanted.\n\n“It’s amazing to me the emotional connection that people have with him and with the show,” Bracey says. “We’re talking about people in their 70s and 80s all the way down to teenagers and college students. I have learned even more about him through this experience myself.”\n\nFranklin Park Arts Center, 36441 Blueridge View Lane, Purcellville, Va.; Tue. through Oct. 15, free.", "description": "\"Happy Accidents\" at the Franklin Park Arts Center in Purcellville, Va., features works created by the late, beloved artist for his memorable PBS series \"The Joy of Painting.\"", "authors": ["Stephanie Williams", "Stephanie Is A Freelance Journalist Covering Music", "Art", "Culture For The Washington Post. Previously", "She Was The Features Editor", "Digital Social Media Producer For Washington Post Express."], "top_image": "https://www.washingtonpost.com/resizer/sHW8n8nYkJU-E4XTI_GGHqNvfA0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QTYBPUUICFC3BHNV6BVYI4U5XE.jpg"}