{"pub": "yahoo", "url": "https://yahoo.com/entertainment/nba-hall-famer-mitch-richmonds-014236823.html", "downloaded_at": "2019-10-10 03:15:55.292806+00:00", "title": "NBA Hall of Famer Mitch Richmond's Son Dies Suddenly at Age 20: 'We Are Heartbroken and Devastated'", "language": "en", "text": "NBA Hall of Famer Mitch Richmond's Son Dies Suddenly at Age 20: 'We Are Heartbroken and Devastated'\n\nShane Richmond, the son of NBA Hall of Famer and former Golden State Warriors guard Mitch Richmond, died suddenly this week. He was 20.\n\nMitch, 54, announced the devastating news in a statement released on Tuesday. The former NBA star said his youngest son died unexpectedly on Monday night, but did not disclose any other details about the tragedy.\n\n“We are heartbroken and devastated with this tragic news, and will use the strength of our family and the thoughts and prayers of our friends to get through this incredibly difficult time,” Richmond said on behalf of his wife Julie, their two other sons Phillip and Jerin and his daughter from a previous relationship, Tearra Gates.\n\n“Shane was a ray of light for his two brothers, sister, mom and dad and, at only 20 years of age, had a wealth of friends and admirers who will desperately miss his warm affection and smile,” Mitch continued.\n\n“As we go through the grieving process and the loss of our son, we ask that you respect our privacy,” he added.\n\nView photos Mitch Richmond with sons Jerin (left), Phillip (center), and Shane (right) More\n\nMitch is best known for his successful 14-season basketball career, which included playing guard for the Golden State Warriors, Sacramento Kings, Washington Wizards and Los Angeles Lakers, and his current coaching career at St. John’s University.\n\nFollowing two years at Kansas State University, Mitch was drafted in the 5th round of the 1988 NBA draft by the Warriors and played for the California team until 1991. During his first season, he earned the NBA Rookie of the Year Award.\n\nRELATED VIDEO: Basketball Player Lauren Hill Dies After Battle With Cancer\n\nHe went on to play for the Kings for seven years until 1998, where he was then traded to the Wizards and played for them until 2001. That same year, Mitch signed as a free agent with the Lakers.\n\nThe six-time NBA All-Star hung up his jersey for good in 2002 and was inducted into the Naismith Memorial Basketball Hall of Fame in 2014. He was also inducted into the Bay Area Sports Hall of Fame in San Francisco in 2016 and has his #2 jersey retired by the Kings.\n\nView photos Mitch Richmond and Shane More\n\nRELATED: Standout College Basketball Star, 22, Shot and Killed by His Sister: Police\n\nIn a statement to The Sacramento Bee, a spokesperson for the Kings said they were “extremely heartbroken to learn of Shane Richmond’s unexpected passing.”", "description": "NBA Hall of Famer Mitch Richmond's Son Shane, 20, Dies Suddenly", "authors": ["Joelle Goldstein"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Ws11vz9ETIQBvW789IYZCw--~B/aD0xODAwO3c9MjcwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/people_218/7c6c2f2f5f31b85845fff3ead8947f71", "published_at": "2019-10-10"}