{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7534111/Natalie-Portman-puts-leggy-display-red-ruffle-sleeved-dress.html", "downloaded_at": "2019-10-05 08:59:10.281155+00:00", "title": "Natalie Portman wears red dress and tells of Lucy in the Sky training", "language": "en", "text": "She's starring as an astronaut in new film Lucy In The Sky.\n\nAnd Natalie Portman put her out-of-this-world figure on display in a bright red dress with an A-line hem as she made her way out of the Good Morning America studio in NYC.\n\nThe 38-year-old Oscar winner grinned from ear-to-ear as she navigated the pavement in strappy black stiletto heels.\n\nRed-hot: Natalie Portman put her out-of-this-world figure on display in a bright red dress with an A-line hem as she made her way out of the Good Morning America studio in NYC\n\nShe carried a Dior crossbody bag in one hand and coated her lips with a swipe of matching red lipstick.\n\nPortman appeared on the show alongside co-star Jon Hamm to promote Lucy In The Sky.\n\nThe two opened up about the research they did to prepare for filming.\n\nOn-the-go: The 38-year-old Oscar winner grinned from ear-to-ear as she navigated the pavement in strappy black stiletto heels\n\nAccessorizing: She carried a Dior crossbody bag in one hand and coated her lips with a swipe of matching red lipstick\n\nOn-air: Portman appeared on the show alongside co-star Jon Hamm to promote Lucy in the Sky\n\nHamming it up! Jon looked smart in a slick suit with leather shoes\n\n'I was really lucky to get to go to NASA and meet some astronauts during my tour there,' she began.\n\n'It's so wild - they have this huge pool where they train so they can feel weightlessness and they have the entire international space station built underwater so they can practice their missions. So amazing,' Portman said.\n\nHamm was fascinated by a conversation he had with an actual astronaut.\n\n'I spoke to one guy in particular who spent six months on the space station and it really does kind of mess with you,' he said.\n\nScreen star: Lucy in the Sky centers on Lucy Cola, a strong female astronaut who has a moving experience in space and becomes disillusioned with reality once she returns home to a world that feels too small\n\n'When you see the sun rise every 90 minutes, you get a very different sense of what days are.\n\n'He was there for six months and he said your whole perspective kind of switches.\n\n'And that's what we talk about in the film - how that really messes with your head, when you come back to earth, you don't really have anyone to talk to about it. And going to space is a very unique experience.'\n\nLucy In The Sky centers on Lucy Cola, a strong female astronaut who has a moving experience in space and becomes disillusioned with reality once she returns home to a world that feels too small.\n\nIt hits theaters on Friday, October 4.", "description": "She's starring as an astronaut in new film Lucy in the Sky. And Natalie Portman put her out-of-this-world figure on display in a bright red dress with an A-line hem as she made her way", "authors": ["Marisa Okano For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/16/19260544-0-image-a-24_1570116881735.jpg", "published_at": "2019-10-03"}