{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/2019/10/10/impeachment-giuliani-lev-parnas-igor-fruman-subpoena/3929966002", "downloaded_at": "2019-10-10 18:49:19.464641+00:00", "title": "Lawmakers subpoena Giuliani associates in Trump impeachment inquiry — hours after their arrests", "language": "en", "text": "USA TODAY\n\nWASHINGTON – Two Ukrainian-born business partners who dined with President Donald Trump at the White House and worked with his personal attorney Rudy Giuliani were subpoenaed by House Democrats as part of its impeachment inquiry — just hours after they were arrested on federal campaign finance charges.\n\nLev Parnas and Igor Fruman helped Giuliani meet a Ukrainian prosecutor as part of the push for an investigation into Trump's political rival Joe Biden. Both of the men were scheduled to appear before the House Oversight, Intelligence and Foreign Affairs committees as witnesses in the impeachment inquiry of Trump.\n\nParnas failed to appear Thursday before the panels and Fruman was scheduled to appear on Friday. The men were arrested late Wednesday, according to federal authorities.\n\n\"Your clients are private citizens who are not employees of the Executive Branch. They may not evade requests from Congress for documents and information necessary to conduct our inquiry,\" the chairmen of the three panels wrote in the subpoena.\n\nThey continued: \"They are not exempted from this requirement merely because they happen to work with Mr. Giuliani, and they may not defy congressional subpoenas merely because President Trump has chosen the path of denial, defiance, and obstruction.\"\n\nThe subpoena demands documents related to Ukraine by Oct. 16. It does not outline an exact date for the men to appear before the panels, only saying that \"the Committees also expect your clients to appear to testify about these matters at a later date.\"\n\nMore:Two Giuliani associates involved in Trump-Ukraine controversy arrested on campaign finance charges\n\nThe subpoena did not mention the arrests of the men, nor did it mention the campaign contributions that federal authorities said “conspired to circumvent the federal laws against foreign influence by engaging in a scheme to funnel foreign money to candidates for federal and state office so that the defendants could buy potential influence with candidates, campaigns and the candidates’ governments.\"\n\nBut the timing of the arrests and subpoenas complicates the role Parnas and Fruman could have in the impeachment inquiry.\n\nParnas and Fruman, who were born in Ukraine when it was part of the Soviet Union and now live in Florida, have become political players in recent years. In May 2018, Parnas posted pictures on Facebook of himself and Fruman with Trump in the White House and with the president's son Donald Jr. in California. That was the same month their company, Global Energy Producers, was credited with giving $325,000 to the committee that supports Trump's reelection, America First Action SuperPac.\n\nThe campaign contribution sparked a complaint to the Federal Election Commission – and at least two lawsuits – because of questions about the source of the money.\n\nGiuliani ties: Trump-Ukraine scandal puts spotlight on Rudy Giuliani's business ties\n\nThe subpoena is just the latest House Democrats have issued in their rapidly escalating impeachment inquiry. The panels have issued such demands to the White House, Giuliani, Secretary of State Mike Pompeo, the Pentagon and the Office of Management and Budget.\n\nHouse Democrats also subpoenaed Gordon Sondland, a U.S. ambassador involved in the Trump administration's dealings with Ukraine, after the State Department blocked his appearance before them.\n\nThe impeachment investigation has centered on whether Trump improperly used the power of his office to further his own political aims by pushing Ukraine to investigate Biden. During a phone call on July 25 phone call, Trump asked Ukrainian President Volodymyr Zelensky to look into Biden but he has insisted there was nothing improper about the call.\n\nThe requests for the investigation came at a time when the Trump administration was holding up hundreds of millions in military aid for Ukraine. Trump has said there was no quid pro quo between the request to investigate Biden and the military aid.\n\nWhite House counsel Pat Cipollone notified House Speaker Nancy Pelosi, D-Calif., and the three committee chairmen Tuesday that Trump would not cooperate with an investigation he considers partisan and unfair.\n\nParnas and Fruman drew the congressional spotlight because they helped arrange a meeting in January in New York between Giuliani and Ukraine’s then-prosecutor general, Yuri Lutsenko, according to Ukrainian media reports.\n\nLutsenko is at the heart of the impeachment inquiry because Trump and Giuliani pushed an unsubstantiated claim that Biden urged for the prosecutor's removal in 2016 to thwart an investigation into a company tied to his son Hunter. Biden denied wrongdoing, and Lutsenko told The Washington Post that Hunter Biden \"did not violate anything.”\n\nContributing: Kevin Johnson and Bart Jansen\n\nMore:All of the people who have been subpoenaed so far in House Democrats' impeachment inquiry", "description": "Lev Parnas and Igor Fruman, Ukrainian-born businessmen who worked with Trump attorney Rudy Giuliani, were subpoenaed hours after they were arrested.", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/10/10/USAT/0da4bc84-84d4-473e-be92-3980c9cf54ce-Fruman_and_Parnas.jpg?crop=892,502,x1,y14&width=860&height=502&format=pjpg&auto=webp", "published_at": "2019-10-10"}