{"pub": "politico", "url": "https://politico.eu/article/laszlo-trocsanyi-russia-concerns-fueled-rejection-of-hungary-commission-nominee-romania-rovana-plumb", "downloaded_at": "2019-09-27 11:32:58.662828+00:00", "title": "Russia concerns fueled rejection of Hungary’s Commission nominee", "language": "en", "text": "László Trócsányi at the EU Parliament in Brussels in 2017 | Stephanie Lecocq/EFE via EPA Russia concerns fueled rejection of Hungary’s Commission nominee European Parliament panel also raised red flag over loan to Romanian candidate, letters show.\n\nMembers of the European Parliament cited concerns about \"connections to Russia\" in rejecting the Hungarian nominee for the next European Commission, László Trócsányi.\n\nThe Parliament's legal affairs committee on Thursday blocked the confirmation of both Trócsányi, slated to become commissioner for relations with the EU's neighbors, and Romanian nominee Rovana Plumb, who had been selected as transport commissioner.\n\nThe committee did not publicly detail its reasons for the decisions, which presented a first major test for Commission President-elect Ursula von der Leyen. But letters sent by the committee chair, seen by POLITICO, spell out their concerns in more detail.\n\nIn Plumb's case, the committee cited a loan she had received from someone \"operating professionally in the area of tourism\" and said it was not clear how the money was to be repaid \"in an open and transparent manner.\" It suggested issues raised by the loan might \"continue to create potential conflict of interests also in relation to other portfolios.\"\n\nIn the case of Trócsányi, a former justice minister, the committee's concerns centered on his relationship with a law firm he co-founded, Nagy és Trócsányi, and on various decisions connected to Russia.\n\nThe committee was especially concerned by \"his connections to Russia, especially having regard to his role as minister of justice in the extradition of Russian suspects to Russia, who were subsequently allegedly released, despite a prior extradition request from the U.S.,\" according to a letter sent by committee chair Lucy Nethsingha to Parliament President David Sassoli.\n\nDuring his tenure as justice minister, Trócsányi approved the extradition of suspected Russian arms dealers, Vladimir Lyubishin Sr. and Vladimir Lyubishin Jr., to their home country, despite a U.S. extradition request and joint Hungarian-American work on the case. The suspects were later released.\n\nThe United States complained publicly last November about Hungary's decision and said it raised \"questions about Hungary’s commitment to law enforcement cooperation.\"\n\nHungary's justice ministry said that Trócsányi made the decision to extradite the suspects to Russia based on judicial decisions, relevant laws, and international agreements.\n\nThe European Parliament committee also raised concerns in its letter about Trócsányi's \"involvement as minister of justice in a 2018 contract obtained by Nagy és Trócsányi law firm regarding Paks II Nuclear Power Plant despite the existence of a conflict of interest clause.\"\n\nRussia has lent Hungary funding for the expansion of the nuclear plant, with Russian state-owned Rosatom acting as the main contractor for the project.\n\nRelations with Russia are an important aspect of the job Trócsányi was slated to fill. As commissioner for neighborhood and enlargement, he would be dealing with countries such as Ukraine and Western Balkan states where Russia has a major strategic interest.\n\nThe Hungarian candidate had earlier told lawmakers that the law firm, which he founded in 1991, did not receive new Hungarian government contracts during his tenure as justice minister. However, papers made public last year indicated that the firm signed a contract with the Hungarian prime minister's office to provide legal assistance connected to the Paks project.\n\nTrócsányi had said in a statement before the committee vote that \"during my tenure as minister of justice between 2014 and 2019 'Nagy & Trócsányi' declined all new work from the Hungarian government, although work continued on existing matters.\"\n\nThe committee, however, wrote that it has concerns about \"multiple and clear involvement in the Nagy és Trócsányi law firm\" and \"the appointment of a co-owner of the Nagy és Trócsányi law firm as his personal advisor in the Ministry of Justice at a time when the Commissioner-designate still owned 12.6 percent of that firm.\"\n\nHungarian Prime Minister Viktor Orbán on Friday morning defended his candidate. He suggested the vote to reject Trócsányi was linked to the government's hard line against migration from outside the EU.\n\nTrócsányi is \"the most suitable person\" for the Commission post, Orbán told state-owned radio. \"His sin is that he helped the government and me personally defend Hungary from migration,\" the prime minister said.\n\nOrbán said that he spoke with von der Leyen on Thursday and they had decided to speak again after receiving a written explanation of the committee's decision.\n\nOn Thursday, Trócsányi himself branded the move \"a political decision ... lacking any factual basis.\"\n\n\"I fully intend to take all legal steps against it,\" he declared.\n\nHans Joachim von der Burchard contributed reporting\n\nThis article is from POLITICO Pro: POLITICO’s premium policy service. To discover why thousands of professionals rely on Pro every day, email pro@politico.eu for a complimentary trial.", "description": "European Parliament panel also raised red flag over loan to Romanian candidate, letters show.", "authors": ["Florian Eder", "Lili Bayer"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/h_53355488-1200x628.jpg", "published_at": "2019-09-27"}