{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7628715/Its-hat-trick-state-school-educated-THREE-England-team.html", "downloaded_at": "2019-10-30 04:15:36.126415+00:00", "title": "It's a hat-trick for state school that educated THREE of England team", "language": "en", "text": "George Ford, Owen Farrell and Maro Itoje (pictured) all attended St George's School, Harpenden in Hertfordshire\n\nOne-fifth of the players expected to compete for England in the Rugby World Cup final on Saturday went to the same state school.\n\nGeorge Ford, Owen Farrell and Maro Itoje all attended St George's School, Harpenden in Hertfordshire, the Times reported.\n\nAnother member of the England Rugby Team, Jack Singleton, 23, was also educated at the school, which was founded in 1907.\n\nThe team are set to take part in the Rugby World Cup Final against South Africa on Saturday, which could see England become world champions for the first time since 2003.\n\nSpeaking ahead of the game, St George's head of rugby Neil Harris said spoke of his pride at the former pupils' sporting success.\n\nHe said: 'We have photos of the England boys on the walls and it really inspires the other pupils. They love watching England games knowing they have that connection to the players'.\n\nSt George's was one of Britain's very first mixed-sex boarding schools, educating both day and boarding pupils between the ages of 11 and 18.\n\nAnother member of the England Rugby Team, Jack Singleton, 23, was also educated at the school, which was founded in 1907 (Pictured: St George's)\n\nThe school is not selective, but those who wish to take one of 100 boarding spots must apply for a place.\n\nThe majority of the England team attended the school as day pupils from the local catchment area, but Itoje was a boarder.\n\nAnd despite the school's impressive catalogue of sporting stars, the pupils nowadays only undertake two hours of physical education each week.\n\nRugby is largely taught in students' free time, before and after school and in their lunch break, according to Mr Harris.\n\nHe said: 'All our rugby teams train twice a week after school. There is also a lunchtime skills clinic for various positions and teams as well as a strength and conditioning programme that the boys do before school starts.'\n\nThe team are set to take part in the Rugby World Cup Final against South Africa on Saturday, which could see England become world champions for the first time since 2003 (Pictured: George Ford and Owen Farrell at school)\n\nA fascinating school photo shows a nine-year-old Billy Vunipola as a budding rugby star as he poses with boys a year older than him in his under-11s club\n\nThe team have coaches from the nearby Harpenden Rugby club and the school partners with European Champions Cup holders Saracan.\n\n'All the England boys were picked for the Saracens pathway programme about the age of 14 or 15. The coaching there is outstanding as well. Saracens have been very supportive of our school,' Mr Harris added.\n\nIt comes after a fascinating school photo showed a nine-year-old Billy Vunipola as a budding rugby star as he posed with boys a year older than him in his under-11s club.\n\nIt's plain to see that England hero Billy, 26, showed signs of becoming a major athlete at a young age as the star-in-the-making towers over his teammates in the astonishing picture.\n\nBilly and his brother Mako, 28, who were born in Australia to Tongan parents, both featured in England's semi-final win against New Zealand on Saturday.\n\nAlso in the school snap of the East Wales Schools Under-11s is former Welsh rugby player Harry Robinson. Billy won a scholarship to Harrow before signing his first contract at 20.", "description": "George Ford, Owen Farrell and Maro Itoje all attended St George's School, Harpenden in Hertfordshire. Jack Singleton, 23, was also educated at the school.", "authors": ["Faith Ridler For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/02/20356654-0-image-a-77_1572401732389.jpg", "published_at": "2019-10-30"}