{"pub": "axios", "url": "https://axios.com/synthetic-realities-fiction-stories-fact-misinformation-ed86ce3b-f1a5-4e7b-ba86-f87a918d962e.html", "downloaded_at": "2019-10-13 00:20:11.848646+00:00", "title": "Welcome to our new synthetic realities", "language": "en", "text": "Why it matters: The distinction between fact and fiction is up for grabs as the boundary separating them gets increasingly fuzzy. And arguments over whose reality is most real are already derailing politics and society.\n\nThese technologies can enrich the physical world around us, supercharging art and our relationships with other humans. But just as the dominance of social media brought unforeseen harms, so might these developments.\n\n\"People are already living in synthetic realities,\" says Justin Hendrix, director of the NYC Media Lab. \"They feel like they're in a perpetual state of conflict.\"\n\nSocial media rose on a wave of enthusiasm for its capacity to connect people and champion freedom. \"We were blindsided\" when the algorithms' underbelly began to show, Hendrix says. He leads a group of engineers, lawyers, VCs and others that meets quarterly to discuss the impacts of synthetic media on society.\n\nIn New York City last month, I saw the glimmers of newly emerging layers of reality.\n\nI visited Betaworks, a VC firm that recently ran an incubator for startups creating synthetic, AI-generated media — music, stock photography, even pop stars. \"People are not limiting what they seem like in a virtual world to the rules of the physical world,\" says Matt Hartman, a Betaworks partner.\n\na VC firm that recently ran an incubator for startups creating synthetic, AI-generated media — music, stock photography, even pop stars. \"People are not limiting what they seem like in a virtual world to the rules of the physical world,\" says Matt Hartman, a Betaworks partner. At a Verizon 5G Lab, I saw a slime-green motion-capture room that can quickly make an animatable 3D model out of a person who stands inside. The model could be inserted into a film or a video game — or into a fake sex tape or some other compromising virtual situation.\n\nI saw a slime-green motion-capture room that can quickly make an animatable 3D model out of a person who stands inside. The model could be inserted into a film or a video game — or into a fake sex tape or some other compromising virtual situation. And at NYU, I met Paul Barrett at the Center for Business and Human Rights, who follows the destructive path of disinformation online. In a new report he outlines threats to the 2020 election, including the prospect that people will be tricked on social media into gathering — and clashing — in the real world.\n\nI met Paul Barrett at the Center for Business and Human Rights, who follows the destructive path of disinformation online. In a new report he outlines threats to the 2020 election, including the prospect that people will be tricked on social media into gathering — and clashing — in the real world. Bonus: Biking over the Williamsburg Bridge on a Saturday, I pedaled under a slogan painted on the steel trestlework: \"Don't let reality ruin your life.\"\n\nWhat's next: You can expect that these synthetic realities will become more engaging as the technologies that power them develop, and that you will spend more time in them — whether you know it or not.", "description": "Super-engaging parallel worlds are coming to define how we understand and interact with each other.", "authors": [], "top_image": "https://images.axios.com/zH_zNxzDa4Yz1ii0DkW2lxNqp6k=/0x0:1280x720/1920x1080/2019/09/14/1568427166476.gif", "published_at": "2019-09-14"}