{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/20/nfls-antonio-brown-investigation-will-reportedly-include-intimidating-texts-an-accuser", "downloaded_at": "2019-09-20 12:55:18.992007+00:00", "title": "NFL’s Antonio Brown investigation will reportedly include intimidating texts to an accuser", "language": "en", "text": "\n\nThe NFL continues its investigation of Antonio Brown. (Steven Senne/AP)\n\nAs the NFL continues to weigh the possibility of putting New England Patriots wide receiver Antonio Brown on paid leave via placement on its commissioner’s exempt list, the league’s investigation of Brown reportedly will now include consideration of an allegation that he sent intimidating text messages to a woman who accused him of inappropriate conduct.\n\nSports Illustrated reported that the league responded to a letter sent Thursday night by the woman’s attorney and arranged for a phone call between the NFL’s investigators and the woman’s legal representatives.\n\n[Jaguars ride Gardner Minshew and a devastating defense through Titans and a torrent of penalty flags]\n\nThe woman told Sports Illustrated in a previous report that Brown hired her in 2017 to paint a mural in his home but cut off contact with her when she ignored his unwanted sexual advance. After that initial report, according to Sports Illustrated, the woman received a group text Wednesday night that appeared to come from a phone number Brown had once given her, and that accused her of fabricating her account of the alleged 2017 incident. The text chain included photos of her and her children and was characterized by the woman as intimidating, according to the report.\n\nThe NFL’s personal conduct policy prohibits “stalking, harassment, or similar forms of intimidation.” The league did not immediately respond to a request for comment early Friday morning.\n\nLeague representatives met for 10 hours Monday with another woman, Britney Taylor, who accused Brown of rape and sexual assault in a lawsuit in Florida. Brown has not been charged with a crime and denied Taylor’s allegations through his attorney.\n\nAccording to multiple people familiar with the situation, the league is considering placing Brown on the exempt list. That would result in him being on paid administrative leave. He would be ineligible to play in games for the Patriots or participate in practices.\n\nAlthough Brown has not been charged with a crime, the NFL’s personal conduct policy empowers Commissioner Roger Goodell to place Brown on the exempt list if Goodell believes after an investigation that the conduct policy may have been violated.\n\nGoodell would decide when Brown would be reinstated from the exempt list. The list, in general, is designed to be used by the league until the NFL makes a decision about potential discipline under the personal conduct policy. Any suspension imposed by the league under the conduct policy would be without pay.\n\nBrown would have the right to appeal his placement on the exempt list through the NFL Players Association.\n\nHe has played one game for the Patriots since being signed following his release by the Oakland Raiders. The Patriots host the New York Jets this Sunday in Foxborough, Mass.\n\nRead more NFL coverage:\n\nNFL power rankings Week 3: Cowboys, Ravens move up as others suffer QB unrest\n\nBrewer: If Drew Brees and Ben Roethlisberger can’t stay healthy, good luck to the NFL\n\nThe NFL’s great quarterback transition is happening, and the most flexible teams will thrive\n\nLamar Jackson will let you choose how he beats you\n\nTroy Aikman says NFL officiating issues are ‘maddening’ and ‘nauseating’\n\nEli Manning being benched for Daniel Jones was inevitable. The only surprise is the timing.\n\nThe NFL’s pass interference replay rule has brought more confusion than clarity", "description": "The league continues to weigh whether to place the Patriots wide receiver on paid leave.", "authors": ["Mark Maske", "Sports Reporter Covering The Nfl", "September At Am", "Mark Maske Covers The Nfl For The Washington Post. He Has Covered The Nfl", "The Washington Redskins Since He Previously Covered Baseball", "The Baltimore Orioles", "The Effort To Bring A Major League Team To Washington"], "top_image": "https://www.washingtonpost.com/resizer/0rsI-2OwRXoU_xmGGg9qvBG_4M0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KS72GKG3EII6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-20"}