{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7578499/Rachel-Weisz-liberating-directed-woman-alongside-Scarlett-Johansson-Black-Widow.html", "downloaded_at": "2019-10-16 08:30:03.798219+00:00", "title": "Rachel Weisz found it liberating being directed by woman alongside Scarlett Johansson in Black Widow", "language": "en", "text": "Rachel Weisz is opening up about several things including her new female-directed Marvel movie Black Widow and why she's not brave in a new interview.\n\nThe 49 year old actress was named as one of this year's The Greats by New York Times Magazine along with Louis Vuitton designer Nicolas Ghesquiere, artist/sculptor Nick Cave and architect Shigeru Ban.\n\nEach of these Greats are individuals, who, 'in mastering their crafts, have changed their fields — and the culture at large. They have in common an essential and fierce desire to communicate, whether through beauty or provocation, or both.'\n\nOpening up: Rachel Weisz is opening up about several things including her new female-directed Marvel movie Black Widow and why she's not brave in a new interview\n\nWeisz plays Melina Vostokoff in Black Widow, otherwise known in the Marvel comics as Iron Maiden, who the actress called, 'a pretty tough chick' at Comic-Con in July.\n\nWeisz is joined by Scarlett Johansson as the title character, Natasha 'Black Widow' Romanoff and Florence Pugh's Yelena Belova, who are all, 'skilled assassins, and at least one is on the side of justice.'\n\nBlack Widow is also the first movie to be directed solely by a woman, Cate Shortland, after this year's blockbuster Captain Marvel which was directed by the team of Anna Boden and Ryan Fleck.\n\nTough chick: Weisz plays Melina Vostokoff in Black Widow, otherwise known in the Marvel comics as Iron Maiden, who the actress called, 'a pretty tough chick' at Comic-Con in July\n\nAs it turns out, Weisz had long wanted to work with Shortland, after admiring her 2004 film Somersault starring up and coming actress Abbie Cornish.\n\n'(Abbie) is a beautiful, sexy girl, and a lot of it is about her sexuality. Cate didn't shy away from that. But she wasn't objectified,' Weisz said.\n\n'Watching that, as a woman, you know immediately when a character is subject or object — she was always subject. I had never seen anything like it. For that reason, I never forgot it.'\n\nDirector admiration: As it turns out, Weisz had long wanted to work with Shortland, after admiring her 2004 film Somersault starring up and coming actress Abbie Cornish\n\nWeisz added that she would often think about a project and say, 'If only we could get Cate Shortland to direct it,' and she had tried to collaborate with her before but it didn't work out.\n\nShe also reflected about a scene in Black Widow where there were two women across from another that she found 'liberating.'\n\n'There is something that happens in a scene when a woman is across from another woman,' said Weisz. 'It sounds really pompous, but you are free from the history of ownership — I really mean that. It's liberating.'\n\nWeisz's breakthrough role was in 1999's big budget blockbuster The Mummy, alongside Brendan Fraser, but through the past 20 years, she's primarily starred in smaller projects until Black Widow.\n\nThis is her first foray into the Marvel Cinematic Universe, and the actress revealed that she enjoyed her time on the set and was surprised about how passionate the producers were about the story.\n\n'It doesn’t feel Hollywood to me, big budget — it feels like the people there are the stewards and guardians of this storytelling they care about,' she said.\n\nBreakthrough: Weisz's breakthrough role was in 1999's big budget blockbuster The Mummy, alongside Brendan Fraser, but through the past 20 years, she's primarily starred in smaller projects until Black Widow\n\nWeisz was praised by director Yorgos Lanthimos, her director in The Favourite and The Lobster, who said, 'I don’t think she even knows where she is going most of the time. Which is very brave, and a rare quality. Actors want to have control.'\n\nHer co-star in The Favourite, Olivia Colman, who won an Oscar for playing Queen Anne, also called her 'utterly brave,' but Weisz dismissed that notion.\n\n'I’m shy in real life,” she said. 'But if I have a role in the script and a story to tell, I’m not going to shy away.'\n\nBlack Widow will kick off the summer movie season next year, hitting theaters on May 1, 2020.", "description": "Rachel Weisz is opening up about several things including her new female-directed Marvel movie Black Widow and why she's not brave in a new interview.", "authors": ["Brian Gallagher For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/08/19775856-0-image-a-110_1571210415247.jpg", "published_at": "2019-10-16"}