{"pub": "fox", "url": "https://foxnews.com/media/lindsey-graham-senate-judiciary-committee-horowitz-fisa", "downloaded_at": "2019-09-12 07:24:00.610795+00:00", "title": "Sen. Lindsey Graham: Senate Judiciary Committee will call DOJ inspector general to testify on FISA", "language": "en", "text": "Sen. Lindsey Graham told Fox News' Sean Hannity he plans to call Justice Department Inspector General Michael E. Horowitz before the Senate Judiciary Committee to testify about his report on alleged FISA abuse.\n\nGraham, a South Carolina Republican who chairs the Senate panel. said Wednesday on \"Hannity\" he will aim to have the proceedings be as transparent as possible for the American people.\n\n\"We're going to pursue this in a transparent fashion,\" Graham said. \"We're going to declassify as much as we can, including the FISA warrant applications.\"\n\nGOP LEADERS BLAST DEMS FOR REFUSING TO SCHEDULE IG TESTIMONY AFTER COMEY REPORT\n\nGraham said he will seek to publicize information about former British spy Christopher Steele, who compiled the document known as the Trump-Russia dossier.\n\n\"I'm going to give you all the information that was in the system about how suspicious people were of Christopher Steele, how biased he was, [and] let you read it for yourself. Transparency and accountability is my goal,\" he said.\n\n\"I don't know what he's going to say,\" he added of Horowitz.\n\nIn response, Hannity asked whether there was \"overwhelming, incontrovertible evidence\" of \"premeditated fraud on a FISA court\" and denying then-candidate Trump some of his constitutional rights.\n\nGraham told Hannity Steele's dossier is still unverified and remains \"a piece of garbage\" in his view.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"The system had a lot of notice about his bias,\" he said of the British ex-spy.\n\n\"Mr. Durham will make a decision as to who to prosecute, if anyone,\" he added, referencing John Durham, the federal prosecutor in Connecticut tasked by Attorney General William Barr with investigating the origins of the Russia probe.\n\n\"My goal is to explain to you and the American public how the system failed and make sure it never happens again.\"", "description": "Sen. Lindsey Graham told Fox News' Sean Hannity he plans to call Justice Department Inspector General Michael E. Horowitz before the Senate Judiciary Committee to testify about his report on alleged FISA abuse.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Graham-Hannity_FOX.jpg", "published_at": "2019-09-12"}