{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/20190908610/apple-bets-more-cameras-can-keep-iphone-humming", "downloaded_at": "2019-09-08 12:53:28.874935+00:00", "title": "Apple Bets More Cameras Can Keep iPhone Humming", "language": "en", "text": "By Tripp Mickle\n\nApple Inc.'s iPhone is expected to remain the star of the company's annual publicity showcase this week, as it has been for the past dozen years. But the spotlight is turning toward a younger cast of products that Apple needs to galvanize growth.\n\nOn Tuesday, Apple plans to reveal a trio of new iPhones with additional rear cameras and enhanced capabilities for low-light photos, according to people familiar with the plans. Analysts expect the phones to also feature faster processors, new exterior colors such as green and purple, and wireless charging for other devices such as AirPods wireless earbuds.\n\nThe expected updates aren't exactly inspiring Wall Street, with some analysts and investors predicting the forthcoming iPhones will be boring. With sales of its long-in-the-tooth phones flagging, Apple is beefing up its portfolio of connected, high-price products, including the Apple Watch, AirPods and subscription services for TV shows and videogames.\n\n\"They're treading water now, just trying to keep the iPhone afloat,\" said Dan Morgan, a senior portfolio manager who focuses on tech at Synovus Trust Co., which counts Apple among its largest holdings. He is optimistic that this year's phones will have enough new features \"to put extra legs on a very mature product and keep the train going.\"\n\nThe just-enough attitude speaks to the challenge confronting Apple since the release of its first iPhone in 2007. The iPhone contributes more than half of Apple's total sales, putting the company in the awkward position of sustaining a core product while needing to become less dependent on it.\n\nRecent iPhone advances such as facial-recognition technology haven't resonated with some customers, who tend to view Apple's products as less unique and its brand as less aspirational than in years past, according to UBS's annual global survey of 8,000 smartphone customers released in May. Many people are holding on to their devices longer and aren't compelled to upgrade to new iPhones that have an average price of $949.\n\nThe company needs to sell enough iPhones over the next year to avoid a repeat of the disappointing results that dogged it after the release of the XR and XS models last September. Weak sales of those devices forced the company in January to slash guidance for the first time in more than 15 years.\n\nApple is forecast to sell about 70 million units of the new iPhones before the end of the year--nearly 30% fewer than its peak of 98 million units of its newest models in 2014, according to trading firm Susquehanna International Group.\n\nThe modest projections for 2019 have investors looking ahead to 2020, when Apple is expected to release its first iPhone with 5G, a fifth generation of cellular networking that is supposed to improve wireless speeds.\n\nApple's transition from iPhone to post-iPhone will assume new energy in coming weeks: The company, in addition to unveiling new smartphones this week, is expected to reveal a fifth version of its smartwatch that analysts say will have new casing and improved battery life, and be further liberated from the iPhone with a full App Store.\n\nThe new smartwatch is expected to add more health features, including the ability to track sleep patterns, analysts say.\n\nThe addition of those features would deepen Apple's foray into health, a category that Chief Executive Tim Cook said would redefine the company. The fourth-generation Apple Watch, released in 2018, was equipped with electrodes and sensors that turned it into an electrocardiogram able to measure a heart's electrical activity and detect potentially dangerous disorders.\n\nHealth capabilities helped Apple increase its smartwatch shipments to 5.7 million in the most recent quarter, a 50% increase from a year earlier, according to Strategy Analytics. And smartwatch sales have helped lift Apple's wearables and accessories business, including AirPods, by 35% to nearly $18 billion through the first three quarters of this fiscal year.\n\nApple also is on the cusp of releasing new subscription services for TV shows and videogames announced in March. The company could announce pricing and availability for those services, known as TV+ and Arcade, as soon as this week, analysts say.\n\nThe combination of wearables and services will be key for Apple to move past the iPhone, said Neil Mawston of Strategy Analytics. He said the last mobile phone giant, Nokia Corp., struggled when it attempted to make a similar transition with its business.\n\nYoko Kubota contributed to this article.\n\nWrite to Tripp Mickle at Tripp.Mickle@wsj.com\n\n(END) Dow Jones Newswires\n\nSeptember 08, 2019 08:14 ET (12:14 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-08"}