{"pub": "fox", "url": "https://foxnews.com/us/texas-man-threatening-san-antonio-mayor-police", "downloaded_at": "2019-10-13 23:36:28.998092+00:00", "title": "Texas man arrested for threatening San Antonio mayor 14 times in 2 days on Facebook", "language": "en", "text": "A Texas man was arrested Friday on charges that he sent more than a dozen threatening messages to San Antonio’s mayor over two days, leading the mayor’s staff to believe the man could be “the next mass shooter,” according to a warrant affidavit.\n\nAdam Thomas Converse, 25, is facing charges of making a terroristic threat to a public servant and resisting arrest, the San Antonio Express-News reported.\n\nAccording to a warrant affidavit cited by the paper, Converse sent at least 14 threatening messages to San Antonio Mayor Ron Nirenberg through Facebook Messenger on Oct. 4 and Oct. 5.\n\n“It would be nicer to leave you all dead with no hope of life after death … I want to see people dead,” one of the messages reportedly said.\n\n“People will lose hands, arms, feet, and heads. Don’t even try me,” read another, according to the affidavit.\n\nNEW JERSEY MAN ALLEGEDLY THREATENED FARMERS WHO DENIED HIM SEX WITH ANIMALS\n\nNirenberg’s communications director reported the messages to police, saying that “his office feared (Converse) could be the next mass shooter based on his comments.”\n\nOfficers from San Antonio’s Mental Health Unit went to Converse’s residence on Oct. 5 and saw him walk out with a machete on his belt loop, the Express-News reported.\n\nThe affidavit said Converse told officers “he was a contract assassin with the government and if he had a license to kill, he would kill people.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nPolice said Converse resisted arrest when officers tried to detain him. He was taken to a hospital for a mental evaluation and later arrested.\n\nNirenberg's office did not immediately respond to Fox News' request for comment.", "description": "A Texas man was arrested Friday on charges that he sent more than a dozen threatening messages to San Antonio’s mayor, leading the mayor’s staff to believe the man could be “the next shooter,” according to a warrant affidavit.", "authors": ["Bradford Betz", "Bradford Betz Is An Editor For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/San-Antonio.jpg", "published_at": "2019-10-13"}