{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/oct/06/california-giant-sequoia-grove-alder-grove", "downloaded_at": "2019-10-06 11:29:53.607579+00:00", "title": "'Once they're gone, they're gone': the fight to save the giant sequoia", "language": "en", "text": "'Once they're gone, they're gone': the fight to save the giant sequoia\n\n'Once they're gone, they're gone': the fight to save the giant sequoia\n\nFew living beings have experienced as much as the giant sequoias. With ancestors dating back to the Jurassic era, some of the trees that now grow along California’s Sierra Nevada Mountains been alive for thousands of years, bearing witness to most of human history – from the fall of the Roman empire to the rise of Beyoncé.\n\nBut a couple hundred years of human encroachment on to the sequoias’ habitat, combined with the climate crisis, increasingly intense wildfires, and drought have threatened the species’ future. The last of the world’s most massive trees now live on just 73 groves scattered across the Sierras. Most lie within protected national parks such as Sequoia national park, where visitors flock from around the world to marvel at General Sherman, the world’s most massive tree.\n\nWhat is 'forest bathing' – and can it make your healthier? Read more\n\nBut not all sequoias are protected within the parks system. Now, in an ambitious bid to secure a future for them, a conservation group has struck an unusual deal to acquire the last, largest privately owned sequoia grove.\n\nThe deal is the result of two decades of discussions between the not-for-profit conservation group Save the Redwoods and the Rouch family, which has owned the 530-acre Alder Creek grove since before the second world war. The forest is home to hundreds of sequoias, including the Stagg Tree which – at more than 240ft tall and 100ft around – is the fifth-largest in the world.\n\nFacebook Twitter Pinterest A conservation group has struck an unusual deal to acquire the last, largest privately owned sequoia grove. Photograph: Lee Nicholson/Guardian Community\n\nThe Rouches agreed to sell their land for $15m, which the organization hopes to raise by the end of this year. Once they acquire the land, the group plans to work with ecologists to help the forest build resilience against global heating and its catastrophic consequences,\n\n“The forest is truly ancient,” said Sam Hodder, the president of Save the Redwoods. “And we’ve now got this extraordinary, unique opportunity to restore and protect it.”\n\nAlthough sequoias have evolved to withstand temperature changes, extreme heat and fire, drought and destructive wildfires are now proving to be the biggest threats to their survival.\n\nCuriously, decades of humans fighting fires has made the problem worse.\n\n“Giant sequoias really need wildfire,” explained Kristen Shive, a forest ecologist with Save the Redwoods. Their cones are cued up to open with the heat of a fire, releasing seeds that like to germinate in freshly burned, fertile forest floor.\n\nFor millions of years, “sequoias adapted to survive and thrive with regular, low-level fires”, Shive says. With their thick barks and high crowns, most mature giant sequoias are immune to fires that burn though almost everything else around them. “But over the past century, we moved in, and started stopping fires everywhere.”\n\nFacebook Twitter Pinterest Most giant sequoias lie within protected national parks. Photograph: Alamy\n\nWoody debris began to accumulate on the forest floor, and small trees and saplings began to overcrowd it. “That serves as kindling,” Shive says, feeding fires that burn longer, and hotter than sequoias can bear. Smaller trees serve as “ladders”, allowing the fires to climb up to the sequoia’s crowns and kill them.\n\nClimate change hasn’t helped. Intense heat waves and drawn-out periods of drought have left California’s forests drier, and more prone to wildfires.\n\nDroughts also depleted giant sequoias, weakening them and leaving them vulnerable to bark beetles that chomp through their bark and spread a fungus that can kill them. Healthy trees are usually able to fight off a beetle attack – but dehydrated trees are defenseless. “There’s a handful of giant sequoia trees that died in the recent drought,” said Anthony Ambrose, a plant ecologist at the University of California, Berkeley.\n\n“Restoring these lands and stewarding these groves is going to be a big job,” Ambrose said. “It takes a lot of money to take care of these lands.”\n\nSave the Redwoods plans to make that investment in the coming years, as well as install trails and roads “in a way that is mindful of the ecological sensitivity”, said the CEO Hodder, before eventually transferring the land to National Parks. “Once it’s ready, we really do want to give the public access to this area,” Hodder said. “Because it’s remarkable – the cinnamon bark, the incredible shades of green in the alpine meadows, that unique Sierra blue sky.”\n\nFacebook Twitter Pinterest The last of the world’s most massive trees now live on just 73 groves scattered across the Sierras. Photograph: Jeffrey Schwartz/Alamy\n\n“I firmly believe that a walk in these woods can make you a better person,” he said.\n\nMembers of the Rouch family concur.\n\n“We talked to a few buyers over the years, but I’m very happy we’re selling it to Save the Redwoods,” said Mike Rouch, who grew up in the forest, playing in the creeks and climbing the trees.\n\nRouch’s grandfather and father ran a logging business, and although they chopped down many fir, sugar pine and cedar trees to feed the family’s lumber mill, they left most of the sequoias to stand. “Nobody in the family ever really wanted to cut them down,” Rouch said. “For one, they’re not very good, structural wood. And the other thing is you just have to look at them. They’re so beautiful, and you realize once they’re gone, they’re gone.”", "description": "A conservation group plans to buy the largest privately owned sequoia grove as the climate crisis threatens the species’ future", "authors": ["Maanvi Singh"], "top_image": "https://i.guim.co.uk/img/media/99e67ec058cc8033451c159ff686af748ecace19/0_374_5616_3370/master/5616.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=97de772206fb719bde57b7a80abee841", "published_at": "2019-10-06"}