{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/23/nba-fans-defy-china-cheer-hong-kong-as-regular-sea", "downloaded_at": "2019-10-24 04:52:53.338054+00:00", "title": "NBA fans defy China, cheer Hong Kong as regular season tips off", "language": "en", "text": "China may be able to stifle LeBron James and others in the NBA, but not the league’s fans.\n\nThe official start of the NBA regular season Tuesday saw protesters hand out thousands of free pro-Hong Kong T-shirts outside the Staples Center in Los Angeles and Scotiabank Arena in Toronto, the only two venues to host games on opening night.\n\nIt was unclear how many fans actually wore the gold-and-black tees, but there were a number of pro-Hong Kong moments during the broadcasts that went viral, an indication that the controversy roiling the preseason is far from over.\n\nAt the Staples Center, a boy baited the “dance cam” by waving a Los Angeles Clippers jersey, then replaced it with a “Fight for Freedom/Stand with Hong Kong” tee. The camera panned away from him seconds later.\n\nDuring the halftime report at the game between the Lakers and Clippers, a protester waved an enormous red Hong Kong flag immediately behind the TNT broadcast booth.\n\nIn the pregame show, NBA Hall of Famer Shaquille O’Neal, part of the TNT broadcast team, declared that, “Daryl Morey was right,” referring to the Houston Rockets general manager whose pro-Hong Kong tweet ignited a cancellation of Rockets broadcasts and sponsorships in China.\n\n“As American people, we do a lot of business in China,” O’Neal said. “And they know and understand our values and we understand their values. And one of our best values in America is free speech. We’re allowed to say what we want to say, and we’re allowed to speak up on injustices, and that’s just how it goes.”\n\n🇭🇰 First NBA Halftime report and we have a Hong Kong flag. Love it pic.twitter.com/voKUJoL9jS — Tony Hernandez (@HernandezTony) October 23, 2019\n\nDemonstrators hand out t-shirts at NBA opening game between Lakers and Clippers to draw attention to pro-democracy movement in Hong Kong against China. This comes after controversial Lakers games in China. pic.twitter.com/yVZklcawUm — Jeff Nguyen (@jeffnguyen) October 23, 2019\n\nthere’s nothing like supporting the people of Hong Kong against China while criticizing Blizzard and the NBA that brings all the best and worst people from Twitter unified together as one in my mentions\n\n\n\ninspirational https://t.co/aIcS4aMObg — Rod Breslau (@Slasher) October 23, 2019\n\nArthur Dong, economics teaching professor at the McDonough School of Business at Georgetown University, said he expects to see fans keep up the pressure, especially in cities like Brooklyn and Toronto with large populations from China and Hong Kong.\n\n“I think there’s a great deal of support for what’s going on in Hong Kong,” Dong said. “I’m also seeing that the NBA is caught in this vise between what they’re trying to do in China, and trying to uphold their values as an American company. And I think this is a very difficult thing that the NBA is going through right now.”\n\nLakers superstar LeBron James was roundly decried earlier this month for saying Morey “wasn’t educated” on the situation.\n\nThe NBA was slammed for an initial statement calling Morey’s tweet “regrettable,” but since then the league has steadily strengthened its stance in support of free speech.\n\nIn a TIME100 interview on Thursday, NBA commissioner Adam Silver said he was asked by Chinese officials to fire Morey, and that he refused.\n\n“Obviously we made clear that — we were being asked to fire him, by the Chinese government, by the parties we dealt with, government and business,” Silver said. “And we said there’s no chance that’s happening. There’s no chance we’ll even discipline him.”\n\nThe NBA may have caught a break Wednesday in Hong Kong, where the government formally withdrew its fugitive extradition bill, the catalyst for months of pro-democracy protests that saw hundreds of thousands take to the streets.\n\nThe withdrawal may signal a retreat by China, or it could mean a regrouping before another effort to chip away at the “one country, two systems” policy between China and its “special administrative region.”\n\nWhat can China — or the NBA — do about the game-day protests? Not much, Dong said.\n\n“They can’t tell fans at the door, you’ve got to take that T-shirt off, or you can’t express yourself in the game, because then they would encounter a domestic backlash,” he said. “And American fans and Canadian fans would just disappear, and say, what, are you going to tell us that we now have to conform to Chinese rules? Are you an American sports organization or a Chinese sports organization?”\n\nHe said the most the NBA can do is keep cameras off those sporting political shirts or signs during games.\n\n“China’s not going to be happy, but this whole episode demonstrates why Hong Kongers are fighting,” Dong said. “They’re saying, this is what China does, they’re trying to restrict free expression and free speech, and China’s reaction to this whole NBA debacle shows it.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The official start of the NBA regular season Tuesday saw protesters hand out thousands of free pro-Hong Kong T-shirts outside the Staples Center in Los Angeles and Scotiabank Arena in Toronto, the only two venues to host games on opening night.", "authors": ["The Washington Times Http", "Valerie Richardson"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/23/10232019_pelicans-raptors-basketb-138201_c0-300-3600-2400_s1200x700.jpg?6e8fa2122182952c4f749abbd1695aa488e6a511", "published_at": "2019-10-23"}