{"pub": "businessinsider", "url": "https://businessinsider.my/self-made-millionaires-start-with-same-savings-strategy", "downloaded_at": "2019-09-30 00:50:04.598383+00:00", "title": "A man who interviewed 177 self-made millionaires says they all started with the same savings strategy", "language": "en", "text": "caption Whether you have a goal to reach $1 million or $10 million, you have to start somewhere. source visualspace/Getty\n\nThomas C. Corley spent five years studying millionaires and gathered his insights in several books, including “Change Your Habits, Change Your Life.”\n\nCorley interviewed 233 Americans with at least $160,000 in annual gross income and $3.2 million in net assets, 177 of whom were self-made.\n\nCorley found that in their pre-millionaire years, they started with the same goal to save 10% to 20% of their income.\n\nThey also used what he calls “the bucket system” to separate their savings into four categories.\n\nRead more personal finance coverage.\n\nWhether you have a goal to reach $1 million or $10 million, you have to start somewhere.\n\nThomas C. Corley, a certified public accountant and certified financial planner, spent five years studying millionaires and gathered his insights in multiple books, including “Change Your Habits, Change Your Life.”\n\nCorley interviewed 233 people with at least $160,000 in annual gross income and $3.2 million in net assets, 177 of whom were self-made. Through these interviews and analysis, Corley uncovered dozens of facts about rich people and their daily habits to piece together exactly how they got to where they are today.\n\nIn his book, Corley writes that 80% of the self-made millionaires he studied didn’t get wealthy until after age 50, but almost all of them started the same way.\n\n“The self-made millionaires in my study all set a goal of saving 10 to 20 percent of their income during their pre-millionaire years,” Corley wrote. The average American has a savings rate of about 8%, according to the St. Louis Federal Reserve.\n\nMore importantly, the pre-millionaires were intentional about where they put their savings. Using a strategy Corley calls “the bucket system,” they siphoned their savings into four general categories: retirement savings, specific expenses, unexpected expenses, and cyclical expenses.\n\nRetirement savings includes IRAs, annuities, 401(k)s, and other workplace retirement plans – that is, money invested for growth and to be spent later in life. Future education costs, wedding costs, a home down payment, and other big expected costs are part of the second bucket.\n\nThe third bucket is more or less an emergency fund – a separate account with cash to fall back on in the event of sudden job loss or a medical emergency. Lastly, the cyclical expenses bucket contains savings for birthday gifts, holidays, and vacations.\n\nThis savings strategy proved crucial for almost half of the millionaires in his study, who he says followed the Saver-Investor Path. They eventually were able to live on 80% or less of their take-home pay, remained consistent and patient, and never flaunted their wealth. Above all, they used time to their advantage.\n\n“Self-made millionaires make a habit of saving,” Corley writes. “The more you are able to save at an early age, the more wealth you’ll accumulate.”", "description": "Business Insider - Thomas C. Corley, author of \"Rich Habits,\" found that millionaires all started with the same goal to save 10% to 20% of their income.. Read more at businessinsider.my", "authors": ["Tanza Loudenback", "Business Insider Us"], "top_image": "https://static.businessinsider.my/sites/3/2019/09/5d8e740b2e22af22092f6d0a.png", "published_at": "2019-09-29"}