{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/on-parenting/how-to-navigate-the-relationship-with-your-teen-son/2019/09/10/95bed1b6-cffe-11e9-b29b-a528dc82154a_story.html", "downloaded_at": "2019-09-11 13:55:55.925903+00:00", "title": "How to navigate your relationship with your teen son", "language": "en", "text": "A: I was walking with a mother of a 13-year-old boy the other day, and she said: “He is awkward everywhere he goes. He takes up so much space in every room, and he leaves a trail of mess behind him. He isn’t sassy like my teen daughter, he’s just . . . kind of rude.” We laughed, sighed and went on our way. I then found myself remembering the young men I used to teach and counsel in middle and high school; how bungling yet wonderful it was. There were young men with mustaches and young men who looked about 8 years old. There were boys who had zits and boys who had baby faces. There were some who were elegant and graceful and some whose limbs seemed to have a mind of their own. Some were meticulous and orderly, and others could not find a single pencil in an overflowing backpack.\n\nA mom struggles to connect with her rough-and-tumble boys\n\nNo matter how they appeared to me, every young man felt physically awkward and emotionally unsure, full of potential and uncertainty.\n\nAs a teacher and school counselor, connecting to each young man felt daunting, but if I didn’t overthink it, the connections became apparent. Some boys liked shooting hoops, some boys liked doing crossword puzzles, some boys liked a job or a chore, and some boys liked talking sports and music. Almost every young man liked a stupid joke, especially if it was related to flatulence. And most avoided sustained eye contact and deep feelings, but if you waited long enough, they would emerge in some form or another.\n\n6 ways parents can stay connected with their teen sons\n\nAs a parent, you have a distinct and layered experience with your son, but the idea of connecting is not all that different. Like Gary Chapman famously writes about in his many books, every teen has a love language — you just need to figure out what clicks with your son. Are you going to be able to relate to him? Maybe or maybe not, but that doesn’t mean you can’t connect to him. It’s a nuanced difference. Look at relating as the ability to identify with him (which could be difficult), and look at connecting with him as simply facilitating communication, rapport and a feeling of warmth from you. His interior world is complicated, so just find a way to get in there.\n\nMake a list of everything your son likes to do. Don’t judge it, which is the death-knell of connection and teens, just make it. Sit back and ask, “Where can I fit in here?” Your son loves to game? How can you challenge him in some gaming? Your son loves to listen to music? Get into the music he likes. Your son likes to binge Netflix shows? Watch some together. Does he love burgers? Make a list of burgers to test in your town. You can schedule this, or you can let it be more organic, but either way, you need to decide to get in there. And as annoyed and mortified as he may act, these parental efforts are noticed and appreciated by teens, so don’t be dissuaded when he isn’t thanking you for watching “Stranger Things” with him. Play it cool.\n\nAs for chores, you will notice that I put connection first in this response. Young people, especially teens, are less likely to be helpful if they are discouraged in their relationship with their parent. The fastest way to discourage a good relationship is to constantly nag and bother your teen to do tasks. That being said, it is absolutely appropriate to give him discrete chores and tie them to consequences (or rewards, if you wish). Will you have a young man who still leaves towels and trash around his room? Probably. But that doesn’t mean you don’t fight the good fight; it is worth it. Just don’t allow the chores to upend your relationship. He doesn’t need to be happy about the work, and you don’t need to make him happy. Just proceed with your connection and the chores, chipping away at both, recalibrating when you need to. Your ability to hang in there is more important than finding the “just right way” to be there.\n\nTo understand more about your son’s mind, I suggest reading “Brainstorm: The Power and Purpose of the Teenage Brain” by Daniel Seigel. I also suggest anything by Michael Thompson, who has been working in the field for over 35 years. Michael Reichert, author of “How to Raise a Boy: The Power of Connection to Build Good Men,” is another one to consider. Good luck.\n\nMore from Lifestyle:\n\nBeing a boy: Age 8\n\nBeing a boy: Ages 11 and 12\n\nBeing a boy: Age 17\n\nParent of a teen boy wonders: What happened to my kind kid?\n\nWhy is my teen daughter such an enigma?\n\nThe power of listening to a boy", "description": "It can be hard to relate to a high-schooler. So focus on building a strong connection.", "authors": ["Meghan Leahy"], "top_image": "https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FSFVMLGTIMI6TE2DIDNVPT3KXU.jpg", "published_at": "2019-09-10"}