{"pub": "usatoday", "url": "https://usatoday.com/story/travel/2019/10/28/stella-artois-release-first-limited-edition-us-holiday-beer-nov-4/4087355002", "downloaded_at": "2019-10-29 00:19:27.233510+00:00", "title": "Stella Artois to release first-ever limited-edition, US holiday brew: Midnight Lager", "language": "en", "text": "CLOSE Made from ceramic tiles and cardboard beer packaging, this simple craft requires minimal supplies and yields a rewarding outcome. Grateful\n\nThis holiday season, Stella Artois is going back to its roots, with a twist.\n\nThe Belgian beer maker has announced Midnight Lager, a U.S.-exclusive, limited-edition holiday beer available nationwide Nov. 4 through the end of the calendar year. The new brew features subtle notes of dark chocolate and espresso with a smoky finish.\n\nMidnight Lager is the company's first-ever seasonal brew. However, at its core, Stella Artois is a holiday beer.\n\nStella Artois Midnight Lager (Photo: Stella Artois)\n\n\"The idea of holidays and gifting our consumers a special treat at the holidays is really in our DNA,\" Lara Krug, vice president of marketing at Stella Artois, told USA TODAY.\n\nStella Artois' history dates back to 1366 when its predecessor, the Den Hoorn brewery, was established in Leuven, Belgium. Nearly 350 years later in 1708, Sebastian Artois was certified as a master brewer by the local guild and later acquired the Den Hoorn brewery, which eventually evolved into Artois Brewery.\n\nAs it grew in popularity, the brewery created a special Christmas batch as a gift to the people of Leuven, explained Isabelle Seunier, director of innovation and technology development North America at Anheuser-Busch InBev.\n\nThat batch became the first to include \"Stella\" – Latin for \"star\" – in its name and a star etched into the glass.\n\nThe new beer, Midnight Lager, was brewed specifically for American consumers with a European influence. The dark lager is \"deep\" and \"warm.\"\n\nStella Artois' Super Bowl ad: Carrie Bradshaw and The Dude from 'Big Lebowski' are back\n\nHere's the top 31: What are the biggest beer brands in America?\n\n\"We know that consumers, on their own, are always looking for variety, especially during the holiday season,\" said Krug.\n\nIn creating the beer, they looked within their own brand. The idea wasn't to recreate the wheel, Seunier said, but to add to it.\n\n\"It's the authentic Stella Artois brewing process,\" Seunier said, noting that Midnight Lager utilizes uses Stella's traditional malt and hops but adds special notes. In other words, dark doesn't necessarily mean heavy. The website proclaims Midnight Lager has a light-to-medium body with a crisp, dry finish.\n\nMidnight Lager, 5.4% ABV, will be available as six or 12-packs at stores across the United States that carry other Stella Artois products, including Walmart and Kroger.\n\nSome lucky New York beer lovers will get a Halloween treat: Midnight Lager will be on tap at two bars (J.P. Doyle’s and The Hudson Anchor) in the Headless Horseman's hometown of Sleepy Hollow, located in Westchester County, about an north of New York City.\n\nFive other local bars will also have Midnight Lager on tap as Halloween rolls into the holiday season.\n\nFollow Morgan Hines on Twitter: @MorganEmHines.\n\nRead or Share this story: https://www.usatoday.com/story/travel/2019/10/28/stella-artois-release-first-limited-edition-us-holiday-beer-nov-4/4087355002/", "description": "The Belgian beer maker is launching  Midnight Lager, its first U.S.-exclusive, limited-edition holiday beer available nationwide Nov. 4.", "authors": ["Morgan Hines", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/28/USAT/635ab9c9-6b80-488f-bd18-b4bf0c00f9f4-Midnight_Lager_pack_shot.jpg?crop=5759,3240,x0,y292&width=3200&height=1680&fit=bounds", "published_at": "2019-10-28"}