{"pub": "yahoo", "url": "https://finance.yahoo.com/news/bed-bath-beyond-reports-q2-203727651.html", "downloaded_at": "2019-10-04 09:21:03.380797+00:00", "title": "Bed Bath & Beyond Reports Q2 Earnings Beat", "language": "en", "text": "Bed Bath & Beyond Inc. (NASDAQ: BBBY) reported a second-quarter earnings beat after Wednesday's bell.\n\nAdjusted earnings came in at 34 cents per share, beating estimates by 5 cents. Sales acme in at $2.719 billion, beating estimates by $410 million.\n\nView more earnings on BBBY\n\n\"We are making good progress against our four key near-term priorities, including: (1) stabilizing sales and driving top-line growth; (2) resetting the cost structure; (3) reviewing and optimizing the Company's asset base, including the portfolio of retail banners; and (4) refining our organization structure. Our second quarter financial results reflect the relentless effort of our teams and our progress in driving the Company's transformation efforts to delight our customers, enhance our competitive position, improve our financial performance, and drive shareholder value,\" said Mary A. Winston, Interim CEO.\n\nSee Also: Bed Bath & Beyond Rallies Ahead Of Q2 Print: 4 Analysts Weigh In\n\nHighlights\n\n$16.5 million worth of shares repurchased\n\nEnded quarter with $1 billion in cash\n\nComp sales declined 6.7%\n\nBed Bath & Beyond shares traded marginally higher in the after-hours session. The stock closed lower by 2.9% at $10.02 per share.\n\nPhoto by Raysonho/Wikimedia.\n\nSee more from Benzinga\n\n© 2019 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "description": "Bed Bath & Beyond Inc. (NASDAQ: BBBY ) reported a second-quarter earnings beat after Wednesday's bell. Adjusted earnings came in at 34 cents per share, beating estimates by 5 cents. Sales acme in at $2.719 ...", "authors": ["Brett Hershman"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-02"}