{"pub": "guardian", "url": "https://theguardian.com/uk-news/2019/oct/16/michel-barnier-optimistic-of-deal-after-pm-makes-concessions-on-irish-border", "downloaded_at": "2019-10-16 13:32:20.702416+00:00", "title": "Michel Barnier optimistic of deal after PM makes concessions on Irish border", "language": "en", "text": "Michel Barnier has spoken of his optimism that a Brexit deal can be reached by the end of Wednesday, but EU sources said an extension to Britain’s withdrawal beyond 31 October may still be required if an agreement is secured.\n\nTalks between the negotiating teams are ongoing with the Democratic Unionist party’s issues with the tentative agreement still threatening to derail Downing Street’s plans. The deal on the table would involve the drawing of a regulatory and customs border down the Irish Sea.\n\nDespite the last-minute threat to Downing Street’s plans, the EU’s chief negotiator told Jean-Claude Juncker’s team of commissioners on Wednesday morning that he believed a deal could be salvaged in the next few hours.\n\nA key meeting of EU ambassadors with Barnier that was set for 1pm London time was pushed back to 4pm to allow extra time for Johnson to win over the unionist party.\n\nAt the same time, the prime minister is expected to brief his cabinet on the situation before addressing a scheduled meeting of the 1922 Committee in the evening.\n\n“We are still waiting for a signal from across the Channel”, said one EU diplomat. “A lot of things are happening between the cabinet, DUP, and the hardest Brexiters.”.\n\nQuick guide Why is the Irish border a stumbling block for Brexit? Show Hide Counties and customs Inside the EU, both Ireland and Northern Ireland are part of the single market and customs union so share the same regulations and standards, allowing a soft or invisible border between the two.\n\nBritain’s exit from the EU – taking Northern Ireland with it – risks a return to a hard or policed border. The only way to avoid this post-Brexit is for regulations on both sides to remain more or less the same in key areas including food, animal welfare, medicines and product safety. The 'backstop' in Theresa May's Withdrawal Agreement was intended to address this - stating that if no future trade agreement could be reached between the EU and the UK, then rules and regulations would stay as they are. This has been rejected by Brexit supporters as a 'trap' to keep the UK in the EU's customs union, which would prevent the UK striking its own independent trade deals. There are an estimated 72m road vehicle crossings a year between Northern Ireland and the Republic of Ireland, and about 14% of those crossings are consignments of goods, some of which may cross the border several times before they reach a consumer. Brexit supporters say this can be managed by doing checks on goods away from the border, but critics say it will be difficult to police this without any physical infrastructure like border posts or cameras, which could raise tensions in the divided communities of Ireland. Interactive: A typical hour in the life of the Irish border Photograph: Design Pics Inc/Design Pics RF\n\nDespite the prospect of a deal being struck in Brussels, EU sources said the prime minister’s pledge to leave the EU on 31 October “do or die” remained in doubt even if an agreement was secured.\n\nEU diplomats said the last-minute nature of the talks meant that time would be required after the summit for governments and parliaments to scrutinise the legal text of the deal.\n\nAs a result, the EU’s leaders will only give their political rather than full formal agreement to the deal when they meet on Thursday and Friday.\n\nThe EU27 will then want the Commons on its “super Saturday” session to give its assent to the revised withdrawal agreement and political declaration.\n\nFormal EU agreement would be given at a later date once the capitals had time to work through the legal text. Sources in Berlin have suggested that process could take as long as two months.\n\n“It is clear that there can only be a political agreement tomorrow or Friday because we cannot see any text, we cannot say ‘yes’ without legal scrubbing”, a diplomat said. “We need much more time.”\n\nThe diplomat added that the leaders would require “clarity from the House of Commons on Saturday because we’ve had three deals before”.\n\n“This is the fourth time they want clarity from the UK side. We won’t continue with legal scrubbing and translations to end up with something that is going to be voted down. There is a clear desire for an outcome in London that shows support,” the diplomat added.\n\nUnder the deal being negotiated, Northern Ireland would not be part of the EU’s customs territory, but the bloc’s full customs code would have to be enforced in the Irish Sea.\n\n“Northern Ireland would de jure be in the UK’s customs territory but de facto in the European Union’s,” one diplomatic source said of the tentative agreement.\n\nBeyond the DUP’s issues with the deal, it is understood the talks between British and EU negotiators have run into trouble on the issue of level playing field guarantees.\n\nThe guarantees are promises to maintain EU standards in environment, tax and state aid to prevent Britain from undercutting the EU for a competitive advantage.\n\nThe guarantees are part of the political declaration agreed by Theresa May, which sets out the broad terms for future free trade agreement talks, but Johnson’s chief adviser has sought to have the reference removed from the text.\n\nA diplomat said EU leaders would not agree to the revised withdrawal agreement separately to the political declaration.", "description": "Boris Johnson fighting to get Democratic Unionists to back Brexit deal with Brussels", "authors": ["Daniel Boffey"], "top_image": "https://i.guim.co.uk/img/media/bcd51fd13608fa46c875110e8b6dae9ff3d515d1/4_231_1801_1081/master/1801.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c9bed83fa0dfc3cab463be1a3a79e70d", "published_at": "2019-10-16"}