{"pub": "yahoo", "url": "https://sports.yahoo.com/yankees-savior-may-just-be-james-paxton-035538839.html", "downloaded_at": "2019-09-05 04:15:02.523916+00:00", "title": "Yankees savior may just be … James Paxton?", "language": "en", "published_at": "2019-09-04", "text": "James Paxton reacts during the fifth inning against the Texas Rangers at Yankee Stadium on September 3, 2019 in the Bronx borough of New York City. (Getty Images)\n\nNEW YORK – Pretty soon now, the topic of conversation around the Yankees is going to shift from the players they acquired this season – surprising offensive contributors such as D.J. LeMahieu, Gio Urhsela, Mike Tauchman and Mike Ford – to the players they passed up on – pitchers such as Patrick Corbin, Dallas Keuchel, Zack Greinke and Trevor Bauer, who could have shored up their shaky starting rotation.\n\nBut there is one conversation that as of this date – Sept. 3, 2019, or precisely 30 days before Game 1 of the American League Division Series, one of which the Yankees are virtually sure to be hosting – that seems to be settled.\n\nScroll to continue with content Ad\n\nWhen the first pitch of that game is thrown, it will come out of the hand of James Paxton.\n\nFor the Yankees, there really is no other choice. If this team has a weak spot, it is their starting rotation, the thinness of which could well reduce what is likely to be a 100-plus-win regular season – they won their 91st on Tuesday – into a failure of a post-season.\n\nBut now, Paxton offers reason to believe that there may be that one shutdown starter on their staff that every playoff team needs to lean on.\n\n“Sure, I’ve thought about it,” Paxton said after throwing seven innings of one-hit, 12-strikeout ball against the Texas Rangers in a 10-1 Yankees victory Tuesday night at Yankee Stadium. “But that’s a question for Boone, not me. That’s not my area. I just do what I’m told. When they give me the ball, they give me the ball.”\n\nStory continues\n\nFunny thing is, barely more than a month ago, handing the ball to Paxton in just about any situation was not just a risky proposition, but a frightening one. As of July 26, through his first 18 starts as a Yankee, GM Brian Cashman’s main off-season pitching acquisition was 5-6 with a 4.72 ERA and had just completed a two-month stretch in which he allowed 68 hits, 34 earned runs and 14 home runs in just 48 innings. His July ERA of 5.68 looked like a vast improvement over his June ERA, which was 7.15.\n\nIn late July, James Paxton was 5-6. After winning his seventh straight start, he's now 12-6. (Photo by Abbie Parr/Getty Images)\n\nWorst of all, his name was being included in sentences with the likes of Sonny Gray, Steve Trout and Ed Whitson, guys who had been good pitchers elsewhere before bombing out in the Bronx. The case of Gray was an especially fresh wound, since after being traded away following two ineffective years in the Bronx, he seems to have regained the form he had shown with the Oakland A’s this season as a Cincinnati Red.\n\nThe word around town was that Paxton, born in Vancouver and nurtured as a young major-leaguer in the comparative anonymity of Seattle, was another of these small-town superstars who withered in the glare of the New York spotlight.\n\n“It was a struggle early,” Paxton admitted. “Getting used to pitching here is not easy. It’s a different thing. It’s not the same as pitching in Seattle. The atmosphere, the intensity of everything, I had to deal with that mentally.”\n\nBut now, that narrative reads like a fairy tale. Paxton’s victory Tuesday night, which raised his season’s record to 12-6, was his seventh in his last seven outings. Over that stretch, his ERA is 2.98, and his WHIP, the measure of baserunners allowed per inning, is 0.945. For June and July, it was nearly double that (1.833). It is almost as if the Yankees acquired a new starter at the All-Star break.\n\n“We knew he was capable of this,” manager Aaron Boone said. “There’s always some adjustment to a new team, new coaches, new environment, new catching, all of it. He went through that but now I feel like he really understands what he’s going to do in a game and how he’s going to attack with and that’s given him more confidence.”\n\nAgainst the Rangers, a struggling team with a middling offense, Paxton was a monster. Mixing in a curveball with a fastball that ranges from 96-98 mph, Paxton did not allow a hit until Isiah Kiner-Falefa grounded one through the hole between second and short with two out in the fifth inning. To that point, Paxton had struck out 10 batters, coaxed 17 swinging strikes and allowed just two balls to leave the infield. After the hit, Paxton retired the next seven batters he faced before leaving after the seventh inning.\n\nThe Yankees offense made things easy for Paxton, hitting five home runs, two by Gary Sanchez, whose 34 this season are the most-ever by a catcher on a team that once had a catcher named Yogi Berra.\n\nBut the story of the game was Paxton and his emergence as the one truly dominant Yankee starter. Over the second half of the season, he has leap-frogged Masahiro Tanaka, who has faltered since the All-Star break and has been a different, far less effective pitcher away from Yankee Stadium this season.\n\nHe is also a surer bet than Domingo German, the breakout star of the first half who despite leading the AL with 17 wins is on an undisclosed innings limit and is already 50 innings beyond the most he has ever thrown in a big-league season. CC Sabathia is hurt, J.A. Happ has been unreliable and Luis Severino, expected to be the ace of the staff, hasn’t thrown a pitch this season due to a shoulder injury and is still in rehab mode.\n\nThat leaves Boone and the Yankees with only one real option for the first game of what they hope will be a long playoff run.\n\n“Pax was dominant tonight,’’ Boone said. “It’s good to see him continue to build on the momentum he’s had in the second half. Now we need him to continue that through September and hopefully, carry it into October.\n\nAnd carry the Yankees along with him.\n\nMore from Yahoo Sports:", "description": "The Yankees have one weakness: pitching. If they are going to make something of their sure-to-be 100-win season, they’ll rely heavily on the arm of James Paxton.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/U4em7JtaY876dgp9Qoy_Zw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/XKbcwIOJHvwDScEoFVu9wg--~B/aD0xNzM2O3c9MjYwNDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/d3bf3200-cec6-11e9-bffd-ef42aa80bedf"}