{"pub": "realclearpolitics", "url": "https://news.yahoo.com/ukraine-story-pits-trump-versus-200903818.html;_ylt=AwrE1x98pIhdo_8AHotXNyoA;_ylu=X3oDMTByMjB0aG5zBGNvbG8DYmYxBHBvcwMxBHZ0aWQDBHNlYwNzYw--", "downloaded_at": "2019-09-23 11:55:14.779719+00:00", "title": "Ukraine Row Pits Trump Against Biden in 2020 Election Narrative", "language": "en", "text": "(Bloomberg) -- It’s an early chapter from what could become a defining story line of the 2020 presidential campaign: President Donald Trump attacking his main Democratic rival even as he faces continued questions about his own discussions with a foreign power to instigate an investigation of Joe Biden.\n\nThe Ukrainian intrigue has echoes of 2016, with Trump accused of courting foreign help to discredit his rivals with real or perceived scandals. Then, it was Hillary Clinton’s deleted emails and the Trump campaign’s attempts to solicit Russia’s help in leaking them -- which became the focus of a two-year investigation by Special Counsel Robert Mueller.\n\nThis time, Trump is accused of pressuring Ukraine into investigating a largely discredited accusation that Biden tried to interfere in a Ukrainian corruption investigation involving a company connected to his son, Hunter Biden.\n\n“I mean, Vice President Biden did a terrible thing,” Trump said on Sunday. “Joe’s got a lot of problems.”\n\nBiden’s response when asked about Trump’s comment: “Trump did a terrible thing.”\n\nThe episode is a preview of the kind of 2020 campaign the country will face if Biden becomes the Democratic nominee.\n\nTarnish Rival\n\nIt’s also a clear effort by Trump to brush Biden with scandal and damage him as a potential general-election opponent. While Biden’s lead in Democratic primary polls has shrunk, he still leads on the question of which candidate could beat Trump next fall.\n\n“I’ve been hearing about the Ukraine all through this Russian hoax, the witch hunt that they went through that now turned out to be a zero,” Trump said Sunday. “But after two years, all through I’ve been hearing the name Ukraine, Ukraine, Ukraine.”\n\nThe Ukraine controversy involves two parallel, partisan narratives:\n\nFor Biden and the Democrats, the story is Trump’s repeated solicitation of foreign help to discredit his rivals -- and his obstruction of any efforts to hold him accountable. The Ukraine story is a red herring, they say, nothing more than a debunked conspiracy theory meant to distract from Trump’s own corruption.\n\nWhistle-Blower\n\nFor Trump and the Republicans, Democratic corruption is the story. The intelligence agency whistle-blower who reported Trump’s request that Ukraine investigate Biden must be a deep-state partisan, they say, part of a never-ending effort by Democrats to undermine a duly-elected president.\n\nThe Ukraine story also thrusts Biden’s family back into the spotlight, a particularly sensitive topic for the former vice president.\n\nBiden uses the story of the death of his first wife and daughter in a car accident on the campaign trail to show his familiarity with personal tragedy and with the U.S. health-care system. But the 2015 death of his older son, Beau, was the decisive factor in his decision to skip the 2016 presidential race.\n\n“If we know one thing about Donald Trump it’s that he’s going to go after what he perceives as the weakness of his opponents,” Senator Chris Coons said as he marched with Biden and other supporters during the Polk County Steak Fry on Saturday.\n\n“He is more concerned about Joe as an opponent than he is about any other opponent and what I think we’re seeing is his willingness to do virtually anything to try to take a nick out of Joe,” said Coons, who took over Biden’s seat representing Delaware. “This won’t work.”\n\nCampaign Pressure\n\nTrump’s attacks on the Biden family come as the former vice president faces increasing pressure from the rest of the Democratic field. He’s seen his commanding lead in national polls slowly erode as Democratic voters get to know some of his rivals. And in the key early caucus state of Iowa, Elizabeth Warren edged ahead of Biden in two recent polls.\n\nWarren, for her part, has rallied to Biden’s defense. “The way to hold the president accountable is for Congress to begin an impeachment proceeding. Congress hasn’t done that,” she said Friday. “He can go back to the well on exactly what he did before. And that is invite and profit from foreign interference in our election. It’s time for Congress to step up and begin serious impeachment proceedings against this.”\n\nJuly 25 Call\n\nThe controversy broke open last week after reports that the White House was trying to block intelligence officials from submitting the whistle-blower report to Congress. That report concerned a July 25 phone call Trump made to Ukrainian President Volodymyr Zelenskiy in which Trump pressured him to investigate Biden, according to a person familiar with the call.", "description": "(Bloomberg) -- It’s an early chapter from what could become a defining story line of the 2020 presidential campaign: President Donald Trump attacking his main Democratic rival even as he faces continued questions about his own discussions with a foreign power to instigate an investigation of Joe Biden.The", "authors": ["Gregory Korte", "Tyler Pager", "Josh Wingrove"], "top_image": "https://s.yimg.com/uu/api/res/1.2/xfmK8Ug1yMY2mzFzuj6D3Q--~B/aD0yNjY3O3c9NDAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/afb0efb5c68663dce1660411a240db9f", "published_at": "2019-09-23"}