{"pub": "yahoo", "url": "https://news.yahoo.com/threat-spread-turkey-invades-northern-syria-042606912.html", "downloaded_at": "2019-10-08 10:28:35.907401+00:00", "title": "IS threat to spread if Turkey invades northern Syria", "language": "en", "text": "Turkish-backed Syrian rebel fighters gather near the Syrian-Turkish border as Ankara threatened an offensive against Kurdish militias it considers terrorists (AFP Photo/Nazeer Al-khatib)\n\nBeirut (AFP) - A feared Turkish invasion of northeast Syria could spark a resurgence of the Islamic State group, analysts and Kurdish forces have warned, despite Ankara's pledge to prevent the jihadists' return.\n\nAnkara has threatened an offensive in Syria against Kurdish militias it considers terrorists and US forces on Monday pulled back from Turkish border areas, opening the way for an invasion President Recep Tayyip Erdogan has said could come at any moment.\n\nAn open assault would reverse years of successful Kurdish-led operations to defeat IS and allow some of its surviving leaders to come out of hiding, said the Syrian Democratic Forces (SDF), the Kurdish militia that controls much of northeastern Syria.\n\nWith little other leverage left in the regional game, Sam Heller of the International Crisis Group think tank, told AFP the SDF has an \"interest\" in warning of an IS threat if open conflict breaks out with rival Turkey.\n\n\"But the fact is that ISIS is still a threat, one that seems likely to metastasise if the SDF is forced to divert attention and resources... to a defensive battle against Turkey,\" he said, using another acronym for IS.\n\nWhile a Kurdish-led operation earlier this year saw the death of IS's territorial caliphate, the organisation isn't dead and sleeper cells have been active in SDF-held areas and in Syria's vast desert where they continue to hit regime forces with deadly attacks and ambushes.\n\nCharles Lister, director of the US-based Middle East Institute, said US President Donald Trump was \"granting IS the gift of rebirth\".\n\nThe US military itself has warned that, short of sustained international pressure, IS would soon have the ability to regroup.\n\n\"The battle against IS is not over,\" Abdulkarim Omar, the top Kurdish foreign affairs official, told AFP Monday.\n\n\"There are hundreds of sleeper cells in recently liberated areas,\" he said.\n\n- Camps and detention centres -\n\nThe SDF, with backing from the US-led coalition, has scored major victories against IS near the Turkish border in Kobane and in the jihadists' former Syria capital of Raqa.\n\nThis year, they declared the territorial defeat of the group after seizing Baghouz, the final IS bastion in eastern Syria.\n\nThe SDF is now concerned that jihadists could replenish their ranks by freeing thousands of fighters and their families who are being held in detention centres and informal settlements in Syria's northeast.\n\nThe Kurds consistently warned that they would be unable to guard IS fighters if their forces were busy fighting off a Turkish offensive.\n\nOn Monday, Omar said that detention centres are not heavily fortified.\n\n\"They are only buildings... in the event of any security vacuum, these criminals could have an opportunity to break free,\" he said.\n\nThe official also said he was concerned about displacement camps, namely Al-Hol, the largest of the settlements, which he described as a \"time bomb\".\n\nSecurity incidents have been on the rise in the crowded camp, which houses more than 3,000 IS families among its more than 70,000 residents, according to the Kurdish administration in northeast Syria.\n\nThe thousands of foreign IS brides held in Al-Hol, are \"as dangerous as the thousands of IS fighters being held in SDF detention centres\", it said this week, noting daily stabbings, killings and attempts to break free.\n\nIS chief Abu Bakr al-Baghdadi has urged followers to free detained jihadists and family members held at camps in Iraq and Syria, vowing \"revenge\" in an audio recording released on September 16.\n\nSDF spokesman Mustefa Bali last month said IS militants \"have stepped up their regrouping efforts through women in the camp recently\".\n\n- Turkish assurances -\n\nThe Institute for the Study of War last week said IS is bribing prison guards and raising funds to smuggle women out of camps, including Al-Hol.\n\n\"ISIS is likely preparing more coordinated and sophisticated operations to free its detained members,\" it said in a report citing incidents in which prisoners and IS brides managed to break free.\n\nTurkey, however, assured Monday that it \"would not allow IS to return in any shape and form\".\n\nBut analysts argue that Ankara could unintentionally help boost jihadists.\n\n\"Turkey will not intentionally target camps and prisons but it could inadvertently strike them in the process of intervention,\" Syria expert Samuel Ramani told AFP.\n\nHeller also said a direct Turkish attack on camps and prisons was unlikely.\n\n\"What seems more likely is that these facilities, which are already vulnerable to riots and attempted jailbreaks, will be left vulnerable as the SDF redeploys the forces securing them to fight Turkey,\" he said.\n\n\"If ISIS cadres escape in the ensuing chaos, they could catalyse ISIS operations locally. Or, if they flee the Syrian battlefield, they could augment militant groups internationally.\"", "description": "A feared Turkish invasion of northeast Syria could spark a resurgence of the Islamic State group, analysts and Kurdish forces have warned, despite Ankara's pledge to prevent the jihadists' return.  Ankara has threatened an offensive in Syria against Kurdish militias it considers terrorists and", "authors": ["Hachem Osseiran", "Gihad Darwish In Qamishli"], "top_image": "https://s.yimg.com/uu/api/res/1.2/npQvEA_dBBWy5KxU1kNK_A--~B/aD01MTY7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/d2c36855bb3a5aef5f21004a70d70ded885e581f.jpg", "published_at": "2019-10-08"}