{"pub": "cnbc", "url": "https://cnbc.com/2019/10/16/famous-rolex-watches-could-become-2-of-most-expensive-sold-at-auction.html", "downloaded_at": "2019-10-16 13:38:37.112598+00:00", "title": "These famous Rolex watches could become 2 of the most expensive ever sold", "language": "en", "text": "Two vintage Rolex watches that ordinarily would be worth around $15,000 to $20,000 on the second-hand market are likely to command 10 to 100 times that value according to watch experts. The reason? One was worn by Hollywood legend Marlon Brando and the other by golf champion Jack Nicklaus. The celebrity factor has the power to turn some not-so-sought-after watch models into two of the most expensive timepieces on the planet. This Rolex GMT-Master Ref. 1675 was once owned by Brando and this gold Day-date Ref. 1803 was on the wrist of Nicklaus. They are two of the top watches slated to hit the auction block in a December sale called \"Game Changers\" by Phillips auction house. \"It's a sale dedicated to people who have changed the game in their fields, but also two watches that have changed the game in watchmaking,\" Paul Boutrous head of watches for Phillips auction house tells CNBC. Let's take a closer look at the two watches experts say will break records for their models.\n\nMarlon Brando's Rolex GMT-Master Ref. 1675\n\nMovie star Marlon Brando made this GMT famous in Francis Ford Coppola's 1979 Vietnam War epic, \"Apocalypse Now.\" Boutros tells CNBC that the stainless steel and rubber strap Rolex was Brando's most treasured timepiece. Photo credit: Mary Ellen Mark Phillips says during the filming, Brando was instructed by a crew member to remove the watch because the Rolex was too flashy for his notorious character, Col. Walter E. Kurtz. Brando refused, instead he altered the piece by removing the bezel from its face, making it appear more rugged to better fit his character in the movie. After the film, the watch disappeared from the public eye for decades. \"It was considered one of the greatest lost watches,\" says Boutros. Turns out, it was never lost. Phillips says Brando's daughter, Petra Brando Fischer, received the watch as a gift from her father and kept it hidden in a drawer for years. In the spring of 2018, Brando Fischer brought her dad's GMT to Phillips auction house.\n\nPetra Brando Fischer with her father Marlon Brando and husband Russel Fischer Source: Petra Brando Fischer\n\nBoutros says she and her husband decided to sell the watch at auction after they saw actor Paul Newman's Rolex Daytona sell for a record-breaking $17.8 million in 2017. One of the most interesting features of Brando's watch is a special engraving on the backside of the case. Boutros says very few people knew the Academy Award winner had a penchant for engraving things. When Boutros got his hands on the piece, he was shocked to discover \"M. Brando\" carved into it. \"When I saw that engraving... I nearly fell out of my chair.\"\n\nBackside of Brando's Rolex GMT-Master Ref. 1675 shows his signature engraved on the timepiece. Source: Phillips\n\nPhillips says a Rolex GMT-Master Ref. 1675 like Brando's from the 1970s would typically sell for around $20,000. But Brando's star power and the unusual customizations he made set up Brando's watch to fetch much more at auction. \"The estimate is expected to begin in the six figures,\" says Boutros. Other experts tell CNBC that Boutros is being conservative with his estimate and predict Brando's watch could sell for millions. A portion of the proceeds from Brando's watch will go to charity to help children in need.\n\nJack Nicklaus' Rolex Day-Date Ref. 1803\n\nThe second famous Rolex hitting the auction block later this year is Nicklaus' Rolex Day-Date Ref. 1803. Source: Jim Mandeville Nicklaus Companies Nicklaus, 79, and his 18-karat gold watch are parting ways after more than half a century together. Rolex gifted him the watch back in 1967, and Phillips says it has graced his wrist ever since. \"It was really the only watch he wore for over 50 years,\" says Boutros. The iconic timepiece has been with Nicklaus for 12 of his 18 championship titles. The model features a champagne-colored dial with hour markers that are reminiscent of golf tees.\n\nFront-view of Jack Nicklaus' 18-karat yellow gold, Rolex Day-Date Ref. 1803. SOURCE: Phillips\n\nBoutros tells CNBC vintage examples like Nicklaus' Day-Date would likely retail for about $15,000 on the secondary market. But similar to Brando's watch, \"With the celebrity provenance, you can expect a significant premium that a collector will pay to own such a great piece of history,\" Boutros tells CNBC. When pressed to be more specific Boutros tells CNBC, \"We hope to see a result in the seven figures.\" Source: Nicklaus Companies Other watch experts tell CNBC the timepiece could rake in millions at auction and potentially give Paul Newman's Rolex Daytona a run for its money. That's great news, since Nicklaus is donating 100% of the proceeds to his own charitable cause, the Nicklaus Children's Health Care Foundation, helping kids in need. Phillips \"Game Changers\" auction will be held in New York City on Dec. 10. Erica Wright is a producer for CNBC's special projects unit. Don't Miss: Meet the highly trained super-security dogs that can cost as much as $230,000 These four mansions have backyard water parks and insane pools", "description": "Two vintage Rolex watches that ordinarily would be worth around $20,000 on the second-hand market are likely to command 10 to 100 times that value because of their celebrity factor — one belonged to Marlon Brando and the other to golf legend Jack Nicklaus.", "authors": ["Erica Wright"], "top_image": "https://image.cnbcfm.com/api/v1/image/106180673-1571078596033marlon-brando-rolex-gmt-caseback-engraving.jpg?v=1571078674", "published_at": "2019-10-16"}