{"pub": "breitbart", "url": "https://breitbart.com/news/espn-reports-angels-pr-employee-supplied-skaggs-with-opioids", "downloaded_at": "2019-10-13 00:21:35.361938+00:00", "title": "ESPN reports Angels PR employee supplied Skaggs with opioids", "language": "en", "text": "ANAHEIM, Calif. (AP) — The Los Angeles Angels say they don’t know whether a longtime public relations official had been providing drugs to late pitcher Tyler Skaggs, as detailed in a report Saturday on ESPN’s “Outside the Lines.”\n\nEric Kay, a 24-year employee of the Angels’ PR department, told the Drug Enforcement Agency he had provided opioids to Skaggs and used them with the pitcher for years, according to ESPN. Kay reportedly watched as Skaggs snorted three lines of crushed pills in his hotel room in Southlake, Texas, on the night before he was found dead.\n\nKay also told the DEA he believes several other Angels players used opioids, ESPN reported.\n\n“We have never heard that any employee was providing illegal narcotics to any player, or that any player was seeking illegal narcotics,” Angels President John Carpino said in a statement. “The Angels maintain a strict, zero tolerance policy regarding the illicit use of drugs for both players and staff. Every one of our players must also abide by the MLB Joint Drug Agreement. We continue to mourn the loss of Tyler and fully cooperate with the authorities as they continue their investigation.”\n\nSkaggs was found dead in his hotel room July 1 before the start of a series against the Texas Rangers. The Tarrant County Medical Examiner’s Office said the 27-year-old died after choking on his vomit with a toxic mix of alcohol and the painkillers fentanyl and oxycodone in his body.\n\nMajor League Baseball issued a brief statement: “MLB was unaware of any of these allegations. MLB will fully cooperate with the government investigation and conduct its own investigation when the government investigation is completed.”\n\nKay has been on administrative leave from the Angels since July, and ESPN reported he is undergoing outpatient drug treatment. Kay didn’t immediately respond to a message from The Associated Press.\n\nKay also claimed two Angels officials were aware of Skaggs’ drug use, including Kay’s longtime boss, Tim Mead, a 40-year Angels employee. Mead left the team in June to become president of the Baseball Hall of Fame.\n\nMead told ESPN he was unaware of Skaggs’ drug use.\n\nESPN says Kay told investigators he illegally obtained six oxycodone pills and gave three to Skaggs shortly before the team left Anaheim for its road trip to Texas.\n\nMLB and the players’ union plan to discuss the possibility of implementing more widespread testing for opioids in the wake of Skaggs’ death.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports", "description": "ANAHEIM, Calif. (AP) — The Los Angeles Angels say they don't know whether a longtime public relations official had been providing drugs to late pitcher", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/12/836043_angels-skaggs-death-baseball-98071-tyler-skaggs-in-may-25-2019-file-photo-640x335.jpg", "published_at": "2019-10-12"}