{"pub": "independent", "url": "https://independent.co.uk/news/business/news/neil-woodford-fund-savings-suspended-winding-up-cash-a9156146.html", "downloaded_at": "2019-10-15 08:03:40.890926+00:00", "title": "Neil Woodford’s frozen fund will be wound up", "language": "en", "text": "Neil Woodford’s flagship fund, suspended since June, will be wound up and cash will be returned to investors “at the earliest opportunity”, its corporate director Link Asset Services has announced.\n\nIn a letter to investors posted on its website on Tuesday, Link said it expects to start winding up the LF Woodford Equity Income Fund on 17 January once the required three months’ notice period runs out. Mr Woodford will also be removed from his position as the fund’s investment manager with immediate effect.\n\nMr Woodford, one of Britain’s best-known investment managers, was forced to freeze the fund after a run of poor performance scared investors into withdrawing their cash. That left the fund unable to sell off assets fast enough and at sufficiently high prices to meet further redemption requests.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAn unusually high proportion of the fund has been invested in illiquid shares, meaning they could be subject to heavy discounts if a sale is required quickly.\n\nThe suspension was intended to give Mr Woodford time to change the composition of the portfolio to enable him to meet redemption requests.\n\n“Whilst progress has been made in relation to repositioning the fund’s portfolio, this has unfortunately not been sufficient,” Link said.\n\n“We have therefore concluded that it is now in the best interests of all investors for the fund to be wound up by way of an orderly realisation of the fund’s assets. This orderly realisation will allow the return of money through interim payments...to investors more quickly than if the fund had remained suspended for a longer period of time.”\n\nMr Woodford commented: “This was Link’s decision and one I cannot accept, nor believe is in the long-term interests of LF Woodford Equity Income fund investors.”\n\nSince Mr Woodford is no longer the manager of the fund, it will be renamed as LF Equity Income Fund.\n\nHundreds of thousands of savers still have money locked in the fund.", "description": "Neil Woodford’s flagship fund, suspended since June, will be wound up and cash will be returned to investors “at the earliest opportunity”, its corporate director Link Asset Services has announced.", "authors": ["Olesya Dmitracova"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/15/08/neil-woodford-fund.jpg", "published_at": "2019-10-15"}