{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7540133/Heather-Locklear-wishes-daughter-Ava-happy-22nd-birthday-photo-blowing-candles.html", "downloaded_at": "2019-10-05 07:53:37.219449+00:00", "title": "Heather Locklear joins on-off beau Chris Heisser to celebrate daughter Ava's 22nd birthday", "language": "en", "text": "Heather Locklear was joined by her on-off beau Chris Heisser to celebrate her daughter Ava's birthday in Los Angeles on Friday.\n\nAva, who was turning 22, brought her boyfriend Tyler Farrar to the family lunch being held at the swank restaurant Fig And Olive.\n\nThe 58-year-old actress wore a simple monochrome outfit to pose for photos in front of the restaurant with her only child, who held a bouquet.\n\nHappy day: Heather Locklear was joined by her on-off beau Chris Heisser to celebrate her daughter Ava's birthday in Los Angeles on Friday\n\nTyler could be glimpsed snapping mother-daughter photos on a cellphone, as well as posing with the birthday girl himself.\n\nHe has evidently won the approval of his girlfriend's mother, as he and Heather were spotted hugging as they greeted one another on the sidewalk.\n\nChris, a former AMA motorcross racer who is a contractor now, stood a few feet behind Heather as she took pictures of Ava and Tyler.\n\nHeather also wished Ava a happy 22nd birthday with a sweet Instagram photo she posted on Friday.\n\nLoved ones: Ava, who was turning 22, brought her boyfriend Tyler Farrar to the family lunch being held at the swank restaurant Fig And Olive\n\nCelebrating: The 58-year-old actress wore a simple monochrome outfit to pose for photos in front of the restaurant with her only child, who held a bouquet\n\nHelping hand: Tyler could be glimpsed snapping mother-daughter photos on a cellphone, as well as posing with the birthday girl himself\n\nThe Dynasty alumna posted a snapshot of her only child leaning forward to blow out the candles on her birthday cake.\n\nIn the caption, Heather wrote: '22 years ago God blessed me with an angel that walks this earth. Thank you Ava for all your goodness and strength. You are an inspiration and I’m forever grateful for you. Happy 22nd birthday.'\n\nThe actress recently underwent court ordered in-patient substance abuse treatment and is currently serving three years' probation.\n\nSweet: He has evidently won the approval of his girlfriend's mother, as he and Heather were spotted hugging as they greeted one another on the sidewalk\n\nSmiling ear to ear: Chris, a former AMA motorcross racer who is a contractor now, stood a few feet behind Heather as she took pictures of Ava and Tyler\n\nShe pleaded no contest in August to fighting with the authorities when they arrived at her home in two separate incidents last year.\n\nHer 30-day rehab stint was a substitute for the initial 120-day jail sentence, which was stayed provided she went into treatment.\n\nThe 911 call to her home in February 2018 was made by her brother Mark, who saw her quarreling there with Chris, to whom she was engaged.\n\nDetails: Heather and Chris broke up this January, but since then there have been sporadic reports of a reconciliation, including in Radar Online last week\n\nBackdrop: The website's source dished that Heather and Chris are 'happy' now, sharing: 'Everything is back where they were before'\n\nVentura County Sheriff Office Captain Garo Kuredjian said to the New York Post: 'We determined she had battered her boyfriend.'\n\nHeather was reportedly put on psychiatric hold twice last year, including in November on the advice of her lawyer and therapist, according to TMZ.\n\nShe and Chris broke up this January, but since then there have been sporadic reports of a reconciliation, including in Radar Online last week.\n\nThe website's source dished that Heather and Chris are 'happy' now, sharing: 'Everything is back where they were before.'\n\nDopplegangers: Ava cut a stylish figure in a black crop top with a leopard print skirt and a pair of platform sandals\n\nTurbulent times: The actress recently underwent court ordered in-patient substance abuse treatment and is currently serving three years' probation\n\n'You are an inspiration': Heather also wished Ava a happy 22nd birthday with a sweet Instagram photo she posted on Friday\n\nHeather shares Ava with her second and latest ex-husband, Bon Jovi lead guitarist Richie Sambora, whom she married in Paris in 1994.\n\nRumors of marriage trouble swirled late in 2005 and in December of that year Richie and Heather jointly told the New York Daily News they were 'still happily married.'\n\nBy February of 2006 she had filed for divorce in Los Angeles and they legally finalized the end of their marriage in April 2007.\n\nHeather's first husband was Motley Crue founder Tommy Lee, who went on to have an infamous marriage and sex tape with Pamela Anderson.", "description": "Heather Locklear wished her daughter Ava a happy 22nd birthday with a sweet Instagram photo on Friday.", "authors": ["Sameer Suri For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/07/19325140-0-image-a-49_1570255294913.jpg", "published_at": "2019-10-05"}