{"pub": "breitbart", "url": "https://breitbart.com/crime/2019/10/25/seattle-man-earns-74th-criminal-conviction-after-throwing-coffee-2-year-old", "downloaded_at": "2019-10-25 21:59:38.535539+00:00", "title": "Seattle Man Earns 74th Conviction After Throwing Coffee on 2-Year-Old", "language": "en", "text": "A Seattle man earned his 74th criminal conviction this week after being convicted of throwing hot coffee on a two-year-old child who was sitting in a stroller.\n\nFrancisco Calderon was convicted of 4th degree assault in the attack on the child. He was also hit with a charge of attacking a retail worker during the same incident, but that charge was dropped in a plea deal, according to KOMO News.\n\nCalderon reportedly perpetrated the assault only hours after being released from King County jail after having served an eight-month sentence for a previous attack. Witnesses said he rampaged through Seattle’s Westlake Center area verbally abusing strangers and seemed to be on drugs.\n\nDaynard Butler, the father of the child Calderon assaulted, testified that he saw the suspect acting strangely, and at one point Calderon turned on the man’s child. Butler says he punched Calderon several times after the coffee incident, and then an off-duty sheriff’s deputy helped him hold the suspect until police arrived.\n\nHowever, activists soon began using Calderon’s case to claim that the Seattle justice system is flawed. Some began calling for leniency and treatment instead of jail time.\n\n“I’ve been in jail all my life. I need help. I need treatment. I don’t want to continue using drugs and being a threat to other people,” Calderon insisted in court. “I’m a calm guy when I’m not on drugs.”\n\nBut Municipal Court Judge Adam Eisenberg reminded Calderon that he has a long history of refusing to complete court-ordered drug programs, and skipping out on mental health programs.\n\n“I’ve got to be honest with you, I’m really skeptical that you are going to do it because you have been given so many opportunities in the past and walked away from those opportunities,” Judge Eisenberg said.\n\nCalderon pleaded guilty to the assault and was sentenced to a year in jail with six months suspended. But the judge also required that Calderon complete inpatient treatment before November 18. If he fails to complete the evaluation, he could be liable for serving the suspended six months.\n\nThe father of the two-year-old noted that he hopes Calderon gets the help he needs.\n\nCalderon has been the subject of special pleas for help in the past. In January, when Calderon was handed his 72nd conviction, his lawyer asked the judge for special consideration so that the suspect could get mental health treatment.\n\n“I think it’s in the community’s best interest to receive this kind of treatment and rehabilitation,” public defender Stuart Moore told the judge at the time. “He’s clearly got the message that’s he’s on thin ice.”\n\nDespite the “message” and the lenient treatment, Calderon went on to commit is 73rd and 74th criminal act.\n\nFollow Warner Todd Huston on Twitter @WTHuston.", "description": "A Seattle man earned his 74th criminal conviction after being convicted of throwing hot coffee on a two-year-old child in a stroller.", "authors": ["Warner Todd Huston"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-636725480-640x335.png", "published_at": "2019-10-25"}