{"pub": "businessinsider", "url": "https://businessinsider.com/netflix-vs-disney-plus-hbo-max-peacock-assets-compared-2019-9", "downloaded_at": "2019-09-19 23:07:05.585905+00:00", "title": "We compared Netflix's top assets to new rivals like Disney Plus and HBO Max as the streaming battle heats up", "language": "en", "text": "The streaming war is getting intense, as legacy media giants drop tons of money on valuable properties to fuel their own new platforms.\n\nNetflix will lose \"The Office\" and \"Friends\" within the next two years to upcoming competitors, NBCUniversal's Peacock and WarnerMedia's HBO Max, respectively. The two hit sitcoms were the streaming giant's most popular shows last year, according to data from analytics company, Jumpshot. \"Parks and Recreation,\" the third most popular, will also move from Netflix to Peacock next October.\n\nBut Netflix gained another popular sitcom in \"Seinfeld\" this week in a five-year global deal that begins in 2021. The deal is worth more than the $425 million WarnerMedia paid for \"Friends\" and the $500 million NBCU paid for \"The Office,\" according to The Los Angeles Times.\n\nREAD MORE: NBC wants to reboot 'The Office' for its upcoming Netflix competitor\n\n\"They're all big enough shows to say they're worth millions of dollars,\" Michael Pachter, a media analyst with investment firm Wedbush Securities and notable Netflix bear, told Business Insider.\n\nPachter said Netflix is justified in spending as much as it is on \"Seinfeld.\" But it also highlights the huge gap that Netflix is looking to fill after it loses three of its biggest shows.\n\nDisney content is among that. The company, which is launching its streaming service Disney Plus on November 12, ended a licensing deal with Netflix this year and its theatrical releases, starting with \"Captain Marvel,\" will eventually appear on Disney Plus.\n\n\"You have to be bullish about the assets that they have assembled and how they are approaching breaking in in terms of the low price point [$6.99 a month],\" Stephen Beck, the founder and managing partner of management consultancy cg42, said of Disney.\n\nWe rounded up the biggest assets for Netflix, Disney Plus, HBO Max, and Peacock to give subscribers and investors a better idea of where each service stands:", "description": "Companies like WarnerMedia and NBCUniversal are dropping millions of dollars on content previously licensed by Netflix to fuel their own platforms.", "authors": ["Travis Clark"], "top_image": "https://amp.businessinsider.com/images/5d83ba242e22af30fc2b70c2-960-480.jpg", "published_at": "2019-09-19"}