{"pub": "theverge", "url": "https://theverge.com/2019/10/9/20905266/joker-movie-debate-todd-phillips-joaquin-phoenix-arguments-delusions-mental-illness-violence", "downloaded_at": "2019-10-09 18:35:18.012034+00:00", "title": "Question Club: the best and worst Joker debate topics", "language": "en", "text": "Todd Phillips’ Joker has been one of the most discussed films of the year, in part because it was controversial before it was even made. When the film was first announced, not long after the disastrous DC movie Suicide Squad revealed its own cinematic take on the Joker character, a vocal subsegment of the film world rebelled at the idea of rebooting the villain yet again, and protested DC’s interest in focusing on him at the expense of so many other characters.\n\nBut once Phillips’ film started screening for critics, new conversation topics emerged: whether Joker as Phillips and co-writer Scott Silver conceived it is dangerous; whether it’s a call to violent action or a celebration of anarchy; whether it has a coherent message or is just a mashup of films like Fight Club and The King of Comedy; whether it’s actually a comic book film (which Phillips denies) or more of a melodrama; and so forth. The Verge’s staff sat down together to weigh in on some of the debate around Joker.\n\nWhat did you think of the film?\n\nTasha Robinson, film/TV editor: I’ve consistently been on the more positive end of the Joker spectrum compared to a lot of other film critics, but I still think it’s a badly flawed movie: a self-pitying fantasy about a truly awful world that picks on one poor victim until he rightly snaps. The open, extensive theft from Martin Scorsese’s The King of Comedy and Taxi Driver bothers me — there are points where Joker seems like a cover version of those movies, and not a particularly nuanced or thoughtful one. But toward the end, when put-upon protagonist Arthur Fleck (Joaquin Phoenix) starts celebrating his own break with sanity by dancing like no one’s watching and reigning over public mayhem, the film has a real emotional power. Superhero comics and comic movies are so often about escapism, and this film feels like it embraces a radical, dark, ugly kind of escapism from sanity that’s pretty seductive, no matter how irresponsible or antisocial it is.\n\nRussell Brandom, policy editor: The best part was Phoenix’s performance — particularly the laughing fits, which seemed genuinely afflicting. The idea of watching his sad-sack clown descend into violent madness is really promising. But by the end, too much about the movie didn’t work for me: the Fleck / Thomas Wayne backstory, the love interest, the entire approach toward comedy and fame. I also hated the talk-show scene, which saw Arthur turning self-pity into violence and being immediately, inexplicably rewarded with the love and support he’d been missing through the whole film.\n\nAdi Robertson, senior reporter: Right. It lost direction in the last act, in part because it was so beholden to Scorsese and the original Joker character — it kept drifting toward those poles in ways that felt generic or disjointed, instead of playing to the strengths it had established.\n\nJulia Alexander, reporter: If I don’t think about it too much, I think I actually like Joker. Phoenix’s performance is undeniably masterful, and for the first half of the movie, it’s a poignant look at loneliness. I wish Phillips spent more time on that story. The second half of the movie, particularly the final 20 minutes, washes away those striking moments. Joker feels like it loses its identity. The more I think about it, the more frustrated I become — it ends up dissolving into a movie that wants to think it’s smarter than it actually is.\n\nWas it too tied to the Batman mythos? Not closely tied enough?\n\nAR: I’m glad that beyond recasting Thomas Wayne (very effectively!) as an elitist jerk, Joker didn’t make me work out any DC pantheon logistics — like, is Arkham Asylum still full of other supervillains? Thank god I don’t know! I do think that giving Arthur the “failing standup comedian” backstory from The Killing Joke was a mistake, but primarily because it set the character up as a clone of Rupert Pupkin from The King of Comedy, which was one of the less interesting bits of his characterization.\n\nJA: I’m more protective over Bruce Wayne and Batman (my third favorite superhero, after Iron Man and Hulk), and them being such a minor part of the story helped me accept certain moments in Joker. That said, I do wish they leaned into the Batman mythos a little more. I appreciated the new take on Thomas Wayne, and Bruce’s childhood introduction to Joker, but it felt empty. I saw one essay that suggested this Joker was actually just the inspiration for the actual Joker that Bruce Wayne eventually fights as Batman and… I’m just tired of the need to over-explain things that aren’t defined in this movie? I’m tired. There’s a way to do a Joker story with Batman mythology tied in, but this isn’t it.\n\nRB: I would have liked to see a little more classic Joker in the late-movie version of Fleck, who never really came together for me. He had the sadism of the Joker we know, but there was none of the gleeful absurdity, which would have been welcome after 90 minutes of miserabilism. Imagine if he’d killed Robert De Niro by crushing his head with an enormous mallet. That would have been so much more satisfying than the weird 4chan-isms we got.\n\nTR: I would have been entirely fine with leaving Bruce Wayne and Batman out of this movie altogether. Bruce’s presence raises too many questions (so Joker in this world is twenty-something years older than Batman, minimum? Does Batman remember the guy who came to his house and was weird at him when he was a kid?), but mostly it means we have to sit through the cinematic death of Thomas and Martha Wayne for seemingly the billionth time, flying pearls and all, in a way that adds nothing new to the Joker story but cheap “I made you / You made me” irony. Cramming child Bruce in there feels a lot like the way he was crammed into the TV show Gotham and became this weird little gatekeeper prince figure in the first season, bestowing his blessing on Jim Gordon. Why not just focus on the character Phillips is radically re-envisioning, instead of the one where he’s religiously sticking to established canon?\n\nIs this a socialist movie? An anarchist movie? An anti-antifa movie? Are its politics clear?\n\nRB: I have seen a couple of Socialist Twitter people online arguing that Joker is a left-wing movie. That seems like such a bizarre read to me. It’s true that a lot of the rich people in the movie are bad, and that robust, publicly funded mental health care does come off looking pretty good. (Is Arkham single-payer?) But the clown-branded political movement that closes the film is cartoonishly extreme, to the point where Joker almost echoes the anti-Occupy anxieties of Dark Knight Rises. In this Gotham, there is no discernible political split between raising Thomas Wayne’s taxes and murdering bankers in the subway. As the Gotham Journal puts it: KILL THE RICH — A NEW MOVEMENT? Surely this isn’t the headline the Bernie Sanders campaign was hoping for.\n\nAR: Joker’s politics basically seem built around its aesthetic and narrative requirements. The best-developed theme is certainly that rich people have exploited and abandoned the rest of society, yet profess to be shocked when this drives people to violence. But it’s more of a storytelling device than a primary concern. The most obviously contemporary political elements don’t even make much sense — I get why audiences would nod along at the complaint that “nobody’s civil anymore,” for example, but it seems like a non sequitur alongside Arthur’s other complaints.\n\nJA: When The Dark Knight Rises came out in 2011, there were questions about how much the Occupy Wall Street movement inspired Nolan’s final installment in his Dark Knight trilogy. Nolan called the overlap of themes incidental at the time, but the film’s political messages seemed to mesh well with Bane, a menacing force with specific political ideologies. Joker uses political ideologies because it feels like it has to, very much to Adi’s point. It doesn’t make much sense. Everything feels rushed, and that makes finding any ideological coherency difficult to really capture. Plus, the Joker isn’t a political figure. He’s anarchy at its purest, madness at its most psychotic. There is no rhyme or reason for his actions. He is chaos in motion. Trying to assign a political ideology that reflects or supports his actions is a fool’s errand.\n\nTR: I read Joker as much more anti-political than political, much more based in an adolescent, rebellious “Screw the system, the system just wants to screw you” chaos than in any coherent political slant. It’s about breaking all the rules (which makes that “no one is civil anymore” complaint even more ironic) and becoming an iconoclastic hero. I think Phillips wants to see Arthur’s above politics, that he’s sidestepping the system entirely. There’s certainly borrowed protest iconography in there, but I don’t see the messaging here going deep enough to reflect any real-world political or parapolitical movements.\n\nWhat’s the most interesting talking point about this movie?\n\nTR: I’m not engaging in any discussions about whether Joker is “dangerous.” It certainly holds up some dangerous ideas, mostly that people like Arthur deserve better than what life has given them, and are justified in murdering people who hold them back, or in any way represent the parts of society that have left them feeling under-seen and lost. But I don’t think it represents such a convincing argument that it requires hand-wringing and overused symbolic pearl-clutching.\n\nI’m actually more interested in the ongoing conversation about whether it’s “a comic book movie,” because Todd Phillips seems so determined to say it isn’t, and it so obviously is. That conversation is helping us expand the definition of comics and “comic book movies,” which is really overdue in America.\n\nAR: It is absolutely a comic book movie — and moreover, an adaptation of the kinds of comic books that got me into comics! My real introduction to the medium was ’80s and ’90s Vertigo-style titles, which were all about gritty “adult” deconstructions and inversions of superhero stories. We’ve critically reevaluated these in recent years, and ironically, the actual comics world has stepped away from equating “more depressing” with “more mature.” But it’s still a genre I love, and Joker is a pitch-perfect translation of it to the screen.\n\nJA: It’s definitely a comic book movie, it’s just not a Marvel movie or even a Zack Snyder movie. The comic book movie as we know it has changed substantially over the last 11 years. We expect comic book movies to look, sound, and feel a certain way. Todd Phillips may have convinced De Niro and Phoenix to make a serious film under the guise of making a comic book movie, but he actually made a pretty standard comic book movie in the process.\n\nAR: And by that token, I actively resent that the “serious film” discourse has somehow thrown us back to square one in sophisticated pop culture debates that are older than I am. Forget whether the movie is dangerous — do we really have to go back and relitigate the divisions between high and low culture every time somebody disses the Avengers?\n\nIs Joker more interesting if the end of the film — or even most of the film — is just Arthur’s delusion?\n\nTR: I know this is an odd question, but the fact that Arthur’s entire relationship with Sophie (played by Zazie Beetz) is imaginary, a product of his unmedicated mental illness, has some people questioning whether anything in Joker after a certain point is meant to be real. Is Arthur really assaulted on the train by finance bros with a mysteriously complete knowledge of Stephen Sondheim lyrics, or does he imagine that and murder them for no reason? Is he really invited on his hero’s talk show where he commits murder, or is that a fantasy, too? If those things happened as seen, is he really rescued by his followers in the end, or is that all his own glorious monomaniacal fantasy?\n\nPersonally, I love ambiguity in a film when it feels daring and deliberate. But here, not being able to trust anything we see on-screen would just make it even harder to parse what’s going on in this film, how much damage Arthur is doing, and how we should take it. The story of him imagining a bunch of wild things isn’t particularly interesting on its own. I respect the urge people are feeling to write off any aspect of the movie that seems unlikely or annoying to them, but I don’t think it improves the story to decide, without clear indications one way or another, that most of the film is unreal.\n\nRB: Yeah, I find that whole question exhausting. In the most generous possible reading, I guess it conveys how isolated and detached Fleck is? But Mr. Robot has a lot to answer for.\n\nAR: The obvious comparison point might be a film like American Psycho, which teases the idea that we can’t tell whether its protagonist Patrick Bateman is a sociopathic fantasist yuppie or a mass murderer. But that works because either of those interpretations are fairly compelling, which I don’t think is true for Joker.\n\nJA: At this point, I’m not sure whether the entire Joker experience is a dream we’re all experiencing at once. No, I don’t think it’s all a delusion. It’s too Newhart for Phillips to concoct this entire thing, only for Arthur to realize it’s all a dream.\n\nAre people discussing Joker more than it warrants? Is this a socialist movie? An anarchist movie? An anti-antifa movie? Are its politics clear?\n\nTR: Obviously there’s an irony in asking if we’re talking about this film too much, at the end of a feature where we all talk about the film. But it’s a legitimate question: a lot of the conversation around Joker has been about how to interpret it, and a lot of that conversation seems to go well beyond what Phillips actually intended for the movie. Divorced of all the concerns about possible theater violence, or an anarchic incel uprising, this film feels a lot more like empty, nihilistic provocation.\n\nAre we talking so much about it because we’re afraid of certain loud, dissatisfied, vocal elements in society — like the online crowd who openly says they want to enslave women into “servicing” them because they feel entitled to sex and companionship — and what they might do if they felt empowered? Are we really that worried about a handful of malcontents, or are we vaguely looking forward to violent upheaval in the same way people fantasize about the zombie apocalypse?\n\nRB: I think part of the urge to talk is the result of a clever idea with mediocre execution. It’s genuinely interesting to think about what a social-realist character study looks like in a comic book universe. In the end, I didn’t think Phillips executed the idea very well, but it’s a new thing to try, and opens up more possibilities than better-made movies like The Last Jedi or Avengers: Endgame. And the sheer shock value of the movie leaves a lot unresolved.\n\nAR: I will consume almost any story whose premise is “What if a pulpy genre plot were subject to the dour constraints of reality?” and I will talk your damn ear off about it. It’s been odd to see Joker treated as viscerally dangerous, but I think there’s just a cultural shift toward the idea that information and media are harmful, whether the fear is internet propaganda swinging an election or movies inspiring violence. Absent of that cultural context, it seems almost mundane compared to films like Fight Club or Taxi Driver — which literally inspired someone to almost kill the president!\n\nJA: As someone who talks far too much about movies that no one cares about, I don’t think we — as a society — are talking about it too much. I think we’re giving it a certain weight that it doesn’t warrant. Trying to paint this movie as a thoughtful critique on a type of person who we’ve come to fear around the world in 2019 is outrageous and dumb. Joker isn’t even in the same boat as Fight Club, a movie released 20 years ago this month that did manage to swirl a number of poignant issues into a dark, satirical, brilliant two-hour film.\n\nAny movie that incorporates Joker, the best-known comic book villain (arguably the most popular villain, period), is going to be talked about. We should absolutely talk about the movie, and we should absolutely never stop talking about real-world subject matter that people may see mirrored in the film. What we shouldn’t do is conflate the idea that one can’t exist without the other. Joker is a mostly entertaining movie — one that features a superb performance from a master actor. It isn’t anything more than that, and shouldn’t be treated as such.", "description": "Todd Phillips’ new villain origin story Joker has earned praise for Joaquin Phoenix’s star performance, but it’s also sparked a lot of debate. Here, the Verge staff considers the big question: Is the whole film a delusion? Is this an antifa film or a socialist film? Should there have been more Batman? Is this movie dangerous film? And is it any good?", "authors": ["Tasha Robinson", "Adi Robertson", "Russell Brandom", "Julia Alexander", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/IytwTHcpCgJRQVzhffUldkw-jbU=/0x12:6000x3153/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19270635/rev_1_JOK_20921_High_Res_JPEG.jpeg", "published_at": "2019-10-09"}