{"pub": "bbc", "url": "https://bbc.co.uk/news/newsbeat-49996624", "downloaded_at": "2019-10-10 15:06:51.412649+00:00", "title": "Rihanna wouldn't 'sell out' for halftime Superbowl show", "language": "en", "text": "Image copyright Getty Images\n\nRihanna's confirmed she turned down the Superbowl halftime show to support Colin Kaepernick.\n\nThe former San Francisco 49ers quarterback was dropped from the NFL for protesting social injustice by kneeling during the national anthem.\n\nIn this month's cover story with Vogue magazine, Rihanna said she did it to take a stand.\n\n\"I couldn't dare do that. Who gains from that? Not my people. I just couldn't be a sellout.\"\n\n\"I couldn't be an enabler. There's things within that organization that I do not agree with at all, and I was not about to go and be of service to them in any way.\"\n\nIt was widely rumoured she was offered the controversial February 2019 halftime show, which draws in audiences of up to 100m, but this is the first time Rihanna's talked about why she refused to appear.\n\nCardi B and Pink, also reportedly rejected the NFL's offer to perform at the Atlanta event - in a show of solidarity with Kaepernick - and it was eventually headlined by Maroon 5, Travis Scott and Big Boi.\n\nIt's not the only politics Rihanna gets into during the interview. She also opens up about gun violence in America.\n\n\"It is devastating,\" she says.\n\n\"People are being murdered by war weapons that they legally purchase. This is just not normal. That should never, ever be normal.\"\n\nImage copyright Getty Images\n\nOn her personal life, which she generally avoids discussing, Rihanna confirms she's in a relationship.\n\nHer rumoured boyfriend is the the Saudi businessman Hassan Jameel.\n\n\"Yeah, I'm dating,\" she says. \"I'm actually in an exclusive relationship for quite some time, and it's going really well, so I'm happy.\"\n\nImage copyright Ben Gabbe Image caption Rihanna performs during her Savage X Fenty Show\n\nShe is, of course, keen to talk about her fashion brand, Fenty - named after her real name Robyn Rihanna Fenty.\n\nThe 31-year-old says she made it a rule that she had to love and wear all of Fenty Maison herself - the high-end fashion line she founded with Louis Vuitton earlier this year.\n\nShe also reveals that she inspires herself - she is her own muse.\n\n\"I'm not the face of my brand, but I am the muse, and my DNA has to run all the way through it,\" she says.\n\n\"I don't want anyone to pull up my website and think, Rihanna would never wear that.\"\n\nFollow Newsbeat on Instagram, Facebook, Twitter and YouTube.\n\nListen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.", "description": "The singer tells Vogue magazine she turned down the halftime slot to support Colin Kaepernick.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/AAE3/production/_109174734_gettyimages-1175283552.jpg", "published_at": "2019-10-10"}