{"pub": "mirror", "url": "https://mirror.co.uk/sport/rugby-union/breaking-wales-reach-rugby-world-20658834", "downloaded_at": "2019-10-20 12:32:27.799654+00:00", "title": "Wales 20-19 France: Gatland's men fight back to reach Rugby World Cup 2019 semi-final", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nWarren Gatland lived to fight another day after France self-destructed to hand them a place in the Rugby World Cup semi-finals.\n\nLeading 19-10 and in total control, the French contrived to blow their victory chance when giant lock Sebastien Vahaamahina was sent-off for a mindless elbow to the face of Aaron Wainwright.\n\nWales could not believe their luck but took full advantage with Ross Moriarty stealing the match-winning try six minutes from time.\n\nDefeat would have ended Gatland’s tenure as Wales head coach. Instead they return to Tokyo to play either Japan or South Africa for a place in the final.\n\nIt was a complete role reversal from the World Cup semi-final between the nations eight years ago when Sam Warburton was sent off and France won by a single point.\n\n(Image: AFP via Getty Images)\n\n(Image: REUTERS)\n\nThis one will haunt France for years, having led 12-0 after just eight minutes of a first half which was the stuff of nightmares for Gatland, save for Aaron Wainwright’s long-range opportunist try after 13 minutes.\n\nFire-fighting from the start, they fell behind to a fifth minute try by Vahaamahina and before they could get used to the idea found themselves down another.\n\nBeautiful hands and movement from the French backs cut Wales open and flanker Charles Ollivon gleefully applied the finish to stun the thousands of Welsh fans into silence.\n\nThey had been here before of course, when trailing 16-0 at half-time in Paris during the Six Nations and that turned out alright.\n\n(Image: AFP via Getty Images)\n\nBut this seemed different. Back in February individual errors hurt Wales and they sorted themselves out at about the same time as France imploded.\n\nThis time they were so disjointed and disorganised it was as though some of them had never met.\n\nIt got worse when Moriarty replaced the injured Josh Navidi and was sin-binned within two minutes for a high tackle.\n\nThen France added a third sparkling try through centre Virimi Vakatawa and Gatland’s men were in such disarray that the outcome seemed inevitable.\n\n(Image: REUTERS)\n\n(Image: PA)\n\nBut France being France it could never be that simple and nine minutes after half-time, with them again attacking in the Welsh 22, Vahaamahina inexplicably planted an elbow into the face of Wainwright in a maul and became the eighth red card of the tournament.\n\nThis is the guy who threw the brainless long pass which George North intercepted to completed Wales’ comeback in the Six Nations.\n\nAll of a sudden the poor Welsh kicks and turnovers were forgotten as their spirits soared in France’s moment of abject misery.\n\n(Image: Getty Images)\n\n(Image: REUTERS)\n\nBut even after Dan Biggar kicked his second penalty there was still a six-point deficit to rescue.\n\nThen came a French scrum five metres from their own line. Wales got the shove, the ball popped loose and Moriarty scored.\n\nIn a match low on quality but high on drama, it proved the decisive moment.", "description": "Wales fought back from a dismal first-half to claim their place in the last four of the World Cup", "authors": ["Alex Spink", "Image", "Afp Via Getty Images", "Reuters", "Pa", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20658835.ece/ALTERNATES/s1200/0_RUGBYU-WC-2019-MATCH43-WAL-FRA.jpg", "published_at": "2019-10-20"}