{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/18/donald-trump-calls-turkish-president-to-ensure-syria-ceasefire", "downloaded_at": "2019-10-19 11:19:57.838754+00:00", "title": "Donald Trump Calls Turkish President to Ensure Syria Ceasefire", "language": "en", "text": "President Donald Trump said Friday he spoke personally to President Recep Tayyip Erdoğan in response to Kurdish accusations of breaking a ceasefire agreement.\n\n“Just spoke to President Erdogan of Turkey,” Trump wrote on Twitter. “He told me there was minor sniper and mortar fire that was quickly eliminated.”\n\nThe Kurds accused Turkey of violating the ceasefire, citing shelling and gunfire in the border area of the ceasefire agreement.\n\nBut Trump defended Erdogan after his conversation with the Turkish president.\n\n“He very much wants the ceasefire, or pause, to work,” he wrote. “Likewise, the Kurds want it, and the ultimate solution, to happen.”\n\nVice President Mike Pence and Secretary of State Mike Pompeo met with Turkish officials for five hours before announcing a ceasefire in the “safe zone” region, about 20 miles into Syria.\n\n“There is goodwill on both sides & a really good chance for success,” Trump said.\n\nThe president also reassured Americans that the United States had secured the oil resources and that the Kurds and Turkey were securing ISIS prisoners.\n\nHe also claimed that some of the European Union nations had agreed to take over the imprisonment of ISIS fighters captured by the United States.\n\n“This is good news, but should have been done after WE captured them,” he wrote. “Anyway, big progress being made!!!”\n\nTrump made the case that his approach to the foreign policy conflict was different from previous administrations, which gave his proposals for peace in the region a greater chance of success.\n\n“Too bad there wasn’t this thinking years ago,” he wrote. “Instead, it was always held together with very weak bandaids, & in an artificial manner.”\n\nJust spoke to President @RTErdogan of Turkey. He told me there was minor sniper and mortar fire that was quickly eliminated. He very much wants the ceasefire, or pause, to work. Likewise, the Kurds want it, and the ultimate solution, to happen. Too bad there wasn’t….. — Donald J. Trump (@realDonaldTrump) October 18, 2019\n\n…..this thinking years ago. Instead, it was always held together with very weak bandaids, & in an artificial manner. There is good will on both sides & a really good chance for success. The U.S. has secured the Oil, & the ISIS Fighters are double secured by Kurds & Turkey…. — Donald J. Trump (@realDonaldTrump) October 18, 2019", "description": "Donald Trump said Friday that he spoke personally to Erdoğan in response to Kurdish accusations of breaking a ceasefire agreement.", "authors": ["Charlie Spiering"], "top_image": "https://media.breitbart.com/media/2019/10/telephone-donald-trump-calling-640x335.jpg", "published_at": "2019-10-18"}