{"pub": "investingcom", "url": "https://ng.investing.com/news/economic-indicators/global-downturn-is-starting-to-gain-a-foothold-in-the-gulf-43917", "downloaded_at": "2019-09-04 03:49:55.066486+00:00", "title": "Global Downturn Is Starting to Gain a Foothold in the Gulf", "language": "en", "published_at": "2019-09-03", "text": "(Bloomberg) -- Sentiment soured further in the United Arab Emirates as a gauge of business conditions in the second-largest Gulf economy slumped to an eight-year low.\n\nIn an echo of disputes that have roiled global trade, sales to foreign customers posted a “weaker upturn” and new orders stagnated in the U.A.E. in August, according to IHS Markit. Its Purchasing Managers’ Index dropped to 51.6 from 55.1 in July, declining for a third month and edging close to the threshold of 50 that separates contraction from growth.\n\nFears of a global downturn are deepening as signs of a manufacturing slump have emerged from Europe to Asia. Domestic competitive pressures are compounding the outlook for the U.A.E., a federation of seven emirates that includes oil-rich Abu Dhabi and tourism and trade hub Dubai.\n\nHeightened market competition continued to weigh on growth, forcing companies to cut prices by the most since April, according to panelists surveyed by IHS Markit in the monthly release. Activity in the non-oil economy increased “at a notably softer rate” compared to July, with weaker demand curbing the expansion, it said.\n\nEven so, customer spending remained robust in the U.A.E. Domestic demand was also stronger in neighboring Saudi Arabia, where the IHS Markit PMI rose slightly in August.\n\nMeanwhile hiring eased among U.A.E. firms, with employment numbers largely stagnant within the non-oil sector. But at least for now, next year’s World Expo in Dubai is helping support sentiment, according to IHS Markit.\n\n“The dip in activity growth dampened business sentiment in August, although the underlying forecast was still strong,” IHS Markit economist David Owen said in the report. “With the Expo 2020 coming, many businesses were positive that the market will see strong levels of activity in the coming year.”", "description": "Global Downturn Is Starting to Gain a Foothold in the Gulf", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/picaf3e89f438d67c866e8fa2cd71a15ab9.jpg"}