{"pub": "townhall", "url": "https://townhall.com/tipsheet/timothymeads/2019/09/24/five-dumbest-reasons-democrats-have-wanted-to-impeach-trump-n2553617", "downloaded_at": "2019-09-25 04:36:24.697199+00:00", "title": "Five Dumbest Reasons Democrats Have Wanted To Impeach Trump", "language": "en", "text": "Well, the Democrats are actually going to impeach President Donald J. Trump over this Ukraine nonsense. This is not the first time that the looming specter of impeachment has supposedly haunted the president. In no particular order, here are five of the dumbest reasons Democrats have wanted to kick Trump out of office.\n\n1) President Trump Should Be Impeached for Pardoning Joe Arpaio via The Nation. In August 2017, Ian Haney López envisioned a scenario where the courts rejected President Trump's pardoning of Sheriff Joe Arpaio due to his alleged racism. Keep in mind, pardoning the sheriff was constitutional. His reasoning just boiled down to nothing more than Lopez disliking Arpaio and disliking Trump even more. That is not necessarily a sound legal argument.\n\n2) House Democrat prepares impeachment articles against Trump — citing his tweets via Vox. As reported by Vox, in October 2017 Rep. Al Green of Texas said \"the president should be impeached for tweeting 'disparaging' remarks about NFL players, Puerto Ricans, Muslims, LGBTQ people, and President Barack Obama.\" All of his evidence for impeachment comes from President Trump's Twitter, and again the legal reasoning was nothing more than disliking Trump.\n\n3) Leftists wanted Trump impeached for his reaction to Charlottesville. Yet again, our third example of progressives wanting impeachment deals not with the law, but simply due to the fact that they disliked President Trump's reaction to the Neo-nazis in Virginia's despicable behavior that killed an innocent woman. Regardless whether you agree with the way the commander-in-chief handled the situation, you cannot just kick him out office for it. He did not do anything illegal.\n\n4) Progressive Lawmakers’ Answer to Trump’s Racism: Impeachment via Rolling Stone. President Trump more or less stated that Rep. Ilhan Omar can leave the country if she does not like America (all evidence points that she doesn't like the country). Regardless, Rep. Omar said the following, \"I have not made impeachment central to my election or my tenure...But since the day that I was elected, I’ve said to people it is not if he will be impeached, but when. It is time for us to stop allowing this president to make a mockery out of our Constitution. It is time for us to impeach this president.\" Omar and \"the Squad\" did not really give any reasoning for why he should be impeached other than, you guessed it, that he was a racist and they also threw out baseless claims of lawlessness.\n\n5) Russia. Russia. Russia. Enough has been said on this topic already and it is all crap. It was a nothing-burger.\n\nAnd now, Democrats are going to actually go through it because of Ukraine. What a trip this will be.", "description": "Impeachment, everybody's doing it. .09/25/2019 0:33:29AM EST.", "authors": ["Timothy Meads", "Katie Pavlich", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2017/140/20b6eed4-7108-45e3-a528-95330165a071.jpg", "published_at": "2019-09-24"}