{"pub": "cbc", "url": "https://cbc.ca/sports/tennis/the-buzzer-bianca-andreescu-wta-finals-explainer-1.5335572", "downloaded_at": "2019-10-25 23:39:41.643279+00:00", "title": "CBC Sports", "language": "en", "text": "This year's tennis Grand Slams — the four most prestigious tournaments — have all been played. But the biggest payday still awaits at the Women's Tennis Association Finals, which start Sunday in China.\n\nThis is the last event of the season. Canada's Bianca Andreescu is there. Here's what else you need to know about it:\n\nWho else is playing?\n\nThere's both a singles and a doubles tournament at the WTA Finals, and Canada's Gabriela Dabrowski is competing in the doubles with her Chinese teammate Xu Yifan. But we're just going to focus on the singles here. As at any big tennis event, that's the tournament people really care about.\n\nOnly the top eight women in the world are invited to the singles tournament. From highest seed to lowest, they are: Australia's Ash Barty, Czech Republic's Karolina Pliskova, Japan's Naomi Osaka, Andreescu, Romania's Simona Halep, Czech Republic's Petra Kvitova, Switzerland's Belinda Bencic and defending champ Elina Svitolina of Ukraine. Serena Williams did not qualify.\n\nHow does it work?\n\nUnlike most tennis tournaments, which are single elimination, the Finals follow a round-robin format. The players are divided into two groups. Andreescu is in the purple group with the No. 2 seed Pliskova, No. 5 Halep and No. 8 Svitolina. Everyone else is in the red group.\n\nYou play everyone in your group once, and when that's over the top two players in each group advance to the semifinals. From there, it's single knockout. The player with the best record in her group faces the second-place player in the other group. Then the winners square off for the championship. The semifinals are on Saturday, Nov 2. The final is the next day.\n\nHow much money is at stake?\n\nA ton. A Japanese cosmetics brand signed on as the new title sponsor this year, and the total prize money doubled. Depending on how many games she wins in the round-robin, the champion will walk away with at least $4.42 million US and as much as $4.725 million.\n\nEither way, that's the biggest cash prize in tennis history. The U.S. Open is the richest of the four Grand Slams, and this year it offered a record purse. But Andreescu and men's champ Rafael Nadal still earned \"only\" $3.85 million.\n\nThe men's equivalent of the WTA Finals — the ATP Finals — doesn't pay nearly as well. The most the champion can win this year is just north of $2.7 million. Much has been made of the pay gap in pro sports, and for good reason. But the tennis Finals turn that on its head.\n\nHow do the payouts break down?\n\nEveryone gets a $385,000 appearance fee just for showing up. A round-robin win is worth $305K. Qualifying for the semifinals isn't worth any extra money on its own, but it gives you the opportunity to make more. A win in that round guarantees you at least another $1.1 million because that's what the loser of the final match pockets. Winning the championship earns you $3.425 million.\n\nAll the singles ladies. (Clive Brunskill/Getty Images)\n\nWhat about rankings points?\n\nA lot of those are up for grabs too. Just completing a round-robin match is worth 125 points. A win is worth an extra 125. The tournament runner-up adds another 330 points to her total, and the champion adds 750. So a champ who went undefeated in the round robin walks away with 1,500 points.\n\nThat makes this the most valuable tournament of the season outside of the Slams, which award 2,000 points to the champion. The next-highest tier — the so-called Premier Mandatory events, like the one at Indian Wells that Andreescu won back in March — gives 1,000 points to the winner.\n\nCan Bianca reach No. 1?\n\nNo. In fact, it's highly unlikely anyone catches Barty. The rankings system is complicated, but it appears that Barty might be able to lose all three of her round-robin matches and still have enough points to hold off No. 2 Pliskova and No. 3 Osaka.\n\nBut Bianca can still be the people's champ, so to speak. Most fans would consider her the actual best player in the world at the moment if she wins this tournament. In that case, she'll have won the two biggest tournaments of the last two months (this and the U.S. Open) plus two other high-end titles before that: the Rogers Cup in early August and Indian Wells in March. A shoulder injury robbed her of the time in between, but when healthy she's been nearly unbeatable since early March. Her only non-injury-related loss in that time was her quarter-final defeat to Osaka at a Premier Mandatory event in China in early October.\n\nWhat else is at stake for her?\n\nA WTA Finals title could make Andreescu the front-runner for player of the year. Barty has been very consistent all season, but voters for this kind of award (in any sport) tend to reward flashier performances — especially those that happened more recently. Advantage: Andreescu.\n\nBianca also has a chance to reach the highest ranking ever for a Canadian tennis player. Her current ranking of No. 4 is already the best ever by a Canadian woman, and she's got a real shot at topping the No. 3 ranking Milos Raonic achieved on the men's tour. Pliskova and Osaka were only 344 and 275 points ahead of Andreescu, respectively, in the unofficial live rankings on Friday.\n\nAt the end of the 2018 calendar year, canadian tennis sensation Bianca Andreescu was ranked 152nd in the world. Now, she's ranked fourth. How in the world did she get here? 2:18\n\nHow does Andreescu stack up with her group?\n\nVery well. The highest-seeded player, Pliskova, leads the tour this year with four tournament titles. But she didn't win a Premier Mandatory and her best showing in a Slam was a semifinal.\n\nHalep won the biggest tournament of all — Wimbledon — but that's her only title this year. She hasn't even made a semifinal since, and she lost in the second round of the U.S. Open. She's also been bothered by a back injury lately.\n\nSvitolina has zero titles this year, and she hasn't even made a final. She did, however, reach the semis at the last two Slams and at Indian Wells — where Andreescu beat her.\n\nAndreescu's combined head-to-head record against these women is 2-0. She's never faced Halep. She beat Pliskova in this year's Rogers Cup quarter-finals, and she beat Svitolina in the Indian Wells semis. Both matches took three sets.\n\nAnother good sign for Andreescu is that this tournament is being played on a hardcourt. That's the surface she won all three of her titles on this year.\n\nWhat are Bianca's chances of winning the whole thing?\n\nPretty good. In fact, the offshore bookmaker Pinnacle lists her as the favourite. It's very tight, though. She's more like a co-favourite with Osaka and Barty.\n\nWhen does Bianca play?\n\nAll we know right now is her first match. That's Monday vs. Halep. Start time is around 8 a.m. ET.\n\nHow can you watch?\n\nUnfortunately, it's not on TV in Canada because no broadcasters in this country have the rights to the non-Grand Slam women's tournaments. So the only place to watch is on DAZN, the subscription streaming service.\n\nThis is an excerpt from The Buzzer, the CBC Sports daily newsletter. Stay up to speed on what's happening in sports by subscribing below.", "description": "The WTA Finals is not the most prestigious tennis tournament in the world. But it's the one with the biggest winner's cheque. Here's how it works and how Bianca Andreescu can cap off her dream season there.", "authors": [], "top_image": "https://i.cbc.ca/1.5335799.1572028182!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/andreescu-bianca-20191004.jpg", "published_at": "2019-10-25"}