{"pub": "yahoo", "url": "https://news.yahoo.com/rudy-giuliani-refuses-to-comply-with-house-democrats-subpoena-211920120.html", "downloaded_at": "2019-10-15 23:13:38.962972+00:00", "title": "Rudy Giuliani refuses to comply with House Democrats' subpoena", "language": "en", "text": "WASHINGTON — President Trump’s personal lawyer Rudy Giuliani informed House Democrats on Tuesday that he will not comply with a subpoena for documents they sent him as part of an ongoing impeachment inquiry.\n\n“Mr. Giuliani will not participate because this appears to be an unconstitutional, baseless, and illegitimate ‘impeachment inquiry,’” Jon Sale, Giuliani’s attorney, wrote to the chairmen of the three House committees leading the effort.\n\nGiuliani provided Yahoo News with a copy of a letter. Sale’s letter came just hours after Giuliani told CNN that he would be parting ways with the attorney.\n\n“Jon was helping me with assessing [the] congressional request. He will submit his letter and he will be finished with what I asked him to do,” Giuliani said.\n\nLater that day, however, Giuliani told Yahoo News the reports that he would no longer be represented by Sale were incorrect. Giuliani did not immediately respond to subsequent messages asking to clarify the situation.\n\nSale did not respond to a request for comment.\n\nIn the letter, Sale said Giuliani had adopted “all of the positions” laid out by White House counsel Pat Cipollone, who wrote the House chairmen on Oct. 8 refusing to cooperate with the inquiry. Cipollone’s letter said the inquiry “lacks any legitimate constitutional foundation, any pretense of fairness, or even the most elementary due process protections.”\n\nUnlike Giuliani, Trump has not been subpoenaed. Giuliani received his subpoena on Sept. 30. His decision to defy that request for documents opens up the possibility he could be found in contempt of Congress. Spokespeople for the Democratic chairs of the three committees leading the inquiry did not respond to a request for comment about Giuliani’s decision to ignore the subpoena.\n\nAttorneys working for Trump and the White House have attempted to justify not participating in the inquiry by casting it as a partisan effort to oust the president. They have also argued that it is an unofficial inquiry rather than formal impeachment proceedings, which they say deprives Trump of constitutional rights to due process.\n\n“They’ve made us the Soviet Union,” Giuliani said of the Democrats leading the probe.\n\nGiuliani, the former mayor of New York City, is a central figure in the events that sparked the inquiry into Trump, which is centered on a July 25 phone call the president had with his newly elected counterpart in Ukraine. During that call, Trump asked Ukraine’s leader to work with Giuliani to investigate former Vice President Joe Biden and his son Hunter. House Speaker Nancy Pelosi announced the inquiry last month after news of a whistleblower complaint about the call and indications Trump withheld a $400 million aid package to Ukraine as he pushed for Biden to be investigated.\n\nBiden is currently a frontrunner in the Democratic presidential primary. Trump has continuously argued there was no wrongdoing on the call and referred to it as “perfect.”\n\nTwo of Giuliani’s associates, Lev Parnas and Igor Fruman, were arrested on Oct. 9 on charges that they donated money from foreign sources to U.S. political campaigns amid attempts to influence American policy in Ukraine. Parnas, a U.S. citizen who was born in Ukraine, and Fruman, a U.S. citizen who was born in Belarus, had also aided Giuliani’s attempts to investigate the Bidens.\n\nWhile Giuliani was not named in the indictment against Parnas and Fruman, Reuters reported that federal prosecutors are “examining Giuliani’s interactions” with the two men. On Monday, Reuters also reported that Giuliani was paid $500,000 for work he did for Parnas’s Florida-based company, Fraud Guarantee.\n\nIn a text message to Yahoo News on Tuesday, Giuliani said his consulting firm, Giuliani Partners, was “retained by Fraud Guarantee in or about August 2018.”\n\n“We were referred by a prominent attorney as our firm is particularly suited for this engagement because of its 17 years of experience in this area and our past experience with this type of business,” Giuliani said, later adding, “Most of our work was completed in 2018, but there is a continuing obligation to advise with regard to follow-up questions.”\n\nGiuliani further said that “contrary to leaks and misinformation,” the source of payments from Fraud Guarantee was “domestic.”\n\nWhen asked if he was concerned about potential repercussions from the House or the reported federal investigation, Giuliani wrote, “No.”\n\n_____\n\nDownload the Yahoo News app to customize your experience.\n\nRead more from Yahoo News:", "description": "President Trump’s personal lawyer Rudy Giuliani informed House Democrats on Tuesday that he will not comply with a subpoena for documents they sent him as part of the ongoing impeachment inquiry.", "authors": ["Hunter Walker", "White House Correspondent"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Dye0BBSiX6D31a.LJ1SN_w--~B/aD05NzI7dz0xMzk4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/c2347c20-eb63-11e9-aff7-ba395742332d", "published_at": "2019-10-15"}