{"pub": "axios", "url": "https://axios.com/deaths-vaping-lung-illness-b6af29af-0078-44f8-ae87-5ecfcf12b3a4.html", "downloaded_at": "2019-10-29 02:15:24.902830+00:00", "title": "34th person reported dead from vaping-related lung illness", "language": "en", "text": "37% of the 19 who died reported use of nicotine-containing products.\n\n63% reported exclusive use of THC-containing products.\n\n16% reported exclusive use of nicotine-containing products.\n\nWhat's happening: Deaths have occurred in Alabama, California (3), Connecticut, Delaware, Florida, Georgia (2), Illinois (2), Indiana (3), Kansas (2), Massachusetts, Michigan, Minnesota (3), Mississippi, Missouri, Montana, Nebraska, New Jersey, New York, Oregon (2), Pennsylvania, Tennessee, Texas, Utah and Virginia.\n\nIn New York , the first teenager died after being hospitalized twice in September with a vaping-related illness.\n\n, the first teenager died after being hospitalized twice in September with a vaping-related illness. In Massachusetts , the death of a woman in her 60s was reported on Oct. 7 as the state's first vaping-related death. The state currently has a four-month ban on all vaping products, the harshest in the U.S.\n\n, the death of a woman in her 60s was reported on Oct. 7 as the state's first vaping-related death. The state currently has a four-month ban on all vaping products, the harshest in the U.S. In Georgia , a patient with a history of heavy nicotine vaping, but no reported history of vaping THC, died, Georgia's Department of Health said.\n\n, a patient with a history of heavy nicotine vaping, but no reported history of vaping THC, died, Georgia's Department of Health said. A man and woman in Kansas, both over age 50 with \"underlying health conditions,\" died from a lung-related illness linked to vaping, according to Kansas Gov. Laura Kelly.\n\nboth over age 50 with \"underlying health conditions,\" died from a lung-related illness linked to vaping, according to Kansas Gov. Laura Kelly. A Missouri man in his mid-40s died from the illness, according to the state's Department of Health and Senior Services.\n\nThe big picture: The CDC reported 1,604 confirmed and probable cases of severe respiratory illnesses as of Oct. 22 among those who vaped nicotine or cannabis products in 49 states, Washington, D.C., and a U.S. territory. Officials expect that number to continue to rise.\n\nWhat they're saying: \"This cluster of illnesses represents an emerging clinical syndrome\" and points to a \"worrisome\" trend, physicians and health officials wrote on Sept. 6 in the New England Journal of Medicine.\n\n\"It is possible that some of these cases were already occurring and we were not picking them up\" prior to the agency's investigation into the illnesses, the director for the FDA Center for Tobacco Products, Mitch Zeller, said in August.\n\nOf note: A woman filed the first wrongful death lawsuit against Juul in October, claiming the e-cigarette maker's nicotine cartridges were a significant factor in causing the death of her 18-year-old son over a year ago.\n\nGo deeper: U.S. investigates fatality from vaping as lung-related illnesses rise", "description": "The CDC most recently said there are 1,604 possible cases of severe respiratory illnesses.", "authors": [], "top_image": "https://images.axios.com/l0uKyGtXSLn86dRczwxfWGMTf94=/0x102:2142x1307/1920x1080/2019/10/01/1569963638071.jpg", "published_at": "2019-09-06"}