{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/ufc/article-7542859/Dustin-Poirier-claims-Conor-McGregor-UFC-opponent-Khabib-Nurmagomedov-loss.html", "downloaded_at": "2019-10-07 00:11:45.802909+00:00", "title": "Dustin Poirier claims Conor McGregor will be his next UFC opponent after Khabib Nurmagomedov loss", "language": "en", "text": "Dustin Poirier has claimed he is set to be Conor McGregor's next opponent after engaging in a Twitter spat with the man who beat him inside a round in 2014.\n\nMcGregor has not fought since choking out in the third round against Khabib Nurmagomedov in Las Vegas last year, but his former victim said he would be taking on the ex-champion while dismissing a challenge from rival Dan Hooker.\n\nPoirier told Hooker: 'I'm fighting the Irishman next. You're close but not yet buddy'.\n\nDustin Poirier lost to Conor McGregor in a round in 2014 but claims a rematch has been agreed\n\nMcGregor lost his last fight against Khabib Nurmagomedov, who also beat Poirier last month\n\nHe goaded McGregor after the Irishman mocked the UFC 244 headliner, between Nate Diaz and Jorge Masvidal in New York on November 2, as an 'interim' fight.\n\nThe 30-year-old American pointed to McGregor's run of more than three years without a win and told his former featherweight opponent to 'do the math'.\n\nMcGregor, whose inactivity has sent him tumbling to 12th in the UFC's pound-for-pound rankings, hit back by telling Poirier to 'check my bank digits.'\n\nPoirier fell to Nurmagomedov in three rounds in their lightweight unification fight in Abu Dhabi\n\nMcGregor is thought to want a rematch with Nurmagomedov, who also beat Poirier in three rounds at UFC 242 in Abu Dhabi on September 7.\n\nThe former UFC featherweight, lightweight and welterweight champion has not fought since losing to Nurmagomedov in his only contest since a two-round stoppage of Eddie Alvarez in New York in November 2016.\n\nMcGregor and Poirier originally met in UFC 178 in Las Vegas more than five years ago, when McGregor took less than two minutes to end his opponent's night.\n\nEarlier in the week, Poirier tweeted that he had 'no clue' who he would fight next, before retweeting a fan who said: 'Stop lying, you're fighting Conor in Dublin.'", "description": "McGregor has not fought since choking out in the third round against Khabib Nurmagomedov in Las Vegas last year, but his former victim said the pair will meet in a rematch of their one-round 2014 bout.", "authors": ["Ben Miller For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/10/19356594-0-image-a-7_1570352719574.jpg", "published_at": "2019-10-06"}