{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/gop-rival-bill-weld-says-trump-has-committed-treason-pure-and-simple/2019/09/23/30b80606-de00-11e9-b199-f638bf2c340f_story.html", "downloaded_at": "2019-09-23 17:29:57.369361+00:00", "title": "GOP rival Bill Weld says Trump has committed ‘treason, pure and simple’", "language": "en", "text": "Republican presidential candidate and former Massachusettsgovernor Bill Weld speaks during the Climate Forum at Georgetown University on Friday. (Jose Luis Magana/AP)\n\nFormer Massachusetts governor Bill Weld, who is challenging President Trump for the Republican nomination next year, on Monday accused him of “treason” for pressing the leader of Ukraine to investigate former vice president Joe Biden and his son.\n\nWeld’s comments came in response to reports that Trump repeatedly brought up investigating Biden, who is seeking the 2020 Democratic nomination, and his younger son, Hunter, in a July call with Ukrainian President Volodymyr Zelensky.\n\n“Talk about pressuring a foreign country to interfere with and control a U.S. election,” Weld said during an appearance on MSNBC’s “Morning Joe.” “It couldn’t be clearer, and that’s not just undermining democratic institutions. That is treason. It’s treason, pure and simple, and the penalty for treason under the U.S. code is death. That’s the only penalty.”\n\n“The penalty under the Constitution is removal from office, and that might look like a pretty good alternative to the president if he could work out a plea deal,” added Weld, who appeared in a joint interview with two other Republicans challenging Trump, former congressmen Mark Sanford (S.C.). and Joe Walsh (Ill.).\n\n[White House press secretary noncommittal about releasing transcript of Trump call with Ukrainian president]\n\nTrump appeared to confirm Sunday as he spoke with reporters that he mentioned Joe and Hunter Biden in the phone call with Zelensky — though he insisted he has done nothing improper.\n\nTrump has repeatedly raised the specter of impropriety on the part of Biden, whose son Hunter was on the board of a Ukrainian gas company that Trump pushed Zelensky to investigate, according to people familiar with the matter.\n\nThe call with Zelensky is part of a whistleblower complaint that the acting director of national intelligence, Joseph Maguire, has been unwilling to turn over to Congress, a refusal that has rankled Democrats and heightened calls for impeaching Trump.\n\nWeld pointed out Monday that the Constitution calls for the removal of presidents for “treason, bribery or other high crimes and misdemeanors” and argued that Trump has now met the most serious threshold.\n\n“We don’t have to worry about bribery any more, although I think he’s committed that,” Weld said. “We don’t have to worry about other high crimes and misdemeanors, although I think he’s committed many. He’s such a lawless man. We’ve got treason, and we don’t have to dribble around the court. We can go right for the hoop.”\n\n“It’s well past time for this guy … to be carted off to save us all,” Weld added.", "description": "The former Massachusetts governor, who is challenging Trump for the Republican nomination, pointed to a July phone call with the leader of Ukraine.", "authors": ["John Wagner", "National Reporter Leading The Post'S Breaking Political News Team", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/nba7vvWjNMj183G177DPR0isbBo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TFPE6JG6AII6TMMZ6Y4L6LBUB4.jpg", "published_at": "2019-09-23"}