{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1WB0BH-OCASP", "downloaded_at": "2019-09-26 05:23:43.242892+00:00", "title": "MLB notebook: Cubs' Epstein denies Red Sox rumors", "language": "en", "text": "Asserting that he has plenty to work on as president of baseball operations with the Chicago Cubs, Theo Epstein said Wednesday that his attention is not focused on his former job with the Boston Red Sox, which is now vacant.\n\nFILE PHOTO: Mar 28, 2019; Arlington, TX, USA; Chicago Cubs President of Baseball Operations Theo Epstein stands in the dugout prior to the opening day game against the Texas Rangers at Globe Life Park in Arlington. Mandatory Credit: Ray Carlin-USA TODAY Sports\n\nThe Cubs lost their eighth straight game on Wednesday and were officially eliminated from postseason play, before which Epstein addressed rumors that he could replace Dave Dombrowski, who was fired as president of baseball operations by the Red Sox on Sept. 9.\n\n“There’s no truth to that,” said Epstein, who has two years remaining on a five-year extension he signed in 2016. “I’m here (with the Cubs). We have a lot we need to work on to get back to the level we’re accustomed to.”\n\nThe Cubs made the postseason in each of the previous four seasons, winning the World Series in 2016.\n\n—St. Louis Cardinals right-hander Michael Wacha left his start against the Arizona Diamondbacks in the second inning at Phoenix and was diagnosed with a right shoulder strain.\n\nAccording to the St. Louis Post-Dispatch, Wacha will undergo an MRI exam Thursday in St. Louis.\n\nPer the Post-Dispatch, Wacha didn’t feel right while warming up but didn’t tell the team, hoping to save the bullpen after St. Louis used 11 pitchers in Tuesday’s 19-inning loss to Arizona.\n\n—Cincinnati Reds All-Star right-hander Sonny Gray underwent arthroscopic surgery to remove loose bodies from his pitching elbow.\n\nGray, 30, is slated to be recovered well before the start of spring training. Gray dealt with the elbow issue all season, but it didn’t prevent him from recording a career-best 205 strikeouts.\n\n—A day after Ronald Acuna Jr. was pulled in a game because of what the team called right hip tightness, the Atlanta Braves announced the injury is a hip sprain and that the outfielder will not play again in the regular season.\n\nAcuna, 21, ends the season with 41 home runs and an NL-best 37 stolen bases. He was looking to become the fifth member of the 40-40 club (40 home runs, 40 stolen bases in the same season).\n\nAcuna is expected to be ready for the playoffs.\n\n—Kansas City Royals shortstop Adalberto Mondesi will undergo surgery on his left shoulder and may not be ready for Opening Day in 2020.\n\nThe 24-year-old Mondesi is expected to be sidelined for about six months, team trainer Nick Kenney said.\n\nMondesi injured the shoulder for the second time this season during Sunday’s loss to the Minnesota Twins. He also hurt the shoulder in July, missing 41 games before returning on Sept. 1.\n\n—Philadelphia Phillies All-Star catcher J.T. Realmuto will undergo surgery on Friday to repair meniscus damage in his right knee, manager Gabe Kapler told reporters.\n\nThe 28-year-old Realmuto batted .275 and established career bests of 25 homers and 83 RBIs while playing in 145 games.\n\n—The Oakland Athletics reinstated right-hander Frankie Montas to the active roster, after he served an 80-game suspension following a failed test for a performance-enhancing drug.\n\nMontas, who has not pitched since June 20, started Wednesday night’s game against the Los Angeles Angels.\n\nMontas, 26, is 9-2 this season with a 2.70 ERA over 15 starts. Despite his return during the final week of the regular season, Montas will not be eligible for the playoffs if the A’s advance.\n\n—Minnesota Twins right-hander Sam Dyson underwent shoulder surgery in Los Angeles this week with a grim prognosis that could have him out this season and all of 2020 as well.\n\nDyson, acquired at the July 31 trade deadline from the San Francisco Giants to bolster the bullpen, had ligaments repaired in the capsule of his throwing shoulder. The long range on his timeline to return is 12 months.\n\n—Pittsburgh Pirates left-hander Felipe Vazquez was denied bail following his arrest last week on felony charges, which included sexual assault of a minor.\n\nAfter an arraignment in front of District Judge Charles D. Moore, Vazquez was ordered to be held without bond and was escorted in handcuffs by sheriff deputies back to Westmoreland County Prison southeast of Pittsburgh.\n\nVazquez, 28, was taken into custody by Pennsylvania State Police last week on an arrest warrant from Florida. The warrant not only stemmed from illicit electronic communication with an underage girl, he reportedly told investigators he attempted to have sex with the girl in 2017.\n\n—Major League Baseball has already taken one look at why so many home runs have been hit in recent seasons, but with 2019 taking the home run blitz to new extremes, commissioner Rob Manfred said the league is asking scientists to further examine the baseball being used.\n\nThe previous record for most home runs in a major league season was 6,105, set in 2017. That mark fell this season, when MLB saw No. 6,106 leave the confines of Orioles Park in Baltimore on Sept. 11. The 2018 total was 5,585. Starting play on Wednesday, MLB batters had hit 6,590.\n\n—Field Level Media", "description": "Asserting that he has plenty to work on as president of baseball operations with the Chicago Cubs, Theo Epstein said Wednesday that his attention is not focused on his former job with the Boston Red Sox, which is now vacant.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434003671&w=1200&r=LYNXMPEF8P07A-OCASP", "published_at": "2019-09-26"}