{"pub": "yahoo", "url": "https://yahoo.com/entertainment/catherine-zeta-jones-shares-hilarious-163022615.html", "downloaded_at": "2019-10-19 19:08:30.811264+00:00", "title": "Catherine Zeta-Jones Shares Hilarious Photo of 19-Year-Old Son Dylan's 'College Life' During Visit", "language": "en", "text": "Celebrity on campus!\n\nOn Friday, Catherine Zeta-Jones posted an Instagram photo with her son Dylan Douglas while visiting him at college. The 19-year-old, whom the actress shares with husband Michael Douglas, is a sophomore at Brown University.\n\n“On campus with my boy Dylan,” Zeta-Jones, 50, captioned the sweet mother-son photo, in which she could be seen wearing round sunglasses, a black jacket and a pink scarf.\n\nOn her Instagram Story, the star also shared two gorgeous clips of her son’s campus. “Beautiful fall day,” she captioned one of the videos. “Perfect.”\n\nIn another Instagram Story, Zeta-Jones posted a hilarious photo of Dylan’s twisted-up toothpaste tube.\n\n“I think my son needs a new tube of toothpaste,” she wrote. “College life 😂.”\n\nWant all the latest pregnancy and birth announcements, plus more celebrity parenting news? Click here to get those and more in the PEOPLE Parents newsletter.\n\nCatherine Zeta-Jones/Instagram More\n\nCatherine Zeta-Jones/Instagram More\n\nLast September, Zeta-Jones posted a touching video on Instagram documenting the moment when the whole family dropped Dylan off at Brown. Dylan’s sister Carys, 16, was also along for the sendoff and even shared an emotional hug with her big brother when they said goodbye.\n\n“Let the lectures really begin! I love you Dylan. Good luck in the next exciting and enlightening chapter of your life,” the actress wrote at the time.\n\nRELATED: Michael Douglas, 75, Says He Worries About His Daredevil 19-Year-Old Son Dylan\n\nEarlier this month, Douglas, 75, spoke about his son Dylan’s “daredevil” tendencies during an episode of The Ellen DeGeneres Show, after host Ellen DeGeneres shared a clip of the teen diving off of a high cliff into water.\n\n“He does all kinds of things like this,” DeGeneres said, showing another photo of Dylan skydiving.\n\nRELATED: Michael Douglas’ Son Dylan Goes Skydiving and Mom Catherine Zeta-Jones Finds Out on Instagram\n\n“He just did a skydiving thing,” Douglas replied. “But I remember that age. It’s a hormonal thing, I think, for boys, testing yourself … I just think it — you know, what I did not like is he was the first one to jump.”\n\n“I said, ‘Don’t be the first one to jump!’” the Kominsky Method actor continued. “Let a couple other people go off first to test it … So I said, ‘Okay, just don’t be first!’”\n\nDylan shared a video of his skydiving adventure to his Instagram in August, cheekily writing in the caption, “Don’t tell mom…”\n\nHowever, Zeta-Jones assured him she had seen the video, hilariously commenting, “Mom just found out 😩😩😩😩.”\n\nMeanwhile, his older brother Cameron, 40, showed the teen some support, writing in the comments, “🤘.”", "description": "Catherine Zeta-Jones Visits Son Dylan at College", "authors": ["Helen Murphy"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3OLg_Hla5fGZGlVyJXIpAQ--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://imagesvc.meredithcorp.io/v3/tardis/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2019%2F10%2Fcatherine-zeta-jones-b.jpg&h=1000&f=jpg&q=80", "published_at": "2019-10-19"}