{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7599409/Bella-Hadid-stuns-cowgirl-attire-goes-braless-poses-Vogue-Australia.html", "downloaded_at": "2019-10-22 13:32:45.101007+00:00", "title": "Bella Hadid stuns in cowgirl attire and even goes braless as she poses for Vogue Australia", "language": "en", "text": "Bella Hadid looks stunning on the cover of Vogue Australia's upcoming November issue.\n\nThe 23-year-old model donned western-inspired clothing for the photoshoot, which was a nod to the late South African-born photographer, Sam Haskins.\n\nInspired by the famed photographer's 1965 book, Cowboy Kate & Other Stories, Bella posed confidently for the cover in black pants, her thumbs hooked through the pockets.\n\nCover girl: Bella Hadid looks stunning on the cover of Vogue Australia's upcoming November issue\n\nShe also wore a busily designed top, which featured a white and black floral corset, colourful floral print sleeves, and a black and silver zip fastening at the front.\n\nIt also featured blue velvet draping across the shoulders, with ruching created by silver chain fastenings.\n\nBella rounded out her cowgirl look with a black leather belt and black velvet cowgirl hat, with the magazine's editor-in-chief Edwina McCann saying the renowned model found the shoot 'empowering'.\n\nTribute: The 23-year-old model donned western-inspired clothing for the photoshoot, which was a nod to the late South African-born photographer, Sam Haskins\n\nInside the magazine, the stunning star posed for a series of equally-glamorous photos, this time shot in black and white.\n\nOne photo shows Bella seemingly topless with just a Chanel kerchief tied around her neck and wearing a lighter-coloured cowgirl hat.\n\nAnother photo shows her dressed in denim hotpants, while wearing a black vest with nothing on underneath.\n\nWestern front: Inside the magazine, the stunning star posed for a series of equally glamorous photos, this time shot in black and white\n\nShe wore a kerchief around her neck patterned with pearls, and glowers at the camera, a cowgirl hat perched on her head.\n\nIn one image, Bella appears dressed in a pair of leather and denim pants, paired with black cowboy boots.\n\nShe wore a black bra and cowboy hat, and is seen standing side-on, bowing her head towards the camera.", "description": "Bella Hadid looks stunning on the cover of Vogue Australia's upcoming November issue.", "authors": ["Demeter Stamell For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/09/20025282-0-image-a-65_1571731315026.jpg", "published_at": "2019-10-22"}