{"pub": "independent", "url": "https://independent.co.uk/news/world/europe/edward-snowden-france-asylum-rejected-nsa-russia-jean-yves-le-drian-a9111631.html", "downloaded_at": "2019-09-19 23:07:36.230161+00:00", "title": "Edward Snowden: France rejects new asylum request from NSA whistleblower", "language": "en", "text": "France’s foreign minister said they will not be granting former US National Security Agency (NSA) contractor Edward Snowden asylum because “it is not the time”.\n\nThe whistleblower, who has been living in Russia to escape US prosecution, had said he would “love to see” Emmanuel Macron allow him to live in France.\n\nHe unsuccessfully applied in 2013 and asked again this week, arguing that “protecting whistleblowers is not a hostile act”.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMr Snowden leaked classified documents detailing government surveillance programmes in 2013.\n\nHe initially fled to Hong Kong before settling in Russia.\n\nShape Created with Sketch. Edward Snowden saga: Bolivia accuses Europe of 'kidnapping' Bolivian president in forcing Evo Morales' plane to land in Vienna Show all 3 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Edward Snowden saga: Bolivia accuses Europe of 'kidnapping' Bolivian president in forcing Evo Morales' plane to land in Vienna 1/3 web-bolivia-getty.jpg President Morales boards his plane in Vienna Getty Images 2/3 evo-morales.jpg Bolivian President Evo Morales Reuters 3/3 SnowdenMAPwebNEW.jpg 1/3 web-bolivia-getty.jpg President Morales boards his plane in Vienna Getty Images 2/3 evo-morales.jpg Bolivian President Evo Morales Reuters 3/3 SnowdenMAPwebNEW.jpg\n\nForeign minister Jean-Yves Le Drian told CNews television that when Mr Snowden first asked for French asylum in 2013 the government “considered it was not the time. I don’t see what has changed.”\n\nMr Snowden has also sought asylum in several other countries.\n\nThe former NSA contractor said this week that he would like to return to the United States if guaranteed a fair trial.\n\n“I am not asking for a parade. I’m not asking for a pardon,” he said in an interview. “What I’m asking for is a fair trial.”\n\nHe requested the jury to consider the merits of his leak, which revealed mass government surveillance taking place in the US and abroad, rather than simply whether he broke the law.\n\nMoscow has extended his asylum to 2020, although the whisteblower has been an open critic of the government.\n\nHe said last year that he “strongly” disagreed with president Vladimir Putin’s policies and called the government “corrupt in many ways”.\n\nHis memoir was released in about 20 countries this week, including France.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nThe United States has filed a lawsuit against Mr Snowden, saying the memoir violates non-disclosure agreements.\n\nAdditional reporting by Associated Press", "description": "France’s foreign minister said they will not be granting former US National Security Agency (NSA) contractor Edward Snowden asylum because “it is not the time”.", "authors": ["Zoe Tidman"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/10/06/18/edward-snowden.jpg", "published_at": "2019-09-19"}