{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/accomplishments-of-dr-steven-rosenberg-in-cancer-immunotherapy-inspire-young-researchers-in-japan-xiv-fujio-cup-quiz-on-stem-cells-is-won-by-india", "downloaded_at": "2019-10-16 08:29:01.314681+00:00", "title": "Accomplishments of Dr. Steven Rosenberg in Cancer Immunotherapy Inspire Young Researchers in Japan & XIV Fujio Cup Quiz on Stem Cells Is Won by India.", "language": "en", "text": "TOKYO — Utilizing the capability of one’s own immune system to tackle cancer, an out-of-the box idea was the brain child of Dr. Steven Rosenberg almost three decades ago. His initiative which paved way for a new chapter in oncology, inspired many young scientists and clinicians in the NCRM NICHE 2019 held in Tokyo, Japan, as his acceptance speech in the Edogawa NICHE Prize ceremony was videocast.\n\nFujio Cup Quiz Elites inspired by Dr Steven Rosenberg in the NCRM NICHE 2019, Tokyo, Japan\n\nNCRM NICHE, an active knowledge gaining academic event since 2006 in which young scholars from all over the world compete for the Fujio Cup Quiz (FCQ) in regenerative medicine is evolving to be an open innovation platform according to Dr. Shojiro Katoh, Chairperson of Edogawa Evolutionary Lab of Science (www.eels.tokyo), a co-host. He added that the FCQ motivated his team research on 16 different themes in Regenerative Medicine in various clinical specialties, among which two have completed clinical pilot studies with successful outcome viz., corneal endothelial regeneration and urethral stricture repair.\n\nThe XIV edition of FCQ contest that witnessed teams from Malaysia, Indonesia and India in the finals, was won by Reshma Romanas and Aayurshi Agrahari of Kasturba Medical College, India. Alumni of the FCQ are now eligible to nominate the awardees for Edogawa NICHE Prize which was established in 2018 to honour scientists or clinicians who develop novel solutions in healthcare, based on inter-disciplinary interactions. Dr. Steven A. Rosenberg, Chief of surgery, National Cancer Institute, NIH, USA is the recipient of the award in 2019. The award portrays such accomplished role models to the FCQ Elites according to the organizers who have instituted “Joyce & James Till Travel Grant” with a generous grant by Prof James Till, that supports travel of yesteryears FCQ Elites, who are now accomplished researchers in their own rights to meet and inspire the FCQ Elites of today, thus bringing together science and generations across nations.\n\nNCRM NICHE is supported by a consortium with EELS as knowledge partners and JBM Inc., as industry partners based in Tokyo which has set up a hybrid cell culture cum biomaterials lab for taking forward the cell therapy and tissue engineering innovations to bed side, with future plans to propagate them globally through networking with like-minded academic and industry partners.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191016005321/en/\n\nContacts\n\nGN Corporation Co. Ltd.\n\nSamuel Jk Abraham\n\ninfo@gncorporation.com", "description": "TOKYO — Utilizing the capability of one’s own immune system to tackle cancer, an out-of-the box idea was the brain child of Dr. Steven Rosenberg almost three decades ago.", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/bw20191016005321_ncrm_niche_2019_fcq_pr_pic_02ed_16oct19.jpeg", "published_at": "2019-10-16"}