{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-people-jeffrey-epstein-araoz/jeffrey-epstein-accuser-expands-lawsuit-against-estate-alleged-enablers-idUKKBN1WN281", "downloaded_at": "2019-10-09 01:02:39.030078+00:00", "title": "Jeffrey Epstein accuser expands lawsuit against estate, alleged enablers", "language": "en", "text": "NEW YORK (Reuters) - A New York woman who said Jeffrey Epstein began grooming her for sex when she was 14 and later raped her expanded her lawsuit against his estate, naming several women who allegedly enabled the financier’s abuses and seeking to block the estate from shielding his assets from victims.\n\nFILE PHOTO: Jennifer Araoz, an alleged victim of Jeffrey Epstein, walks after a hearing in the criminal case against Epstein, who died in August in what a New York City medical examiner ruled a suicide, at Federal Court in New York, U.S., August 27, 2019. REUTERS/Shannon Stapleton\n\nIn her amended complaint filed on Tuesday, Jennifer Araoz accused four women by name who once worked with Epstein of misconduct, and added more than 20 corporate defendants associated with the late financier.\n\nAraoz, 32, wants “justice not just against Mr. Epstein’s estate, but the network of enablers that surrounded him, and the network of corporate interests that surrounded him,” her lawyer Daniel Kaiser told reporters on a conference call.\n\n“Every penny of his estate should be available to satisfy the claims of victims,” he added.\n\nEpstein, 66, died by hanging himself in his Manhattan jail cell on Aug. 10, two days after signing a will and putting his estimated $577 million estate into a trust.\n\nKaiser said it would be obvious to any judge that this was a fraudulent effort to keep his money away from victims.\n\nThe four women include Ghislaine Maxwell, Epstein’s longtime confidante; Lesley Groff, a former secretary; Cimberly Espinosa, a former executive assistant; and Rosalyn Fontanilla, a former maid who died in October 2016.\n\nAll but Fontanilla are named as defendants.\n\nA lawyer for Maxwell did not immediately respond to requests for comment. Maxwell, the daughter of late British publisher Robert Maxwell, has denied involvement in Epstein’s sex trafficking.\n\nGroff’s lawyer Michael Bachner said: “At no time during Lesley’s employment with Epstein did she ever engage in any misconduct.”\n\nNeither Espinosa, nor a lawyer for the executors of Epstein’s estate, could immediately be reached for comment.\n\nFollowing his July 6 arrest, Epstein pleaded not guilty to sex trafficking charges involving dozens of underage girls at his mansions on Manhattan’s Upper East Side and in Palm Beach, Florida.\n\nHe had escaped federal prosecution by pleading guilty in 2008 to Florida state prostitution charges, an agreement now widely considered too lenient.\n\nThe financier once counted U.S. President Donald Trump, former U.S. President Bill Clinton and Britain’s Prince Andrew as friends. They have not been accused of criminal wrongdoing.\n\n‘THREE GIRLS A DAY’\n\nAraoz accused the defendants of conspiring to identify and procure a steady stream of underage girls for Epstein to sexually abuse.\n\nThe defendants “participated with and assisted Epstein in maintaining and protecting his sex trafficking ring, ensuring that approximately three girls a day were made available to him for his sexual pleasure,” the amended complaint said.\n\nAraoz filed her lawsuit in a New York state lawsuit in Manhattan.\n\nAraoz, who claims she was recruited to give massages to Epstein in 2001, said Epstein did not use a condom while raping her the next year, causing a panic disorder worsened by her father’s recent death from AIDS.\n\nShe also said she quit a Manhattan high school near Epstein’s home because she feared seeing him or his recruiter.\n\nAraoz had been the first person to sue Epstein’s estate under New York’s Child Victims Act, which gave accusers a one-year window to sue over alleged sexual abuse when they were underage, regardless of when that abuse occurred.\n\nAt least five other lawsuits have since been filed against Epstein’s estate.\n\nEpstein’s death ended the federal criminal case against him, but not the investigation of his alleged accomplices.", "description": "A New York woman who said Jeffrey Epstein began grooming her for sex when she was 14 and later raped her expanded her lawsuit against his estate, naming several women who allegedly enabled the financier's abuses and seeking to block the estate from shielding his assets from victims.", "authors": ["Jonathan Stempel", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191008&t=2&i=1438545441&w=1200&r=LYNXMPEF971KB", "published_at": "2019-10-08"}