{"pub": "breitbart", "url": "https://breitbart.com/national-security/2019/10/11/turkish-invasion-brings-syrian-iraqi-kurds-together", "downloaded_at": "2019-10-12 00:29:11.159124+00:00", "title": "Turkish Invasion Brings Syrian and Iraqi Kurds Together", "language": "en", "text": "The Kurdistan Regional Government (KRG), the semi-autonomous Kurdish provincial leadership in Iraq, expressed solidarity with the Syrian Kurds on Thursday, denounced Turkey’s invasion of northeastern Syria, and criticized the United States for failing to prevent the Turkish operation.\n\n“The government calls on Turkey, as a member of the Global Coalition, to avoid any initiative that would undermine the progress made against ISIS, including jeopardizing the secure detention of terrorist fighters,” the KRG said.\n\n“The consequences of military escalation have implications far beyond Syria’s borders, creating the conditions for a return of ISIS and a mass displacement of people,” the statement warned.\n\n“It is crucial therefore that all parties in the conflict, including the Kurdish parties, engage in dialogue to de-escalate the situation. The government has consistently stated that the crisis must be solved through a stable political solution which enshrines the rights of all Syrians, including the Kurdish people,” it concluded.\n\nThe KRG appealed to Russia, which intervened with military force in Syria to protect the regime of dictator Bashar Assad, to act in defense of the Syrian Kurds. The Russians have indicated a willingness to mediate in the conflict, but have not taken direct action to halt the Turkish invasion.\n\n“We call on the international community, including the U.S., Russia, UK, and France, to put their utmost efforts to end this undesired situation, prevent future destabilization, and bring about an atmosphere for negotiations,” the Iraqi Kurdish parliament said on Thursday, reminding the international community of the sacrifices made by Kurds while fighting the Islamic State.\n\nThe parliament said it strongly condemns “every attack which targets civilians by any sides” and supports “regional dialogue for a durable resolution.”\n\nThe Iraqi Kurds notably included some criticism of Syrian Kurds in these statements, as when condemning attacks against civilians by “any sides” and urging Kurdish parties to help “de-escalate the situation.” The KRG parliamentary statement acknowledged the Kurds are divided into factions that have long-standing disputes with each other.\n\nKRG officials have been in communication with members of the U.S. Congress this week, urging them to convince President Donald Trump to change his mind and do what he can to push the Turks out of Syria.\n\n“Eleven civilians have been killed and five injured as a result of this,” said one such communique sent after the Turkish operation began. “Syrian Kurds simply have no place to go as this is their ancestral homeland. For the Kurds, it is a matter of life and death. They will be forced to defend themselves, diverting resources from the maximum campaign pressure against ISIS.”\n\n“This is a disaster in the making. Therefore, it is in the best interest of all parties to prevent this from taking place while there is still time, and Washington is the only player in this equation that could stop this disaster in the making,” the Iraqi Kurdish letter to Congress said.\n\nThe KRG’s representative in London, Karwan Jamal Tahir, told Newsweek on Wednesday that a Turkish attack on the Syrian Kurds has long been anticipated, and his government took President Trump seriously when he said last December that he wanted to pull U.S. troops out of Syria. He said Trump’s sudden withdrawal of troops from the area this week sent a “very clear green light” message to Turkey that it could proceed with its attack.\n\nTahrir said the Iraqi Kurdish government is deeply concerned about the prospect of Turkey driving another flood of refugees into its territory. “I don’t think we can bear more refugees from Syria,” he said, while acknowledging there were few realistic alternatives for Syrian Kurds fleeing the Turkish onslaught.\n\n“The people cannot bear anymore crisis in that area, and there should be a talk between the government – especially the Turkish government, Russia, even the Syrian government,” Tahir urged, emphasizing that the Kurds “cannot be left out” of discussions over Syria’s future.", "description": "Iraqi Kurds denounce the Turkish invasion of Syria and worry about a flood of refugees pouring into their territory.", "authors": ["John Hayward"], "top_image": "https://media.breitbart.com/media/2019/08/wi/afp/07/87c492_rights-groups-regularly-criticised-erosion-free-speech-in-turkey-president-e1566339343675-639x335.jpg", "published_at": "2019-10-11"}