{"pub": "nationalreview", "url": "https://nationalreview.com/corner/inside-the-october-28-2019-issue-of-national-review", "downloaded_at": "2019-10-12 00:13:48.174374+00:00", "title": "Inside the October 28, 2019, Issue of National Review", "language": "en", "text": "Hot off the presses and in the mail it is, but for those who are NRPLUS members (You’re not? Well, subscribe right now, right here), the full contents of the big, new issue of National Review — which includes our special annual focus on energy — are available to read and enjoy, from The Week at the get-go to the last-page “Happy Warrior” (where Kyle Smith dreams about dad-based superheroes), and so much excellence in between. Such as: Douglas Murray’s cover essay on the Brexit Knot, which finds itself in the company of two great profiles. First: John McCormack grabs a beer with Senator Ben Sasse, facing reelection amidst the GOP’s identity crisis. Second: Charlie Cooke visits Justice Neil Gorsuch’s SCOTUS chambers to talk originalism and the Constitution. And then there is Jay Nordlinger’s deep dive with Ryan Crocker into America’s shifting Afghan policy. Meanwhile, the special energy section kicks off with Mario Loyola’s analysis of America’s shale-gas revolution, and the political forces determined to squash it, and also includes a look at the troubling state of the country’s electrical grid by Mark Mills.\n\nAdvertisement\n\nAdvertisement\n\nBut wait, there’s more: Kat Timpf checks in (it’s her first big NR magazine piece) about the defiance of stand-up comedian Dave Chapelle in the era of Woke Warriors.\n\nAdvertisement\n\nRemember, even non-NRPLUS subscribers are permitted to read a handful of magazine pieces, so enjoy what you can. But really, do subscribe.", "description": "Read all about energy, Justice Neil Gorsuch, and Brexit, here, now!", "authors": ["Jack Fowler", "Kevin D. Williamson", "David French", "John Mccormack", "Jim Geraghty", "Victor Davis Hanson", "Rich Lowry", "Jonah Goldberg", "A. G. Hamilton", "Madeleine Kearns"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/Issue-Alert-Sep-Something.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-11"}