{"pub": "yahoo", "url": "https://finance.yahoo.com/news/whatever-future-holds-stocks-not-110001623.html", "downloaded_at": "2019-10-06 12:27:46.132952+00:00", "title": "Whatever the Future Holds, Stocks Are Not Priced for a Recession", "language": "en", "text": "(Bloomberg) -- Nobody has a good record predicting the U.S. economy, not pundits and certainly not stock investors. And while a recession has been incorrectly forecast practically every day of the current bull market, when one finally comes it’s going to hurt.\n\nTen years of gains have fattened price-earnings ratios in U.S. stock benchmarks. Based on profits already booked, the S&P 500 currently trades at about 19.4 times income, while the Nasdaq 100 fetches 24.4 times. Those ratios arguably make sense during an expansion, especially when interest rates are so low. Should growth seize up, as it has shown signs of doing lately, look out.\n\n“Large-cap valuations are high, not in bubble territory, but if we do stumble into recession over the next year, which I think is likely, I think we’ll see below 2,000s on the S&P,” said Doug Ramsey, chief investment officer of Leuthold Weeden Capital Management. “It’s very easy to get there. We don’t need to assume that you go back to old bear market lows.”\n\nExtreme view? Yes. A decline like that would be 50% worse than the crash that landed on stocks a year ago. But outcomes like the one envisioned by Ramsey are why making odds on a recession can be the only calculation that matters for equity investors, who tend to enjoy gains as long as the economy isn’t contracting.\n\nTo get a sense of just how far stocks could fall, Leuthold plotted previous S&P 500 valuation troughs versus peaks using GAAP earnings per share. (In those terms, the S&P 500 now trades within the top 10% of readings.) At the bottom of 12 bear markets over the past 70 years, the multiple has spanned 5.6 to 14.4, the latter following the dot-com burst.\n\nEven in a scenario where the multiple fell enough to correspond with the least-bad low in that study, it would take the S&P 500 just below 2,000, according to Ramsey. With the benchmark trading near 2,950 now, that’s a 32% plummet.\n\nAfter a barrage of weak economic data prints this week, more investors are questioning the health of the U.S. economy. First came the worst ISM manufacturing reading in a decade, followed by hints of a slowing labor market and a drop in services data to a three-year low.\n\nThe S&P 500 dropped 1% for two straight days, and was on its way to a third loss of that amount Thursday before staging a rebound. After a forceful rally to end the week, the benchmark ended the 5-day period down less than half a percentage point, and only 2.4% off record highs. If the latest data is any warning of what’s to come, though, equity markets look way too expensive.\n\nA Fed Bank of New York measure currently puts the odds of a U.S. recession over the next 12 months near 40%, the highest level of the bull market. Still, strategists and economists alike largely agree that any economic downturn won’t be nearly as bad as the financial crisis. Plus, lower interest rates mean stock valuations could remain relatively higher.\n\nAt New York Life Investments, a $578 billion money manager, strategists have been discussing the possibility that long-term averages for price-earnings multiples could actually be in the range of 24 to 25, rather than 16 to 17. In data going back to 1969, the average multiple for the S&P 500 stands at 16.8.\n\n“We don’t expect -- and many of our portfolio managers across asset classes -- don’t expect a sustainable rebound in interest rates for some time,” Lauren Goodwin, an economist and multi-asset portfolio strategist at the firm, said in an interview at Bloomberg’s New York headquarters. “There’s some ‘there, there’ in terms of what does average valuation look like?”\n\nStill, it’s not just price-earnings multiples that a growth slowdown, and potential recession, calls into question. Of course, that would bode poorly for revenue and profit growth, too. Companies in the S&P 500 are projected to grow profits next year by 10%. Investors are already skeptical that double digit earnings growth is attainable, but any slowdown could cast a shadow over any growth.\n\nThe S&P 500 currently trades at around 16.5 times next year’s expected earnings. Should no profit growth materialize though, that same valuation measure would jump above 18.\n\n“Not only do you then have the opportunity for businesses to under-perform those expectations, but you also have the downside surprise and so that’s something that we’re really concerned about,” Goodwin said. “Earnings estimates are too rosy.”\n\n--With assistance from Vildana Hajric and Lu Wang.\n\nTo contact the reporter on this story: Sarah Ponczek in New York at sponczek2@bloomberg.net\n\nTo contact the editors responsible for this story: Jeremy Herron at jherron8@bloomberg.net, Chris Nagi\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Nobody has a good record predicting the U.S. economy, not pundits and certainly not stock investors. And while a recession has been incorrectly forecast practically every day of the current bull market, when one finally comes it’s going to hurt.Ten years of gains have fattened price-earnings", "authors": ["Sarah Ponczek"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Q1hTXXw565yxt1rUnnoxmQ--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/b8d026fd4c4054b9f443a1da5b61f3d5", "published_at": "2019-10-06"}