{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/sep/06/boris-johnson-twilight-zone-police-escort-conservatives", "downloaded_at": "2019-09-07 02:24:06.647718+00:00", "title": "Dazed and confused, Johnson stumbles into the twilight zone with a police escort | Marina Hyde", "language": "en", "text": "Why do people still call it a Tory “split” on Europe? It’s not a split: it’s an episiotomy. The Tory episiotomy on Europe went septic this week as Boris Johnson expelled 21 MPs, including two former chancellors and his hero Winston Churchill’s grandson; lost his own brother in a tale we’ll call Cain and Far More Able; and gave a speech so hallucinatorily bad it whiteyed a policewoman. At the current rate, even Robert Caro will only need a week to write this Johnson biography.\n\nThen again, Johnson might get a majority, and we’ll look back on these as the good old days. More on the prospect of that banter-apocalypse later.\n\nFor now, it feels remarkable to think that barely five weeks ago, the vast majority of Tory MPs were telling us Boris Johnson was the only possible answer to various questions. It turns out those questions were: “How would Dudley Dursley and Draco Malfoy’s baby look and behave?”, “What if you shaved the Honey Monster and put him in a suit for a court appearance?” and “Does anyone know the ancient Greek for shitting the bed?”.\n\nApart from looking like he cuts his hair with the bacon scissors, the PM’s shtick is bizarre and juddering, as though some of his innards are trying to escape\n\nDespite practising since boyhood, Boris Johnson’s entire demeanour is that of a man who has won a competition to lead the country for a day. He is Mike Bassett: England Prime Minister, yet wheels out jokes he’s done 437 times before as though he’s Frank Sinatra and reckons the crowd can’t wait to see him do My Way again. Johnson must be the only performer whose audience spends his gigs screaming: PLEASE, DO YOUR NEW STUFF.\n\nPhysically, he seems in a remarkable state. Apart from looking like he cuts his hair with the bacon scissors, the PM’s shtick is bizarre and juddering, as though some of his innards are trying to escape. Perhaps they have found the tension between the bodily functions they are required to provide and the national interest unresolvable.\n\nOratorically, his PMQs debut merits a mere five-word review: “Welcome to the Commons, bitch.” As a dispatch box artiste, Johnson has all the accomplishment of one of those pisshead chancers who go house to house at 10pm in December and “carol sing” for pub money. His delivery was that of a man finding out in real time that material which slayed at the accountancy corporate he did in 2007 is less well received by those who haven’t drunk themselves to within an hour of renal failure. That is as much as 30% of the House of Commons. I’d give it a fortnight before Theresa May is waving an ironic “WENGER IN” banner behind him.\n\nAs for his turns away from Westminster, Thursday afternoon found him at a Yorkshire police academy, where he appeared deeply confused. He resembled a political Elvis – twilight years – who’d had to be slapped awake on the tour bus by his manager, given some of his special medicine, and shoved on to greet the LA crowd with the words “Hello Philadelphia!” This, but in Wakefield.\n\nHaving very belatedly taken the stage, Johnson proceeded to die on his arse in front of rows of police officers. Does this technically count as a death in custody? Certainly, it bore all the hallmarks of such an event, of which there have been 1,718 since 1990, with not a single conviction for murder or manslaughter. Which is to say: it was brutal and disturbing, it happened right in front of multiple police pretending not to notice, and the victim was officially concluded to have done it to himself. (Thank you in advance to the Police Federation for their forthcoming letters on this paragraph. I’ll make time to to read them when I retire at 50 after three years on the sick.)\n\nThere is much discussion about what really “cut through” this week, with Johnson’s greatest shits collection set against such viral delights as a factual yet simultaneously car-crash delineation of Labour’s Brexit policy by Emily Thornberry on Question Time. It is quite something to be got the better of by fellow panellist Richard Tice, a sort of radicalised Damart catalogue model, but the shadow foreign secretary managed it.\n\nFacebook Twitter Pinterest ‘Jesus Christ, Nanny: YOU HAD ONE JOB. Teach him some manners, yes? Jacob Rees-Mogg is 50 (FIFTY). Is he even housebroken?’ Photograph: HO/AFP/Getty Images\n\nAs for Jacob Rees-Mogg, the leader of the House of Commons, his insolent frontbench loll-about is still lighting up Facebook. I’m not going to go full ad hominem on Nanny, who was probably only following orders, but I do think the time has come when we all have to ask: has anyone EVER done a worse job and stayed in post longer? She’s still there! Jesus Christ, Nanny: YOU HAD ONE JOB. Teach him some manners, yes? Jacob Rees-Mogg is 50 (FIFTY). Is he even housebroken?\n\nThen again, why expect more from a guy who believes that even incestuously raped minors should be forced to give birth, at the same time as his investment fund profits from the sale of abortion pills? Asked about this hypocrisy once, Rees-Mogg declared airily: “The world is not always what you want it to be.” You’re telling me, mate. Very much ditto. With the world as it is, we have to tolerate the spectacle of the chancellor of the Duchy of Gilead spreading his loins all over the frontbench and comparing an NHS doctor who co-wrote official no-deal contingency plans to disgraced anti-vaxxer Andrew Wakefield. This last piece of utter yobbery saw Jacob humiliatingly ordered to apologise, presumably by Dominic Cummings (a man widely believed not to have completed the Norland Nanny training course).\n\nPerhaps it was terror of Cummings, then, that prevented Johnson from giving in to either basic human or political instinct, and assisting the faint policewoman in Wakefield. The PM chose instead to gibber out the last of his prepared lines, and the bulletins duly led with his claim that he’d “rather be dead in a ditch” than delay Brexit.\n\nBumbling Boris's speech at police academy was classic Dom | John Crace Read more\n\nAs for who would find his remains, it increasingly feels like a case for Brad Pitt and Morgan Freeman, the pair of cops in Se7en, a movie in which various people are ritually deadly sinned to death. A man of many uncontrollable appetites, Boris Johnson has embodied each of the sins at points in his life, and this week it almost felt as if he was being strapped in like the glutton and forced to prime minister himself to death. Had enough prime ministering yet, dear? I think you can fit just a bit more prime ministering in, and a bit more, and a bit more, and … [Cut to shot of Pitt and Freeman battering down the door of No 10 and choking into their handkerchiefs].\n\nAnyway, you get the idea with that one. I guess the major philosophical question facing some of us this week was: would it all be worth it? Would you take three years of political paralysis, a toxic public realm, bitter family rows and no prospect of even medium-term national healing just to watch this one absolute monster reap his own whirlwind, live on telly, in a horrifyingly hilarious cautionary tale about getting everything you always wanted? The answer, of course, is no. Not even close. And he might still get a majority.\n\nHaving said all that … you’ve got to get your kicks somehow in these dark times, and if you can’t enjoy a good binfire, what’s really left? So chuck another chair leg on the flames, take your warmth where you can, and try to get some rest before he takes a crack at next week.\n\n• Marina Hyde is a Guardian columnist", "description": "Was it only five weeks ago that Conservatives believed the prime minister was the only possible answer to their problems, asks Guardian columnist Marina Hyde", "authors": ["Marina Hyde"], "top_image": "https://i.guim.co.uk/img/media/c16f2ff9922289d9ef1128e386e31b9c9c503ca3/0_250_4012_2407/master/4012.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=ed4228a968587608f9c8d012b852b39f", "published_at": "2019-09-06"}