{"pub": "fox", "url": "https://foxnews.com/world/isis-target-believed-to-be-abu-bakr-al-baghdadi-is-killed-in-syria-sources", "downloaded_at": "2019-10-27 04:00:28.525195+00:00", "title": "ISIS target believed to be Abu Bakr al-Baghdadi is killed in Syria: sources", "language": "en", "text": "A \"high value ISIS target\" believed to be Abu Bakr al-Baghdadi has been killed by U.S.-led forces in Idlib, Syria, a well-placed military source told Fox News on Saturday night.\n\nThe U.S. military cannot yet confirm the identity of the deceased target.\n\nBut at 9:23 p.m. Saturday, President Trump posted a Twitter message hinting at \"very big\" news.\n\nISIS LEADER CALLS FOR 'CALIPHATE SOLDIERS' TO FREE DETAINEES FROM CAMPS, CONTINUE ATTACKS\n\nSoon after, the White House issued a statement that major news would be announced from the White House at 9 a.m. Sunday.\n\nWHERE IS BAGHDADI? INSIDE THE HUNT FOR THE ELUSIVE ISIS LEADER, THE WORLD'S MOST WANTED MAN\n\nNewsweek reported late Saturday that Baghdadi was killed during a special operations mission that President Trump approved about a week ago.\n\nIn September, an audio recording purportedly by Baghdadi included a call for members of the extremist group to use any means necessary to free Muslims who were being detained \"by Crusaders and their Shiite followers.\"\n\nThe U.S. had reportedly posted a bounty of $25 million for information leading to the capture of Baghdadi.\n\nSome experts had predicted that as time passed and ISIS losses in the Middle East started to mount, it was inevitable that Baghdadi would either be captured or killed.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“Baghdadi is probably moving around a lot to avoid detection,\" Jeffrey Simon, a terrorism expert and founder of the national security consultancy firm Political Risk Assessment Inc., said earlier this year. \"But it will just be a matter of time before he is found.\n\n\"I believe that he is still alive,\" Simon added at the time. \"News of his death would have been hard to keep secret for very long.”\n\nThis is a developing story. Check back for updates. Fox News' Jennifer Griffin and Hollie McKay contributed to this story.", "description": "A \"high value ISIS target\" believed to be Abu Bakr al-Baghdadi has been killed by U.S.-led forces in Idlib, Syria, a well-placed military source told Fox News on Saturday night.", "authors": ["Dom Calicchio"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/BaghdadiTHUMB.jpg", "published_at": "2019-10-27"}