{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/brexit-deal-explained-what-boris-20640851", "downloaded_at": "2019-10-17 14:34:14.537801+00:00", "title": "Brexit deal explained: What Boris Johnson agreed with EU and what happens now", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nBoris Johnson has finally agreed a Brexit deal with the EU.\n\nNow MPs will hold a showdown vote on Saturday to decide whether to approve it.\n\nThe Prime Minister today said the deal was \"excellent\" and \"means the UK leaves whole and entire on October 31\" as 27 EU leaders prepared to back it.\n\nEuropean Commission President Jean-Claude Juncker added he was happy about the deal - even if he was sad about Brexit .\n\nYet Boris Johnson is looking down the barrel of a historic Commons defeat on Saturday afternoon after the DUP and Labour both refused to back the new pact.\n\nSo what does the Withdrawal Agreement actually say and what are the main sticking points?\n\nHere's what you need to know.\n\nWhat has been agreed today?\n\n(Image: REUTERS)\n\nThe deal is based on a new Brexit plan Boris Johnson sent the EU two weeks ago to replace Theresa May's 585-page Withdrawal Agreement.\n\nToday's 64-page draft would keep a transition period which continues EU rules in Britain and payments to Brussels, up to 31 December 2020.\n\nBut it scraps the Irish backstop, an insurance policy designed at preventing a hard border between Northern Ireland the Republic from 1 January 2021.\n\nIn the backstop's place would effectively be 'two borders':\n\nNorthern Ireland and Britain would share a customs territory - forcing customs checks on goods crossing the 310-mile border with the Republic. Northern Ireland and the Republic would share some EU single market rules - forcing checks on manufactured and agricultural products crossing the Irish Sea.\n\nWhat are the main points?\n\nThe deal is incredibly complicated but any opposition will boil down to a few main points. Here are the initial details you need to know about the Brexit deal.\n\nCustoms\n\n(Image: AFP via Getty Images)\n\nNorthern Ireland will stay in the UK customs territory - putting goods north of the 310-mile border under different customs rules to the Republic of Ireland.\n\nA new set of UK tariffs will be paid on goods imported to the UK from the EU.\n\nBut no customs duties will be paid on goods crossing the Irish Sea, from Northern Ireland to the rest of the UK and vice versa.\n\nThat means if the UK strikes a trade deal, say with the US, US goods can be imported into Northern Ireland just as they are onto the British mainland.\n\nBut there's a vital exception - EU customs rules will apply to goods entering Northern Ireland that are deemed \"at risk\" of moving into the EU at a later date.\n\nA set of rules will be drawn up by a \"joint committee\" of EU and UK officials before December 2020 to decide how a product is deemed \"at risk\". Factors will include the nature and value of the goods, the nature of movement and the final destination.\n\nThis will apply to goods whether they're in their original form or not. So if sugar is imported to Belfast, put in a soft drink, then exported to the EU, EU rules apply.\n\nNo EU tariffs would be paid on personal goods carried by travellers across the Irish border - or on exempted goods for immediate consumption. These would include the hauls from some fishing boats. There will be no customs checks on the island of Ireland - they will be done in ports.\n\nSingle market rules\n\n(Image: AFP via Getty Images)\n\nNorthern Ireland will remain aligned to a limited set of EU single market rules - to avoid checks on goods crossing the 310-mile Irish border.\n\nThese are: legislation on goods, sanitary rules for veterinary controls (“SPS rules”), rules on agricultural production/marketing, VAT and excise in respect of goods, and state aid rules.\n\nThis means Northern Ireland will have some different rules to Britain.\n\nAnd there will be single market \"checks and controls\" on the relevant goods when they pass between Northern Ireland (EU rules) and mainland Britain (UK rules).\n\nThe EU says there will be \"border inspection posts\" to make sure the sanitary and phyto-sanitary controls are carried out correctly.\n\nPoliticians in Northern Ireland will get a veto on this system - but it's controversial. Read more below...\n\nDemocratic consent\n\n(Image: Charles McQuillan)\n\nThe Northern Ireland Assembly - known as Stormont - will get a vote every four years on whether to let EU law continue in Northern Ireland.\n\nThe first four-year period begins on 1 January 2021, so the first vote by Stormont will be in late 2024 - in time for it to come into effect on 1 January 2025.\n\nIf Stormont backs EU rules by a simple (50%) majority, the system will continue for four years before another vote.\n\nIf Stormont backs EU rules by 60% or more - with a 'double lock' of 40% of unionists and 40% of nationalists - it will continue for eight years before another vote.\n\nIf Stormont rejects EU rules by a simple majority, they will lapse after two years.\n\nThis sets up a massive showdown with the DUP, because it means EU rules could rule over Northern Ireland despite one side - e.g. unionists - opposing them.\n\nWhat about the rest?\n\n(Image: REUTERS)\n\nMany of the other details are the same as in the original 585-page Withdrawal Agreement that Theresa May agreed in November 2018.\n\nThe previously agreed settlement on citizens' rights after Brexit and Britain's divorce bill stay as they were.\n\nThat also goes for a transition period of 14 months until the end of 2020, which can be extended by one year or two years.\n\nIn the long term, both sides would aim for an \"ambitious free-trade agreement\" after Brexit with no tariffs and unlimited quotas. It comes together with a statement that sides will uphold high standards on environment, climate, workers' rights and other rules.\n\nThere are some other less prominent aspects below.\n\nEU courts\n\nNo10 sources were keen to insist that \"Britain is out of the European court.\"\n\nBut \"Britain\" does not necessarily include Northern Ireland - and the document suggests there will still be some European court involvement for the UK.\n\nThe exact nature of such involvement is unclear but it says: \"The UK may participate in the proceedings before the Court of Justice of the EU in the same way as a member state.\"\n\nContinued access to EU programmes\n\nBritain and the EU will work together to see that the UK can continue to stay part of popular EU programmes like the Erasmus student exchange and Euratom's research programme.\n\nBut Britain's membership of those schemes will be \"subject to conditions\" set by the EU and subject to \"fair and appropriate financial contribution\" - meaning Britain will stay pay into certain EU programmes.\n\nFree trade and regulation\n\nBoth parties have agreed to strike a free trade deal which will \"combine deep regulatory and customs co-operation\".\n\nIn practice, this means that while Britain and the EU will be technically free to set their own rules, both parties recognise that in key areas - including the regulation of medicines, agricultural products and technical definitions - they will likely strike a deal to effectively mirror one another's regulations.\n\nOn key areas such as financial services and fishing, the document says the EU and UK will try and strike deals by July 2020.\n\nBut British fisherman who have long argued that the EU is strangling their industry will find the Political Declaration light on detail - with the document saying that Britain and the EU will establish a \"new agreement on...access to waters and quote shares\".\n\nThe EU and UK will both attempt to recognise on another's financial services regulations as \"equivalent\" - but expect fierce negotiations as both Germany and France see profits to be made in companies relocating after Brexit.\n\nGovernment procurement\n\nIn a blow to many people who believed Brexit would be a chance for the UK to end the practice of EU companies bidding to run UK public services, the Political Declaration declares that any future agreement should provide for \"mutual opportunities\" in one another public procurement markets.\n\nLevel playing field\n\nAs part of the Political Declaration, the EU and UK have agreed to a level of cooperation on regulations, workers rights and market rules which might cheer Labour MPs looking for an opportunity to support the bill.\n\nBut promises that any arrangement will \"prevent distortions of trade and unfair competitive advantages\" will come as bad news to Tories who believe Britain's economic success after Brexit comes from aggressively cutting regulation to undercut the EU and attract global business.\n\nWhat happens now?\n\n(Image: Getty)\n\nOn Thursday and Friday all 28 EU leaders meet for a crunch summit in Brussels. Brexit and the deal are top of the agenda.\n\nDespite recommendations from the top EU chief Donald Tusk to back the deal, it is subject to the approval of the governments of the 27 member states at the summit.\n\nIf passed, it then comes to a vote in Parliament on Saturday ahead of an 11pm deadline - at the same time as a massive march in London for a second referendum.\n\nMPs will either vote on whether to back a deal (if there is one from the EU) or to back no deal (if there isn't).\n\nWill EU leaders back the deal?\n\n(Image: REUTERS)\n\nIt's likely but could be difficult and tortured.\n\nFor some, the big concern will be approving a deal which is maybe doomed once it has to be voted on by MPs.\n\nSo they will be keeping a close on the statements of opposition parties - particularly the DUP, who this morning say they still have concerns about the deal.\n\nFor some EU leaders, like France's Emmanuel Macron, they may try and force a tougher set of demands on Mr Johnson - but it is likely the deal will survive the negotiations.\n\nWill MPs back the deal?\n\n(Image: REUTERS)\n\nMPs will likely vote on the deal in a special sitting of Parliament on Saturday - the first since the Falklands War.\n\nThe government will likely bring the new Withdrawal Agreement and the political declaration that accompanies it before MPs.\n\nBut Boris Johnson has a majority of minus 45 - and that's with the DUP.\n\nAs it stands, even the DUP are likely to vote against as their concerns are not addressed. With them would probably go a relatively small band of Tory Brexiteers.\n\nJeremy Corbyn signalled Labour would vote the deal down, so Mr Johnson can only count on a few backbenchers to make up the numbers.\n\nWith all that opposition the path to winning in the Commons is very unclear.\n\nWhat happens if MPs vote the deal down?\n\n(Image: Jeff J Mitchell)\n\nBoris Johnson needs to get a deal approved by MPs by 11pm on Saturday 19 October.\n\nOtherwise, a law called the Benn Act says he must write to the EU in Brussels requesting a three-month delay to Brexit.\n\nThe government has promised it will obey the law and write that letter.\n\nYet Boris Johnson is also expected to tell EU leaders he doesn't want a delay and has insisted the UK will leave on October 31 anyway - deal or no deal.\n\nCan the EU refuse to delay Brexit?\n\n(Image: AFP/Getty Images)\n\nYes - but the general consensus is they are unlikely to.\n\nThere was brief excitement as European Commission chief Jean-Claude Juncker appeared to rule out any delay.\n\nHe said: \"We have a deal and this deal means that there is no need for any kind of prolongation.\"\n\nBut first of all, it's not his decision - that's down to the 27 EU leaders in the European Council.\n\nAnd secondly, if the deal is voted down then by definition there isn't a deal any more. The circumstances will have changed and the EU (who let's not forget, ruled out extensions before) will look at the situation again.", "description": "Boris Johnson is looking down the barrel of defeat after he secured a final Brexit deal with the EU. Here's what it actually means - and what happens now", "authors": ["Dan Bloom", "Oliver Milne", "Image", "Reuters", "Afp Via Getty Images", "Charles Mcquillan", "Getty", "Jeff J Mitchell", "Afp Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20641943.ece/ALTERNATES/s1200/0_EU-Summit-in-Brussels.jpg", "published_at": "2019-10-17"}