{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/raiders/2019/10/05/nfl-says-raiders-vontaze-burfict-extra-illegal-hit-vs-colts/3879784002", "downloaded_at": "2019-10-05 22:09:40.133927+00:00", "title": "NFL informs Oakland Raiders' Vontaze Burfict of additional illegal hit on Colts receiver", "language": "en", "text": "CLOSE SportsPulse: Chances are if you've been paying attention to Lorenzo's Locks you've been making money. Listen to what he has to say about betting on Week 5. USA TODAY\n\nThe NFL appears to be strengthening its case against Vontaze Burfict.\n\nThe league has already suspended the Oakland Raiders linebacker for the rest of the season following a vicious helmet-to-helmet hit on Indianapolis Colts tight end Jack Doyle that led to his ejection last week. On Friday, the league informed Burfict of another hit on a defenseless receiver during Sunday's game, agent Lamont Smith told ESPN.\n\nThe play itself did not draw a flag and occurred early in the second quarter. Burfict drilled Colts running back Nyheim Hines in the head while quarterback Jacoby Brissett scrambled to the opposite side of the field.\n\nBurfict's appeal will be conducted via teleconference at 2 p.m. Tuesday. Smith informed ESPN that the league will use the additional hit among the complete list of Burfict's offenses in its arguments.\n\nHere’s the other helmet-to-helmet hit that Vontaze Burfict delivered during Sunday’s game: second quarter, 13:24 left, and Burfict launches and blasts Colts’ RB Nyheim Hines away from the play. Later came the hit on Colts’ TE Jack Doyle that got him ejected and suspended. pic.twitter.com/8Dvb7xPZgo — Adam Schefter (@AdamSchefter) October 5, 2019\n\nRaiders coach Jon Gruden and quarterback Derek Carr have both expressed disappointment in the length of the suspension. If it's upheld, the ban will last 12 games, the longest in NFL history for committing on-field transgressions.\n\nBefore 2019 — his first with Oakland — Burfict's longstanding history of erratic and dangerous play brought about two suspensions for illegal hits, totaling six games during the first seven years of his career, all spent with the Cincinnati Bengals.", "description": "Oakland Raiders LB Vontaze Burfict, suspended for rest of the season after illegal hit, learns from NFL that he had another illegal hit vs. Colts.", "authors": ["Chris Bumbaca", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/05/USAT/fbc41242-2d97-47a6-b87d-805915a9c4b4-Burfict_.JPG?crop=4582,2577,x0,y353&width=3200&height=1680&fit=bounds", "published_at": "2019-10-05"}