{"pub": "cbs", "url": "https://cbsnews.com/news/purdue-pharma-bankruptcy-even-with-its-bankruptcy-filing-purdue-pharma-may-not-be-off-hook", "downloaded_at": "2019-09-16 23:14:22.583033+00:00", "title": "Even with its bankruptcy filing, Purdue Pharma may not be off the hook", "language": "en", "text": "OxyContin maker Purdue Pharma and its owners expressed sympathy but not responsibility for the nation's opioid crisis as the company filed for bankruptcy protection late Sunday night, part of a move to settle some 2,600 lawsuits. But the filing might not get the drugmaker or the billionaire Sackler family, its owners, off the legal hook.\n\n\"Like families across America, we have deep compassion for the victims of the opioid crisis,\" Sackler family members said in the statement, which called the settlement plan a \"historic step towards providing critical resources that address a tragic public health situation.\"\n\nThe bankruptcy filing is aimed at settling thousands of lawsuits, mostly filed by state and local governments. Already, a tentative settlement has been reached with about half the states and lawyers representing at least 1,000 local governments. Purdue said the settlement could be worth $10 billion to $12 billion over time and would include at least $3 billion from the Sackler family. The deal also calls for handing the company over to trustees and giving future profits from OxyContin and drugs in development to creditors.\n\nBut some of the states that are holding out made it clear last week that they intend to object to the deal in bankruptcy court and seek to continue their lawsuits against members of the Sackler family in state courts.\n\n\"My office is prepared to hold the Sackers accountable, regardless of whether or not Purdue declares bankruptcy,\" Illinois Attorney General Kwame Raoul said in a statement last week.\n\nTJ Donovan, the attorney general of Vermont, said in a statement that the state wasn't joining in the settlement because the reported value of the deal isn't guaranteed. \"We want to be certain that any benefit is not illusory,\" he said, according to news site VTDigger.com. \"I want to be sure that billionaires can't use bankruptcy court as a vehicle to avoid accountability.\"\n\nWhat happens next\n\nIt will be up to the Robert Drain, the federal bankruptcy judge in White Plains, New York, to sort out what happens now — including whether those state lawsuits against Sackler family members can continue. Even if he stops them, he could consider the claims they raise in his court.\n\nFor Purdue and the Sacklers, the effort revolves around getting more states to agree to the settlement, which could make a settlement more likely.\n\nSackler family could pay billions to settle opioid lawsuits\n\n\"We are hopeful that in time, those parties who are not yet supportive will ultimately shift their focus to the critical resources that the settlement provides to people and problems that need them,\" the families of late company owners Mortimer and Raymond Sackler said in their statement. \"We intend to work constructively with all parties as we try to implement this settlement.\"\n\nThe Sackler fortune\n\nThe Sackler family was listed by Forbes magazine in 2016 as one of the 20 wealthiest in the U.S. In a court filing last week, the New York attorney general's office contended that the family had transferred $1 billion to itself through a Swiss and other hidden bank accounts.\n\nAs some states agreed to the deal last week, others expressed frustration amount of money, saying the family should guarantee more — and that the tentative settlement didn't hold the family or company sufficiently accountable for their roles in causing an opioid crisis that has killed more than 400,000 Americans in the last two decades.\n\nIn court filings, the family and the company have pushed back against accusations that the company played a central role in causing the national crisis by overselling the benefits of its powerful prescription painkillers and downplaying the addiction risk. The company's drugs represent a small fraction of the prescription opioids shipped over the years — and most fatal overdoses have been linked to illegal opioids such as heroin and illicitly made fentanyl.\n\nAdmission of wrongdoing: Not part of deal\n\nSteve Miller, chairman of Purdue's board of directors, said on a conference call with reporters that an admission of wrongdoing is not part of the deal.\n\n\"The alternative is to not settle but instead to resume the litigation,\" he said.\n\nHe said as legal battles linger, the company's costs grow, leaving less for the plaintiffs in lawsuits.\n\n\"The resumption of litigation would rapidly diminish all the resources of the company and would be lose-lose-lose all the way around,\" he said. \"Whatever people might wish for is not on the table now.\"\n\nOne likely result of the company's filing is that it will be removed from the first federal trial over the toll of opioids, scheduled to start October 21 in Cleveland. After a series of smaller settlements, claims remain in place against drugmaker Johnson & Johnson and its subsidiaries along with drug distributors and one pharmacy chain, Walgreens.", "description": "Some states plan to object to a settlement in bankruptcy court and may pursue lawsuits against the Sackler family", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2018/11/07/399a8e89-a4c7-428e-8023-514521e2ac2d/thumbnail/1200x630/7a8016b4d8cb87da45c85921c0537bf2/alaskaap-18151707789316.jpg", "published_at": "2019-09-16"}