{"pub": "news24", "url": "https://channel24.co.za/The-Juice/News/phelo-bala-on-coming-out-living-a-lie-was-not-what-i-wanted-for-my-life-20191016", "downloaded_at": "2019-10-18 03:21:45.782237+00:00", "title": "Phelo Bala on coming out: 'Living a lie was not what I wanted for my life'", "language": "en", "text": "Phelo Bala on coming out: 'Living a lie was not what I wanted for my life' share this\n\nCape Town 0 Musician Phelo Bala has opened up about how difficult it was for him to \"come out\" about his sexuality.\n\nTaking to his Instagram page, Phelo wrote that he had to take many things into consideration that were going to change because of his sexuality, such has his relationships, being treated differently and not getting certain gigs because he is gay.\n\n\"Coming out was never easy,\" he wrote.\n\n\"I’ve had to deal with people viewing me differently, backlash, homophobia, losing business because I now not fit the 'criteria'[sic],\" he added.\n\nHe posted his experience after National Coming Out Day on 11 October. It’s a day that encourages LGBTQI+ people everywhere to stand proud and claim who they are, and thus reclaim their lives and sense of pride.\n\nREAD MORE: Phelo Bala is planning for his 'big day with Moshe Ndiki!\n\nIn his post Phelo pointed out that despite the fears he had about coming out, he’s grateful that he did because now he’s no longer imprisoned or robbing himself of the peace of mind he now enjoys.\n\n\"Living a lie was not what I wanted for my life, especial if I wanted to grow mentally and emotionally. Life is hard enough as it for me to imprison myself and hide who I really am. The upside is that I now have peace. Peace with myself and I focus my energy on those that truly love me because there will always be someone that loves you for YOU! #nationalcomingoutday #mystory #imstillhuman,\" he shared.\n\nPhelo is currently engaged to Uyang’thanda Na? presenter Moshe Ndiki. But when it came to light the pair were dating, Phelo’s brother, Loyiso Bala was dragged after posting a message to his brother that many felt was \"homophobic\".\n\nREAD MORE: Moshe Ndiki and Phelo Bhala are engaged!\n\nLoyiso wished Phelo well on his 28th birthday before adding that he’s in \"no position to judge him but to always point him to Christ who will define Phelo’s life purpose\".\n\nThese sentiments didn’t sit well with many who labelled him homophobic, which he vehemently denied. Speaking to DRUM, the musician said that it was never his intention to hurt people with what he said.\n\n\"I am still in shock over the response and how truly hurt certain people were by the tweet. This was not my intention at all,\" he said.\n\nPhelo and Moshe have not yet announced their wedding date.", "description": "Phelo says even though he had anxiety about coming out, he's found his peace of mind.", "authors": ["Phakamani Mvelashe"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9480/0cb07dd1b3a3464bb1e8f73340b6484f.png", "published_at": "2019-10-16"}