{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/20/civil-rights-group-airline-forced-girl-12-to-remov", "downloaded_at": "2019-09-20 22:48:18.287410+00:00", "title": "Civil rights group: Airline forced girl, 12, to remove hijab", "language": "en", "text": "SAN FRANCISCO (AP) - A Muslim civil rights advocacy group is demanding changes at Air Canada after a 12-year-old U.S. Squash Team player says she was forced to remove her hijab while boarding at San Francisco International Airport.\n\nThe San Francisco Bay Area office of the Council on American-Islamic Relations said in a letter sent Friday that federal and state laws were violated when an Air Canada gate agent demanded that Fatima Abdelrahman remove her religious head covering.\n\nAbdelrahman requested a private area so she could remove her headscarf in private and in the exclusive presence of female Air Canada agents, but the council says airline employees refused.\n\nThe advocacy group is seeking the airline order cultural competency training for employees and policy changes prohibiting discrimination. It wants monetary damages for emotional distress, a formal written apology, and reprimand of employees involved.\n\nAbdelrahman was traveling Aug. 1 to Toronto with her team for an international tournament and had had no issues with TSA’s security screening.\n\n“This experience not only went against Ms. Fatima’s reasonable request to be able to adhere to her religious beliefs but also left her feeling angry and humiliated,” wrote Ammad Rafiqi, a civil rights and legal services coordinator at the CAIR-SFBA.\n\nThe exchange became public when Abdelrahman’s older sister complained about the incident on Twitter.\n\nAir Canada did not respond to an email from The Associated Press seeking comment Friday.\n\nIn its letter, CAIR-SFBA says that an Air Canada customer service manager emailed the Abdelrahman family Aug. 19 to say the airline had updated its boarding policies so agents need not remove religious head coverings in order to conduct identity screenings.\n\nThe response, however, did not address the emotional distress inflicted on Abdelrahman or violations of anti-discrimination laws, the organization said.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A Muslim civil rights advocacy group is demanding changes at Air Canada after a 12-year-old U.S. Squash Team player says she was forced to remove her hijab while boarding at San Francisco International Airport.", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-09-20"}