{"pub": "npr", "title": "Confronting Germany's Past In Oscar-Nominated 'Never Look Away'", "url": "https://npr.org/2019/02/04/691311906/confronting-germanys-past-in-oscar-nominated-never-look-away", "language": "en", "published_at": "2019-02-04", "downloaded_at": "2019-09-02 07:25:01.173986+00:00", "text": "Confronting Germany's Past In Oscar-Nominated 'Never Look Away'\n\nEnlarge this image toggle caption Caleb Deschanel/Courtesy of Sony Pictures Classics Caleb Deschanel/Courtesy of Sony Pictures Classics\n\nFilmmaker Florian Henckel von Donnersmarck's debut film, The Lives of Others, won the Oscar for best foreign language film in 2006, bringing the enduring trauma of Germany's recent history to international attention.\n\nSet in East Berlin before the fall of the Berlin Wall, the film told the story of two artists who are monitored, surveilled and threatened by an East German intelligence officer. It was hailed as a groundbreaking film both abroad and in Germany for its blend of political history and cinematic drama.\n\nThe same themes of artistic freedom and historical trauma run through the director's new film, Never Look Away — which has also been nominated for the foreign language film Academy Award. Drawing on an even larger sweep of Germany's history, from the 1930s to the 1960s, it's a three-hour ode to the power of artists to heal the wounds of history.\n\nVon Donnersmarck based the central character in his film, a painter named Kurt, on the life of Germany's most celebrated postwar artist, Gerhard Richter. As von Donnersmarck explains, Richter's generation of artists helped shape the spirit of a country born from the ashes of total physical and psychological destruction.\n\n\"We cannot trust anything that has been done in the past because look at what the past led to,\" von Donnersmarck says. \"It led to this Nazi catastrophe. It led to human beings killing other human beings on a scale hitherto unimaginable. Let us not trust anything that comes from the past. Let us look at completely within and let us build a new, free art.\"\n\nIt was a period of innovation and inspiration that deeply inspired the filmmaker, who says he wanted to pay tribute to the artists who helped rebuild \"the country and the German psyche.\"\n\nThe movie opens in 1937 during the real-life Nazi-sponsored exhibition of \"degenerate art.\" Kurt's beloved aunt brings him to the exhibition, encouraging him to see what he is not supposed to see. She wants him to always think for himself — to never look away.\n\n\"It's an important sentence, and it accompanies our protagonist, the artist, through his whole life,\" von Donnersmarck says. \"And I think it's a very important thing to remember: Don't look toward things that you only find pleasant, you know. Look toward things that are disturbing, also.\"\n\nDarkness follows. Hitler ascends to absolute power. World War II begins. Kurt's aunt is institutionalized for mental illness and executed by the Nazis. Communism closes in. Through it all, Kurt never looks away.\n\nBut the film's lead actor, Tom Schilling, doesn't believe the film is intended to be an abstract and cerebral film about postwar modernism. He says the movie doesn't require a background in art because it's rooted in a universal coming-of-age story.\n\n\"His way of moviemaking is very close to the audience, somehow,\" Schilling says. \"He's able to create those goosebump moments, you know, those larger-than-life cinema moments.\"\n\nThe film's lush widescreen cinematography by Caleb Deschanel has also been nominated for an Oscar, and its soaring and ever present score is by the British composer Max Richter. From the fields of East Germany, the film moves to the lecture halls and studios of West Germany's leading postwar art academy in Duesseldorf, filled with scenes of how Kurt finds his tribe of artists, falls in love and eventually confronts his family's trauma on canvas.\n\nEnlarge this image toggle caption Caleb Deschanel/Courtesy of Sony Pictures Classics Caleb Deschanel/Courtesy of Sony Pictures Classics\n\nActor Sebastian Koch, who also starred in The Lives of Others, plays Kurt's stern father-in-law, a gynecologist with a dark past as a murderous SS officer. He says von Donnersmarck's filmmaking is a welcome reprieve from traditionally austere and detached German films.\n\n\"In Germany we are not very emotional, so it's always like everything is explained,\" Koch says. \"The screen has the opportunity to hide things and to explain it in a different way. And Florian — he just has no fear about emotions. He uses the screen to transport these deep emotions, and that's quite rare in Germany.\"\n\nJournalist and translator Anna Altman wrote about Never Look Away for The New Republic following the film's German release last year. She explains that the film follows in a storied postwar cultural tradition known as Vergangenheitsbewaltigung.\n\n\"It's a word that means grappling with the past as it relates to the World War II period,\" Altman says. \"There's a very clear drive in Germany to talk about the stories of the past and to tease out the particulars of what happened and also to be willing to say that as a country they'd erred and failed — and done much worse than failed — and it's something that has to be expressed to move beyond it.\"\n\nBut the complexity of that kind of historical reckoning and expression is precisely why many German critics have taken issue with Never Look Away. Berlin-based film critic and radio host Patrick Wellinski says many of his colleagues felt the film oversimplified and Hollywood-ized too many nuances of political history for cinematic value.\n\n\"German audiences and critics are more sensitive if it comes to these historical topics, and they should be,\" Wellinski says.\n\nOne dramatic montage sequence in particular stirred debate across German newspapers.\n\n\"It's the moment where he enters a morally aesthetic taboo for German critics,\" Wellinski says. \"He goes into the gas chamber with his camera. And he shows, in a parallel montage, the bombing of Dresden. And there is a question of the victim status. You can't say that a falling Wehrmacht soldier has the same victim status [as] a woman who goes into the gas chamber. And he puts all of this with ... Handel music, which is really disgusting.\"\n\nWellinski, who definitely did not like the film, notes that Richter has also publicly distanced himself from it.\n\nEnlarge this image toggle caption Bilal Qureshi/NPR Bilal Qureshi/NPR\n\nBut von Donnersmarck, who both wrote and directed the movie, says he welcomes the debate because he believes audiences must confront the lessons of history, no matter how painful and messy those conversations may be.\n\n\"When I see big mistakes happening in society, especially in politics, I often think there should be such a thing as an obligatory history exam for anybody who wants to run for public office so that we are really sure that they've occupied themselves with the mistakes of the past so as not to be condemned to repeat them,\" von Donnersmarck says.\n\nVon Donnersmarck says above all, with Never Look Away he wants to remind audiences why art still matters and how it can heal the most painful wounds.\n\n\"Art shows you — any form of creative expression shows you — that every little last thing you did in your life, whether it be because of your own weakness or frailty or because of things people did to you or because of ever feeling lost or lonely or whatever it is: All those things are absolutely necessary for the creation and expression that you have found,\" von Donnersmarck says.\n\n\"If we really accept the hurt that's happened to us, it will be our greatest treasure,\" he adds.\n\nTom Cole edited this story for broadcast.", "description": "Florian Henckel von Donnersmarck's newest historical epic tells the story of an artist after World War II. It touches on the sensitive subject of national guilt — and not without controversy.", "authors": ["Bilal Qureshi"], "top_image": "https://media.npr.org/assets/img/2019/02/04/nla9_wide-77a92fd5df2d2e9ae1d5cbb7aa68443ac6798631.jpg?s=1400"}