{"pub": "reuters", "url": "https://reuters.com/article/us-climate-change-thunberg/teen-climate-activist-to-urge-climate-action-on-capitol-hill-idUSKBN1W2178", "downloaded_at": "2019-09-17 23:27:25.997120+00:00", "title": "Swedish climate activist Thunberg asks U.S. Congress for action, not praise", "language": "en", "text": "WASHINGTON (Reuters) - Swedish teenage climate change activist Greta Thunberg on Tuesday called for action, not praise, from U.S. lawmakers as she joined other youth leaders in kicking off two days of meetings and speeches on Washington’s Capitol Hill.\n\nSwedish 16-year-old youth climate activist Greta Thunber sits on the side amongst other youth climate activists at a news conference about the Green New Deal hosted by U.S. Senator Ed Markey (D-MA) on the Northeast lawn in front of the U.S. Capitol in Washington, U.S., September 17, 2019. REUTERS/Sarah Silbiger\n\nThis week’s events are intended to raise awareness ahead of a global “climate strike” on Friday, when students and workers around the world are being encouraged to walk out of schools and jobs to demand action on global warming and pressure leaders due to attend the annual United Nations summit later this month.\n\n“Please save your praise. We don’t want it,” Thunberg told the Senate Climate Change Task Force. “Don’t invite us here to tell us how inspiring we are without doing anything about it because it doesn’t lead to anything.”\n\nThe 16-year-old has inspired millions of students and others to join her weekly strikes to demand action to fight climate change - dubbed “Fridays for Future.” She has been nominated for a Nobel Prize.\n\nDemocratic Senator Ed Markey, chairman of the task force, called the growing number of young protesters the new “X-Factor” in politics, and said their passion could play a significant role in next year’s U.S. presidential elections.\n\n“2020 is going to be a referendum on climate change,” Markey told a news conference on Tuesday. “It will be a referendum between Donald Trump and a whole new Green New Deal direction.”\n\nThe Green New Deal is a non-binding congressional resolution Markey co-sponsored with Representative Alexandria Ocasio-Cortez, a fellow Democrat, that aims to transform the U.S. economy away from fossil fuels within a decade.\n\nRepublican lawmakers and Trump administration officials have pilloried the plan as fantasy.\n\nPresident Trump, one of the few world leaders who openly question the science of climate change, has made a priority of rolling back Obama-era climate protections he says are not necessary and hurt the U.S. economy.\n\nAnaiah Thomas, a 17-year-old climate activist and member of U.S.-based youth movement Zero Hour, told the senators they need to take an urgent approach to climate change and support proposals like the Green New Deal.\n\n“What’s most important is to decide to take action today. Not in five years. Not gradually. Not tomorrow,” she said.", "description": "Swedish teenage climate change activist Greta Thunberg on Tuesday called for action, not praise, from U.S. lawmakers as she joined other youth leaders in kicking off two days of meetings and speeches on Washington's Capitol Hill.", "authors": ["Valerie", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190917&t=2&i=1430945749&w=1200&r=LYNXMPEF8G1LL", "published_at": "2019-09-17"}