{"pub": "yahoo", "url": "https://finance.yahoo.com/news/worth-buying-fs-bancorp-inc-132622949.html", "downloaded_at": "2019-10-22 13:41:51.520126+00:00", "title": "Is It Worth Buying FS Bancorp, Inc. (NASDAQ:FSBW) For Its 1.5% Dividend Yield?", "language": "en", "text": "Could FS Bancorp, Inc. (NASDAQ:FSBW) be an attractive dividend share to own for the long haul? Investors are often drawn to strong companies with the idea of reinvesting the dividends. Yet sometimes, investors buy a stock for its dividend and lose money because the share price falls by more than they earned in dividend payments.\n\nWith a 1.5% yield and a six-year payment history, investors probably think FS Bancorp looks like a reliable dividend stock. While the yield may not look too great, the relatively long payment history is interesting. The company also bought back stock during the year, equivalent to approximately 0.6% of the company's market capitalisation at the time. There are a few simple ways to reduce the risks of buying FS Bancorp for its dividend, and we'll go through these below.\n\nClick the interactive chart for our full dividend analysis\n\nNasdaqCM:FSBW Historical Dividend Yield, October 21st 2019 More\n\nPayout ratios\n\nCompanies (usually) pay dividends out of their earnings. If a company is paying more than it earns, the dividend might have to be cut. So we need to form a view on if a company's dividend is sustainable, relative to its net profit after tax. Looking at the data, we can see that 9.4% of FS Bancorp's profits were paid out as dividends in the last 12 months. With a low payout ratio, it looks like the dividend is comprehensively covered by earnings.\n\nWe update our data on FS Bancorp every 24 hours, so you can always get our latest analysis of its financial health, here.\n\nDividend Volatility\n\nFrom the perspective of an income investor who wants to earn dividends for many years, there is not much point buying a stock if its dividend is regularly cut or is not reliable. Looking at the data, we can see that FS Bancorp has been paying a dividend for the past six years. The company has been paying a stable dividend for a while now, which is great. However we'd prefer to see consistency for a few more years before giving it our full seal of approval. During the past six-year period, the first annual payment was US$0.20 in 2013, compared to US$0.80 last year. This works out to be a compound annual growth rate (CAGR) of approximately 26% a year over that time.\n\nThe dividend has been growing pretty quickly, which could be enough to get us interested even though the dividend history is relatively short. Further research may be warranted.\n\nDividend Growth Potential\n\nWhile dividend payments have been relatively reliable, it would also be nice if earnings per share (EPS) were growing, as this is essential to maintaining the dividend's purchasing power over the long term. It's good to see FS Bancorp has been growing its earnings per share at 37% a year over the past five years. The company is only paying out a fraction of its earnings as dividends, and in the past been able to use the retained earnings to grow its profits rapidly - an ideal combination.\n\nConclusion\n\nTo summarise, shareholders should always check that FS Bancorp's dividends are affordable, that its dividend payments are relatively stable, and that it has decent prospects for growing its earnings and dividend. Firstly, we like that FS Bancorp has a low and conservative payout ratio. We were also glad to see it growing earnings, although its dividend history is not as long as we'd like. FS Bancorp has a credible record on several fronts, but falls slightly short of our standards for a dividend stock.\n\nStory continues", "description": "Could FS Bancorp, Inc. (NASDAQ:FSBW) be an attractive dividend share to own for the long haul? Investors are often...", "authors": ["Simply Wall St"], "top_image": "https://s.yimg.com/uu/api/res/1.2/O9ibwsFmYhn9sLZDNEaJiQ--~B/aD00MzI7dz0xMTk0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/simply_wall_st__316/2bc72d63e76bc07fe11b54f5fa8af7db", "published_at": "2019-10-21"}