{"pub": "foxbusiness", "url": "https://foxbusiness.com/technology/facebook-wont-pay-all-publishers-when-its-rolls-out-news-tab", "downloaded_at": "2019-10-01 00:08:33.427311+00:00", "title": "Facebook won’t pay all publishers when it rolls out News tab", "language": "en", "text": "Some publishers won’t get paid when Facebook launches its news section next month.\n\nContinue Reading Below\n\nThe social media giant will pay about a quarter of news organizations whose reports are featured in its news section, The Wall Street Journal reported Monday.\n\nFacebook’s news section on its mobile app will include stories from around 200 publications, though it never planned to pay all the news outlets it intended on linking too, a source familiar with the matter told WSJ.\n\n\"The number of publishers included in the news tab will grow over time,\" a Mari Melguizo, a Facebook spokesperson, said in a prepared statement. \"To ensure we’re including a range of topic areas, we’ll start by paying a subset of publishers who can provide a steady volume of fact-based and original content.”\n\nFacebook is offering three-year deals and licensing fees for as much as $3 million a year for national news outlets, and several hundred thousand dollars for the regional publications it features. It’s reportedly in talks to include news from The Wall Street Journal’s parent company Dow Jones & Co., the Washington Post, the New York Times, Business Insider, HuffPost, BuzzFeed and the Philadelphia Inquirer.\n\nUsers can expect a more customizable news feed with content targeted at people individually. The section will be curated by people in conjunction with an algorithm.\n\n\"We are building a new surface for news that will give more visibility to the journalism of news publishers,\" Facebook wrote in a job posting. \"We’re looking for experienced journalists to help identify the top stories from news organizations.\n\nhas struggled with how to provide news to its users, according to Variety. The company laid human news curators after facing bias allegations in 2016, and the company shut down a list of trending topics two years later. Facebook also moved to deemphasize news in its news feed in 2018 to steer users away from sharing viral clickbait — a measure that resulted in a 20% drop of news content shown to its users, according to reports in Variety.\n\nTech giants like Facebook and Google have faced pressure amid antitrust probes by law-enforcement last week investigating competitive activity in technology markets.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nIn July, the FTC approved a $5 billion fine against the social media company over how it handled users’ personal information.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Facebook will reportedly pay about a quarter of news organizations whose content is featured in its news section.", "authors": ["Jeanette Settembre"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/07/0/0/554186-everything-you-missed-at-facebook-f8.jpg?ve=1&tl=1", "published_at": "2019-09-30"}