{"pub": "cbs", "url": "https://cbsnews.com/news/lewandowski-uses-congressional-testimony-to-praise-trump-ahead-of-possible-senate-bid", "downloaded_at": "2019-09-18 05:10:42.315200+00:00", "title": "Lewandowski uses congressional testimony to praise Trump ahead of possible Senate bid", "language": "en", "text": "Former Trump campaign manager Corey Lewandowski, who has been mulling a U.S. Senate bid, used his Tuesday testimony on Capitol Hill to praise President Trump.\n\nLewandowski's opening statement criticizing Congress for continuing to investigate the president elicited an immediate response from Mr. Trump, who tweeted that it was \"beautiful.\"\n\nDuring a break in the hearing, Lewandowski tweeted a website for a potential Senate run. However, the link to \"sign up!\" led straight to a photo of Mr. Trump and Lewandowski and nothing else. The site became operational later in the day.\n\nAhead of his testimony, Lewandowski sent out a tweet about defending the president with the hashtag #Senate2020.\n\nLewandowski told CBS News in August that he was \"seriously considering\" running to challenge New Hampshire Democratic Sen. Jeanne Shaheen. Since then, he has been on Fox News and Fox Business over ten times to discuss news of the day and praise the president.\n\nIn August, he flew on Air Force One with Mr. Trump en route to a reelection campaign rally in Ohio. Lewandowski and the president were expected to discuss whether to launch a Senate bid or not. Just a few weeks later at a rally in Manchester, New Hampshire, Mr. Trump indicated he would give his full support to Lewandowski if he decided to jump into the race.\n\n\"He would be fantastic,\" Mr. Trump said of Lewandowski who attended the rally with the president.\n\nLewandowski's testimony in front of the House Judiciary Committee was about his appearance in the Mueller Report. The special counsel's report revealed that the president ordered Lewandowski to tell then-Attorney General Jeff Sessions to limit the scope of the Russia investigation to possible election-meddling only.\n\nThroughout his testimony, Lewandowski defended the president and said Democrats were investigating Mr. Trump because \"they hate the president more than they love the country.\"\n\nLewandowski was Mr. Trump's campaign manager until he was fired in June 2016. He has remained an ally of the president and has bragged about how Mr. Trump's campaign succeeded despite its small staff.\n\nIn his testimony on Tuesday, he said, \"For more than a year, I served as campaign manager to then-candidate Trump in his presidential campaign – where I led a lean and dedicated operation that succeeded in helping him capture the Republican nomination.\"\n\nThere are already two other Republican candidates in the race to unseat Shaheen, but unlike Lewandowski, neither is thought to have a close relationship with Mr. Trump.", "description": "The former Trump campaign manager and possible Senate contender was testifying about his appearance in the Mueller report", "authors": ["Eleanor Watson"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/17/445597fd-5181-445c-b7bb-2dc0456960b3/thumbnail/1200x630g2/4ebe7308e2230789d4be3b60bdba8893/lewandowski-ap-19260635957019.jpg", "published_at": "2019-09-17"}