{"pub": "yahoo", "url": "https://news.yahoo.com/snl-firing-over-racist-jokes-fair-or-overreaction-232530375.html", "downloaded_at": "2019-09-21 00:04:03.299198+00:00", "title": "'SNL' firing over racist jokes: Fair or overreaction?", "language": "en", "text": "“The 360” shows you diverse perspectives on the day’s top stories.\n\nWhat’s happening:\n\n“Saturday Night Live” announced its new cast members and a few days later fired one of them. Shane Gillis was dropped from the lineup after several clips were spread online in which Gillis used racial slurs and made derogatory statements about Asians, Jews, gay people and other groups.\n\nGillis responded to the clips with a statement calling himself “a comedian who pushes boundaries” and said his “intention is never to hurt anyone.” The show announced it was ending its relationship with him in light of what it called his “offensive, hurtful and unacceptable” language.\n\nSince debuting in 1975, “Saturday Night Live” has featured a number of sketches with Asian characters that would be considered offensive by today’s standards — most famously John Belushi’s depiction of a samurai in the show’s early years. “SNL” has also been criticized for a perceived lack of diversity in its cast. One of the hires announced alongside Gillis was Bowen Yang, the show’s first-ever series regular of East Asian descent.\n\nRecently the show has drawn the ire of Republicans for its lampooning of President Trump and his advisers. Hiring Gillis was reportedly part of an effort to improve the show’s standing among conservatives.\n\nWhy there’s debate:\n\nGillis’s firing was sharply criticized by a number of comedians, including former “SNL” cast members. Rob Schneider said Gillis was a victim of “this era of cultural unforgiveness.” David Spade slammed the public’s impulse to “rifle through your past” in search of reasons to get a person fired. Though most agreed that Gillis’s jokes were out of line, some comics argued that the craft of comedy would be crippled if its practitioners had their careers derailed by so-called cancel culture every time they pushed boundaries a bit too far.\n\nGillis also received support from one of the targets of his racist remarks, Democratic presidential candidate Andrew Yang, who said society would benefit from being “more forgiving rather than punitive.”\n\nOthers say Gillis’s comments went far beyond the bounds of what is acceptable and that he deserved to be fired. Actress Sandra Oh, who has hosted “SNL,” tweeted that she was happy with the show’s choice to not “legitimize/give platform 2 purveyors of racist homophobic content.” Railing against cancel culture, some argue, is a diversionary tactic used by people facing legitimate consequences for inappropriate behavior.\n\nWhat’s next\n\nThe controversy doesn’t seem to have hindered Gillis’s plans to pursue a career in comedy. In his first standup set after being fired, Gillis said he’s “fine with the consequences” of his statements, adding, “I’ve been reading every one of my death threats in an Asian accent.” Yang said he and Gillis “will be sitting down together soon.” The 45th season of “Saturday Night Live” premieres Sept. 28.\n\nPerspectives\n\nHe should have kept his job\n\nThe comments should not have cost him his job\n\n“This is just cancel culture. The guy shouldn’t have been fired. It was just a couple things back in his history.” — Jim Jefferies, “Lights Out With David Spade”\n\nFiring Gillis was an overreaction\n\n“Gillis’s bit was pretty awful. He shouldn’t have said what he said. It also wasn’t funny. On the other hand, firing someone is a drastic step, particularly for someone at this stage of his career.” — Kyle Smith, National Review\n\nCancel culture needs to stop\n\n“I’m not really willing to defend Shane Gillis, some of the things that he said. ... I also hate with every fiber of my being this phenomenon where someone is coming to prominence or has a good day and there’s a group of people out there who just go looking for ways to tear that person down and find the worst thing about them and try to get them fired.” — Guy Benson, Fox Nation\n\nThe controversy may end up being good for Gillis’s career\n\n“I’ve seen a lot of people cheering that Gillis isn’t getting this job, they think it’s going to be bad for his career. I really don’t think so. This has potentially given him way more attention than he would have gotten as being kind of just one of the new guys on SNL. ... He could definitely ride this wave of people that see this as PC culture run amok.” — Philip DeFranco, “Philip DeFranco Show”", "description": "\"Saturday Night Live\" fired Shane Gillis after a series of clips surfaced in which he made a number of offensive jokes. Did the show overreact or was it the right choice to part ways with him?", "authors": ["Mike Bebernes"], "top_image": "https://s.yimg.com/uu/api/res/1.2/RQ_wOYNdFbdu8r7MlMC2Qw--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/197220c0-db4f-11e9-9fff-efa611315009", "published_at": "2019-09-20"}