{"pub": "yahoo", "url": "https://finance.yahoo.com/news/forfarmers-n-v-ams-ffarm-043730463.html", "downloaded_at": "2019-10-04 03:11:25.276036+00:00", "title": "ForFarmers N.V. (AMS:FFARM) Investors Should Think About This Before Buying It For Its Dividend", "language": "en", "text": "Is ForFarmers N.V. (AMS:FFARM) a good dividend stock? How can we tell? Dividend paying companies with growing earnings can be highly rewarding in the long term. Yet sometimes, investors buy a stock for its dividend and lose money because the share price falls by more than they earned in dividend payments.\n\nForFarmers yields a solid 4.9%, although it has only been paying for two years. A 4.9% yield does look good. Could the short payment history hint at future dividend growth? When buying stocks for their dividends, you should always run through the checks below, to see if the dividend looks sustainable.\n\nClick the interactive chart for our full dividend analysis\n\nENXTAM:FFARM Historical Dividend Yield, October 2nd 2019 More\n\nPayout ratios\n\nCompanies (usually) pay dividends out of their earnings. If a company is paying more than it earns, the dividend might have to be cut. Comparing dividend payments to a company's net profit after tax is a simple way of reality-checking whether a dividend is sustainable. ForFarmers paid out 87% of its profit as dividends, over the trailing twelve month period. It's paying out most of its earnings, which limits the amount that can be reinvested in the business. This may indicate limited need for further capital within the business, or highlight a commitment to paying a dividend.\n\nWe also measure dividends paid against a company's levered free cash flow, to see if enough cash was generated to cover the dividend. ForFarmers paid out 1241% of its free cash flow last year, which we think is concerning if cash flows do not improve. Paying out such a high percentage of cash flow suggests that the dividend was funded from either cash at bank or by borrowing, neither of which is desirable over the long term. While ForFarmers's dividends were covered by the company's reported profits, free cash flow is somewhat more important, so it's not great to see that the company didn't generate enough cash to pay its dividend. Cash is king, as they say, and were ForFarmers to repeatedly pay dividends that aren't well covered by cashflow, we would consider this a warning sign.\n\nRemember, you can always get a snapshot of ForFarmers's latest financial position, by checking our visualisation of its financial health.\n\nDividend Volatility\n\nFrom the perspective of an income investor who wants to earn dividends for many years, there is not much point buying a stock if its dividend is regularly cut or is not reliable. The dividend has not fluctuated much, but with a relatively short payment history, we can't be sure this is sustainable across a full market cycle. During the past two-year period, the first annual payment was €0.24 in 2017, compared to €0.28 last year. This works out to be a compound annual growth rate (CAGR) of approximately 8.1% a year over that time.\n\nThe dividend has been growing at a reasonable rate, which we like. We're conscious though that one of the best ways to detect a multi-decade consistent dividend-payer, is to watch a company pay dividends for 20 years - a distinction ForFarmers has not achieved yet.\n\nDividend Growth Potential\n\nDividend payments have been consistent over the past few years, but we should always check if earnings per share (EPS) are growing, as this will help maintain the purchasing power of the dividend. ForFarmers has grown its earnings per share at 2.1% per annum over the past five years. There are exceptions, but limited earnings growth and a high payout ratio can signal that a company is struggling to grow. When the rate of return on reinvestment opportunities falls below a certain minimum level, companies often elect to pay a larger dividend instead. This is why many mature companies often have larger dividend yields.\n\nStory continues", "description": "Is ForFarmers N.V. (AMS:FFARM) a good dividend stock? How can we tell? Dividend paying companies with growing earnings...", "authors": ["Simply Wall St"], "top_image": "https://s.yimg.com/uu/api/res/1.2/CA5ViallH43qFzXBbDE9pw--~B/aD00MzI7dz0xMTk0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/simply_wall_st__316/e16931b348a3f0c38cb7ca0703c023b1", "published_at": "2019-10-02"}