{"pub": "abcnews", "url": "https://abcnews.go.com/US/attorney-general-william-barr-calls-facebook-halt-release/story?id=66043667", "downloaded_at": "2019-10-04 02:37:17.654209+00:00", "title": "Attorney General William Barr calls for Facebook to halt release of encrypted messaging program", "language": "en", "text": "Attorney General Bill Barr and officials from the U.K. and Australia have penned a letter to CEO Mark Zuckerberg requesting the company not implement end-to-end encryption on its messaging services, citing concerns regarding threats of child exploitation and terrorism.\n\nInterested in Facebook? Add Facebook as an interest to stay up to date on the latest Facebook news, video, and analysis from ABC News. Add Interest\n\n\"Law abiding citizens have a legitimate expectation that their privacy be protected,\" the letter says, which is co-signed by acting Department of Homeland Security Kevin McAleenan, as well as the U.K. and Australia's home secretaries. \"However, as your March blog post recognized, we must ensure that technology companies protect their users and others affected by their users' online activities.\"\n\nBarr and the other officials write that it's imperative before implementing such a system that Facebook include \"a means for lawful access\" to messages that law enforcement may request in investigations, typically described as a \"back door.\"\n\nThe letter is likely to draw criticism from civil libertarians and privacy advocates who argue that giving the government access to encrypted communications opens the door to abuse and intrusion of personal data and communications.\n\nDenis Charlet/AFP via Getty Images\n\nBut Barr and the others point out that if implemented, this system could take one of the biggest tools law enforcement has to crack down on child exploitation.\n\n\"In 2018, Facebook made 16.8 million reports to the National Center for Missing and Exploited Children -- more than 90% of the 18.4 million total reports that year,\" the letter says. \"Our understanding is that much of this activity, which is critical to protecting children ... will no longer be possible if Facebook implements its proposals as planned.\"\n\nFacebook issued a lengthy statement indicating it has no plans to comply with Barr's request, but is consulting with law enforcement and safety experts.\n\n\"We believe people have the right to have a private conversation online, wherever they are in the world,\" the company wrote. \"As the US and UK governments acknowledge, the CLOUD Act allows for companies to provide available information when they receive valid legal requests and does not require companies to build back doors.\"\n\n\"We respect and support the role law enforcement has in keeping people safe,\" it continued, in part. \"Ahead of our plans to bring more security and privacy to our messaging apps, we are consulting closely with child safety experts, governments and technology companies and devoting new teams and sophisticated technology so we can use all the information available to us to help keep people safe.\"\n\nJosh Edelson/AFP/Getty Images\n\nOn Friday, Barr, along with Deputy Attorney General Jeffrey Rosen and FBI Director Christopher Wray, will deliver remarks at a full-day \"lawful access\" forum at Department of Justice to try and ramp up the public pressure on Facebook. According to a Justice Department official, a representative from Facebook will be in attendance.\n\n\"We strongly oppose government attempts to build backdoors because they would undermine the privacy and security of people everywhere,\" Facebook said in its statement.\n\nThe encryption versus privacy debate is hardly a new one for the Justice Department, with the most notable episode back in 2016, when the FBI obtained a court order to require Apple's assistance in cracking into one of the iPhones the San Bernardino shooting suspects. Apple refused and the FBI eventually found a different way to unlock the phone.\n\nABC News' Mary Kathryn Burke contributed to this report.", "description": "Attorney General Bill Barr and officials from the U.K. and Australia have penned a letter to Facebook CEO Mark Zuckerberg.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Technology/zuckerberg-facebook-security-mo_hpMain_20191003-163441_16x9_992.jpg", "published_at": "2019-10-03"}