{"pub": "americanconservative", "url": "https://theamericanconservative.com/dreher/tommy-curry-university-of-edinburgh-heart-of-whiteness", "downloaded_at": "2019-10-15 02:17:09.595120+00:00", "title": "Curry Into The Heart Of Whiteness", "language": "en", "text": "Oh dear. News from Edinburgh:\n\nEdinburgh University has been accused of racism for hosting an “anti-racism” conference which banned white people from asking questions. The event was called “Resisting Whiteness 2019” and took place Saturday. The group said its mission was to “amplify the voices of people of color” and therefore they would “not be giving the microphone to white people during the Q&As, not because we don’t think white people have anything to offer to the discussion, but because we want to amplify the voices of people of color.” The blurb added, “If you are a white person with a question, please share it with a member of the committee or our speakers after the panel discussion.”\n\nThe reader who sent me that notice says, “Surely this must be a coincidence”:\n\nPhilosophy of race focus for major new appointment One of the US’s foremost experts on the philosophy of race and gender is set to join the University and help establish Edinburgh as a leader in the field. Tommy J. Curry has been appointed as Professor of Philosophy in the School of Philosophy, Psychology and Language Sciences (PPLS).\n\nOh joy. Now Prof. Curry can spend his time telling the pasty Caledonians how wicked they are. You might recall my posts about Curry, who is black, and his history of racist rhetoric (see here, here, and here.) In this post, I quoted at length from a 2007 paper he wrote about a “possible justification for violence against Whiteness.” Here’s Curry:\n\nFanon tells us that there are no innocents in the colonial situation. “Colonialism is not a type of individual relation but the conquest of a national territory and the oppression of a people: that is all.” The colonial context justifies itself to whites in the persecution and criminalization of Blacks, and in this way it knows that it is legitimate and permanent. Every white that participates in the colonial context, as if the tyranny against Blacks is the norm, and acceptable, in so far as it requires no individual action or culpability, is guilty of colonization, and as such is neither innocent nor absolved for being the particular manifestation of the colonial matrix. The possession of a white racial identity is a very real danger for African people insofar as that identity is embraced as the badge of white superiority. In this sense, every white is a concrete threat to the life of an African descended person, either as their executioner or the enforcer of white supremacy. Insofar as “whiteness” is the expectation of privilege, whiteness is also the expectation of those who cannot enjoy those privileges and the maintenance of their deprivation. Violence against whites is a revolt against both the colonial structures of the American context, as well as the rebellion against the individual whites who choose to claim the legacy of that oppression in a white racial identity.\n\nAh. So there are no innocent white people. White people everywhere are “a concrete threat to the life of an African descended person.” Yet amazingly, Prof. Tommy Curry has chosen to go bravely into the Heart Of Whiteness, a Scottish city that is 92 percent white, and only 1.4 percent black,to preach his racialist gospel. He had to do this, he told an interviewer, because of me:\n\nDebates concerning the use of revolutionary violence or the ethics of Black self-defense are common areas of discussion and research in Critical Race Theory and Black Studies. Violence against Black people, Indigenous nations, and immigrant populations has, for centuries, enforced white supremacy and habituated white citizens into accepting anti-Blackness throughout the Western states. To imply that a Black full professor’s research is subject to dismissal by a white blogger is professionally insulting, suggesting that the intellectual productions and research by Black professors do not require specialized knowledge and are merely opinions that can be evaluated and discounted by your everyday white person.\n\nThat’s me: Your Everyday White Person. I am not sufficiently educated to recognize a racist when I see one. You have to have an advanced degree, I guess, to recognize that when Curry advocates racialized violence against whites, he’s not really advocating racialized violence against whites. For the record, Curry was not simply discussing the use of revolutionary violence by black people; that would be perfectly normal in his field. He was advocating for it, on the radio and in the classroom, as activists at A&M documented. My criticism was not criticism of all black academics; it was criticism of him. In a different interview in March, Prof. Curry said that his exodus from America also has to do “the limitations many Black faculty around the country have described over the last several years under Trump.”\n\nRight. Ri-i-i-ght. This guy is a Grievance Grifter par excellence. Anyway, he’s Edinburgh’s problem now. I am reminded of this passage from the UK writer Douglas Murray’s great new book The Madness Of Crowds, which covers, in part, the cultural change that grants department chairmanships in Grievance Studies to activists like T.J. Curry:\n\nIn March 2019 Professor Robin DiAngelo of the University of Washington gave a speech at Boston University. DiAngelo specialises in ‘whiteness studies’ and has written a book, White Fragility. Since DiAngelo is herself white she has to do a certain amount of self-abasement to earn the trust of her audiences. She does so by assuring them that she is aware that just by standing on a stage and speaking she is ‘reinforcing whiteness and the centrality of the white view’. She asks for forgiveness by stating, for instance, that, ‘I’d like to be a little less white, which means a little less oppressive, oblivious, defensive, ignorant and arrogant.’ To her audience in Boston she also explained how white people who see people as individuals rather than by their skin colour are in fact ‘dangerous’. Meaning that it took only half a century for Martin Luther King’s vision to be exactly inverted.\n\nMore Murray:\n\nToday there appears to be a return to a heightened level of rhetoric on race and a great crescendo of claims about racial differences – just when most of us hoped that any such differences might be fading away. Some people in a spirit of resentment, others in a spirit of glee, are jumping up and down on this quietly ticking ground. They can have no idea what lies beneath them.\n\nNo, they don’t.\n\nUPDATE: I can offer you hear a preview of the Reverend Curry’s lectures to the Kirk of the Quivering Progressive Brethren And Sistren scholars of the University of Edinburgh:", "description": "", "authors": ["Rod Dreher"], "top_image": "https://www.theamericanconservative.com/wp-content/uploads/2019/10/GettyImages-AR6270-001.jpg", "published_at": "2019-10-01"}