{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/on-impeachment-trump-supporters-on-facebook-are-outspending-rivals-as-much-as-4-to-1-new-data-suggests/2019/10/02/8396215c-e47a-11e9-a6e8-8759c5c7f608_story.html", "downloaded_at": "2019-10-02 12:46:32.169451+00:00", "published_at": "2019-10-02", "title": "On impeachment, Trump and allies on Facebook are outspending rivals as much as 4 to 1, new data suggests", "language": "en", "text": "Between Sept. 20 and Tuesday morning, Trump allies funneled as much as $3 million into ads opposing impeachment or assailing House Democrats for beginning a formal inquiry, according to data analyzed by Laura Edelson, a researcher at New York University’s Tandon School of Engineering.\n\nAD\n\nThe cascade of money was answered by no more than $703,000 in spending on ads making the case for impeachment, the figures suggest.\n\nAD\n\nEdelson looked at all posts that used the word “impeach” or “impeachment,” which don’t account for the totality of paid messaging on the subject. Yet they offer a snapshot of investments designed to shape how voters understand and interact with the showdown online.\n\nThe differential struck members of both parties as notable. The numbers, digital strategists said, reveal contrasting approaches to Facebook, which is a good barometer for how groups are allocating digital resources more broadly to build voter lists and solicit online donations.\n\nAD\n\nThe social-networking site also offers the parties a platform to deliver a single and unfiltered message to their base at a moment when fewer Americans are getting information from newspapers and television.\n\n“Those numbers are pretty shocking,” said Eric Wilson, a Republican digital strategist. “They indicate that the impeachment messaging is a winner for Republicans, and you’re not getting the same traction for Democrats.”\n\nAD\n\nDemocrats took a different view. Spending on impeachment showed Trump was playing defense, said Tara McGowan, the founder and CEO of Acronym, a liberal group specializing in digital campaigns. But, “if Democrats groups don’t start competing with that spending, and with that share of voice online, we could lose the narrative advantage that we have right now,” she warned.\n\nAD\n\n“There’s a lot of power in driving a consistent, coordinated message, whether that message is true or not,” McGowan added.\n\nThe surge of Facebook spending on impeachment is one of the clearest signs that Trump and his allies see the fight as useful for their financial fortunes, even as public opinion moves against the president on the issue. The Trump campaign and the Republican National Committee said Tuesday they had raised $125 million in the third quarter of the year.\n\nAD\n\nNearly half of Americans support impeaching Trump, two new polls find\n\nThe vast majority of the impeachment messaging sympathetic to the president has been funded by his reelection campaign, which has released ads that accuse Democrats of trying to “steal the election” and urge users to sign up to show their support. These messages are shared not just from Trump’s page but, increasingly, from the page for Vice President Pence as well.\n\nAD\n\nThere has also been significant Facebook spending on impeachment from Trump-aligned lawmakers, as well as outside groups, including pro-Trump media outlets.\n\nThe top Republicans in the Senate and the House, Sen. Mitch McConnell of Kentucky and Rep. Kevin McCarthy of California, have advertised on the topic in the previous 10 days, with McConnell spending as much as $100,000 on ads that include the line the “impeachment of President Trump stops in our conservative Senate.” Their Democratic counterparts, Sen. Charles E. Schumer of New York and Rep. Nancy Pelosi of California, don’t appear to have allocated any resources to amplifying their impeachment messaging on the social-media platform.\n\nAD\n\nAdditional anti-impeachment ads came from businesses trying to monetize the Trump presidency.\n\nAD\n\n“Democrats Filed To Impeach Trump!” read one advertisement from a commercial outfit selling a “limited-edition Trump collection,” including laser-etched thermoses.\n\nThe top Democratic spenders on impeachment during the 11 days pulled from Facebook’s ad archive were two presidential candidates, Sen. Elizabeth Warren of Massachusetts and former hedge fund manager Tom Steyer.\n\nMeanwhile, Need to Impeach, the super PAC founded by Steyer, which has long been a top spender on the issue, released only 10 ads on the platform during the frenetic period that witnessed revelations about the whistleblower complaint, release of the rough transcript of the July 25 phone call between Trump and Ukraine’s president and the decision of House Democrats to move ahead with an impeachment inquiry.\n\nAD\n\nAD\n\nThe full, rough transcript of Trump’s call with Ukraine’s president, annotated\n\nNathaly Arriola, the super PAC’s executive director, said the group has been putting more resources into phone calls and other methods after successfully building a list of sympathetic voters over the past two years. Polling will also test Ukraine-specific messages, she said, as Need to Impeach prepares to launch a $3.1 million ad campaign targeting Republican senators, mostly on television.\n\n“Do I wish that I had unlimited resources? Of course,” Arriola said. “But it took us $70 million to get here, and we’re ready for the fight ahead.”\n\nZac Moffatt, a Republican strategist who steered digital programs for Mitt Romney’s 2012 presidential bid, said the question is where limited resources go and whether they reflect the centrality of digital platforms in modern campaigning.\n\nAD\n\n“Democrats continue to talk a big game on changing their strategies to reflect the lessons of 2016 and yet, time and again when the opportunities present themselves, they come up wanting,” he said.\n\nAD\n\nMost notable, said Edelson, the NYU researcher, is the absence of impeachment ads from former vice president Joe Biden.\n\n“On the Democratic side, the natural respondent here would be Joe Biden,” Edelson said.\n\nIn the controversial phone call with Ukrainian President Volodymyr Zelensky, Trump repeatedly urged Zelensky to investigate Biden and son Hunter Biden, according to the rough transcript released by the White House. The call was part of the whistleblower complaint that is part of the impeachment inquiry.\n\nAD\n\nBut Biden hasn’t fully backed impeachment, saying only that Trump must comply with congressional oversight. And his spending on the platform — a fraction of Trump’s — has advanced ads accusing the president of “trying to cheat his way to reelection” while remaining silent on impeachment.\n\n“Since President Trump’s debunked attacks, there’s been a groundswell of grass-roots support for Vice President Biden because Democrats know Biden is the best candidate to take back the White House and undo the damage that President Trump has done to our democracy,” said Michael Gwin, Biden’s deputy director of rapid response.\n\nAccording to the campaign, the week ending Sept. 30 was one of Biden’s best online fundraising weeks.\n\n“Now that we know Donald Trump is willing to throw every trick in the book at me, it’s never been more important we hit this goal,” Biden said in a fundraising plea this week.", "description": "Republicans are investing heavily in driving a coordinated message on the social media platform.", "authors": ["Isaac Stanley-Becker", "National Political Reporter"], "top_image": "https://www.washingtonpost.com/resizer/vNuPLv0q93jF7sqke4qYDoSSMx0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/52S4G2HETQI6TNAD644ITGMC2I.jpg"}