{"pub": "townhall", "url": "https://bearingarms.com/tom-k/2019/09/09/survey-majority-fear-mass-shooting-community-favors-gun-control", "downloaded_at": "2019-09-10 07:42:58.112943+00:00", "title": "Survey: Most Fear Mass Shooting In Their Community, Favors Gun Control", "language": "en", "text": "Every Bearing Arms reader knows the constitutional arguments against gun control. The plain text of the constitution makes it clear that gun control shouldn’t hold up to legal scrutiny. It does, somehow, but it shouldn’t. We all know why, too.\n\nBut the majority of Americans aren’t worried about those arguments. They accept that gun control is constitutional on some level. For better or worse, those are the people who have to be convinced otherwise. Those are the hearts and minds we have to win.\n\nUnfortunately, those same people are outright terrified that a mass shooting is going to happen in their community.\n\nWith six in 10 worried about a mass shooting in their community, Americans by a 17-point margin express confidence that stricter gun control laws would reduce such incidents, and even more endorse improved mental health monitoring and treatment to that end. Two measures, specifically, remain overwhelmingly popular: Eighty-nine percent in a new ABC News/Washington Post poll support background checks for all gun purchases, including private and gun show sales; and 86 percent back “red flag” laws allowing the police to take guns from individuals found by a judge to be a danger. By a 15-point margin, 56 to 41 percent, the public supports banning the sale of assault weapons. That’s off its recent peak, 62 percent, after the shootings at Marjory Stoneman Douglas High School in Parkland, Florida, last year, but well up from its low, 45 percent in late 2015.\n\nPeople are worried and they’re desperate for a solution.\n\nUnfortunately, the only solutions they’re being fed are coming from the mainstream media. That means all they’re seeing are calls for red flag laws, universal background checks, and assault weapon bans. None of these things would actually stop mass shootings. Even red flag laws, the item that seems most tailored to combat red flag laws, offers little encouragement. There’s only scant evidence, at most, that such measures actually prevent these attacks. Yet this is what the media has peddled to them, so this is what they’ve swallowed.\n\nHowever, there does appear to be good news. In particular, these numbers do seem to be dropping. Support for red flag laws and universal background checks has been higher. Maybe not by much, but this does suggest that people are starting to think a bit more critically about these measures. After all, the Odessa shooter is the only one who might have been thwarted by such a law, and he picked up a gun that was built to be sold “under the radar,” so it’s unlikely that would have changed had universal background checks been the law. Maybe people are starting to recognize this.\n\nWhat needs to happen going forward is that pro-gun activists need to address this. We need to remind people that mass shootings are still fairly rare, even if they do seem to be happening more often. We need to remind them that so-called assault weapons are only used in a paltry number of crimes in the United States. They also need to be reminded that there’s no evidence that universal background checks would stop any mass shooter as 99 percent of them pass background checks.\n\nThen we need to come up with some good, solid alternatives to gun control that can be used to combat potential mass shootings. For example, we know that many of these shooters reportedly also are violent with family members beforehand. Let’s step up efforts to get family members to report these crimes. Then we can stop these people from buying guns in the first place.\n\nThings of that sort.\n\nThat 90 percent don’t care that the phrase “shall not be infringed” is at at the end of the Second Amendment. We need to start giving them arguments that they do care about. To that end, check out this recent episode of Bearing Arms’ Cam & Co. Cam highlights some of the individuals in the 2nd Amendment community who actually are working to offer up ways to address firearm-involved suicides and the calls for “universal background checks” that actually respect the rights of gun owners and are more effective than the tired demands for gun bans, registration, and licensing laws that we hear from gun control activists and the anti-gun media.", "description": "Six in ten Americans are concerned that a mass shooting will happen in their town. An overwhelming percentage also supports gun control.", "authors": ["Tom Knighton", "Author'S Bio", "Tom Knighton Is A Navy Veteran", "A Former Newspaperman", "A Novelist", "A Blogger", "Lifetime Shooter. He Lives With His Family In Southwest Georgia.", "Posted At Am On September"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2017/311/18016275-789f-4124-8e8e-07ab3bdf0bd5.jpg", "published_at": "2019-09-09"}