{"pub": "investing.com", "url": "https://uk.investing.com/news/stock-market-news/weworks-neumann-to-step-down-as-ceo--sources-1969076", "downloaded_at": "2019-09-25 04:58:30.719409+00:00", "title": "WeWork's Neumann surrenders control, CEO role following investor revolt", "language": "en", "text": "© Reuters. FILE PHOTO: Neumann, CEO of WeWork, speaks to guests during the TechCrunch Disrupt event in Manhattan\n\nBy Joshua Franklin and Anirban Sen\n\n(Reuters) - WeWork co-founder Adam Neumann agreed on Tuesday to resign as CEO and give up majority voting control, after SoftBank Group Corp (T: ) and other shareholders turned on him over a plunge in the U.S. office-sharing start-up's estimated valuation.\n\nNeumann's dramatic fall from grace came after WeWork parent We Company postponed its initial public offering last week following push-back from prospective investors in its stock, not just over its widening losses but also over Neumann's unusually firm grip on the company.\n\nThis was a blow for SoftBank, which was hoping for We Company's IPO to bolster its fortunes as it seeks to woo investors for its second giant Vision Fund, totalling $108 billion.\n\nSoftBank invested in We Company at a $47 billion valuation in January. But investor scepticism led to We Company considering earlier this month a potential IPO valuation of as low as $10 billion, Reuters reported.\n\nWe Company had vowed to press ahead with an IPO by the end of the year. But there was little sign that IPO investor sentiment would change, threatening the value of the stakes held not just by outside investors, but by Neumann as well.\n\nWhat was the venture capital world's biggest upset then morphed into one of corporate America's most high-profile boardroom dramas.\n\nSoftBank managed to muster enough opposition to Neumann in a meeting of We Company's seven-member board on Tuesday to convince him to step down. Reuters had reported on Monday that Neumann had engaged in talks about changes to his role.\n\n\"In recent weeks, the scrutiny directed towards me has become a significant distraction, and I have decided that it is in the best interest of the company to step down as chief executive,\" Neumann said in a statement.\n\nArtie Minson, currently chief financial officer of We Company, and Sebastian Gunningham, a vice chairman for the New York-based start-up, will become co-chief executives, the company said. Neumann will stay on the board as non-executive chairman, the company added.\n\nMinson, a former chief financial officer of Time Warner Cable who joined We Company in 2015, will oversee its finance, legal, human resources, real estate and public communications. Gunningham, a former executive at Amazon.com Inc (O: ), Apple Inc (O: ) and Oracle Corp (N: ) who joined We Company last year, will take responsibility for product, design, development, sales, marketing, technology and regional teams.\n\nWe Company is considering slowing its expansion so it burns through less cash and would require less funding in the absence of an IPO in the near team, Reuters reported on Monday. The company is also contemplating laying off staff, according to a person familiar with the deliberations.\n\n\"While we anticipate difficult decisions ahead, each decision will be made with rigorous analysis, always bearing in mind the company's long-term interests and health,\" Minson and Gunningham wrote in an internal company memo seen by Reuters.\n\nNeumann also agreed to reduce the power of his voting shares, losing majority voting control, according to the sources. Each of his shares will now have the same voting rights as three We Company common shares, not the 10 common shares previously, the sources said.\n\nNeumann's shares used to have the same voting power as 20 We Company common shares, before he agreed to reduce his grip slightly earlier this month in an unsuccessful attempt to make the IPO more attractive to investors.\n\nNeumann's wife Rebekah also found herself without a job at We Company as part of the changes, one of the sources said. She was co-chief brand and impact officer.\n\nShe is also the founder and CEO of WeGrow, an elementary school set up by We Company. However, We Company has decided to do away with such ventures that are not core to the WeWork brand, the source added. We Company declined to comment on Rebekah Neumann's role.\n\nWe Company said on Tuesday it was now evaluating the \"optimal timing\" for an IPO.\n\nFIRM GRIP\n\nNeumann, whose net worth is pegged by Forbes at $2.2 billion, developed a cult following among many We Company employees, vowing to \"elevate the world's consciousness\" as he sought to establish WeWork as a brand that transcended office sharing.\n\nWhile his investors were willing to entertain his eccentricities over the decade he led WeWork since its founding in 2010, his free-wheeling ways and party-heavy lifestyle came into focus once he failed to get the company's IPO underway.\n\nDuring the attempts to woo IPO investors this month, Neumann was criticized by corporate governance experts for arrangements that went beyond the typical practice of having majority voting control through special categories of shares.\n\nThese included giving his estate a major say in his replacement as CEO, and tying the voting power of shares to how much he donates to charitable causes.\n\nNeumann had also entered several transactions with We Company, making the company a tenant in some of his properties and charging it rent. He has also secured a $500 million credit line from banks using company stock as collateral.\n\nLATE CONCESSIONS\n\nFollowing criticism by potential investors, Neumann agreed to some concessions without relinquishing majority control. He agreed to give We Company any profit he receives from real estate deals he has reached with the New York-based firm.\n\nThese changes did little to address concerns about the business model for We Company, which rents workspace to clients under short-term contracts, even though it pays rent under long-term leases. This mix of long-term liabilities and short-term revenue raised questions among investors about how the company would weather an economic downturn.\n\nNeumann, 40, is not the first founder of a major start-up to be forced to step down recently. Uber Technologies Inc (N: ) co-founder Travis Kalanick resigned as CEO of the ride-hailing start-up in 2017 after facing a rebellion from his board over a string of scandals, including allegations of enabling a chauvinistic and toxic work culture.\n\nUber replaced Kalanick with an outsider, former Expedia Group Inc (O: ) CEO Dara Khosrowshahi, and completed its IPO in May.", "description": "WeWork's Neumann surrenders control, CEO role following investor revolt", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8N28V_L.jpg", "published_at": "2019-09-25"}