{"pub": "yahoo", "url": "https://finance.yahoo.com/news/5-futuristic-artificial-intelligence-stocks-181129669.html", "downloaded_at": "2019-09-07 02:37:56.379259+00:00", "title": "5 Futuristic Artificial Intelligence Stocks to Buy", "language": "en", "text": "[Editor’s note: “5 Futuristic Artificial Intelligence Stocks to Buy” was previously published in July 2019. It has since been updated to include the most relevant information available.]\n\nBefore we know it, AI will be part of our everyday lives. Market experts say artificial intelligence will lead the next wave of economic growth and productivity for at least the next couple of decades. But many AI stocks have earned a cautious outlook from the Street.\n\nWe all know the up and downsides of stocks like Nvidia (NASDAQ:NVDA), Advanced Micro Devices (NASDAQ:AMD) and Tesla Inc (NASDAQ:TSLA), but their challenges are separate from some other heavily AI-influenced stocks.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nTo find the best investing opportunities in AI right now, we looked for five stocks with a “strong buy” or “moderate buy” consensus rating from the Street’s top analysts. These are analysts with the highest success rate and average return. By limiting the ratings to best-performing analysts, we cut out analysts with poor track records to find recommendations investors can trust.\n\nStocks with “strong buy” ratings are also more likely to have significant upside potential from the current share price.\n\n\n\n\n\nSalesforce (CRM)\n\nWhen cloud computing giant Salesforce.com (NYSE:CRM) launched its Einstein Analytics platform back in 2017, everyone was buzzing. “We have more customer data than ever before and we need AI to turn data into something actionable for the business user,” says CRM exec Arijit Sengupta.\n\nSalesforce wants a slice of the fast-growing AI market. A report by IDC and commissioned by CRM found that AI technologies will create more than 800,000 new jobs and add $1.1 trillion to global GDP by 2021.\n\nCRM also has a very strong outlook from the Street.\n\n\n\n\n\nMicrosoft (MSFT)\n\nMicrosoft (NASDAQ:MSFT) acquired Canadian AI company Maluuba as its primary entrance into the AI fray. Maluuba teaches machines to think and ask questions through deep learning. You may have heard of Maluuba when it made the impossible possible and used AI to beat the notoriously difficult Ms. Pac-Man arcade video game.\n\nMicrosoft CEO Satya Nadella says he wants to “democratize AI” and bring the technology to more industries such as healthcare, education and manufacturing.\n\nAfter taking a bit of a beating at the end of 2018, Microsoft has surpassed its previous highs.\n\n\n\n\n\nAlphabet (GOOGL)\n\nAlphabet Inc (NASDAQ:GOOGL) has made the most AI purchases out of any tech firm, calculated research firm Quid, which shows that GOOG has made 20 AI acquisitions, including predictive analytics platform Kaggle in Q1 2017 alone.\n\nGoogle CEO Sundar Pichai long has spoken about Google’s “AI first” future. At Google’s developer conference, he showed the Google Lens (a camera that can recognize what it sees) and AutoML. AutoML uses neural networks to build better neural networks, essentially creating an AI that can create itself.\n\nGoogle is rife with “buy” ratings and very few sell or hold ratings, and it has meaningful upside.\n\n\n\n\n\nBaidu (BIDU)\n\nChinese internet company Baidu Inc (ADR) (NASDAQ:BIDU), the “Google of China”, has been investing heavily in AI. It thinks artificial intelligence can give it an edge over local rivals Tencent Holdings Ltd. (OTCMKTS:TCEHY) and Alibaba Group Holdings Ltd (NYSE:BABA).\n\nBaidu spent $2.9 billion on R&D in just 2.5 years, with most of this going to AI. The money has funded a 1,700-member research team and four separate research labs. Crucially, Baidu has an AI advantage because of the huge data it gains from its 665 million monthly search engine users.\n\nBIDU is a moderate buy with the trade war dragging on, but it still has impressive upside potential.\n\n\n\n\n\nDelphi Automotive (DLPH)\n\nU.K.-based auto tech company Delphi Automotive (NYSE:DLPH) is on the rise after a tumultuous few months.\n\nDelphi dropped its powertrain business to focus on self-driving cars and electric vehicles last year, which appears to finally be paying off. In partnership with BMW, Intel Corporation (NASDAQ:INTC) and Mobileye NV, Delphi plans to launch self-driving cars by 2021.\n\nWhich stocks have a strong buy rating in the sector that interests you?\n\nTipRanks tracks and ranks over 4,500 analysts from eight different market sectors.\n\nMore From InvestorPlace\n\nThe post 5 Futuristic Artificial Intelligence Stocks to Buy appeared first on InvestorPlace.", "description": "[Editor's note: \"5 Futuristic Artificial Intelligence Stocks to Buy\" was previously published in July 2019. It has since been updated to include the most relevant information available.]Before we know it, AI will be part of our everyday lives. Market experts say artificial intelligence", "authors": ["Harriet Lefton"], "top_image": "https://s.yimg.com/uu/api/res/1.2/zjQJvOoHdKlvrnf6SMfWSg--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/db0578f3bde771a8e84ecb848b44dc73", "published_at": "2019-09-06"}