{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/13/nothing-guaranteed-but-avoiding-0-2-start-big-for-", "downloaded_at": "2019-09-14 01:45:37.024057+00:00", "title": "Nothing guaranteed, but avoiding 0-2 start big for Bucs", "language": "en", "text": "TAMPA, Fla. (AP) - The Tampa Bay Buccaneers have never been very good at defying long odds, so avoiding an 0-2 start to the season was very important for a young team that hasn’t made the playoffs in more than a decade.\n\nWhile the Bucs know first-hand that starting fast doesn’t guarantee anything, however Thursday night’s 20-14 victory at Carolina gave them their first win under coach Bruce Arians and recent history suggests it gives them a far better chance of earning a postseason than if they hadn’t held on to beat the NFC South rival Panthers.\n\n“You always want to get the first one off your back. … A road win in the division is always big. It’s going to help us,” Arians said.\n\nThe Bucs started 2-0 a year ago with an upset of New Orleans on the road and a victory at home against then-defending Super Bowl champion Philadelphia, only to drop 11 of 14 games the rest of the way to miss the playoffs for the 11th consecutive season.\n\nWhile Tampa Bay faded, others who got off to slower starts surged.\n\nTen teams that began 1-1 or 0-2 wound up making the playoffs in 2018, most in the NFL since 2002. Eight of them split their first two games, while Seattle overcame losing its first two and Houston did it from 0-3.\n\nTwo years ago, the Saints were the only team to rebound from 0-2 to make the playoffs. Seven teams did from 1-1.\n\nWHAT’S WORKING\n\nThe Bucs haven’t had a dominant defense since the team’s 2002 Super Bowl run, however they’re off to a nice start in a new system installed by new defensive coordinator Todd Bowles, who worked for Arians in Arizona before landing his first head coaching job with the New York Jets. Through two games, the Tampa Bay defense has only one touchdown - none Thursday night when the unit limited Carolina’s Christian McCaffrey 37 yards rushing on 16 attempts.\n\nWHAT NEEDS HELP\n\nCostly penalties nearly undermined the team for the second straight week. The Bucs had two touchdowns called back because of holding calls during their season-opening loss to San Francisco. Arians nearly did his team in Thursday night, when he drew a flag for calling consecutive timeouts in the final minute with the Panthers driving for a potential go-ahead score. The delay of game penalty turned fourth-and-2 from the Tampa Bay 3 into fourth-and-a half-yard. Cornerback Vernon Hargreaves saved the day, stopping McCaffrey for no gain on a gadget play that left the Panthers answering questions why they took the ball out of Cam Newton’s hands in that situation.\n\nSTOCK UP\n\nLinebacker Shaquil Barrett, primarily a backup with the Denver Broncos before signing with the Bucs in free agency this year, sacked Newton three times and leads the team with four through two games. That’s huge, considering the team’s best pass rusher, Jason Pierre-Paul, is out with a neck injury suffered in an offseason car accident.\n\nArians said Barrett has been all the Bucs expected.\n\n“When we evaluated him (when Barrett was with Denver), whenever he was in, he flashed. He’s a slippery pass rusher but he’s also got power,” Arians said. “So yeah, I think we were hoping that he would give us that, and he’s delivered.”\n\nSTOCK DOWN\n\nTight end O.J. Howard made two costly mistakes in the season opener against the 49ers, losing a fumble that ruined one scoring opportunity and having a pass skip off his hands into the grasp of a defender for an interception. He played extensively against the Panthers, but didn’t have any passes thrown his way and after four catches against San Francisco. He had a sore ankle coming out of the opener, however Arians said the injury had no bearing on Howard being shut out Thursday night.\n\n“No, no,” the coach said. “That’s just the way the game goes.”\n\nINJURED\n\nRookie inside linebacker Devin White suffered a knee injury against Carolina and is day-to-day.\n\n“So far, it looks like a grade-one, medial MCL (sprain). … As strong as he is, I don’t know how much time he’ll miss,” Arians said, adding the first-round draft pick was walking without a brace Friday.\n\nKEY NUMBER\n\n2-of-12. The Bucs’ third-down conversion rate against Carolina, a number that’s going to have to improve dramatically if they’re going to be successful.\n\nNEXT STEPS\n\nPlayers have three days off, returning Tuesday to begin preparation for a home game vs. the New York Giants on Sept. 22.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Tampa Bay Buccaneers have never been very good at defying long odds, so avoiding an 0-2 start to the season was very important for a young team that hasn't made the playoffs in more than a decade.", "authors": ["The Washington Times Http", "Fred Goodall"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/13/buccaneers_panthers_football_92612_c0-157-3755-2346_s1770x1032.jpg?d91839d56dba5ffd2a35a7037f67afb423629f87", "published_at": "2019-09-13"}