{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/stock-market-today-us-indexes-rise-on-fed-cut-expectations-2019-9-1028506274", "downloaded_at": "2019-09-07 02:38:55.024584+00:00", "title": "Stocks rise as traders are reassured the Fed will cut rates in September", "language": "en", "text": "REUTERS/Lucas Jackson\n\nStocks rose on Friday after Federal Reserve Chairman Jerome Powell said during a speech in Zurich that the central will continue to \"act as appropriate\" to support US economic growth.\n\nPowell has repeated the statement several times before, and investors are interpreting it as a sign the Fed will continue to lower borrowing costs this year.\n\nThe August jobs report from the Labor Department showed that US hiring slowed but remained solid last month.\n\nVisit the Markets Insider homepage for more stories.\n\nStocks climbed on Friday after Federal Chairman Jerome Powell reassured investors that the central bank will cut its benchmark interest rate again this year to support economic growth.\n\nPowell said the fed will \"act as appropriate\" to sustain the US expansion while speaking at a forum in Zurich on Friday. The Fed chairman has repeated the same statement during other speeches, and investors are interpreting it as a hint that the central bank will step in to shore up the US economist with rate cuts.\n\nPowell also said the Fed doesn't expect the US to fall into a recession and that low rate are already propping up the economy.\n\n\"The Fed has through the course of the year seen fit to lower the expected path of interest rates,\" he said during his speech. \"That is one of the reasons why the outlook is still a favorable one.\"\n\nMarkets Insider is looking for a panel of millennial investors. If you're active in the markets, CLICK HERE to sign up.\n\nMajor US indexes were relatively flat early in the day after the August jobs report from the US Labor Deparment showed hiring slowed but remained solid last month. The US economy added 130,000 nonfarm payrolls last month, fewer than the 160,000 expected by economists.\n\nHere's a look at the major indexes as of the 4 p.m. close on Wednesday:\n\nShares of Facebook tumbled as much as 2.4% after New York Attorney General Letitia James announced her office is leading a multi-state probe into the social media company. The investigation is expected to focus on the social media company's handling of a consumer data and whether or not its engaged anticompetitive practices.\n\nLululemon's stock price surged 8% after the retailer posted second-quarter results that smashed Wall Street expectations. The company also raised its full-year profit forecast following the strong performance. Mens sales grew 35% from the same period last year, fueling Lululemon's sales and earnings beat.\n\nWithin the S&P 500, these were the largest gainers:\n\nAnd the largest decliners:\n\nMaterials and energy stocks posted the strongest gains within the S&P 500 on Friday, rising 0.52% and 0.48%, respectively. Utilities fell 0.33%, while communications services slipped 0.23%.", "description": "Stocks rose on Friday after Federal Reserve Chairman Jerome Powell said during a speech in Zurich that the central will continue to 'act as appropriate' t...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d72a6872e22af200c463139-2400/2019-06-19t185226z2000987639rc1fbae46d00rtrmadp3usa-fed.jpg", "published_at": "2019-09-07"}