{"pub": "metro", "url": "https://metro.co.uk/2019/10/16/nipsey-hussles-family-gain-custody-10-year-old-daughter-lauren-london-granted-control-sons-estate-10927019", "downloaded_at": "2019-10-16 08:30:12.786061+00:00", "title": "Nipsey Hussle’s family gain custody of 10-year-old daughter", "language": "en", "text": "Nipsey with daughter Emani at the Grammys (Picture: MEGA)\n\nSeven months after he was fatally shot outside his clothing store, the family of rapper Nipsey Hussle has been granted custody of his 10-year-old daughter.\n\nMeanwhile, his partner Lauren London has gained custodianship of the pair’s three-year-old son’s estate.\n\nAccording to reports, a judge this week signed off on Nipsey’s immediate family, including siblings Samantha Smith, Sam Asghedom and another person Angelique Smith, being appointed guardians of his daughter Emani.\n\nThe 10-year-old’s birth mother, Tanisha Foster, had been called ‘unfit’ by Nipsey’s family, according to TMZ.\n\nThere was never a dispute between Lauren and Nipsey’s family, with their young son Kross reportedly set to inherit $1million (£787,000) from his dad’s estate. It’s been claimed Emani will stand to inherit the other half of Nipsey’s fortune.\n\nLauren and Nipsey share a three-year-old son (Picture: Instagram)\n\nLauren, 34, who had been with Nipsey since 2013 but they never married, will be able to be involved in the legal matters of her late partner’s estate on behalf of their son.\n\nAdvertisement\n\nAdvertisement\n\nThe rapper’s brother Sam (AKA Blacc Sam) petitioned in August to oversee his dead brother’s estate, claiming he wanted to make sure his legacy remained intact.\n\n‘[Nipsey’s] passing has created significant media attention, which, in turn has presented potential time-sensitive business opportunities based on [Nipsey Hussle]’s likeness, right of publicity, and other intellectual property based on the media attention surrounding [Nipsey Hussle]’s exceptional life story and musical career,’ he wrote in his filing.\n\nNipsey was shot in March (Picture: Rex Features)\n\nTMZ pointed out Lauren had filed for guardianship back in July, following the 31 March shooting of her partner outside his clothing store in Los Angeles.\n\nThe rapper, real name Ermias Asghedom, was one of three men shot on the 3400 block of West Slauson Avenue, with the victims rushed to a local hospital. Sadly Nipsey, who was 33, died on arrival.\n\nEric Holder, 29, was arrested two days later and charged with murder and is currently awaiting trial.\n\nNipsey rose to fame through his mixtapes, including The Marathon and Crenshaw. The latter, he sold for $100 each, with Jay Z buying 100 copies.\n\nHis debut album Victory Lap – his only full album he would release in his lifetime – was released in February 2018, and was nominated for best rap album at the Grammys this year.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Matt Lucas defends David Walliams against Piers Morgan after brutal ‘sniveling toad’ comment\n\nMORE: Elton John calls The Lion King remake ‘a huge disappointment’: ‘I wasn’t treated with same level of respect’", "description": "Nipsey Hussle’s family gain custody of 10-year-old daughter as Lauren London granted control of their son’s estate.", "authors": ["Mel Evans"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/05/SEI_59333574-e1558425307985_1571211955.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-16"}