{"pub": "nytimes", "url": "https://nytimes.com/2019/10/23/opinion/trump-syria.html", "downloaded_at": "2019-10-23 16:38:24.936190+00:00", "title": "Opinion | It Always Comes Back to Syria", "language": "en", "text": "And then, there was the rise of the Islamic State, and Al Qaeda’s use of the Syrian conflict to rejuvenate its ranks and recruit men and money. Both groups exported horror well beyond Syria’s borders.\n\nThe war shattered Syria into slivers. The Islamic State established a so-called caliphate. It was vanquished by Kurdish-led forces who set up their own version of utopia in the same territory, before they, too, were pushed out this month by Turkey, which was never going to tolerate an armed Kurdish canton on its border. For Ankara, Mr. al-Assad is a safer neighbor than Kurds who dream of autonomy.\n\nOn Thursday, President Recep Tayyip Erdogan of Turkey outfoxed Vice President Mike Pence, who flew to Ankara to give Mr. Erdogan almost everything he wanted: a cessation of hostilities in the northeast (the Americans called it a cease-fire, the Turks a pause) and a Kurdish withdrawal from the area. Turkey appears to have dodged American sanctions and gained approval to keep its troops in northeast Syria. A day later, Mr. Erdogan said he intended to populate the zone with some of the millions of Syrian refugees currently in Turkey, but how voluntary will any returns be? It’s illegal under international law to send refugees back to a country where they may be at risk, but Syria — where chemical weapons have been used repeatedly — is a graveyard for international norms.\n\nTurkey’s assault has unleashed chaos. Many Islamic State members, captured and held in camps by the Kurdish-led Syrian forces, have now escaped, along with suspected affiliates and sympathizers. They will regroup, accelerating a resurgence that has already made its presence felt in parts of Iraq. What do they now have to lose?\n\nFor the Kurdish forces, backed until recently by American power, the loss of clout is especially stinging. Before 2011, hundreds of thousands of Syrian Kurds were denied citizenship in a country that did not allow them to teach their language. Because of Mr. Trump’s greenlighting of the Turkish offensive, Syria’s Kurds in the northeast were forced to cut a deal with Damascus, which, the Syrian deputy foreign minister said last week, views them as “agents of Washington.” Mr. al-Assad’s forces didn’t have to fire a bullet to regain huge swaths of the northeast. Idlib province, in the northwest, is now the only large part of the country that Mr. al-Assad doesn’t control.", "description": "For years, the war there has affected events far beyond the country’s borders. It will happen again.", "authors": ["Rania Abouzeid"], "top_image": "https://static01.nyt.com/images/2019/10/23/opinion/23abouzeid1/23abouzeid1-facebookJumbo.jpg", "published_at": "2019-10-23"}