{"pub": "marketwatch", "url": "https://marketwatch.com/story/powell-says-august-job-report-is-a-sign-of-continued-strength-in-labor-market-2019-09-06", "downloaded_at": "2019-09-07 02:20:44.426733+00:00", "title": "Powell says August job report is sign of continued strength in labor market, doesn’t see a recession", "language": "en", "text": "Bloomberg Fed Chairman Jerome Powell gets last word ahead of the central bank’s Sept. 17-18 interest-rate setting meeting.\n\nFederal Reserve Chairman Jerome Powell said Friday afternoon that the most recent monthly gauge of the U.S. labor market fit into an overall picture of a healthy jobs market and economy.\n\nIn a question-and-answer session in Zurich, Powell said the outlook for the economy remains favorable, describing the future as one likely to reflect continued moderate economic expansion.\n\nPowell said the central bank is “not forecasting or expecting, a recession.”\n\n“Incoming data for the U.S. suggests that the most likely outlook for the U.S. is still moderate growth, a strong labor market, and inflation continuing to move back up,” he said.\n\nRepeating his message from Jackson Hole, Wyo., Powell said there are “significant” downside risks facing the economy and said the Fed is going to monitor all these factors.\n\nRead: Weaker job report in August ‘cements’ a Fed interest-rate cut in two weeks\n\nIn one comment that some watchers could interpret as dovish, or accommodative, Powell said the Fed was worried about inflation getting too low, suggesting that the central bank may act to bolster stubbornly low inflation.\n\nOnce low inflation takes hold “you seem to get on this road that is hard to get off of, and we’re trying not to get on that road and defend our 2% inflation target,” Powell said.\n\nAsked specifically about possible interest-rate cuts, Powell said he only wanted to say that the Fed “would act as appropriate to sustain the expansion.”\n\nPowell is the last public Fed speaker ahead of the Sept. 17-18 interest-rate setting meeting.\n\nWall Street is pricing in a greater than 90% chance that the rate-setting Federal Open Market Committee will trim its benchmark interest rate by a quarter-percentage point following its Sept. 17-18 meeting, according to CME Group data based on federal-funds futures.\n\nStocks traded modestly higher as Powell discussed the state of the global economy and domestic monetary policy, with the U.S. in its 11th year of a history-setting expansion. The S&P 500 index SPX, +0.09% and the Dow Jones Industrial Average DJIA, +0.26% were both up by at least 0.2%.\n\n‘We serve all Americans, regardless of their political party.’ Jerome Powell\n\nPowell said he hasn’t regretted becoming the leader of U.S. central bank, responding to a question that appeared to be a loosely veiled reference to constant attacks the Fed chairman has endured from President Donald Trump who nominated him.\n\nTrump has persistently criticized Powell, saying, as recently as Friday morning that he questioned his decision to pick the 66-year-old former lawyer and private-equity investor. Unlike most Fed chiefs, Powell is not a trained economist. “Where did I find this guy Jerome,” the president said via Twitter.\n\nI agree with @jimcramer, the Fed should lower rates. They were WAY too early to raise, and Way too late to cut - and big dose quantitative tightening didn’t exactly help either. Where did I find this guy Jerome? Oh well, you can’t win them all! — Donald J. Trump (@realDonaldTrump) September 6, 2019\n\nPowell repeated that the Fed makes its decisions in a nonpolitical manner.\n\nWhen asked specifically about a controversial essay by former top Fed official William Dudley, who postulated that the Fed might consider Trump’s reelection prospects when making policy, Powell said Dudley’s idea was “simply wrong.”\n\n“We serve all Americans, regardless of their political party,” he said.", "description": "Fed Chairman Jerome Powell said Friday the August job report was a sign of continued strength in the U.S. labor market", "authors": ["Greg Robb", "Senior Economics Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HO462_powell_ZG_20190731080600.jpg", "published_at": "2019-09-06"}