{"pub": "heritage", "url": "https://heritage.org/terrorism/commentary/after-lull-islamist-terrorism-europe-returns-vengeance", "downloaded_at": "2019-10-10 15:02:56.231994+00:00", "title": "After a Lull, Islamist Terrorism in Europe Returns With a Vengeance", "language": "en", "text": "There’s lots of talk in Washington about the Islamic State and the Trump administration’s Syria policy.\n\nThat’s an important discussion to have, but it’s only one part of the counterterrorism discussion that America has to be engaged in.\n\nConsider events in Europe over the past week. On Oct. 3, an information technology specialist, Michael Harpon, stabbed four of his colleagues to death and injured two others before being fatally shot.\n\nHarpon, who worked at police headquarters in Paris and had a security clearance, was seemingly inspired by the Islamic State, known as ISIS.\n\nHe was a convert to Islam who, ironically, was employed in a department of the police that dealt with the Islamist threat facing France.\n\nHarpon was known to have voiced extremist sentiments, including defending the deadly al-Qaeda raid on the magazine Charlie Hebdo in January 2015, and to have been in contact with radical preachers.\n\nThat naturally prompted questions in France as to why he was employed by the police.\n\nThen, on Monday evening, a Syrian refugee hijacked a truck and plowed it into cars waiting at an intersection in Limburg, in western Germany. He injured eight people in what is being treated by the state as an act of terrorism.\n\nThe perpetrator, who arrived in Germany in 2015, had previously been arrested for a series of non-terrorism crimes.\n\nMuch about those attacks was unsurprising. While the Islamist threat in Europe has—for now—diminished from its 2016-17 peak, plots are still an alarmingly regular occurrence.\n\nResearch by The Heritage Foundation demonstrates that France is the country most commonly targeted by terrorists and, between 2014 and 2018, 16% of Islamist plots in Europe involved asylum-seekers or refugees. Germany was targeted most often in plots involving asylum-seekers or refugees, with Syrians more frequently involved than any other nationality.\n\nTerrorists have been willing to use a variety of different weapons, no matter how unsophisticated. Heritage research has specifically focused on how to stop vehicular attacks, which have been deployed frequently by terrorists and are among the toughest plots to thwart.\n\nThe events of the past week occurred in Europe, but they easily could have been in the U.S., the nation that symbolizes what Islamists loathe most about the West (manmade law, democracy, and individual liberty, for example) and is still the most appealing target.\n\nThere have been well over 100 Islamist plots against the homeland since 9/11. As recently as Aug. 30, a naturalized U.S. citizen originally from Pakistan was charged with planning an ISIS-inspired attack in New York.\n\nThat plot may been a dud, but attacks in recent years—such as those in San Bernardino, California (2015); Orlando, Florida (2016); and New York (2017, twice)—did evade the attention of U.S. counterterrorism authorities.\n\nAdditionally, American civilians have been killed in terrorist attacks overseas. Between 2015 and 2017, nine Americans were killed in terrorist attacks in Belgium, France, and the United Kingdom. Two American cyclists were killed by ISIS-inspired attackers in Tajikistan last year.\n\nSafeguarding American security begins at home, but it certainly does not end there.\n\nThe U.S. cannot be everywhere and fight every war. Furthermore, the U.S. government is right to focus on great-power politics. North Korea, Russia, Iran, and China all require Washington’s attention.\n\nBut that doesn’t mean that the ongoing threat from global Islamist transnational terrorism can go unaddressed. Syria is an obvious concern. But then again, so are Afghanistan, Yemen, and Somalia, while other Islamist movements simmer across Africa, South Asia, and Southeast Asia.\n\nGroups such as ISIS, and all those drawn to its nightmarish ideology, retain a willingness to kill innocents in as large a number as possible. The U.S. government must stand ready to help stop that from happening, both at home and abroad.", "description": "There’s lots of talk in Washington about the Islamic State and the Trump administration’s Syria policy. \n\nThat’s an important discussion to have, but it’s only one part of the counterterrorism discussion that America has to be engaged in.\n\nConsider events in Europe over the past week. On Oct. 3, an information technology specialist, Michael Harpon, stabbed four of his colleagues to death and injured two others before being fatally shot.", "authors": ["Robin Simcox", "Margaret Thatcher Fellow", "Robin Simcox Specializes In Terrorism", "National Security Analysis As The Margaret Thatcher Fellow."], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-10/GettyImages-1173413351.jpg?itok=-FR2jBAC", "published_at": "2019-10-10"}