{"pub": "realclearpolitics", "url": "https://nymag.com/intelligencer/2019/08/climate-at-the-g-7-glimmers-of-a-new-world-order.html", "downloaded_at": "2019-09-04 03:46:12.542054+00:00", "title": "The Glimmer of a Climate New World Order", "language": "en", "published_at": "2019-08-26", "text": "The Amazon fires provoked a promising response at the G-7. Photo: Victor Moriyama/Getty Images\n\nI didn’t know politics could move this fast. It has been barely a week since the world woke up to reports of fires tearing through the Amazon rainforest, and already a new sort of global red line has been established — the first of its kind to be drawn around climate behavior. Led by grandstanding French president Emmanuel Macron, the leaders of the G-7 have essentially told Brazilian president Jair Bolsonaro that the burning of the Amazon simply cannot stand.\n\nBolsonaro is himself a showboat, of course, usually excited by the opportunity to troll the community of globalists and liberal cosmopolitans almost literally embodied in the leaders of the G-7 — and particularly in forums bringing those leaders together as though they are puppet-mastering the rest of the world over a continental breakfast. And yet, over the last few days, Bolsonaro has performed a dramatic about-face, moving from shrugging his shoulders at the fires and blaming them on leftist NGOs, to acknowledging they are a problem and deploying his military to put them out. Presumably, this is not just the result of Macron’s rhetoric — “our house is on fire,” the French leader tweeted late last week — but what followed: a promise to spike a major European trade deal with Brazil if Bolsonaro did not take the fires seriously. In other words, a threat to apply the same tools of leverage and sanction and shame to crimes of climate as have been applied, in the past, to violations of human rights and territorial sovereignty.\n\nThis is, of course, unprecedented—and much more significant than the paltry $20 million the nations of the G7 pledged to send to Brazil to help fight the fires. It was also, in a way, inevitable. If climate change does transform life on this planet at anything like the scale and speed scientists promise it will, our politics will change with it — and probably quite dramatically. One question this raises is: In what ways? Another is: Will we like what warming does to us? The answers to both are very much open, and we’ve barely begun to develop a political science around climate change that might help us think through the possibilities.\n\nOn Friday, I wrote about the fact that, on the very same day that the Brazilian fires became news in America, the U.S. lost its one candidate for president, Jay Inslee, who was committed to taking climate change as seriously as the world’s scientists insist we all must — and I suggested that action on climate may well require an entirely different kind of politics than one that consigns principled crusaders like Inslee to the bin of also-rans. Less than 24 hours after Inslee dropped out, Bernie Sanders dropped his own climate plan — one much grander than anything even Inslee proposed. If Sanders’s gambit represents one new kind of climate politics, this G-7 climate shaming surely counts as another. But what kind is it?\n\nSaturday at the Atlantic, Franklin Foer proposed that meaningful action to combat warming may require that the bedrock principle of national sovereignty be retired, such that leaders like Bolsonaro (or, for that matter, Trump) won’t be able to operate with impunity on climate issues which, despite playing out within those nations’ borders, impact the rest of the world as well (often more so, since impacts are distributed unequally). “If there were a functioning global community, it would be wrestling with how to more aggressively save the Amazon, and acknowledging that the battle against climate change demands not only new international cooperation but, perhaps, the weakening of traditional concepts of the nation-state,” he wrote. “The case for territorial incursion in the Amazon is far stronger than the justifications for most war.”\n\nFoer was writing before Bolsonaro “capitulated,” but the prospect of climate wars seems even more pressing now. The G-7 shame campaign was only a modest step in that direction — individual nation-states acting in concert, not to undermine the sovereignty of a bad actor but to remind him how dependent his country is on the support of other nations, and to threaten to withdraw that support. But it nevertheless allows you to imagine a possible world, probably at least a few years away, in which a similar group of nations — or a similarly concerned single superpower — does take the next step and threatens military action. That is, of course, what often does follow from a sequence of sanctions, and it is more or less how in the aftermath of World War II the nations of the west “consecrated” the principle of human rights. (That is, by fighting wars in its name, if often for other material reasons). If the 21st century is conducted in the shadow of warming as the second half of the 20th was in the shadow of the Holocaust, that sort of succession — from human rights to climate change as the universal touchstone of geopolitics and speakable expression of great-power rivalry — seems not just possible but inevitable.\n\nSo — is that where we are headed? Honestly, I don’t know, and don’t know anyone who does. As with everything else when it comes to climate, we are headed into a brave new world with nothing resembling a playbook. But in their brilliant book Climate Leviathan, the political scientists Geoff Mann and Joel Wainwright plot a matrix of possible future political responses to climate. The two axes are the relationship to the nation state (i.e., does the world recognize national sovereignty in the face of climate change?); and the relationship to capitalism (i.e., does the world respond to the crisis by doubling down on the importance of capital, or does it retreat from it?). They name the resulting quadrants: Climate Mao (anti-capitalist and nationalist); Climate Behemoth (capitalist and nationalist), Climate Leviathan (capitalist and globalist) and Climate X (anti-capitalist and globalist, basically ecosocialism, which they’re rooting for). But they also acknowledge that each category is too neat — a conceptual framework, not a map of our future. My own guess is that they’re right: that we won’t have any one new paradigm for climate politics, that no one prediction will come to pass in any total way, but that we will evolve those new politics along many different ideological axes.\n\nWhat would that mean? That there won’t just be ecofascism of the kind that’s been talked about a lot over the last month — right-wing governments throwing up border walls and defining the needs of their own people, in a resource-scarce world, as infinitely more important than the needs of anyone else. There could also be ecofascism of the environmentalist stripe, governments running roughshod over the rights of their citizens to impose deeply disruptive responses to warming and all its impacts — eminent domain on environmental-panic steroids, decarbonization on a military footing. There will likely be more moderated forms of both — some rise in nativism that doesn’t totally revolutionize existing political cultures, some expansion of government authority that adds to rather than obliterates status-quo powers. There may be some form of ecosocialism and, elsewhere, some rejection of economic growth and an embrace of what’s been called “de-growth.” But on the left, some modulated versions are probably likelier, too: a more empathic and redistributive politics that stops short of true collectivization, for instance, and some growing awareness among left-wing leaders around the world that growth is merely one measure of progress, and perhaps a misleading or counterproductive one. In New Zealand, prime minister Jacinda Adern is already pointing the way there.\n\nAnd probably it won’t be any one of these futures but something more like all of them, all at once, in different places at different times — with different nations responding differently to the challenge, even different parts of single nations, with some regions and some parts of government acting from one set of ideological goals while others move in different directions. That is to say, it is likely to be all quite messy, as politics always is, however much we might wish to imagine a single future, or a single climate “solution” — and however much the neoliberal order of the last political generation promised that all plots moved predictably markets-ward.\n\nIn a weird way, the G-7 bullying this past weekend extends the same promise — and makes the awakening of climate conscience among the world’s most powerful nations look somewhat less like a radical political departure than the simple extension of existing (and imperiled) neoliberalism into the realm of climate concern. Still, this is progress. In fact, quite significant progress, I think, since market forces remain quite powerful tools, and since we need all the tools we can get in addressing a crisis of this scale. But, of course, it also has some blindspots.\n\nTo begin with, the fires, judged on their own, actually aren’t all that significant a climate event. They are bad, since all fires are bad, climate-wise. But the relatively limited aid the G7 will be sending to fight them is a sign that these fires are neither catastrophic in the short term nor hard to control—$20 million being less than one percent the annual budget of CalFire, the California state fire program. Of course, Bolsonaro’s broader plan to develop and deforest the Amazon would be such an outrageous carbon catastrophe — it could release, over a decade, as much carbon as the U.S. and China, the world’s two biggest emitters, release in a year — that it would represent the enactment of a sort of great-man theory of climate disaster. But the fires burning this month are, as the New York Times has shown, mostly on land that has already been deforested — farmers clearing their land as part of their annual rhythm, if on land that was once rainforest and perhaps in a coordinated way to make an ugly gesture of solidarity with their president and his plan to open up yet more of the land. There are more fires burning today in Congo and Angola than in Brazil, almost none of which are true wildfires, like those we’ve seen devastate California and Siberia, but are controlled and defeatable with a relatively minimal effort.\n\nThis all makes the G-7 campaign an important symbolic gesture, but perhaps only that, and one for which the ultimate test is what happens after the fires are put out: Will Bolsonaro’s deforestation plan continue, or not? Or perhaps that is only the penultimate test, since there is also the question of whether pressure like this can be employed by nations like France and Canada and the UK to punch up and not just punch down — to influence the world’s biggest carbon emitters, namely China and the United States.\n\nAnd if the gesture is mostly symbolic, what is the symbol obscuring? Canada’s Justin Trudeau was the first leader to echo Macron’s call to action, but he recently approved the TransMountain pipeline; Japan is financing coal plants built abroad that are as much as 40 times more polluting than those they allow within their borders. In fact, every single member nation of the G-7 is hiding some significant climate hypocrisy behind their pressure on Bolsonaro, however laudable that pressure is. But if the sum total of their collective action this year will be effectively dispatching the Brazilian military to fight fires local farmers had mostly under control, it will be a critically insufficient response. If their pressure forces Bolsonaro to abandon his plans for the Amazon, that would be considerably better. And yet there is much more to be done still, in each of their home countries, none of which are meeting the pledges they made under the Paris accords just three years ago. To pretend that Bolsonaro is the world’s only climate villain, or the Amazon the only region in the world currently in climate crisis, is an act of grand self-delusion.\n\nStill, the value of symbolism is not to be discarded. For a very long time, climate scientists and activists lamented the disinterest of the average person in the issue, in part blaming the media for failing to communicate the scale of the crisis and the urgency of action. They were right, in a way: climate change simply wasn’t on the front page of the New York Times or Washington Post every day, and almost never made it onto television news. On the newspaper side, that has already changed, with quite remarkable speed: It’s not every day yet, but the country’s major papers do now devote enviable acreage to the story, often several times a week and frequently illustrated with dramatic above-the-fold photography. The progress in television has been slower, but here the Amazon fires may mark a different kind of turning point — and a recognition among producers that, while climate change may have a longstanding reputation as a ratings-killer, natural disasters do not, especially those that produce fire. Perhaps the blockbuster wall-to-wall coverage of the recent burning of Notre Dame was good training on this point, too.\n\nThis fire season has been an unusually mild one, so far, for California, and we’ve yet to see the major hurricane events that have whipped through the Caribbean each of the past two summers. But the coverage of the Amazon fires suggests that, when those terrifying impacts happen, producers may finally be ready to showcase them in the way they should. It is horrible for anyone living in their path, of course, that disasters are getting more frequent and more punishing. But judged strictly from the semi-sociopathic perspective of journalistic narrative, the climate change story is getting “better.” Rather than relying on dry-sounding predictions of centuries-long sea-level rise measured in the centimeters or inches, natural disasters and extreme weather are teaching us all how to tell stories that horrify us into action, even of an imperfect kind.", "description": "Until the G-7, the nations of the world had never before chosen to punish bad behavior on climate change. That may not change all that much — yet.", "authors": ["David Wallace-Wells"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/08/26/26-amazon-fire.w1200.h630.jpg"}