{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7623621/MAFS-Martha-reveals-real-reason-Elizabeth-Sobinoff-lost-weight.html", "downloaded_at": "2019-10-28 23:45:07.334378+00:00", "title": "MAFS: Martha reveals the real reason Elizabeth Sobinoff lost so much weight", "language": "en", "text": "Earlier this month, Married At First Sight fans expressed fears that Elizabeth Sobinoff was 'losing too much weight'.\n\nBut fellow MAFS bride Martha Kalifatidis says people have nothing to worry about because there is a perfectly reasonable explanation for Elizabeth's fluctuating size.\n\nSpeaking to Daily Mail Australia last week, Martha, 31, pointed out that the jewellery store manager has an autoimmune disease that can cause weight loss.\n\nScroll down for video\n\nMystery solved! Married At First Sight's Martha Kalifatidis (right) has revealed the real reason Elizabeth Sobinoff (left) has lost so much weight, after fans expressed fears for her health\n\n'I don't think there is anything to worry about. I think she looks great and wasn't it a year ago that people were calling her fat?' said Martha.\n\n'And now they are saying she's too skinny. Just leave her alone, it's her body and she can do what she wants with it... I'm pretty sure she was quite open about having health issues, so maybe that has something to do with it?\n\n'Maybe instead of everyone just saying, \"Oh she's [too skinny],\" dig into it a little bit more and you'll learn or find out the truth.'\n\nBefore and after: Since filming MAFS season six last year, Elizabeth (pictured) has completely transformed her appearance and lost an impressive 10kg in the process\n\nIt comes after Elizabeth's Instagram followers pleaded with her to 'stop losing weight' after she shared a photo of herself looking very slim in a plunging black jumpsuit.\n\nOne fan wrote: '[She's] looking so thin and sick, hope all is OK. Hopefully you can put some kilos back on. This does not look good on you.'\n\nAnother commented: 'No-one is being nasty or horrible, just stating the facts. Lizzie has a warm, generous soul, however I would be worried if she was my daughter. She doesn't look well, but if she's happy that's all that matters.'\n\n'You look amazing but don't lose any more weight. You were beautiful on MAFS,' a third person added.\n\nWorrying: It comes after Elizabeth's Instagram followers pleaded with her to 'stop losing weight' after she shared this photo of herself looking very slim in a plunging black jumpsuit\n\n'This does not look good on you': While many fans praised Elizabeth's appearance, others expressed concern and said she had taken her weight loss journey too far\n\nSince filming Married At First Sight season six last year, Elizabeth has completely transformed her appearance.\n\nShe has ditched her blonde hair extensions and embraced a more natural brunette shade, toned down her makeup, and shed an impressive 10kg.\n\n'I love my body... at any size,' she recently told NW magazine.\n\nHappily ever after? Elizabeth was paired with Sam Ball (right) on this year's season of MAFS, but their 'marriage' ended in tears when he cheated on her with another bride, Ines Basic\n\n'I've thought that when I weighed 49kg and when I've weighed 90kg. I want women to realise that we're all so much more than a number on a scale,' she added.\n\n'So, yes, I've lost some weight since I was a \"huge\" size 10 when I was on MAFS, but that doesn't mean I'm any \"better\" now, just because I'm slimmer.'\n\nElizabeth was paired with Sam Ball on MAFS. On their wedding day, the tradesman infamously 'fat shamed' his bride by saying he didn't 'usually date girls her size'.\n\nAfter splitting with Sam, the 27-year-old is set to return to the franchise as an 'intruder bride' on the upcoming season.", "description": "Earlier this month, Married At First Sight fans expressed fears that Elizabeth Sobinoff was 'losing too much weight'.", "authors": ["Jo Scrimshire", "Candice Jackson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/21/20299930-0-image-a-18_1572298797206.jpg", "published_at": "2019-10-28"}