{"pub": "reuters", "url": "https://in.reuters.com/article/india-kashmir/india-says-it-expects-to-gain-control-over-pakistani-kashmir-one-day-idINKBN1W21D7", "downloaded_at": "2019-09-17 23:35:06.704722+00:00", "title": "India says it expects to gain control over Pakistani Kashmir one day", "language": "en", "text": "India's Foreign Minister Subrahmanyam Jaishankar attends a news conference after a meeting with Russia's Foreign Minister Sergei Lavrov in Moscow, Russia, August 28, 2019. REUTERS/Evgenia Novozhenina\n\nNEW DELHI (Reuters) - India’s foreign minister said on Tuesday that the part of Kashmir controlled by Pakistan belongs to India and that he expected New Delhi to gain physical control over it one day, as the two countries again traded barbs over the disputed territory.\n\nIndia rules the heavily populated Kashmir Valley, while Pakistan controls a wedge of territory in the west of the region that New Delhi describes as Pakistan-occupied Kashmir (PoK).\n\n“Our position on PoK is, has always been and will always be very clear. PoK is part of India and we expect one day that we will have the jurisdiction, physical jurisdiction over it,” Foreign Minister Subrahmanyam Jaishankar told a news conference.\n\nLast month, New Delhi scrapped the special status of its part of Muslim-majority Kashmir in a bid to integrate the territory fully into India, a move that has prompted protests and anger in Kashmir and Pakistan.\n\nIn a statement, Pakistan’s foreign affairs ministry condemned Jaishankar’s remarks.\n\n“Coming from an occupying state, such irresponsible and belligerent statements have the potential to further escalate tensions and seriously jeopardise peace and security in the region,” it said. “Pakistan stands for peace, but would be ready to respond effectively to any act of aggression.”\n\nThe two countries, both nuclear-armed, have twice gone to war over Kashmir. Pakistan has condemned India’s decision to change Kashmir’s status and said India’s crackdown on protests and dissent in the region would drive more of the world’s Muslims into extremism.\n\nJaishankar said the revoking of Kashmir’s special rights was an internal Indian matter.", "description": "India's foreign minister said on Tuesday that the part of Kashmir controlled by Pakistan belongs to India and that he expected New Delhi to gain physical control over it one day, as the two countries again traded barbs over the disputed territory.", "authors": ["Aftab Ahmed", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190917&t=2&i=1430830608&w=1200&r=LYNXMPEF8G0WX", "published_at": "2019-09-17"}