{"pub": "usatoday", "url": "https://usatoday.com/story/news/nation/2019/10/02/amber-guyger-sentencing-jury-decides-prison-time-botham-jean-death/3838835002", "downloaded_at": "2019-10-06 13:18:26.247302+00:00", "title": "Former Dallas cop Amber Guyger gets 10 years in prison for killing neighbor in his own home", "language": "en", "text": "CLOSE A former Dallas police officer was sentenced to 10 years in prison after fatally shooting a neighbor she thought was an intruder. Wochit\n\nA Dallas jury on Wednesday sentenced former police officer Amber Guyger to 10 years in prison for fatally shooting a black neighbor after she mistakenly walked into his apartment and mistook him for an intruder.\n\nThe state asked the jury to sentence Guyger, who is white, to a minimum of 28 years for the killing. Judge Tammy Kemp ruled the jury could consider a \"sudden passion\" defense that could reduce the sentence to two years, but in the end, jurors opted for a higher sentence.\n\nGuyger, who was in uniform when she fatally shot Botham Jean a year ago as he ate a bowl of ice cream, normally would have faced a sentence as high as 99 years. She didn’t appear to show much reaction, at least from the angle of a live camera stream, as the judge read the jury’s sentence.\n\nThe sentence was met with boos and jeers by a crowd gathered outside the courtroom. “It’s a slap in the face,” one woman said.\n\nAs Jean’s family walked out of the courtroom, the group that had been outside began a chant of, “No justice! No peace!” Two young black women hugged each other and cried.\n\nIn an emotional moment shortly after the sentencing, the victim's brother said that he had forgiven Guyger and he hugged her in the courtroom. Brandt Jean said he thinks that his brother would want Guyger to give her life to Christ.\n\nBotham Jean's younger brother Brandt hugs convicted murderer and former Dallas Police Officer Amber Guyger after she was sentenced to 10 years in jail on Wednesday. Guyger fatally shot Botham Jean a year ago as he ate a bowl of ice cream in his apartment. She told police she thought his apartment was her own and that he was an intruder. (Photo: Tom Fox, AP)\n\nHe said, “I love you as a person. I don’t wish anything bad on you.”\n\nHe then said “I don’t know if this is possible, but can I give her a hug?”\n\nThe judge said he could and Jean and Guyger embraced in front of the courtroom as Guyger sobbed.\n\nUnder Texas law, a person convicted of murder can be eligible for parole after serving half their sentence. That would mean Guyger could possibly get her first parole hearing after roughly five years.\n\nKemp made the sudden passion ruling earlier in the day at the behest of the defense – with the support of prosecutors.\n\nGuyger testified at trial that she returned from an extended police shift and incorrectly believed she had entered her own apartment. She said she panicked when she saw Jean, an accountant from St. Lucia whom she had never met. Guyger, 31, shot Jean, 26, with her service weapon.\n\nA prosecutor told jurors that when deciding the sentence for the killing in September 2018, they could consider racially insensitive texts Guyger sent to her police partner. She said they shouldn’t sentence Guyger to less than 28 years, which is how old Jean would be.\n\nJean family lawyer S. Lee Merritt said Tuesday's guilty verdict should have been expected but convictions of white officers who kill unarmed black men are rare. The community had been \"on pins and needles\" awaiting the decision, Merritt said.\n\n\"It's a signal that the tide is going to change,\" he said of the verdict from the predominantly nonwhite jury. \"Police officers are going to be held accountable for their actions.\"\n\nFormer Dallas police officer Amber Guyger was convicted of murder in a neighbor's shooting. (Photo: AP)\n\nRep. Marc Veasey, D-Texas, who is black, was less certain. He called the conviction \"a small step toward justice for Botham Jean and his family\" but noted that all their lives have been changed forever.\n\n\"Justice will never fully be served until we as a country address the systemic failure in our criminal justice system and rightfully prosecute the spate of unjustified shootings of black men and boys in this country,\" Veasey said.\n\nAbout 30 protesters marched through parts of downtown Dallas on Wednesday night, chanting \"No justice, no peace; no racist police.\" They sometimes blocked traffic on busy streets near the courthouse, where another 20 demonstrators decried the sentencing.\n\nAbout a dozen police officers, some in riot gear, surrounded the marchers. One woman was arrested after apparently disobeying police orders to move from the street to the sidewalk.\n\nMeanwhile NAACP President Derrick Johnson lauded the jury for convicting Guyger despite a judge's order that they consider the state's \"Castle Doctrine,\" a law similar to stand-your-ground laws that allows use of force, including deadly force, when someone believes their home, property or life are threatened.\n\n\"We're one step closer to seeing justice for our brother #BothamJean,\" Johnson tweeted. \"While the judge introduced a form of #StandYourGround on behalf of the killer #AmberGuyger, we applaud the jury for holding her accountable with a guilty verdict.\"\n\nTestimony in the sentencing phase began Tuesday. Jean's mother, Allison, said her life has not been the same since her son's death.\n\n\"It’s just been like a roller coaster. I can’t sleep, I cannot eat,\" she said. \"It’s just been the most terrible time for me.\"\n\nJean's father, Bertrum, testified Wednesday that his son called his family every Sunday. Now his Sundays are \"destroyed,\" Bertrum Jean said.\n\n\"Such a sweet boy. He tried his best to live a good honest life,\" Jean told the court through tears. \"He loved God. He loved everyone. How could this happen to him?”\n\nProsecutors showed the jury text messages from Guyger's cellphone that hint at insensitivity toward black people.\n\nWednesday, defense witnesses testified, starting with Guyger's mother, Karen, who testified her daughter was sexually abused as a child. Former colleagues testified – officer Cathy Odhiambo, who is black, described Guyger as \"the sweetest person.\"\n\nThe jury took hours to render the verdict after six days of testimony.\n\nDuring her trial, Guyger said she had parked on the wrong level of her apartment building's parking garage by mistake and walked down a corridor to the apartment directly above hers, thinking it was her own. She became worried when she noticed the door was unlocked, she said. Prosecutors said that was when Guyger should have called for backup.\n\nGuyger testified that she feared for her safety and shot Jean when he failed to obey her command to put his hands up.\n\nGuyger called 911 after the shooting. She repeatedly apologized to Jean, saying she thought she was in her own apartment. Guyger was arrested days after the shooting and subsequently fired by the Dallas Police Department.\n\nContributing: Jorge L. Ortiz; The Associated Press\n\nRead or Share this story: https://www.usatoday.com/story/news/nation/2019/10/02/amber-guyger-sentencing-jury-decides-prison-time-botham-jean-death/3838835002/", "description": "Convicted of murdering Botham Jean, former Dallas police officer Amber Guyger is sentenced to 10 years Wednesday by a jury.", "authors": ["John Bacon", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/01/USAT/00c9d41d-b9c8-492c-b233-21ab58c66a28-VPC_AMBER_GUYGER_DESK_THUMB.jpg?crop=1274,717,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-02"}