{"pub": "washingtonpost", "url": "https://washingtonpost.com/education/2019/10/01/trump-administration-sides-with-catholic-school-that-fired-gay-teacher", "downloaded_at": "2019-10-02 02:28:11.273075+00:00", "title": "Trump administration sides with Catholic school that fired gay teacher", "language": "en", "text": "After refusing archdiocese’s order to fire gay teacher, school is told it will no longer be recognized as Catholic\n\nIn 2017, Payne-Elliott married a male teacher at Brebeuf Jesuit Preparatory School in Indianapolis. The archdiocese told both schools they no longer would be considered Catholic if they did not fire the teachers. Brebeuf refused to dismiss Payne-Elliott’s husband, who was not named, and Archbishop Charles C. Thompson issued a decree in June saying the school would no longer be recognized as Catholic. Cathedral, apparently to avoid the same fate, fired Payne-Elliott after trying to protect him for nearly two years.\n\nAD\n\nAD\n\nLast month, the Vatican suspended Thompson’s decree against Brebeuf while the school appeals the archbishop’s decision.\n\nPayne-Elliott then sued the archdiocese in Marion Superior Court in Indianapolis, saying it had discriminated against him and illegally interfered with the contract he had with Cathedral to teach. He is seeking compensation for lost earnings and benefits, as well as emotional distress.\n\nThe Archdiocese of Indianapolis makes clear on its website that the “Catholic Church believes marriage to be between a man and a woman,” and that teachers in its schools are “ministers” who “must uphold the teachings of the Church in their daily lives, both in and out of school.”\n\nAD\n\nThe Justice Department’s statement of interest says the First Amendment gives the church the right to make decisions upholding its religious teachings without government interference.\n\nAD\n\n. . . the Attorney General has explained that religious employers are entitled to employ only persons whose beliefs and conduct are consistent with the employers’ religious precepts, and, more broadly, that the United States Constitution bars the government from interfering with the autonomy of a religious organization. This case presents an important question: whether a religious entity’s interpretation and implementation of its own religious teachings can expose it to third-party intentional-tort liability. The First Amendment answers that question in the negative.\n\nThis is not the first time the Trump administration has entered the fray over legal rights that protect gay Americans. In August, the Justice Department filed an amicus brief in a case before the Supreme Court, arguing that a 1964 federal civil rights law that prohibits sex discrimination does not protect gays in the workplace from being fired and discriminated against because of their sexual orientation.\n\nThe Supreme Court legalized same-sex marriage in 2015 but has not returned to LGBTQ rights since then. The case in which the amicus brief was filed involves two people who said they were fired from their jobs because they were gay. It is scheduled to be heard by the justices this month.\n\nAD", "description": "The Justice Department filed a \"statement of interest\" supporting the church in a lawsuit filed by the fired teacher.", "authors": ["Valerie Strauss", "Reporter Covering Education", "Foreign Affairs"], "top_image": "https://www.washingtonpost.com/resizer/RaO6e_Ssx1INIzlodUdUahODWdc=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EXFHESXBTII6TPT7JTEFAF6DN4.jpg", "published_at": "2019-10-01"}