{"pub": "yahoo", "url": "https://news.yahoo.com/trump-got-stopped-dems-defy-043051849.html", "downloaded_at": "2019-09-26 23:55:17.010627+00:00", "title": "Trump 'has got to be stopped': Dems defy impeachment risks", "language": "en", "text": "Senate Minority Leader Sen. Chuck Schumer of N.Y. gestures as he speaks to the media about an impeachment inquiry on President Donald Trump, Wednesday Sept. 25, 2019, on Capitol Hill in Washington. (AP Photo/Jacquelyn Martin)\n\nNEW YORK (AP) — Democrats are embracing an impeachment investigation that could jeopardize their House majority and alienate the very suburban voters who have warmed to the party in recent elections and will be vital to defeat President Donald Trump next fall.\n\nBut a growing consensus is emerging among anxious Democrats: The risks are worth it.\n\nDemocrats were emboldened by Wednesday's release of a rough transcript of Trump's July call with Ukrainian President Volodymyr Zelenskiy, which confirmed that the Republican president repeatedly asked a foreign power to investigate his leading Democratic political rival, Joe Biden.\n\n\"The guy has got to be stopped,\" said Democratic former Virginia Gov. Terry McAuliffe, who had previously urged Democrats to move cautiously on impeachment because the Republican-led Senate would almost certainly reject articles of impeachment.\n\n\"This is a president using presidential power to invite a foreign government to come into our country and interfere with our democracy,\" McAuliffe continued. \"This is too much.\"\n\nDemocrats will face tremendous political peril over the next year, however — a fact underscored by a far more cautious approach from the Democratic governors of Minnesota, Pennsylvania and Wisconsin, who declined Wednesday to endorse House Speaker Nancy Pelosi's approach.\n\nMinnesota Gov. Tim Walz, a former congressman, called details of Trump's phone call \"deeply troubling\" but said impeachment may not be the way to go.\n\n\"It may not be politically good to do because I think at this point I, like many Minnesotans, am so sick and tired of the dysfunction in D.C.,\" he told reporters.\n\nWhile Congress' timeline is yet unclear, the impeachment inquiry may well run simultaneously with the Democratic Party's primary election calendar. The first primary votes are scheduled in early February and will run through the party's national convention in July.\n\nMore broadly, the impeachment proceedings will serve as a constant reminder to voters across the political spectrum that Democrats are actively using one of Congress' most sacred powers to pursue Trump.\n\nThe move is justified but inherently \"dangerous,\" said Bill Burton, a former adviser to President Barack Obama.\n\n\"Nobody knows how the politics are going to play out, which is why it's so honorable that Speaker Pelosi is moving forward,\" Burton said. \"There comes a tipping point where Congress needs to do its job when there's such blatant abuse of power.\"\n\nStrategists in both major political parties pointed to the electoral backlash against the GOP after House Republicans voted to impeach President Bill Clinton in 1998 for obstructing the investigation into his extramarital affair.\n\nRepublicans nearly lost their House majority in the next election.\n\nAnd Democrats, having won a narrow House majority less than two years ago, must now spend the next 14 months protecting vulnerable freshmen in pro-Trump districts to preserve their grip on at least one chamber of Congress.\n\nThe inexperienced freshmen will be forced to explain the impeachment investigation to skeptical constituents over and over. At the same time, they will be forced to answer for Democratic presidential contenders , who have almost unanimously embraced impeachment and policy prescriptions that are sometimes out of step with moderate voters.\n\nBiden, one of the few former holdouts on impeachment, said Tuesday that Trump \"will leave Congress ... with no choice but to initiate impeachment\" if he doesn't cooperate with congressional investigators. The former vice president came out with an even stronger message on Wednesday, insisting that the rough transcript revealed Trump had jeopardized national security.\n\n\"It is a tragedy for this country that our president put personal politics above his sacred oath,\" Biden said. He added, \"Congress must pursue the facts and quickly take prompt action to hold Donald Trump accountable.\"\n\nDespite the strong words, polling on impeachment has never been with the Democrats' new position.\n\nMultiple polls show that a majority of Americans have consistently opposed impeaching Trump. A Quinnipiac University poll released in mid-July, for example, found that 60% of registered voters opposed impeachment proceedings that could lead to Trump's removal from office; the opposition included 29% of Democrats and 62% of independents.", "description": "Democrats are embracing an impeachment investigation that could jeopardize their House majority and alienate the very suburban voters who have warmed to the party in recent elections and will be vital to defeat President Donald Trump next fall.  Democrats were emboldened by Wednesday's release of", "authors": ["Steve Peoples"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Qcvf9xgz9MpzS4zmasWBwA--~B/aD0yNTA2O3c9Mzc1OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/076b417b8e826cbe294545a6b1bfd050", "published_at": "2019-09-26"}