{"pub": "businessinsider", "url": "https://businessinsider.com/trump-rule-deprives-1-million-kids-automatic-free-lunch-2019-10", "downloaded_at": "2019-10-17 11:37:12.176603+00:00", "title": "A new Trump administration rule will deprive nearly 1 million school kids of automatic free lunches, official figures say", "language": "en", "text": "According to Department of Agriculture figures released Tuesday, 982,000 children will no longer automatically qualify for a free school lunch under planned changes to the food stamps program.\n\nAround 55% of those children will now have to pay. The remaining 45% remain eligible for free lunches, but will have to pass extra bureaucracy to access what was once automatic.\n\nThe Trump administration claims its changes close loopholes that allows children free lunches even if their parents are not really in poverty.\n\nVisit Business Insider's homepage for more stories.\n\nA new Trump administration rule will deprive nearly one million children of automatically qualifying for a free school lunch, according to US Department of Agriculture (USDA) figures.\n\nUnder proposed changes to the Supplemental Nutrition Assistance Program (SNAP) — the official name for food stamps — nearly 1 million children will no longer be certified to receive free meals, according to an analysis released by the department late Tuesday.\n\nThe administration is aiming to close what it claims are loopholes in the food stamps program that allows children to receive school meals even if their parents earn enough to place them above the official poverty level.\n\nThe threshold for being considered in poverty is an income of $25,000 for a family of for. The USDA said that some families have been claiming food stamps despite earning up to $50,000.\n\nOfficials also want to introduce an additional rule that even families with an income at the poverty threshold can only receive food stamps if they demonstrate they have less than $2,250 in assets.\n\nThe analysis says that enforcing new, tighter rules would mean that 982,000 children would no longer be automatically eligible for free school meals.\n\nOf these, 45% would be eligible for free school meals if their parents or guardians went through an application process.\n\nThe remaining 55% would have to pay for school meals, according to the figures.\n\nLisa Davis of the advocacy group No Kid Hungry told The New York Times that the application process could itself be a barrier for some children to receive the lunches.\n\nStates, she told the publication, have relied on automatic eligibility because \"they know too many eligible children fall through the cracks when parents have to fill out and submit a paper application.\"\n\n\"Parents may not understand it. The paperwork may not make it home or it may not make it back to school. Vulnerable families can fall through the cracks,\" Davis said. \"There is no guarantee that they will end up re-enrolled.\"\n\nThe USDA told the Associated Press that the rule change would make application criteria more consistent, and that the consultation period on the impact of the change would remain open for another two weeks.", "description": "The Trump administration is seeking to tighten eligibility for the food stamps program, and new figures show the impact on school kids.", "authors": ["Tom Porter"], "top_image": "https://image.businessinsider.com/5da83f0d4af909758911a9b2?width=1200&format=jpeg", "published_at": "2019-10-17"}