{"pub": "cbs", "url": "https://cbsnews.com/news/colin-kaepernick-agent-say-no-teams-have-offered-nfl-free-agent-quarterback-a-job-since-2016", "downloaded_at": "2019-10-12 00:21:08.447867+00:00", "title": "Colin Kaepernick's agent releases memo to address \"false narratives\" about quarterback", "language": "en", "text": "Colin Kaepernick's agent on Thursday released a memo to address \"false narratives\" surrounding his client. The former San Francisco 49ers quarterback hasn't played in the NFL since 2016 when he began kneeling during the national anthem to protest police brutality and racial injustice.\n\nSeveral teams across the league have lost their star quarterbacks to injury this year — Pittsburgh Steelers' Ben Roethlisberger, Jacksonville Jaguars' Nick Foles, New Orleans Saints' Drew Brees and Carolina Panthers' Cam Newton — but attorney Jeff Nalley says NFL teams aren't giving Kaepernick a shot.\n\n\"I have reached out to all 32 teams about Colin's employment, with little to no response from teams about an opportunity for Colin. In 25 years, I have never seen anything like it,\" Nalley wrote\n\n\"No, not a single team has offered Colin a job since the 2016 season, in which he began his peaceful protest,\" the memo said, adding that no NFL team has worked him out or have asked for salary demands.\n\n“There have been so many false narratives in the media regarding Colin, we believe it’s important to set the record straight, again.” Please read this!! Don’t believe the lies being told about my brother .@Kaepernick7 pic.twitter.com/n7J384bT96 — Eric Reid (@E_Reid35) October 10, 2019\n\nKaepernick decided not to continue with the San Francisco 49ers after the end of the 2016 season. The team's general manager later confirmed the team was planning to cut him. Since then, he has yet to find another job with the NFL.\n\nThe memo said Kaepernick is still \"working out 5 days a week, for 3 years, in preparation to play again.\" Prior to the NFL season, Kaepernick tweeted a workout video in which he threw passes to Cleveland Browns star Odell Beckham Jr.\n\n\"Seattle brought Colin in for a visit but did not work him out,\" the memo said. \"Afterwards, [Seattle Seahawks head coach] Pete Carroll said Colin is a \"starter in this league.\" No other NFL team has interviewed or worked out Colin in the past 3 seasons, despite other false statements in the media to the contrary.\"\n\nColin Kaepernick drops back to pass against the Pittsburgh Steelers on September 20, 2015. Justin K. Aller / Getty\n\nKaepernick has more than 72 touchdown passes, 12,000 passing yards and rushed for 2,300 yards and 13 rushing touchdowns in his career. He has a 4-2 record in the playoffs, leading the 49ers to a Super Bowl and two NFC Conference games.\n\n\"In summary, it is difficult to think of another young player in NFL history with statistics and character as impressive as Colin's not being given an opportunity to earn a spot on an NFL roster after what he has accomplished,\" the memo said.\n\nIn 2017, Kaepernick and Carolina Panthers' safety Eric Reid filed a grievance against the league, alleging the two they remained unsigned because of collusion by owners following the kneeling protest. In February, the NFL and lawyers for Kaepernick and Reid reached a private settlement.", "description": "Attorney Jeff Nalley says no teams have worked out Kaepernick since he left the 49ers in 2016", "authors": ["Christopher Brito"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/10/11/9fb350f2-b0c4-4a1e-b511-2852746ae321/thumbnail/1200x630/aaa12c51b0f3664023a829e39e0198f4/gettyimages-489326136.jpg", "published_at": "2019-10-11"}