{"pub": "independent", "url": "https://independent.co.uk/life-style/fashion/jennifer-aniston-instagram-behind-the-scenes-post-photoshoot-justin-theroux-a9167331.html", "downloaded_at": "2019-10-23 09:49:24.907141+00:00", "title": "Jennifer Aniston reveals what really goes on behind the scenes at photoshoots", "language": "en", "text": "Jennifer Aniston has only been on Instagram for a few weeks but is swiftly becoming one of the platform’s most popular users.\n\nThe actor has already made headlines for “breaking” Instagram after she shared a photograph featuring her Friends co-stars.\n\nNow, Aniston is earning praise from her 15.9 million followers for sharing a candid photograph from behind the scenes of a recent photoshoot.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn the style of an Instagram vs Reality post, whereby users upload two images capturing the same event, Aniston posted a photograph of herself being tended to by assistants at the shoot.\n\nThe actor’s hair was styled in plaits and she stood slightly hunched with a grimacing facial expression.\n\nShape Created with Sketch. Best celebrity Instagram posts from the 2019 Golden Globes Show all 23 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Best celebrity Instagram posts from the 2019 Golden Globes 1/23 \"I can't remember exactly, but I'm pretty sure the rule is to eat as much as humanly possible before squeezing into a formal dress. Right?\" Kristen Bell wrote in an Instagram caption. Bell's husband, Dax Shepard, can be seen relaxing in bed in the background. Kristen Bell (@kristenanniebell) 2/23 Following their delicious pre-Golden Globes meal, Kristen Bell and Dax Shepard looked sharp in their chic ensembles, which they accessorised with napkins. Naturally. Kristen Bell (@kristenanniebell) 3/23 Golden Globes co-host Sandra Oh shared a photo on her Instagram story showing her getting ready before the big night. Oh won the Golden Globe for best actress in a television series drama for her leading role in thriller 'Killing Eve'. Sandra Oh (@iamsandraohinsta) 4/23 Andy Samberg and Sandra Oh had a lot to prepare before hosting the Golden Globes together. Here, in a photo shared on Samberg's Instagram story, the pair appear deep in conversation, likely discussing the clever quips hiding under their sleeves. Andy Samberg (@thelonelyisland) 5/23 Parenting is a time-consuming business, as Ricky Martin demonstrates in this photo posted on his Instagram account. \"#Multitasking Getting ready for the @goldenglobes,\" he writes in the caption. In the picture Martin can be seen holding the pram of his daughter Lucía Martin-Yosef, whose birth he and husband Jwan Yosef announced in December 2018. Ricky Martin (@ricky_martin) 6/23 Dax Shepard showed just how much effort he'd put into his Golden Globes preparations with a selfie that he posted on Instagram. \"Even showered (last night) for this,\" he wrote in the caption. What a gent. Dax Shephard (@daxshepard) 7/23 Melissa McCarty, who was nominated for a Golden Globe for her leading role in 'Can You Ever Forgive Me?', wore a purple, star-studded Reem Acra dress for the award ceremony. She showed her seven million Instagram followers the preparations that she undertook for the big night, which included applying a face mask and receiving help from a dedicated glam squad. Melissa McCarthy (@melissamccarthy) 8/23 Thandie Newton had a team of people to thank for her breathtaking Golden Globes look, which she finished off with a stunning silver cut-out Michael Kors dress. The actor shared a Boomerang on Instagram of the final makeup touches being added, which included a smokey eye and a soft pink lip. Thandie Newton (@thandienewton) 9/23 While the Golden Globes may be a glamorous affair for all the celebrities who attend, the early preparations are frequently decidedly less so. Alex Borstein, who stars in comedy-drama 'The Marvelous Mrs. Maisel', shared a photo on Instagram that showed her having an eye and neck mask applied while simultaneously having her hair curled. The definition of a multitasker. Alex Borstein (@alexborstein) 10/23 Timothée Chalamet may not have won the Golden Globe for his supporting role in drama 'Beautiful Boy', but he was very excited to bring his mother along to the award show. Chalamet posted this picture on his Instagram account, alongside the caption: \"momma!\" The actor wore a custom Louis Vuitton suit designed by menswear artistic director Virgil Abloh for the event. Timothée Chalamet (@tchalamet) 11/23 Jessica Chastain is typically very private about her personal life, choosing to keep her partner Gian Luca Passi de Preposulo and their baby daughter out of the spotlight. While getting ready for the Golden Globes, Chastain shared a photo of her daughter curiously holding a ruby Piaget ring, with the caption: \"You've got good taste, kid.\" Jessica Chastain (@jessicachastain) 12/23 Rachel Brosnahan has become a household Hollywood name thanks to her star-making turn as an aspiring stand-up comedian in 'The Marvelous Mrs. Maisel'. The actor shared a selfie on Instagram with her \"girl gang\" prior to the Golden Globes, for which she wore a floor-length yellow Prada gown. Rachel Brosnahan (@rachelbrosnahan) 13/23 Catherine Zeta-Jones shared a behind-the-scenes glimpse of her Golden Globes preparations, posting a photo on her Instagram story showing her having her hair and makeup done. \"Gold is for Globes,\" she wrote for the caption. Catherine Zeta-Jones (@catherinezetajones) 14/23 Sarah Silverman showed just how well she and ex-partner Jimmy Kimmel still get on by sharing a selfie with the talk show host and his wife, Molly McNearney. Silverman and Kimmel dated for seven years between 2002 and 2009. Sarah Silverman (@sarahkatesilverman) 15/23 Darren Criss epitomised elegance at the Golden Globes with his fiancée, producer Mia Swier. Criss, who won a Golden Globe for his chilling role as killer Andrew Cunanan in 'The Assassination of Gianni Versace', wore a floral Dior tux, and Swier wore a sleek Vera Wang gown. Darren Criss (@darrencriss) 16/23 For her first ever appearance at the Golden Globes, actor and activist Jameela Jamil had a sneaky trick for ensuring she didn't feel the January cold. The star of 'The Good Place' revealed on social media that she wore jeans underneath her pink Monique Lhuillier gown. “An experienced woman wears jeans under her Golden Globes gown because it’s forking COLD,” she wrote in a tweet accompanying the video. Jameela Jamil (@jameelajamilofficial) 17/23 'The Big Bang Theory' actor Kaley Cuoco shared a candid snap on her Instagram account of her walking along a hallway hand in hand with her new husband Karl Cook, whom she married in June 2018. Cuoco wore a navy, black and white strapless Monique Huillier gown for the Golden Globes. Kaley Cuoco (@kaleycuoco) 18/23 While last year's Golden Globes saw numerous stars wear black in solidarity with the Time's Up movement, this year celebrities chose to show their support by wearing bracelets and ribbons with the slogan \"Time's Up X2\" written across them. Julianne Moore shared this photo on her Instagram account, showing her wearing the accessory next to a beautiful Chopard bracelet. Julianne Moore (@juliannemoore) 19/23 Jamie Lee Curtis's stunning Alexander McQueen dress received a lot of praise when the actor appeared on the Golden Globes red carpet. Curtis posted this photo on her Instagram account while taking part in rehearsals for the show. Jamie Lee Curtis (@curtisleejamie) 20/23 'A Star Is Born' didn't win as many Golden Globes as people expected, having been nominated for five accolades. Nonetheless, the film's win for best original song still proved very exciting for Lady Gaga, Mark Ronson, Anthony Rossomando and Andrew Wyatt, all of whom collaborated on the song 'Shallow'. \"We're off the deep end,\" Ronson wrote in an Instagram caption accompanying a selfie of the group. Mark Ronson (@iammarkronson) 21/23 Isla Fisher and Sacha Baron Cohen are known for their playful relationship, so much so that Fisher couldn't help but poke fun at her husband's Golden Globe loss for best actor in a musical or comedy for 'Who is America?' \"My husband WON!... not,\" Fisher cheekily wrote on Instagram. Isla Fisher (@islafisher) 22/23 With rumours rife that Idris Elba may still be in line to take over as James Bond when Daniel Craig decides to step down from the role, the 'Luther' actor fuelled the fire further when he posted this selfie with Craig on his Instagram story. \"Awks...\" he wrote, as Craig gives Elba a defiant stare. Idris Elba (@idriselba) 23/23 One of the highlights of Julia Roberts's night came after the Golden Globes had ended, when she and husband Daniel Moder stopped off for a burger on their way home. \"Fun night w my fella. Congratulations to all! And to all a good (burger) night,\" the actor wrote on Instagram. Julia Roberts (@juliaroberts) 1/23 \"I can't remember exactly, but I'm pretty sure the rule is to eat as much as humanly possible before squeezing into a formal dress. Right?\" Kristen Bell wrote in an Instagram caption. Bell's husband, Dax Shepard, can be seen relaxing in bed in the background. Kristen Bell (@kristenanniebell) 2/23 Following their delicious pre-Golden Globes meal, Kristen Bell and Dax Shepard looked sharp in their chic ensembles, which they accessorised with napkins. Naturally. Kristen Bell (@kristenanniebell) 3/23 Golden Globes co-host Sandra Oh shared a photo on her Instagram story showing her getting ready before the big night. Oh won the Golden Globe for best actress in a television series drama for her leading role in thriller 'Killing Eve'. Sandra Oh (@iamsandraohinsta) 4/23 Andy Samberg and Sandra Oh had a lot to prepare before hosting the Golden Globes together. Here, in a photo shared on Samberg's Instagram story, the pair appear deep in conversation, likely discussing the clever quips hiding under their sleeves. Andy Samberg (@thelonelyisland) 5/23 Parenting is a time-consuming business, as Ricky Martin demonstrates in this photo posted on his Instagram account. \"#Multitasking Getting ready for the @goldenglobes,\" he writes in the caption. In the picture Martin can be seen holding the pram of his daughter Lucía Martin-Yosef, whose birth he and husband Jwan Yosef announced in December 2018. Ricky Martin (@ricky_martin) 6/23 Dax Shepard showed just how much effort he'd put into his Golden Globes preparations with a selfie that he posted on Instagram. \"Even showered (last night) for this,\" he wrote in the caption. What a gent. Dax Shephard (@daxshepard) 7/23 Melissa McCarty, who was nominated for a Golden Globe for her leading role in 'Can You Ever Forgive Me?', wore a purple, star-studded Reem Acra dress for the award ceremony. She showed her seven million Instagram followers the preparations that she undertook for the big night, which included applying a face mask and receiving help from a dedicated glam squad. Melissa McCarthy (@melissamccarthy) 8/23 Thandie Newton had a team of people to thank for her breathtaking Golden Globes look, which she finished off with a stunning silver cut-out Michael Kors dress. The actor shared a Boomerang on Instagram of the final makeup touches being added, which included a smokey eye and a soft pink lip. Thandie Newton (@thandienewton) 9/23 While the Golden Globes may be a glamorous affair for all the celebrities who attend, the early preparations are frequently decidedly less so. Alex Borstein, who stars in comedy-drama 'The Marvelous Mrs. Maisel', shared a photo on Instagram that showed her having an eye and neck mask applied while simultaneously having her hair curled. The definition of a multitasker. Alex Borstein (@alexborstein) 10/23 Timothée Chalamet may not have won the Golden Globe for his supporting role in drama 'Beautiful Boy', but he was very excited to bring his mother along to the award show. Chalamet posted this picture on his Instagram account, alongside the caption: \"momma!\" The actor wore a custom Louis Vuitton suit designed by menswear artistic director Virgil Abloh for the event. Timothée Chalamet (@tchalamet) 11/23 Jessica Chastain is typically very private about her personal life, choosing to keep her partner Gian Luca Passi de Preposulo and their baby daughter out of the spotlight. While getting ready for the Golden Globes, Chastain shared a photo of her daughter curiously holding a ruby Piaget ring, with the caption: \"You've got good taste, kid.\" Jessica Chastain (@jessicachastain) 12/23 Rachel Brosnahan has become a household Hollywood name thanks to her star-making turn as an aspiring stand-up comedian in 'The Marvelous Mrs. Maisel'. The actor shared a selfie on Instagram with her \"girl gang\" prior to the Golden Globes, for which she wore a floor-length yellow Prada gown. Rachel Brosnahan (@rachelbrosnahan) 13/23 Catherine Zeta-Jones shared a behind-the-scenes glimpse of her Golden Globes preparations, posting a photo on her Instagram story showing her having her hair and makeup done. \"Gold is for Globes,\" she wrote for the caption. Catherine Zeta-Jones (@catherinezetajones) 14/23 Sarah Silverman showed just how well she and ex-partner Jimmy Kimmel still get on by sharing a selfie with the talk show host and his wife, Molly McNearney. Silverman and Kimmel dated for seven years between 2002 and 2009. Sarah Silverman (@sarahkatesilverman) 15/23 Darren Criss epitomised elegance at the Golden Globes with his fiancée, producer Mia Swier. Criss, who won a Golden Globe for his chilling role as killer Andrew Cunanan in 'The Assassination of Gianni Versace', wore a floral Dior tux, and Swier wore a sleek Vera Wang gown. Darren Criss (@darrencriss) 16/23 For her first ever appearance at the Golden Globes, actor and activist Jameela Jamil had a sneaky trick for ensuring she didn't feel the January cold. The star of 'The Good Place' revealed on social media that she wore jeans underneath her pink Monique Lhuillier gown. “An experienced woman wears jeans under her Golden Globes gown because it’s forking COLD,” she wrote in a tweet accompanying the video. Jameela Jamil (@jameelajamilofficial) 17/23 'The Big Bang Theory' actor Kaley Cuoco shared a candid snap on her Instagram account of her walking along a hallway hand in hand with her new husband Karl Cook, whom she married in June 2018. Cuoco wore a navy, black and white strapless Monique Huillier gown for the Golden Globes. Kaley Cuoco (@kaleycuoco) 18/23 While last year's Golden Globes saw numerous stars wear black in solidarity with the Time's Up movement, this year celebrities chose to show their support by wearing bracelets and ribbons with the slogan \"Time's Up X2\" written across them. Julianne Moore shared this photo on her Instagram account, showing her wearing the accessory next to a beautiful Chopard bracelet. Julianne Moore (@juliannemoore) 19/23 Jamie Lee Curtis's stunning Alexander McQueen dress received a lot of praise when the actor appeared on the Golden Globes red carpet. Curtis posted this photo on her Instagram account while taking part in rehearsals for the show. Jamie Lee Curtis (@curtisleejamie) 20/23 'A Star Is Born' didn't win as many Golden Globes as people expected, having been nominated for five accolades. Nonetheless, the film's win for best original song still proved very exciting for Lady Gaga, Mark Ronson, Anthony Rossomando and Andrew Wyatt, all of whom collaborated on the song 'Shallow'. \"We're off the deep end,\" Ronson wrote in an Instagram caption accompanying a selfie of the group. Mark Ronson (@iammarkronson) 21/23 Isla Fisher and Sacha Baron Cohen are known for their playful relationship, so much so that Fisher couldn't help but poke fun at her husband's Golden Globe loss for best actor in a musical or comedy for 'Who is America?' \"My husband WON!... not,\" Fisher cheekily wrote on Instagram. Isla Fisher (@islafisher) 22/23 With rumours rife that Idris Elba may still be in line to take over as James Bond when Daniel Craig decides to step down from the role, the 'Luther' actor fuelled the fire further when he posted this selfie with Craig on his Instagram story. \"Awks...\" he wrote, as Craig gives Elba a defiant stare. Idris Elba (@idriselba) 23/23 One of the highlights of Julia Roberts's night came after the Golden Globes had ended, when she and husband Daniel Moder stopped off for a burger on their way home. \"Fun night w my fella. Congratulations to all! And to all a good (burger) night,\" the actor wrote on Instagram. Julia Roberts (@juliaroberts)\n\nAniston’s second image, however, showed a photograph from the shoot in which Aniston appeared immaculately groomed, posing in the same outfit, tipping her hat as she stared into the camera.\n\nIn the caption, the Friends star riffed off a famous quote from the film Notting Hill, writing: “I’m just a girl....standing with hair and makeup. A stylist. A photographer. A lighting crew, wind machine, props, and a computer .... asking you to think I woke up like this.”\n\nThe post garnered more than five million likes and thousands of comments, including one from Aniston’s ex-husband, actor Justin Theroux, who posted three crying with laughter emojis.\n\nModern Family star Sarah Hyland added: “You’ve already mastered Instagram and I couldn’t be more here for it.”", "description": "Jennifer Aniston has only been on Instagram for a few weeks but is swiftly becoming one of the platform’s most popular users. The actor has already made headlines for “breaking” Instagram after she shared a photograph featuring her Friends co-stars.", "authors": ["Olivia Petter"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/23/09/gettyimages-139121098.jpg", "published_at": "2019-10-23"}