{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7575151/LeBron-James-slammed-hypocrite-calling-Rockets-GM-Daryl-Morey-misinformed-China.html", "downloaded_at": "2019-10-15 14:56:22.557418+00:00", "title": "LeBron James is slammed as a hypocrite for calling Rockets GM Daryl Morey 'misinformed' on China", "language": "en", "text": "Lebron James spoke out for the first time on the NBA's China controversy Monday night, but was quickly criticized for his failure to support pro-democracy protesters in Hong Kong after previously making similar political statements at home in the United States\n\nLeBron James is facing accusations of hypocrisy for characterizing Houston Rockets general manager Daryl Morey as 'misinformed' after the NBA team executive ignited an international dispute between the league and China by tweeting out his support for pro-democracy protesters in Hong Kong last week.\n\nJames previously encouraged athletes to use their platform to affect social change, and has, himself, been a vocal critic of President Donald Trump and a supporter of controversial NFL free agent Colin Kaepernick.\n\nSeveral protesters in Hong Kong posted pictures of James holding oversized Chinese currency, referencing his vast financial interests in China. Other protesters utilized the famous portrait Mao Zedong, replacing the likeness of the deceased communist leader with that of James and posting it on a backboard.\n\nMuch of the criticism directed at James has been on social media.\n\nSCROLL DOWN FOR VIDEO\n\nA protester aligns altered pictures with NBA star LeBron James during a gathering in support of NBA's Houston Rockets' team general manager Daryl Morey, who sent a tweet backing the pro-democracy movement, in Hong Kong, China\n\nSome protesters utilized the famous portrait Mao Zedong, replacing the likeness of the deceased communist leader with that of James and posting it on a backboard\n\nProtesters seized on James's financial interests in China, a very lucrative market for the NBA\n\nA political cartoon in Florida's Pensacola News Journal showed James groveling to Xi Jinping\n\n'By criticizing Daryl Morey on Monday, LeBron James endorsed a world where calling out his own government for wrongdoing is encouraged but China is above reproach,' USA Today columnist Dan Wolken wrote on Twitter. 'It's the most shameful day of his career.'\n\nJames's Los Angeles Lakers and the Brooklyn Nets were thrust into the controversy when the clubs arrived in China last week to play two exhibition games on Thursday and Saturday amidst turmoil after Morey tweeted a graphic reading: 'Fight for Freedom. Stand with Hong Kong.'\n\nThe 34-year-old forward is now being slammed for telling reporters on Monday in Los Angeles that Morey was 'misinformed or not really educated on the situation.'\n\nHe attempted to walk back his comment on Twitter, writing that he did not 'believe there was any consideration [on Morey's part] for the consequences and the ramifications of the tweet.'\n\n'LeBron criticizing Morey for tweeting something and not considering the consequences and then having to tweet to clarify a thing he said without considering the consequences is too good,' wrote the Ringer's John Gonzalez on Twitter.\n\nSeveral critics seized on a Showtime documentary series James produced about athlete activism titled 'Shut Up and Dribble,' which was a criticism directed at him by Fox News's Laura Ingraham.\n\n'Lebron to Daryl Morey: shut up and dribble, or whatever it is you do here,' wrote ESPN radio's Will Cain.\n\nPro Football Talk's managing editor Michael David Smith had a similar sentiment: 'It's mind-boggling that LeBron would actually tell someone else, 'Shut up and (GM equivalent of dribble).'\n\nA protesters gives the finger to James's likeness, which was made to look like the portrait of Mao Zedong that famously hangs over Tienanmen Square in Beijing\n\nTwitter users and pro-democracy protesters in Hong Kong were quick to remind their followers of a 2018 tweet in which James quoted Dr. Martin Luther King Jr.\n\nDaryl Morey tweeted in support of Hong Kong's pro-democracy protests on October 4\n\nJames attempted to walk back his comment, writing that he did not 'believe there was any consideration [on Morey's part] for the consequences and the ramifications of the tweet'\n\nA typical NBA preseason promotional swing through Shanghai and Shenzhen became something else when Daryl Morey (left) tweeted in support of the Hong Kong protesters while the Lakers were in the air on their 13-hour flight to China. NBA commissioner Adam Silver (right) said he regrets Chinese fans are upset, but would not apologize for Morey's tweet\n\nOne critic likened James to a soldier in the Chinese People's Liberation Army\n\nBoston Celtics center Enes Kanter shared his reaction without mentioning James specifically, but rather referencing his own ordeal as political enemy of Turkish President Recep Tayyip Erdogan in his native country.\n\n'Haven’t seen or talked to my family 5 years,' Kanter wrote. 'Jailed my dad; My siblings can’t find jobs; Revoked my passport; International arrest warrant; My family can’t leave the country; Got Death Threats everyday; Got attacked, harassed; Tried to kidnap me in Indonesia.\n\n'FREEDOM IS NOT FREE.'\n\nTwitter users were quick to remind their followers of a 2018 tweet in which James quoted Dr. Martin Luther King Jr.\n\n'Injustice Anywhere Is A Threat To Justice Everywhere,' James wrote. 'Our Lives Begin To End The Day We Become Silent About Things That Matter- #ThankYouMLK50.'\n\nWhile speaking to reporters on Monday, James did acknowledge that Morey is free to say whatever he pleases.\n\n'Yes, we do have freedom of speech,' James said. 'But at times, there are ramifications for the negative that can happen when you're not thinking about others, when you only think about yourself. I don't want to get into a word or sentence feud with Daryl Morey, but I believe he wasn't educated on the situation at hand, and he spoke.'\n\nPerhaps the bigger insult was James's insinuation that Morey was thinking selfishly when he tweeted.\n\n'So many people could have been harmed, not only financially but physically, emotionally, spiritually,' the Lakers star continued.\n\n'So just be careful what we tweet and what we say and what we do. Even though, yes, we do have freedom of speech, it can be a lot of negative that comes with it.'\n\nBoston Celtics center Enes Kanter shared his reaction without mentioning James specifically, but rather referencing his own ordeal as political enemy of Turkish President Recep Tayyip Erdogan in his native country\n\nCritics seized on a Showtime documentary series James produced about athlete activism titled 'Shut Up and Dribble,' which was a criticism directed at him by a Fox News pundit\n\nJames' comments set off swift reaction on social media, with many listeners perceiving his comments as criticism of the democracy movement in Hong Kong.\n\nJames addressed the issue again on Twitter before the Lakers' preseason game against Golden State at the Staples Center.\n\nHe tweeted: 'Let me clear up the confusion. I do not believe there was any consideration for the consequences and ramifications of the tweet. I'm not discussing the substance. Others can talk about that.'\n\nJames may have made another misstep when he added on Twitter: 'My team and this league just went through a difficult week.'\n\nHe was quickly rebuked by attorney Darren Heitner, who has recently been in the news for defending NFL free agent Antonio Brown against accusations of rape and sexual assault.\n\n'Hong Kong is going through much more than a \"difficult week,\"' Heitner wrote.\n\nAs a member of the Cleveland Cavaliers in 2014, James wore an 'I Can't Breathe' shirt (left) during warmups before a game against the Brooklyn Nets - a reference to Eric Garner, who was killed by New York police that year. James also supported controversial NFL free agent Colin Kaepernick, and even wore a black 'Kaepernick' jersey released by Nike earlier this year\n\nMorey's tweet was in support of the protesters fighting a move by China that would allow extraditions from Hong Kong to mainland China.\n\nHuman rights has long been an issue in China well before the former British colony returned to mainland control in 1997.\n\nHong Kong has been rocked since June by protests that were ignited by a now-scrapped plan to officially allow extraditions, but snowballed into a movement calling for more democratic freedoms and police accountability.\n\nWhile speaking with reporters in Los Angeles on Monday, James echoed Golden State Warriors head coach Steve Kerr's response that he wasn't educated enough to comment on the situation himself.\n\n'When I speak about something, I speak about something I am very knowledgeable about, something that hits home for me, something that I am very passionate about,' James said. 'I felt like with this particular situation, it was something that not only was I not informed enough about, I just felt like it was something that not only myself and my teammates or our organization had enough information to even talk about it at that point in time, and we still feel the same way.'\n\nJames's attempts to walk back his original statement were met with more criticism\n\nJames didn't play when the Lakers hosted the Golden State Warriors at Staples Center on Monday night, just two days after they returned home from their bizarre trip to China.\n\nA typical NBA preseason promotional swing through Shanghai and Shenzhen became something else when Morey tweeted in support of the Hong Kong protesters while the Lakers were in the air on their 13-hour flight to China.\n\nThe Lakers landed amid outrage with Morey's since-deleted tweet and the NBA in general. The league and Chinese authorities decided to hold no media availability or community events with the Lakers or the Brooklyn Nets, their opponents.\n\nThe Lakers passed their week in China in public silence. Although the exhibition games weren't canceled, the league claimed it would be unfair to ask players and coaches to speak on the delicate geopolitical argument in which they found themselves involuntarily enmeshed.\n\nDuring his Monday interview, when asked about his thoughts on the political side of the events in China, Lebron James echoed Warriors coach Steve Kerr's (pictured) belief that he wasn't educated enough to comment on the situation\n\nSo the players spent most of the week in hotels or on the court, with two NBA Cares events, a fan event and other public appearances all canceled by the league or the government. Several companies and state-run offices reportedly severed their ties with the NBA over Morey's tweet and the league's response to it.\n\nJames has a lifetime endorsement deal worth tens of millions with Nike, which does a significant amount of business in China.\n\nIn fact, James has made about a dozen trips to China with Nike.\n\nNBA commissioner Adam Silver stressed last week that he regrets Chinese NBA fans are upset, but would not apologize for Morey's tweet.\n\n'I don't come here, either as the commissioner of the NBA or as an American, to tell others how they should run their governments,' Silver said.\n\n'We're not apologizing for Daryl exercising his freedom of expression.'\n\nAs for having NBA telecasts pulled from Chinese television, Silver said, 'It's unfortunate, but if that's the consequences of us adhering to our values, we still feel it's critically important we adhere to those values.'", "description": "LeBron James is facing accusations of hypocrisy for characterizing Houston Rockets general manager Daryl Morey as 'misinformed' over his support for anti-China protesters in Hong Kong.", "authors": ["Alex Raskin Sports News Editor For Dailymail.Com", "Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/15/19744994-0-image-a-56_1571149361013.jpg", "published_at": "2019-10-15"}