{"pub": "guardian", "url": "https://theguardian.com/uk-news/2019/oct/13/lake-district-authority-loses-no-confidence-vote-over-path-decision", "downloaded_at": "2019-10-13 18:28:13.353929+00:00", "title": "Locals accuse Lake District authority of turning region into a 'theme park'", "language": "en", "text": "No confidence vote over move to make path accessible to 4x4s follows proposals for zip wires and cable cars\n\nThe authority responsible for the Lake District has become the focus of angry protest from residents and campaigners over accusations that it has turned the region into a theme park.\n\nKeswick town council passed a historic and unanimous vote of no confidence against the Lake District National Park Authority (LDNPA) over its decision to resurface a path to make it more accessible to vehicles. Keswick represents almost 20% of the population of the Lake District.\n\nThe unprecedented vote in Keswick comes after a series of disagreements between the park authority and local councillors, residents and campaigners, with the latter claiming that commercial interests are being put ahead of the needs of people who live and work in the community.\n\nFive days ago senior leaders at the park authority voted against a ban on recreational off-road vehicles which devastate farm tracks, churning up soil and exposing the bedrock beneath, leaving them impassable to farm traffic.\n\nThe park’s rights of way committee voted to continue to allow 4x4s and trail motorbikes to use two lanes across farmland left to the trust by the author Beatrix Potter.\n\nThe latest dispute focuses on the reinstatement of a foot and cycle path from Keswick to Threlkeld which was destroyed by Storm Desmond in 2015.\n\nFriends of the Lake District claim that using tarmac along the former railway line will compromise the historic and rural character of the route and make it more dangerous to use in icy weather.\n\nLorayne Wall, planning officer for Friends of the Lake District, said the LDNPA granted planning permission to the project, for which it is also the developer, despite clear opposition from local residents and politicians over the choice of surface.\n\n“We are asking for a more natural or natural-looking surfacing, similar in nature to the type of surfacing already used along much of the route and visually more in-keeping with the surroundings,” she added.\n\nThe decision to oppose a ban on off-road vehicles was made despite an online petition of 300,000 signatures and plea’s from the local community, the trust and The International Council on Monuments and Sites (ICMS), which advises Unesco on protecting world heritage sites such as the Lake District.\n\nCouncillor Tony Lywood, who is also a board member of the park authority, said it is pursuing policies that are damaging to the beauty of the area.\n\n“The fact that this largely unelected and unaccountable body can now even consider zip wires over Thirlmere [a plan that was abandoned last year], 4x4s in Little Langdale, gondolas [cable cars] up to Whinlatter and now a scarring four mile long strip of tarmac beneath Blencathra is a deeply concerning.\n\n“As someone said at the Keswick town council meeting, ‘this is the Lake District National Park not the Lake District Theme Park’”, he added.\n\nLywood went on to call for the authority to be democratised with elected members allowing those with senior positions to be held accountable for their actions.\n\nThe vote has no official implications for the authority, but Richard Leafe, the chief executive, said he is deeply disappointed, and insists the decision on how to rebuild the former railway line was taken after full consultation.\n\nIn his blog on the park authority’s website, Leafe, wrote: “We have listened to users from the start of this project and will continue to do so. All of this has led to the successful start of work to rebuild the track, repair and replace damaged bridges and reopen a tunnel.\n\n“It is very disappointing then that we don’t enjoy whole hearted community support. This is a once in a lifetime opportunity to create a route that is truly accessible for all.\n\n“All these issues and more have been debated and carefully considered during the lengthy three-year gestation of the project. Now is not the time to reopen this debate, but to get on, build it and realise the many public benefits it will bring.”", "description": "No confidence vote over move to make path accessible to 4x4s follows proposals for zip wires and cable cars", "authors": ["Nazia Parveen"], "top_image": "https://i.guim.co.uk/img/media/62c5dcd90af6107daa810b473a46cc27b71ceebb/0_24_1300_780/master/1300.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1d667b7d382ee7a48e70972661321824", "published_at": "2019-10-13"}