{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/omnico-and-jos-enter-strategic-partnership-for-asian-market", "downloaded_at": "2019-10-15 09:42:53.515654+00:00", "title": "Omnico and JOS Enter Strategic Partnership for Asian Market", "language": "en", "text": "Global leader in multi-channel commerce solutions partners with regional experts to power Asian expansion\n\nBASINGSTOKE, England — Omnico, the global software platform provider of multi-channel commerce solutions to leading brands in theme parks, resorts, hospitality, retail and casinos, today announced its partnership with JOS – a systems integrator, solutions provider and technology consultancy – the trusted technology partner in Asia.\n\nJOS is now the official reseller for the full suite of Omnico solutions and products, including business and artificial intelligence applications, in China, Malaysia and Singapore.\n\nJOS will use its 60-year heritage in the region’s technology sector to expand the client-base for Omnico’s unique transaction platform and mobile and digital products. These transform understanding of consumer behaviour to provide brands with unrivalled accuracy in the targeting of promotions, offers and loyalty programmes.\n\n“We’re very excited to be partnering with JOS in a market central to our growth strategy,” said Mel Taylor, CEO, Omnico. “This is a region that has seen substantial growth in theme parks, hospitality and larger retail and leisure locations. Our partners at JOS will use their wealth of experience to bring new and existing customers our unique capabilities. We integrate retail, destination and hospitality systems on a single platform which gives our customers unbeatable advantages.”\n\nNelson Chan, Managing Director, JOS China, said: “Our new partnership with Omnico is an exciting development for JOS China. As China being the world’s top retail market in 2019, multinational retailers grow their business by adopting omni-channel retail strategies. Using our expertise and 60 years of experience at the cutting edge of technology, we will power Omnico’s expansion right across the region. We look forward to providing our retail, destination, and hospitality customers full access to Omnico’s unique capabilities.”\n\nOmnico’s platform is used by leading theme parks, casinos, hospitality, catering and retail brands worldwide.\n\nAt its heart the platform is a transaction service that allows consumers to purchase across multiple mobile and digital channels, including tablet, point-of-sale (POS) and Kiosks. Complimenting this is Omnico’s engagement engine that drives consumer loyalty via targeted and personalised promotions.\n\nAll of Omnico’s mobile and digital products, as well as third party apps, can be integrated into the platform, providing brands a joined-up user experience allowing brands to glue together the multitude of systems and consumer facing channels they use.\n\nhttps://omnicogroup.com/our-products/\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191015005508/en/\n\nContacts\n\nAnne Chianalino\n\nWhiteoaks International\n\nannec@whiteoaks.co.uk", "description": "Global leader in multi-channel commerce solutions partners with regional experts to power Asian expansion BASINGSTOKE, England — Omnico, the global software platform provider of multi-channel commerce solutions to leading brands in theme parks, resorts, hospitality, retail and casinos, today...", "authors": [], "top_image": "https://cts.businesswire.com/ct/CT", "published_at": "2019-10-15"}