{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/22/nancy-pelosi-dear-colleague-letter-urges-gop-call-", "downloaded_at": "2019-09-22 23:11:57.089463+00:00", "title": "Pelosi to GOP: Call on intelligence director to 'obey the law'", "language": "en", "text": "House Speaker Nancy Pelosi urged Republicans on Sunday to join her side in calling on Joseph Maguire, the acting director of national intelligence, to “obey the law” and turn over a whistleblower’s complaint regarding President Trump.\n\nShe said the law requires Mr. Maguire to turn over the complaint, so failure to do so would endanger national security and having a chilling effect on future whistleblowers. Mr. Maguire is set to testify before Congress this week.\n\n“We must be sure that the president and his administration are always conducting our national security and foreign policy in the best interest of the American people, not the president’s personal or political interest,” Mrs. Pelosi said in a rare “dear colleague” letter that she sent to both Democrats and Republicans.\n\n“I am calling on Republicans to join us in insisting that the acting DNI obey the law as we seek the truth to protect the American people and our Constitution.”\n\nThe whistleblower complaint reportedly centers on whether Mr. Trump pressed Ukrainian President Volodymyr Zelensky to investigate former Vice President Joseph R. Biden and his son’s business ties in the country.\n\nDemocrats are worried the president used $250 million in pending aid as leverage in seeking dirt on his main Democratic rival, ahead 2020, though Mr. Trump says he did nothing wrong.\n\nMrs. Pelosi hinted at drastic action if the administration continues to stonewall, as fellow Democrats push for impeachment.\n\n“If the administration persists in blocking this whistleblower from disclosing to Congress a serious possible breach of constitutional duties by the president, they will be entering a grave new chapter of lawlessness which will take us into a whole new stage of investigation,” she said.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "House Speaker Nancy Pelosi urged Republicans on Sunday to join her side in calling on Joseph Maguire, the acting director of national intelligence, to \"obey the law\" and turn over a whistleblower's complaint regarding President Trump.", "authors": ["The Washington Times Http", "Tom Howell Jr."], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/19/democrats_impeachment_90377_c0-60-4000-2392_s1770x1032.jpg?1915262d9559512cb987120d1bad32d7e8633b21", "published_at": "2019-09-22"}