{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/nintendos-ring-fit-adventure-tricked-me-into-liking-squats-but-the-calorie-burn-was-lacking", "downloaded_at": "2019-10-30 00:08:50.267929+00:00", "title": "Nintendo's Ring Fit Adventure Tricked Me Into Liking Squats But The Calorie-Burn Was Lacking", "language": "en", "text": "Behold, the Ring-Con. (Photo: Victoria Song, Gizmodo)\n\nAs long as people want to lose weight, there’s always going to be some sort of fitness grift—be it $6,000 treadmills with on-demand classes, a mirror that guides you through workouts, or the army of Peloton knockoff bikes. It’d be fair if your first impulse would be to group Nintendo’s Ring Fit Adventure for the Switch into that pile of dubious, gamified fitness schlock. The Ring-Con looks stupid. Running in place in your living room also looks stupid. If you have an ounce of common sense, you know this thing isn’t going to turn your flabby tum into rock-solid washboard abs. But here’s why you should consider buying it anyway: Ring Fit Adventure makes exercise genuinely fun.\n\nRing Fit Adventure WHAT IS IT? Nintendo's fitness game for the Nintendo Switch PRICE $119.95 LIKE Makes exercise fun! Ring-Con is well-made. Gameplay is solid. NO LIKE Theme can be corny. I've never looked stupider.\n\nOut of the box, you get the game, a thigh holster for your left Joy-Con, and a circular resistance band that holds your right Joy-Con—a Ring-Con if you will. For $119.95, that’s not terrible considering you are getting the Ring-Con, which itself is packed with sensors. The thigh holster is fine—it’s basically a mesh pouch attached to a velcro strap. It does its job, though I found myself having to readjust it from time to time. The Ring-Con is more impressive. While the trailer made it look like it was easy to squeeze and pull, it’s actually more on the challenging side.\n\nBut decent hardware isn’t why you’d want to shell out. The real draw is the gameplay. The best way I can describe Ring Fit Adventure is it reminds me of the pill pocket treats I use to stuff medicine down my dog’s throat. Except, in this case, exercise is the pill and the treat is game itself. The main Ring Fit Adventure game is an RPG-esque “story.” There’s a thicc dragon called Dragaux, who acts as the game’s main boss and as Nintendo told me, represents negative gym culture.\n\nWith the help of an anthropomorphic ring, your job is to chase him through individual worlds. Along the way, you save villagers from...his evil gym bro aura and fight his cute little lackeys—all shaped after different types of gym equipment—with various bodyweight exercises. These little guys are colour-coded to indicate their weaknesses, so there’s even some strategy involved. The blue kettlebell-shaped monster, for example, is weak against leg exercises. Red monsters are vulnerable to arm exercises, yellow ones hate core exercises, while green ones really hate yoga moves. The better your form, the more damage you do.\n\nThe battles are where you feel the real burn. Sure, jogging in place might get your heart rate up, but you can easily cheat that. If you’ve got sensitive neighbours downstairs, for instance, you can opt for a “soft knees” version so you don’t cause quite a racket. But there’s nothing stopping you from using that mode all the time—except maybe shame.\n\nThat said, you can’t fake battles. On average, I found it takes about three sets of various exercises, with 15-20 reps each, to beat a monster. That’s not nothing! A bunch of blue demons is how this game somehow convinced me to do 60 squats in a half-hour of play. While I definitely felt the burn, it was somehow less horrible knowing that the further I pushed my glutes and quadriceps, the more pain I wailed on these little turds. This, coming from a person who fucking hates squats.\n\nDepending on how enthusiastically you jog, and how many reps of an exercise you do, your character levels up. As you run through levels, you can squeeze the Ring-Con to blast doors and crates, or pull to suck up coins and hearts. If you point down and squeeze, you can jump through the air. As the levels progress, the games finds new ways of challenging you.\n\nFor example, it’ll make you do high knees to trudge through puddles and climb up stairs, and some core exercises to paddle a boat. Eventually, you can also collect ingredients to make smoothies—and yes, one of them is kale—that give you boosts in boss battles. For a guy in a purple leotard, that Dragaux fella puts up a pretty tough fight. My first boss battle against him lasted 13 minutes and by the end, I was ready to call it a day.\n\nEach level is pretty short—somewhere in the range of two to ten minutes. That said, this isn’t the sort of game you can binge play. You will get tired. If you’ve got a good amount of stamina, you could probably do about an hour a day. As for me, three or four levels a day (about thirty minutes of play) left me feeling suitably tired and sweaty. The average person would probably feel like they got some good activity in about a half-hour of play.\n\nDon’t wear jeans to play this game. The jeans are for PHOTO PURPOSES only. (Photo: Victoria Song, Gizmodo)\n\nThankfully, you’re not limited to the story mode. If you think the story mode is lame (and it kind of is), you can also just do the exercises themselves. Nintendo has helpfully sorted them by muscle group, and they take the same format as the battles. The difference is instead of doing more damage, correct form and posture will net you more points, which in turn leads to a higher grade. There’s also a series of mini-games.\n\nThey sort of remind me of the Mario Party or WarioWare mini-games in spirit, albeit they’re clearly crafted with the Ring-Con in mind. For instance, the Aerochute game is a parachute game that tricks you into doing overhead presses by squeezing and pulling the Ring-Con over your head, as you bend your body in every which direction. Squattery Wheel makes you do forward presses while squatting in a bid to match pottery shapes on a virtual kiln.\n\nAgain, I hate squatting with the burning fires of a thousand dying suns, but this is my favourite mini-game. I’ve had a mild existential crisis this past week thanks to Ring Fit Adventure because, for some reason, I keep choosing of my own free volition to squat for fun.\n\nThat said, this game will not replace the gym, cardio, or strength training. If you want to lose a few pounds, as in two or three, maybe that’s possible. And that’s if you do it consistently and combine that with some healthy eating. I went on an easy 20-minute interval run over the weekend which according to my Apple Watch burned about 222 calories. I then spent 20 minutes playing two levels on Ring Fit Adventure.\n\nThat logged 132 calories via the Apple Watch. That said, if you compare my heart rate for both exercises, my run kept me at a pretty steady rate of about 170 beats per minute. The chart for Ring Fit Adventure wildly fluctuated, as there were plenty of times where I was just navigating between menus. In total, I got about an average of 122 bpm.\n\nYou can get a heart rate reading by putting your thumb over the Joy-Con’s IR sensor. (Photo: Victoria Song, Gizmodo)\n\nSpeaking of which, you shouldn’t rely on any of the stats the game spits your way. It acknowledges that with a disclaimer, but jogging in place—regardless of how furiously you jog—does not afford you the same cardio benefits as running on a treadmill or outside. That should be common sense, but it bears reminding.\n\nThat said, the Joy-Con’s IR sensor does a decent job of spot-reading your heart rate. I tested it against the Polar H10 chest strap and the Apple Watch Series 5 and it wasn’t terribly far off the mark—the difference was usually within 5 bpm of the Watch and 10 bpm of the chest strap. The problem is you’re only spot-checking at the end of each level, so it’s not exactly painting an accurate picture of your workout.\n\nI could see the game leaving you with some bad habits, however. It’s helpful that there’s an on-screen, Wii Fit instructor-looking fella named Tipp to guide you through the activities. But I just don’t think the thigh holster and Ring-Con are accurate enough to really analyse how accurately you’re performing each exercise.\n\nIt can tell that yes, maybe I didn’t bend deep enough on that last squat, but it also said I was doing chest-to-knee exercises well. Let me tell you, I know I wasn’t because my tiny studio apartment’s faux living room space is not big enough to actually do that exercise properly. That’s where a real-life trainer or gym buddy is invaluable.\n\nBehold, the Ring-Con. (Photo: Victoria Song, Gizmodo)\n\nHonestly, this game works best as a supplementary form of activity. I absolutely hate pilates, bodyweight exercises, and any form of strength training. I could save a ton of money on classes if I just had the wherewithal to drag myself down to my apartment building’s gym, suck it up, and pump some iron. But I can’t. A week ago I would’ve told you the only way you could get me to do 100 squats is the 60-minutes of weekly self-torture I call a boxing class. And yet, this past week I did over 100 squats for a video game.\n\nThat’s part of the magic. For some reason, exercise for adults is painted as work—something to be slogged through for the vague promise of a bangin’ bod (or more realistically, better health). But Ring Fit Adventure captures some of that youthful fun that comes with playing schoolyard games. There’s no pressure to be good, hot, or better than anyone else. You just enjoy being stupid for a half-hour. In this cold and cruel 2019, I could think of worse ways to spend $119.95.\n\nREADME", "description": "As long as people want to lose weight, there’s always going to be some sort of fitness grift—be it $6,000 treadmills with on-demand classes, a mirror that guides you through workouts, or the army of Peloton knockoff bikes. It’d be fair if your first impulse would be to group Nintendo’s Ring Fit Adventure for...", "authors": ["Nathan Grayson", "Jason Schreier"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/pttqk2wsoghopbbeuhsy.jpg", "published_at": "2019-10-30"}