{"pub": "news24", "url": "https://parent24.com/Family/Date-night/can-date-night-really-save-your-marriage-20191017", "downloaded_at": "2019-10-17 11:36:06.925374+00:00", "title": "Can date night really save your marriage?", "language": "en", "text": "Can date night really save your marriage?\n\nCaught up in the day to day grind of work and home, errands and commitments, commuting and cooking, it's easy to let time go by and one day find yourself waking up next to a stranger.\n\nI can't remember when I first heard of the concept of 'date night', but I remember thinking it was a silly idea.\n\nSeveral years of marriage and two kids later, I see it very differently.\n\nIf you've ever tried to have a serious conversation in the same room as two small children, you'll know how impossible it can be. It's as it they are tuned in to the gravity of the topic, and the more important it is the louder and more demanding they become.\n\nUntil one day you and your spouse find yourselves barking commands or shouting snippets of crucial information at each other, and a calm considered conversation seems impossible.\n\nCaught up in the day to day grind of work and home, errands and commitments, commuting and cooking, it's easy to let time go by and one day find yourself waking up next to a stranger.\n\nThis may sound overly dramatic, but I know many parents can relate.\n\nSo this is where date night comes in.\n\nAnd sure, even thinking about finding the time, finding a babysitter, deciding what to do and then actually having an adult civilised conversation about anything other than the family is, well... exhausting.\n\nBut it is necessary\n\nYou don't need to be a couple's therapist to know that time together, without the kids and without distraction of friends and family, will enhance your friendship and improve your emotional connectedness.\n\nThis serves to make you a stronger team, and raising a family together takes a a level of teamwork that puts any of our national sports teams to shame.\n\nAnd what to do?\n\nDo what suits you. When my husband and I went on our first date night, we had dinner and a drink and found ourselves on our way home at 8pm. Two full hours earlier than we'd booked the babysitter for.\n\nSo we took a detour and did our weekly grocery shopping at a late-night Pick'nPay. Romantic? Not really. Fun? Oh yes!\n\nOver the next few dates we realised we ran too many errands or only talked about the kids, so we started going to a movie instead.\n\nA couple of hours of mindless distraction later, we could turn to each other refreshed, and chat about lighter topics than whether or not we should have a third baby, or immigrate, or change jobs, or renovate the bathroom.\n\nNow, when we can get away we go for a walk, grab a coffee, see a movie... and we try to make it an event that we can't do with kids.\n\nWe recently went to the The Galileo Open Air Cinema, and watched A Star is Born under the night sky. We laughed and cried together, nibbled on some popcorn and didn't once mention the threat of rising damp or load shedding.\n\nThe carpool karaoke on the drive home scared the owls from the trees, but we had a lot of fun.\n\nHow often?\n\nWhen you add the cost of a meal and a movie to the expense of a babysitter, it starts adding up quickly.\n\nIn 2016 Drum reported that researchers found that married couples where 14% less likely to split up if they went on regular date nights.\n\nLucky for most, just one date night a month was enough, researchers at the Marriage Foundation revealed, adding that weekly dates didn't improve these odds.\n\nSo you don't have to go often, and you don't have to spend a fortune.\n\nFor context, too: a session with a marriage counselor can cost around R800 for an hour. And while incredibly valuable, there are more fun ways to spend that money.\n\nLook here date ideas for every kind of parent, from adventure-packed to staying in. And there's nothing wrong with a date night at home, just make sure that's the focus of the evening and don't let the dishes or un-mowed lawn distract you.\n\nCan date night really save your marriage though?\n\nI don't have all the answers, but time alone together is crucial to meaningful communication, in my experience, and making the time for this will make your marriage stronger.\n\nHave you found date night to be a critical part of your relationship after children? Share you story with us!\n\nChat back:\n\nShare your experience with us, and we could publish your mail. Anonymous contributions are welcome.", "description": "Caught up in the day to day grind of work and home, errands and commitments, commuting and cooking, it's easy to let time go by and one day find yourself waking up next to a stranger.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7801/329f994d39134f9099d7c08ad9e8f0e0.jpg", "published_at": "2019-10-17"}