{"pub": "dailybeast", "url": "https://thedailybeast.com/after-halle-synagogue-shooting-do-germans-know-a-hate-crime-when-they-see-it-2", "downloaded_at": "2019-10-19 19:04:14.206297+00:00", "title": "Do Germans Know a Hate Crime When They See It?", "language": "en", "text": "FRANKFURT—Slowly, many would say too slowly, Germany is waking up to the threat of far right terrorism. How could it not after a gunman attacked a synagogue in the eastern city of Halle on Yom Kippur, the holiest day in the Jewish calendar? Unable to enter, he killed a woman on the street and a man in a kebab shop.\n\nThe shooter’s “manifesto” was a typical anti-Semitic screed, but his mother’s words, in their way, were more chilling. She told the German magazine Der Spiegel that her son “didn’t have anything against Jews in that sense. He had something against the people who stand behind financial power.”\n\nUnfortunately, such parsing of definitions is not unique to the moms of murderers. Violent hate crimes that stop short of fatalities occur on an almost daily basis in this country, but are rarely reported or prosecuted.\n\nIn the past week alone, three right-wing extremists walked through the streets of Doebeln wearing orange jackets that said “Safe Zone,” chanting far right slogans and claiming to hunt “foreigners.” Right-wing extremist strategy is to make out that a “foreign threat,” that is, immigrants, has made streets unsafe, and that the German state has lost control of order, so it’s up to quasi-nazis to defend the streets and their country. Thus the “safe zone” reference.\n\nIn Mannheim, a 62-year-old man was arrested after shouting racist abuse at people on the train. (He was first told to leave because he didn’t have a ticket.) In Halle, someone uploaded a video of a man on the bus slurring abuse and talking about “gassing” people.\n\nA few hours after the terror attack in Halle, police in the western city of Bonn reported that shots were fired through the window of an immigrant asylum home. The suspects drove off.\n\nFor the far right, such attacks small and large serve to instill fear in the targeted group, to drive a wedge between that group and the rest of society and thus fuel the extremists’ prophesied “war of cultures,” as Matthias Quent writes in his book Deutschland Rechts Aussen , or “The German Far Right.” And by failing to provide victims of hate crimes with justice, or declining to acknowledge that they are what they are, Germany’s democratic institutions perpetuate these aims.\n\nIn the aftermath of Halle, some measures have been announced. At a press conference, German Interior Minister Horst Seehofer said security measures at synagogues across the country would be improved.\n\nBut the government’s anti-Semitism commissioner, Felix Klein, thinks that’s not enough. Speaking on ZDF television the day after the attack, he demanded that judges be allowed to recognize and give tougher sentences to anti-Semitic hate crimes. Right now the relevant law speaks of “contemptuous” motives.\n\n“ The attack began with a man wearing a shirt emblazoned with the image of Horst Wessel, a Nazi shot in 1930 and portrayed as a martyr by Josef Goebbels. ”\n\n“I have not had one case where anti-Semitism was clearly named as the motive for a crime,” says Christina Büttner from “ezra,” an organization in Thuringia, where victims of violent hate crimes can get counselling and legal advice.\n\nThuringia is an eastern German state and home to the far-right AfD, Alternative für Deutschland, hardliner Bjoern Hoecke, who has called the Holocaust memorial in Berlin a “monument of shame” and said that schools should highlight German suffering in World War Two\n\nIn 2014, a group of right-wing extremists beat up six people at an art exhibition in Erfurt, a city in Thuringia. The attack began with a man wearing a shirt emblazoned with the image of Horst Wessel, a Nazi shot in 1930 and portrayed as a martyr by Josef Goebbels. That man started making anti-Semitic slurs to visitors before he was joined by seven other men who shouted “ Sieg Heil. ” At their court hearing, the consensus appeared to be that the offenders were “drunk and looking for a fight,” says Büttner. The anti-Semitic slurs were “brushed aside.” The fact that one of them had the face of an SS officer tattooed on his calf was only added to the case file after he appeared at proceedings in short pants.\n\n“There are education gaps about anti-Semitism among officials, state prosecutors and judges,” says Büttner. “One cannot assume that highly educated people in Germany know what anti-Semitism is.”\n\nAccording to official figures, such as they are, anti-Semitic and racist hate crimes—including online hate speech and the use of Nazi symbols—increased almost 20 percent in Germany last year. In most cases, the offender was judged to have a far right background. Büttner says her organization has dealt with one case where the offender had a Muslim background, but when it comes to violent anti-Semitic attacks, right-wing extremists “are in the majority.”\n\nWhen confronted with the case of a person who may have been a victim of a violent hate crime, the police in the state of Saxony-Anhalt, where Halle is located, have been told to refer victims to independent advisory services like ezra. The legal advice of these NGOs can be useful, for example, if police refuse to provide a translator to a victim who doesn’t speak German.\n\n“In Halle, this works very well,” says a counselor for the organization Mobile Operberatung. “But in other parts of the state, it may be that the police don’t recognize the cases or that they don’t know what they are supposed to do.”\n\nIndependent advisory services for hate crimes—mostly present in eastern Germany—record a much higher number of violent attacks than the authorities. Last year, they estimated that an average number of five people a day were attacked.\n\n“ Last year, they estimated that an average number of five people a day were attacked. ”\n\nEven more hate crimes go completely unrecorded. “Our statistics are the tip of the iceberg,” Büttner says.\n\nIn Germany, the individual police officer asked to register an assault decides whether it is a hate crime or not. Judith Porath, who counsels victims of violent hate crimes in the eastern state of Brandenburg, says that the people who come to her center often decide not to go to the police. Some worry about revenge. Others distrust the authorities. “People feel that they are not being believed, that they are being treated as the offenders,” she says.\n\nSometimes, a person who is targeted repeatedly by hate crimes will think there is no point in going to the police if they are still waiting for the legal proceedings against a different assailant from three years ago. One reason that proceedings are so slow is that there is a significant shortage of judges and state prosecutors in Germany.\n\nIn cases of far right violence, according to Porath, a common strategy that her organization has encountered is for gangs to first ambush a person who is alone, then accuse that person of assault. The culprits can back each other up in court. If the victim has no witnesses, the case either is dropped or the victim ends up being charged.\n\nThe fact that there are more hate crimes could be interpreted by the organized extremist movement as a sign the population is “leaning toward their ideology” and shares their definition of “enemies,” Daniel Koehler, director of the Institute on Radicalization and De-Radicalization Studies, tells The Daily Beast.\n\nThere are some signs that the German law enforcement’s sensitivity may be improving. In the ZDF interview, Felix Klein said that one reason the number of officially recorded anti-Semitic hate crimes last year increased was because more people are now going to the police.\n\nIn Halle, the number of violent attacks recorded by the Mobile Operberatung actually decreased in the past year. But in the neighboring state of Saxony, NGOs recorded a 38 percent increase in violent attacks—not least because of a series of assaults fuelled by the racist riots in Chemnitz last August.\n\nIn the wake of those riots, four restaurants were attacked, including the Jewish restaurant Shalom and the Persian restaurant Safran. These properties were destroyed, swastikas were painted on the glass and one owner was in the hospital for eight days. The state police took over the cases, citing the likelihood of a xenophobic motive. No suspects were found.\n\n“To some extent, the affected did not feel like they were being taken seriously,” says Anna Pöhl, a counselor for victims of hate crimes in Chemnitz. This was in part because of the manner in which police investigated the attacks, for example by checking for ties to organized crime or asking whether the offenders had perhaps been shouting something in Arabic or Russian–this after being told that they’d given a Hitler salute and shouted “Sieg Heil.”\n\nThis September, the far right Alternative für Deutschland party became the second strongest party in Saxony and Brandenburg. Now, Judith Porath says “The AfD tries to discredit us, they are constantly making inquiries about us.” Other political parties have defended the NGO, she said, so far.", "description": "The Yom Kippur attack on a synagogue raised alarms, but the rot of far-right anti-Semitism continues to spread. One reason: authorities won’t call it by its name.", "authors": ["Josephine Huetlin"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1571509396/191019-huetlin-germany-anti-semitism-hero_pyi3kh", "published_at": "2019-10-19"}