{"pub": "theverge", "url": "https://theverge.com/2019/9/27/20885882/how-to-chromebook-save-retrieve-files-chromeos", "downloaded_at": "2019-10-05 14:21:46.869652+00:00", "title": "Chrome OS 101: How to save and retrieve files", "language": "en", "text": "About three years ago, I was shopping for a Chromebook to take on a business trip — I wanted something lightweight enough to carry around all day and inexpensive enough that I wouldn’t mind as much when I spilled coffee on the keyboard. I was considering two different models when a sales rep came over to see if I needed help. “You’re aware,” he said, “that these are Chromebooks, right? They only work online; you can’t save any files to the hard drive.”\n\nIt wasn’t the first time I’ve caught a sales rep in a mistake, of course. But this is a mistake that seems to have persisted.\n\nYes, Chromebooks were created to be used predominantly online — in fact, when the first Chrome OS laptops were introduced in 2011, there were very few apps that could be used offline, which was a major flaw. But that was then, and this is now.\n\nRelated The best Chromebook you can buy right now\n\nCurrently, apps such as Google Docs and Sheets (which are the basic apps for Chrome OS) can be used both online and off. In addition, you can save files locally to the laptop’s SSD or, with some models, an SD memory card.\n\nIf you’ve just bought your first Chromebook, or are considering one, here are the basics of how to save your files on your Chromebook and find them again.\n\nSave your files\n\nSaving a file in a Chromebook is pretty much like saving a file in macOS or Windows. You can save a file in one of two ways:\n\nPress Ctrl + S, or\n\nRight-click on the image or file you want to save and select “Save as...”\n\nEither way, you’ll bring up the Files app (the equivalent of the Mac’s Finder or Window’s File Explorer). Select which folder you want to save your file in from the listing on the left, and then click on the Save button in the bottom right corner. (If you want to change the name of the file, you can do that in the field to the left of the Save button.) You can also save and retrieve files from Google Drive from here.\n\nThe Files app comes preloaded with a Downloads folder, but you can easily create your own folders by clicking on the New Folder button on the bottom left corner.\n\nFind your files\n\nTo find your saved files, here’s what you do:\n\nClick on the Launcher button in the bottom left corner of the screen.\n\nAn apps window will emerge from the bottom of the screen. If you’ve used the Files app recently, it will be listed just below the search field with other recently used apps. Click on it.\n\nOtherwise, click on the “up” arrow just above the search field to see all the apps in your Chromebook, and click on the Files app.\n\nThe Files app also automatically organizes your files into Recent, Audio, Images, and Videos folders to make those types of files easier to find.\n\nKeep in mind that while you can save a reasonable number of files, most Chromebooks come with a relatively small amount of storage — you can probably expect either 32GB or 64GB, unless you’re going for a premium device such as Google’s Pixelbook. So you won’t have the same capacity as you would on a typical Mac or Windows system. But you’re not limited to working online, either.", "description": "If you’ve just bought your first Chromebook, or are considering one, here are the basics of how to save your files on your Chromebook and find them again.", "authors": ["Barbara Krasnoff", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/B897vRMsnrZCf_FUArLqLPFpTkU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/6701351/using1_2040.0.jpg", "published_at": "2019-09-27"}