{"pub": "cbc", "url": "https://cbc.ca/news/technology/nobel-prize-physics-1.5312955", "downloaded_at": "2019-10-08 10:25:50.234882+00:00", "title": "Manitoba-born James Peebles among this year's winners of Nobel Prize for Physics | CBC News", "language": "en", "text": "The 2019 Nobel Prize in Physics has been awarded to Manitoba-born James Peebles \"for theoretical discoveries in physical cosmology\" and to Michel Mayor and Didier Queloz \"for the discovery of an exoplanet orbiting a solar-type star.\"\n\nThe Nobel Prize's official Twitter feed said Peebles \"took on the cosmos, with its billions of galaxies and galaxy clusters. His theoretical framework, developed over two decades, is the foundation of our modern understanding of the universe's history, from the Big Bang to the present day.\"\n\nPeebles was born in Winnipeg in 1935 and did his undergraduate studies at the University of Manitoba. He earned a PhD from Princeton University in Princeton, N.J., in 1962.\n\nPeebles won half the $1.2 million Cdn prize, while Mayor and Queloz jointly won the other half.\n\n2019 <a href=\"https://twitter.com/hashtag/NobelPrize?src=hash&ref_src=twsrc%5Etfw\">#NobelPrize</a> laureate James Peebles took on the cosmos, with its billions of galaxies and galaxy clusters. His theoretical framework, developed over two decades, is the foundation of our modern understanding of the universe’s history, from the Big Bang to the present day. <a href=\"https://t.co/fly4alndv9\">pic.twitter.com/fly4alndv9</a> —@NobelPrize\n\nThe prize also comes with a gold medal and a diploma. The laureates receive them at an elegant ceremony in Stockholm, Sweden, on Dec. 10, the anniversary of the death of prize founder Alfred Nobel in 1896, together with five other Nobel winners. The sixth one, the peace prize, is handed out in Oslo, Norway, on the same day.\n\nThis was the 113th Nobel Prize in Physics awarded since 1901, of which 47 awards have been given to a single laureate. Only three women have been awarded it so far: Marie Curie in 1903, Maria Goeppert-Mayer in 1963 and Donna Strickland in 2018, according to the Nobel website.\n\nOn Monday, Americans William G. Kaelin Jr. and Gregg L. Semenza and Britain's Peter J. Ratcliffe won the Nobel prize for Physiology or Medicine, for discovering details of how the body's cells sense and react to low oxygen levels, providing a foothold for developing new treatments for anemia, cancer and other diseases.\n\nNobel, a Swedish industrialist and the inventor of dynamite, decided the physics, chemistry, medicine and literature prizes should be awarded in Stockholm, and the peace prize in Oslo.\n\nThe Nobel Prize for Chemistry will be announced Wednesday, two Literature Prizes will be awarded on Thursday, and the Peace Prize comes Friday. This year will see two literature Prizes handed out because the one last year was suspended after a scandal rocked the Swedish Academy", "description": "The 2019 Nobel Prize in Physics has been awarded to Manitoba-born James Peebles “for theoretical discoveries in physical cosmology” and to Michel Mayor and Didier Queloz “for the discovery of an exoplanet orbiting a solar-type star.”", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5312969.1570529458!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/nobel-prize-physics.jpg", "published_at": "2019-10-08"}