{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7573853/Roxy-Jacenko-wears-1100-pink-heels-amid-search-apprehend-mystery-poo-jogger.html", "downloaded_at": "2019-10-15 08:06:21.388548+00:00", "title": "Roxy Jacenko wears $1100 pink heels amid her search to apprehend the mystery poo jogger", "language": "en", "text": "PR mogul Roxy Jacenko is on the hunt for a mystery female jogger she caught on CCTV defecating around her office in Sydney's Paddington.\n\nAnd on Tuesday, Roxy decided to treat herself to a pair of designer heels by Rochas Paris amid the drama.\n\nFlaunting the $1100 pink heels on Instagram, her fans couldn't help but make one considerate suggestion, with one writing: 'Watch your step!'\n\nWatch your step when leaving the office! Roxy Jacenko decided to treat herself to a fresh pair of $1100 Rochas pink heels amid her search to apprehend the mystery poo jogger, who has been defecating around her office building in Padddington, Sydney\n\n'After today’s commotion I needed something to smile about! How cute are these newbies from @cosmopolitan_shoes @rochasofficial,' Roxy captioned the photo.\n\nThe point-toe heels feature crystal embellishments in the shape of an 'R'.\n\nOn Monday, Roxy shared shocking videos showing a female jogger defecating outside her Sweaty Betty PR Sydney office in broad daylight.\n\nSeparate videos show the jogger defecating in public during her early morning run last Thursday, and again just after 6am on Monday morning.\n\nPICTURED: On Monday, Roxy shared shocking videos showing a female jogger defecating outside her Sweaty Betty PR Sydney office in broad daylight\n\nFurious with the young woman's behaviour, Roxy told Daily Mail Australia she has found faeces on the street for three weeks.\n\nShe said: 'It's disgusting, it's a lovely street lined with heritage terraces, kids playing and riding their bikes. Human faeces shouldn't be on any street. Something needs to be done.'\n\nRoxy also confirmed to KIIS FM on Tuesday that police are investigating the matter, saying: 'We have been sent info which will be passed to the police.'\n\nThe search for the mystery poo jogger would certainly make for a compelling storyline on her reality TV show I Am Roxy, if it gets renewed for a full season.\n\nPerfect storyline: The search for the mystery poo jogger would certainly make for a compelling storyline on her reality TV show I Am Roxy, if it gets renewed for a full season\n\nI Am Roxy debuted during Channel 10's Pilot Week in September to successful ratings.\n\nSome supporters labelled it 'Australia's answer to Keeping Up with the Kardashians', while others savagely claimed the show was proof 'money can't buy class'.\n\nIt's believed the network will announce whether the show will be given its own season in the coming months.", "description": "PR mogul Roxy Jacenko is on the hunt for a mystery female jogger she caught on CCTV defecating around her office in Sydney's Paddington.", "authors": ["Candice Jackson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/07/19727080-0-image-a-55_1571122302919.jpg", "published_at": "2019-10-15"}