{"pub": "bbc", "url": "https://bbc.co.uk/news/world-middle-east-50181212", "downloaded_at": "2019-10-26 02:27:13.865995+00:00", "title": "Iraq protests: 40 dead as mass unrest descends into violence", "language": "en", "text": "Media playback is unsupported on your device Media caption Protesters cover their faces to shield themselves from tear gas in Baghdad\n\nAt least 40 people have died in Iraq during a fresh wave of anti-government protests that descended into violence.\n\nTwo of the dead were reportedly hit by tear gas canisters fired by security forces in the capital Baghdad.\n\nReports say half of the victims were killed while trying to storm the offices of militia groups and the government.\n\nProtesters are demanding more jobs, better public services and an end to corruption.\n\nAbout 2,000 people were wounded in protests across the country, AFP quoted a security source as saying.\n\nSimilar protests earlier this month were brutally put down by security forces, leaving nearly 150 people dead.\n\nA government report has acknowledged that authorities used excessive force in quelling that unrest.\n\nAhead of the latest protests, Iraq's leading clerics and the United Nations issued calls for restraint.\n\nA day earlier Prime Minister Adel Abdul Mahdi, who took office a year ago on Friday, warned protesters that violence would not be tolerated.\n\nHe has promised a cabinet reshuffle and a package of reforms to address protesters' demands but many remain unconvinced.\n\nWhat's the latest?\n\nHundreds of protesters gathered in Baghdad's Tahrir Square on Friday morning.\n\nWhen some tried to enter the Green Zone, where government buildings are based, security forces used tear gas to drive them back.\n\nImage copyright Reuters Image caption Iraqi security forces blocked protesters as they tried to reach government buildings\n\nImage copyright AFP Image caption Demonstrators ran for cover as police fired tear gas\n\nPolice and medical sources told Reuters news agency that two demonstrators had died in Baghdad after being struck by tear gas canisters.\n\nPictures from Baghdad show at least one person, apparently hit by a canister, lying motionless on the street.\n\nTwelve died while setting fire to the headquarters of a paramilitary force in the southern city of Diwaniyah, security sources told AFP.\n\nThere is no official confirmation of the figures. The Iraqi interior ministry said 68 members of the security forces were injured across the country.\n\nImage copyright Reuters Image caption Demonstrators disperse as Iraqi security forces use tear gas in Baghdad\n\nImage copyright Getty Images Image caption Iraqi protesters burn items to block a road during clashes with security forces\n\nThe government's handling of the protests this month has fuelled discontent across Iraq, with political leaders facing calls to resign.\n\n\"We're not hungry, we want dignity,\" shouted one marcher. Another said that Iraq's politicians had \"monopolised all the resources\".\n\nProtesters have called on the Shia-led government to overhaul Iraq's sectarian political system, in which power is shared along religious and ethnic lines.\n\nElsewhere, as unrest spread through Iraq's southern cities:\n\nAbout 3,000 protesters broke into a government building in Dhi Qar province\n\nGuards protecting a Shia militia group's offices in Maysan province opened fire, wounding at least six\n\nProtesters set fire to a Shia political party's offices in Muthanna province\n\nA curfew was imposed in several southern provinces\n\nImage copyright Getty Images Image caption Anti-government protesters march through flood waters in the city of Najaf\n\nWhat's the background?\n\nThe protests started in Baghdad on 1 October. Most of those taking part were young and unemployed.\n\nAfter security forces used live ammunition against demonstrators, the unrest escalated and spread to other cities and towns.\n\nMedia playback is unsupported on your device Media caption Video from early October shows protesters fleeing from Iraqi security forces\n\nA government committee that was tasked with investigating the violence said 149 civilians and eight security personnel had been killed in protests between 1 and 6 October.\n\nThe committee concluded that \"officers and commanders lost control over their forces during the protests\" and that this \"caused chaos\".", "description": "Half of the 40 victims reportedly died trying to storm government and militia offices.", "authors": [], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p07s2h8v.jpg", "published_at": "2019-10-25"}