{"pub": "afr", "url": "https://afr.com/policy/health-and-education/online-courses-are-filling-in-the-education-gaps-20191016-p531do", "downloaded_at": "2019-10-28 00:30:55.729991+00:00", "title": "Online courses are filling in the education gaps", "language": "en", "text": "Short online self-education videos and modules can substitute for work-related training courses. They offer targeted and quick increases in knowledge. Work-related training courses are suffering from sharing this market.\n\nAccording to Australian Bureau of Statistics figures on work-related training courses, in 2013, 37 per cent of employees had taken such a course in the last 12 months. By 2017, that proportion had fallen to 30 per cent.\n\nThe ABS survey asks respondents about ‘courses’ so it misses less structured learning. But another of its questions supports the conclusion that more educational needs are being met despite fewer course enrolments. The proportion of employees wanting to take more courses than they had declined by four percentage points, to 12 per cent, between 2013 and 2017.\n\nIn each year’s survey, a lack of time was the most common explanation for not taking a work-related training course, with financial reasons the second most frequently given reason. As online self-education resources are mostly short and usually free or cheap, they help satisfy previously unmet demand.\n\nQualification-awarding courses should be more protected from online self-education than work-related training. Certificates, diploma and degree qualifications offer significant advantages over informal self-education for people planning to start, change or significantly advance their careers.\n\nAward courses offer structured content across related topics, personal assistance, assessment and a well-understood credential. These qualifications give employers evidence that a job applicant has the required bundle of knowledge and skills. For job applicants, it’s hard to prove what they learned from watching instructional videos.\n\nAlthough online self-education and traditional qualifications mostly serve different markets, online self-education may be taking market share.\n\nAdvertisement\n\nLike many commentators, I had put falling vocational education enrolments down to funding cuts, policy chaos, and reputational damage. But the decline is so widespread that it raises the possibility that while all these factors have taken their toll, something else is going on as well.\n\nWorkers who can demonstrate their skills to their current employer are shifting to online self-education. — Andrew Norton\n\nFor people who already have jobs, student numbers are down over recent years in every field of education and every qualification level.\n\nA National Centre for Vocational Education Research survey asks government-funded vocational students about their reasons for study. Enrolments by people giving reasons related to their current job have fallen much more than from people trying to change jobs or careers.\n\nThis supports the theory that workers who can directly demonstrate their skills to their current employer are shifting to online self-education, while people hoping for a different job still see value in credentials.\n\nHigher education is less exposed than vocational or work-related training courses to the quick skill upgrade market. University courses are better suited to people wanting a career change. But there is evidence that higher education is feeling the broader trends in skills development.\n\nDomestic postgraduate commencing enrolments have declined since their 2014 peak. Business and education courses are leading the fall. Business-related subjects are very common on the online self-education platforms.\n\nOnly health and IT postgraduate commencements are above their 2014 levels and showing year-on-year growth.\n\nAdvertisement\n\nUniversity leaders understand that career education is changing. Some are investing in micro-credentials to target time-poor prospective students. Micro-credentials are an idea worth exploring, as university brands are valuable commodities.\n\nBut micro-credentials are in a tough part of the market. They are vulnerable to shorter and cheaper online self-education in the market for quick skills development, and to longer, more comprehensive and better-recognised qualifications in the market for third-party authenticated education.\n\nThe early-decade pundits exaggerated the threat to universities from online education. But short and cheap skill development is what many current workers prefer, and they are finding it through online self-education.\n\nAndrew Norton is an honorary fellow at the Centre for the Study of Higher Education at Melbourne University. Twitter: @andrewjnorton", "description": "Short online courses boost work skills but qualifications are needed to change jobs.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_522%2C$y_354/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/58817faf68105e4732a0624706cf352c2d65bdc7", "published_at": "2019-10-16"}