{"pub": "businessinsider", "url": "https://businessinsider.com/deandre-hopkins-nfl-texans-owner-bob-mcnair-comments-slave-kaepernick-2019-9", "downloaded_at": "2019-09-04 00:34:50.446046+00:00", "title": "DeAndre Hopkins said former Texans owner Bob McNair's 'inmates running the prison' comments made him feel 'like I'm a slave again'", "language": "en", "published_at": "2019-09-03", "text": "Houston Texans wide receiver DeAndre Hopkins said he nearly sat out a game during the 2017 season when former team owner Bob McNair compared players kneeling to \"inmates running the prison.\"\n\nMcNair made the comment during a meeting between NFL owners in a \"special privileged session,\" during which the topic of protests was raised, according to ESPN.\n\n\"It feels like I'm a slave again,\" Hopkins told GQ in an interview published on Tuesday. \"Getting ran over. Listen to the master, go to work.\"\n\nHopkins said his initial reaction was to go home and miss practice. He almost sat out the Texans' Week 8 matchup against the Seattle Seahawks in protest.\n\n\"Hell yeah, I was about to sit out the game,\" Hopkins said. \"[My teammates] tried calling me, but I wasn't going back. Hell no.\n\n\"It's hard for people to understand what that means when your family was slaves. You can't relate to something like that if your great-uncle's not telling you stories about their parents or their grandparents and what they went through. Not even too long ago, people couldn't even drink out of the same water faucet. Not even 100 years ago.\"\n\nIt was his teammates that convinced him to play in Seattle, and they continued to kneel during the national anthem.\n\nWhile he was upset with McNair's words, Hopkins told GQ that he \"took into consideration that [McNair] was older.\"\n\nMcNair died in November.\n\n\"He was a good man, but some people they don't really … When you grow up certain places, you talk a certain way,\" Hopkins said.\n\n\"I try to take into consideration that he's done a lot of good for black people, so s---, you can't take nothing away from that.\"", "description": "DeAndre Hopkins said he nearly sat out Week 8 of the 2017 season when Bob McNair compared players kneeling to \"inmates running the prison.\"", "authors": ["Alexandra Licata"], "top_image": "https://amp.businessinsider.com/images/5d6ec1fa2e22af2907261508-1920-960.jpg"}