{"pub": "metro", "url": "https://metro.co.uk/2019/10/23/unai-emery-reveals-arsenal-wanted-sign-liverpool-star-fabinho-10973155", "downloaded_at": "2019-10-24 02:28:36.734394+00:00", "title": "Unai Emery reveals Arsenal failed in bid to sign Liverpool star Fabinho", "language": "en", "text": "Fabinho joined Liverpool in 2018 (Picture: Getty)\n\nArsenal boss Unai Emery has revealed the club wanted to sign Liverpool star Fabinho during his first summer at the club.\n\nThe Spaniard joined the Gunners after a stint with Paris Saint-Germain and he was an admirer of the Brazilian during his time in France with Monaco.\n\nFabinho ended up joining Liverpool instead, while Emery was eventually persuaded to sign Lucas Toreira by his Arsenal board.~\n\nSpeaking ahead of Arsenal’s Europa League clash against Vitoria, Emery confirmed he wanted to sign Fabinho and said the Brazilian was an example to the likes of Nicolas Pepe and Dani Ceballos that it takes time to settle in the Premier League.\n\nEmery had to be convinced to sign Toreira (Picture: Getty)\n\n‘We spend money with Pepe,’ said Emery.\n\n[Pepe needs time to adapt to the Premier League.\n\n[For example, in France I love a lot Fabinho. He was in Monaco and I wanted to sign for PSG. When I arrived here, also his name was on the table to achieve to sign him, but he signed for Liverpool.\n\nAdvertisement\n\nAdvertisement\n\n‘The first six months he didn’t play, it was adaptation. But now he is amazing and I want the same with Ceballos, with Pepe.\n\n‘We need patience, but Pepe is improving, but on Monday, the key to win was with him. If he scores the first goal, it’s different.\n\n‘But it’s one process and I believe in him and I know we need time and patience. The supporters have patience, some more than others.\n\n‘But I know we are convinced. We are going to fight to convince them and tomorrow to show another 90 minutes at the Emirates and then on Sunday.’\n\nThe scrutiny on Emery has intensified this week following the Gunners’ dismal 1-0 defeat to Sheffield United on Monday.\n\nJamie Carragher accused the Spaniard of failing to improve the club during the last 18 months and says Arsenal are no better now than they were under Arsene Wenger.\n\nBut Emery disagrees.\n\n‘In my career it’s normal to have difficult moments and criticism for our work and my job,’ said Emery.\n\n‘We are in one point of view. The supporters point of view and their opinion, we need to accept that’.\n\nMORE: Frank Lampard ‘very, very happy’ with Christian Pulisic after impact in Chelsea’s win against Ajax", "description": "Arsenal boss Unai Emery has revealed the club wanted to sign Liverpool star Fabinho during his first summer at the club. The Spaniard joined the Gunners after a stint with...", "authors": ["Metro Sport Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/09/GettyImages-1161985283_1571870143.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-23"}