{"pub": "guardian", "url": "https://theguardian.com/environment/2019/sep/23/countries-must-triple-climate-emissions-targets-to-limit-global-heating-to-2c", "downloaded_at": "2019-09-23 00:12:13.490530+00:00", "title": "Countries must triple climate emissions targets to limit global heating to 2C", "language": "en", "text": "United in Science report ahead of UN summit says climate is changing faster than forecast, and current plans would lead to ‘catastrophic’ global temperature rise\n\nAn assessment backed by the world’s major climate science bodies has found commitments to cut greenhouse gas emissions must be at least tripled and increased by up to fivefold if the world is to meet the goals of the 2015 Paris climate agreement.\n\nThe report, launched as leaders gather at a UN climate action summit in New York on Monday, says current plans would lead to a rise in average global temperatures of between 2.9C and 3.4C by 2100, a shift likely to bring catastrophic change across the globe.\n\nCoordinated by the World Meteorological Organisation, the United in Science report says it is still possible to reduce the gap and keep global heating to a safe level, but it would require an urgent shift in commitments and action.\n\nAcross the globe, millions join biggest climate protest ever Read more\n\nThe five years between 2015 and 2019 are on track to be on average 1.1C hotter than pre-industrial times and the warmest of any equivalent period on record.\n\nThe report says many of the changes linked to the temperature rise, including long-lasting heatwaves, record-breaking wildfires, declining sea ice and glaciers, cyclones, floods and drought, have hit sooner and harder than predicted a decade ago.\n\nSpeaking ahead of the summit, UN secretary general António Guterres said the world was fraying and needed international cooperation more than ever.\n\n“Let’s face it, we have no time to lose,” he said.\n\nPep Canadell, the executive director of the Global Carbon Project and a contributing author on the report, said the report confirmed well-established trends, including that climate changes had accelerated in the past three decades, and particularly in the past 10 years.\n\n“How many climate records does it take to accept the unprecedented nature of what we are living and to act upon it?”\n\nMillions of people took part in an unprecedented global demonstration on Friday demanding urgent action to tackle global heating , joining a movement started by Swedish teenage activist Greta Thunberg. Like the report, the strike was timed to put pressure on the leaders gathering for the climate summit, which is being held ahead of the annual UN general assembly. Leaders from about 60 countries are scheduled to speak at the summit, including India’s Narendra Modi, Germany’s Angela Merkel and Britain’s Boris Johnson.\n\nGuterres asked leaders to come to the summit with new commitments to put the globe closer to meeting the Paris agreement goals of limiting global heating to at least 2C, and as close to 1.5C as possible, compared with pre-industrial levels. He said it required countries to cut emissions by 45% by 2030, end fossil fuel subsidies and ban new coal plants after 2020.\n\nDonald Trump, who has pledged to pull the US out of the Paris agreement, will not attend the summit. Australia will be represented by Marise Payne, the foreign affairs minister, despite the prime minister, Scott Morrison, being in the US this week, after Morrison refused to meet a request from Guterres that countries announce new commitments before attending.\n\nAtlassian billionaire to announce net zero emissions target at UN climate summit Read more\n\nThe United in Science report, which is also backed by the United Nations Environment Programme and the Intergovernmental Panel on Climate Change, estimates global emissions are not likely to peak before 2030 on the current trajectory.\n\nIt says policies to reduce emissions must triple to meet the 2C target and increase fivefold to keep heating to within 1.5C.\n\nA separate report to be released on Monday has found emissions from coal power would need to peak next year and fall to zero by 2040 if the world is to meet the Paris goals.\n\nFor developed countries that have the capacity to move more rapidly to cleaner sources, such as Australia, the US and those in western Europe, it would mean ending coal use for electricity by 2031. Less developed countries would need to shut their coal plants across the following decade.\n\nThere has been a shift away from investors backing new coal developments, reflected in a 75% fall in the number of new plants planned across the globe since 2015, but the analysis by Berlin-based Climate Analytics said cancelling new projects was not enough.\n\nAccording to the International Energy Agency, emissions from coal power rose 2.9% in 2018 and account for nearly a third of global carbon dioxide pollution.\n\n“Governments now need to introduce effective regulation to shut down coal power plants well before the end of their technical lifetime and considerably reduce their use in the meantime,” Paola Yanguas Parra, from Climate Analytics, said.\n\nYanguas Parra said the date at which coal would need to be phased out to give the world a chance of limiting warming to 1.5C had been brought forward following an assessment by the IPCC last year and because governments had not tackled coal use adequately since the 2015 Paris summit.", "description": "United in Science report ahead of UN summit says climate is changing faster than forecast, and current plans would lead to ‘catastrophic’ global temperature rise", "authors": ["Adam Morton"], "top_image": "https://i.guim.co.uk/img/media/fb2d1810545a8f4affaed2e49cd222ce9c4b0633/0_82_5568_3340/master/5568.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7b2121b696c20542849dc6f134fb54ac", "published_at": "2019-09-23"}