{"pub": "washingtonpost", "url": "https://washingtonpost.com/national-security/fbi-charges-soldier-with-sharing-bombmaking-tips-says-he-spoke-of-targeting-liberals-journalists/2019/09/23/38ce43ec-de27-11e9-b199-f638bf2c340f_story.html", "downloaded_at": "2019-09-24 01:08:27.198597+00:00", "title": "FBI charges soldier with sharing bombmaking tips, says he spoke of targeting liberals, journalists", "language": "en", "text": "Using the acronym for improvised explosive devices, authorities said, Smith wrote in a Facebook chat in December: “Oh yeah, I got knowledge of IEDs for days. We can make cellphone IEDs in the style of the Afghans. I can teach you that.”\n\nAn attorney for Smith did not immediately respond to a request for comment.\n\nThe FBI was alerted to Smith’s alleged statements on Facebook and used a confidential informant as well as an undercover agent to engage in online discussions with him. Over time, FBI officials said, Smith offered bombmaking formulas to them both.\n\nInvestigators found Smith had talked about joining a far-right Ukrainian paramilitary group in 2016 but ended up joining the U.S. Army a year later.\n\nIn his group conversation, Smith wrote last month that he was looking for more “radicals” like himself and talked about possibly killing far-left protesters known as “antifa,” or possibly destroying cell towers or a local news station, authorities have alleged.\n\nThat same month, he also talked about using a vehicle bomb to attack the headquarters of a major news network, according to the criminal complaint, although authorities did not identify the network in court papers.\n\nOn Friday, Smith and the undercover FBI agent began talking online about types of bombs that could be built from everyday materials, the complaint says. It describes some of those bomb recipes as accurate and others that were not or were accurate only if the right type of ingredients were acquired.\n\nAfter receiving a number of recipes, the undercover agent wrote to Smith: “Got a liberal texas mayor in my sights! Boom with that IED and that dude’s dead.”\n\nFBI officials said Smith replied: “There ya go.”\n\nThe undercover agent asked, “You got anyone down in Texas that would be a good fit for fire, destruction, and death?”\n\nSmith, according to the complaint, replied: “Outside of Beto? I don’t know enough people that would be relevant enough to cause a change if they died.”\n\nDemocratic presidential candidate Beto O’Rourke, a former congressman from Texas, recently made headlines by saying at a Democratic debate that he would seek to end private ownership of AK-47s and AR-15 rifles. It was unclear whether his proposed mandatory buyback for those weapons triggered Smith’s anger.\n\nTrump says deal on guns ‘much harder,’ blames O’Rourke’s comments\n\nFBI agents arrested Smith on Saturday, and officials say that after his arrest he made several incriminating statements acknowledging he had shared bombmaking recipes with others.\n\nFBI Special Agent Brandon LaMar said in an affidavit that Smith admitted to him “that he knows how to make improvised explosive devices, and that in online chat rooms he routinely provides instruction on building explosive devices.”\n\nSmith said he did so to cause “chaos,” according to the affidavit. “He told me that if chaos results in the death of people, even through information he provided, it doesn’t affect him,” LaMar wrote in the affidavit.\n\nThe charge carries a maximum possible sentence of 20 years in prison.", "description": "Pfc. Jarrett William Smith, a soldier at Fort Riley, Kan., was arrested Saturday following alleged online conversations.", "authors": ["Devlin Barrett", "Reporter Focusing On National Security", "Law Enforcement"], "top_image": "https://washingtonpost.com/pf/resources/images/favicon.ico?d=107", "published_at": "2019-09-23"}