{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugby-world-cup-2019/article-7555227/England-finish-World-Cup-group-France-clash-called-due.html", "downloaded_at": "2019-10-09 19:15:27.148835+00:00", "title": "England will finish top of their World Cup group after France clash is called off due", "language": "en", "text": "England will finish top of their Rugby World Cup group after their final game against France was cancelled.\n\nThe Pool C clash was scheduled for Saturday in Yokohama but was called off with super typhoon Hagabis set to cause havoc.\n\nDue to its cancellation, the match will be recorded as a 0-0 with both teams awarded two points each.\n\nEddie Jones's England won't have played for two weeks before their quarter-final clash in Oita\n\nEngland will finish their Rugby World Cup pool top after their match with France was cancelled\n\nThat would leave England top of the pool on 17 points with France in second on 15.\n\nIt leaves the prospect of a quarter-final tie against Australia, who are second in Pool D behind Wales. The runners-up in Pool D will face the winners of Pool C.\n\nAustralia knocked England out of the pool stage of the last World Cup on their way to the final.\n\nThis weekend's cancellation also means that England won't have played for two weeks ahead of their last eight-tie in Oita.\n\nEngland currently top Pool C, and would stay there if the game is recorded as a 0-0 draw\n\nTyphoon Hagibis is being put on par with a category 5 hurricane with 160mph winds expected\n\nEngland's last match was last Saturday and ended in a comfortable victory over Argentina in Chofu.\n\nWorld Rugby will hold a press conference on Thursday where an explanation will be given.\n\nThere was a possibility that England's match against France would be moved to Oita but that wasn't logistically possible.", "description": "England will finish top of their Rugby World Cup group after their final game against France was cancelled. They are likely to face Australia in the quarter-finals in Oita on October 19.", "authors": ["Tom Farmery For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/16/19499580-0-image-a-12_1570636316960.jpg", "published_at": "2019-10-09"}