{"pub": "abcnews", "url": "https://abcnews.go.com/International/dramatic-footage-shows-extinction-rebellion-protesters-clash-commuters/story?id=66340793", "downloaded_at": "2019-10-18 01:08:30.817852+00:00", "title": "Dramatic footage shows Extinction Rebellion protesters clash with commuters during busy London rush hour", "language": "en", "text": "Dramatic scenes played out at a busy London subway station Thursday morning, as climate change protesters and commuters clashed during rush hour.\n\nInterested in London? Add London as an interest to stay up to date on the latest London news, video, and analysis from ABC News. Add Interest\n\nVideo footage from London's Canning Town station shows activists from the group Extinction Rebellion protesting on top of a stationary train before being physically dragged onto the platform by a frustrated commuter. Other commuters on the platform are seen intervening to stop the potentially dangerous situation.\n\nEight arrests have been made in connection with the incident at Canning Town and the Stratford and Shadwell stations, British Transport Police said.\n\nAPTN\n\nExtinction Rebellion has been protesting at various sites in the U.K. capital since the beginning of last week. Police banned the group from assembling within London under Section 14 of the Public Order Act Monday, meaning anyone who fails to comply is liable for arrest and prosecution. The group is now targeting public transport hubs in recent days.\n\nOver 1,400 arrests have been made in connection with the protests, police said.\n\nExtinction Rebellion described its protests as \"an act of conscience\" in the face of \"impending disaster\" in a statement sent out to the media following the incident.\n\nAPTN\n\n“This is disruption with a purpose since we will all encounter far greater disruption in the future if we don’t radically change our society,\" spokesperson Valerie Milner-Brown said. \"We can already see the horrifying early effects of the Climate and Ecological Emergency in parts of the Global South and it’s clear that this will be coming our way soon. Government needs to start taking seriously the deep concerns of tens of thousands of experts and scientists globally, so that we can create a society that is built to put resilience and community before profit.”\n\nThe group later put out a statement describing the episode as \"regretful.\"\n\n\"We would like to express our sadness that events escalated this way,\" the statement said. \"We are aware that one of our activists responded in self defence in a moment of panic when confronted by a threatening situation. He acknowledges his accountability for this action and we offer gratitude for members of the public who helped to protect him. To those that engaged in violence, we acknowledge that we disrupted your life today.\"\n\nAPTN\n\nThe action this morning was not supported by the majority of XR Croydon nor XR as a whole.\n\n\n\nXR is a decentralised movement and this group was carried out by a small number of autonomous rebels. — Extinction Rebellion Croydon 🌍 (@XRCroydon) October 17, 2019\n\nThe group has received public backing from a number of celebrities, including the actor Benedict Cumberbatch, the author Margaret Atwood and the U.K. prime minister's father, Stanley Johnson.\n\nOur rebels were helping guard the hearse in Trafalgar Square tonight when Benedict Cumberbatch dropped by.#EverybodyNow #OurFuture #ExtinctionRebellion pic.twitter.com/UqGX5YfxTV — XR Richmond-upon-Thames (@xr_richmond) October 9, 2019\n\nExtinction Rebellion UK have three main demands: that the government should \"tell the truth\" about climate change, that greenhouse gas emissions should reach net zero by 2025 and a \"Citizen's Assembly\" should be created to lead decisions on climate change.", "description": "Extinction Rebellion protesters clashed with commuters during busy London rush hour in dramatic footage.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/train-london-aptn-ml-191017_hpMain_16x9_992.jpg", "published_at": "2019-10-18"}