{"pub": "thehill", "url": "https://thehill.com/blogs/blog-briefing-room/news/467373-astros-fire-assistant-gm-after-inappropriate-comments-to-women", "downloaded_at": "2019-10-25 00:02:01.431951+00:00", "title": "Astros fire assistant GM after 'inappropriate' comments to female reporters", "language": "en", "text": "The Houston Astros fired assistant general manager Brandon Taubman on Thursday over comments he reportedly yelled at female reporters after the team’s victory in the American League Championship Series.\n\nTaubman was fired after an investigation by the Major League Baseball and the Astros revealed that his “inappropriate comments were, in fact, directed toward one or more reporters,” the team said in a statement Thursday.\n\nThe Astros also apologized to Sports Illustrated reporter Stephanie Apstein and to all those who witnesses the incident.\n\nThe team had previously accused Sports Illustrated of attempting to “fabricate a story where one does not exist” after Apstein’s report of the incident.\n\nApstein reported that she was standing with two other female reporters watching the celebration after the team’s win when Taubman yelled “thank God we got Osuna! I’m so f------ glad we got Osuna!”\n\nHe was referring to Astros' closer Roberto Osuna who the team acquired from the Toronto Blue Jays in 2018 while he was in the middle of a 75-game suspension for violating the Major League Baseball’s domestic violence policy.\n\nTaubman apologized Tuesday for his “inappropriate language” after other reporters backed up Apstein’s report.\n\nIn its statement Thursday, the Astros said that its \"initial investigation led us to believe that Brandon Taubman’s inappropriate comments were not directed toward any reporter.\"\n\nHowever, the Astros admitted that was wrong.\n\n\"We were wrong,\" the team said. \"We sincerely apologize to Stephanie Apstein, Sports Illustrated and to all individuals who witnessed this incident or were offended by the inappropriate conduct. The Astros in no way intended to minimize the issues related to domestic violence.”\n\n“Accordingly we have terminated Brandon Taubman’s employment with the Houston Astros. His conduct does not reflect the values of our organization and we believe this is the most appropriate course of action,” the statement continues.\n\nThe team said it is “very committed to using our voice to create awareness and support on the issue of domestic violence.”\n\nLast May, Osuna was charged with assault involving the mother of his child. Charges were dropped, but the Astros received criticism for their decision to trade for Osuna.", "description": "The Houston Astros fired assistant general manager Brandon Taubman on Thursday over comments he reportedly yelled at female reporters after the team’s victory in the American League Championship Series.", "authors": [], "top_image": "https://thehill.com/sites/default/files/osunarobertoastros_102219getty.jpg", "published_at": "2019-10-24"}