{"pub": "reuters", "url": "https://reuters.com/article/us-airbnb-ipo/airbnb-plans-stock-market-splash-in-2020-idUSKBN1W41Z7", "downloaded_at": "2019-09-19 23:17:13.462881+00:00", "title": "Airbnb plans stock market splash in 2020", "language": "en", "text": "FILE PHOTO: The logos of Airbnb are displayed at an Airbnb event in Tokyo, Japan, June 14, 2018. REUTERS/Issei Kato/File Photo\n\n(Reuters) - Home rental giant Airbnb said it plans to list its shares in 2020, making it one of the most high-profile names to tap the stock market next year. (bit.ly/2mqasWw)\n\nIn a short statement posted on its website on Thursday, Airbnb did not give any details on how it plans to list its shares, although it is widely expected to take a direct-listing route.\n\nA direct listing to go public is a process in which no new shares are created and helps companies save millions of dollars in underwriting fees.\n\nThis year has marked the stock market debuts of several high-profile companies, including Uber and Lyft Inc, but their shares have fared poorly after the launch, amid investor skepticism over their path to profitability.\n\nWeWork owner The We Company has also delayed its initial public offering, walking away from preparations to launch it this month after a lackluster response from investors.\n\nMarket experts though have said Airbnb might receive a warmer reception from investors when it debuts, considering that its financials looked more stable than recent internet unicorns that have gone public.\n\n“I think it’ll be a whole different reception for Airbnb, assuming that they can show they’re a profitable business without having to lose money on marketing,” said Kathleen Smith, principal at Renaissance Capital, a provider of institutional research and IPO ETFs.\n\nAirbnb has not given any details on whether it was profitable in the second quarter of 2019 but has previously said that its earnings before interest, taxes, depreciation, and amortization were positive for 2017 and 2018.\n\nOn Wednesday, the company said it raked in more than $1 billion in revenue for the second quarter.", "description": "Home rental giant Airbnb said it plans to list its shares in 2020, making it one of the most high-profile names to tap the stock market next year. (https://bit.ly/2mqasWw)", "authors": ["Anirban Sen", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190919&t=2&i=1431638823&w=1200&r=LYNXMPEF8I1C6", "published_at": "2019-09-19"}