{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/25/council-inspectors-general-doj-was-wrong-block-rel", "downloaded_at": "2019-10-25 22:21:50.474662+00:00", "title": "DOJ wrong to block release of whistleblower complaint to Congress, IG council says", "language": "en", "text": "The Justice Department was wrong to block releasing to Congress the whistleblower’s complaint about President Trump’s phone call with his Ukrainian counterpart, a group of government inspectors general said in a letter released Friday.\n\nRoughly 70 inspectors generals signed the letter calling the Justice Department’s Office of Legal Counsel opinion — that the complaint was not an “urgent concern” — “wrong as a matter of law and policy.”\n\nThe letter issued by the Council of Inspectors General asked the Justice Department to withdraw or modify the opinion.\n\n“If Intelligence Community employees and contractors believe that independent IG determinations may be second guessed, effectively blocking the transmission of their concerns to Congress and raising questions about the protections afforded to them, they will lose confidence in this important reporting channel and their willingness to come forward with information will be chilled,” the group wrote.\n\nThe group, which is chaired by Justice Department Inspector General Michael E. Horowitz, also said the letter creates “uncertainty” for federal employees about whether to file whistleblower complaints.\n\nThe OLC last month authored a memo saying it disagreed with Intelligence Community Inspector General Michael Atkinson’s determination that the whistleblower complaint was an “urgent concern,” which would require that it be turned over to Congress.\n\nUnder federal statute, an “urgent concern” involves “the funding, administration, or operation of an intelligence activity under the authority of the DNI,” the OLC concluded.\n\nIn a September letter to the Justice Department, Mr. Atkinson defended labeling the report an “urgent concern.” He said the OLC’s conclusions were “gravely troubling” and “contrary” to established precedent.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The Justice Department was wrong to block releasing to Congress the whistleblower's complaint about President Trump's phone call with his Ukrainian counterpart, a group of government inspectors general said in a letter released Friday.", "authors": ["The Washington Times Http", "Jeff Mordock"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2013/06/05/6_5_2013_marshals-horowitz018201_c0-13-626-378_s1200x700.jpg?1fcb3b7de81bbbbc409f40452d27cb3f40a8b9aa", "published_at": "2019-10-25"}