{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7586231/Tammy-Hembrow-Jahkoy-Palmer-play-phones-Rome.html", "downloaded_at": "2019-10-18 01:23:19.313174+00:00", "title": "Tammy Hembrow and Jahkoy Palmer play with their phones in Rome", "language": "en", "text": "They're currently enjoying a romantic holiday in Italy together.\n\nAnd on Thursday, Instagram model Tammy Hembrow and her boyfriend Jahkoy Palmer made the most of their time by attending a store opening for fashion designer Philipp Plein in Rome.\n\nHowever, at one point, the couple seemed to be more interested in their mobile phones than each other.\n\nChecking Instagram? Instagram star Tammy Hembrow and her boyfriend Jahkoy Palmer played with their phones at Philipp Plein's store opening in Rome on Thursday\n\nTammy stunned in a little black dress with a plunging neckline and long sleeves.\n\nShe accessorised with stylish black Philipp Plein stilettos and a matching clutch.\n\nRapper Jahkoy went for a more casual look in a white long-sleeved shirt and a pair of blue jeans.\n\nStylish: Tammy stunned in a little black dress with a plunging neckline and long sleeves\n\nTammy recently reached a major social media milestone by hitting 10 million followers on Instagram.\n\nThe Gold Coast influencer shared a few rare fully clothed mirror selfies on Monday, while noticeably hiding her ring finger in both.\n\n'Make you nervous,' Tammy cryptically captioned the post, which prompted Jahkoy to comment with an engagement ring emoji.\n\nBack at it! The pair also played with their phones inside the event\n\nUnsurprisingly, Jahkoy's comment with the ring emoji sent fans into a frenzy, with some responding, 'Oh my god!' and 'You're perfect together'.\n\nHowever, Tammy was not wearing any rings in Rome on Thursday, which suggests the pair did not get engaged.\n\nThe couple went public with their romance in late June. Jahkoy is Tammy's first confirmed boyfriend since her split from ex-fiancé Reece Hawkins in June 2018.", "description": "They're currently enjoying a romantic holiday in Italy together.", "authors": ["Daily Mail Australia Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/00/19863054-0-image-a-30_1571355277566.jpg", "published_at": "2019-10-17"}