{"pub": "yahoo", "url": "https://news.yahoo.com/official-says-16-dead-119-041619350.html", "downloaded_at": "2019-09-05 00:44:18.888533+00:00", "title": "Shattering Taliban attack in Kabul even as US deal nears", "language": "en", "published_at": "2019-09-03", "text": "ADDS DATE - Smoke rises as angry Kabul residents set fire to part of the Green Village compound that has been attacked frequently, a day after a Taliban suicide attack in Kabul, Tuesday, Sept. 3, 2019. An interior ministry spokesman said some hundreds of foreigners were rescued after the attack targeted the compound, which houses several international organizations and guesthouses. (AP Photo/Rahmat Gul)\n\nKABUL, Afghanistan (AP) — The Taliban on Tuesday defended their suicide bombing against an international compound in the Afghan capital that killed at least 16 people and wounded 119, almost all local civilians, just hours after a U.S. envoy said he and the militant group had reached a deal \"in principle\" to end America's longest war.\n\nAngry Kabul residents whose homes were shredded in the explosion climbed over the buckled blast wall and set part of the compound, a frequent Taliban target, on fire. Thick smoke rose from the Green Village, home to several foreign organizations and guesthouses, whose location has become a peril to nearby local residents as well.\n\nRomanian President Klaus Iohannis condemned the attack, \"which, unfortunately, ended the life of a Romanian citizen and seriously wounded another one. I reiterate our profound commitment to combating terrorism at the international level.\"\n\n\"People were screaming and saying, 'My children are trapped in the rubble,'\" one witness, Faiz Ahmad, said. A large crater was left in the street from a tractor packed with explosives. Five attackers were killed in the Monday night attack and some 400 foreigners rescued, Interior Ministry spokesman Nasrat Rahimi said.\n\nThe Taliban continue to kill Afghan civilians in attacks they say are meant for foreign \"invaders\" or the Afghan government, apparently sacrificing the support of the people they might wish to rule, even as the U.S. envoy says the deal with the insurgents only needs the approval of President Donald Trump to become a reality. The accord would include a troop withdrawal that the Taliban already portray as their victory.\n\nTaliban spokesman Zabihullah Mujahid told The Associated Press that \"we understand that peace talks are going on ... but they must also understand that we are not weak and if we enter into talks ... we enter from a strong position.\"\n\nHe said the attack was a response to raids by U.S. and Afghan forces on civilians across the country. While he acknowledged there should be less harm to civilians, he said they shouldn't live near such an important foreign compound.\n\nQuestions are growing among some in Washington about the dangers of trusting the Taliban to make peace. On Tuesday, several former U.S. ambassadors to Afghanistan warned in a joint statement published by the Atlantic Council that \"it is not clear whether peace is possible,\" saying the Taliban have \"made it clear that the war will go on against the Afghan government.\"\n\nA full U.S. troop withdrawal that moves too quickly and without requiring the Taliban to meet conditions such as reducing violence could lead the militant group to avoid making compromises with other Afghans, the former envoys warned. Civil war could follow and give al-Qaida and the local Islamic State affiliate space to grow, they said: \"All of this could prove catastrophic for U.S. national security.\"\n\nThe attack occurred just hours after U.S. envoy Zalmay Khalilzad briefed the Afghan government on an agreement \"in principle\" with the Taliban that would see 5,000 U.S. troops withdraw from five bases in the country within 135 days of a final deal on ending nearly 18 years of fighting. Between 14,000 and 13,000 troops are currently in the country.\n\nHours before Monday's attack, Khalilzad showed a draft deal to the Afghan president after declaring that they are \"at the threshold of an agreement\" following the end of the ninth round of U.S.-Taliban talks in Qatar.\n\nKhalilzad has not commented publicly since the blast, which rocked Kabul as many residents watched him speak in a nationally televised interview about the deal and Afghanistan's future.\n\nShaken Kabul residents questioned whether the Taliban will respect any agreement, especially after foreign troops withdraw.\n\n\"This what the Taliban are up to in Afghanistan; totally committed to total destruction. Can they be trusted!!??\" presidential spokesman Sediq Seddiqi tweeted.\n\nThe Taliban want all of the some 20,000 U.S. and NATO troops out of Afghanistan immediately, while the U.S. seeks a withdrawal in phases that would depend on the Taliban meeting certain conditions such as a reduction in violence.\n\nAttacks have surged in recent months, including Taliban assaults on two provincial capitals over the weekend, as the group also seeks to strengthen its negotiating position with the Afghan government in the even more challenging intra-Afghan talks that are meant to follow a U.S.-Taliban deal. The Taliban have rejected talking with the government so far, dismissing it as a U.S. puppet.", "description": "The Taliban on Tuesday defended their suicide bombing against an international compound in the Afghan capital that killed at least 16 people and wounded 119, almost all local civilians, just hours after a U.S. envoy said he and the militant group had reached a deal \"in principle\" to end America", "authors": ["Rahim Faiez", "Cara Anna"], "top_image": "https://s.yimg.com/uu/api/res/1.2/7ZlrE6V8xKyX1ecu4b8vYA--~B/aD0yMDE1O3c9MzAyMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/9ca102e9b9241b0ca437d77430163615"}