{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7561899/Playful-creature-happily-bounces-trampoline-jealous-dog-watches-on.html", "downloaded_at": "2019-10-11 13:02:14.232136+00:00", "title": "Playful creature happily bounces on a trampoline as a jealous dog watches on", "language": "en", "text": "An adorable fox has the time of its life bouncing on a trampoline in a garden looking just like the John Lewis's 2016 Christmas advert.\n\nThe footage of the animal, captured in Tyresö, Sweden on October 2, shows it jumping up and down on the apparatus that is buried in the ground.\n\nIn the 2016 John Lewis Christmas advert, a pair of cheeky foxes playfully enjoy a garden trampoline, before being joined by a variety of other woodland creatures.\n\nFootage captured in Sweden shows a playful fox bouncing on a trampoline. The fox springs up and down a few times, enjoying its new toy\n\nIn this video, the fox can be seen gingerly taking one jump on the trampoline.\n\nIt then confidently springs up a few more times in succession, enjoying its new toy.\n\nThe animal bounces around in one spot, before taking a short break.\n\nIt then springs over to the other side of the trampoline and lies down there too.\n\nAll the while, a jealous dog can be heard whining in the background.\n\nThe animal springs up and down on the trampoline, enjoying its new toy. This draws comparisons to a John Lewis Christmas advert from three years ago\n\nTired out: The animal bounces around a few more times in one spot, before taking a short break. It then bounds over to the other side of the trampoline and lies down there too\n\nThis draws comparisons to a John Lewis Christmas advert from three years ago.\n\nIn the promotional video, Buster the Boxer longingly gazes at two foxes who spring up and down on a trampoline in the family's garden.\n\nAs more woodland animals join in, Buster growls in jealously.\n\nWhen the doors open on Christmas morning, Buster bounds out of the house and jumps up onto the trampoline himself.\n\nHe gleefully bounces as his shocked owners look on.\n\nIn the promotional video, Buster the Boxer longingly gazes at two foxes who spring up and down on a trampoline in the family's garden", "description": "The footage, captured in Tyresö, Sweden, shows the creature springing up and down on the apparatus. This is just like John Lewis's 2016 Christmas advert Buster the Boxer.", "authors": ["Jemma Carr For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/09/19578080-0-image-a-20_1570781730550.jpg", "published_at": "2019-10-11"}