{"pub": "yahoo", "url": "https://yahoo.com/entertainment/priyanka-chopra-jonas-says-having-110028090.html", "downloaded_at": "2019-09-06 12:18:53.339749+00:00", "title": "Priyanka Chopra Jonas Says Having a Baby with Husband Nick Jonas Is on Her 'To-Do List'", "language": "en", "text": "Babies are on the brains of Priyanka Chopra Jonas and husband Nick Jonas.\n\nThe actress, 37, opens up to Vogue India in her September cover story about the projected next steps in the couple’s relationship following their extravagant December 2018 wedding celebrations.\n\nWhile Nick, 26, has been busy touring with brothers Joe and Kevin Jonas, Chopra Jonas reveals that she ultimately sees Los Angeles as the place to build their future together.\n\n“Buying a home and having a baby are on my to-do list,” she says, later adding, “For me, home is wherever I’m happy, as long as I have the people I love around me.”\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Parents newsletter.\n\nPriyanka Chopra Jonas for Vogue India | Marcin Kempski More\n\nPriyanka Chopra Jonas for Vogue India | Marcin Kempski More\n\nRELATED: Designed for Each Other: Priyanka Chopra Jonas and Nick Jonas Are PEOPLE’s Best Dressed\n\nChopra Jonas recently told InStyle that having children with her husband is definitely on the horizon when the time is right. “I want my existence to have meant something. I want my kids to turn around and be like, ‘Yeah, that was my mom,’ ” she shared in June.\n\nAnd in late 2018, shortly after their wedding, Chopra Jonas told PEOPLE that the couple plan to take things as they come. “I always say, ‘Man proposes, God disposes.’ So I’m not taking any chances,” she said.\n\n“We definitely want kids, and when the time is right, it will happen,” Chopra Jonas added.\n\nPriyanka Chopra Jonas covers Vogue India's September issue | Marcin Kempski More", "description": "Priyanka Chopra: Having a Baby with Nick Jonas Is on 'To-Do List'", "authors": ["Karen Mizoguchi"], "top_image": "https://s.yimg.com/uu/api/res/1.2/U43LzHD4VPJnGAK_IWKPhA--~B/aD0yNzAwO3c9MjA2OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/people_218/9130cc187fc3417e1a8f435724149478", "published_at": "2019-09-06"}