{"pub": "npr", "url": "https://npr.org/2019/10/14/769324211/bill-brysons-latest-is-a-different-kind-of-journey-into-the-body", "downloaded_at": "2019-10-14 10:11:03.403301+00:00", "title": "Bill Bryson's Latest Is A Different Kind Of Journey — Into 'The Body'", "language": "en", "text": "Bill Bryson's Latest Is A Different Kind Of Journey — Into 'The Body'\n\nThe Body A Guide for Occupants by Bill Bryson Hardcover, 450 pages | purchase close overlay Buy Featured Book Your purchase helps support NPR programming. How?\n\nBill Bryson is beloved for his travel writing, but his new book takes us not to Australia or to Europe or to Iowa, but on a journey inside our own bodies. And it's called — naturally — The Body. Bryson says he's genuinely fascinated by the ways our bodies work. \"I mean, once you start delving into the body and how it's put together, and what a miracle life is when you think about it,\" he says, \"each of us is made up of 37 trillion cells, and there's nothing in charge. I mean all of those cells, you just have chaotic activity going on, and little chemical signals going from one cell to another. And yet somehow, all this random chaotic activity results in a completely sentient, active, thinking human being.\"\n\nInterview Highlights\n\nOn some of the lighter moments in his research\n\nThe Mütter Museum in Philadelphia is an extraordinary small museum, and one of the things they have there is this collection of objects that were kept by a doctor in the early 20th century who specialized in retrieving swallowed objects ... sometimes from saving people's lives, but often from people who had died because they choked on these things they swallowed. And it is the most extraordinary collection — you can look at open drawers, glass-covered drawers and see thousands of objects that he retrieved from the gullets and the esophaguses of unfortunate people. And everything from padlocks and opera glasses and just all kinds of things people have swallowed, either accidentally or, you know, by bizarre intent.\n\nOn the death of George Washington from a throat infection\n\nBooks Bill Bryson: Time Traveling in 'Thunderbolt Kid' Bill Bryson: Time Traveling in 'Thunderbolt Kid' Listen\n\nHe'd retired, you know, he'd won the Revolutionary War and then served two heroic terms as president, and all he really wanted to do was just retire to Mount Vernon and have a quiet life. And he'd only just started enjoying his retirement. And he'd been out surveying the plantation on horseback one day in winter and it was raining, and he got very wet. And when he came home, unwisely, he ate dinner in in damp clothes. And then as a result of that, he got some kind of a throat infection — really probably no more than just a bad cold.\n\nBut then his doctors got hold of him, because he was a person of such eminence. Three doctors were called in, and they all came and looked into him. And what they did was they started bleeding him, which was the standard procedure for people who were unwell at that time ... they drained, you know, like 40 ounces of blood from him. And then when that didn't make him better they drained more and more ... And then in the end, they drained about 40 percent of his blood from him. And of course this had exactly the opposite effect of making him better, it made him much, much worse. And he died, poor man died, but essentially he was killed by his doctors — and ... you can't say that was a routine event in the 18th century. But it was pretty common.\n\nOn modern medical mysteries\n\nNobody's ever come up with a truly plausible explanation for why we yawn. Or even an explanation for why yawning is infectious. If you see someone yawn, you can almost not resist the urge to yawn yourself. I think probably lots of your listeners are fighting an urge to yawn right now ... There is no logical explanation for that. And it's hard to think of a way that you could ever test a hypothesis to see what the cause might be.\n\nAlmost anywhere you look in the body, you will find mystery.\n\nWe don't understand chronic pain. You know, if you have some pain that just goes on and on and on, it makes your life a misery. There's no value in that. And yet you know this is a common occurrence for lots and lots of people. I mean, one of the greatest maladies affecting modern humans is backache. Lots and lots of people off work with chronic backache. There is no reason why you should have to suffer chronic backache, or any other kind of really chronic pain, and yet we do. Nobody really understands that. Almost anywhere you look in the body, you will find mystery.\n\nOn whether he thinks of his own body differently now\n\nYes, I do! I mean, first of all, I really appreciate what my body does for me. And I really do — the fact that there are all of these systems operating, one of the facts that just blew me away when I stumbled upon [it] when I was doing the book was that we all get cancer a couple of thousand times a year on average, they think. But the thing [is], only one or two of your cells turn cancerous, and then your immune system identifies those rogue cells and immediately kills them. So it doesn't turn into anything, it doesn't become tumorous or anything.\n\nSo if you get serious cancer, if you get cancer in the conventional sense that you know you have to go and have it treated, you've been really really unlucky — but probably your body has tens of thousands of times dealt with cancers in your body already. I found that amazing ... It is just a world of wonder.\n\nThis story was edited for radio by Emma Talkoff and Reena Advani, and adapted for the Web by Petra Mayer", "description": "Bryson is beloved for his travel writing, but in his new book he's undertaking an interior journey, looking at everything from medical oddities to the amazing way your body fights off most cancers.", "authors": ["David Greene", "Bill Bryson"], "top_image": "https://media.npr.org/assets/img/2019/10/11/71yb82lx60l_wide-7fff806acead08c4f9f08304f41a1269ae065c02.jpg?s=1400", "published_at": "2019-10-14"}