{"pub": "indiatimes", "url": "https://timesofindia.indiatimes.com/blogs/toi-editorials/maha-haryana-battle-bjps-sharp-attack-on-opposition-on-national-issues-may-presage-future-state-polls", "downloaded_at": "2019-10-20 23:23:13.472691+00:00", "title": "Maha Haryana battle: BJP’s sharp attack on opposition on national issues may presage future state polls", "language": "en", "text": "The first assembly elections after the Lok Sabha polls will test whether BJP’s incumbent governments in Maharashtra and Haryana pass the popularity test like the Modi government at the Centre. Congress, despite wins in three state polls late last year, which would indicate a greater probability of success against BJP’s state leaders, has struggled to recover from the staggering defeat in May. In that election NDA had a 51.3% vote share in Maharashtra and 58.3% in Haryana, leaving opposition parties a dispirited lot.\n\nThe BJP-Shiv Sena and Congress-NCP alliances remain the major political forces in Maharashtra but with one significant difference: BJP has surged ahead of the field forcing Shiv Sena to accept a supporting role in their partnership. NCP and Congress, which drew their strength from rural cooperatives, have been hampered by the exodus of key leaders. Congress’s listlessness, with no central or state leader taking on major campaigning responsibilities, has cast the spotlight on Sharad Pawar. But the firepower that BJP has directed at the opposition has few parallels.\n\nNationalism also becomes a perfect foil to general local perception about chief ministers Devendra Fadnavis and ML Khattar as clean and shrewd leaders capable of carrying party, government and influential communities along. Prime Minister Narendra Modi and home minister Amit Shah have not shied away from making the two state elections about Article 370 nullification and other maximalist positions on national security like NRC. That Maharashtra and Haryana are far away from Kashmir and Bangladesh hardly matters. Moreover the eve of the election has seen major retaliation against Pakistan’s unprovoked firing on Indian civilian and military facilities on the LoC. This will recall national security concerns for voters.\n\nThe state of the economy could have been a major counter by the opposition. The longstanding crisis in agriculture and the lack of jobs and quality education could have resonated disenchantment in Maharashtra and Haryana where reservation demands had peaked. But even here the big question is how sharp and relatable the opposition critique is. Once again, electoral politics has failed to properly engage with these pressing issues. The key difference is that the narrative has shifted from cobbling together winning numbers through handouts and social engineering to majoritarian and nationalist rhetoric that cuts through caste and socio-economic divides. The extent of the electorate’s receptiveness to such messaging could see its replay in future assembly polls.", "description": "The first assembly elections after the Lok Sabha polls will test whether BJP’s incumbent governments in Maharashtra and Haryana pass the popularity test like the Modi government at the Centre. Congress, despite wins in three...", "authors": ["Toi Edit"], "top_image": "https://timesofindia.indiatimes.com/blogs/wp-content/uploads/2019/01/toiedit-logo.jpg", "published_at": "2019-10-20"}