{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7632751/Boris-Johnson-offer-extra-free-childcare-Tory-manifesto-boost-families.html", "downloaded_at": "2019-10-30 23:33:50.821963+00:00", "title": "Boris Johnson to offer extra free childcare in Tory manifesto boost for families", "language": "en", "text": "Boris Johnson is poised to make a substantial offer of free childcare in the Tory manifesto.\n\nThe Prime Minister is understood to be looking at ways to give extra support to parents with pre-school children – a target group in swing seats.\n\nHe will also put a knife crime crackdown at the centre of his law and order policies.\n\nTory officials believe they can win over swing voters by ruthlessly targeting Jeremy Corbyn’s weak spot on crime while neutralising Labour’s core pitch on the NHS, education and public services.\n\nThe Prime Minister, pictured during PMQs today, is understood to be looking at ways to give extra support to parents with pre-school children – a target group in swing seats\n\nAt the moment, parents get 30 hours of free childcare in term time for three and four-year-olds. Low-income families receiving some benefits are also entitled to 15 hours free for two-year-olds.\n\nMr Johnson is looking at two proposals. The first would give an extra ten weeks a year of free childcare for parents of three and four-year-olds. Currently, the 30 hours offer covers around 38 weeks a year – but this could rise to up to 48.\n\nThe alternative, and more expensive, plan is to offer 15 hours of free childcare for all parents of two-year-olds.\n\nElection strategists believe that winning over parents aged between 35 and 45, particularly women, will be key to winning marginal seats.\n\nA senior Tory source said: ‘These are potential Lib Dem voters in the South and potential Labour voters in the North who think Labour has abandoned them culturally.\n\n'Both these groups are in work and they have childcare costs. They’re asking whether they can trust the Tories to look after them.\n\nTory officials believe they can win over swing voters by ruthlessly targeting Jeremy Corbyn’s (pictured at Crawley Hospital today) weak spot on crime while neutralising Labour’s core pitch on the NHS, education and public services\n\n‘Whether they’re earning £65,000 a year and living in London, or £25,000 a year and living in South Shields, these are the voters we need to attract.’\n\nJohnson poised to pull the plug on fracking The Prime Minister is set to announce a moratorium on fracking amid concern that controversy about the technology could dent Tory election hopes. Mr Johnson hinted at the ban yesterday, telling MPs that an announcement would be made ‘in view of the anxieties legitimately being raised about the earthquakes which have followed various fracking attempts in the UK’. A Government source said the intervention would stop short of a total ban but would mean ‘no new fracking’. A source said that ministers were waiting for a report from the Oil and Gas Authority into an incident near Blackpool this summer, in which a tremor measuring 2.9 on the Richter scale was recorded at the UK’s only active fracking site. The political pressure to act on the issue intensified after Labour switched to backing a total ban on fracking. A ‘manifesto’ by the Conservative Environment Network in the summer said the Government should consider a ban on an ‘unpopular, uneconomic and out-of-date industry’. However, fracking supporters insist UK regulations are among the tightest in the world.\n\nThe manifesto, thought to be at least a fortnight from publication, will herald Mr Johnson’s multi-billion pound pledges on the NHS, education and policing.\n\nThe promise of 20,000 extra officers by 2022 is the main Tory offer on policing, and has been found to be hugely popular in focus groups.\n\nMinisters have also discussed increasing the number of new officers by several thousand, but potentially over a longer period. They are looking at how to give police more powers to tackle knife offenders at ‘street level’.\n\nTougher sentencing measures for serious violent and sexual offenders, which were in the Queen’s speech, will also be in the manifesto.\n\nMr Johnson’s team believe their pledges of extra cash will mean they do not lag behind Labour on these issues. Private polling shown to Cabinet ministers has put the Tories narrowly ahead of Labour on the NHS.\n\nThe Prime Minister has visited more than a dozen hospitals and schools to trumpet his spending pledges. He has promised £33.9billion extra on the NHS each year by 2023 – including 40 new hospitals over the next decade.\n\nEagerly anticipated proposals to combat the social care crisis are still being finalised.\n\nYesterday Health Secretary Matt Hancock said he was ‘working on a plan’, but it was not ready to be published. Two years ago Theresa May’s social care plans derailed her campaign after they were dubbed the ‘dementia tax’.\n\nDowning Street refused to comment on the childcare proposals. But a senior Conservative source said: ‘Lots of proposals have been raised. The manifesto is still being drawn up.’", "description": "The Prime Minister is understood to be looking at ways to give extra support to parents with pre-school children - a target group in swing seats.", "authors": ["Jack Doyle Associate Editor For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/22/20400198-0-image-a-26_1572475142608.jpg", "published_at": "2019-10-30"}