{"pub": "afr", "url": "https://afr.com/companies/media-and-marketing/why-viewers-will-start-picking-video-winners-20191011-p52zqp", "downloaded_at": "2019-10-13 18:41:35.923760+00:00", "title": "Why viewers will start picking video winners", "language": "en", "text": "Netflix, Stan, Amazon Prime, Foxtel Now, Disney+, Apple TV+, Kayo Sports and Optus Sports are some of the headline streaming services in an increasingly fragmented Australian content market.\n\nThe disaggregation of content in Australia has ramped up in the past year, with more subscription video on-demand (SVOD) services expected either imminently - like Disney+, Apple TV+ and Foxtel's drama and entertainment streaming service - or in the near future, such as NBCUniversal's Peacock.\n\nConsumers are spoiled for choice of video streaming services. Sam Mooy\n\n\"Audiences will be more confused, not less confused, as the market continues to add more services,\" Deloitte national media sector leader Adam Power told The Australian Financial Review.\n\n\"I think what we’ll see is that it’s the viewers who are going to determine what premium content is because they’ll be voting with their wallets, or credit cards, each month. I don’t think anyone is going to be paying for seven or eight SVOD subscriptions per month, so people are going to have to make choices, and there will be winners and losers out of that.\"\n\nAccording to Deloitte's Media Consumer Survey 2019, consumers feel they increasingly need more than one streaming service to get all the content they are looking for. Fifty-seven per cent of Millennials reckon one streaming service doesn't cut it, and 46 per cent said it was hard to know which service had the content they wanted.", "description": "Deloitte's Media Consumer Survey finds consumers want more than one streaming service, and are spoiled for choice. They'll soon be voting with their wallets.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_3517%2C$y_972/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/d9a16df7afc3dd6c5ee752d77afcd92b2999abc4", "published_at": "2019-10-11"}