{"pub": "cnbc", "url": "https://cnbc.com/2019/10/02/the-end-of-commissions-for-stock-trading-is-near-as-td-ameritrade-cuts-to-zero-matching-schwab.html", "downloaded_at": "2019-10-02 15:28:40.829048+00:00", "published_at": "2019-10-02", "title": "The end of commissions for trading is near as TD Ameritrade cuts to zero, matching Schwab", "language": "en", "text": "The \"race to zero\" for the brokerage industry is over.\n\nTD Ameritrade said late Tuesday that the company will eliminate all commission fees for online U.S. stock, exchange-traded fund and option trades. The move came hours after brokerage giant and competitor Charles Schwab said it is ending commissions for online trading next week. Analysts expect most of the industry to follow suit shortly.\n\nThe match by TD Ameritrade failed to shore up its crashing stock. Shares of TD fell 2.5% on Wednesday following a 25% plunge on Tuesday, its worst day in 20 years. Analysts cited a higher reliance on commission revenue as a reason for its outsized decline.\n\n\"We expect Fidelity and E*TRADE to react next and announce cuts to their own commission rates over the short-term, with both likely matching SCHW's/AMTD's zero rate,\" said Credit Suisse research analyst Craig Siegenthaler in a note to clients titled \"Finishing the Race to Zero.\"\n\nStarting Thursday, TD Ameritrade's commissions will go from the previous $6.95 to zero. Options will still have a 65 cent per contract fee. The changes will apply to securities on Canadian exchanges as well.\n\n\"With a $0 price point and a level playing field, we are even more confident in our competitive position, and the value we offer our clients,\" said Tim Hockey, TD Ameritrade's president and chief executive officer, in a press release.", "description": "Shares of TD Ameritrade continued their slide Wednesday as the brokerage \"race to zero\" quickens.", "authors": ["Maggie Fitzgerald"], "top_image": "https://image.cnbcfm.com/api/v1/image/106160321-1570024667657gettyimages-631888726.jpeg?v=1570024688"}