{"pub": "yahoo", "url": "https://news.yahoo.com/raid-gives-trump-timely-win-211224804.html", "downloaded_at": "2019-10-28 00:35:14.997209+00:00", "title": "Raid Gives Trump Timely Win But Unlikely to Slow Impeachment", "language": "en", "text": "(Bloomberg) -- An audacious military raid that ended with the death of the U.S. government’s most-wanted terrorist delivered Donald Trump a political boost just when he needed it most.\n\nIslamic State leader Abu Bakr al-Baghdadi’s demise provided the president at least a brief respite from the House’s accelerating impeachment inquiry, and also served as a measure of redemption after a messy retreat of U.S. forces in Syria that had drawn criticism from both parties.\n\nAl-Baghdadi’s death during a U.S. special forces raid drew measured praise from Democrats but surely won’t eclipse impeachment, which looks increasingly likely to end with Trump’s trial in the Senate. House Speaker Nancy Pelosi called on Trump to brief Congress on the Syria operation, after the president said he specifically didn’t tell her in advance out of concern the mission would be leaked.\n\nThe raid also served to highlight longstanding tensions between Trump and the U.S. intelligence community, which he has repeatedly criticized for its conclusion that Russia interfered in the 2016 election on his behalf. In this instance, the nation’s spies delivered the president an accomplishment, a fact he acknowledged with a back-handed compliment.\n\n“When we use our intelligence correctly, what we can do is incredible,” Trump said, after first thanking Russia and Turkey for their help with the al-Baghdadi mission. “When we waste our time with intelligence, that hurts our country because we had poor leadership at the top, that’s not good.”\n\nAccelerating Inquiry\n\nTrump has repeatedly questioned how Democrats can impeach him if he’s doing a good job, and the al-Baghdadi raid -- which the president ordered without hesitation, according to a person familiar with the matter -- may help that argument. On Sunday, voters watched on live television as the president described a risky and yet near-flawless military operation that ended with the death of a man the U.S. holds responsible for a string of atrocities, including the capture and execution of several Americans.\n\nBut momentum toward impeachment is so great that even Trump’s finest moment as commander-in-chief is unlikely to derail it. Last week’s testimony by senior diplomat William Taylor -- who described a secret, alternative U.S. foreign policy in Ukraine directed by Trump’s personal attorney, Rudy Giuliani -- has accelerated Democrats’ efforts. Representative Jamie Raskin, a Maryland Democrat, said Taylor’s testimony left lawmakers with “smoking gun sitting on top of smoking gun.”\n\nPublic Hearings\n\nClosed-door interviews of witnesses are expected to conclude in about two weeks, and will be followed by public hearings. Lawmakers in both parties now view an eventual House vote on articles of impeachment as inevitable.\n\nSunday’s announcement included familiar Trumpian notes: he teased the news on Twitter the night before -- “Something very big has just happened!” -- and held an ad hoc news conference after his statement in the White House Diplomatic Room, speaking for nearly 50 minutes.\n\nIn a comment that raised some eyebrows, Trump declared al-Baghdadi’s death more significant than the killing of Osama Bin Laden, a hallmark achievement of his predecessor, Barack Obama, that the former president announced in about a 10-minute televised address. “This is the biggest there is, this is the worst ever,” Trump said.\n\nHe also claimed on Sunday that he had recommended the U.S. kill Bin Laden in a book he published in 2000, “The America We Deserve,” and said “if they would have listened to me, a lot of things would have been different.”\n\nBut Bin Laden is mentioned just once in the book, described as one of a number of American adversaries.\n\nDramatic Re-Telling\n\nTrump recounted the Syria raid with camera-ready flair. He described American forces flying in eight helicopters at low altitude over foreign territory, suppressing “local gunfire” at the site of the operation, blowing a hole in the wall of the Islamic State leader’s compound and chasing their target -- whom Trump said was “whimpering and crying” -- into a dead-end tunnel, where he detonated an explosive vest, killing himself and three children and injuring a “beautiful” American military dog.\n\n“He died like a dog; he died like a coward; the world is now a much safer place. God bless America,” Trump said.", "description": "(Bloomberg) -- An audacious military raid that ended with the death of the U.S. government’s most-wanted terrorist delivered Donald Trump a political boost just when he needed it most.Islamic State leader Abu Bakr al-Baghdadi’s demise provided the president at least a brief respite from the House’s accelerating", "authors": ["Jennifer Jacobs", "Josh Wingrove"], "top_image": "https://s.yimg.com/uu/api/res/1.2/YaoEKCuCxlfal6gX7KnvNA--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/7d1398f6046e3d3f210775297972813b", "published_at": "2019-10-27"}