{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/mum-slams-elderly-couple-who-20703478", "downloaded_at": "2019-10-23 08:57:59.362524+00:00", "title": "Mum slams elderly couple who refuse to give up train seats she'd booked for kids", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA mum-of-three has slammed an elderly couple who she claims refused to give up the train seats she had reserved for her family.\n\nAmanda Mancino-Williams says the pair told her it it \"didn't matter\" when she pointed out to the pair the seats had been pre-booked.\n\nAmanda, a writer, took to Twitter to air her fury at the couple's behaviour on a CrossCountry train from Cheltenham to Nottingham.\n\nShe tweeted a picture of the couple saying: \"If a mum with 3 kids and bags has 4 reserved seats for a long train journey, and you're sitting in their seats on a full carriage, don't tell them that their tickets don't matter in a posh voice and then say you're not moving and refuse to make eye contact. Don't be these people.\"\n\n(Image: Manda_like_wine/Twitter)\n\nShe also tweeted a picture of her three children cramped into two seats glazing at the couple opposite.\n\n\"My 12yo is just staring this woman down,\" she tweeted.\n\nWhen the 37-year-old told a train conductor about the couple, who had \"posh voices\", he upgrade her and her three children to first class seats.\n\nShe said: \"A kind man offered me his seat. Spoke to conductor who was calm, lovely, and apologetic, said that instead of engaging with them that he was going to move us to an empty table in first class. I grabbed our bags and turned to the couple and said, with a smile, 'enjoy your seats!'\"\n\n(Image: Manda_like_wine/Twitter)\n\nAmanda told the Sun there was no point in people reserving seats if people are allowed to sit in them and she would have let the couple have the seats if they had a good reason for refusing to give them up.\n\nShe added: \"Her instant dismissiveness of me and the children told me all I needed to know about her. I didn't feel it was my responsibility to acquiesce to that kind of behaviour.\n\n\"I was shocked and tired. Any mother who travels with bags and children knows how your mind is in a thousand places, so things like reserved seats are something you count on.\n\n\"They make your journey manageable. I'd booked a table so the children could do their schoolwork.\"\n\nAmanda's tweet received overwhelming support on Twitter\n\n@nwaby said: \"Should have just sat on them....if they don't move from your seat it's their tough luck...\"\n\n@Emuziek tweeted: \"No way that should be tolerated. You took the time and trouble to reserve seats. They have no business being in your seats. Good on the conductor to help, but they should have assisted and removed those two from your seats. Sends a message.\"\n\nA spokesman for CrossCountry told the Sun the family had been \"let down by others who ignore the labels\".", "description": "Amanda Mancino-Williams said the \"posh\" couple told her the seat reservations \"didn't matter\" on the CrossCountry train from Cheltenham to Nottingham", "authors": ["Lorraine King", "Image", "Manda_Like_Wine Twitter"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20703447.ece/ALTERNATES/s1200/1_Furious-mother-of-three-slams-elderly-couple-for-refusing-to-move-from-the-seats-she-reserved-for-hejpgw.jpg", "published_at": "2019-10-23"}