{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-eurozone-bonds/bond-markets-assess-fallout-as-policy-hawk-lautenschlaeger-quits-ecb-idUKKBN1WB1QQ", "downloaded_at": "2019-09-26 15:22:41.536627+00:00", "title": "Bond markets assess fallout as policy hawk Lautenschlaeger quits ECB", "language": "en", "text": "LONDON (Reuters) - Euro zone bond yields held above two-week lows on Thursday on optimism over U.S.-China trade talks, while the resignation of Sabine Lautenschlaeger from the ECB’s executive board turned focus to what the central bank will look like under its next chief.\n\nThe German share price index DAX graph is pictured at the stock exchange in Frankfurt, Germany, September 25, 2019. REUTERS/Staff\n\nLautenschlaeger, Germany’s appointee to the board and a policy hawk, will resign from Oct. 31, before the end of her full term. The European Central Bank did not give a reason for her resignation.\n\nLautenschlaeger was among the third of ECB policymakers who opposed resuming asset purchases at the bank’s Sept. 12 meeting.\n\nSeveral policymakers have questioned the necessity and effectiveness of the measures since then and Lautenschlaeger’s resignation held the market spotlight in an otherwise quiet session.\n\n“It looks like Draghi is currently on the defensive and needs to explain what he’s up to and why he was the frontrunner of an ECB taking an even more expansionary stance,” said DZ Bank rates strategist Daniel Lenz.\n\nHe was referring to a perception in markets that Draghi was the driving force behind this month’s easing measures, which have prompted a high degree of dissent from a body that normally strives for consensus.\n\nIn an internal email sent to ECB staff, Lautenschlaeger, said she regretted leaving her post early but thought this was the best course of action given her situation.\n\nThe key question for bond markets is who Lautenschlaeger’s replacement will be, as incoming president Christine Lagarde takes office, and whether this could impact the bank’s easing measures: quantitative easing in particular.\n\n“It’s hard to come to any conclusion as the board is evolving now. Even with Draghi’s [replacement] there were so many candidates, but Lagarde was selected,” said Pooja Kumra, European rates strategist at TD Securities.\n\nLagarde will now be the only woman on the board, which should “put pressure on the German government to choose a woman to replace her”, said Pictet Wealth Management strategist Frederik Ducrozet.\n\nPossible replacements, according to Ducrozet, are Bundesbank Vice President Claudia Buch, Isabel Schnabel, a member of the German Council of Economic Experts, and BlackRock Investment Institute head of economics and market research Elga Bartsch.\n\nAnalysts said Schnabel could be considered dovish, while Buch could lean hawkish given her role in the Bundesbank.\n\nMeanwhile, Bank of Italy deputy governor Fabio Panetta is the only candidate proposed to replace outgoing ECB board member Benoit Coeure, who also disapproved of the recent ECB decision.\n\nThis could help shift the board’s balance to the dovish side, said Commerzbank strategist Rainer Guntermann.\n\nMost euro zone bond yields edged down after increases late on Wednesday after U.S. President Donald Trump said a deal to end a nearly 15-month trade war with China “could happen sooner” than people think.\n\nTen-year yields were flat across the region DE10YT=RR FR10YT=RR NL10YT=RR, with Germany’s 10-year bond yield steady at -0.58%, above Wednesday’s almost two-week lows.\n\nFrance will present its 2020 budget to journalists late on Thursday and to parliament on Friday.\n\nFocus will be on more than 10 billion euros of tax cuts as policymakers say monetary easing is reaching its limits in reviving the euro zone’s sluggish economy.", "description": "Euro zone bond yields held above two-week lows on Thursday on optimism over U.S.-China trade talks, while the resignation of Sabine Lautenschlaeger from the ECB's executive board turned focus to what the central bank will look like under its next chief.", "authors": ["Yoruk", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434159659&w=1200&r=LYNXMPEF8P16Y", "published_at": "2019-09-26"}