{"pub": "reuters", "url": "https://in.reuters.com/article/pakistan-economy/pakistan-hopes-to-meet-fiscal-deficit-target-set-by-imf-finance-chief-idINKBN1W103Y", "downloaded_at": "2019-09-16 05:37:36.668086+00:00", "title": "Pakistan hopes to meet fiscal deficit target set by IMF: finance chief", "language": "en", "text": "A trader counts Pakistani rupee notes at a currency exchange booth in Peshawar, Pakistan December 3, 2018. REUTERS/Fayaz Aziz/Files\n\nISLAMABAD (Reuters) - Pakistan is edging towards macro-economic stability after putting in place tough measures to meet a fiscal deficit target set by the International Monetary Fund as part of a $6 billion bailout in July, its finance chief said on Sunday.\n\nAn IMF team is due to arrive in Islamabad on Monday to review progress on the reforms agreed as part of that package, including a cut in the fiscal deficit to 0.6% of gross domestic product from a record 8.9% in the year to June.\n\nAbdul Hafeez Shaikh, the finance chief, said in a news conference that Pakistan was working hard to expand its tax collection base, cut expenditure, and boost non-tax revenues, and was gradually heading towards economic stability.\n\n“We have to increase economic activity in the country and have to maintain a basic macro-economic stability,” he said. “We are seeing one trillion ($6.44 billion) extra in non-tax revenues.”\n\nShaikh said Pakistan had cut its current account deficit by 73% from last year’s level, and added nearly 600,000 new tax filers in recent months.\n\nThe country has been struggling to avert a balance of payments crisis and to prevent its debt from spiralling out of control.\n\nThe budget deficit, at 8.9% of GDP - well above an estimate of 7.1% given by Prime Minister Imran Khan’s government in June, and 6.6% seen in the year ending June 2018 - underlines the severe economic crisis facing the country.\n\nPakistan has a notoriously narrow tax base, with fewer than 1% of its 208 million people filing income tax returns. There is a vast informal economy and several key sectors of the official economy are largely exempt from tax.\n\n($1 = 155.3300 Pakistani rupees)", "description": "Pakistan is edging towards macro-economic stability after putting in place tough measures to meet a fiscal deficit target set by the International Monetary Fund as part of a $6 billion bailout in July, its finance chief said on Sunday.", "authors": ["Asif Shahzad", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190916&t=2&i=1430298453&w=1200&r=LYNXMPEF8F01X", "published_at": "2019-09-16"}