{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/avoid-these-red-flags-while-booking-an-airbnb", "downloaded_at": "2019-10-08 04:11:30.636547+00:00", "title": "How To Avoid Airbnb Scams", "language": "en", "text": "Photo: Shutterstock\n\nLast week, a couple spent over $17,500 on a two-week stay at an Airbnb in Ibiza, Spain — only to discover the listing was a fraud. Upon check-in, they learned that the property didn’t even exist and found themselves scrambling to find a hotel last-minute while struggling to communicate with Airbnb.\n\nWe’ve written a lot about ways to avoid Airbnb scams (and recently shared some of our top advice on the topic with the Washington Post). Still, people often fall victim to scams like fraudulent listings and other rackets on the rental site. Using this story as a case study, let’s dive in and explore the red flags of common Airbnb scams so you can avoid a similar fate.\n\nThe listing is too good to be true\n\nThe apartment you’ve just booked has a renovated kitchen, a hot tub, and its own elevator, and somehow, you’ve snagged it at a competitive price and last-minute, too. Sorry to say it, but if it sounds too good to be true, it usually is. (That’s how scammers get you; they’re not exactly going to draw you in using photos of an apartment that’s falling apart.)\n\nOnce you’ve booked a place and are provided an address, it doesn’t hurt to do an online search for the property. You can use the details you find to match that apartment to a building. If you find that the listing is overpromising on amenities based on your search, then yes, it might very well be a scam. The couple in our example were promised their own elevator and private Turkish bath — both of which turned out to be communal amenities for the building.\n\nA simple online search might have prevented them from going through with the booking. Granted, sometimes, you will find excellent properties that are available last-minute, but it’s always good to practice a little cynicism anyway.\n\nThe host stops communicating before your trip\n\nWhen your reservation on Airbnb is confirmed, a host will generally reach out to you with details of your booking via the platform’s direct messaging system; this might include directions, amenities, and anything else that might impact your stay. But communication up until the day of your travel is important — if your host goes radio silent in the days leading up to your trip (and especially when you’ve messaged them to ask fairly simple questions), it is almost always a red flag.\n\nIn the case of the couple who booked a rental in Spain, their host went quiet as their trip’s dates approached, which should have been an indication that their trip wouldn’t go as planned. To avoid this, reach out to your host at least a few days before your scheduled trip; if you run into issues, contact Airbnb immediately.\n\nAlso, it’s important to know how payment works. Upon confirmation of booking, Airbnb processes your payment and holds onto it until around 24 hours after you’ve checked in to your rental; at this point, your host receives payment. This means that if you do run into an emergency, it’s important to contact Airbnb immediately so that you can obtain a refund. (For new hosts, however, payment is retained by Airbnb for around 30 days after a guest has checked in, so you’re technically in a safer position.)\n\nAnd always avoid contact outside of Airbnb’s website as much as possible. In the event Airbnb must settle a dispute, they’ll rely on your messaging history to resolve the issue. (Of course, there are exceptions; you might find that a host asks for your email to provide a more extensive guide to their home. Just be careful of clicking on any links that phish for your information.) And payment, too, should only be processed through Airbnb’s website so you can be protected in the event of a scam. Avoid any incentives to pay outside of Airbnb, like an offered discount.\n\nThe property has few or no reviews\n\nWhile never mentioned explicitly, the underlying assumption beneath the couple’s example is that the listing had little or no reviews. (Based on the couple’s retelling of the story, they only mention being drawn to the listing based on photos.)\n\nAs we’ve mentioned before, always, always cast a critical eye on reviews; a lot of reviews are always better than very few (assuming, of course, that they aren’t all negative). And if there are very few reviews, check for reviews on the host’s other properties or even their reviews as guests on Airbnb.\n\nAlso, be on the lookout for cancellation alerts; when a host cancels on a guest for whatever reason, a cancellation notification will automatically show up in their reviews. If you spot a lot of these interspersed between actual reviews, it isn’t necessarily an indication of a scam, but could be a sign that your host is a less-than-reliable. And if you’re still feeling a little unsure about your booking, you might even contact the host to ask for additional photos of the rental, so you can better guarantee they’re not all stock photos or ones you can easily find on the web.", "description": "Last week, a couple spent over $17,500 on a two-week stay at an Airbnb in Ibiza, Spain — only to discover the listing was a fraud. Upon check-in, they learned that the property didn’t even exist and found themselves scrambling to find a hotel last-minute while struggling to communicate with Airbnb....", "authors": ["Chris Jager"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/bgr1uwb4bushvfs5hxih.jpg", "published_at": "2019-10-08"}