{"pub": "dailybeast", "url": "https://thedailybeast.com/newsmax-enlists-bill-oreillys-top-producer-david-tabacoff-for-war-on-fox-news", "downloaded_at": "2019-09-06 12:09:48.305582+00:00", "title": "Newsmax Enlists Bill O’Reilly’s Top Producer David Tabacoff for War on Fox News", "language": "en", "text": "In its longshot quest to take on Fox News as the leading conservative cable-news destination, Newsmax has enlisted the services of Bill O’Reilly’s long-time executive producer.\n\nNewsmax chief Chris Ruddy confirmed to The Daily Beast that David Tabacoff, who served as O’Reilly’s right-hand man for 16 years, is working with the upstart cable channel as it ramps up its efforts to compete with rivals like Fox News and One America News Network.\n\n“David is advising us as a consultant,” Ruddy said in an email. “He is one of the greatest producers in television, and we’re glad to have him assist us in building out our programming as we reach over 70 million cable homes.”\n\nTabacoff worked for ABC News for 25 years before joining Fox News in 2001, serving as O’Reilly’s top producer for nearly two decades until the primetime star’s ouster over multiple sexual-harassment settlements. Tabacoff clarified to The Daily Beast that he is “working as a consultant with a few clients.”\n\nSince leaving Fox News shortly after O’Reilly’s April 2017 firing, Tabacoff has kept a relatively low profile. Although he is a veteran of Fox’s decidedly right-wing primetime programming, his Twitter account resembles the views of a #Resistance liberal—highly critical of President Trump with retweets of Never-Trump Republicans and liberal figures like historian Kevin Kruse.\n\nTabacoff isn’t the first ex-Fox News executive Ruddy has brought over to the Newsmax fold. Earlier this year, Ruddy hired Michael Clemente—the first Fox News executive to exit the network in 2016 following founder Roger Ailes’ firing over sexual-misconduct allegations—to serve as the CEO of Newsmax TV. Several months later, Clemente reportedly stepped down and moved into a “consultancy role.”\n\nAnd Newsmax has also made use of O’Reilly himself—despite his infamous firing from Fox—often as a featured guest, occasionally airing his “No Spin News” broadcasts, and having him serve as an analyst during State of the Union coverage. And Ruddy has suggested he would like to bring on other ex-Fox News stars like Megyn Kelly, whom he described as “controversial” but a “proven cable news ratings leader” following her exit from NBC late last year.\n\nBeyond executive hirings, Newsmax is certainly staffing up in recent weeks as it continues to battle for right-wing viewership. Since late August, the company has posted eight job openings, including such key editorial positions as news director, producer, TV booker, technical director, and executive producer.\n\nWhile Newsmax’s bottom-scraping Nielsen numbers would suggest Fox News isn’t overly concerned with the upstart channel, it hasn’t stopped Fox from forbidding its stars from appearing on Newsmax programming. Earlier this week, during an interview with Trump-boosting radio host Sebastian Gorka, weekend host Jeanine Pirro revealed that Fox brass told her she “cannot do Newsmax.”\n\nAnd Newsmax, of course, seized upon that news, running Facebook ads about Fox’s prohibition on its right-wing star from appearing on another conservative outlet. Such a move is undoubtedly part of the fledgling channel’s ongoing attempt to woo potentially disgruntled, decidedly pro-Trump Fox viewers.\n\nTrump has recently escalated his public criticism of Fox News for not displaying undivided loyalty to him and his agenda. For the crime of giving even remotely fair coverage to 2020 Democratic candidates, the president has encouraged his supporters to “start looking for a new News Outlet” because Fox “isn’t working for us anymore!”\n\nAt the same time, Ruddy—who is often quoted in the media as the president’s friend and confidant—has made it known that he envisions Newsmax as the truly pro-Trump option. “There is a growing disenchantment with Fox News and we are definitely seeing a rise in viewership with Newsmax,” Ruddy told The Hollywood Reporter last month after a series of anti-Fox tweets from the president.\n\nRuddy has claimed that Newsmax reaches more than 70 million households and will top 80 million by the end of the year. At the same time, while Newsmax has purportedly widened its reach, Trump has largely ignored the network in favor of One America News, another overtly pro-MAGA outlet.\n\nThe president has seemingly embraced OANN as a slight to Fox News, live-tweeting their commentary and insisting that “whenever possible, I turn to @OANN,” as he wrote last month. In fact, since taking office, Trump has tweeted about One America News on 15 separate occasions.\n\nMeanwhile, in that same period, the president has only tweeted about Newsmax once—in a tweet last month that also tagged OANN and Fox & Friends.\n\n—Andrew Kirell contributed reporting.", "description": "As Trump bashes Fox News for insufficient loyalty, Newsmax seeks to woo disgruntled Fox viewers. Now it has hired an architect of Fox’s ratings success to help out.", "authors": ["Justin Baragona"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1567740717/190904-oreilly-newsmax-tease_cudu7k", "published_at": "2019-09-06"}