{"pub": "washingtonpost", "url": "https://washingtonpost.com/news/voraciously/wp/2019/10/15/heres-the-cold-hard-truth-about-boozy-canned-coffee-most-of-it-is-terrible", "downloaded_at": "2019-10-15 15:01:39.818503+00:00", "title": "Here’s the cold, hard truth about boozy canned coffee: Most of it is terrible", "language": "en", "text": "Perhaps the drinks on the table before us were an inevitability. After all, if one trend is good (cold coffee is hot!), why not layer on another (millennials love alcoholic drinks that don’t taste like booze) — and then another (they also are crazy for canned beverages!) for good measure?\n\nA turducken of fads is one way of seeing the mini-boomlet of iced coffee laced with varying degrees of malt or wine-based liquor and served in the slender aluminum tubes that have come to dominate the beverage aisles — a trend for which you can thank/blame the hard seltzer phenom White Claw.\n\n[The key to White Claw’s surging popularity: Marketing to a post-gender world]\n\nBeer giant Pabst Blue Ribbon was one of the first big entrants, introducing its hard coffee this summer. Then the third-wave coffee maker La Colombe partnered up with MillerCoors for its high-end, cold-brewed version. Both are available in limited markets as the companies test demand. Smaller labels, too, have gotten into the mix.\n\nAnother explanation for it is purely functional. Booze might be fun, but it can make you sleepy, too, so pairing it with caffeine keeps the good times going. As one colleague described the downers/uppers mix: “It’s the Judy Garland of drinks.”\n\nThe marriage of alcohol and caffeine isn’t new, of course. Irish coffee crossed the pond a decade before aging rocker Bono was even born. The espresso martini followed in the 1980s (its perhaps apocryphal origin story is that legendary London bartender Dick Bradsell created it when a supermodel — some tales say Naomi Campbell, others Kate Moss — ordered something “to wake me up, then [expletive] me up.”)\n\nIn more recent history, the combo brings to mind the vodka-Red Bull craze of the early aughts and Four Loko, whose early formulation was dubbed “blackout in a can” and eventually banned by the Food and Drug Administration in 2010.\n\nSo, back to those drinks on the table. We assembled four varieties of boozy cold coffees and gave them a whirl — and a few sips. As a class, our tasters found them to be super-sweet and overly creamy, with one exception. But the overriding response was simply … confusion.\n\nWhen, exactly, were we supposed to knock back these drinks? The sugar and dairy bombs are hardly light, session-able tipples. And they don’t pair very well with food, except maybe brunch, as one taster suggested. Or dessert? Maybe in place of dessert, we wondered? We imagined combining them with ice cream in shakes and affogato-style concoctions — but wait, wasn’t the can format supposed to make them take-anywhere convenient?\n\nHere’s what we tasted:\n\nCafe Agave Spiked Cold Brew\n\nThe offerings from this start-up business from San Diego’s La Jolla neighborhood distinguish themselves by being the booziest of the bunch. They clock in at 12.5 percent alcohol by volume, more than twice that of the others we tasted, with a base of wine instead of malt. The company has four flavors: espresso, mocha, vanilla-cinnamon and salted caramel.\n\nWe detected the alcohol-forward profile of all of them — as well as a cloying sweetness we attributed to the namesake agave syrup — but we were divided on whether this was a good or bad thing. One taster panned the “unpleasant alcohol burn,” while another liked that “at least it’s not pretending it’s not booze.” The salted caramel and vanilla-cinnamon varieties were across-the-board losers, while the mocha and espresso cans fared better.\n\nLa Colombe Hard Cold Brew\n\nThe pairing of a legit coffee brand with a beer behemoth made us optimistic about this one. And the can’s sleek gold-on-navy design was another classy clue. Once poured, the line (it comes in black and vanilla-flavored, both 4.2% ABV) also distinguished itself by being the only we tasted to omit dairy, meaning the concoctions were lighter-bodied and less dessert-like.\n\nThe black variety was preferred, with our tasters agreeing that it tasted like a regular chilled coffee or espresso — a decent bean even, with one sipper detecting a pleasant “berry bitterness.” We preferred the minimal sweetness of the black over the vanilla, which one likened to “the watery end of some vanilla Frappuccino that you sip through a straw before tossing the cup in the trash.”\n\nNewground Hard Dutch Latte\n\nThis Dutch import comes in two latte varieties: chai and regular cafe. The pale, weakly spiced chai got low marks, but several tasters thought the cafe latte, with its heavy-bodied creaminess, could swap in for an after-dinner drink, though at 5% ABV it’s lower-octane than most nightcaps. “Reminds me of Baileys Irish Cream,” one said.\n\nPabst Blue Ribbon Hard Coffee\n\nOur tasters identified something awfully familiar about the flavor of this one, but there was no consensus on just what it was. “Nestlé Quik,” one suggested. Other sweets that it conjured included “a liquefied malted-milk ball,” a “milkshake” and a “melted Snickers.” So dessert, then — with a 5% ABV kick, that is.\n\nPerhaps it was the nostalgic associations that made at least one of us cop to a guilty-pleasure attraction to the can: “Why am I ashamed to say I like it?”\n\nMore from Voraciously:\n\nImpossible vs. Beyond: We tested cook-at-home versions to see who makes a better vegan burger\n\nThis high-tech vegan ice cream may be good enough to fool even die-hard dairy lovers\n\nKFC’s new fried chicken and doughnut sandwich is terrifying and delicious", "description": "After tasting some of the biggest brands, we were left with a question: When are we supposed to drink this stuff?", "authors": ["Emily Heil", "Food Reporter", "October At Am", "Emily Heil Is A Reporter Covering National Food News", "Trends. Previously", "She Co-Authored The Reliable Source Column For The Post."], "top_image": "https://www.washingtonpost.com/resizer/SFFjV9MZ9-64VI3KRbN6rqUbfVo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3UZRG3RAFIY2XFYNTA33TXURRA.jpg", "published_at": "2019-10-15"}