{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7633055/Business-rates-broken-says-Treasury-Committee.html", "downloaded_at": "2019-10-31 00:09:11.451969+00:00", "title": "Business rates system is broken, says Treasury Committee", "language": "en", "text": "The Government must look at alternatives to the “broken” business rates system crippling high street retailers, the Treasury Committee has said.\n\nThe influential select committee has warned that the current system of rates on businesses is “unfair” as it places greater pressure on high street shops than other sectors.\n\nThe Government should examine other possible tax systems ahead of the 2020 spring statement, the committee said in its report on the impact of business rates on business.\n\nThe delayed report has been released following the appointment of Mel Stride as the new committee chairman.\n\nBusiness groups have called on the Government to provide retailers with an “immediate respite” from increases in the property tax.\n\nThe committee members said they were presented with a variety of alternatives to the current system but none of them has yet been “sufficiently modelled” to work out which would be preferable.\n\nThe treasury committee said the current business rates system is currently `unfair´ against struggling high street retailers (PA)\n\nPossible alternatives to business rates included a land value tax, online sales levy, profits tax, single consolidated tax and hybrid tax.\n\nAlison McGovern MP, the Treasury Committee’s lead member for the inquiry, said: “It’s abundantly clear that the current business rates system is broken.\n\n“The tax represents an increasing burden on businesses, particularly those with a physical high street presence struggling to remain competitive.\n\n“The Government must ensure that business rates align with its aim to boost productivity and do not dis-incentivise growth.”\n\nThe committee’s report revealed that business rates generated £31 billion in income for the Government in the past 12 months, with the revenue they have generated increasing faster than the rate of inflation.\n\nIt also said that the Treasury should review all business rates to ensure that they remain necessary, as further reliefs would “add a further layer of bureaucracy to an already complex system”.\n\nBusiness rates are set to increase by 1.7% next year, meaning that retail businesses in England are expected to shoulder an extra £137 million in costs.\n\nAlex Probyn, UK president of expert services at ratings advisory firm Altus Group, said: “The reality is successive governments have been far too reliant upon commercial property for tax revenues, culminating in a business rebellion against the tax.\n\n“Rather than kicking the can down the road, what firms need is an immediate respite from ever-increasing property taxes that are not only uncompetitive but the highest across Europe – which will rise yet again in April unless substantive action is taken to freeze the tax rate.”\n\nThe British Retail Consortium (BRC) – which wrote a letter to the Government in August calling for business rates to be frozen with support from 50 retailers – said it “strongly welcomed” the “excellent” report.\n\nHelen Dickinson, chief executive of the BRC, said: “The Treasury Select Committee has identified key flaws in our broken business rates system. The BRC has long been calling for many of the key recommendations.\n\n“Any party that wants to support local high streets should commit to implementing the committee’s reforms as a first step.\n\n“Business rates are a significant driver of store closures and job losses and retailers have been getting a raw deal for too long.”", "description": "The influential select committee has called on the Government to introduce a new system of property tax.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/31/00/wire-20403052-1572480290-18_636x382.jpg", "published_at": "2019-10-31"}