{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/jim-cramer/jim-cramer-how-iger-and-benioff-let-twitter-get-away-15100759", "downloaded_at": "2019-09-25 13:41:43.723309+00:00", "published_at": "2019-09-25", "title": "Jim Cramer: How Iger and Benioff Let Twitter Get Away", "language": "en", "text": "Could both Bob Iger and Marc Benioff both be flat out wrong in their assessment of their decisions not to buy Twitter (TWTR) back in 2016 when the company's stock was dirt cheap and the company was ready to be had?\n\nWe are blessed this fall with two incredible autobiographies, The Ride of a Lifetime by Disney's (DIS) Bob Iger and Trailblazer by Salesforce's (CRM) Marc Benioff. You don't get tell all books by reigning CEOs. They are usually the province of retired masters of the universe and they are filled with platitudes and bromides that make all praise just a form of log-rolling with the hopes of getting praise back when the critics write their own memoirs.\n\nThe only joy to the process is the book party and an occasionally salacious anecdote that's told and retold during an arduous book tour.\n\nThese books are not like those; they are living breathing judgments of their own careers, warts and all, although there's dermatological minimization when possible.\n\nExcept toward one decision, the decision by both men during the fall of 2016 to abandon the acquisition of Twitter during the stock's collapse into the mid-teens because of a severe drop in business and a dysfunctional, unwieldy amalgam of, in retrospect, easily excised extraneous, money-losing properties.\n\nBenioff describes how he wades into Salesforce because he loves the company but his \"man down\" anecdote, where he actually falls on the way to explain the deal to his shareholders, metaphorically describes both the proposal and rejection of both his short-term renter and long-term holders of his stock.\n\nIger looked hard but then, as he told me on Mad Money, couldn't reconcile what seemed to be clash of styles between a gentle and sweet Disney and a mean and often harsh Twitter that all of us are very familiar with.\n\nBoth are proud they dodged the Twitter bullet.\n\nBut, in retrospect, was it really a bullet? At the very moment they were considering the acquisition with the company's fortunes declining by the day, management was putting in a turnaround strategy that gave those who bought when they kyboshed their own deals a double if they just hung on for a short term ride to riches.\n\nNot only that, but again, in retrospect, the initial instincts of both men were correct. What would Disney do with Twitter? It's simple: Disney would have been given rights to a gigantic number of NFL games on Twitter, something that would have made ESPN plus indispensable to fantasy owners, gamblers and those who didn't care to pay the onerous Direct TV season ticket price. No, not all the game were included but Twitter did have a sweetheart deal with the NFL that would have made any discussion about the worthiness of the deal the rare no-brainer. As far as the meanness of Twitter? Leave that to artificial intelligence to snuff out. The technology's there to make it work.\n\nAs far as Benioff? There were two ways to win. First, Twitter would give the sales clouds an unbelievably proprietary data base of what's trending, what's working, to help customers, which is, of course, the entire theme of Trailblazer. And the Direct Messaging system would have given customers instant access to all banks that are so important to his book of business. How many times has your credit card been denied when you are overseas because they can't prove who you are? Secure Direct Messaging would change that instantly. Few products could give you a better 360 degree help than Twitter for any of Salesforce's customers.\n\nI think both men botched this one because of what, in Iger's case, he saw as an image problem and in Benioff's case, he saw as a shareholder rebellion. But buying Twitter would have been a huge win for both of them, and not just because the stock subsequently advanced dramatically from where Salesforce was willing to pay and doubled from the price Iger could have gotten the asset.\n\nIf I had written either book I wouldn't be so proud as to admit the decision were right. I would preface it as the one that, unfortunately, got away.\n\n(Disney and Salesforce are holdings in Jim Cramer's Action Alerts PLUS member club. Want to be alerted before Jim Cramer buys or sells DIS or CRM? Learn more now.)", "description": "Both are proud they dodged the Twitter bullet. But, in retrospect, was it really a bullet?...TWTR", "authors": ["Jim Cramer", "How Iger", "Benioff Let Twitter Get Away", "Both Are Proud They Dodged The Twitter Bullet. But", "In Retrospect", "Was It Really A Bullet", "Stocks Quotes In This Article", "Bob Lang", "Paul Price", "Doug Kass"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/aa087f61-65cf-11e9-a10a-bb3bb7a43879.png"}