{"pub": "cbs", "url": "https://cbsnews.com/news/panera-bread-worker-says-she-was-fired-for-video-showing-frozen-mac-and-cheese", "downloaded_at": "2019-10-14 23:20:37.226183+00:00", "title": "Panera Bread worker says TikTok video showing frozen mac-and-cheese got her fired", "language": "en", "text": "A former Panera Bread employee apparently paid a stiff price for appearing in a video showing the chain's popular macaroni and cheese is pre-packaged and frozen.\n\nShared on the app TikTok with the caption \"exposing Panera,\" the short video — which has amassed more than 6 million views — shows a plastic packet of frozen mac and cheese dropped into boiling water, cut open and poured into a bowl. A woman with a Panera Bread cap then gives a thumbs up over the ready-to-serve meal.\n\nThe woman in the video on Friday announced on Twitter that \"I lost my job for this.\"\n\nlol i lost my job for this video https://t.co/0Ao8a4revN — Bri (@BriiRamirezz) October 11, 2019\n\nThe viral clip drew a stream of commentary and complaints on social media, with one Twitter user calling it \"proof\" that the company's mac and cheese \"is garbage.\"\n\nOthers were disdainful that anyone would be surprised to learn that the restaurant chain used frozen food. \"Did people really think there was a chef hanging out in the kitchen of Panera Bread making their mac and cheese? This is literally how every fast-food joint operates,\" declared another Twitter user.\n\nI don’t get what she’s exposing? Did people really think there was a chef hanging out in the kitchen of Panera Bread making their Mac and Cheese? This is literally how every fast food joint operates, don’t be fooled. — tylerrr (@MattPerham2) October 12, 2019\n\n\"We can't comment on personnel matters,\" a spokesperson for Panera told CBS MoneyWatch.\n\nAccording to Panera, it sells more than 3 million mac-and-cheese servings a month \"Our mac and cheese is made off site with our proprietary recipe developed by our chefs and using our sourced ingredients that met our standards for our clean menu offerings,\" the spokesperson said. \"It is shipped frozen to our baker cafes — this allows us to avoid using certain preservatives that do not meet our clean standards.\"\n\nPrivately held by JAB Holding, Panera operates more than 2,300 bakery-cafes in the U.S. and Canada.", "description": "Restaurant chain on the defensive after viral video depiction of its food preparation conflicts with brand's image", "authors": ["Kate Gibson"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/14/8ab74a87-656b-46b3-8d43-efb1b39d1433/thumbnail/1200x630/37aa0d8507e1c4f0c4952f8d1a15d9d8/mac-and-cheese-large-desktop.jpg", "published_at": "2019-10-14"}