{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/house-to-officially-authorize-impeachment-inquiry-after-all.html", "downloaded_at": "2019-10-30 00:01:59.066635+00:00", "title": "House Will Officially Authorize Impeachment Proceedings After All", "language": "en", "text": "Pelosi changes direction. Photo: Brendan Smialowski/AFP/Getty Images\n\nAfter extensive caterwauling by Republicans everywhere about the failure of House Democrats to hold a formal vote authorizing impeachment proceedings, Pelosi has finally decided to oblige them. It’s not really a flip-flop because Nancy Pelosi always held open this possibility while insisting (correctly) it was discretionary, not mandatory. The House will reportedly vote on Thursday on a resolution released today, which stubbornly refers to the impeachment inquiry as “ongoing” and “existing,” and then lays out procedures to “ensure transparency.” This brings the current impeachment proceedings into line with the Nixon and Clinton precedents.\n\nThe draft resolution instructs the six committees (Intelligence, Judiciary, Foreign Affairs, Financial Services, Oversight and Reform, and Ways and Means) that could potentially recommend articles of impeachment to keep on keeping on, while clarifying their subpoena powers and the rights of the Republican minority. This includes at least some open hearings for Intelligence, whose earlier closed hearings caused such a brouhaha last week. As Pelosi noted, House Dems were “taking this step to eliminate any doubt as to whether the Trump Administration may withhold documents, prevent witness testimony, disregard duly authorized subpoenas, or continue obstructing the House of Representatives.” That suggests she wants to buttress Democrats’ case for enforcing its subpoenas in the courts, though other intel suggests they aren’t going to delay impeachment to wait on the resolution of court fights.\n\nThough Pelosi is basically doing what Republicans have excitedly been demanding, that won’t earn her any GOP votes, as the New York Times reported:\n\nRepublicans signaled that after weeks of calling for a vote on the inquiry, they would oppose the resolution en masse. “We will not legitimize the Schiff/Pelosi sham impeachment,” Representative Kevin McCarthy, Republican of California and the minority leader, said in a tweet.\n\nThere is no satisfying these birds, who have adopted their master’s habit of fighting angrily for one position, and then quickly abandoning it for another which will be pressed just as furiously.\n\nYou have assume Pelosi is assured of the votes to pass the resolution before announcing it, even if a few vulnerable red-state incumbents get a pass to abstain. But it could preview the vote for actual articles of impeachment later this year.\n\nSign Up for the Intelligencer Newsletter Daily news about the politics, business, and technology shaping our world. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "In a change of direction, House Democrats announced plans to formally authorize an “existing” and “ongoing” impeachment inquiry, setting rules and strengthening the House’s demands for witnesses and documents and knocking Republicans off-balance.", "authors": ["Ed Kilgore"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/29/29-pelosi.w1200.h630.jpg", "published_at": "2019-10-29"}