{"pub": "marketwatch", "url": "https://marketwatch.com/story/bill-oreilly-calls-out-beto-orourke-for-lying-he-probably-wishes-he-didnt-2019-10-16", "downloaded_at": "2019-10-16 20:38:35.634982+00:00", "title": "Bill O’Reilly calls out Beto O’Rourke for lying — he probably wishes he didn’t", "language": "en", "text": "Presidential hopeful and former Texas congressman Beto O’Rourke, in a seemingly innocuous comment made during Tuesday night’s debate, said he had met a woman who was working four jobs to support her special needs child.\n\nHe was responding to a question of whether a wealth tax, a hot-button topic ahead of the 2020 election, is the best way to deal with income inequality.\n\n“She wants to know how we are going to help her, how we’re going to make sure that her child has the care that she needs, that we strengthen protections for those with disabilities, that she just has to work one job because it pays a living wage,” O’Rourke said. This seemed to rile up Bill O’Reilly:\n\nBeto says he met a woman working FOUR jobs. And raising a special needs child. I don’t believe him. Sorry. — Bill O'Reilly (@BillOReilly) October 16, 2019\n\nIt didn’t take long for O’Rourke’s digital director to fire back:\n\nI was there. Her name was Gina. Her daughter is named Summer. Here's their picture.\n\n\n\nAsshole.https://t.co/Mbo8mnYTLE pic.twitter.com/jozvEMECwP — Rob Flaherty (@Rob_Flaherty) October 16, 2019\n\nAnd then O’Rourke himself:\n\nThis is her. Her name is Gina. Her daughter's name is Summer. The problem with our economy is she has to live in her car—while a disgraced TV host like you makes millions. https://t.co/J1Scsu3GJ5 pic.twitter.com/W1shXxVyeg — Beto O'Rourke (@BetoORourke) October 16, 2019\n\nFrom there, the interaction took on a Twitter TWTR, -0.92% life of its own, with the internet dragging O’Reilly over his history of sexual assault allegations and subsequent settlements that led to his leaving Fox News in 2017 as well as for his being detached from the real world and real financial problems.\n\nNot every woman has a huge sexual-harassment settlement in the bank. — Dave Hogg (@stareagle) October 16, 2019\n\nYou are a great one to be calling out what to believe. “$32 million to just a single *one* of your harassees because you were innocent.”\n\n\n\nTell us about that, mr. ‘I don’t believe a woman, especially a mother”... — James Doyle (@priusjames) October 16, 2019\n\nQuiet, everybody! A disgraced anchorman is sitting in sweatpants in his rumpus room yelling about things he doesn't understand! — Jared Lipof (@jaredlipof) October 16, 2019", "description": "Presidential hopeful and former Texas congressman Beto O’Rourke, in a seemingly innocuous comment made during Tuesday night’s debate, said he had met a woman...", "authors": ["Shawn Langlois", "Social-Media Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT417_orourk_ZG_20191016113155.jpg", "published_at": "2019-10-16"}