{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/13/medvedev-wins-shanghai-masters-for-fourth-title-of", "downloaded_at": "2019-10-13 11:35:55.316339+00:00", "title": "Medvedev wins Shanghai Masters for fourth title of the year", "language": "en", "text": "SHANGHAI (AP) - Daniil Medvedev extended the form that made him the hottest player in men’s tennis when he captured the Shanghai Masters title with a 6-4, 6-1 win over Alexander Zverev on Sunday.\n\nThe third-seeded Medvedev picked up his third title in six consecutive finals played since the tour returned to hard courts after Wimbledon in July. He also won the Masters 1000-level tournament in Cincinnati and the St. Petersburg trophy in that stretch.\n\nLast month, Medvedev also made it to his first Grand Slam final at the U.S. Open where he challenged Rafael Nadal through five sets before the Spaniard secured his career 19th Grand Slam trophy.\n\n“It’s something outrageous what I’ve done in the last few months,” Medvedev said on the court after his win. “I wouldn’t have believed it.”\n\nThe 23-year-old Medvedev is currently 29-3 in matches played in the past six tournaments.\n\nMedvedev leads the 2019 ATP Tour season in four categories. He’s won the most matches at 59, won the most hard court matches at 46, won the most matches at Masters 1000 tournaments at 22, and reached the most finals at nine with four titles captured.\n\nMedvedev and the 22-year-old Zverev are the youngest finalists at an ATP Masters 1000 event since a 22-year-old Novak Djokovic defeated a 23-year-old Gael Monfils at the 2009 Paris tournament.\n\nThe fifth-seeded Zverev had won all four of his previous encounters against Medvedev, but all of those matches were played prior to this year, which has seen the Russian become nearly invincible of late.\n\n“As I said yesterday you’re probably the best player in the world right now and it’s unbelievable,” Zverev said to Medvedev during the on-court ceremony. “All the best to you.”\n\nZverev presented Medvedev with two gifts - back-to-back double faults at 30-30 in the 10th game - to enable the Russian to secure the first set 6-4.\n\nEarlier in the first set, Medvedev led 3-0, but Zverev was able to recoup that first service break on a fifth break point on the Russian’s serve in the fifth game.\n\nClearly the two double faults shook any confidence Zverev might have had in the match. He quickly fell behind 5-0 before the German won his lone game in the second set.\n\nThe Russian served out the 73-minute match with an ace to capture his first career victory over Zverev.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Daniil Medvedev extended the form that made him the hottest player in men's tennis when he captured the Shanghai Masters title with a 6-4, 6-1 win over Alexander Zverev on Sunday.", "authors": ["The Washington Times Http", "Sandra Harwitt"], "top_image": "", "published_at": "2019-10-13"}