{"pub": "npr", "title": "Better Than Cash: How Awards Can Shape Our Behavior", "url": "https://npr.org/2019/02/25/697641324/better-than-cash-how-awards-can-shape-our-behavior", "language": "en", "published_at": "2019-02-25", "downloaded_at": "2019-09-02 07:19:16.707226+00:00", "text": "Better Than Cash: How Awards Can Shape Our Behavior\n\nEnlarge this image toggle caption Mint Images/Getty Images/Mint Images RF Mint Images/Getty Images/Mint Images RF\n\nYou may have noticed that our modern world seems to be saturated with awards.\n\nMany of these awards have been created in the past century. But awards have been around for millennia. The Greeks and Romans had them. Kings and queens have long given them to their bravest warriors. Societies all over the world have recognized their best citizens with prizes.\n\nAwards are so ubiquitous that we rarely stop to ask, do they work? Do prizes inspire and motivate, or do they cause jealousy and resentment?\n\nEconomist Bruno Frey says that when awards are designed well, they can have a powerful effect on our behavior.\n\n\"When people are given an award, in general they are likely to work better, to be more engaged, to have, as we say, higher intrinsic motivation. That is, they like to work... and therefore are contributing really to the social good.\"\n\nThis week, we explore the upside, the downside, and the psychology of awards — and why Bruno thinks they may even be more effective than giving someone cash.\n\nAdditional Resources:\n\n1) Bruno Frey's book, co-authored with Jana Gallus, is called Honours Versus Money: The Economics of Awards.\n\n2) Can an award motivate editors to continue to contribute to Wikipedia? This study explored that question.\n\n3) How can perfect attendance awards affect student motivation? Carly Robinson and colleagues delved into the issue with a recent field experiment.\n\n4) When a mathematician wins a prestigious prize, it should mean that she does more prize-winning work, right? Two researchers found that isn't always the case.\n\nHidden Brain is hosted by Shankar Vedantam and produced by Jennifer Schmidt, Parth Shah, Rhaina Cohen, Laura Kwerel, and Thomas Lu. Our supervising producer is Tara Boyle. You can also follow us on Twitter @hiddenbrain, and listen for Hidden Brain stories each week on your local public radio station.", "description": "Our modern world is saturated with awards. From elementary school classrooms to Hollywood to the hallways of academia, there's no shortage of prizes — and people who covet them. Yet we rarely stop to ask, do they work? We pose that question to economist Bruno Frey, who argues that awards can have a powerful, positive effect on our behavior — but only if they're designed well.", "authors": ["Shankar Vedantam", "Thomas Lu", "Tara Boyle", "Jennifer Schmidt"], "top_image": "https://media.npr.org/assets/img/2019/02/25/gettyimages-761603527_wide-fb101766c876f6321843dc569f577157f3dc02cb.jpg?s=1400"}