{"pub": "yahoo", "url": "https://finance.yahoo.com/news/7-software-stocks-buy-growth-174838168.html", "downloaded_at": "2019-10-20 17:05:30.965433+00:00", "title": "7 Software Stocks to Buy for Growth", "language": "en", "text": "Investors holding software stocks must demand growth from them. After all, software companies hold nothing physically tangible. They may have important intellectual property, but their value comes from the solutions and services their programs offer.\n\nMicrosoft (NASDAQ:MSFT) or International Business Machines (NYSE:IBM) are easy choices for investors who do not want to spend too much time understanding the software business. Yet holding IBM blindly is not without risk. The company reported revenue declining 4%.\n\nSo, investors should consider other software companies that the market does not pay much attention to.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nInvestors should look at software stocks that have strong earnings growth prospects in the next year. If the stock is down from yearly highs or is on a downtrend, that is a bonus for investors looking for discounts. There are seven software stocks that investors should buy for growth. These firms offer unique solutions and therefore have moats.\n\n\n\n\n\nSoftware Stocks to Buy: DocuSign (DOCU)\n\nSource: Shutterstock\n\nDocuSign (NASDAQ:DOCU) stumbled in August when the company issued a weak outlook. But when the company reported quarterly earnings on Sept. 5, it easily beat its downward guidance, sending the stock to 52-week highs. The company has a good chance of growing earnings per share by around 1.5 times and by 57% over the next five years. The stock is not cheap, trading at 13 times sales. DOCU has a market capitalization of around $11 billion.\n\nDocuSign transforms the foundation of doing business by moving customers from paper-based document signing to electronic signatures. It had 537,000 customers as of July 31. Fiscal year 2019 revenue grew 35% year-over-year and could grow even faster since its total addressable market is $25 billion. The company previously stumbled when it added more features to its core offering. This increased the time needed to close deals. Customers needed to spend more time reviewing the bundled features before deciding to buy the solution.\n\nDocuSign’s view on the handling of today’s paper agreement is that of a digital, connected, self-executing solution. Payment, customer relationship management and enterprise resource planning systems will handle all agreements in the future. With DocuSign unlocking the signing bottleneck, its customers complete deals more efficiently, saving everyone time. The firm has a web and mobile app with hundreds of millions of users. DocuSign is a rapidly-growing software firm with stock worth holding.\n\n\n\n\n\nOkta (OKTA)\n\n3 Big Reasons Now Is the Time to Buy the Dip in Okta Stock More\n\nSource: Sundry Photography / Shutterstock.com\n\nOkta (NASDAQ:OKTA) fell briefly below $100 in September. The company has a market cap of $12 billion. Analysts expect its EPS to grow 58% next year and 25% over the next five years. Piper Jaffray describes Okta as being in a class of its own after the company reported a good Q2/2020 earnings report. It lost 5 cents a share, though revenue grew 48.5% to $140.5 million. Okta enjoyed an exceptional quarter, lifted by subscription revenue growth of 51%, billings growth of 42% and remaining performance obligations growth of 68%. It added 450 new customers and now has 7,000.\n\nAfter a 46% growth in customers with an annual contract value above $100,000, Okta now has 1,200 customers in that category. With strong recurring revenue and an acceleration in customer acquisitions, the company may sustain earnings growth above the 25% annual baseline.", "description": "Investors holding software stocks must demand growth from them. After all, software companies hold nothing physically tangible. They may have important intellectual property, but their value comes from the solutions and services their programs offer.Microsoft (NASDAQ:MSFT) or International Business Machines", "authors": ["Chris Lau"], "top_image": "https://s.yimg.com/uu/api/res/1.2/TmEklPjz0GMkw1VAXKx_PA--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/5d828e9b4e070c16ed58a6a31bee7bd6", "published_at": "2019-10-18"}