{"pub": "dailymail", "url": "https://dailymail.co.uk/travel/travel_news/article-7546037/Westerner-Andy-Drury-risks-life-tour-former-ISIS-stronghold-Mosul-Iraq.html", "downloaded_at": "2019-10-07 12:34:26.314951+00:00", "title": "Westerner Andy Drury risks his life to tour former ISIS stronghold of Mosul in Iraq", "language": "en", "text": "Advertisement\n\nA married British father claims he has become the first person to take a holiday in the ruins of the so-called Islamic State – and he paid £4,000 for the privilege.\n\nWithout visas and in constant danger of kidnapping, beatings from militia, and even death, Andy Drury took a three-day mini-break to Mosul, which was once hell on earth.\n\nFather-of-four Andy, 53, has brought back never-before-seen photographs of the devastated city in northern Iraq, which was once the centre of the ISIS caliphate.\n\nMarried father-of-four Andy Drury claims he has become the first person to take a holiday in the ruins of the so-called Islamic State in Mosul, northern Iraq. Pictured are the ruins of a huge hospital complex in Mosul that was destroyed in the fighting\n\nAndy, a building firm owner, from Guildford, Surrey, has spent the past 20 years touring areas of the planet most us don't dare tread. Pictured are some of the houses that were blown to pieces during the battle with ISIS\n\nAndy stands next to a building which had been daubed with an Arabic declaration claiming it belongs to ISIS\n\nAmid shocking apocalyptic scenes, innocent survivors and their families spoke to him about trying to rebuild their lives in the rubble.\n\nAndy, a building firm owner, from Guildford, Surrey, has spent the past 20 years touring areas of the planet most us don't dare tread - and it's not the first time he's been to Iraq.\n\nIn 2016, he narrowly escaped death after visiting the frontline in Bashiir, south of Kirkuk, where he spent time with Kurdish soldiers fighting ISIS.\n\nDuring that encounter, Andy, who doesn't wear a bulletproof vest or helmet, was shot at by ISIS but luckily escaped unharmed.\n\nAndy, who lives with his wife and children, said his biggest reason for returning to the dangerous region last month was to see if the men he spent time with on the front line were still alive.\n\nHis three-day tour was split into visiting the former frontline near Kirkuk as well as the ex-ISIS stronghold of Mosul.\n\nAndy said: 'I must be the first tourist in the ruins of Islamic State.\n\n'My fixer Ammar (not his real name) would take reporters to the frontline during the taking back of Mosul.\n\n'But he said he was more scared with me because with the news reporters, he was in an armoured car.\n\n'But I didn't wear a vest or helmet. He said that was scarier.'\n\nDuring the first day of his trip last month, Andy said travelling to where he had visited the soldiers in 2016 proved much more difficult this time.\n\nAndy's three-day tour was split into visiting the former frontline near Kirkuk as well as the ex-ISIS stronghold of Mosul. Pictured is a mosque in Mosul, where Andy's guide said he saw a father burying his son and daughter\n\nAs he travelled around Mosul, Andy says that he saw many signs warning people of unexploded bombs and ammunition\n\nHe explained: 'It was really nerve-wracking as the soldiers at checkpoints put guns up against the windows. It was quite clear they hated us.\n\n'It was then we were approached by a taxi driver, who said 'I can get you in there, I can get you into Kirkuk'.\n\n'I thought 'f***ing hell', this is against everything I do, to be approached by a driver where hostage taking is still rife and ISIS are still in pockets in the mountains.\n\n'I asked: 'How are you going to do this?' And he said he would take us on back roads, behind people's houses and through gardens. He said he'd done it before.\n\n'I was nervous, my heart was in my mouth for 20 minutes. We'd been turned away by Iraqi forces, and if we were caught, we could have been beaten or imprisoned for spying. We were in an area we weren't supposed to be in.\n\n'We got into Kirkuk and had no problems at all and went to an area called Taza.\n\n'Taza is one kilometre from a place called Bashiir, which was on the frontline where I had been shot at by ISIS before.\n\n'All along the side of the road there were pictures of martyrs and posters with pictures of soldiers' faces. I was looking to see if I could find anybody I knew.\n\n'This is when it became real for me. I might see a picture of someone I had been with.\n\nA tattered 'I love Mosul' sign lies on the outskirts of the city. Andy says as he entered the city, his driver told him he would be disturbed\n\nAndy came across a building that had been marked with an 'n' symbol by ISIS. He said: 'What ISIS was doing was putting this \"n\" symbol on Christian houses, taking them and saying this building belongs to ISIS'\n\n'At the final checkpoint, leaving Taza, the soldiers knew all the guys in a picture I had of them. They pointed to one guy and said he had been killed.\n\n'There was a group of about four of five I spent most of my time with and he was one of them. I had given him money for a phone card and we had chatted about his life, his family, his village and how he was hoping to get back one day, but he never did.\n\n'I was standing on the road and I asked where he had been killed and they said, 'on this road, a kilometre up', so that kind of took my breath away a little bit.\n\n'I feel disappointed even now we didn't make it to Bashiir, although I found out what happened to all of those guys I had been with.\n\n'I know that only one was killed out of the 12 people in the picture and I still want to see them again.\n\n'I promised them all on that frontline that day in 2016 that I would find them again, and I will keep to my promise.'\n\nNext, Andy was ready to head to Mosul, where ISIS made its last stand.\n\nAndy said: 'Driving in from Iraq and Kurdistan, all the buildings were beautiful, and then it changed. I've never seen anything like it, it was like an apocalyptic film.\n\n'The buildings had big holes in them from where they had taken airstrikes. There were bits of rubble and then buildings that had been completely flattened.\n\nAndy said: 'The buildings had big holes in them from where they had taken airstrikes. There were bits of rubble and then buildings that had been completely flattened'\n\nAndy poses with an Iraqi father and his family who survived the devastation in Mosul. The man had been watering a plant in the rubble amid the ruins of his home when he was approached by Andy\n\n'Our driver told me I'd be disturbed.\n\n'We stopped at a restaurant where the waiters really didn't want us there. The coffee was almost thrown on the table.\n\n'We were sat having our coffees and talking about the rules for what was going to happen today and Ammar pointed to a big hole across the road from where we were sitting.\n\n'He said that had been the insurance building where ISIS would throw homosexuals off.\n\n'I asked what would happen with the restaurant when this was happening, was it closed down?\n\n'But he said people with a hatred for homosexuals would sit and watch, drinking a coffee as people were being thrown off the large tower building.\n\n'I was in f***ing shock. I had read about that building and seen pictures in the press. But being that close, five or 10 metres away from where only a year and a half ago people were being thrown off it just for being gay...\n\n'Deeper into west Mosul, where the worst battles had taken place, there were Hashd on every corner. They are the local militia. They are dressed in black.\n\n'They are a bit like the SS. They're not the Iraqi army and if they don't like you, you're f***ed.\n\n'We took the side roads and either side we could see where house-to-house battles had taken place.\n\n'There was black writing saying 'this building belongs to ISIS, keep out'.\n\nAndy and his tour guides are pictured in ruins close to where the River Tigris runs through Mosul\n\n'There would be an 'n' symbol on some of the buildings. This was like the Nazis during World War II who would mark buildings where Jewish people lived.\n\n'What ISIS was doing was putting this 'n' symbol on Christian houses, taking them and saying this building belongs to ISIS.\n\n'They didn't just label the houses, they dragged people out of them and killed them. They'd be shot and killed and then ISIS would take control of the building waiting for the final battle to come.'\n\nThe horrifying similarities between the Nazis and ISIS shocked Andy, who said the sheer devastation of the area was hard to take in.\n\nHe added: 'We drove through the obliterated streets.\n\n'You could see plates of rotting food and then there was an opening.\n\n'The opening was a children's playground and there was a children's swing.\n\n'Ironically everything around this playground was smashed to s**t, apart from this swing.\n\n'I don't know whether during the battle someone showed humanity and didn't blow it up or the bombs just missed it.\n\n'While walking through the playground there was a house in front of me that had this beautiful window and door.\n\n'I walked up to it because something drew me in.\n\n'On the left-hand side of the building was a children's nursery and I was in tears.\n\n'I'm a father and at that building, I was approached by someone who was a Christian who had stayed in Mosul and remained during the conflict.\n\n'She said to me they had taken four bodies out of that house the day before, three children and an adult. You could smell death.\n\n'We drove on to another square, which opened up, and there were items everywhere such as unused shells and RPGs.\n\n'There was evidence of just sheer mayhem and there were signs for unexploded bombs.\n\n'There was this building, which was surrounded by rubble and there was a Beko fridge with the door open.\n\nAndy's guide Ammar stands in an archway next to the River Tigris. He claims that the Iraqi army would drag ISIS fighters there and throw them into the water\n\nWhile on his trip to Mosul, Andy was in constant danger of kidnapping, beatings from militia, and even death. Pictured is a rocket lying in the rubble\n\n'I walked up to this fridge, and there was a man who owned the fridge who had come to water a plant.\n\n'He told me the reason he was watering it was because it was life.\n\n'I was standing on a mound of rubble outside his house and he said beneath your feet you've got the bodies of four or five ISIS fighters.\n\n'I was about to ask the man about his story when all of his family appeared.\n\n'He told me that they had lived there throughout the conflict in a basement below his house.\n\n'I asked him what it was like and he said he got shot between both legs but luckily the bullets passed through his body without hitting the bone.\n\n'He said every time there was fighting, people would run from one house to another.\n\n'His daughter had shrapnel in the back of her head and his other kids had bits of debris in their arms.\n\n'He was an air conditioning salesman and he explained how he wanted to get back to life.\n\n'But his house is on rented land and he said the Iraqi government won't let him have the land back so he's in a no-win situation.\n\n'He asked me if I was a father, and I said 'yes I am'.\n\n'He told me as a father he had failed, and I said why? He said because he was supposed to protect his kids and he didn't because they were all shot to pieces.\n\n'He said they are all alive but it was his job to look after his family.\n\n'I couldn't accept that story and I gave him money. He didn't want to take it and I feel embarrassed about it even now, because what was I doing? Buying his grief?\n\n'But the only thing I could think of was to give him money. He didn't want to accept it because he was a proud man, but I gave it because he can't even afford to rent a building to live in outside Mosul.\n\n'He obviously can't sell anything. He's got his air conditioning business but nothing to sell. I said I'll visit him again and I will.\n\n'Can you imagine as a father all of your children being shot? His kids have seen death and bodies everywhere.'\n\nAndy said the security guy they had with their group in west Mosul told him about the horrors the battle.\n\nHe said: 'He told us there was this Canadian guy who was supposed to be a journalist, but who was really giving the signal for airstrikes.\n\n'He said in the end, the Iraqi army said they were losing too many men, and they decided they were just going to obliterate the area because they got fed up of fighting street to street.\n\n'We went to see the Al Noori Mosque where Abu Bakr Al Baghdadi declared Mosul as the caliphate of the Islamic State.\n\n'Ammar told me a story as he was there during the fighting.\n\n'He said during the battle he met a man one day with a little boy and they were by a mound. He asked the man what he was doing there.\n\n'The man told him he'd just buried his daughter, and he'd buried her himself.\n\nIn 2016 Andy narrowly escaped death after visiting the frontline in Bashiir, south of Kirkuk, where he spent time with Kurdish soldiers fighting ISIS (pictured)\n\nAndy and his wife Rachel back home in Surrey. Andy says he still thinks about the people he met even though he is now back home\n\n'His son was with him and he was writing with a yellow crayon. It was her favourite crayon and the boy was writing a goodbye to his sister.\n\n'Ammar said he saw the man the next day with another mound because the son had died, and he had dug another grave for him. These are the stories we don't hear about.\n\n'He lost his son and his daughter all in two days and he buried them himself. He was digging that grave when all about there was fighting going on because the only ground he could find was near the mosque.\n\n'Ammar then took us to another area he said he wanted to show where he claimed there were war crimes.\n\n'There's an arch near a bridge over the Tigris River between west and east Mosul.\n\n'The arch looks over to a deep drop and an embankment 20 or 30 foot down.\n\n'Ammar said the army would drag all the ISIS fighters there and throw them off the bridge or shoot them.\n\n'He said the Iraqi army did that to 10 to 15 ISIS fighters or who they presumed were ISIS fighters.\n\n'I asked Ammar how he felt about that and he said it was war.\n\n'I don't agree with that. I don't think you can just drag people and kill them. We remember that from the Second World War.\n\n'I don't agree with ISIS. They are a disgraceful, despicable ideology, but equally, you can't just drag people and shoot them if you're declaring you're the good people.'\n\nAndy said the group travelled out of Mosul past a large hospital which had been destroyed. The huge building was one of the last places the ISIS fighters held.\n\nAndy added: 'I saw some horrendous things such as the bodies of people who had been killed.\n\n'But I don't think about the bodies, I think of that one family, the man and his fridge and children, and my thoughts turn to my own family back home.\n\n'Since getting back, I still think of him and his family.'", "description": "Andy Drury, 53, from Guildford in Surrey, took a three-day mini break to Mosul and has brought back never-before-seen photographs of the devastated city in northern Iraq.", "authors": ["Jennifer Newton For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/12/19393928-0-image-a-9_1570449425947.jpg", "published_at": "2019-10-07"}