{"pub": "fox", "title": "New Orleans restaurant owner offers free meal to people evacuating Hurricane Dorian", "url": "https://foxnews.com/food-drink/hurricane-dorian-new-orleans-restaurant-owner-free-meal-evacuations", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:13:51.053964+00:00", "text": "One New Orleans chef says he wants to make evacuating less stressful, even if it’s only by giving out one meal at a time.\n\nPete Vasquez said he’ll offer free food to anyone evacuating from Florida to New Orleans. While it’s still unclear what path Hurricane Dorian will take, Vasquez wanted to make sure that people who do have to evacuate will get a helping hand.\n\nCONTINUING COVERAGE OF HURRICANE DORIAN ON FOX NEWS CHANNEL\n\n“I just believe if people need help, you help them,” he told Fox News. “It sucks to evacuate and although most probably have money to pay, just a gratis meal makes people feel a little bit of relief.”\n\nThe owner of The Appetite Repair Shop in New Orleans, Vasquez said he believed in doing the right thing.\n\nRESTAURANT SERVER'S HEARTWARMING MOMENT WITH WWII VETERAN GOES VIRAL: 'IT WAS A TOUCHING SIGHT'\n\n“I stand for certain things and never waver on what is morally right,” the chef continued. “My morality isn't led by a dollar. Virtually nothing about me is! I feed the homeless regularly out of my own pocket (and some generous customers).”\n\nVasquez said he’s closed down shop before to go help out where it’s needed, like when Texas needed help after the damage inflicted by Hurricane Harvey.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“These things come at great expense to me as when I close, I close,” he explained. “There's no income, but to me, it doesn't matter. There's ‘the right thing to do’ and then there are excuses.”\n\nHurricane Dorian strengthened to a Category 5 storm before it made landfall in the northern Bahamas on Sunday. Forecasters have warned its path could still change and states along the southern East Coast of the United States have been bracing for possible impact.\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\nVasquez had some thoughtful closing words. “How these things affect me doesn't matter,” he said. “It's what we do for others that define our character. We could feed, clothe and house everyone for what we throw away, but we don't.”\n\nFox News' Alexandra Deabler and Travis Fedschun contributed to this report.", "description": "One New Orleans chef wants to make evacuating less stressful, even if it’s only by giving out one meal at a time.", "authors": ["Michael Hollan"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/storm-evacuation.jpg"}