{"pub": "hotair", "url": "https://redstate.com/bonchie/2019/09/26/adam-schiff-something-absolutely-despicable-todays-whistle-blower-hearing", "downloaded_at": "2019-09-26 20:48:35.812599+00:00", "title": "Adam Schiff Did One of the Most Insane, Disgusting Things Ever Done In a Congressional Hearing", "language": "en", "text": "There is no member of Congress more disgusting than Adam Schiff, and there are a lot of disgusting members of Congress.\n\nHe spent the last two years claiming to have super-secret proof of Trump colluding with Russia, being given a permeant spot the Sunday shows to constantly lie about what he actually knew. When it all came crashing down, he paid no price at all, still insisting the evidence was “in plain sight.”\n\nNow, he’s found a new hobby horse. Namely, this Trump-Ukraine nonsense and that meant having a hearing today with the Intel Chief about the “whistle-blower” complaint.\n\nHow did Schiff open the hearing? By lying his butt off.\n\nRep. Schiff re-writes the call transcript for added drama: \"I’m going to say this only seven times, so you better listen good, I want you to make up dirt on my political opponent, understand, lots of it, on this and on that, I’m going to put you in touch with people\" pic.twitter.com/1rV7BpEN6o — Tom Elliott (@tomselliott) September 26, 2019\n\nSchiff’s entire characterization and quoting of the transcript was patently false. It sought to apply context and motive where there was none. He simply made things up to push his narrative.\n\nRep. Elise Stefanik, herself no Trump fan, called out this insanity.\n\nIt is disturbing and outrageous that Chairman of the House Intelligence Committee Adam Schiff opens up a hearing of this importance with improvised fake dialogue between President Trump and President Zelenskyy. We should focus on the facts. — Elise Stefanik (@EliseStefanik) September 26, 2019\n\nWhat an absolute garbage legislator this guy is. Democrats claim they want the facts and he goes out and just completely makes up a transcript, presenting it as fact on national TV. How many people watching that hadn’t actually read the transcript? How were they supposed to know he was lying?\n\nI should probably thank him though. Schiff gave the game away before the first whistle. This isn’t about facts, fairness, real investigations, or the rule of law. It’s about distorting an innocuous phone call and trying to manufacture an impeachment out of it. Nothing more. It doesn’t matter that there’s nothing impeachable in the transcript, nor the complaint. Schiff and the Democrats have their minds made up and they’ll say whatever they need to push through. All the while, they do so knowing the media won’t fact-check them or call them out.\n\nTry to imagine what CNN would say if Devin Nunes got up in an official committee hearing and did that crap. Would they chastise him? You can bet your life on it. Instead, the media have basically ignored it, only reporting on Republican reactions (i.e. Republicans pounce) to the bizarre rant.\n\nSchiff’s underhanded tactics likely don’t end with that public spectacle though. It’s looking more and more like he is one of the architects of this entire sideshow.\n\nAnd which media propagandist did Schiff use as a prop to hide the true source of his allegations? One of Fusion GPS's favorite stenographers of discredited Steele-esque innuendo: Natasha Bertrand. The whole thing has been a Fusion GPS-style info op from the very beginning. — Sean Davis (@seanmdav) September 26, 2019\n\nAnd surprise! The anti-Trump leaker cited as proof of corruption in his complaint the very same articles that Schiff and his allies quite obviously seeded to form the narrative they desired. This raises the troubling question of whether Schiff orchestrated the complaint. — Sean Davis (@seanmdav) September 26, 2019\n\nAnd lest anyone forget, Adam Schiff and Fusion GPS head Glenn Simpson have a long history of working together in this fashion. Recall that Schiff and Simpson, who perjured himself in congressional testimony, secretly met together in Aspen. https://t.co/S0OFtI1aLA — Sean Davis (@seanmdav) September 26, 2019\n\nThis is all planned. It’s too well laid out to not be. Schiff was pushing Fusion GPS talking points about Ukraine and Trump weeks before the whistle-blower complaint was even lodged. That’s not a coincidence. It’s a continuation of a long pattern, going back to his Mueller investigation antics.\n\nSchiff is now claiming his fake reading of the trancript was a “parody ” that actually proves how serious this is. Give all of us a break. This guy is a clown and deserves to be treated as such.\n\nAs a side note, if you want a good litmus test for which conservatives you should ignore, simply see how they react to Schiff. If any “conservative” loses their mind over Devin Nunes but continues to not criticize Schiff (i.e. David French), that’s not someone to trust.\n\n————————————————\n\nEnjoying the read? Please visit my archive and check out some of my latest articles.\n\nI’ve got a new twitter! Please help by following @bonchieredstate.", "description": "Adam Schiff Did One of the Most Insane, Disgusting Things Ever Done In a Congressional Hearing", "authors": ["Brandon Morse", "Sarah Lee", "Alex Parker", "Sister Toldjah", "Brad Slager", "Stu Cvrk", "Posted At Pm On September"], "top_image": "https://www.redstate.com/wp-content/uploads/2019/04/AS.jpg", "published_at": "2019-09-26"}