{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7594009/Meghan-Markle-Prince-Harry-Archie-LA-Thanksgiving-grandmother-Doria-Ragland.html", "downloaded_at": "2019-10-20 23:31:01.298851+00:00", "title": "Meghan Markle and Prince Harry to take Archie to LA for Thanksgiving with grandmother Doria Ragland", "language": "en", "text": "Prince Harry and Meghan Markle will take baby Archie to California next month, where the seventh-in-line to the throne will spend the Thanksgiving holiday with the American side of his family.\n\nLos Angeles-born Markle will jet across the pond just in time for November 28 when they'll celebrate Turkey Day with the former actress' yoga instructor mother Doria Ragland.\n\n'The duke and duchess have a full schedule of engagements and commitments until mid-November, after which they will be taking some much-needed family time,' a royal source told the Sunday Times.\n\nIt's believed the Duchess of Sussex retained her American citizenship after marrying Harry, and is keen for Archie to grow up fully aware of his heritage.\n\nPrince Harry and Archie will travel to LA for Thanksgiving with Meghan Markle and her mother mid-November\n\nThey'll celebrate the American holiday with Archie's yoga teacher grandmother Doria Ragland\n\nDoria Ragland's Los Angeles, California home is pictured above\n\nFollowing the LA trip, the family will return to the UK to spend the rest of the holiday season with Queen Elizabeth II in keeping with the tradition of Christmas at Sandringham in Norfolk.\n\nIt's part of a six-week break from royal duties but in the meantime the couple are working hard until their time off.\n\nThe break will follow Harry and Meghan's ten-day tour of southern Africa, footage of which will be seen on in a documentary by broadcaster Tom Bradby, aired in the UK Sunday.\n\nSpeaking ahead of the program, Mr Bradby, a friend of Harry, said he believed the couple are 'vulnerable and bruised'.\n\nAnd Meghan has received an outpouring of support from tens of thousands of people on Twitter after her interview discussing the hardships of motherhood.\n\n#WeLoveYouMeghan' became the top trending topic on the social media platform, with users offering positive messages in the wake of the Duchess's recent media scrutiny.\n\nThe Duke and Duchess of Sussex will take six weeks off from Royal duties for some 'much-needed family time' over the holidays\n\nMarkle (pictured as a child with Ragland) is keen for Archie to grow up fully aware of his American heritage\n\nIt's believed the Duchess of Sussex retained her American citizenship after marrying Harry\n\nThe outpouring came after Meghan revealed that it has been 'a struggle' to be in the intense spotlight as she adjusted to being a new wife, mother and member of the royal family, adding: 'Not many people have asked if I'm OK.'\n\nThe hashtag was trending in less than an hour after British author Greg Hogben urged people to share their support.\n\nEstimates suggest over 70,000 people have used the hashtag since it was created.\n\nAccounts on Twitter even began circulating Markle's address so that fans could send their written words of encouragement.\n\nThe ITV documentary follows the couple on their recent of southern Africa, and includes an interview with ITN News At Ten anchor Bradby.\n\nAsked about the impact the intense public scrutiny has had on her 'physical and mental health' and how Harry is being 'protective' of her after what happened to his mother, she replies: 'Look, any woman especially when they are pregnant you're really vulnerable and so that was made really challenging, and then when you have a new born – you know…\n\n'And especially as a woman, it's a lot.\n\n'So you add this on top of just trying to be a new mom or trying to be a newlywed it's, well…'\n\nThey'll spend Christmas in the UK with Archie's great-grandmother, Queen Elizabeth II (center). Archie is pictured after he was born in May. The Duke of Edinburgh is pictured left\n\nThe Queen's royal tradition is to spend Christmas at her Sandringham, Norfolk home (pictured)\n\nShe continues: 'Also thank you for asking, because not many people have asked if I'm OK. But it's a very real thing to be going through behind the scenes.'\n\nTom asks her: 'And the answer is, would it be fair to say, not really OK, as in it's really been a struggle?' Meghan, visibly upset, then replies: 'Yes.'\n\nThe Duchess said that she is 'existing, not living' while struggling with the pressures of royal life and media scrutiny.\n\nIn an article for the Sunday Times, Mr Bradby recalled asking Meghan whether she was able to cope with the endless media scrutiny the newlywed has been under.\n\nShe said, 'We are taking it one day at a time,' before admitting that the couple are currently 'existing, not living.'\n\nWhile reflecting upon tonight's documentary, Mr Bradby wrote that much of what he witnessed alongside the royals on their southern Africa tour 'did not come as a surprise'.\n\nThe break follows Harry and Meghan's ten-day tour of southern Africa, footage of which will be seen on ITV Sunday night in a documentary by broadcaster Tom Bradby\n\nMeghan Markle was interviewed by Tom Bradby (pictured) for the ITV documentary\n\nThe pair have been involved in charity work for years - Harry since his gap year that he spent working with children whose lives were affected by HIV in Lesotho, and Meghan has been involved with many charities and organisations that help young women to escape poverty and endemic levels of violence.\n\nBut Mr Bradby noted that 'as the journey wore on, another human story gradually emerged, of a couple who clearly feel under the most extreme pressure and seem, at times, to be buckling beneath it'.\n\nMeghan and Harry have spent the year under a media magnifying glass and have been accused of arrogance, profligacy and hypocrisy.\n\nMr Bradby also wrote about how he thinks Harry believes that the press killed his mother and how he now fears history may repeat itself with his wife.\n\nHe wrote: 'I couldn't help but notice how incredibly tired, even burnt out, Harry looked.'\n\nA royal source told The Sunday Times: 'The Duke and Duchess have a full schedule of engagements and commitments until mid-November, after which they will be taking some much-needed family time.'\n\nThe interview comes following months of controversy involving Meghan and Harry.\n\nTheir recent tour included a visit by Harry, 35, to a minefield in Angola, which saw the Prince retrace his mother Diana's footsteps 22 years after her death.\n\nDuring an emotional interview for the documentary, Meghan admitted feeling 'vulnerable' during her pregnancy and thanked Mr Bradby for asking about how she was feeling.\n\n'Thank you for asking because not many people have asked if I'm OK, but it's a very real thing to be going through behind the scenes,' she said.\n\nHarry, meanwhile, spoke candidly about the pressures of being a member of the Royal Family in the spotlight.\n\nWhen asked by Mr Bradby if he has yet 'found peace', Harry said the grief of his mother's death still remains, describing it as 'a wound that festers'.\n\nIn the hour-long documentary, Harry reportedly voices his desire to leave the UK, describing Cape Town in South Africa as 'an amazing place to be able to base ourselves'.\n\nHe, however, acknowledged that such a move would be very difficult, if not impossible.\n\nHe said: 'I don't know where we could live in Africa.\n\n'With all the problems going on in Cape Town I don't see how we'd be able to make as much difference as we want to.'", "description": "Prince Harry and Meghan Markle will take baby Archie to California next month, where the seventh-in-line to the throne will spend the Thanksgiving holiday with the American side of his family.", "authors": ["Leah Simpson For Dailymail.Com", "Amelia Wynne For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/19/19962548-0-image-a-17_1571594509030.jpg", "published_at": "2019-10-20"}