{"pub": "arynews", "url": "https://arynews.tv/en/imran-khan-sixth-popular-leader-twitter", "downloaded_at": "2019-10-08 15:06:49.180700+00:00", "title": "PM Imran Khan becomes sixth most popular world leader on Twitter", "language": "en", "text": "ISLAMABAD: Prime Minister Imran Khan has become the sixth most popular world leader on Twitter, boasting 10.5 million followers on the micro-blogging platform.\n\nوزیراعظم عمران خان دنیا بھر کے مقبول ترین رہنماوں میں شامل وزیراعظم عمران خان دنیا بھر کے مقبول ترین رہنماوں میں شامل — امن کے سفیر عمران خان نے دنیا کو پاکستان کا رشن چہرہ دکھایا — دورہ امریکا کے بعد وزیراعظم مقبول ترین سماجی ویب سائٹ ٹوئٹر پر چھا گئے — وزیراعظم کے فالوورز کی تعداد ایک کروڑ 5 لاکھ ہوگئی#ARYNews #PMImranKhan Posted by ARY News on Tuesday, October 8, 2019\n\nThe development comes following his September 27 speech at the UN General Assembly (UNGA) where he raised the Kashmir issue effectively.\n\nKhan’s Twitter following has grown at a rapid pace in the past few months.\n\nIn April this year, PM Khan was the ninth most followed world leader on the social media platform with 9.4 million followers, but the number of his followers rapidly increased after his recent address in the UNGA, where he showcased himself as an ambassador of Kashmir and a leader of the Muslim world.\n\nAs of right now, US President Donald Trump stands on the first position with 65.3 million followers on Twitter.\n\nRead more: Modi treating Kashmiris ‘worse than animals’: Imran Khan tells UNGA\n\nAddressing the UNGA session, last month, the PM had told the world body that his government tried to approach India for talks before this move but the Indian side’s refusal was the factor talks couldn’t move forward.\n\nThe premier had maintained that on August 5, the Modi government took a step which closed all doors of dialogue between the two nuclear-armed neighbours i.e. the illegal annexation of Occupied Kashmir.\n\n“Today, India is treating the Kashmiris worse than animals, they are being locked in their houses, there is a complete curfew,” said the PM.\n\nComments\n\ncomments", "description": "Prime Minister Imran Khan has become the sixth most popular world leader on Twitter, boasting 10.5 million followers on the micro-blogging website.", "authors": ["Web Desk"], "top_image": "https://arynews.tv/wp-content/uploads/2019/10/PM-Imran.jpg", "published_at": "2019-10-08"}