{"pub": "businessinsider", "url": "https://businessinsider.com/transportation-logistics-forecast-book-2018-7", "downloaded_at": "2019-09-08 12:57:07.181574+00:00", "title": "The top trends and technologies impacting consumer transit and the supply chain", "language": "en", "text": "Every industry becomes a global industry with the integration of the Internet. First technology revolutionized the way send and receive information, and now it's fundamentally transforming the way people and goods are physically moving around the world.\n\nBusiness Insider Intelilgence\n\nWith innovations like self-driving vehicles, drone and robotics delivery, mobility apps, and artificial intelligence, the transportation and logistics industry has been rapidly developing to keep up with rising consumer demand — and the next five years will only accelerate this transformation.\n\nBut to successfully navigate a changing landscape, individuals and organizations must understand the full extent to which digital transformation will affect the transportation industry, the key drivers of this growth, and how it all relates to the work they do every day.\n\nBusiness Insider Intelligence, Business Insider's premium research service, has forecasted the future of the changing transportation ecosystem in the Transportation & Logistics Forecast Book 2018. Here's where to expect some of the biggest shifts:\n\nE-Commerce: Online purchases - including a growing number of cross-border sales - have been steadily increasing every year for the last decade. The number of packages delivered daily has skyrocketed, and the proliferation of Amazon Prime's \"free shipping\" perk has created high expectations among consumers — putting pressure on other retailers and their logistics partners to offer same-day shipping at competitive prices.\n\nOnline purchases - including a growing number of cross-border sales - have been steadily increasing every year for the last decade. The number of packages delivered daily has skyrocketed, and the proliferation of Amazon Prime's \"free shipping\" perk has created high expectations among consumers — putting pressure on other retailers and their logistics partners to offer same-day shipping at competitive prices. Autonomous vehicles: By 2023, 1 in new 7 vehicles will be semi- or fully autonomous, and nearly all will be connected with internet access for data transmission — presenting a huge opportunity for other digital providers to integrate with this new \"platform\" and offer consumers more services.\n\nBy 2023, 1 in new 7 vehicles will be semi- or fully autonomous, and nearly all will be connected with internet access for data transmission — presenting a huge opportunity for other digital providers to integrate with this new \"platform\" and offer consumers more services. On-demand mobility: Ride-hailing and ride-sharing services such as Uber and Lyft comprise a growing percentage of total miles driven in the US — and will only continue increasing with the adoption of self-driving cars. The uptick in these services is stifling car sales, however, as consumers feel less of a need to own their own vehicles. Automakers will need to find ways to adapt and drive revenue.\n\nWant to Learn More?\n\nPeople, companies, and organizations all over the world are racing to adopt the latest payments solutions and prevent growing pains amidst a technological transformation. The Transportation & Logistics Forecast Book 2018 from Business Insider Intelligence is a detailed two-part slide deck outlining the most important trends impacting the transportation ecosystem around the world — and the key drivers propelling each segment forward.\n\nRepresenting thousands of hours of exhaustive research, our multipart forecast books are considered must-reads by thousands of highly successful business professionals. These informative slide decks are packed with charts and statistics outlining the most influential trends on the leading edge of your industry. Keep them for reference or drop the most valuable data into your own presentations to share with your teams.\n\nWhether you're newly interested in a topic or you already consider yourself a subject matter expert, The Transportation & Logistics Forecast Book 2018 can provide you with the actionable insights you need to make better decisions.", "description": "The Transportation & Logistics Forecast Book 2018 from Business Insider Intelligence is a detailed two-part slide deck outlining the most important trends impacting the transportation ecosystem around the world — and the key drivers propelling each segment forward.", "authors": ["Shelagh Dolan"], "top_image": "https://amp.businessinsider.com/images/5b5620ca3b49fc35008b45ec-960-480.png", "published_at": "2018-07-23"}