{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/inside-weeks-strictly-rehearsals-stars-20550374", "downloaded_at": "2019-10-10 15:19:43.175783+00:00", "title": "From epic falls and sexy moves to lots of laughs", "language": "en", "text": "Get the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nIt's week four of Strictly Come Dancing on Saturday, and the couples have been working extra hard to further impress the judges.\n\nThe official Strictly Instagram page shared videos of the pro dancers with their celebrity partners as they grumble and crumble ahead of this weekend.\n\nMike Bushell was being pushed to his limits by his dance partner Katya Jones, as he fell onto the floor during his effort at rehearsals, but it seems she's getting her revenge on the star as she captioned the post \"Mike's turn to fall over\".\n\nPartners Will Bayley and Janette Manrara looked worn out as they danced around the studio together before he grabbed a coffee and cooled off.\n\nViscountess Emma Weymouth took things more seriously with Aljaz as they giggled and strut around the studio together in heaps of laughter, as Karim and Amy took to stage and held hands for some serious moves.\n\nMeanwhile AJ and Saffron were almost in tears as he dropped the stunning YouTuber onto the floor before picking her back up again.\n\n(Image: Instagram)\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nAlex Scott takes on a painful injury as she practised moves for Saturday with Neil Jones, but Dianne Buswell and Dev seemed confident as they were shaking their hips and tapping their toes.\n\nAfter judge Craig Revel Horwood criticised Anton Du Beke for his \"fake teeth\" last weekend, he is back up and running as he twirls across the dancefloor with Emma Barton.\n\n(Image: Instagram)\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nAnd partners Chris Ramsey and Karen Hauer engage in discussion instead, where they both look focused. David James and Nadiya Bychkova discussed tactics together, and he is shown demonstrating their vision with his hands.\n\n(Image: Instagram)\n\nIn week two rehearsals, Catherine Tyldesley had confessed she was beginning to struggle as she was finding it too difficult to perform in heels - and she still appeared to be angry as she pulled a face bearing her teeth to the camera.\n\nAnd couple Oti and Kelvin looked relaxed as they chatted together at the end of the Instagram story.", "description": "The stars have come leaps and bounds since their first week of rehearsals - here's what they've been up to ahead of Saturday night's performance", "authors": ["Brogan-Leigh Hurst", "Image", "Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20550889.ece/ALTERNATES/s1200/0_strictly.jpg", "published_at": "2019-10-10"}