{"pub": "businessinsider", "url": "https://businessinsider.com/how-american-culture-and-masculinity-can-lead-to-mass-shooters-2019-8", "downloaded_at": "2019-09-14 01:40:54.421726+00:00", "title": "How American culture and a sense of 'aggrieved entitlement' in males can lead to mass shooters", "language": "en", "text": "Boys and men in the US are teased, endure homophobic and other kinds of bullying and emasculation, and sometimes feel that their gender identities are being \"threatened.\" But boys and men in other nations experience these things as well. So, why is it that mass shootings are so much more common in the US if … it is not only a question of gun control?\n\nTo answer this question requires a cultural explanation — one that attends to the unique role that American culture plays in influencing boys and young men to turn to this type of violence so much more often than men anywhere else. To address this necessitates shifting our attention away from the individual characteristics of the shooters themselves to investigate the sociocultural contexts in which violent masculinities are produced and valorized.\n\nUpward mobility remains a popular characterization of American society. But opportunities for some are made possible by systemically and structurally denying those same opportunities to others. This has been true throughout American history, and white men have long benefitted ... Over the course of the 20th and 21st centuries, however, social movements of various kinds have worked to identify, question, and chip away at these inequalities. Though young, straight, class-advantaged, white men today continue to benefit from racial, gender, sexual, and class inequality, they also work alongside women, racial, and sexual minorities in ways less true of their parents and grandparents. Today, these men have to compete with women, people of color, and more because of the gradual erosion of some of the privileges that historically worked in their interest.\n\nRead more: I'm a writer who went to work at an Amazon warehouse, a call center, and a McDonald's. I saw firsthand how low-wage work is driving America over the edge.\n\nHow 'aggrieved entitlement' comes into play\n\nKimmel argues that one of the outcomes associated with moves toward equal rights has been the production of a new emotional framework for white American men living in this age of decline — something Kimmel calls \"aggrieved entitlement.\" Aggrieved entitlement refers to the \"gendered sense of entitlement thwarted by larger economic and political shifts\" white men in the US experience.\n\nTristan Bridges Courtesy of Tristan Bridges\n\n[Sometimes, this] leads to racist and sexist sentiments toward women and racial minorities, [and] mass shootings are simply an extremely violent example of [this] much larger sociocultural issue.\n\nMichael Kimmel suggests that the relationship between violence and masculinity is particularly acute among a group he labels \"angry white men.\" When this group acts out, they turn to violence, and when they kill, access to guns and mental health are often quick to be blamed. These explanations are not simply problematic because they are wrong; they are dangerous because they focus attention only on individuals rather than the societies in which they live. In 2014, The New York Times' editorial board collaborated on an essay on what we know about school shootings, noting that rates of \"severe mental illness [are] roughly stable around the world … while gun violence varies.\" And research on gun violence in the US corroborates this as only a tiny fraction of gun deaths in the US can be attributed to mental health issues. Simply put, explanations that put the focus on individuals are inadequate explanations for social problems.\n\nRead more: After mass shootings, people may feel more willing to shoot someone, research says\n\nIndeed, Pascoe's research on the lives of high school boys discovered that many of the struggles that put boys \"at risk\" of becoming school shooters are incredibly common. While Kimmel and Mahler found that school shooters were incredibly likely to have been teased for being \"gay\" at school, Pascoe shows that that experience is not unique to the shooters. It's part of the drinking water in American high schools … Indeed, Tonso found that many young men in the US experience a sense of shame and humiliation that stems, in part, from their perceived loss of privilege — an experience acutely experienced in small social networks, like schools.\n\nA nostalgic longing for the good old days\n\nIn Jennifer Carlson's study of American gun owners, she found many men talked about a very specific kind of \" nostalgic longing for a particular version of America.\" Some invoked it by name, referring to it as \"Mayberry\" or \"Mayberry America.\" They were relying on a fictional town in North Carolina from \"The Andy Griffith Show\" — a 1960s era family sitcom representing a family in a small community of suburban single-family homes, safety and security. Though historian Stephanie Coontz has shown that this image of mid-century American family life has always been more fiction than fact, \"Mayberry\" represents a symbolic image of some of what has been lost to many American men. In an age of economic decline, the men in Carlson's study are living through the evaporation of the manufacturing economy in the US. While previous generations of men might have been able to \"do\" gender by economically providing for their households, this is less possible for many men today. And the men in Carlson's study use guns to mourn this social, cultural, and economic transition — a cultural process Carlson refers to as \"mourning Mayberry.\"\n\nTara Tober. Courtesy of Tara Tober\n\n…[I]n Yamane's history of US gun culture, he argues that at the end of the turn of the 21st century, US gun culture shifted from a culture of recreation to one of armed self-defense and citizenship. And scholarship on gun owners like Carlson's reflect this shift. In Stroud's analysis of who was applying for concealed carry licenses, she found that the vast majority of applicants were white men. And racial anxiety was a primary motivation cited by the white men in Stroud's study.\n\nRead more: Why 'humiliation plus entitlement' is what leads certain men to commit shooting sprees\n\nIn Carlson's research, she shows how the large swathes of men unable to access a \"breadwinner\" model of masculinity led to a rise of what she terms \"protector masculinity\" — a model of manhood in which guns provide evidence of gendered status. In support of this, Mencken and Froese discovered that white men who have experienced economic setbacks or who experience a great deal of anxiety about their economic futures are the group of gun owners most attached to their guns … And the most recent data on gun ownership in the US shows that white people are more likely to own guns than are any other racial group — men much more so than women.\n\nThis is the sociocultural landscape of the relationship between masculinities and guns today in the United States. And this cultural explanation [helps] to make sense of why boys and men in the US are so much more likely to engage in mass shootings.\n\nExcerpted from Feminist Frontiers. EDITED BY VERTA TAYLOR; NANCY WHITTIER AND LEILA J. RUPP.", "description": "Two researchers aim to make sense of why boys and men in the US are so much more likely to engage in mass shootings.", "authors": ["Tristan Bridges", "Tara Leigh Tober"], "top_image": "https://amp.businessinsider.com/images/57cf103bb996ebef008b638b-960-480.jpg", "published_at": "2019-09-12"}