{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-4554686/Russian-explorers-13-5million-old-Soviet-money.html", "downloaded_at": "2019-10-05 06:15:46.635571+00:00", "title": "Russian explorers find £13.5m in old Soviet money", "language": "en", "text": "Russian explorers have found a billion roubles in Soviet-era money in a swamp - but the haul is completely worthless because it's not legal tender.\n\nThe group from Saint Petersburg went on a search for the cash after hearing rumors of large piles of money in old missile silos after the collapse of the Soviet Union in 1991.\n\nThe eventually found a haul in a swamp in an abandoned mine in Russia's Vladimir region, more than 100 miles from Moscow.\n\nThe group from Saint Petersburg went on a search for the cash after hearing rumors of large piles of money in old missile silos after the collapse of the Soviet Union in 1991\n\nThe eventually found a haul in a swamp in an abandoned mine in Russia's Vladimir region, more than 100 miles from Moscow\n\nThere had been a flood at the mine, which essentially created a swamp full of bills of the Soviet-era currency\n\n'We were told that there is an abandoned missile silos and that there could be hidden treasure – billions of Soviet rubles,' Anton Alekseev, a member of the group who hosts a YouTube channel, told Russia's Komsomolskaya Pravda newspaper.\n\n'We wanted to check whether this is so,' he said of their journey, documented on YouTube by In the Now.\n\nUpon coming across the mine, Alekseev and his explorer friends found thousands of bank notes bearing the face of Vladimir Lenin, according to the BBC.\n\nThe site contains approximately one billion rubles, which is worth about £13.5million ($17.5million) in current exchange rates.\n\nBut the funds are worth nothing because Soviet rubles are no longer legal tender in the Russian Federation.\n\nUpon coming across the mine, Alekseev and his explorer friends found thousands of bank notes bearing the face of Vladimir Lenin\n\nThe site contains approximately one billion rubles, which is worth about £13.5million ($17.5million) in current exchange rates\n\nBut the funds are worth nothing because Soviet rubles are no longer legal tender in the Russian Federation\n\nTeam member Olga Bogdanova said that the mass amount of money found in the mine was difficult to see.\n\n'There's delight and some sadness, because you realise that this is a bygone era which will never return, that all this money would have been more than enough for anybody,' she said.\n\nIn the Soviet era, a salary of just 100 rubles would have been acceptable for a person.\n\nThe Soviet-era currency - the Soviet ruble - first circulated in 1961 and was replaced by Russian rubles the early 1990s.\n\nThe Russian ruble made its first appearance in December 1991 in parallel to the Soviet ruble, which was in circulation until 1993.", "description": "The group from Saint Petersburg went on a search for the cash after hearing rumors of large piles of money in old missile silos after the collapse of the Soviet Union in 1991.", "authors": ["Kelly Mclaughlin For Mailonline"], "top_image": "https://i.dailymail.co.uk/i/pix/2017/05/30/11/40EF251B00000578-0-image-a-7_1496141536966.jpg", "published_at": "2017-05-30"}