{"pub": "cbs", "url": "https://cbsnews.com/news/fentanyl-drug-bust-investigators-seize-enough-fentanyl-to-kill-14-million-people-in-massive-bust", "downloaded_at": "2019-10-21 14:58:55.043499+00:00", "title": "Investigators seize enough fentanyl to kill 14 million people in massive drug bust", "language": "en", "text": "Law enforcement officers in Virginia have seized enough fentanyl to kill 14 million people, busting a massive three-state drug ring as part of what they called \"Operation Cookout.\" Thirty-five suspects were arrested, and four others are on the run.\n\n\"This opioid crisis is not an issue that is happening someplace else, or to someone else. It's happening right here in Norfolk,\" said G. Zachary Terwilliger, U.S. attorney for the Eastern District of Virginia.\n\nIn total, authorities seized over 30 kilograms of fentanyl, 30 kilograms of heroin, five kilograms of cocaine and over $700,000. It's the largest drug takedown in Virginia in 15 years. They also seized roughly 24 firearms, including an AK-47.\n\n\"We're not talking about $500 and $600 deals, we're talking hundreds of thousands of dollars,\" Terwilliger said. \"You know, $20,000 in the trunk of somebody's car in a gym bag, you know, behind a local restaurant.\"\n\nTerwilliger said the bust spanned three states and that one of the 39 people charged ordered fentanyl from Shanghai and had it delivered to Virginia through the mail.\n\n\"The last thing we want is for the U.S. Postal Service to become the nation's largest drug dealer,\" he added.\n\nHampton Police Chief Terry Sult said the case should serve as a warning to other dealers. \"If you're out there, you're using firearms, you're dealing drugs and you're hurting people in our communities, this is the group of people that's coming after you,\" he said. \"And we're relentless.\"\n\nMeanwhile, the Coast Guard announced Thursday that the crew of Coast Guard Cutter Robert Ward has seized about 2,800 pounds of cocaine during their first drug patrol in the eastern Pacific Ocean. The cocaine was worth an estimated $38.5 million.\n\nTerwilliger said that most fentanyl comes from Chinese labs. There's been an increased effort to hold China accountable for drugs like fentanyl that are manufactured there and smuggled to the U.S. A bipartisan bill in the Senate would sanction Chinese labs and traffickers that export the drug.", "description": "Law enforcement officers in Virginia busted a massive three-state drug ring as part of what they called \"Operation Cookout\"", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/08/30/47b10e3b-dae1-4fea-8c5f-7a4d3836dfb4/thumbnail/1200x630/ea072e8a1c9bda04875b7ffd4cb0d3dd/nfa-c-reid-big-drug-bust-needs-track-gfx-frame-736.jpg", "published_at": "2019-08-30"}