{"pub": "marketwatch", "url": "https://marketwatch.com/story/jeopardy-host-alex-trebek-suffers-cancer-setback-resumes-chemotherapy-2019-09-17", "downloaded_at": "2019-09-17 23:27:27.472528+00:00", "title": "‘Jeopardy!’ host Alex Trebek suffers cancer setback, resumes chemotherapy", "language": "en", "text": "NEW YORK — “Jeopardy!” host Alex Trebek says he’s had a setback in his battle with pancreatic cancer and is undergoing chemotherapy again.\n\nTrebek told ABC’s “Good Morning America” on Tuesday that after a short period of optimism when he stopped chemotherapy, his “numbers shot up” and doctors ordered him back on the treatment.\n\nThe 79-year-old game show host announced in March that he had advanced pancreatic cancer. But he hasn’t missed a day on the show, which tapes episodes in advance.\n\nTrebek said his goals for the summer were to get his strength and hair back, and his progress on both fronts was dismal.\n\nThere have been no changes to this season’s taping and production schedule, producer Sony Pictures Television said. Trebek is taping the Tournament of Champions shows Tuesday and Wednesday as planned. Those episodes, with last season’s star James Holzhauer among the 15 contestants, will air Nov. 4-15.\n\nSo far, 40 episodes have been taped out of the 230 planned. “Jeopardy!” typically has a compressed shooting schedule which, as Trebek has said, gives him long breaks.\n\nTrebek said he didn’t feel terrible, although he had fatigue and occasional pain in his back.\n\n“There are moments when, for no reason at all, I feel this surge of sadness, depression,” he said. “It doesn’t last for very long, but it takes over your whole being for a period of time.”\n\nWhile he’s concerned about what his passing would mean for his loved ones, Trebek said he’s not afraid of what lies ahead.\n\n“I’m 79 years old,” he said. “I’ve had one hell of a good life.”", "description": "Trebek told ABC’s “Good Morning America” on Tuesday that after a short period of optimism when he stopped chemotherapy, his “numbers shot up” and doctors...", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HF261_alextr_ZG_20190307120447.jpg", "published_at": "2019-09-17"}