{"pub": "theverge", "url": "https://theverge.com/2019/9/20/20836846/charli-xcx-new-album-streaming-spotify-dani-deahl-future-of-music", "downloaded_at": "2019-10-05 14:29:00.348851+00:00", "title": "Charli XCX explains how streaming is changing songs", "language": "en", "text": "Charli XCX has made a career out of releasing music however and whenever she wants. So if much of her new album, Charli, already sounded familiar to fans, that’s because it should: about half of the album’s tracks were released as singles before its release, spanning back almost a year. This would have been unthinkable before streaming. But Charli uses the instant nature of modern platforms to her advantage, upending the traditional idea of an album and growing her audience in the process.\n\n“I was feeling very creative and wanted to release my music rapidly and when I wanted,” Charli tells me. “Without streaming, it would be so difficult to be able to do that.”\n\nWe all know that streaming has changed the way we listen to music, but it’s also changing the way artists write and release music. With streaming, artists can instantly put their music online, which lets them test out songs, release music on a whim, or even adjust albums after they’re released. Charli has always been at the cutting edge of pop, and she has built a career around disregarding norms, including traditional release structures. It’s increasingly becoming a trend as more artists are leaving the tried and true album cycle behind.\n\nThe traditional album cycle has existed for decades. Instead of releasing music whenever it’s done, artists save up songs to build into a big album drop that happens every couple of years. “You put out a single, maybe a second single,” explains Charlie Harding, host of the podcast Switched on Pop, which is published by The Verge’s sister site Vox. “It’s a way of gaining some press attention to remind people your favorite artist is putting out that big, important package thing that you need to go out and buy.”\n\nThis worked great before streaming when people had to buy physical albums on things like CDs or vinyl. But now, few artists have the luxury of being forgotten for two years and then coming back to try to make a media splash. Everything is available at our fingertips, and fans are hungry for content all the time. “Everything’s very rapidly digested, and people want more,” Charli says. “Everything moves so much quicker now.”\n\nCharli XCX released about half of the album’s songs as singles\n\nTechnology has always dictated the ways artists release music. The flat record was commercialized in the 1890s, and from that time all the way through the 1960s, singles were popular because early kinds of records could only hold around three minutes of audio. Around the 1950s, the LP was introduced, which was a longer format that could hold up to 52 minutes of audio. And the album as we know it was born.\n\nThe traditional album continued with the cassette and then the CD through the 2000s when digital services like iTunes popped up. iTunes allowed people to pick and choose what songs they wanted to buy from albums instead of forcing them to buy the entire thing. This was the beginning of singles coming back, and now, with the rise of streaming services, singles are popular once again.\n\n“Artists are putting out more individual songs because you can,” says Zane Lowe, global creative director and host of Apple Music’s Beats 1 station. “You don’t have to wait around anymore, get into a queue, wait for a record label or some company to tell you it’s your turn up to bat. When you’re sitting there with a really good song, even though you’ve just put out an EP or project or a mixtape or an album, but you’re like, ‘I want to keep it moving,’ you can.”\n\nCharli XCX’s new album is a perfect blueprint of the new album landscape. Chatter about the album first started in late May when she tweeted, “your mother is about to feed you new music for 5 months straight.” Shortly after, the album was officially announced on Instagram. From around that time up until the album’s release date of September 13th, she released about half of the album’s songs, including “Blame It On Your Love” feat. Lizzo and “Gone” with Christine and the Queens. On top of that, she also released tons of singles not meant for an album, like a Spice Girls remix with Diplo, a track for BTS’s new mobile game, and club bop “Flash Pose” with Pabllo Vittar. And they’re racking up hundreds of millions of streams across platforms.\n\nangels, your mother is about to feed you new music for 5 months straight. you deserve it and you’re welcome. — Charli (@charli_xcx) May 21, 2019\n\nCharli isn’t the only artist doing this. Entire genres like hip-hop and dance have been playing with singles, mixtapes, and rapid-fire releases for ages. Other genres, like pop, have been slower to experiment, but that’s changing. You might have noticed that a lot of your favorite artists from all sorts of genres are consistently dropping more singles. The term for this is called the “waterfall strategy,” and it’s becoming more popular.\n\nBebe Rexha, Billie Eilish, and The Chainsmokers are among the artists doing this. They will put out singles month after month, eventually bundling them into an EP or an album. Every time a new single is put out, it gives a boost to the other ones released before it. Zach Fuller, a media analyst for MIDiA Research in London, told Billboard last year that this strategy works because it constantly refreshes an artist’s page with new material. “If you do discover it [from a playlist], you are innately more likely to go to the [artist’s] page, and Spotify has the latest releases at the top,” he says. The idea is that albums are built, not dropped.\n\nAlbums are built, not dropped\n\nStreaming hasn’t just changed the album; it’s also changed the way songs are written. Artists are competing with shorter attention spans and the tens of thousands of songs uploaded every day. A song needs to be listened to on most streaming platforms for at least 30 seconds to trigger a payout. As a result, songs are becoming shorter, and artists are front-loading all the catchy bits to keep a song’s skip rate as low as possible.\n\n“If I’m writing a song that is for another big pop artist, I want to play all the games,” Charli says. “Chorus within the first 30 seconds. No weird self-indulgent intro… Hook at the top in the intro, maybe even start with the chorus, under three minutes. I think that radio songs should be two minutes, 20 [seconds]. Get in, get out, everybody just get on with your life, you know?”\n\nCharli XCX says the formula used to just be about making the “most pop hit song” possible, but now there’s talk about skip rates in studio sessions. “It’s all about: did you grab them in that first five seconds? And did they add it to their playlist?” she says.\n\nThe way Charli releases music isn’t as rogue as it used to be. Songs like “Never Really Over” by Katy Perry and “OMG” by Camila Cabello feat. Quavo have yet to appear on albums. And tons of big-name artists are taking advantage of streaming’s freedom in different ways. Last year, Ariana Grande said she no longer wanted to subscribe to the two-year album cycle, telling Rolling Stone, “My dream has always been to… put out music in the way that a rapper does.” Then, she dropped two albums within months of each other. And Kanye West edited a track on Ye to remove a sample five months after the album was released.\n\nMany have declared that streaming, and its contribution to the rise of singles, killed the album, but Harding and Lowe disagree. Instead, they see what’s happening as an evolution of the album, giving rise to an era where artists have the freedom to experiment in ways that were never possible before. “I think that we’ll see a lot of artists who are going to play with the form and idea of an album,” says Harding. “That will delight us, excite us, and change our idea of what an album can be.”\n\nEssentially, streaming’s dominance means there’s no “right way” to release music anymore. Instead, it’s about what fits for an individual artist, and, for Charli, what fits is being spontaneous. “You can travel and create your own buzz via all the tools that are available for us to work on our own,” Charli says.\n\nPlus, she says, streaming means listeners get to pick who’s worth hearing. “It’s not a bunch of white males at radio stations and record labels deciding what the general public should listen to.”\n\nMake sure to check out other episodes of The Future of Music here.", "description": "In the fifth episode of The Future of Music season 2, Dani Deahl visits pop star Charli XCX to talk about why she releases so many singles and how streaming has changed the way she writes music.", "authors": ["Dani Deahl", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/LRMAtuqIqfQWKk6gVtLoy42uE4g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18329753/pcheung_190715_3541_0002.jpg", "published_at": "2019-09-20"}