{"pub": "npr", "url": "https://npr.org/sections/health-shots/2019/09/11/756090847/how-to-teach-future-doctors-about-pain-in-the-midst-of-the-opioid-crisis", "downloaded_at": "2019-09-11 13:50:41.779407+00:00", "title": "How To Teach Future Doctors About Pain In The Midst Of The Opioid Crisis", "language": "en", "text": "How To Teach Future Doctors About Pain In The Midst Of The Opioid Crisis\n\nEnlarge this image Tracy Lee for NPR Tracy Lee for NPR\n\nThe next generation of doctors will start their careers at a time when physicians are feeling pressure to limit prescriptions for opioid painkillers.\n\nYet every day, they'll face patients who are hurting from injuries, surgical procedures, or disease. Around 20% of adults in the U.S. live with chronic pain.\n\nThat's why some medical students felt a little apprehensive as they gathered recently for a mandatory, four-day course at Johns Hopkins University in Baltimore — home to one of the top medical schools in the country.\n\nThe subject of the course? Pain.\n\n\"I initially was a bit scared and I guess a bit wary coming into this course because of the opioid crisis,\" says medical student Annie Cho. \"That seems like that's the only thing that people have been talking about nowadays.\"\n\nShe wasn't the only one aware of how fraught pain can be right now. Student Jenny Franke says she's been shadowing doctors in a clinic, and has already seen new patients come in with pain.\n\n\"And it seems that the therapy that they are on hasn't been working, and a lot of the time their past primary care providers just keep prescribing the same thing over and over,\" Franke says. \"Sometimes those patients will ask for opioids, and then it turns into kind of an awkward conversation.\"\n\nEven though doctors see a lot of pain, medical schools traditionally haven't dedicated much time to teaching future physicians about it, says Shravani Durbhakula, a pain management specialist at Johns Hopkins Hospital and director of the pain course this year.\n\n\"Most medical schools get about nine hours of formalized pain education,\" says Durbhakula. \"If I was to think back to my training, it probably is somewhere about that much time.\"\n\nWhile she remembers some classes on certain painkillers, she says, \"I don't remember a lot of formal pain education, certainly not any kind of course that was given to me. It was just something you kind of learned as you went along.\"\n\n\"There are very few medical schools that have a course like ours,\" agrees Jennifer Haythornthwaite, a professor in the Department of Psychiatry & Behavioral Sciences at Johns Hopkins University School of Medicine.\n\nMost schools have integrated pain management throughout their curriculum, says Alison Whelan, chief medical education officer at the Association of American Medical Colleges, which represents hundreds of medical schools and teaching hospitals.\n\nA couple of years ago, her group did a telephone survey of its members to see what they were teaching about pain. They asked about four important categories: what pain is, how you identify it and assess the severity, how you treat it, and how you deal with cultural and social issues related to pain management.\n\nWhile 87% of medical schools reported teaching all of those pain-related subjects, there's great interest in medical schools in coming up with new ways to bolster teaching about the management of pain.\n\nAnd a recent review of a key medical licensing exam showed that most of the questions it asked about pain focused on assessment, rather than on safe and effective pain management.\n\nBarbara Del Duke, a spokesperson for the National Board of Medical Examiners, says that every year, hundreds of volunteers gather to write new questions for this test. \"The opioid epidemic is definitely on the minds of these volunteers,\" she says. \"We see evidence of this through the test items they write.\"\n\nAll of this is a big change. About a decade ago, as the opioid crisis was taking off in the U.S., a Johns Hopkins neurologist and pain specialist named Beth Hogans looked to see what medical schools were teaching about these drugs.\n\n\"U.S. medical students were getting less than one hour, on average, of opioid- related instruction in medical school,\" Hogans says. \"That's not enough.\"\n\nShe helped create the four-day course at Hopkins, with the idea of giving all students a solid foundation for thinking about pain and pain management at the start of their medical education.\n\nHere, the students learn that pain is a physical and an emotional experience, and that doctors tend to underestimate pain. They learn how it can be affected by people's moods, cultural expectations or individual sensitivity. They discuss problems with the usual way of asking patients to rate their pain on a scale of 1 to 10, and learn to instead ask if and how pain limits people's daily activities.\n\nAnd, of course, they talk about opioids. A doctor named Ryan Graddy asks the students to pull out their cellphones. He says they should text him a few words in response to this question: \"What comes to mind when I say 'chronic opioid therapy?' \"\n\nTheir answers start to appear on a big screen behind him. The first word is BAD. Other words pop up, including ADDICTION and DRUG ABUSE. The lecture hall fills with nervous laughter.\n\n\"So, interesting, right, a lot of negative connotations that people have with chronic opioid therapy,\" says Graddy, who goes on to describe some of the challenges his patients face and why some have been on opioid pain medications long-term.\n\nOverall, students get taught that opioids are just one tool in the toolbox — though one they will have to learn to use thoughtfully and carefully.\n\n\"You wouldn't really use a chainsaw to cut a piece of paper. But you also wouldn't use a pair of scissors to cut down a tree,\" Cho says.\n\nOver and over, speakers stress the need to build a relationship with patients rather than just write a prescription.\n\n\"We can't just focus on that single moment of writing a script,\" says bioethicist Travis Rieder, who shared a harrowing account of how he was prescribed opioids by about a dozen different caregivers after having an accident and then surgery. When he became physically dependent and wanted to stop taking opioids, he couldn't find a doctor willing to help him get through his agonizing withdrawal.\n\nRieder's experiences surprised medical student David Botros. \"I really didn't expect that to even be ... I don't want to say possible, but even a factor in the health care world, I guess,\" Botros says.\n\nBotros and the other students heard about other possible medications, beyond opioids. And they learned that pain control goes way beyond just prescribing drugs. Patients could benefit from physical therapy, cognitive behavioral psychotherapy and all kinds of exercise, like yoga.\n\n\"You really need to address the whole person,\" says Traci Speed, assistant professor of psychiatry and behavioral sciences at Johns Hopkins. She notes that co-occurring depression or substance use can increase the severity of pain. \"It's the chicken and the egg, which one do you treat first? And sometimes, you have to treat both to really get patients to improve.\"\n\nGraddy thinks the medical profession overall has been doing a disservice to patients when it comes to chronic pain. \"I see that certainly in my own practice — a lot of patients who have bounced around from place to place and not been treated with the respect or dignity or empathy that they deserve,\" he says.\n\nThat's why this hospital invited patients and their families to this lecture hall, to movingly convey how pain impacts their entire lives. And these medical students definitely get the message.\n\n\"I felt like I learned a lot and it was very helpful,\" Franke says. \"One thing I learned was to really get into the patients' perspectives and their values, and figuring out what their pain goals are. One important thing we learned is that it's rare that you will get a chronic pain level to a zero.\"\n\nTony Wang took this course two years ago and is just finishing his third year of medical school.\n\n\"The takeaway message that I distinctly remember leaving with was that pain management is extremely complicated,\" Wang says. \"It's not just, give this medication and they'll feel better.\"", "description": "Around 20% of U.S. adults live with chronic pain. Medical schools traditionally haven't dedicated much time to teaching about pain and pain control, but one top school now has a mandatory course.", "authors": ["Nell Greenfieldboyce"], "top_image": "https://media.npr.org/assets/img/2019/09/03/teaching-pain_wide-05598d0b3044bf7f1f01c91d4aa4eb895fd661a9.jpeg?s=1400", "published_at": "2019-09-11"}