{"pub": "marketwatch", "url": "https://marketwatch.com/story/democrats-have-fallen-into-an-impeachment-trap-that-will-only-hurt-them-2019-10-01", "downloaded_at": "2019-10-01 15:24:04.334608+00:00", "title": "Democrats have fallen into an impeachment trap that will only hurt them", "language": "en", "text": "ANDREW CABALLERO-REYNOLDS/AFP/Getty Images A sign at a rally on Capital Hill on Sept. 26.\n\nCHICAGO (Project Syndicate) — Democrats have made a serious mistake by launching impeachment proceedings against President Donald Trump. They are replaying the Republican impeachment of Bill Clinton in 1998, a futile exercise that damaged Republicans, enhanced Clinton’s power, and caused institutional damage as well.\n\nNow read this: Here’s what’s happening next in Democrats’ impeachment inquiry into Trump\n\nThe common factor of the two impeachments is that it was clear from the start that the U.S. Senate would never convict, which requires a two-thirds majority. The 45 Senate Democrats were not happy that Clinton perjured himself before a grand jury, obstructed justice, and conducted an extramarital sexual affair with a White House intern, Monica Lewinsky.\n\nDemocrats have made a serious mistake by launching impeachment proceedings against President Donald Trump. They are replaying the Republican impeachment of Bill Clinton in 1998, a futile exercise that damaged Republicans, enhanced Clinton’s power, and caused institutional damage as well.\n\nNBut they did not believe that this behavior was grounds for removal from office. The behavior was not sufficiently egregious to overcome their political loyalty to a president who remained popular with voters.\n\nHoped to pick up seats in Senate\n\nRepublicans leading the impeachment knew that few if any Senate Democrats would vote to convict (in fact, none did). But Republicans hoped to embarrass the Democrats and damage Clinton, believing that they would pick up some seats in the November 1998 election by launching impeachment proceedings before then.\n\nThey were wrong. Clinton’s popularity rose after the impeachment proceedings ended. Most Americans believed that impeachment was a mistake.\n\nMany people worried that the Clinton impeachment would damage the presidency, but its main impact on presidential power was the opposite. Republicans eventually agreed with Democrats that responsibility for the debacle lay with Kenneth Starr, the independent counsel whose investigations of Clinton’s real-estate dealings years earlier eventually led him to Lewinsky. The two parties allowed the independent counsel statute to lapse, freeing the presidency from a powerful form of oversight, much to Trump’s benefit a generation later.\n\nToday, Senate Republicans may well be privately concerned about Trump’s behavior. But there is no indication that even one would vote in favor of removal. While Trump is nowhere near as popular as Clinton was, he retains the loyalty of his base, who dominate the Republican primaries, and, unlike Clinton, he enjoys majority support in the Senate.\n\nNothing could possibly change minds\n\nIndeed, the extraordinary enthusiasm of Trump’s supporters — their indifference to his many other scandals — almost guarantees that any additional information that might materialize during the impeachment hearings will not influence Republican senators.\n\nSome supporters of impeachment argue that the gravity of the accusations against Trump — that he enlisted a foreign country to harass a political opponent — will ensure his conviction. But we have been through this before. Democrats who abhor sexual harassment and perjury supported Clinton because they saw the alternative as worse. Republicans will make the same calculation.\n\nPerhaps the story would be different if Trump had persuaded the Ukrainians to arrest Joe Biden while sightseeing in Kiev. The president’s behavior, as odious as it is, is a far cry from Richard Nixon’s involvement in espionage against the Democratic Party — the single historical example of impeachment proceedings leading to the removal (in Nixon’s case, resignation) of the president.\n\nOthers argue that even if Trump is not removed, impeachment in the House — which the Democratic majority virtually guarantees — will send a strong signal that the president’s behavior violates American values.\n\nDemocrats seen as losers\n\nBut impeachment has its own narrative logic: once the Democrats initiate it, they either win or lose. If they lose, they will be seen as losers who wasted public resources for a futile goal.\n\nStill others believe that impeachment hearings will reveal that Trump has committed crimes or betrayed the country in as yet undisclosed ways, or that the hearings will enable Democrats to convey the seriousness of all the president’s wrongdoing in a way that will galvanize the public.\n\nBut the leaky Trump administration has kept few secrets so far, and much of his behavior has been normalized, at least for his Republican supporters.\n\nImpeachment proceedings, unlike judicial proceedings, are a cumbersome mechanism for developing evidence. Nothing new was learned about Clinton after the Starr Report was issued, and nothing new will be learned about Trump.\n\nIndeed, Trump’s character flaws and misbehavior are already so well known that the impeachment proceedings will most likely blow back and cause more harm to Democratic politicians than Republicans.\n\nLessons from Clinton\n\nAgain, the Clinton impeachment offers lessons. Everyone knew, or suspected, that Clinton was a womanizer (or what today might be called a sexual predator) and a serial liar. People were not quite as aware that Republican Speaker Newt Gingrich had also conducted an extramarital affair, as did his successor, Bob Livingston. Both resigned; Clinton remained in office.\n\nTrump’s greatest skill is in turning his prosecutors into the accused. Expect this to happen again, with Trump using his Twitter account to shine a spotlight on whichever Democrats have the greatest political vulnerabilities.\n\nNone of this is rocket science. So, why would a canny politician like Speaker of the House Nancy Pelosi yield to other members’ pressure for impeachment (though she is clearly temporizing — for example, by refusing to hold a vote in the House to authorize the impeachment proceedings)? The answer stems from the basic logic of Congress in a polarized era.\n\nCongress is a collective body. Its members are beholden to voters in specific districts or states rather than the country as a whole. House Democrats from more liberal districts fear that they will be defeated in primaries by more forcefully anti-Trump challengers. The only way to counter such challenges is by supporting impeachment.\n\nAs more Democrats jump on the bandwagon, more moderate Democrats join in to avoid looking like defenders of Trump’s misconduct.\n\nMark Twain supposedly joked that “history does not repeat itself but it often rhymes.” But in this case, repetition seems to be the right word. The political logic that trapped the Republicans in 1998 will operate the same way on the Democrats in 2019.", "description": "America’s Democrats have made a serious mistake by launching impeachment proceedings against President Donald Trump. Like the impeachment of Bill Clinton, it...", "authors": ["Eric Posner"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS395_impeac_ZG_20191001102200.jpg", "published_at": "2019-10-01"}