{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/30/daily-crunch-hbo-max-will-launch-in-may", "downloaded_at": "2019-10-30 23:18:45.810294+00:00", "title": "Daily Crunch: HBO Max will launch in May – TechCrunch", "language": "en", "text": "The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 9am Pacific, you can subscribe here.\n\n1. HBO Max will cost $14.99 per month and launch in May 2020\n\nAT&T and WarnerMedia announced the pricing, launch timetable and content lineup of their HBO Max streaming service. They also revealed that HBO has placed a straight-to-series order for “House of the Dragon,” a spin-off of “Game of Thrones.”\n\nEven though distinguishing between HBO and HBO Max will probably be a bit of a headache over the next few years, this is a service that I’m genuinely excited about, with a rich library of HBO shows and Warner Bros. films at its core. And while the price is high compared to competing services, there’s no additional cost compared to the existing HBO Now.\n\n2. WhatsApp blames — and sues — mobile spyware maker NSO Group over its zero-day calling exploit\n\nWhatsApp has filed a suit in federal court accusing Israeli mobile surveillance software maker NSO Group of creating an exploit that was used hundreds of times to hack into targets’ phones.\n\n3. Tencent leads $111M investment in India’s video streaming service MX Player\n\nTimes Internet, which acquired a majority stake in MX Player in late 2017, also participated in the Series A financing round. The post-money valuation was $500 million, according to a source.\n\n4. Spotify launches a dedicated Kids app for Premium Family subscribers\n\nThe app allows children three and up to listen to their own music, both online and offline, as well as explore playlists and recommendations picked by experts. The music selection is filtered so songs won’t have explicit content.\n\n5. Slack investor Index Ventures backs Slack competitor Quill\n\nQuill, a startup led by Stripe’s former creative director Ludwig Pettersson, claims to offer “meaningful conversations, without disturbing your team.”\n\n6. Where top VCs are investing in cybersecurity\n\nMany of the rising cybersecurity startups focus on the same or overlapping problems, which could lead to a “cybersecurity consolidation.” (Extra Crunch membership required.)\n\n7. Let’s have a word about what3words with Clare Jones at Disrupt Berlin\n\nWhat3words wants to map the entire world and overhaul addresses, three words at a time. The startup has divided the world into three-meter squares, each one assigned three words as an identifier.", "description": "The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 9am Pacific, you can subscribe here. 1. HBO Max will cost $14.99 per month and launch in May 2020 AT&T and WarnerMedia announced the pricing, launch timetable and […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/Screen-Shot-2019-10-29-at-7.56.09-PM.png?w=736", "published_at": "2019-10-30"}