{"pub": "mirror", "url": "https://mirror.co.uk/news/us-news/parents-shocked-discover-adopted-daughter-20737817", "downloaded_at": "2019-10-28 00:27:40.182203+00:00", "title": "Parents shocked to discover adopted daughter has an identical twin", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJennifer Doering knew the email sitting in her inbox was the ­surprise Christmas present she had been arranging for her adopted daughter Audrey.\n\nShe and husband Tom had asked a researcher in China – from where they had adopted their 10-year-old daughter – to find the original documents about her birth and adoption as a special gift.\n\nBut what she found inside the email proved to be life-changing for them.\n\nAs she scrolled down she saw a photo of two “Audreys” – the baby they had adopted aged 14 months was a twin.\n\n“I’d every emotion all rolled into one” Jennifer, of Wausau in Wisconsin, says. ­“Excitement, fear, confusion.\n\n“When you’re looking at a photo of your child and you can’t figure out which one is yours, you can’t tell the difference, you know there’s no other explanation, this is real.\n\n\"I was desperate to find out who the other child was.”\n\nShe found out the twin was called Gracie and also living in the US.\n\nBoth families knew the girls had to meet, despite the ­maelstrom of emotions.\n\nGracie’s mum Nicole Rainsberry recalls: “I showed her a picture of Audrey and Jennifer.\n\n“I asked her who the little girl was and she kept insisting it was her, but she had no idea who the lady was or where the picture had been taken.\n\n“When she realised the clothes were not hers she was super confused.\n\n“Then we told her the little girl was her twin. She was pretty much speechless. After a few nervous laughs, she got emotional, it was so much to process.”\n\nThe next day the girls saw each other face to face on a video call.\n\nAudrey, now 13, says: “I was shocked. I didn’t think it was real.\n\n“I don’t think I said anything, I just cried. It was very emotional.”\n\nTheir incredible story is told tonight in ITV’s Long Lost Family series, about twins who were separated at birth.\n\n(Image: Collect unknown)\n\nThe Chinese researcher found the girls had been left in different places by their mother as babies but had been taken to the same orphanage.\n\nJennifer says: “Because Audrey had a heart condition and was very sick when we brought her home, I didn’t know if her twin was alive.\n\n\"She could be anywhere in the world, she might not speak the same language, and her adoptive parents might not want to know who we were.”\n\nIncredibly, using the girl’s name and date of birth and posting appeals on Facebook , it took just two days to find the family who had adopted her.\n\nThey were living 1,500 miles away in Richland, Washington state.\n\nJennifer says: “I was astounded when I looked at their Facebook page and saw a picture of them with a girl who looked just like my daughter.\n\n“It’s the craziest thing in the world to look at your child exactly. I mean, everything was the same. The same hair, the same glasses, the same outfits.\n\n“There was never any doubt we’d tell Audrey. I couldn’t imagine waiting until my daughter’s 18th. Once we knew, we couldn’t undo it.”\n\nNicole, who with her husband Scott also has three biological children, was equally shocked when, on December 8, 2016, she got a message from Jennifer.\n\nShe says: “It was very upsetting, ­overwhelming and hard to process. I was so confused, how and why did this happen?\n\n“The whole thing ­terrified me because I didn’t know how all of our lives would change.\n\n“We considered whether we should tell Gracie right away or wait until she was older. It was a fleeting thought – it was something she deserved to know as soon as possible.”\n\n(Image: Collect unknown)\n\nThe day after telling Gracie about her twin in Wisconsin, Jennifer and husband Tom sat down with Audrey to break the news – just before that emotional video call.\n\nJennifer remembers: “When both girls came up on the screen it was an incredible moment. They just looked at each other and started crying.\n\n“Both had their hair in ponytails to one side, and were wearing the same pair of glasses. Even though we live in different parts of the country, they spoke in exactly the same way.\n\n“Their mannerisms were exactly the same and they even cried the same way. It was so emotional we had to stop and take a moment, then call her back.\n\n“My husband helped initiate some of the conversation, but after that they started chatting, like they’d been together for years.”\n\nThe two girls met up a month later, live on US TV.\n\nJennifer says: “We’ve been astonished at how alike they are. They talk the same, like the same things, right down to their favourite food and subjects.\n\n“They are laughing one minute and crying the next. They both get nervous a lot too, and when they do they push their glasses up their noses in exactly the same way.”\n\nGracie’s mum Nicole said: “It was amazing to me that math was both their favourite subject and despite both having heart conditions that they were amazing athletes.”\n\nThe girls see each other several times a year, including summer camps.\n\nAudrey went to Gracie’s home for Christmas last year.\n\nThey visited London for the Long Lost Family TV show, when they met twins expert Professor Tim Spector for tests looking at whether genes or ­environment makes us who we are.\n\n(Image: NBC News)\n\nAudrey says: “I just love being together with her. When we’re not together I miss her a lot. We speak or text every day. We have this connection, it’s like she’s part of me.\n\n“The only way we’re different is I dress up more than Gracie. I like wearing girly clothes and she wears more sporty clothes.”\n\n“I’m not sure how to explain it,” Gracie says. “Getting to have her is like having another part of me. Whenever we talk and get together, I just feel a connection. I can talk to her about a lot of things and I know she will help me through it, and I feel I can do the same for her.”\n\nBut in a nod to nurture versus nature, Audrey wants to go into medicine like her physician’s assistant mum and gynaecologist dad, while Gracie wants to be a teacher like her mum.\n\nNicole says: “I’ve no doubt they will continue to grow closer as they get older, and will remain close throughout their lives.”\n\nJennifer says: “All things happen for a reason. I’m so glad I opened that email, even thought it turned our worlds upside down. We feel very lucky now.”\n\nLong Lost Family Twins: What Happened Next, ITV Monday, October 28, 9pm", "description": "EXCLUSIVE: Tom and Jennifer Doering of Wisconsin, USA, experienced an emotional rollercoaster after discovering their daughter Audrey was a twin", "authors": ["Matt Roper", "Image", "Facebook", "Collect Unknown", "Nbc News"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20736004.ece/ALTERNATES/s1200/0_long_lost_family_twins_06JPG.jpg", "published_at": "2019-10-27"}