{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/updates-from-arrow-new-gods-and-more", "downloaded_at": "2019-10-04 23:46:01.614922+00:00", "title": "Updates From Arrow, New Gods And More", "language": "en", "text": "Just how many more people from Ollie’s past can show up for the last season? We’re gonna find out! (Photo: The CW)\n\nThe G.I. Joe spinoff Snake Eyes adds another to its cast. Michelle Pfeiffer is game to return as the MCU’s Janet Van Dyne. Tom King talks Ava DuVernay and her passion for New Gods. Plus, get a look at the somehow still-untitled Walking Dead spinoff, and what’s to come on Flash, Batwoman and a cavalcade of more returning CW shows. Spoilers get!\n\nSnake Eyes\n\nThe Wrap reports actress Haruka Abe (She’s Just a Shadow) has joined the cast of Snake Eyes in a currently undisclosed role.\n\nAnt-Man 3\n\nSpeaking with Variety, Michelle Pfeiffer answered “it’s possible” when asked if she would appear in a third Ant-Man movie.\n\nMichelle Pfeiffer is down for a third #AntMan pic.twitter.com/bWGQ6uN0Hq — Variety (@Variety) October 1, 2019\n\nBitter Root\n\nAccording to Deadline, Ryan Coogler now is attached to produce the film adaptation of Bitter Root, the Image comic book series following a family of monster hunters during the Harlem Renaissance of 1924.\n\nGideon Falls\n\nRelatedly, /Film also has word James Wan will serve as executive producer on the upcoming film adaptation of Gideon Falls.\n\nArmy of the Dead\n\nSpeaking with New Jersey radio station WMMR, Zach Snyder revealed Army of the Dead is a heist movie set in zombie-infested Las Vegas.\n\nThe movie takes place in Las Vegas. A zombie plague hits Vegas, and they’re able to contain the virus to the city – they build a wall out of shipping containers. And then the city falls. And six years later, one of the casino owners hires this group of zombie soldiers to go get his money that he left in a safe in the casino. It’s coming out on Netflix next winter.\n\nNew Gods\n\nTom King described Jack Kirby and Ava Duvernay as “parallel figures” during a recent interview with Publisher’s Weekly.\n\nI feel like I have this genius, Jack Kirby, who created this [series] and this genius Ava DuVernay. I see them as parallel figures. Both taking their uniquely American backgrounds and using them to push American art forward into places it’s never been before. I feel like it’s my job to bring those two geniuses to together and to make it work.\n\nPortals\n\nAn artificial black hole triggers mysterious doorways to open across Earth in the first trailer for Bloody-Disgusting’s own horror anthology film, Portals.\n\nKaty Keene\n\nBernadette Peters has joined the cast of Riverdale’s musical spinoff series, Katy Keene, as Ms. Freesia, “a wealthy Upper East sider who secured her luxurious lifestyle through cunning means and is actively forming Pepper in her fabulous image.”\n\n[TV Guide]\n\nArrow\n\nEntertainment Weekly also now reports Colton Haynes will return for Arrow’s final season — like seemingly everyone previously involved with Arrow — as Roy Harper in a recurring capacity.\n\nThe Flash\n\nThe Elongated Man uncovers a family secret while Barry prepares for the forthcoming Crisis in the synopsis for “Dead Man Running”, the third episode of The Flash’s sixth season.\n\nGET READY FOR A KILLER PARTY - Knowing that Crisis is only weeks away, Barry (Grant Gustin) prepares a member of Team Flash for life without him while hunting a terrifying meta-human with an unquenchable thirst. Meanwhile, Ralph (Hartley Sawyer) uncovers a family secret. Sarah Boyd directed the episode written by Lauren Barnett & Thomas Pound (#603).\n\n[Spoiler TV]\n\nSupergirl\n\nSupergirl tries to patch things over with Lena Luthor in the synopsis for “Blurred Lines”, the third episode of season five.\n\nBE CAREFUL WHO YOU TRUST- Kara (Melissa Benoist) attempts to mend her relationship with Lena (Katie McGrath). J’onn J’onzz (David Harewood) takes a deep dive into his memories while Kelly (Azie Tesfai) tries to help an old friend. Eric Dean Seaton directed the episode written by Lindsay Struman & J. Holtham (#503).\n\n[Spoiler TV]\n\nBatwoman\n\nBatwoman meets Hush in the synopsis for “Down, Down, Down”.\n\nGOODBYE TO THE BAT - As the city waits impatiently for another visit from who they think is Batman, Alice (Rachel Skarsten) continues to taunt Kate (Ruby Rose) with a secret but also sets her sights on Jacob (Dougray Scott) and Catherine (Elizabeth Anweis). Kate is visited by Tommy Elliot (guest star Gabriel Mann), a childhood friend of her cousin who has finally realised his lifelong dream of being wealthier than Bruce Wayne and throws a party so all of Gotham can celebrate his success. Mary (Nicole Kang) gets an unexpected new bestie when Sophie (Meagan Tandy) is assigned to protect her. Luke (Camrus Johnson) and Kate work together to uncover who may have taken a valuable weapon from Batman’s arsenal. And as Batwoman faces a new enemy, Kate realises she must either walk away from her new role or fully embrace the mantle as Gotham’s new hope. Dermott Downs directed the episode written by Holly Henderson and Don Whitehead (#103).\n\n[Spoiler TV]\n\nBlack Lightning\n\nSpoiler TV has the synopses for the second and third episodes of Black Lightning’s third season.\n\nThe Book of Occupation: Chapter Two SEPARATED – With Freeland under full-blown occupation, the Pierce family gets pulled in different directions. Jefferson (Cress Williams) and Lynn (Christine Adams) find themselves at odds with each other. Meanwhile, Anissa (Nafessa Williams) rebels as Blackbird while Jennifer (China Anne McClaim) feels powerless despite having powers. Marvin Jones III, Jordan Calloway and Damon Gupton also star. Oz Scott directed the episode written by Charles Holland (#302).\n\nThe Book of Occupation: Chapter Three TENSION – When Lynn (Christine Adams) learns that Jefferson (Cress Williams) brokered a deal with Agent Odell (guest star Bill Duke) without consulting her first, it begins to put a strain on their relationship. Meanwhile, Anissa (Nafessa Williams) and Grace (guest star Chantal Thuy) have an emotional encounter. China Anne McClain, Marvin Jones III, Damon Gupton and Jordan Calloway also star. Benny Boom directed the episode written by Pat Charles (#303).\n\nTitans\n\nSpoiler TV also has titles for the next crop of Titans episodes.\n\nEpisode 2.07 - Jericho Episode 2.08 - Bruce Wayne Episode 2.09 - Atonement Episode 2.10 - Fallen\n\nNancy Drew\n\nNancy Drew investigates a ghost rumoured to have washed ashore, Baywatch Nights-style, in the synopsis for “The Curse of the Dark Storm”, episode three of the first season.\n\nRESTLESS SPIRITS – When a nor’easter hits Horseshoe Bay, Ace (Alex Saxon) warns everyone that the storm has been known to blow restless spirits ashore. Meanwhile, Nancy (Kennedy McMann) confronts Nick (Tunji Kasim) about the secrets he’s been keeping. Scott Wolf, Leah Lewis, Maddison Jaizani, Riley Smith and Alvina August also star. John Kretchmer directed the episode written by Jesse Stern and Lisa Bao (#103). Every episode of NANCY DREW will be available to stream on CWTV.com and The CW App the day after broadcast for free and without a subscription, log-in or authentication required.\n\n[Spoiler TV]\n\nSupernatural\n\nSam, Dean, and Rowena hold back hell in the synopsis for “The Rupture”, the fourth episode of season 15.\n\nAS IT IS WRITTEN - Sam (Jared Padalecki) and Dean (Jensen Ackles) together with Rowena (guest star Ruth Connell) work tirelessly to keep all of hell from breaking loose. Castiel (Misha Collins) cannot forgive an arrogant betrayal. Charles Beeson directed the episode written by Robert Berens. (#1504).\n\n[Spoiler TV]\n\nCharmed\n\nMel and Harry visit another dimension in the synopsis for “Careful What You Witch For”.\n\nTHE STRUGGLE IS REAL — While Mel (Melonie Diaz) and Harry (Rupert Evans) try to crack the Book of Elders, Macy (Madeleine Mantock) struggles with the good and bad aspects of her demon side. Maggie (Sarah Jeffery) competes with Jordan (Jordan Donica) for a promotion. Macy ventures out alone and meets an injured and terrified witch named Abigael (Poppy Drayton). Mel and Harry visit another dimension. Gina Lamar directed the episode written by Nicki Renna (#203).\n\n[Spoiler TV]\n\nLegacies\n\nA monster crashes Salvatore’s annual football game against Mystic Falls High in the synopsis for “You Remind Me of Someone I Used to Know”, the third episode of the second season.\n\nTHE SALVATORE SCHOOL VS MYSTIC FALLS HIGH — As the Salvatore School prepares for its annual football game against Mystic Falls High, the latest monster to arrive in Mystic Falls sets its eyes on one of the students. Landon (Aria Shahghasemi) and Josie’s (Kaylee Bryant) relationship is put to the test when a player from the opposing team catches his eye. Elsewhere, Lizzie (Jenny Boyd) enlists MG’s (Quincy Fouse) help learning more about Sebastian (guest star Thomas Doherty), and Alaric (Matthew Davis) goes head to head with Professor Vardemus (guest star Alexis Denisof). Danielle Rose Russell and Peyton Alex Smith also star. Michael Allowitz directed the episode written by Brett Matthews & Adam Higgs (#203). Original airdate 10/24/2019. [Spoiler TV]\n\nKSiteTV also has a few images from the episode. Two more at the link.\n\nUntitled Walking Dead Spinoff\n\nBloody-Disgusting also has images from AMC’s still-untitled Walking Dead series. Click through to see the rest.\n\nCreepshow\n\nBloody-Disgusting has an exclusive clip from Rob Schrab’s episode of Creepshow.\n\nServant\n\nM. Night Shyamalan’s new Apple+ series has another eerie trailer.", "description": "The G.I. Joe spinoff Snake Eyes adds another to its cast. Michelle Pfeiffer is game to return as the MCU’s Janet Van Dyne. Tom King talks Ava DuVernay and her passion for New Gods. Plus, get a look at the somehow still-untitled Walking Dead spinoff, and what’s to come on Flash, Batwoman and a cavalcade of more...", "authors": ["James Whitbrook", "Gordon Jackson", "David Nield", "David Tracy"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/tb399cuiy2fctfygjvbz.jpg", "published_at": "2019-10-04"}