{"pub": "reuters", "url": "https://reuters.com/article/us-aviva-gb-m-a-asia-exclusive/exclusive-avivas-asian-units-attract-interest-from-global-suitors-sources-idUSKBN1W90JX", "downloaded_at": "2019-09-24 13:55:47.526968+00:00", "title": "Exclusive: Aviva's Asian units attract interest from global suitors - sources", "language": "en", "text": "HONG KONG/SINGAPORE (Reuters) - German insurer Allianz, Nippon Life and MS&AD Insurance are vying with rivals to buy the Singapore and Vietnam businesses of Britain’s Aviva in a deal likely to be worth up to $2.5 billion, sources said.\n\nFILE PHOTO: An Aviva logo sits on the window of the company head office in the city of London, Britain March 7, 2019. REUTERS/Simon Dawson/File Photo\n\nCanada’s Sun Life Financial and Manulife Financial Corp are also among roughly half a dozen suitors for the businesses, said the people with knowledge of the matter, who declined to be named as the talks are confidential.\n\nThe combined deal value for the businesses is estimated to be between $2 billion and $2.5 billion, they said, adding that talks were at an early stage and terms could change.\n\nAsia’s fast-growing economies and its relatively low number of insured people make the region a promising market for global insurers - the regional market, worth $1.7 trillion in premiums, is expected to account for 42% of global premiums by 2029 from about a third currently, a Swiss Re Institute report showed.\n\nBut some overseas insurers have struggled to scale up in the face of tough competition from larger regional players, as well as regulatory restrictions on foreign ownership in large markets including China and India.\n\nThe divestment of the Aviva units, if completed, would add to strong regional insurance sector M&A momentum in the last couple of years, which has also been aided by local banks looking to exit this capital-intensive business.\n\nFWD, controlled by Richard Li, the entrepreneur and son of Hong Kong’s richest man Li Ka-shing, has spent more than $6 billion on half a dozen deals in the last six years to expand its regional footprint.\n\nSources said last week was the deadline for the first round of formal bids in a transaction Aviva aims to finalize by year-end.\n\nAviva, Allianz, Nippon Life, MS&AD and Sun Life declined to comment on the deal process. Manulife did not immediately respond to a request for comment. The names of the potential buyers and the specifics of Aviva’s planned divestment in Asia have not been previously reported.\n\nCOMPETITIVE MARKET\n\nLast month, in his first interim results since being appointed Aviva chief executive officer in March, Maurice Tulloch announced a review of the group’s Asian operations.\n\nAviva runs businesses in China, Hong Kong, India, Indonesia, Singapore and Vietnam. The Asian operations posted a 25% rise in operating profit to 284 million pounds ($352.67 million) in 2018, according to Aviva’s annual report.\n\nAviva operates wholly owned businesses in Singapore and Vietnam, with Singapore contributing nearly half of the Asian businesses’ operating profits.\n\nSingapore has a very competitive and fragmented market, with demand for life insurance mainly driven by the affluent segment. Unlike larger insurers who have distribution tie-ups with banks, Aviva mainly relies on hundreds of agents to sell its products.\n\nOne source said that since Aviva was not combining its other smaller Asian businesses in the sale process, interest in the two assets was strong and strategic buyers could end up paying more than $2.5 billion.\n\nThe latest move comes after Aviva unveiled hundreds of job cuts globally in June and overhauled its UK business.", "description": "German insurer Allianz, Nippon Life and MS&AD Insurance are vying with rivals to buy the Singapore and Vietnam businesses of Britain's Aviva in a deal likely to be worth up to $2.5 billion, sources said.", "authors": ["Sumeet Chatterjee", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190924&t=2&i=1433262837&w=1200&r=LYNXMPEF8N0DR", "published_at": "2019-09-24"}