{"pub": "foxnews", "url": "https://foxnews.com/sports/naomi-osaka-racist-comments-japanese-comedy-duo", "downloaded_at": "2019-09-25 13:44:21.116258+00:00", "title": "Naomi Osaka faces racist remarks from Japanese comedy duo who said she 'needed some bleach'", "language": "en", "text": "A Japanese comedy duo and their management company have apologized to tennis star Naomi Osaka after they made racist remarks about her during an event Sunday.\n\nThe duo, known as A Masso, said that Osaka “needed some bleach” and that she “is too sunburned,” Reuters reported, citing Japanese media. The pair made the comments on the same day Osaka, who was born in Japan to a Japanese mother and Haitian father, won the Pan Pacific Open.\n\nWIMBLEDON FINALIST'S NIECE DIES UNEXPECTEDLY DURING TRIP TO WASHINGTON, FAMILY SAYS\n\nWatanabe Entertainment Co. Ltd., the team’s management company, wrote in a statement apologizing for “remarks inconsiderate of diversity in an era where diversity is respect.\" The company did not mention Osaka by name in their apology.\n\nThe pair also apologized in a statement posted on the management company’s website but also didn’t mention one of the world’s top tennis players by name.\n\n“Though we should have thought about it, we made remarks that hurt many people, something we will never do again,” A Masso said. “We sincerely apologize for making the specific person feel uncomfortable, as well as for everyone else connected to the event. We also sincerely apologize for causing trouble.”\n\nFLASHBACK: NAOMI OSAKA'S SPONSOR APOLOGIZES AFTER CLAIMS OF 'WHITEWASHING' STAR IN ADVERTISEMENT\n\nOsaka, 22, has not commented on the issue.\n\nIt’s not the first time Osaka, who won the Australian Open in January, faced racism this year.\n\nOsaka’s sponsor, Nissin, was accused of \"white-washing\" the tennis star after an advertisement for the noodle company showed the champion with pale skin.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“There is no intention of whitewashing,” a Nissin spokesperson told the Guardian at the time. “We accept that we are not sensitive enough and will pay more attention to diversity issues in the future.”", "description": "Naomi Osaka faced racist remarks from a Japanese comedy duo during a tennis event Sunday and now the pair and their management company have issued an apology to the star.", "authors": ["Ryan Gaydos", "Ryan Gaydos Is An Editor For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/TEN-Naomi-Osaka9.jpg", "published_at": "2019-09-25"}