{"pub": "businessinsider", "url": "https://businessinsider.com/boeing-found-cracking-issue-vital-part-737-next-gen-planes-2019-9", "downloaded_at": "2019-09-29 23:40:44.199481+00:00", "title": "A vital Boeing 737 Next Gen part that attaches the plane's body to its wings is having a 'cracking issue'", "language": "en", "text": "Aircraft manufacturer Boeing has discovered a \"cracking issue\" in a vital part of its Boeing 737 Next Generation planes that connects the body of the aircraft to its wings, Charlie Harger at CNN affiliate KOMO first reported.\n\nThe aircraft piece in question, known as a \"pickle fork,\" helps connect the plane's body to its wings.\n\nPickle forks are designed to last the life of the plane, which is usually around 90,000 or more take offs and landings the publication reported. But, in one instance, Boeing found cracked pickle forks in a plane that had logged about 35,000 take offs and landings, according to KOMO.\n\nThe Federal Aviation Administration has ordered operators of 737 NG planes to inspect the aircraft for structural cracks, according to a statement shared with Business Insider.\n\nBoeing reported the issue to the FAA after it discovered the cracks while modifying a \"heavily used aircraft,\" according to the statement. The company found similar cracks in a small number of other planes, as well.\n\nBoeing said in a statement it has notified operators of the issue, and that the planes with cracks are \"undergoing modifications.\" No in-service issues have been reported, the company said.\n\nBoeing's website lists more than 100 airlines as 737 NG customers, including American Airlines, Delta Airlines, EgyptAir, RyanAir, and Southwest Airlines. The 737 NG models include 737-700, 7370-800, and 737-900 aircraft.\n\nThe 737 Max is not affected by the cracking issue, the company said.\n\nThat model was grounded in March after two fatal plane crashes.\n\nRead more: The complete history of the 737 Max, Boeing's promising yet problematic workhorse jet", "description": "The FAA ordered inspections of a Boeing 737 model after the company found a \"cracking issue\" in a crucial part that attaches the body to its wings.", "authors": ["Ashley Rodriguez"], "top_image": "https://amp.businessinsider.com/images/5d90c0a52e22af11d3097c56-2732-1366.jpg", "published_at": "2019-09-29"}