{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/12/exclusive-polish-mp-puppet-master-soros-wants-rule-world", "downloaded_at": "2019-10-13 00:23:06.862668+00:00", "title": "EXCLUSIVE – Polish MP: 'Puppet Master' Soros 'Wants to Rule the World'", "language": "en", "text": "The left-liberal establishment is attacking Poland’s conservative government ahead of national elections on Sunday because its success “damages the Soros Plan”, according to Polish lawmaker Dominik Tarczyński.\n\nIn an exclusive interview with Breitbart News, the outspoken Polish parliamentarian said it was “obvious” that the international interest in his country’s elections is a result of “globalist” distaste for its conservative-populist Law and Justice Party (PiS) government and its pro-sovereignty, anti-mass migration agenda, which Prime Minister Mateusz Morawiecki has described as “far from neoliberalism, and equally far from socialism”.\n\n“It’s the Soros Plan. He wants to be the master of puppets; he wants to rule the world. It might sound crazy, but it’s a fact, it’s true” Tarczyński insisted, referring to billionaire plutocrat George Soros, and Soros-endorsed efforts by the European Union to redistribute migrants throughout the continent via compulsory quotas — which Poland’s left-liberal opposition (Civic Platform, or PO, now Civic Coalition) signed up to in 2015 while it was still in government, only for PiS to sweep them out of office weeks later and refuse to implement them.\n\nSoros’s supporters have long claimed he is merely a wealthy philanthropist and dismissed his detractors as conspiracy theorists, but the billionaire did confess in his 1987 book The Alchemy of Finance that he “always harboured an exaggerated view of my self-importance” and “fancied myself as some kind of god” from an early age.\n\n“My sense of reality was strong enough to make me realize that these expectations were excessive and I kept them hidden as a guilty secret,” he said, revealing that this “was a source of considerable unhappiness through much of my adult life” — but, as he “made [his] way in the world” and acquired a vast fortune, “reality came close enough to my fantasy to allow me to admit my secret, at least to myself.”\n\nPolish lawmaker slams Vienna's leftist govt for politically correct rejection of statue to Polish king who saved city from Turkish siege: “If not for Sobieski, your wives and daughters would live under an Islamic caliphate. Is that what you want?” https://t.co/w7x6r0Yig0 — Breitbart London (@BreitbartLondon) September 1, 2018\n\n“The money Soros is investing — let’s use the word ‘investing’ — in Europe, in Poland, it’s so huge… they want to rule us; they want to own us, and they know that if they will be defeated in Poland, and they will be, the whole plan will be damaged,” Tarczyński said of the left-establishment more broadly.\n\n“It’s so sad, that leftists throughout the ages — not years, not decades, ages, because they were always present in some form — they were always, always, against identity, against the family, against values,” Tarczyński added, suggesting that they see people without national roots and no political aspirations beyond a desire to “eat, drink, and buy products” are easier to control.\n\nThe left-establishment’s desire for control, he suggested, stemmed from their perception of themselves as “elites; they think that they are better, more educated… it’s all about mentality.”\n\nFundamentally, the October 14th elections are about Poles asserting “our identity,” he concluded, comparing the modern left to the communists of old, who held sway in Poland under Soviet patronage for decades during the Cold War.\n\n“The communists used to fight against the family, the church, and national identity,” the MP explained.\n\n“We are now getting back our dignity as Christians, as Poles, as Europeans, and they don’t want us to take this dignity back; they don’t want us to win — but we have to fight for our Christian roots, for our Christian culture, for the principles of Roman law and Greek philosophers,” he added.\n\n“This is what they hate. They hate values, they hate virtues, and we are fighting for values and virtues. They don’t like it. They like Muslims, they like cheap labour, and [migrants] who will vote for them — but it’s not going to happen; we’re going to save Europe, and I’m serious about it.”\n\nPolish Lawmaker Backs Burqa Ban, No Saudi Mosques in Europe Until Poland Can Build Cathedral in Saudi Arabia https://t.co/7yXicZMSMg — Breitbart London (@BreitbartLondon) August 28, 2018\n\nFollow Jack Montgomery on Twitter: @JackBMontgomery", "description": "The left is attacking Poland's conservative govt ahead of national elections because it \"damages the Soros Plan\", says Dominik Tarczyński.", "authors": ["Jack Montgomery"], "top_image": "https://media.breitbart.com/media/2019/10/Soros-640x335.png", "published_at": "2019-10-12"}