{"pub": "theverge", "url": "https://theverge.com/2019/10/24/20930485/countdown-movie-review-killer-app-smartphone-urban-legend-horror-elizabeth-lail-justin-dec", "downloaded_at": "2019-10-24 23:52:21.548176+00:00", "title": "Countdown review: a funny horror film takes a shallow look at a killer app", "language": "en", "text": "It’s abundantly clear to anyone who’s ever used Twitter that our apps want to kill us. The new horror movie Countdown just wants to ask how and why.\n\nInstantly and frequently summarized as “the killer app movie,” Justin Dec’s writing and directing feature debut is that and more. In a premise with the outward appearance of J-horror classics like The Ring, yet lacking those films’ flavor, a sinister-looking program starts appearing on smartphones as unexpectedly as a new U2 album. When users open it, a ticking timer screen displays the time left until they die. It seems like a lame gag, except that when the numbers hit zero, their clocks do actually run out.\n\nBut this grabby new urban legend-style horror device still needs a story, and Dec came up with one that addresses more than the usual subtextual softball of What Technology Really Means. It’s only superficially about smartphones or apps. Dec’s script has two chief preoccupations: embracing death as a natural and inevitable counterbalance to life and the advancement of the #MeToo movement. But a lot of other stuff has been jammed into the film’s blunt, arguably ill-conceived iHorror ad campaign.\n\nThe film opens on a house party with a gaggle of teens tapping the free download button for Countdown of their own volition, and two of them command the first 10-odd minutes of screen time, but they’re just misdirection. The film centers on Quinn (an indistinct Elizabeth Lail), a nurse on the outs with her father (Matt Letscher) and younger sister (Talitha Bateman) ever since their mother’s death six months before. She’s dedicated herself to her work where the good news is that she’s passed her exam to become an official RN, and the bad news is that the alpha doctor (Peter Facinelli) around the hospital has targeted her for sexual harassment.\n\nHe corners Quinn in a comatose patient’s room and tries to force a kiss on her. After she fends him off, he weaponizes the current culture of workplace sensitivity against her. It’s a dark twist on a refrain common in today’s headlines, but until the creep’s utility to the story gets activated deep in the third act, he’s restrained to a subplot jutting out awkwardly from the rest of the film. Like any app, the jumbled script has its bugs and extraneous features.\n\nAlso generating that little inkling of “why is this in here again?” is Quinn’s romantic subplot with Matt (Jordan Calloway), a strapping stranger who, like her, has also been marked for death by the Countdown app. They join forces in investigating the power behind it, which fulfills the valuable function of giving Quinn someone to play off of, though it also sparks an attraction between them for no other visible reason than the comparable tautness of their physiques.\n\nQuinn and Matt link up outside a local phone repair shop after a scene that’s actually funny in a way that’s beyond the reach of most recent studio horror projects in this same league. The shock and appreciation viewers may feel for actual laughs in a horror film may reflect poorly on the state of the industry, but the lines written for the sardonic Phone Doc running the store have a genuine wit. The same goes for the enthusiastically nerdy priest who eventually provides an e-exorcism. Going in with low expectations helps many horror films, but one inspired Countdown gag concerning an errant GrubHub order is perfect in both conception and delivery.\n\nThe film’s above-average competence also extends to the blocking of the now you see me, now you don’t games of horror peekaboo that the demon plaguing Quinn likes to play. (Oh, right: there’s some manner of ancient hellion inside the app, something to do with courage and sacrifice and destiny. Countdown is best enjoyed by viewers who give this no more thought than the film does.) Dec has good fun plopping the camera down in a stationary position and toying with the audience’s eye line, moving it to one corner of the screen so they can’t see the nightmares coming from the other side. He knows which moves slasher aficionados have come to expect, he anticipates, and he subverts.\n\nBut everything Dec does well ends up being in service of a thoroughly banal moral about coming to terms with grief, a concluding turn that’s particularly disappointing for what it leaves on the table. Formally and thematically, there’s plenty to be done with the aesthetic layout of an OS and the psychologically warping effects of prolonged phone usage. And while Dec has a keen mind for tech-world details — he gets in a couple of wisecracks about reading Terms and Services agreements, and he knows how many gigabytes would make the file size of an app raise red flags of suspicion — they’re little more than set-dressing.\n\nThat being said, the frustration of being utterly powerless to do anything about a malfunctioning phone animates the early scenes before it emerges that the app has real supernatural malevolence. It’s more unsettling to realize that we don’t fully understand the technology we use daily and that we have minimal recourse when our electronic lifelines do annoying things seemingly of their own accord. But Dec only partially explores the ways Countdown actually resonates with real-world insecurities and fears.\n\nThe same horror devotees satisfied by the prepackaged premise and grace in execution of Happy Death Day will get everything from Countdown that’s there to be gotten. But those in search of more incisive techno-horror that cuts to the core of everything frightening about phone ownership and usage will have to continue waiting. For now, they’ll have to content themselves with that thing where a character symbolically slices their thumb on a shard of glass from their cracked screen — and Eighth Grade got there first.", "description": "Writer-director Justin Dec makes his debut with this funny but not very incisive horror film about a smartphone app that marks the days left until the user dies. It’s a weak urban legend in search of a larger point, but it has some solid laughs.", "authors": ["Charles Bramesco", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/MkSJK2kt8_5IFoj0ZIWmoooiaBI=/628x0:3518x1513/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19315906/countdown_COUNTDOWN_SG_0025R_rgb.jpg", "published_at": "2019-10-24"}