{"pub": "reuters", "url": "https://reuters.com/article/us-china-politics-plenum-analysis/amid-crises-xi-seems-set-to-uphold-partys-rule-at-secretive-china-conclave-idUSKBN1X40UI", "downloaded_at": "2019-10-25 16:57:14.312373+00:00", "title": "Amid crises, Xi seems set to uphold Party's rule at secretive China conclave", "language": "en", "text": "BEIJING/SINGAPORE (Reuters) - China’s Communist Party leaders will on Monday start their most important meeting this year, with President Xi Jinping expected to champion the Chinese model of governance while fighting protracted economic and political crises at home and abroad.\n\nMembers of the honour guard prepare for a welcoming ceremony at the Great Hall of the People in Beijing, China, October 25, 2019. REUTERS/Jason Lee\n\nThe four-day conclave comes at a critical time, as Hong Kong grapples with anti-government protests for the fourth month, drawing Western criticism of Beijing for trampling on the rights and liberties of Hong Kong people in its handling of the violent demonstrations.\n\nChina’s economy is also growing at its slowest pace in nearly three decades, hurt in part by a prolonged trade war with the United States. Stable growth has been fundamental to the Party’s political legitimacy.\n\nIt is key for Beijing to use the occasion to cast the Chinese political system as meritocratic, unchallengeable and superior to Western democracy, said Wang Jiangyu, director of the Asian Law Institute at the National University of Singapore.\n\nParty leaders have repeatedly warned that without Communist rule, China would descend into chaos and fall prey to hostile Western powers. In September, Xi said China was entering a period of “concentrated risks” - economic, political and diplomatic - and the country must be ready to fight.\n\n“China’s Party-state wants to show that its political system is more attractive overseas, and others should stop their finger-pointing,” Wang said.\n\nPlenums, as such Communist Party meetings are formally called, are generally held every autumn. The upcoming plenum will be the fourth since the last Party congress in late 2017.\n\nIt is a closed-door meeting of the party’s Central Committee, which comprises about 370 people and is the largest of its elite bodies that rule China.\n\nSome expected the fourth plenum to have been held last autumn, but it was not, sparking speculation in Beijing of disagreements at the top of the party about the direction of the country.\n\n“The fourth plenum will implement reform plans, and they will talk about how to improve governance, which is pressing,” one Chinese policy insider told Reuters on condition of anonymity, because of the sensitivity of the matter.\n\n“They need to transform the overall state governance capacity and adapt to changes in global rules and withstand stress tests from external risks,” the insider said, adding that the trade war is exacerbating such pressures.\n\nThe Communist Party spokesman’s office did not respond to a request for comment on what would be on the plenum’s agenda.\n\nIDEOLOGY\n\nPolicy insiders say the trade war, China’s slowing economy and Hong Kong will be discussed, even if there is no direct mention of them in the final closing communique, released by state news agency Xinhua once the meetings have ended.\n\nTwo Chinese officials who reviewed the draft of the communique said the document was largely political and focused on ideological innovation.\n\nStill, any ideological change may hint of new economic trajectories, because “ideology in China is never just about grand designs,” said Chucheng Feng, co-founder of GRisk, a political risk analytics firm based in Hong Kong.\n\n“It is deeply linked to reform and the economy,” Feng said.\n\nChina’s gross domestic product (GDP) grew 6% in the third quarter. But U.S. President Trump said this week growth was “probably minus-something”.\n\nChinese leaders are expected to chart the course for the economy in 2020 at a key meeting in December.\n\nSo far, China has shown no overt sign of changing or slowing its economic reforms. Notably, it has embarked on a long-term upgrade of its industries and modernisation of its technological capabilities while moving away from low-end and polluting manufacturing.\n\nBut to appease U.S. demands for greater access to Chinese markets, Beijing has pledged open its markets and roll out some relatively pain-free reforms such as new rules next year meant to make it easier for companies to do business in China.\n\nRESHUFFLES\n\nThe Party will also look ahead to the next congress in 2022 at this plenum.\n\nHow exactly Xi’s continuation of power will be handled after presidential term limits were removed last year will be the “elephant in the room” at the plenum, one senior Western diplomat said on condition of anonymity because of the sensitivity of the matter.\n\n“It’s unclear exactly what will happen in 2022,” the diplomat said.\n\nOne title Xi still does not hold is party chairman, and since the last party congress there has been speculation he could seek to resurrect the position.\n\nXi is the party’s general secretary, but not its chairman, a title Mao Zedong and his two successors, Hua Guofeng and Hu Yaobang, both held.\n\nXi also has no obvious successor.\n\nSlideshow (10 Images)\n\nBut diplomats and leadership sources says several senior leaders could be in contention, most notably three people close to Xi: Shanghai party general-secretary Li Qiang, Chongqing party boss Chen Miner, and Guangdong party boss Li Xi.\n\nThe party has also lined up younger officials, born in the 1970s, from which it can choose the country’s next generation of leaders. Party bosses could spend the next few years promoting them to key regional positions as governors, ministers, or their equivalent.\n\nSome of the notable young officials include 48-year-old Zhuge Yujie, general-secretary of the Party Committee of Shanghai; 49-year-old Shi Guanghui, who oversees political and legal affairs in Guizhou; and 46-year-old Guangxi deputy governor Yang Jinbai, according to leadership sources and experts.", "description": "China's Communist Party leaders will on Monday start their most important meeting this year, with President Xi Jinping expected to champion the Chinese model of governance while fighting protracted economic and political crises at home and abroad.", "authors": ["Ben Blanchard", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191025&t=2&i=1444832998&w=1200&r=LYNXMPEF9O0RD", "published_at": "2019-10-25"}