{"pub": "guardian", "url": "https://theguardian.com/world/2018/jul/09/tim-hortons-canada-coffee-brand-popularity-downfall", "downloaded_at": "2019-10-30 04:15:33.658240+00:00", "title": "What happened to Tim Hortons? The downfall of Canada's brand", "language": "en", "text": "The coffee shop has long been synonymous with Canada, but bad press and changing tastes have hurt it – and then there was the poop incident\n\n“It’s your first time in Canada? Oh, you have to try Timmies,” a former colleague informed me, when I landed in Toronto for a business trip several years ago. There was a Tim Hortons next to us in arrivals and before I’d even exited the airport I had a red and white cup in my hand and knew exactly what a double-double was.\n\n\n\nTim Hortons is a famously Canadian brand. It’s not just a corporation – it’s a cultural icon which elicits an extraordinary passion, entirely incommensurate with its unremarkable product. (While talking to people for this article the highest praise anyone would give Tim Hortons coffee when it came to its quality was “it’s fine”.) According to the coffee and fast-food chain, eight out of 10 cups of coffee sold across Canada are from Timmies.\n\nAmid Canada’s housing crisis, to live in a coffee shop isn't all that unusual Read more\n\nBut while the popular purveyor of caffeinated patriotism may have burrowed its way into the national psyche, there are signs that it is beginning to lose its hold on Canadian hearts; not a week seems to go by without a new negative headline about Tim Hortons. In May, for example, the company fell from 13th place to 67th place in a study tracking Canada’s most reputable companies. This was announced only a few weeks after Tim Hortons dropped from number four to 50 in an annual survey of corporate reputation by research firm Leger. “We’ve been doing this study for 20 years and they’ve been at the top 10 every year, except for once when they were number 13,” Dave Scholz, the executive vice-president of Leger, told the Guardian.\n\nSholz attributes much of this dip to a longstanding, and increasingly acrimonious, row between Tim Hortons franchisees and the relatively new parent company, Restaurant Brands International (RBI), which was formed in 2014 when Burger King merged with the coffee chain. RBI is majority-owned by the Brazilian investment company 3G Capital but the fact that Tim Hortons was no longer properly Canadian needn’t have been a problem. Indeed, Timmies was owned by the American company Wendy’s for years, before regaining independence and restructuring as a Canadian public company in 2009. What mattered is that since RBI took over, Tim Hortons has been perceived to be acting in a way that seems antithetical to Canadian values. Many store owners have been unhappy about what they see as self-serving measures by the parent company to increase its margins as the franchisees’ expense.\n\nFacebook Twitter Pinterest The Santa Claus parade in Toronto. ‘The company has cultivated Canadiana through its marketing.’ Photograph: Roberto Machado Noa/LightRocket via Getty Images\n\nAnother contributing factor, Scholz notes, is the rancor between franchisees and employees, sparked by Ontario significantly raising its minimum wage earlier this year. At first, RBI refused to let Tim Hortons franchisees pass on the costs by raising prices so some store owners cut paid breaks and benefits. These franchisees notably included Jeri-Lynn Horton-Joyce (Tim Horton’s daughter) and her husband Ron Joyce Jr (the son of Ron Joyce, co-founder of the chain); the couple made national news after axing benefits, a move they blamed on “the lack of assistance and financial help from our head office and from the government”. Employees were vocally unimpressed by this – as was the premier of Ontario, who called the benefit reductions a “clear act of bullying”.\n\nWhat makes Tim Hortons Canadian? Is it the fact that the coffee is quite bland? Chris Lloyd\n\nNot only has the very public rowing between the Tim Hortons parent company, franchisees and employees hurt the brand’s reputation, it has hurt sales. In an April earnings call, Daniel Schwartz, the CEO of RBI, told investors that Tim Hortons same-store sales (an important retail metric that tracks sales at locations that have been open for a year or more) had fallen for the eighth consecutive quarter. While this is partly due to increased competition from the likes of McDonald’s and millennials opting for more artisanal food and drink options (there’s certainly nothing artisanal about the processed cheese sandwiches at Timmies), it was also, said Schwartz, largely attributable to “negative media created by [a] group of franchisees”.\n\nAnd then there was the poop incident. Last month, a woman defecated on the floor of a Tim Hortons and threw her feces at the cashier because she was angry he had denied her access to the bathroom. The incident was all caught on camera and the video was widely circulated online. While it may have been a one-off by an inordinately upset punter, the episode seemed to encapsulate the, well, shitshow, that is the Tim Hortons brand at the moment.\n\nThe making (and unmaking) of a Canadian brand\n\nIn order to really understand the downfall of Tim Hortons, you need to look at why it became so popular in the first place. How did such a seemingly unremarkable brand ignite such national passion?\n\nFirst, says Robert Mackalski, assistant professor of marketing at McGill University, there’s its ubiquity. There are almost 4,000 Tim Hortons locations in Canada. “Whenever there’s a coffee or donut occasion,” Mackalski notes, “there’s going to be a Tim Hortons.”\n\nThen there’s the fact that Tim Hortons “has got Canada in its DNA”. It was founded in 1964 by Miles “Tim” Horton, one of Canada’s most celebrated professional ice hockey players. “Over the years,” Mackalski explains, “the company has cultivated Canadiana through its marketing. It’s involved in all the communities; it sponsors community hockey from coast to coast. When Canadians were involved in the Afghan war Tim Hortons opened up a coffee place on the military base for the soldiers overseas.” Through strategic spokespeople like Sidney Crosby and canny marketing, Timmies has turned itself into an embodiment of Canadian values. “It’s welcoming, it’s down to earth, it has no pretensions, it’s polite, it’s courteous, it’s Canada itself,” says Mackalski.\n\nFacebook Twitter Pinterest Robert Mackalski: ‘When Canadians were involved in the Afghan war, Tim Hortons opened up on the base.’ Photograph: Bloomberg/Getty\n\nNot everyone, it should be said, is thrilled with the way in which Tim Hortons has become synonymous with Canadian values. Chris Lloyd, an artist who lives in Montreal, and frequently critiques the company through his art, says he believes the brand “perpetuates a homogenized view” of a boring Canadian identity. “In an era where people are questioning what it means to have a national identity, what makes Tim Hortons Canadian?” Lloyd asks. “Is it the fact that the coffee is quite bland?” Lloyd used to hang out at Timmies as a teenager and once even worked at one, but believes the blandness of the brand reflects badly on what it means to be Canadian.\n\nDespite the fact he may not have a taste for Timmies himself, Lloyd notes that one of the coffee chain’s strengths is that “you see all sorts of people of all walks of life gravitate to it. It serves as a community center almost.” It’s the antithesis to fancy latte culture, a place where anyone can feel comfortable. Indeed, earlier this year a homeless man called Ted tragically died in a 24-hour Vancouver branch of Tim Hortons. He would come to the coffee shop every day for 10 years. It was a place where he blended in with the working-class clientele and felt at home.\n\nMake Tim Hortons great again\n\nDespite its current woes, Tim Hortons has built up an incredible store of equity and, even with its current woes, it’s still a fixture in many Canadians’ routines. “I pass by three Tim Hortons on my way to work, every morning and there’s always a line out of the door,” notes Arnaud Doyon, a 28-year-old event producer from Montreal. “Even though there’s a fancy espresso machine in our office, people still go to Hortons and buy the crappy coffee there. It’s like a ritual.”\n\nInside Tuscan: the other no-fly list Canada didn't tell you about Read more\n\nSo, while Tim Hortons may be facing troubling times, all is not lost; the brand still has a chance to bounce back. “I think they can still be an iconic Canadian company,” Scholz says by phone. “It’s such a big part of our culture. People go to the beach with a cup of Tim Hortons coffee. They’re everywhere. We have about four in the small town where I live. Actually, I’m drinking a Tim Hortons coffee right now.”\n\nHowever, for Tim Hortons to regain its place in the Canadian psyche, it’s going to need to focus a lot more on its home market, says Mackalski. “The ownership want to expand the brand internationally, but you’ve always got to tend to the home base and make sure they’re looked after. Given the recent scandals, maybe it’s time to put a lot more attention on to the home front.”\n\nMackalski also believes that Tim Hortons may have an unlikely savior in the US president, Donald Trump. “The recent banter between Trump and Trudeau is sparking a little bit of nationalism, so I think that could play quite well for Tim Hortons. Canadians are an interesting group, they don’t go out there and loudly do a pledge of allegiance to Canada, but they do like to feel a part of the Canadian fabric. And a cup of Tim Hortons has always been there for that.” Who knows, maybe Trump will succeed in making Tim Hortons great again.", "description": "The coffee shop has long been synonymous with Canada, but bad press and changing tastes have hurt it – and then there was the poop incident", "authors": ["Arwa Mahdawi"], "top_image": "https://i.guim.co.uk/img/media/90eabb194140916bf857b3cccf808f6dd693706a/3_4_994_596/master/994.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=04de28780a80eee0cdde401fbabddebb", "published_at": "2018-07-09"}