{"pub": "businessinsider", "url": "https://businessinsider.com/how-to-appear-offline-on-ps4", "downloaded_at": "2019-09-25 23:30:03.672653+00:00", "title": "How to appear offline on a PS4 in 2 different ways", "language": "en", "text": "You can appear offline on a PS4 even when you're actively using the gaming system.\n\nIt's possible to appear offline on a PS4 before you log in, as long as you choose that setting when you log in.\n\nYou can also choose to appear offline on a PS4 at any time while online, simply by changing your status to offline in the profile menu.\n\nVisit Business Insider's homepage for more stories.\n\nLike any social media or chat service, your PS4 can set your status so friends and other players know when you're online and ready to play.\n\nIf there are times you'd prefer to play in solitude and not get pestered by other people, though, you can change your status so you appear offline.\n\nWhen you set your status to offline, it will remain that way until you turn it off and manually set your status to online. The offline status will persist even if you power down the PS4 and later turn it back on again.\n\nAlso, be aware that if you and your friends are playing the same online game, you might appear online to them within that game, even if your status is set to offline.\n\nCheck out the products mentioned in this article:\n\nHow to appear offline on a PS4 when you first log in\n\nYou can sign into your PS4 already with an \"offline\" status, so no one will know you're playing.\n\n1. On the login page, hover over your avatar but don't press the Select button on the controller.\n\n2. Press the Options button on the controller.\n\nUse the Options button on the controller to choose your online status when you first log into your PS4. Dave Johnson/Business Insider\n\n3. Choose \"Log in With Online Status [Appear Offline].\"\n\nHow to change your status to offline on a PS4\n\n1. Select \"Profile,\" which has a picture of your account avatar.\n\nTo change your online status after you've been using your PS4, start by opening your Profile. Dave Johnson/Business Insider\n\n2. Select \"Set Online Status\"\n\n3. In the dropdown menu, choose \"Appear Offline.\"\n\nChoose \"Appear Offline\" from the online status dropdown menu. Dave Johnson/Business Insider\n\nRelated coverage from How To Do Everything: Tech:", "description": "You can choose to appear offline on a PS4 when you first log in, or at any time when you're online. Here's how to do it.", "authors": ["Dave Johnson"], "top_image": "https://image.businessinsider.com/5d8bafd72e22af3d192f6553?width=1200&format=jpeg", "published_at": "2019-09-25"}