{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/antifa-america-canceled-rally-trump-minneapolis-", "downloaded_at": "2019-10-04 16:59:28.860444+00:00", "title": "Antifa targeting Trump Minneapolis rally with 'America is Canceled' protest", "language": "en", "text": "Antifa activists Thursday announced a massive anti-Trump protest entitled “America is Canceled” at the president’s scheduled speech next week in Minneapolis.\n\n“Trump is having a campaign rally in downtown Minneapolis. He wants to keep America great, but … AMERICA IS CANCELED,” said the notice posted on It’s Going Down, an online anti-fascist forum. “Join us to celebrate with an anti-capitalist bloc.”\n\nThe notice asked activists to “bring your friends, bring your crew and come prepared to disrupt the nightmare that is Trump,” while the site predicted “thousands” would show up “in opposition to Trump and his world.”\n\nThousands are expected to converge next week in opposition to Trump and his world as he descends on #Minneapolis on Thursday, October 10th. People are calling for an ‘Anti-Capitalist Bloc.’ #DefendMN https://t.co/IXVf0PQZcW pic.twitter.com/PPMKUuHwig — It’s Going Down (@IGD_News) October 3, 2019\n\nCall for an anti-capitalist bloc at upcoming Anti-Trump protest in Minneapolis, Minnesota Thursday, October 10th. https://t.co/QvV0MuIb4P — Always Antifascist (@RoseCityAntifa) October 3, 2019\n\nMr. Trump’s planned Oct. 10 rally at the Target Center, home of the NBA’s Minnesota Timberwolves, has already drawn negative reviews from liberal Minneapolis leaders.\n\nMayor Jacob Frey said the Republican president’s “actions have been reprehensible” and “his rhetoric has made it clear that he does not value the perspectives or rights of Minneapolis‘ diverse communities.”\n\n“While there is no legal mechanism to prevent the president from visiting, his message of hatred will never be welcome in Minneapolis,” said Mr. Frey in a statement.\n\nCity council president Lisa Bender said the event would cause “stress and fear,” adding that the president’s “hate is not welcome in our community but we cannot stop the visit.”\n\nMr. Trump has visited Minnesota four times in the last 16 months, most recently an April trip to Burnsville, as his campaign seeks to flip the traditionally blue state in 2020.\n\nMeanwhile, Republican Party of Minnesota chairwoman Jennifer Carnahan said she was “overjoyed” to welcome Mr. Trump back to Minneapolis.\n\n2020 is our year to turn MN red for President @realDonaldTrump. Join us on October 10th for a rally at the Target Center at 7pm! Register here: https://t.co/3dA2b5QKDU #KAG #mngop — MNGOP (@mngop) September 28, 2019\n\n“He has fulfilled his campaign promises to get our economy booming again, put America first, and has made this country great again,” Ms. Carnahan said in a statement. “We are excited for the rally on October 10th and look forward to showing the Democrats how enthusiastic Minnesota Republicans are to send our 10 electoral votes to re-elect President Trump in 2020.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Antifa activists Thursday announced a massive anti-Trump protest entitled \"America is Canceled\" at the president's scheduled speech next week in Minneapolis.", "authors": ["The Washington Times Http", "Valerie Richardson"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/06/30/AP_19180736970868_c0-50-2592-1561_s1770x1032.jpg?f5f12043d285d8586a8cb3c65d438d6daab27c86", "published_at": "2019-10-04"}