{"pub": "wsj", "url": "https://wsj.com/articles/are-online-wine-courses-worth-your-time-11568321079?mod=rsswn", "downloaded_at": "2019-09-12 23:53:33.750941+00:00", "title": "Are Online Wine Courses Worth Your Time?", "language": "en", "text": "LEARNING about wine online seems easy enough—not to mention affordable. Yet after exploring all manner of internet wine education, I’m not ready to declare it the ideal forum—at least not yet.\n\nMany self-styled “wine educators” online claim to be certified sommeliers, but that doesn’t mean they have worked in a restaurant. Others are winemakers, adjunct professors or simply oenophiles with a pedagogical bent. Whether via video or podcast, the education they offer tends to fall into two categories: basic (grape names, how to hold a glass) or wonky (the role of tannins, grapevine blights).\n\nThe educational content actual wine professionals produce mostly falls into the latter camp, and podcasts appear to be the preferred format. The decidedly wonky “Guild of Sommeliers Podcast”(guildpodcast.com) features sommeliers such as Geoff Kruth and Kelli White interviewing top talent. In an episode last fall, Mr. Kruth and Virginia Wilcox, winemaker at Vasse Felix in Western Australia, discussed tannins in a surprisingly lively chat. “I think you can make or break a wine by getting the tannins wrong,” Ms. Wilcox said. She enumerated various categories of tannin, including “astringent,” “squeaky,” “toothy,” “tongue” and “green”—the ones that “push to the back of your throat.” I learned a lot and plan to invoke the term “squeaky tannins” very soon.\n\nShare Your Thoughts Would you do an online wine course? Why or why not?\n\nAnother sommelier turned podcast host, Levi Dalton, records conversations with wine professionals in his professedly “tiny living room” in New York. His show, “I’ll Drink to That!”(illdrinktothatpod.com), features conversations on topics nonprofessionals might find abstruse. A conversation between Mr. Dalton and Benjamin Leroux, a young Burgundy vigneron, was a far-ranging, rather baggy discourse on topics including root stock and pruning.\n\nThe audience for these wonky podcasts is clearly presumed to be more knowledgeable than the one targeted by Philadelphia-based sommelier Marnie Old with her video series “Wine Simplified” on YouTube. Her style is crisp and engaging, and though her videos were produced several years ago, the topics, such as “How to Taste Wine Like a Pro,” are evergreen.\n\nI liked the videos of a few other sommeliers, including Steven Grubbs, whose smart, breezy series, “Wine’s Cool” was created to educate the staff of Empire State South and Five & Ten restaurants, in Atlanta and Athens, Ga. “We decided to make a series of short, unintimidating videos that would (hopefully) take people quickly from square zero to having a little working background,” he wrote in an email. After Mr. Grubbs uploaded them to YouTube, Mr. Grubbs discovered that other restaurateurs were using them. “If anyone else learned from them, great,” he said.\n\nWhile the above offerings are available for free, some online courses can be rather pricey. For instance, Napa Valley Wine Academy conducts courses that cost hundreds of dollars, including a “Napa Valley Wine Expert” certification for $395. Since that was more than my last round-trip ticket from New York to San Francisco, I enrolled instead in “Get Wine-Smart” (udemy.com), taught by John Boyer, a geography professor at Virginia Tech. The course, from online-learning platform Udemy, cost me a mere $12.\n\nMr. Boyer’s energy is equaled only by his flamboyant, invariably plaid wardrobe, and his pedagogical style is informational with an emphasis on fun. His videos cover all the basics—from grape varieties to buying, storing and serving wine—as Mr. Boyer tastes and riffs along with sidekick Randall Horst of Vintage Cellar wine shop in Blacksburg, Va., where some of the series is filmed.\n\nLess fun but more famous, wine critic James Suckling has joined top chefs ( Gordon Ramsay ) and movie directors ( Martin Scorsese ) at MasterClass, among the most hyped online courses. “James Suckling Teaches Wine Appreciation”(masterclass.com) cost me $90 ($180 buys an all-class yearlong pass).\n\n“This class is going to be like staying with me for the week,” Mr. Suckling promised early on in the series of videos, and he was right—the day I devoted to his 11-lesson course felt like a week. The series alternated between picturesque scenery and shots of Mr. Suckling tasting wine after wine, rating his satisfaction numerically.\n\nAn Italian Sauvignon Blanc was “super steely, fresh, layered” according to Mr. Suckling. “I’m 94 on that,” he pronounced—meaning he awarded the wine a 94-point score. In Lesson Four, he tasted the Super Tuscan Tignanello with Albiera Antinori, president of the wine company Marchesi Antinori. When they got to the 2015, he let her know he’d rated the wine 98 points. “It hasn’t been published yet so keep it to yourself,” he admonished.\n\nMy online education yielded plenty of information, some of it useful, some not so much. I remain in search of the ideal combination of content and delivery. And I won’t be adopting the phrase “I’m 94 on that” anytime soon.\n\nEmail Lettie: wine@wsj.com", "description": "Our wine columnist found copious information just a click away—but the pedagogy wasn’t always A+.", "authors": ["Lettie Teague", "Lettie.Teague Wsj.Com"], "top_image": "https://si.wsj.net/public/resources/images/B3-EX659_WINE09_SOC_20190909125030.jpg", "published_at": "2019-09-12"}