{"pub": "cbc", "url": "https://cbc.ca/news/health/unnecessary-vitaminb12-shots-1.5291960", "downloaded_at": "2019-09-24 13:33:29.428141+00:00", "title": "Unnecessary vitamin B12 shots costing Ontario millions, study finds | CBC News", "language": "en", "text": "Almost two-thirds of Ontario seniors who received vitamin B12 shots had no evidence of a B12 deficiency, according to a study published in the medical journal JAMA Internal Medicine .\n\nThe study used databases at the Toronto-based Institute for Clinical Evaluative Sciences to review the patient records of 146,850 residents of the province aged 65 or over who were prescribed regular vitamin B12 shot between January 2011 and October 2015.\n\nOf those, 93,615 (64 per cent) either had tests confirm they already had normal B12 levels, or they weren't tested at all.\n\n\"We know that's a lot of inappropriate care that happens in Canada,\" said study co-author Dr. William Silverstein of the University of Toronto. \"But we were quite surprised that it was the number was as high as it was.\"\n\nSilverstein and his colleagues calculated the inappropriately prescribed shots needlessly cost the province's health-care system $45.6 million annually.\n\nTablets just as effective\n\nOver-the-counter B12 tablets are a fraction of the cost of shots, and have been shown in a British-Canadian study to work just as well for most people, although some people with digestive conditions may have difficulty absorbing the vitamin in tablet form.\n\nB12 is found in animal-based sources such as meat, fish, poultry, eggs, and dairy products.\n\nPeople who don't get enough of the essential vitamin can experience nausea, fatigue, dizziness or depression among other symptoms. Long-term deficiency can lead to cognitive problems.\n\nResearch suggests about 20 per cent of elderly people are B12 deficient. Although a Statistics Canada population survey published in 2013 found, on average, seniors had only slightly lower levels of B12 than younger adults.\n\nVegans and \"patients with diseases like Crohn's and colitis as well as people with pernicious anemia are also particularly vulnerable to deficiency,\" added Silverstein.\n\nThe Toronto specialist said that the price tag for a monthly shot is $44.33 — $33.70 paid to the doctor per visit, $6.74 for administering the shot and $3.89 for the vial of B12.\n\nOrally administered supplements from a big box store cost as little as $30 for a full year's supply of tablets.\n\nAnimal-based proteins are adequate sources of vitamin B12 for most people. Some seniors lose their ability to absorb the nutrient as they age and require B12 supplements. (Shutterstock)\n\nSilverstein said he decided to investigate the over-prescribing of B12 shots, because \"as an internal medicine resident, I have seen many patients come into the emergency department, and they were getting B12 injections without having a really good reason for it.\"\n\nHis study could not determine why family physicians were prescribing it inappropriately — including whether it was initiated by the doctor or at the request of the patient. Silverstein also said he didn't know if over-prescription was a problem in other provinces.\n\nB12's star power\n\nB12 shots have gained popularity after being used by celebrities, such as Rihanna and Katy Perry, because they're promoted as a means to boost energy levels. Injections or vitamin drips are also offered by naturopathic doctors and spas promising instant results.\n\nBut Dr. Samir Sinha, who was not involved in the research, said B12 shots can't provide \"a big boost.\"\n\n\"Getting B12 shouldn't instantly make you feel great or more powerful,\" he said. \"People who really believe that … that's the power of placebo.\"\n\nB12 💉 has me like 😜 —@katyperry\n\nAs a gerontologist at Mount Sinai Hospital in Toronto, Sinha said he commonly tests for B12 levels in patients \"when we're assessing a person for dementia or a person with balance issues.\"\n\nOtherwise he said it's ineffective to take B12 supplements to prevent deficiency — and there are even potential risks of over-doing it.\n\nOnly a handful of people\n\nSinha pointed to a recent study published in the online journal of JAMA which found an association between high intakes of vitamins B6 and B12 and hip fractures in older women.\n\nSinha said he only prescribes shots to patients for whom tablets can't be absorbed properly during digestion. \"I'd say maybe only a handful of people at most in the last 10 years have I ever actually thought would benefit from B12 injections.\"\n\nAs to why some physicians would be needlessly prescribing B12 shots, he said, \"It may be just habit. But clearly I think what the study showed was that this is a practice that's probably happening more often in Ontario than it should be happening.\"\n\nDr. William Silverstein, a recent graduate of medical school, remembered that little time was spent on the appropriate treatment of B12 deficiency, \"I recall there was one slide in my class that said you treat B12 deficiency with a pill or an injection. And that was it.\"", "description": "A review of patient records published in the journal JAMA Internal Medicine has found 64 per cent of Ontario seniors who received vitamin B12 shots had no evidence of B12 deficiency. The unnecessary shots cost the provincial health-care system $45.6 million a year.", "authors": ["Vik Adhopia Is A Senior Reporter With The Health Unit At Cbc News. He Joined Cbc National Radio News In Toronto In", "Then Began His Coast-To-Coast-To-Coast Journalistic Odyssey", "Reporting Iqaluit", "Prince George", "B.C.", "Vancouver", "St. John'S", "N.L.", "Finally Back To Toronto Again."], "top_image": "https://i.cbc.ca/1.5291961.1569009821!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/unnecessary-vitamin-b12-shots-costing-ontario-millions-image-1.jpg", "published_at": "2019-09-24"}