{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/paypal-may-ditch-facebooks-libra-over-regulatory-scrutiny-report", "downloaded_at": "2019-10-05 13:07:55.086184+00:00", "title": "Update: PayPal Officially Pulls Out of Libra Association", "language": "en", "text": "Disclaimer: This article previously stated that PayPal was possibly withdrawing from the Libra Association. It has since been updated to reflect its official withdrawal.\n\nPayment processor PayPal has officially left the Libra Association, the governing body of Facebook’s Libra digital currency.\n\nLibra “Pre-work” is not enough for PayPal\n\nAs news agency Financial Times reported on Oct. 3, PayPal did not attend a meeting of 28 Libra backers on Thursday.\n\nFollowing the payment provider’s no-show, a spokesperson for the firm told Cointelegraph on Oct. 4 that it officially left the association, adding:\n\n“We remain supportive of Libra’s aspirations and look forward to continued dialogue on ways to work together in the future. Facebook has been a longstanding and valued strategic partner to PayPal, and we will continue to partner with and support Facebook in various capacities.”\n\nThe developments come on the back of existing rumors that up to three more of those backers are also considering quitting their roles as future node operators. The Times quoted a person close to PayPal as saying:\n\n“It doesn’t seem that there was a lot of pre-work done with regulators. [Payments] companies don’t want that [regulatory scrutiny] to bleed into their businesses.”\n\nOther key players reportedly wavering\n\nAs Cointelegraph reported on Oct. 2, the impetus behind similar worries for Visa, Mastercard and Stripe was ensuring Libra did not harm their relationships with regulators.\n\nLibra has created controversy with lawmakers worldwide since its inception, with a common narrative revolving around the digital currency taking power over money away from governments.\n\nStripe subsequently denied it was considering a U-turn. Also this week, Libra developers outlined a roadmap for progress, revealing nodes were already testing communication with one another.", "description": "PayPal has officially forgone participation in the Libra Association, the governing body of Facebook’s Libra digital currency", "authors": ["William Suberg"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvYjU3ZGQzMDYwMWU1NTJlMTM2ZmQxYzQ3Y2U1OTczOGIuanBn.jpg", "published_at": "2019-10-04"}