{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/democratic-presidential-hopefuls-tackle-lgbt-issues-191010163611471.html", "downloaded_at": "2019-10-11 00:23:14.412308+00:00", "title": "Nine US Democratic presidential hopefuls to tackle LGBT issues", "language": "en", "text": "Nine US Democratic presidential candidates on Thursday are scheduled to appear at a televised town hall focused on lesbian, gay, bisexual and transgender rights. Top contender Bernie Sanders will miss the event as he recovers from a heart attack.\n\nThe event in Los Angeles, California, is the second major presidential forum dedicated to LGBT issues during the Democratic nominating campaign, following an event in Iowa last month that drew 10 of the 19 candidates vying to take on US President Donald Trump.\n\nGay rights advocates have expressed dismay at the Trump administration's record on LGBT issues, including a ban on transgender individuals from serving in the US military.\n\nThis week, lawyers for the Department of Justice argued at the US Supreme Court that federal civil rights law does not prohibit employers from firing workers based on their transgender identity or sexual orientation.\n\nThe forum will include South Bend, Indiana, Mayor Pete Buttigieg, who would be the first openly gay US president if elected. Former Vice President Joe Biden, US Senators Elizabeth Warren, Kamala Harris, Cory Booker and Amy Klobuchar, former US Representative Beto O'Rourke, former US Secretary of Housing and Urban Development Julian Castro, and businessman Tom Steyer are also scheduled to appear.\n\nPlans for LGBT rights\n\nBefore the forum, Warren, Buttigieg and Harris released plans to secure equality for LGBT people.\n\n171201235537295\n\nLike most other Democrats, all three candidates support the Equality Act, which would explicitly add LGBT protections to federal anti-discrimination law.\n\nThey also promised to make pre-exposure prophylaxis, a drug that helps lower the risk of contracting human immunodeficiency virus, accessible and affordable to all who want it.\n\nButtigieg said he would eliminate the HIV/AIDS epidemic by 2030, in part by restoring the White House Office of National AIDS Policy that has gone dormant under Trump.\n\nAll three candidates promised to elevate LGBTQ concerns as president. Warren said she would appoint a special envoy at the State Department, while Harris said she would create a new White House position, Chief Advocate for LGBT Affairs, to coordinate efforts across the entire federal government.\n\n\"Twenty years ago, an awkward teenager at St Joe High School in South Bend, Indiana, who didn't know a single out LGBTQ student there, never would have imagined how far we would come as a country,\" wrote Buttigieg, who has spoken frankly in public about his struggle to come out. \"But what does our country look like to a teenager in 2019, just starting to realise who they are?\"\n\n191008142221645\n\nThursday's forum represents a fresh opportunity on the issue for Biden, who has seen his lead in polls wiped out by Warren's recent surge.\n\nBiden found himself defending his LGBT record at last month's event in Iowa, including his 1993 vote for the \"don't ask, don't tell\" policy that barred openly gay individuals from the military. He later backed the repeal of that policy, and while he voted for a law defining marriage as between a man and a woman, he backed same-sex marriage before former President Barack Obama, under whom he served as vice president.", "description": "Rights advocates have expressed dismay at the Trump administration's record on LGBT issues.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/10/01edc6f458144fd68dfcab3b11652984_18.jpg", "published_at": "2019-10-10"}