{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/10/rape-accusations-against-lauer-ensnares-nbc-manage", "downloaded_at": "2019-10-10 06:16:33.008992+00:00", "title": "Rape accusations against Lauer ensnares NBC management", "language": "en", "text": "NEW YORK (AP) - Two years after Matt Lauer was abruptly fired by NBC News for sexual misconduct, more questions are emerging about the former “Today” show host’s behavior and whether bosses looked the other way at problems involving one of the network’s biggest stars.\n\nA new book by Ronan Farrow, a former NBC News employee who now works at The New Yorker, names the accuser whose story that Lauer raped her in a Sochi hotel room led to his dismissal.\n\nLauer denied the charges in an angry and defiant letter released by his lawyer Wednesday and said that his public silence since his firing had been a mistake.\n\nFarrow’s book said Brooke Nevils, a former NBC News employee who worked with Meredith Vieira at the Sochi Olympics in 2014, met her boss for drinks one night and Lauer joined them. Nevils said she had six shots of vodka and wound up going to Lauer’s room.\n\nShe said that Lauer pushed her onto a bed and asked if she liked anal sex. Nevils said she declined several times, but then Lauer “just did it.” She described the encounter as “excruciatingly painful.”\n\n“It was nonconsensual in the sense that I was too drunk to consent,” Nevils told Farrow. “It was nonconsensual in that I said, multiple times, that I didn’t want to have anal sex.”\n\nIn his letter, Lauer admitted to his extramarital affair with Nevils. He said on that night in Sochi that they consensually performed a variety of sexual acts.\n\n“She was a fully enthusiastic and willing partner,” he wrote. “At no time did she behave in a way that made it appear she was incapable of consent. She seemed to know exactly what she wanted to do.”\n\nHe claimed they had an affair that lasted after they returned to the United States. Nevils described the sex as “transactional” and that she feared the effect Lauer could have on her career. In one case, she told Farrow that she had asked Lauer for help recording a goodbye video for a friend leaving NBC. He told her he’d do it in his office, and then demanded oral sex, Farrow wrote in the book, “Catch and Kill.”\n\nNevils said she felt she had to do something to protect other women at NBC News, leading to her filing the complaint against Lauer in November 2017.\n\n“Matt Lauer’s conduct was appalling, horrific and reprehensible, as we said at the time,” NBC News said in a statement Wednesday. “That’s why he was fired within 24 hours of us first learning of the complaint. Our hearts break again for our colleague.”\n\nNBC said then that Lauer had been fired for “inappropriate sexual conduct.” The specific rape allegation did not become public until Variety reported Wednesday that Nevils spoke to Farrow.\n\nNevils grew disenchanted with NBC, feeling bosses there weren’t doing enough to protect her anonymity internally and mischaracterizing the relationship with Lauer as an affair. After some rough times - she said she was hospitalized for post-traumatic stress and alcohol abuse - she left NBC with a seven-figure settlement.\n\nNBC Chairman Andrew Lack, in a memo sent to network staff on Wednesday, said the network hadn’t known of Lauer’s behavior with Nevils until the day before he was fired. An internal investigation uncovered no claims or settlements associated with allegations of inappropriate conduct by Lauer before he was fired, Lack said.\n\nBut Farrow indicated that Lauer’s behavior was an open secret at NBC. He quoted Lauer’s former co-anchor Ann Curry - who left “Today” on bad terms with Lauer - saying she had told NBC executives that Lauer “had a problem with women” and they had to keep an eye on him.\n\nFarrow said he’d learned of seven claims of sexual misconduct raised by women who worked with Lauer. “Several said they had told colleagues, and believed the network knew about the problem,” he wrote.\n\nHe quoted a former production assistant, Addie Collins, who told him Lauer aggressively pursued her in 2000 and “ordered” her to perform sexual favors. “She’d consented, but it had made her feel sick, afraid for her job, afraid of retaliation,” Farrow wrote.\n\nLauer said that he had never assaulted anyone or forced anyone to have sex.\n\nIn his letter, he said he ended his relationship with Nevils “poorly,” but that “being upset or having second thoughts does not give anyone the right to make false accusations years later.”\n\nHer lawyer did not return a message for comment Wednesday on Lauer’s letter.\n\nLauer acknowledged other extramarital encounters, and criticized the women involved for having “abandoned shared responsibility” for the affairs to shield themselves from blame behind false allegations.\n\n“They have avoided having to look at a boyfriend, a husband or a child in the eye and say, ‘I cheated,’” Lauer said. “And I will no longer provide them the shelter of my silence.”\n\nThat statement is chilling and could be read as a threat by women who feel they are victims of Lauer’s misconduct, said Linda Vester, a former NBC News employee who formed Silence Breakers Alliance, which tries to direct foundation spending for programs that combat sex abuse.\n\nLauer’s letter was called “unbelievable” by Eleanor McManus, who co-founded the group Press Forward to support victims of sexual misconduct in the new industry. McManus said she was harassed by journalist Mark Halperin, who lost jobs at NBC News and elsewhere because misconduct allegations.\n\n“Lauer’s statement demonstrates not only his lack of remorse, but his lack of understanding of sexual harassment and the #MeToo movement,” McManus said. “Nowhere in his letter does Lauer acknowledge the power he yielded as a celebrity and the star of NBC’s highest-rated show. The two people in the hotel room in Sochi did not have equal power.”\n\nNevils‘ story was reported Wednesday on the show Lauer hosted for two decades. His former co-host, Savannah Guthrie, called it shocking and appalling.\n\n“We’re disturbed to our core,” Guthrie said.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Two years after Matt Lauer was abruptly fired by NBC News for sexual misconduct, more questions are emerging about the former \"Today\" show host's behavior and whether bosses looked the other way at problems involving one of the network's biggest stars.", "authors": ["The Washington Times Http", "David Bauder"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/10/sexual_misconduct_lauer_87008_c0-152-2584-1658_s1770x1032.jpg?284d4cfed3784c36981d4a804a5c1c55667696ec", "published_at": "2019-10-10"}