{"pub": "fox", "url": "https://foxnews.com/media/kamala-harris-elizabeth-warren-trump-twitter", "downloaded_at": "2019-10-16 03:57:00.381819+00:00", "title": "Kamala Harris takes on Elizabeth Warren for not wanting Twitter to delete Trump's account", "language": "en", "text": "Sen. Kamala Harris, D-Calif., urged Sen. Elizabeth Warren, D-Mass., to reconsider her opinion that Twitter shouldn't ban the president from its platform.\n\nHarris previously sent a letter to Twitter CEO Jack Dorsey in which she listed a series of problems she had with the president's Twitter activity. When asked about the idea, Warren laughed it off and flatly rejected it at the beginning of October.\n\nHarris apparently saw that and referenced her answer during Tuesday's Democratic debate. \"I would urge you to join me,\" she said before claiming that Trump used Twitter to \"obstruct justice.\"\n\nHarris also pointed to August's mass shooting in El Paso, Texas, claiming the perpetrator was \"informed\" by how Trump used the platform.\n\nWARREN LAUGHS OFF SUGGESTION THAT TWITTER BAN AFTER TRUMP AFTER HARRIS' CALL FOR SUSPENSION\n\n\"This is a matter of corporate responsibility. Twitter should be held accountable and shut down that site,\" she said. \"It is a matter of safety.\"\n\nWarren seemed to agree Trump should leave Twitter but didn't explicitly endorse his suspension. \"So look, I don't just want to push Donald Trump off Twitter, I want to push him out of the White House. That's our job,\" she said.\n\nWhen Harris pressed Warren on joining her call to suspend Trump, Warren shook her head and said \"no.\" Harris, apparently surprised, smiled and said \"wow.\"\n\nHarris ignited a Twitter controversy in October after she alerted Dorsey to one of Trump's tweets. At that point, she had already sent her letter in which she told the company: \"I believe the president's recent tweets rise to the level that Twitter should consider suspending his account. When this kind of abuse is being spewed from the most powerful office in the United States, the stakes are too high to do nothing.\"\n\nKAMALA HARRIS DOUBLES DOWN ON SUSPENDING TRUMP ON TWITTER, URGES CEO 'DO SOMETHING'\n\nShe specifically pointed to tweets in which the president attacked House Intelligence Committee Chairman Adam Schiff, D-Calif., and suggested there would be \"big consequences\" for the whistleblower who reported on his call with Ukraine.\n\nIn a blog post from 2018, Twitter seemed to respond to other requests that it punish Trump for his tweets.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Twitter is here to serve and help advance the global, public conversation. Elected world leaders play a critical role in that conversation because of their outsized impact on our society,\" the post read.\n\n\"Blocking a world leader from Twitter or removing their controversial tweets would hide important information people should be able to see and debate. It would also not silence that leader, but it would certainly hamper necessary discussion around their words and actions.\"", "description": "Sen. Kamala Harris, D-Calif., urged Sen. Elizabeth Warren, D-Mass., to reconsider her opinion that Twitter shouldn't ban the president from its platform.", "authors": ["Sam Dorman", "Sam Dorman Is A Reporter With Fox News. You Can Follow Him On Facebook"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Warren-Trump-Harris_AP.jpg", "published_at": "2019-10-16"}