{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7611057/Judge-rules-James-Youngers-dad-say-transition.html", "downloaded_at": "2019-10-25 00:11:19.175355+00:00", "title": "Judge rules James Younger's dad can have say in transition", "language": "en", "text": "A judge has ruled that a father fighting to stop his seven-year-old son from transitioning to a girl will be allowed to have a say in future medical decisions related to his child.\n\nJeff Younger has been battling his ex-wife Dr Anne Georgulas in a Dallas family court as part of their bitter custody fight over whether their child James has gender dysphoria.\n\nJudge Kim Cooks ruled on Thursday that the divorced parents will have joint conservatorship over their child.\n\nIt means they will have to make joint medical decisions regarding their child, which includes whether James should undergo hormone replacement therapy to transition to a girl.\n\nThey will also have to jointly agree on haircuts for the child, as well as dental and psychiatric care.\n\nThe decision comes after a jury ruled earlier this week in favor of giving sole managing guardianship of James and twin brother Jude to their mother.\n\nJeff Younger has been battling his ex-wife Dr Anne Georgulas in a Dallas family court as part of their bitter custody fight over whether their child James has gender dysphoria\n\nJeff Younger is pictured outside court on Thursday after a judge ruled he will be allowed to have a say in future medical decisions related to his child\n\nGeorgulas, who is a pediatrician, has argued that James is transgender and wants the child to transition to a girl named Luna.\n\nHer ex-husband, however, doesn't believe James has gender dysphoria and that his child is just experiencing some confusion with gender.\n\nHe has accused Georgulas of forcing James to socially transition into a girl by making the child wear dresses.\n\nJust moments before the judge's decision was handed down, Younger told DailyMail.com outside court that he didn't expect the proceedings to go in his favor.\n\n'I'm not anticipating a good result for my son,' he said. 'I think I'm not going to be able to stop the social transition of my son, which will probably lead to his medical transition.'\n\nThe judge put a gag order on both parents during the proceedings, which means neither can speak to media going forward.\n\nAs part of the judge's ruling both Younger and Georgulas will have to attend counseling.\n\nThe bitter court battle began when Georgulas filed a court request last year to change their joint custody arrangement to include a requirement that Younger start calling their child by the name Luna.\n\nShe said three mental health professionals had diagnosed James with gender dysphoria and that therapists had recommended they start using the name Luna instead of James.\n\nYounger, however, filed his own request with the court to obtain sole custody of the twins to prevent the gender transition.\n\nJeff Younger doesn't believe James has gender dysphoria and has accused his ex-wife of forcing their child to socially transition into a girl by making James wear dresses\n\nAnne Georgulas, who is a pediatrician, has argued that James is transgender and should be able to wear dresses and attend school as a girl named Luna\n\nGeorgulas and Younger married back in 2010 when they were members of the Orthodox Church.\n\nThey went through IVF to have the twins and requested their gender be male before they were born in 2012.\n\nThe couple annulled their marriage several years later.\n\nArguments over their child's gender began when Georgulas took James to see a gender therapist at the Children's Hospital Center.\n\nShe claims she had noticed James requesting girl-themed toys, that the child was imitating female Disney characters and had been asking to wear dresses.\n\nThe therapist recommended James start social transitioning by wearing dresses to school and going by the name Luna.\n\nTheir child currently identifies as a girl at school and is called Luna by her teachers.\n\nYounger claims his ex-wife has been forcing the transition ever since their divorce and has accused Georgulas of starting to manipulate their child when James was just three years old.\n\nHe has accused Georgulas of locking James in the bedroom and telling their child that 'monsters only eat boys'.\n\nYounger also claims Georgulas has been forcing the child to wear dresses.\n\nIn a podcast interview earlier this year with Christian political consultant Luke Macias, Younger insisted that his child is not a girl and that she 'violently refuses to dress as girl at my house'.\n\nFollowing a week-long trial, a jury decided on Tuesday to give sole managing guardianship of James (right) and twin brother Jude (left) to their mother\n\nYounger went on to publicly accuse his ex-wife of sexually abusing their child.\n\n'I want you to imagine having electronic communication with you son on FaceTime, and imagine that your ex-wife has dressed him as a drag queen to talk to you. He has false eyelashes and makeup. His hair has got glitter in it. He's wearing a dress,' he said.\n\n'Now imagine how you would feel seeing what I believe is actual sexual abuse - I believe this is not just emotional abuse but is the very, most fundamental form of sexual abuse, tampering with the sexual identity of a vulnerable boy. Every. Single. Day.\n\n'You have to see your son sexually abused, and you have to maintain your calm... because the courts are not going to be fair to you. And the only way you can survive this and get your son through this alive is to calmly allow your son to be tortured right before your eyes and outlast the opposition. That's what it's like.'\n\nSeparate from the custody court battle, Younger has been campaigning to prevent his child's gender transition.\n\nWebsites and Facebook groups called 'Save James' have been set up and there is a GoFundMe page with about $40,000 in donations to help with Younger's court costs.\n\nAs part of the judge's ruling, the websites will now have to be shut down.", "description": "Jeff Younger has been battling his ex-wife Dr Anne Georgulas in a Dallas family court as part of their bitter custody fight over whether their child James has gender dysphoria.", "authors": ["Emily Crane", "Alan Butterfield In Dallas", "Texas For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/21/20152148-0-image-a-5_1571948776583.jpg", "published_at": "2019-10-24"}