{"pub": "realclearpolitics", "url": "https://cnn.com/2019/09/29/opinions/trump-ukraine-call-risks-us-national-security-vinograd/index.html", "downloaded_at": "2019-10-01 04:27:55.130276+00:00", "title": "Trump took huge risks with US national security", "language": "en", "text": "Samantha Vinograd is a CNN national security analyst. She is a senior adviser at the University of Delaware's Biden Institute, which is not affiliated with the Biden campaign. Vinograd served on President Barack Obama's National Security Council from 2009 to 2013 and at the Treasury Department under President George W. Bush. Follow her @sam_vinograd . The views expressed in this commentary are her own. View more opinion articles on CNN.\n\n(CNN) President Donald Trump once hailed himself as the \" most transparent president ever .\" This week, however, we learned that Trump's team took unprecedented steps to hide readouts of his conversations with Ukraine's President Volodymyr Zelensky, Russian President Vladimir Putin and members of the Saudi royal family. (The White House has only confirmed that it moved a readout of the President's call with Zelensky to a special server that's supposed to be used for codeword-level intelligence.)\n\nThe impact of this revelation on US national security has already been devastating. While the House of Representatives investigates whether Trump violated the Constitution in allegedly seeking help from a foreign leader to interfere in the 2020 presidential elections, national security officials need to manage the adverse impacts of the President's actions in real time, all while trying to do their day jobs.\n\nForeign counterparts are also less likely to be forthcoming with the President and other US officials if they're worried that readouts of their communications may one day end up in news reports or as part of a congressional investigation.\n\nRed flag alert\n\nWhite House officials and the President should spend their time mitigating counterintelligence risks -- not adding to them.\n\nAnd yet, since the 2016 campaign, Trump and his team's activities have heightened counterintelligence concerns. The whistleblower complaint alleging that the White House hid records of Trump's conversations with foreign officials by storing them in a highly classified computer system isn't helping matters.\n\nBut it's not the first potential breach. In other cases, the White House reportedly failed to document conversations with world leaders in the first place. These activities raise serious red flags, because they could mean that foreign governments know more about the President, along with his comments and intentions, than key members of his own government. That gives them leverage to manipulate or blackmail Trump, especially if the President said something that was incriminating or embarrassing.\n\nHere's a case in point: When Trump met with two senior Russian officials in 2017, he told them he was \"unconcerned\" about the Kremlin's 2016 election interference because, he claimed, the US did the same thing, according to the Washington Post . While US officials were working to secure our elections, the Russians knew that the President was unconcerned and that if this statement became public it could be damaging to him. Trump was directly undercutting his team's critical work, while offering the Russians leverage over him.\n\nHome team disadvantage\n\nFailing to document presidential conversations is a violation of the Presidential Records Act and failing to distribute readouts -- whether verbally or in writing -- hamstrings the President's team in real ways, while also creating counterintelligence risks.\n\nIn the rough transcript of Trump's phone call with Zelensky, the US President said, \"I will have Mr. Giuliani give you a call and I am also going to have Attorney General Barr call and we will get to the bottom of it.\" But the Justice Department issued a statement on Wednesday that said, \"The President has not spoken with the Attorney General about having Ukraine investigate anything relating to former Vice President Biden or his son.\" If the White House failed to give Barr a readout of a call in which he was designated, by name, as a point of contact for follow-up, we don't know what other key conversations the President has failed to relay to members of his own Cabinet.\n\nBy hiding the transcript, Trump's team also hindered the ability of our intelligence community to do their jobs effectively. Authorized intelligence analysts need to know what the President said to a foreign official, otherwise they may hear about the President's comments during their intelligence collection on foreign sources and have no way of knowing if it's accurate and whether to pass it on.\n\nSmall group involved\n\nNews that the White House didn't give a readout of the July 25 meeting to key officials, while Trump's personal lawyer, Rudy Giuliani, was put in touch with the Ukrainians, probably just furthers the signal globally that the President prefers to keep a small group involved in doing his bidding rather than engaging actual experts and official channels. The President's son-in-law, Jared Kushner, has been accused of leaving the former Secretary of State in the dark when it comes to meeting with foreign leaders, and the whistleblower's complaint likely adds to perceptions that working through official channels like the Department of Justice aren't always the President's preferred course of action.\n\nWhile the Justice Department said Barr didn't get a readout of the call, the whistleblower complaint alleges two State Department officials -- US Ambassador to the EU Gordon Sondland and former Special Envoy to Ukraine Kurt Volker -- met with the Ukrainians the day after the call to \"navigate\" the President's demands of Zelensky. Shortly after, Volker put a Ukrainian official in touch with Giuliani but not with Barr.\n\nAccording to the whistleblower, Pompeo's senior staff member, T. Ulrich Brechbuhl, the counselor for the Department of State, was also listening in (an allegation State denies), so, if he did, it is likely that he gave Pompeo a readout along with Sondland and Volker, given their reported activities following up on the President's demands a day after the call.\n\nWhat we don't yet know is whether key career diplomats at the State Department were looped in, like our acting ambassador ( charge d'affaires ) at the Embassy in Kiev, Ukraine. But what is clear is that while Trump told Zelensky that Barr and Giuliani would call him -- only Giuliani was put in touch with the Ukrainians.\n\nThe State Department confirmed weeks ago that it put Giuliani in touch with the Ukrainians. And the whistleblower complaint only furthers the perception that the President's friends -- like Giuliani -- get the readouts and support they need while key US officials don't. That could further lead other governments to stop working through vetted, official channels and just call Giuliani or another one of the President's inner personal circle to follow up on calls and meetings.\n\nDay jobs matter\n\nWhile the Trump administration prepares to deal with congressional investigations, they also have day jobs to do. Whether they respond to or stonewall congressional subpoenas, requests and depositions, the impeachment inquiry will be a drain on resources -- especially for officials working on key issues like Ukraine.\n\nGet our weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\n\nTheir efforts should be focused on important bilateral work, like deterring Russian aggression and trying to stop the ongoing conflict in eastern Ukraine. Because of the President's actions, and the alleged activities detailed in the whistleblower complaint, US officials will need to divert critical time and attention to responding to the investigations, while America's enemies and allies alike will know that US officials are distracted.", "description": "Samantha Vinograd writes that Donald Trump's call with the Ukrainian President has huge ramifications for the US national security team, which must now manage the adverse impacts of the President's actions in real time, all while trying to do their day jobs.", "authors": ["Opinion Samantha Vinograd"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190927105057-trump-ukraine-call-transcipt-white-house-lawyers-highly-secure-system-vpx-00000208-super-tease.jpg", "published_at": "2019-09-29"}