{"pub": "fox", "url": "https://foxnews.com/sports/patriots-julian-edelman-bill-belichick-hot-tub", "downloaded_at": "2019-10-03 10:50:05.455708+00:00", "published_at": "2019-10-03", "title": "New England Patriots' Julian Edelman recalls late-night awkward interaction with Bill Belichick", "language": "en", "text": "New England Patriots star Julian Edelman on Wednesday recalled the first conversation he ever had with head coach Bill Belichick and why it was a moment he will never forget for one very awkward reason.\n\nEdelman, who joined the Patriots in 2009 as a seventh-round pick from Kent State, explained in a deleted scene from his Showtime series “100% Edelman” he has only talked to Belichick about eight times in his 10-year career. Early on, he was working a late night at the team facility when he saw Belichick on a treadmill in a dark weight room watching film and taking notes.\n\nVONTAZE BURFICT'S 'HEART IS BROKEN' OVER SEASON-LONG SUSPENSION, RAIDERS' DEREK CARR SAYS\n\n“I hurry and scatter out of there so he doesn't by any chance see me,” Edelman said. “That's the last thing I would want at that time of my life and career because then I'd have to engage in a potential conversation and I don't know if I had the stamina for that at that time.”\n\nBut soon afterward, came the truly uncomfortable encounter.\n\n“I just so happen to walk by the hot tub and coach is in the hot tub. Obviously, I came in the room to go in the hot tub. But then we made eye contact and my natural instinct was to turn around like I was gonna leave,” he said.\n\nSUPER BOWL CHAMPION PERCY HARVIN OPENS UP ABOUT ANXIETY ISSUES, HOW SMOKING WEED HELPED\n\n“But then I saw that he saw that I was in there and then he got up and got out and real, real big party foul by coach. We're supposed to have shorts on. Supposed to have shorts. But I guess at 11 o'clock, when you're the GOAT of coaching you go wherever you want, free—free ball. So I had to hide my absolute face of terror after seeing what I saw and sit in the hot tub.”\n\nEdelman said he did his thing in the hot tub and then tried to scamper out of there without being seen again by Belichick. The wide receiver said as he was leaving the building he ran into Belichick again.\n\nAs the two were walking toward the exit, Edelman said he tried to strike up a conversation.\n\n“I was sitting there I was like in so much disbelief of everything that was happening, going on that night that I potentially wanted to try and make some small talk with him. And I don’t know where I got the confidence but I asked him, ‘Coach, it’s pretty amazing that you’re here this late.’\n\nPATRIOTS' BILL BELICHICK'S COMPLIMENTARY WORDS FOR REDSKINS OFFENSE HAS SOME FANS BEFUDDLED\n\n“And, he looked back at me and without any hesitation, he goes, ‘It beats being a plumber. See you tomorrow’”\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nEdelman said he was befuddled by Belichick’s response and he may have “shedded [sic] a single tear.”", "description": "New England Patriots star Julian Edelman on Wednesday recalled the first conversation he ever had with head coach Bill Belichick and it was a moment he would never forget for one frightening reason.", "authors": ["Ryan Gaydos", "Ryan Gaydos Is A Sports Reporter For Foxnews.Com", "Foxbusiness.Com. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/NFL-Julian-Edelman2.jpg"}