{"pub": "yahoo", "url": "https://sports.yahoo.com/world-series-game-6-preview-110623064.html", "downloaded_at": "2019-10-29 13:56:45.097875+00:00", "title": "World Series Game 6 Preview: Do the Astros Take it Back tonight?", "language": "en", "text": "The task is pretty simple for the Astros: win tonight or tomorrow night and they’re World Series champs.\n\nFor that matter it’s pretty straightforward for the Nationals too: lose again and your season is over. The “not losing again” thing, of course, is less simple to pull off.\n\nScroll to continue with content Ad\n\nBut doing difficult things is not impossible, especially in this World Series. Just last Friday morning the Astros were staring the possibility of 0-3 in the face and were about to play three games on the road. All they did was outscore the Nationals 19-3 over those three games and win them all, one victory of which came with a rookie starter on the hill. The Nationals now have their co-ace, Stephen Strasburg on the hill and — pending his health — could send out Max Scherzer in a winner-take-all Game 7 should Strasburg prevail tonight.\n\nBut first the Nats bats, in a deep freeze since the middle of last week, need to wake up. And they need to do it against Justin Verlander.\n\nThe Game: World Series Game 6: Washington Nationals vs. Houston Astros\n\nThe Time: 8:07 PM Eastern\n\nThe Ballpark: Minute Maid Park, Houston, Texas\n\nThe Network: Fox\n\nThe Starters: Stephen Strasburg vs. Justin Verlander\n\nThe Upshot:\n\nIt’s doable. Verlander is just 1-3 with a 4.15 ERA this postseason and last time out, in Game 2, he coughed up four runs on seven hits in six innings to take the L. Strasburg, meanwhile, is 4-0 with a 1.93 ERA in October and tossed six strong innings in that Game 2 win.\n\nStory continues\n\nFor all that Verlander did in the regular season, he seems pretty mortal at the moment. And he is 0-5 with a 5.73 ERA over six career World Series starts. Streaks like that are made to be broken — Verlander has simply had slow starts to games and you feel like he’s one adjustment away from, you know, not doing that — but the Nats have gotten to him before and can at least have some confidence that they can get to him again.\n\nObviously, though, it all comes down to the Washington bats. Trea Turner has been cold as ice at the top of the lineup. Anthony Rendon is not getting the job done either. Juan Soto homered on Sunday night after going 0-for-Games 3 and 4, but he’ll need to put together a full game himself. Nothing Strasburg can do on the hill tonight will matter if the Nationals’ offensive woes continue. They simply have to hit the ball again.\n\nIf they do — and if Strasburg keeps things close — it will be all-hands-on-deck out of the Washington bullpen. Figure to see Game 4 starter Patrick Corbin in relief. Pending Max Scherzer’s health he could either be used for a short relief stint tonight or — and this would be risky — Aníbal Sánchez could be used in relief with Scherzer held for a Game 7 start. That seems rather unlikely as, if you do that, and he has more neck spasms, the Nats would be without good options in a Game 7. And heck, Scherzer may not be able to pitch at all given how debilitated he was on Sunday. I’m just pointing out that, when a team’s back is up against the wall, every option is on the table, so if Game 6 is close, Dave Martinez needs to do absolutely everything he can to get to Game 7 and hope to figure out how to deal with it tomorrow.\n\nWhich is to say: Game 6 could be a wild one.", "description": "Justin Verlander is 0-5 with a 5.73 ERA in World Series play. If he makes it 1-5 tonight, the Astros are champions again.", "authors": ["Craig Calcaterra"], "top_image": "https://s.yimg.com/ny/api/res/1.2/HbXZDJryB9j9XVVaEtbTtw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjEuMDY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/c.ZpQMQd7UoZrw3kA54tmA--~B/aD0xMDgxO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/nbcsports.com/0aa846bdf1cc3a368b238b59e3153558", "published_at": "2019-10-29"}