{"pub": "foxnews", "url": "https://foxnews.com/politics/trump-family-dynasty-will-last-for-decades-2020-campaign-chief-says", "downloaded_at": "2019-09-08 11:58:19.390382+00:00", "title": "Trump family ‘dynasty’ will ‘last for decades,’ 2020 campaign chief says", "language": "en", "text": "President Trump and his family represent a political movement with the potential of transforming the Republican Party, according to Brad Parscale, manager of the president’s 2020 reelection campaign.\n\n“I just think they’re a dynasty,” Parscale told reporters after delivering a speech Saturday at the fall convention of the California Republican Party.\n\n“I think they’re all amazing people … with amazing capabilities,” he said, according to the Associated Press. “I think you see that from Don Jr. I think you see that from Ivanka. You see it from Jared. You see it from all.”\n\nGOP PLANS CALIFORNIA COMEBACK IN 2020, TRUMP CAMPAIGN MANAGER BRAD PARSCALE SAYS AT STATE CONVENTION\n\n“I think they’re all amazing people … with amazing capabilities. I think you see that from Don Jr. I think you see that from Ivanka. You see it from Jared. You see it from all.” — Brad Parscale, manager of President Trump’s 2020 reelection campaign.\n\nParscale was speaking at the end of a week that saw Ivanka Trump embark on a trip to Argentina, Colombia and Paraguay to promote the Women's Global Development and Prosperity Initiative; saw Republican political strategist Rick Wilson predict in a Daily Beast column that Donald Trump Jr. will seek and likely win the 2024 GOP presidential nomination; and saw Jared Kushner appoint a lieutenant in his role of crafting the president's Middle East policy, according to Politico.\n\nEarlier Saturday, Parscale told the convention crowd in Indian Wells that the Trump family’s influence would likely “last for decades,” and propel the GOP “into a new party – one that will adapt to changing cultures.\n\n“One must continue to adapt while keeping the conservative values that we believe in,” he added, though when speaking later with reporters he declined to speculate on whether any of the president’s family members would seek elected office, the AP reported.\n\nAt the California GOP convention, party delegates sought to develop an election strategy in a heavily Democratic state that Trump lost by more than 4 million votes in 2016. Polls show the president remains widely unpopular there.\n\nParscale acknowledged that California was not a key focus of Trump's reelection plans. \"This is not a swing state,\" he said, drawing laughs from the crowd.\n\nBut he noted California was the biggest source of the president's campaign donations.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe party's struggles in California are well known. Democrats control every statewide office and both chambers of the Legislature, while holding an edge of nearly 4 million in voter registrations. Both U.S. Senate seats are in Democratic hands, and the party has a 46-7 edge over Republicans in U.S. House seats in the state.\n\nThe last significant push by a Republican presidential candidate to win California was in 2000, when George W. Bush was backed by more than $15 million, then lost to Democrat Al Gore by 12 points.\n\nThe Associated Press contributed to this story.", "description": "President Trump and his family represent a political movement with the potential of transforming the Republican Party, according to Brad Parscale, manager of the president’s 2020 reelection campaign.", "authors": ["Dom Calicchio", "Brad Parscale", "Manager Of President Trump S Reelection Campaign."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/AP19065619272907.jpg", "published_at": "2019-09-08"}