{"pub": "reuters", "url": "https://in.reuters.com/article/pakistan-iran/pakistan-says-khan-could-visit-saudi-iran-after-u-s-mediation-request-idINKBN1WP1JE", "downloaded_at": "2019-10-10 15:35:28.069017+00:00", "title": "Pakistan says Khan could visit Saudi, Iran, after U.S. mediation request", "language": "en", "text": "ISLAMABAD (Reuters) - Pakistan’s Prime Minister Imran Khan is likely to visit Saudi Arabia and Iran, the foreign office in Islamabad said on Thursday, weeks after Islamabad said Washington had asked it to mediate with Tehran.\n\nPakistan's Prime Minister Imran Khan speaks with China's President Xi Jinping (not pictured) during their meeting at the Diaoyutai State Guesthouse in Beijing, China, October 9, 2019. Parker Song/Pool via REUTERS\n\n“The possibility of a visit of the prime minister to Saudi Arabia and Iran is on the cards and I will update you as things unfold,” foreign office spokesman, Mohammad Fasisal, told a news briefing.\n\nThe announcement of the possible visit comes after Khan last month described a request by U.S. President Donald Trump, asking the Pakistani leader to help defuse tensions with Iran. Washington had blamed Tehran for an attack on the world’s biggest crude oil processing facility in Saudi Arabia.\n\nFaisal declined to comment when asked whether the visit was related to the mediation request.\n\nTensions have elevated between Iran and Saudi Arabia since the attack, which took place on Sept. 14.\n\nYemen’s Iran-aligned Houthi group, which has been fighting a Saudi-led military coalition since 2015, has claimed responsibility, but Washington and Riyadh say they believe the attack came from the opposite direction and blame Iran. Iran denies involvement.\n\nKhan said after a meeting with Trump on the sidelines of the United Nations General Assembly in New York that he was “trying and mediating” and had also spoken with Iran’s President Hassan Rouhani.\n\nKhan has ramped up his government’s engagement on the international stage, offering to negotiate regional tensions. He has separately proposed to Trump that Pakistan could help broker peace in neighbouring Afghanistan.\n\nLast week Pakistani government ministers met with both Taliban representatives and the U.S. peace envoy for Afghanistan, Zalmay Khalilzad, in Islamabad while Pakistan’s foreign minister called for a resumption in stalled peace talks between the Taliban and Washington.\n\nThe Taliban also met with Khalilzad, sources told Reuters, the first known contact since Trump halted talks last month, though officials said the talks did not represent a formal resumption of negotiations.", "description": "Pakistan's Prime Minister Imran Khan is likely to visit Saudi Arabia and Iran, the foreign office in Islamabad said on Thursday, weeks after Islamabad said Washington had asked it to mediate with Tehran.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439237678&w=1200&r=LYNXMPEF990XJ", "published_at": "2019-10-10"}