{"pub": "townhall", "url": "https://townhall.com/columnists/andrewwilford/2019/10/30/propublica-swings-and-misses-on-trump-tax-cut-hit-job-n2555612", "downloaded_at": "2019-10-30 23:21:02.358183+00:00", "title": "ProPublica Swings and Misses on Trump Tax Cut Hit Job", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nImagine, for a moment, that you are a journalist for left-leaning media outlet ProPublica. You come across data showing that in the wake of the Tax Cuts and Jobs Act’s (TCJA) caps on deductions that artificially inflated home values, home prices across the country have fallen, particularly in high-income, upper-class areas. How do you respond?\n\nIf you guessed “spin this news into a narrative about how the TCJA hurt middle-class homeowners,” you’re a winner! That’s exactly what ProPublica editor Allan Sloan did.\n\nSloan used data showing that home values nationally are 4% lower than they otherwise would have been, extrapolating this into a loss of over $1 trillion for homeowners. But according to his own data, most of this value decline has come from the TCJA’s changes to two major deductions.\n\nThe TCJA changed two major elements of the federal tax code that had been responsible for driving up the value of homes owned by wealthy Americans. First, the mortgage interest deduction, which allows homeowners to deduct interest paid on their mortgages, had its cap lowered from $1 million to $750,000 (meaning that you can now only deduct interest paid on the first $750,000 of your mortgage).\n\nThis change was made specifically because the mortgage interest deduction inflates home values, pricing out prospective middle-class homebuyers in favor of upper-class homeowners. A family with an income of $250,000 with an $800,000 home is not middle-class — it’s in the top 2 percent of Americans. Just don’t tell that to Sloan, however, who uses that exact hypothetical to lament the woes of homeowners living in the New York suburb of West Orange, New Jersey. Capping the mortgage interest deduction brings the deduction more in line with its original purpose of helping new middle-class homebuyers afford new homes, rather than artificially boosting home prices for those with expensive properties.\n\nThe other major change — the capping of the state and local tax (SALT) deduction — has proven more controversial thus far, with a coalition of blue states even suing the federal government (and losing) over it. Where the SALT deduction originally allowed taxpayers to deduct all of their state and local income and property taxes from their federal return, the TCJA capped this deduction at $10,000.\n\nPart of the reason blue-state governors hate this cap so much is that the SALT deduction subsidized their high-tax ways, allowing blue states to effectively offer a “discount” on tax increases on the wealthy, who could then deduct those higher taxes from the federal returns for a lower federal tax liability. Capping the SALT deduction has already forced blue states to reconsider their tax habits, with New Jersey’s Democratic Senate President Steve Sweeney changing from supporting a “millionaire’s tax” to opposing it specifically because of the SALT deduction cap.\n\nSloan claims that the capping of the SALT deduction is driving down home prices. Yet prior to TCJA’s passage, 84 percent of the benefits of the deduction went to taxpayers with incomes over $100,000, and just 3.5 percent of the benefits flowed to taxpayers with incomes under $50,000.\n\nSloan can’t claim ignorance of these facts, either. He writes, “You can argue, as some people do, that real estate taxes should never have been deductible because allowing that deduction is bad economic policy that inflated home prices and favored higher-income people over lower-income people.” He’s right: you can argue that, because it’s correct.\n\nEven with these trims to tax breaks enjoyed primarily by the wealthy, the vast majority of Americans still received a tax cut. Trying to hit at a tax law that explicitly aimed to reduce distortions in the tax code that artificially boosted housing prices for successfully reducing housing prices is beyond disingenuous. The TCJA sought to bring home prices more in line with their actual market value, enabling new homebuyers to enter a market that they were previously shut out of. By ProPublica’s own data, it was at least moderately successful in doing just that.", "description": "Imagine, for a moment, that you are a journalist for .10/30/2019 19:20:24PM EST.", "authors": ["Andrew Wilford", "Bronson Stocking", "Beth Baumann", "Matt Vespa", "Katie Pavlich"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/291/69df62d7-2933-4ed3-8010-fb4f503ec47a.jpg", "published_at": "2019-10-30"}