{"pub": "axios", "url": "https://buzzfeednews.com/article/ryanmac/miles-taylor-family-separation-dhs-despite-google-denial", "downloaded_at": "2019-10-29 15:09:03.435617+00:00", "title": "A Google Staffer Helped Sell Trump's Family Separation Policy, Despite The Company Denials", "language": "en", "text": "“The idea that you could disassociate from a policy that consumed the entire department while you were deputy chief of staff is ridiculous,” one former DHS official told BuzzFeed News.\n\nDavid Mcnew / Getty Images A protester decrying Trump administration immigration and refugee policies holds a sign pointing toward pro-Trump counterdemonstrators on June 30, 2018, in Los Angeles.\n\nGoogle executives misled their own employees last week when they said a former top Department of Homeland Security official who had recently joined the company was “not involved in the family separation policy,” government emails obtained under the Freedom of Information Act reveal.\n\nIn fact, Miles Taylor, who served as deputy chief of staff and then chief of staff to former Homeland Security secretary Kirstjen Nielsen, was involved in high-level discussions about immigration enforcement, helping to shape the department’s narratives and talking points as one of Nielsen’s trusted lieutenants. As Nielsen’s deputy chief of staff, Taylor was included on some of the DHS secretary’s emails and privy to her events schedule, often prepping his boss with reports and talking points ahead of public appearances between April and June 2018, when the family separation policy was in effect. In one email obtained by BuzzFeed News, Taylor assisted Nielsen in preparing what he described as the “Protecting Children Narrative” — the department’s spin on a policy that horrified Americans when images of abandoned, caged migrant children in squalid camps emerged. Other emails from Nielsen’s events planner show that he had been scheduled to participate in at least two weekly calls to “discuss Border Security and Immigration Enforcement” in June 2018. Two former DHS officials dismissed Google’s claim that Taylor — who last month joined the company as a government affairs and public policy manager advising on national security issues — could have kept his hands clean from the policy. Nielsen’s staff had a very “tight inner camp” that included Taylor, said one former DHS official, who spoke to BuzzFeed News anonymously to preserve personal relationships. They noted that any policy or decision moving off the secretary’s desk would have had Taylor’s eyes on it. “The idea that you could disassociate from a policy that consumed the entire department while you were deputy chief of staff is ridiculous,” the former official said.\n\nGoogle declined to comment. Taylor did not respond to multiple requests for comment.\n\nBuzzFeed News / Via Instagram\n\nLast Thursday, amid concerns about Google’s hiring of a former Department of Homeland Security staffer, executives at the search and advertising giant attempted to assuage employees’ worries by stating that their new government relations manager had not been involved in the Trump administration policy of migrant family separation. During an all-hands meeting at Google’s Mountain View, California, headquarters, Vice President of Public Affairs and Public Policy Karan Bhatia assured some agitated employees that Taylor had not been involved in one of the Trump era’s most divisive policies, which the company’s own executives spoke out against last year. Emails obtained by BuzzFeed News, however, cast serious doubt on those claims. Scrutiny of Taylor’s hiring comes at a time of heightened discord among Google’s rank-and-file, following a tumultuous 18 months in which workers have protested the company’s handling of sexual misconduct, business plans in China, and relationships with the US military. In leaked audio from Thursday’s meeting reported by the Washington Post, Google CEO Sundar Pichai lamented the mistrust between employees and management, and the nature by which the company’s internal affairs were making their way outside of Google’s walls. It was at that meeting that Bhatia also addressed Taylor’s hiring, only hours after the company had removed two posts about the matter from an internal message board used by employees to ask and vote on questions for management. The deletion of those questions, which the company said violated its internal policies, worried some employees who felt that management was trying to squelch debate around a contentious issue. BuzzFeed News reported last Monday that Taylor had joined on Google. “I’ll say that the press reports that you will have seen contain a number of important inaccuracies in them,” Bhatia said, appearing to reference BuzzFeed News’ earlier reporting. “First of all, he was not involved in the formation of the travel ban — the Muslim ban. He was not in the administration when the ban was issued.” BuzzFeed News did not report that Taylor had helped to draft the travel ban, which barred visitors from six majority-Muslim countries in early 2017. Instead, it noted his public defense of a subsequent iteration of the policy as a DHS official later that year.\n\n“He was also not involved in the family separation policy,” Bhatia told employees, referencing an immigration enforcement initiative that led to the separation of immigrant children from their parents and relatives at the southern border during the spring of 2018. “So I just would say that the press articles sometimes on these things are misleading.” Nielsen’s emails suggest otherwise. In August 2018, BuzzFeed News filed a Freedom of Information Act (FOIA) request with the Department of Homeland Security seeking all emails Nielsen sent and received since June 1, 2017, as well as her call logs and minutes from meetings she and her aides attended. When DHS failed to respond to the request, BuzzFeed News sued to compel the agency to produce Nielsen’s emails. Over the past year, DHS has released thousands of pages of emails from her inbox, though it aggressively redacted the communications citing exemptions under FOIA that protect personal privacy and information that would be considered “deliberative.” Still, unredacted portions of emails on which Taylor was included and others he sent to Nielsen reveal that he weighed in on and was privy to immigration matters as DHS dealt with a family separation policy that engulfed the department in controversy. On May 5, 2018, Nielsen sent an email to Taylor; Chad Wolf, her chief of staff; and Jonathan Hoffman, DHS assistant secretary for public affairs, asking for “narratives” by 10 the next morning. Days before, a caravan of Central American immigrants had made its way to the US–Mexico border in Tijuana.The Trump administration’s family separation was already in effect, after then–attorney general Jeff Sessions’ call in April for a “zero tolerance policy” for border-crossing offenses. The following day, Taylor responded. “Madam Secretary, attached is the updated Caravan Narrative and the Protecting Children Narrative,” he wrote. “The narratives for TPS and Refugees/Asylees are forthcoming. Will have those to you within the hour.” TPS likely refers to “Temporary Protected Status,” said a former DHS official, and describes asylum-seekers who are allowed to live in the US for a limited time due to unrest or conflict in their home countries.\n\nJason Leopold / BuzzFeed News / Via Department of Homeland Security\n\nAs deputy chief of staff, Taylor helped draft written testimony for the DHS secretary, which Nielsen called “seriously well done” ahead of a Senate hearing titled “Authorities and Resources Needed to Protect and Secure the United States.” The testimony addressed cybersecurity, FEMA, and terrorism — but made DHS’s priority clear.\n\n“When it comes to critical needs, there is probably no issue more important for DHS right now than border security and immigration,” Nielsen said on May 15 to the Senate Homeland Security and Governmental Affairs Committee. At the hearing, California Sen. Kamala Harris would go on to grill the secretary, prompting her to falsely claim, “We do not have a policy to separate children from their parents.” In another heavily redacted email from May 21, Taylor relayed information to Nielsen from the Department of Justice’s Executive Office for Immigration Review, which is responsible for adjudicating US immigration cases. That same day, Nielsen leaned on Taylor and Wolf after reading a morning news briefing, which included a sampling of President Trump’s tweets and summaries of articles about DHS, that had been prepared for her office. “Can we verify and get more info on this: Between October 2017 and April 2018, ‘nearly two-thirds of all such immigrants arrested by ICE… had no criminal convictions,’ a 21 precent increase from the year prior,” she wrote, referencing a story from the Hill in the bulletin. The emails obtained by BuzzFeed News did not include any responses to Nielsen’s request from Taylor or Wolf. A second former DHS official told BuzzFeed News that while Taylor was mainly focused on cybersecurity, terrorism, and aviation issues at the department, his role as deputy chief of staff would have involved him in discussions about immigration enforcement policies like family separation. They noted that chiefs of staff were usually in most meetings with the secretary and would have been tracking the department’s major initiatives. That appears to be the case according to Nielsen’s email scheduler, whose “Weekly call to discuss Border Security and Immigration Enforcement” listed Nielsen, deputy DHS secretary Claire Grady, Customs and Border Protection commissioner Kevin McAleenan, director of US Citizenship and Immigration Services Lee Francis Cissna, Wolf, and Taylor — all of whom no longer hold their positions — as scheduled participants for an eventually canceled event on June 1. Taylor was also on a list of participants for a similar call on June 19.\n\nJason Leopold / BuzzFeed News / Via Department of Homeland Security", "description": "“The idea that you could disassociate from a policy that consumed the entire department while you were deputy chief of staff is ridiculous,” one former DHS official told BuzzFeed News.", "authors": ["Ryan Mac", "Buzzfeed News Reporter", "Jason Leopold"], "top_image": "https://img.buzzfeed.com/buzzfeed-static/static/2019-10/28/18/enhanced/86a9c45c4102/original-1669-1572288041-2.jpg?crop=1244:651;0,89", "published_at": "2019-10-29"}