{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/harvard-admissions-policies-diversity-tinkering-creates-tangled-web", "downloaded_at": "2019-10-09 10:40:38.264469+00:00", "title": "Harvard Admission Policies: Diversity Tinkering Creates a Tangled Web", "language": "en", "text": "Commencement ceremonies at Harvard University, May 24, 2018. (Brian Snyder/Reuters)\n\nAmerica’s great universities, having become playthings of progressives, are now targeted by populists.\n\nWashington — The judge took 130 pages to explain that Harvard’s “holistic review” admissions policies — which include ascribing particular attributes to certain ethnicities, such as Asian Americans, and assessing the value to Harvard of those attributes — are, considering 41 years of Supreme Court precedents, permissibly race-conscious. She said the policies do not discriminate against Asian Americans.\n\nAdvertisement\n\nAdvertisement\n\nHowever, the suit some Asian Americans filed against Harvard correctly cited evidence from Harvard that more objective admissions policies than Harvard’s would admit many more Asian Americans. What a tangled web we weave when we deceive ourselves into thinking that we can favor some groups without disfavoring others, or disfavor some without acting on the basis of stereotypes. But before disparaging Harvard’s attempts to shape its student body, and before judging the judge’s opinion, consider three facts:\n\nFirst, Harvard admitted just 4.5 percent of the 43,330 applicants to this year’s freshman class of 1,650, so it needs some sorting metrics (to serve the institution as a whole and many subconstituencies, from the athletic department to alumni relations). Second, if Harvard were to admit every applicant with a perfect grade-point average, it would increase the size of its entering class 400 percent. Third, a Harvard document presented in the trial estimated that relying exclusively on objective academic measurements — secondary school transcripts and SAT scores — would produce a Harvard student body 43 percent Asian American and 1 percent African American. (Caltech, which relies much more heavily on those than other highly selective institutions, enrolled a 2018 freshman class that was 40 percent Asian.)\n\nNow, three questions. Would you be comfortable with a legal requirement that only such objective metrics be used in college admissions? If that were required, would Harvard have to choose by lottery the 25 percent of the “perfect GPAs” to admit? Would you be comfortable with the nation’s most elite institutions — very few schools are selective enough to be able to curate their student bodies for whatever diversity is desired — looking so little like the nation?\n\nAdvertisement\n\nBefore the discomforting reality of racial preferences was blurred by the anodyne phrase “affirmative action,” the 1976 Democratic platform spoke of “compensatory opportunity,” thereby presenting race-conscious policies as remediation for past social injuries. But the Supreme Court’s 1978 Bakke decision, the first concerning higher-education admissions, authorized schools to consider race as a small “plus” factor in admissions in order to achieve “diversity.” So, “race-conscious remedies” were not to be remedial. Or of finite duration. They would be forever, for the benefit of the privileged — those admitted to, and who administer, colleges and universities.\n\nAdvertisement\n\nIn this fifth decade of judicial tinkering, with the Harvard case probably heading to the Supreme Court, it is clear that the admissions departments of highly selective universities will devise metrics compatible with porous judicial language in order to shape student bodies to serve what they consider institutional needs. Courts can try to confine admissions departments with porous terms like minor “plus-factors” that are “narrowly tailored” to achieve a “critical mass” of this or that minority without “unduly” harming any group. But those departments will resort to cynical evasions.\n\nAdvertisement\n\nTaking race “into account” could just as well be called taking into account cultures (of communities or ethnic cohorts). Some attributes, including those conducive to academic excellence, are disproportionately prevalent among various groups (e.g., Asian Americans, Jews at various times).\n\nSo, a fourth question: If universities do not consciously shape their student bodies, who will? The U.S. Education Department, with criteria as variable as the nation’s election results?\n\nAdvertisement\n\nAmerica’s great universities, having become playthings of progressives, are now targeted by populists. Two years ago, the Republican tax bill targeted elite schools with the largest per-student endowments. This tax raises a pittance but scratches a populist itch — resentment of excellence. Last month, a Republican administration’s Education Department threatened to withdraw federal funding from a joint Duke University and University of North Carolina Middle East–studies program because it lacks viewpoint — wait for it — diversity. And reflects hostility to Israel, is insufficiently “positive” about Christianity and Judaism, and is saturated with extraneous progressive propaganda. These charges, and accusations of anti-Semitism, are entirely plausible, but are conservatives, supposed proponents of modest government, comfortable with bureaucrats dictating the contents of college courses?\n\nAdvertisement\n\nThe uninhibited district-court judge in the Harvard case, who suggested Harvard admissions officers be trained against “implicit bias,” asserted that student-body diversity fosters “tolerance, acceptance, and understanding.” So, consider a fifth question: Is it a mere coincidence that academia’s obsession with diversity has coincided with a tsunami of campus intolerance and hysteria?\n\n© 2019 Washington Post Writers Group", "description": "Is it a mere coincidence that academia’s obsession with diversity has coincided with a tsunami of campus intolerance and hysteria?", "authors": ["George Will", "Kevin D. Williamson", "Andrew C. Mccarthy", "Rich Lowry", "John Fund", "John Mccormack", "Jim Geraghty", "The Editors", "Read More", "The American Conservative"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2018/06/harvard-university-commencement.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-09"}