{"pub": "yahoo", "url": "https://sports.yahoo.com/rosenthal-fait-accompli-joe-maddon-163749595.html", "downloaded_at": "2019-09-28 02:07:43.488493+00:00", "title": "Rosenthal: It’s a “a fait accompli” that Joe Maddon will not be back as Cubs manager", "language": "en", "text": "This is not necessarily a provocative hypothesis given their disappointing ending to the disappointing 2019 season, but today Ken Rosenthal says that the entire industry regards it as a fait accompli” that the Chicago Cubs will not bring Joe Maddon back as manager when his deal is up at the end of the season.\n\nRosenthal’s article lays out the indictment against Maddon, focusing mostly on the Cubs seeming uninspired play and lack of urgency. Those are the sorts of things that, however hard to quantify or sometimes even identify, usually get laid at the feet of a manager. The groundwork for all of that was laid out pretty starkly last offseason too, Rosenthal notes, when the Cubs front office spoke to players who told them that they thought Maddon and the coaching staff was too hands-off.\n\nScroll to continue with content Ad\n\nNot that that’s the whole story, of course. Maddon has always been generally the same guy. He didn’t forget how to manage. The players didn’t always execute. The front office has not developed talent particularly well in recent years. Success has many fathers but, contrary to the old saying, so too does failure. No one has distinguished themselves all that much in Chicago in the past year or so. Only one person’s contract is up, however, and that’s Joe Maddon.", "description": "He is about to manage his final three games for the Cubs, it seems", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/euIe1xvmb6G1WukQ_z3DyA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjIuMTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/pdbIaq.NZmerQKGDSEHgAg--~B/aD0xMDgwO3c9MTkxMztzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/nbcsports.com/aa35287434ca52dcf931d636b6f1d622", "published_at": "2019-09-27"}