{"pub": "investing.com", "url": "https://investing.com/news/technology-news/siam-commercial-bank-partners-with-sea-group-to-expand-digital-lending-1971007", "downloaded_at": "2019-09-05 11:29:36.822240+00:00", "title": "Siam Commercial Bank partners with Sea Group to expand digital lending", "language": "en", "text": "BANGKOK (Reuters) - Thailand's largest lender Siam Commercial Bank Pcl (SCB) announced a partnership with e-commerce and game developer Sea Ltd's Thai operations to provide payments and lending services as it seeks to increase revenues from digital banking.\n\nSiam Commercial will provide lending services to small businesses on Singapore-based Sea's platforms, the bank's president, Apiphan Charoenanusorn. Sea's AirPay customers will also be able to pay bills via SCB's apps, he said.\n\nThe tie-up is in line with the bank's strategy to secure partnerships and expand its digital capacity, including payments and lending.\n\nEarlier this year SCB made an undisclosed investment in Indonesian ride-hailing startup GoJek's Thai unit, Get, with plans to expand financial services to drivers on the app.\n\nIts partnership with Sea comes as Thai banks are pressured by falling fee income following a waiver on digital transaction fees since last year.\n\nSCB's non-interest income dropped by 9.7% in the first half of 2019 from a year earlier due to lower fee income.\n\nSea, which owns e-commerce platform Shopee and operates in Southeast Asia and Taiwan, reported its e-commerce revenue more than tripled in the April-June period versus the same period a year ago on the marketplace-related services.\n\nSea raised $1.5 billion this year to expand its e-commerce business. It has also hired Portuguese footballer Cristiano Ronaldo as its ambassador for an upcoming sales event on its app, hoping his popularity in Southeast Asia can bolster sales.", "description": "Siam Commercial Bank partners with Sea Group to expand digital lending", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXNPEF84118_L.jpg", "published_at": "2019-09-05"}