{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/18/oklahoma-church-being-investigated-restraining-gay", "downloaded_at": "2019-09-18 23:27:07.214022+00:00", "title": "Oklahoma church under assault investigation after gay man allegedly restrained during church service", "language": "en", "text": "An Oklahoma church is under investigation by authorities after a man filed a police report claiming he was held down and assaulted in an attempt to change his sexuality.\n\nSean Cormie told KFOR-TV that he and his partner, Gary Garner, went to the First Assembly of God in Blackwell on September 8 after his parents had urged them to begin attending church services again.\n\n“I wanted to go to church and make my mom proud,” he said.\n\nMr. Cormie said that, during the service church, pastor Bill McKissick began speaking about homosexuality as 12 church members surrounded and accosted the couple.\n\n“They hold me down, pin me down, and I’m crying, and the Holy Spirit just comes through me, and they keep speaking in tongues, praying over me,” Mr. Cormie said to KFOR-TV. “I was just crying, ‘Mercy, mercy.’”\n\nMr. Cormie said Mr. Garner was kicked out of the church during the exchange, and as he tried to flee, he was punched in the face. Once they left, he filed a police report with the Blackwell Police Department, which confirmed to NBC that an investigation is happening.\n\nDespite alleged threats he’s received to drop the investigation, Mr. Comrie said he wants to see justice for what happened to him and his partner.\n\n“I love the pastors with all my heart, but what they did was totally wrong. I want some kind of consequences out of it,” he told KFOR-TV. “I want it to be heard and known because it really saddens my heart.”\n\nMr. McKissick and his wife Tami, who also serves as a pastor at the church, reportedly said in a Facebook statement their church is “comprised of people from all different backgrounds.”\n\n“In response to allegations that have been made, this incident began as a family matter that escalated. Our church would never condone restraint of any person unless they were engaged in violent activity,” they wrote, according to NBC News.\n\n“There is much more to this story, and we are cooperating fully with law enforcement to bring all of the facts to light as a rush to judgment is not in anyone’s best interest.”\n\nThe statement and the church’s Facebook page appear to have since been deleted. Calls to the church office went unanswered as well.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "An Oklahoma church is under investigation by authorities after a man filed a police report claiming he was held down and assaulted in an attempt to change his sexuality.", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2018/10/22/AP_18256698429401_c0-335-4000-2667_s1770x1032.jpg?ee19028539f29a052c900e7d1499ec319dc5a685", "published_at": "2019-09-18"}