{"pub": "axios", "url": "https://axios.com/employers-health-care-coverage-insurance-2020-election-e0ce92cf-c106-44fe-bb35-1c3c6e452712.html", "downloaded_at": "2019-10-21 09:47:51.068408+00:00", "title": "Employers aren't changing their health benefits", "language": "en", "text": "By the numbers: Roughly half of employers offering health benefits did not shop around for new plans or insurance companies for 2019, according to the Kaiser Family Foundation's latest employer benefit survey.\n\nOf the half that did shop, just 18% changed to a new insurance carrier.\n\nThat means fewer than 10% of all employers switched carriers.\n\nLarge corporations, like GM, are much less likely to tinker with coverage than smaller firms.\n\n\"Disruption is the enemy,\" Mike Turpin, an employer health care consultant at the brokerage USI Insurance Services, said on a call with Wall Street investors last week.\n\nTurpin said he has seen even less switching for 2020 because employers don't want to make waves over health care in an election year — \"which buys another year\" for the large, incumbent health insurance companies.\n\nBetween the lines: More companies have moved workers into less comprehensive plans since the Affordable Care Act was passed, but those changes often have been met with either immediate condemnation (like Harvard in 2015) or delayed outrage as workers shoulder more costs.\n\n\"It is telling that brokers perform an analysis for employers that's called 'disruption analysis' — the goal of which is not to be disruptive, but to minimize disruption,\" said Katherine Hempstead, a health policy adviser at the Robert Wood Johnson Foundation.\n\nYes, but: Millions of people still switch health plans every year when they buy it on their own, change jobs, get laid off or retire.\n\nGo deeper: If there's a turning point on health costs, it'll come from employers", "description": "Inertia on medical and drug coverage keeps workers happy.", "authors": [], "top_image": "https://images.axios.com/t4S5pBn7PzfySg1ybgwsYKuRxMg=/0x0:1920x1080/1920x1080/2019/10/20/1571614752128.jpg", "published_at": "2019-10-21"}