{"pub": "thenextweb", "url": "https://fintechfutures.com/2019/10/ucl-graduate-fintech-turintech-ai-raises-1m-led-by-iq-capital", "downloaded_at": "2019-10-29 15:03:22.671278+00:00", "title": "UCL graduate fintech TurinTech.ai raises £1m led by IQ Capital", "language": "en", "text": "The research-driven artificial intelligence (AI) company Turing Intelligence Technology (TurinTech.ai), which was created by four University College London (UCL) researchers, has raised more than £1 million in seed funding.\n\nThe fintech, now based in Cambridge and a resident at London’s Microsoft Reactor, says it allows financial institutions to optimise algorithmic trading and helps investors to make better trading decisions.\n\nLed by deep-tech entrepreneur backer IQ Capital, the funding round will be used to hire additional data scientists and deepen its ‘Optimisation Automation’ suite.\n\n“Our research has prompted interest in our commercial product from big tech companies, a multinational fast-moving consumer goods (FMCG), fintechs, other start-ups and hedge funds to name a few,” says its CEO and co-founder Dr Leslie Kanthan, who adds, “we are at the precipice of automated optimisation”.\n\nRead more: Polish tech Comarch helps FIs transition to AI without the risk\n\nThe fintech, which has secured support from the big three: Microsoft, Google, and Amazon, says its offering means FIs can autonomously evolve their software and AI systems, allowing for smart optimisation to be carried out “at a scale never before achieved”.\n\nFounded in 2017 by UCL Department of Computer Science graduates, TurinTech.ai is also an alumnus of Conception X – a venture builder which piggy backs off PhD programmes using the university as its deep-tech incubator.\n\nInvestor IQ Capital’s principal Rick Hao calls TurinTech.ai “one of the most promising startups to spin out of UCL that we’ve seen in recent years”.\n\n“While the research is niche, the application is not,” Hao adds, “the team have built a framework that can be easily customised to cater for their clients’ needs, across a wide range of industries and sectors”.\n\nRead on: Rise of the machines: when will AI and machine learning change finance?", "description": "The research-driven artificial intelligence (AI) company Turing Intelligence Technology (TurinTech.ai), which was created by four University College London (UCL) researchers, has raised more than £1 million in seed funding.", "authors": [], "top_image": "https://www.fintechfutures.com/files/2018/01/fallback-fb.jpg", "published_at": "2019-10-29"}