{"pub": "yahoo", "url": "https://finance.yahoo.com/news/sap-partners-microsoft-first-market-050000949.html", "downloaded_at": "2019-10-21 09:49:57.278351+00:00", "title": "SAP partners with Microsoft for first-in-market cloud migration offerings", "language": "en", "text": "Through a new agreement, companies will accelerate and modernize customer transitions to SAP S/4HANA and SAP Cloud Platform on Microsoft Azure\n\nREDMOND, Washington and WALLDORF, Germany, Oct. 20, 2019 /PRNewswire/ -- Building on a joint commitment to simplify and modernize customers' journeys to the cloud through project \"Embrace,\" SAP SE (SAP) and Microsoft Corp. on Monday announced an extensive go-to-market partnership -- from conceptualization to sales -- to accelerate customer adoption of SAP S/4HANA® and SAP® Cloud Platform on Microsoft Azure.\n\nMicrosoft company logo. More\n\nToday's new, preferred cloud partnership brings together SAP and Microsoft, along with a global network of system integrators, to offer holistic bundles that provide customers with unified reference architectures, road maps and market-approved journeys to illuminate a clear path toward the cloud. As part of this simplified customer journey, Microsoft will re-sell components of SAP Cloud Platform alongside Azure. This unique offering is aimed at more easily migrating SAP ERP and SAP S/4HANA customers from on-premises to public cloud.\n\n\"This partnership is all about reducing complexity and minimizing costs for customers as they move to SAP S/4HANA in the cloud,\" said Jennifer Morgan, co-chief executive officer of SAP. \"Bringing together the power of SAP and Microsoft provides customers with the assurance of working with two industry leaders so they can confidently and efficiently transition into intelligent enterprises.\"\n\n\"SAP's decision to select Microsoft Azure as its preferred partner deepens the relationship between our two companies in a differentiated way and signals a shared commitment to fostering the growth of the cloud ecosystem,\" said Judson Althoff, executive vice president, Worldwide Commercial Business, Microsoft. \"Today's news also reflects our commitment to a customer-first mindset and supporting their cloud transformation, which continues to drive how we at Microsoft approach everything from partnerships to product innovation. It takes co-selling to a whole new level.\"\n\nSAP will lead with Microsoft Azure to move on-premise SAP ERP and SAP S/4HANA customers to the cloud through industry-specific best practices, reference architectures and cloud-delivered services. This includes future deployment and migration of existing direct SAP HANA® Enterprise Cloud customers leveraging hyperscaler infrastructure. However, SAP continues with its longstanding policy of supporting choice for those customers who request alternatives based on business requirements.\n\nSpecifically, project \"Embrace\" on Microsoft Azure will provide customers with:\n\nA simplified move from on-premise editions of SAP ERP to SAP S/4HANA for customers with integrated product and industry solutions. Industry market bundles will create a road map to the cloud for customers in focused industries, with a singular reference architecture and path to streamline implementation.\n\nfor customers with integrated product and industry solutions. Industry market bundles will create a road map to the cloud for customers in focused industries, with a singular reference architecture and path to streamline implementation. Collaborative support model for simplified resolution. In response to customer feedback, a combined support model for Azure and SAP Cloud Platform will help ease migration and improve communication.\n\nIn response to customer feedback, a combined support model for Azure and SAP Cloud Platform will help ease migration and improve communication. Jointly developed market journeys to support customer needs. Designed in collaboration with SAP, Microsoft and system integrator partners will provide road maps to the digital enterprise with recommended solutions and reference architectures for customers. These offer a harmonized approach by industry for products, services and practices across Microsoft, SAP and system integrators.\n\nAbout SAP\n\nAs the Experience Company powered by the Intelligent Enterprise, SAP is the market leader in enterprise application software, helping companies of all sizes and in all industries run at their best: 77% of the world's transaction revenue touches an SAP® system. Our machine learning, Internet of Things (IoT), and advanced analytics technologies help turn customers' businesses into intelligent enterprises. SAP helps give people and organizations deep business insight and fosters collaboration that helps them stay ahead of their competition. We simplify technology for companies so they can consume our software the way they want -- without disruption. Our end-to-end suite of applications and services enables more than 437,000 business and public customers to operate profitably, adapt continuously, and make a difference. With a global network of customers, partners, employees, and thought leaders, SAP helps the world run better and improves people's lives. For more information, visit www.sap.com.\n\nStory continues", "description": "REDMOND, Washington and WALLDORF, Germany, Oct. 20, 2019 /PRNewswire/ -- Building on a joint commitment to simplify and modernize customers' journeys to the cloud through project \"Embrace,\" SAP SE (SAP) and Microsoft Corp. on Monday announced an extensive go-to-market partnership -- from", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/gy8xWWxB017v10iAwim2xw--~B/aD04NTt3PTQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://globalfinance.zenfs.com/en_us/Finance/US_AFTP_PRNEWSWIRE_LIVE/SAP_partners_with_Microsoft_for-5131609c1c68526bb4c5cb0f48c0be5b", "published_at": "2019-10-21"}