{"pub": "japantoday", "url": "https://japantoday.com/category/national/Typhoon-death-toll-climbs-to-68-as-scope-of-damage-spreads", "downloaded_at": "2019-10-15 08:01:40.001033+00:00", "title": "Typhoon death toll climbs to 68, as scope of damage spreads", "language": "en", "text": "A home destroyed by Typhoon Hagibis is surrounded by floodwaters in Nagano on Tuesday.\n\nJapanese rescuers on Tuesday raced against the clock to save more than a dozen people still missing after a catastrophic typhoon over the weekend killed at least 68 people and paralyzed numerous areas with flooding.\n\nAt least 15 others remain unaccounted for after Typhoon Hagibis brought record-breaking rainfall to huge swathes of the country, according to a tally by Kyodo News, based on information provided by authorities in each region.\n\nJapan is still scrambling to get a complete picture of the damage. The infrastructure ministry said embankment collapses affecting 47 rivers in 66 locations had been confirmed as of 5 a.m. Tuesday, but officials said the scale of damage remains unclear as they cannot reach some areas due to very high water levels.\n\nThe most powerful typhoon to hit Japan in decades also caused mudslides, and electricity and water outages in various parts of the country.\n\nA vehicle sits in front of a home destroyed by the typhoon on Tuesday. Photo: AP/Jae C Hong\n\nA total of 146 mudslides were reported in 19 of Japan's 47 prefectures, while nearly 10,000 homes have been hit by muddy flood water, according to government officials.\n\nIn Marumori in Miyagi Prefecture, northeastern Japan, water was being removed around its flooded town office after it became accessible only by boat Saturday.\n\n\"My frightened daughter can't stop shaking. We want to go home quickly,\" said Rie Nishioka, 39, who was among the evacuees in the town.\n\nAs people return home and start cleanups, government officials urged them to protect themselves against infections by wearing masks and gloves and using sanitizing agents.\n\nThe number of homes without power has been significantly reduced from a peak of some 520,000, but 34,000 were still suffering blackouts as of 7 a.m. Tuesday, industry minister Isshu Sugawara told reporters.\n\nThey included many homes in Chiba Prefecture, an area that also suffered a prolonged power outage after Typhoon Faxai made landfall there in early September.\n\nThe health ministry said the number of homes without water stood at 133,000 in 13 prefectures.\n\nPrime Minister Shinzo Abe said at a disaster task force meeting on Tuesday that the government will use reserve funds, and will draft a supplementary budget for reconstruction work, if necessary.\n\n\"It is urgent to provide adequate support for the victims,\" Abe said later in a parliamentary session. \"There are concerns that the impact on life and economic activities will be prolonged.\"\n\nDefense Minister Taro Kono said he is summoning some 200 reserve members of the Self-Defense Forces and will raise the number to 1,000 if needed to facilitate rescue efforts and distribute water and other supplies to the affected.\n\nIt is the first time the reserve force has been mobilized since 2011, when a massive earthquake and tsunami devastated wide areas of northeastern Japan.\n\nWhile most train networks in Japan were back to normal, some sections of tracks are running only limited services or remain closed.\n\nEast Japan Railway Co said it will take \"considerable time\" to normalize shinkansen services between Tokyo and Kanazawa after a number of its bullet trains were engulfed by floodwater at a railyard in Nagano Prefecture.\n\nSanriku Railway Co, which only in March finally fully resumed all operations disrupted by the 2011 earthquake and tsunami, has suspended services between Kuji and Kamaishi in Iwate Prefecture.\n\nOn Tuesday, more than 200 public elementary, junior high and high schools closed for the day in seven prefectures, including Fukushima and Nagano, where the Chikuma River burst its banks, stranding hundreds of people.\n\n© KYODO", "description": "Japanese rescuers on Tuesday raced against the clock to save more than a dozen people still missing after a catastrophic typhoon over the weekend killed at least 68 people and paralyzed numerous areas with flooding. At least 15 others remain unaccounted for after Typhoon Hagibis brought record-breaking rainfall to huge…", "authors": [], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/4a/ba/1094697e093276ebe9c1befd86646c8508b0/nagano2.jpg", "published_at": "2019-10-15"}