{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/not-a-day-for-major-moves-15144760", "downloaded_at": "2019-10-29 15:05:20.013246+00:00", "title": "Not a Day for Major Moves", "language": "en", "text": "We have some 'wait and see' action today as market players digest earnings and look ahead to the Fed interest rate decision Wednesday and Apple (AAPL) earnings after tomorrow's close.\n\nBreadth is running about 2800 gainers to 3800 decliners and there are only about 125 stocks hitting new 12-month highs right now. After the run over the past two weeks, it isn't a big surprise that there is some profit-taking. It is difficult to do a lot of new buying with the indices hovering near all-time highs and the Fed on deck.\n\nMy primary focus right now is protecting recent gains and looking for a few short term plays. For example, I sold FireEye (FEYE) which had a good run and is reporting earnings tonight.\n\nAnother stock is reporting tonight is Enphase Energy (ENPH) . It has had two blowout quarters in a row and I expect that there are some buyers speculating that it will produce another strong quarter. I'm just playing it intraday but it is a good example of how you don't have to bet on earnings reports to make money trading them.\n\nI'm looking at a couple of natural gas pipeline plays that starting to come off recent lows. CNX Midstream (CNXM) and Williams Cos. (WMB) have been struggling for quite a while but are showing some signs of turning up.\n\nOverall this is not a day for major moves. We need to move past the Fed decision and see how things develop as that news is discounted.\n\nThere still is some good development in individual charts but we are in for a pause at this point.\n\n(Apple is a holding in Jim Cramer's Action Alerts PLUS member club. Want to be alerted before Jim Cramer buys or sells AAPL? Learn more now.)", "description": "It is difficult to do a lot of new buying with the indices hovering near all-time highs and the Fed on deck....AAPL", "authors": ["James", "Rev Shark", "Not A Day For Major Moves", "It Is Difficult To Do A Lot Of New Buying With The Indices Hovering Near All-Time Highs", "The Fed On Deck.", "Stocks Quotes In This Article", "Bruce Kamich", "Carolyn Boroden", "Bob Lang", "Gary Berman"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/2b166a07-4d7d-11e8-a2db-ff77b41236dd.png", "published_at": "2019-10-29"}