{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-march-protest-london-second-referendum-no-deal-boris-johnson-rally-a9148541.html", "downloaded_at": "2019-10-09 10:47:56.661221+00:00", "title": "Brexit march: No-deal is not 'will of the people', Final Say campaigners tell Boris Johnson", "language": "en", "text": "Campaigners for a second EU referendum are turning Leavers’ own slogan against them by telling Boris Johnson that the Brexit he wants to deliver is not “the will of the people”.\n\nThe message came in a hard-hitting video launched 10 days ahead of what organisers believe will be one of the largest public demonstrations the UK has ever seen, with hundreds of thousands marching through the streets of London on 19 October under the banner: “Together for a Final Say.”\n\nThe march and rally - backed by The Independent’s long-running Final Say campaign - will take place the day after the crunch European Council summit when Johnson will make his last pitch for a Brexit deal, as the House of Commons meets for its first emergency Saturday sitting since the Falklands War.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt follows the Put it to the People demonstration in March this year, when crowds estimated by organisers at over 1 million thronged the streets of the capital to demand a Final Say vote.\n\nAs talks with Brussels founder and Downing Street signals it is ready to go for no-deal, a new poll for People’s Vote found that Britain would vote by a 10-point margin to stay in the EU rather than leave without an agreement.\n\nSome 55 per cent of those quizzed by YouGov said they would vote for no Brexit, against 45 per cent for no deal, if they were given that choice in a Final Say referendum.\n\nShape Created with Sketch. Put It To The People march: Best of The Independent’s pictures Show all 24 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Put It To The People march: Best of The Independent’s pictures 1/24 Angela Christofilou/The Independent 2/24 Angela Christofilou/The Independent 3/24 Angela Christofilou/The Independent 4/24 Angela Christofilou/The Independent 5/24 Angela Christofilou/The Independent 6/24 Angela Christofilou/The Independent 7/24 Angela Christofilou/The Independent 8/24 Angela Christofilou/The Independent 9/24 Angela Christofilou/The Independent 10/24 Angela Christofilou/The Independent 11/24 Angela Christofilou/The Independent 12/24 Angela Christofilou/The Independent 13/24 Angela Christofilou/The Independent 14/24 Angela Christofilou/The Independent 15/24 Angela Christofilou/The Independent 16/24 Angela Christofilou/The Independent 17/24 Angela Christofilou/The Independent 18/24 Angela Christofilou/The Independent 19/24 Angela Christofilou/The Independent 20/24 Angela Christofilou/The Independent 21/24 Angela Christofilou/The Independent 22/24 Angela Christofilou/The Independent 23/24 Angela Christofilou/The Independent 24/24 Angela Christofilou/The Independent 1/24 Angela Christofilou/The Independent 2/24 Angela Christofilou/The Independent 3/24 Angela Christofilou/The Independent 4/24 Angela Christofilou/The Independent 5/24 Angela Christofilou/The Independent 6/24 Angela Christofilou/The Independent 7/24 Angela Christofilou/The Independent 8/24 Angela Christofilou/The Independent 9/24 Angela Christofilou/The Independent 10/24 Angela Christofilou/The Independent 11/24 Angela Christofilou/The Independent 12/24 Angela Christofilou/The Independent 13/24 Angela Christofilou/The Independent 14/24 Angela Christofilou/The Independent 15/24 Angela Christofilou/The Independent 16/24 Angela Christofilou/The Independent 17/24 Angela Christofilou/The Independent 18/24 Angela Christofilou/The Independent 19/24 Angela Christofilou/The Independent 20/24 Angela Christofilou/The Independent 21/24 Angela Christofilou/The Independent 22/24 Angela Christofilou/The Independent 23/24 Angela Christofilou/The Independent 24/24 Angela Christofilou/The Independent\n\nLabour MP David Lammy, a leading supporter of the People’s Vote campaign, said the poll showed that “the will of the people is changing” and voters are turning against “Johnson and the hard-right elite that has taken over the Conservative Party”.\n\nTo mark 10 days before the crucial march, People’s Vote have launched a video entitled I am Will, depicting people from all over the British Isles telling Mr Johnson that he and the “privileged elite” around him do not speak for them.\n\nReleased on YouTube and due to be spread across the country via social media, the film shows clips of Johnson, Michael Gove and Jacob Rees-Mogg declaring that Brexit is “the will of the people”, only to be interrupted by a voter asking: “Who is this Will guy?”\n\nA multi-cultural, multi-generational cast of people from all over the country respond: “I’m Will… I voted Remain… I voted Leave… I’m not a Remoaner… I’m not a Brexiteer… I’m British… I’m European… and I’m proud of it.”\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nFurther faces state that they “are fed up of being lied to”, “just want to talk about something else”, “want to keep the country together” and “don’t trust any of them”, before the film ends with a bellowed: “I just want to be heard.”\n\nA People’s Vote spokesman said the clip showed “people from all over the British Isles: young and old; those who voted Leave and those who want to Stay; people of all political parties and none”.\n\nThe spokesman added: “Each of them has a different view on Brexit, but all are united by the conviction that Johnson and the privileged elite that surrounds him do not speak for them.”\n\nMr Lammy added: “Boris Johnson's Brexit is not about what's best for this country, it's about what's best for him. He has surrounded himself with a small, privileged cabal of advisors in Downing Street who are focused on clinging to power at all costs.\n\n“They have an extreme and ideological vision for our country which would see lower taxes for the rich, lower wages for the poor and lower standards of environmental protection for all.\n\n“Johnson and the hard-right elite that has taken over the Conservative Party are trying to force a Brexit on us that will leave people and the country poorer.\n\n“It is little wonder that the will of the people is changing. Confronted with the reality of Boris Johnson's destructive Brexit, more voters than ever before now say that the only way to solve this mess is to put the question back to the people.\n\n“That’s why I’ll be marching in London on 19 October. To stand up against a reckless, extreme Brexit, to show that the will of the people is on the move and demand that our voices are heard.”", "description": "Campaigners for a second EU referendum are turning Leavers’ own slogan against them by telling Boris Johnson that the Brexit he wants to deliver is not “the will of the people”.", "authors": ["Andrew Woodcock"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/01/13/brexit-signs.jpg", "published_at": "2019-10-09"}