{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/20/uk-police-tell-public-report-hateful-behaviour-even-if-it-isnt-a-crime-you-dont-even-need-evidence", "downloaded_at": "2019-10-20 23:23:47.308488+00:00", "title": "UK Police: Report Hate 'Even If It's Not a Crime', 'You Don't Need Evidence'", "language": "en", "text": "British police have marked “Hate Crime Awareness Week” with a series of childish online cartoons urging the public to report “hateful” behaviour “even if it isn’t a crime”, offering assurances that “you don’t even need evidence”.\n\nThe cartoons, featuring exclusively white racists targeting non-white people, women in hijabs, and so on, were shared over the course of the week by Devon and Cornwall Police — which was recently exposed as having had to sack a number of constables, special constables, community support officers, and support staff for sexual misconduct.\n\nThe cartoons appeared to be aimed at people of limited intelligence, with one featuring a woman with a North American accent narrating an angry white man going into a greengrocer and becoming enraged by an apple placed among other fruit.\n\n“This is John. John doesn’t like apples and seeing them sold with other fruits upsets him,” she explains, as John first shouts at the fruit and then physically attacks it.\n\n“This behaviour seems ridiculous, but would it be any stranger like this?” she asks, cutting to John screaming at the shopkeeper “because he is black”.\n\nThe cartoon also shows a white man ripping off a Muslim woman’s hijab and punching her to the ground, and an elderly white driver refusing to let the black shopkeeper from before board a bus.\n\n“If you observe or experience any threatening or hateful behaviour, even if it isn’t a crime, you should contact the police,” the narrator instructs.\n\nAnother cartoon shows a blonde-haired, blue-eyed white girl at a kindergarten — which do not exist in Britain’s mainstream education system — approaching a boy of Middle Eastern appearance and telling him, “stop playing with those [toys], you’re going to make the toys dirty like your skin” in a strange accent, prompting him to burst into tears.\n\nThe girl then explains to her concerned teacher that her father “says that we should not play with people like him because they are different.”\n\nSupporting Hate Crime Awareness Week. Embracing each other’s differences regardless of race.#ZeroTolerance2Hate#NationalHCAW pic.twitter.com/7FccTILzEz — DevonCornwall Police (@DC_Police) October 14, 2019\n\nStill another cartoon shows a computer-generated blob person who is sad after receiving “hateful messages” such as “Your shade of blue makes me feel sick!” and “You’re so gay and annoying”.\n\nThe blob person is then helpfully informed by a disembodied voice that “there are so many ways to report a hate crime, and you don’t even need evidence!”\n\nSupporting Hate Crime Awareness Week If you are a victim of a hate crime, please report it to us#ZeroTolerance2Hate#NationalHCAW pic.twitter.com/5MNiGj603F — DevonCornwall Police (@DC_Police) October 17, 2019\n\nNot all the cartoons are race-themed, however, with one focusing on a tomato person going to a nightclub, who is laughed at by the aubergine and broccoli bouncers because their ID card shows they have changed “gender” from fruit to vegetable and back again several times before settling on “N/A”.\n\nThe tomato person leaves the nightclub in despair after not being able to decide whether to use the restroom for fruits or the restroom for vegetables, only to discover a lemon person spraypainting “Tomatoes Aint No Fruit” on an alley wall.\n\nThe tomato person then calls the police, receiving help from a blueberry officer with a mustache and a helmet bearing a rainbow badge.\n\nThe fact that Devon and Cornwall Police only featured white people being racist hints that they (or their videomakers) may be inclined to agree with left-wing academics who believe it is not possible to be racist towards white people, because racism requires “power plus privilege” and — according to this worldview — only white people have those things.\n\nBut this is not the legal position in Britain, and racially-aggravated crimes against white people are supposed to be treated as such — indeed, the left-wing press had to report official research showing that a majority of recorded race attack victims were white as long ago as 1999.\n\nAnti-white hate crime is likely undercharged, however, as, for example, the courts have resisted treating the industrial-scale sexual grooming and rape of mostly white girls by mostly Muslim men of Pakistani heritage as racially aggravated.\n\nA recent case in which a teenager had his hand cut off in Rochdale by a mob which abused him and three others as “white bastards” who were in their “country” was also not treated as racially aggravated — suggesting that the bar for authorities to concede that crimes against white people are racist is set rather high.\n\nAsian grooming gang's rape of white girls not racist, rules judge https://t.co/N25zaelwV3 — The Telegraph (@Telegraph) September 5, 2017\n\nFollow Jack Montgomery on Twitter: @JackBMontgomery", "description": "Police marked \"Hate Crime Awareness Week\" with cartoons urging the public to report \"hateful\" behaviour \"even if it isn't a crime\".", "authors": ["Jack Montgomery"], "top_image": "https://media.breitbart.com/media/2019/10/Police-640x335.png", "published_at": "2019-10-20"}