{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/11/senators-hit-facebook-censoring-pro-life-group", "downloaded_at": "2019-09-12 11:38:35.025801+00:00", "title": "Senators hit Facebook for censoring pro-life group", "language": "en", "text": "Four Senate Republicans are calling on Facebook to stop censoring a pro-life group that says abortions are never medically necessary.\n\nIn a letter Wednesday to Facebook CEO Mark Zuckerberg, Sens. Josh Hawley of Missouri, Ted Cruz of Texas, Kevin Cramer of North Dakota and Mike Braun of Indiana accuse the social network of a “pattern of censorship” that “reared its ugly head” over pro-life group Live Action’s assertions about abortions being unnecessary medically.\n\nFacebook declared Live Action’s claim to be “false,” the senators wrote, noting that the belief that abortion is never necessary is a “widely held view” and adding that any censorship of that claim proves that Facebook fact-checkers are biased against conservatives.\n\nFacebook did not respond to repeated calls for comment.\n\nEnforcing its “false” rating, Facebook stopped Live Action and its founder, Lila Rose, from advertising and promoting its content on the website, according to the letter. Facebook also notified users they had received “false” content.\n\n“This so-called factcheck came as part of a Facebook initiative to combat false news involving partnerships with groups like The Associated Press, Factcheck.org, PolitiFact, and others,” the letter reads.\n\nPublicists for Live Action told media outlets nearly two weeks ago that the group had been “silenced” by Facebook on Aug. 30.\n\n“With thousands of OB-GYN’s and medical professionals on the record agreeing with us that the direct killing of a child is never medically necessary, it is telling that Facebook decided to fact-check our information, which we have posted about for over three years, using two abortionists for their sourcing,” Ms. Rose wrote.\n\nIn response to a request for comment, a spokeswoman for the American College of Obstetricians and Gynecologists, a leading medical organization with nearly 60,000 members, pointed to a statement regarding the necessity for access to abortion dating to 2014.\n\n“Many factors influence or necessitate a woman’s decision to have an abortion,” says the statement, noting that health concerns like placental abruption, eclampsia and cardiac arrest “may be so severe that an abortion is the only measure to preserve a woman’s health or save her life.”\n\nThe senators’ letter cites the American Association of Pro-Life Obstetricians and Gynecologists, a professional group with nearly 5,000 members, which says that even in late-term pregnancies “where the mother’s life actually is in danger,” doctors cannot provide abortions “because an abortion typically is a two- to three-day process.” Instead, “immediate delivery is needed” and can be done via labor induction or C-section, the group says.\n\nThe senators say Facebook relied on testimony from two pro-choice activists to contribute to its so-called Independent Fact Check and called for an external audit.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Four Senate Republicans are calling on Facebook to stop censoring a pro-life group that says abortions are never medically necessary.", "authors": ["The Washington Times Http", "Christopher Vondracek"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/07/24/facebook-ftc_67114_c0-0-3716-2166_s1770x1032.jpg?d3216ad3a3faa7b7ea6d9ca7ae987154d13170a9", "published_at": "2019-09-11"}