{"pub": "independent", "url": "https://independent.co.uk/voices/brexit-deal-vote-latest-boris-johnson-letwin-amendment-final-say-march-a9162666.html", "downloaded_at": "2019-10-19 11:36:23.071258+00:00", "title": "If Brexit was a drug trial, scientists like me would have stopped it by now", "language": "en", "text": "Today is proving to be one of the most dramatic days in modern British history. As MPs are called into parliament to vote upon a hurried last-minute Brexit deal, hundreds of thousands of protesters are thronging the streets around Parliament Square calling on those MPs for a People’s Vote. How did our nation get to this point, where we need mass demonstrations to advocate for simple democratic processes?\n\nA week before the Brexit vote on 23 June 2016, I wrote two plans: one plan for what my campaign, Scientists for EU, does in the event of a win, and one for what to do in the event of a loss. As it turned out, I had to tear up the plan I was hoping for and go to the more painful one. I felt it my duty, in the event of loss, to do two things – to identify and vocalise the immediate damage the Brexit vote brought UK science, so that we could address it, and to put together a positive proposal for how an ideal post-Brexit UK-EU science relationship could look.\n\nShape Created with Sketch. Brexit and climate protests at Labour party conference: In pictures Show all 12 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Brexit and climate protests at Labour party conference: In pictures 1/12 Labour leader Jeremy Corbyn walks past anti-Brexit campaigner on the second day of the party conference in Brighton AFP/Getty 2/12 A protester holds a sign mocking Labour leader Jeremy Corbyn's Brexit stance at the party conference in Brighton EPA 3/12 Activists from anti-climate change movement Extinction Rebellion march on the Labour conference in Brighton AFP/Getty 4/12 Delegates take part in an informal vote on Labour's Brexitr stance at the party conference in Brighton AFP/Getty 5/12 Shadow foreign secretary Emily Thornberry leads a march in support of a second referendum on Brexit Getty 6/12 Anti-Brexit protesters take part in a People's Vote rally during the Labour party conference in Brighton EPA 7/12 Extinction RebelliActivists from anti-climate change movement Extinction Rebellion march on the Labour conference in Brightonon EPA 8/12 Extinction Rebellion activists march on the Labour conference in Brighton AFP/Getty 9/12 A delegate arrives carrying a briefing from the Labour Representation Committee to the Labour party conference in Brighton Getty 10/12 Prominent anti-Brexit campaigner Steve Bray protests on Brighton beach during the Labour party conference Reuters 11/12 Anti-Brexit protesters take part in a People's Vote rally during the Labour party conference in Brighton EPA 12/12 Activists raise a banner calling for the Labour party to restore the original Clause 4 of its constitution, which would pledge the party to nationalising all industry Getty 1/12 Labour leader Jeremy Corbyn walks past anti-Brexit campaigner on the second day of the party conference in Brighton AFP/Getty 2/12 A protester holds a sign mocking Labour leader Jeremy Corbyn's Brexit stance at the party conference in Brighton EPA 3/12 Activists from anti-climate change movement Extinction Rebellion march on the Labour conference in Brighton AFP/Getty 4/12 Delegates take part in an informal vote on Labour's Brexitr stance at the party conference in Brighton AFP/Getty 5/12 Shadow foreign secretary Emily Thornberry leads a march in support of a second referendum on Brexit Getty 6/12 Anti-Brexit protesters take part in a People's Vote rally during the Labour party conference in Brighton EPA 7/12 Extinction RebelliActivists from anti-climate change movement Extinction Rebellion march on the Labour conference in Brightonon EPA 8/12 Extinction Rebellion activists march on the Labour conference in Brighton AFP/Getty 9/12 A delegate arrives carrying a briefing from the Labour Representation Committee to the Labour party conference in Brighton Getty 10/12 Prominent anti-Brexit campaigner Steve Bray protests on Brighton beach during the Labour party conference Reuters 11/12 Anti-Brexit protesters take part in a People's Vote rally during the Labour party conference in Brighton EPA 12/12 Activists raise a banner calling for the Labour party to restore the original Clause 4 of its constitution, which would pledge the party to nationalising all industry Getty\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nYet I always maintained that, if the public did not like what emerged from Brexit, they absolutely retained the right to pull the plug on it. If those who drove Brexit won by an inch then tried to take a mile, the public retained the right to say no and prevent abuse of power.\n\nIf you buy a product and then find it to be broken, you have the right to return it after you’ve already purchased it. If you shake hands on a deal, then find new information in the small print of the contract, you do not have to sign on the dotted line. If you’re a scientist running a clinical trial and discover the drug to be dangerous to the patients, you can – and should – stop the experiment.\n\nSo if the public votes for a policy and then, three years later, realises it to be detrimental to their country and their livelihoods, they must have the right to call its legitimacy into question. To paraphrase Tony Benn, you should ask of any policy “How do we get rid of you?” in order to determine whether it is truly under democratic control.\n\nIn the current situation, how do we get rid of any Brexit solution if it doesn’t have “the will of the people” providing a mandate?\n\nHere is the crux of the matter: if the Brexit written down on paper in 2019 matches the Brexit promises of 2016, then all those that voted for it in 2016 would sign off on its 2019 manifestation. That’s a majority available right there, before you count in all those Remainers or new voters that would say “fair enough”. Yet such a sign-off is being withheld. Ask yourself why this is – particularly given that figures such as Jacob Rees-Mogg and the Vote Leave campaign have both proposed the idea of a second, confirmatory referendum before.\n\nI know many people are disillusioned with politics and wary of a second referendum. However, I’ll go beyond saying that it is a basic right of the public to have a People’s Vote – it is also a responsibility. Brexit entered our parliament as a demand from the public, it should leave our parliament in a form agreed by the public. If we, the public, vote on a matter so fundamentally complex that opens up dozens of messy corollary questions, then we the public need to stay with the process and take responsibility for it at its end.\n\nUltimately, a claim was made three years ago that the UK held all the cards and could negotiate for our country a better place than with have with our current deal. Now that the negotiation is done, let us put that to jury of public opinion. That is why I’ll be marching for a People’s Vote on Saturday.\n\nDr Mike Galsworthy is director of Scientists for EU", "description": "Today is proving to be one of the most dramatic days in modern British history. As MPs are called into parliament to vote upon a hurried last-minute Brexit deal, hundreds of thousands of protesters are thronging the streets around Parliament Square calling on those MPs for a People’s Vote. How did our nation get to this point, where we need mass demonstrations to advocate for", "authors": ["Mike Galsworthy"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/03/23/14/Alamy-Live-Peoples-Vote-March-London-UK-T14136.jpg", "published_at": "2019-10-19"}