{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-bodies/thirty-nine-victims-found-dead-in-truck-near-london-were-chinese-idUKKBN1X30O6", "downloaded_at": "2019-10-24 14:15:26.501106+00:00", "title": "Thirty-nine victims found dead in truck near London were Chinese", "language": "en", "text": "LONDON (Reuters) - The 39 people found dead in the back of a truck near London are believed to be Chinese nationals, police said on Thursday, as they questioned the driver detained on suspicion of murder.\n\nParamedics and police found the 31 men and eight women’s bodies on Wednesday in a truck container on an industrial estate at Grays, about 20 miles (32 km) east of the British capital.\n\nFor years, illegal immigrants have attempted to reach Britain stowed away in trucks, often from the European mainland. In the biggest tragedy, 58 Chinese were found dead in a tomato truck in 2000 at the port of Dover.\n\n“We read with heavy heart the reports about the death of 39 people in Essex, England,” the Chinese embassy said in a statement, adding further clarification was being sought with police.\n\nEssex police said their priority was ensuring dignity for the victims during their inquiry.\n\n“Each of the 39 people must undergo a full coroner’s process to establish a cause of death before we move on to attempting to identify each individual within the trailer,” police added in a statement, saying that would be a time-consuming operation.\n\n“We might not have all the answers straight away.”\n\nPolice have identified the truck driver as a 25-year-old man from Northern Ireland and have searched three properties there as part of the investigation.\n\nA source familiar with the investigation identified the man as Mo Robinson from the Portadown area of the British province.\n\nThe trailer part of the truck arrived at Purfleet docks in Essex, southern England, having come from the Belgian port of Zeebrugge - as did the vehicle involved in 2000.\n\nFlowers are seen at the scene where bodies were discovered in a lorry container, in Grays, Essex, Britain October 24, 2019. REUTERS/Simon Dawson\n\nIts red cab unit, which had “Ireland” emblazoned on the windscreen along with the message “The Ultimate Dream, entered Britain via Holyhead in north Wales, having started its journey in Dublin, police said.\n\n“APPALLING CRIME”\n\nThe discovery of the bodies was made at 1.40 a.m. just over an hour after the container arrived in Purfleet, not far from the industrial estate in Grays.\n\nThe vehicle has now been moved to a secure site at nearby Tilbury Docks where forensic work can take place.\n\nThe National Crime Agency, which targets serious and organised crime, said it was helping the investigation and working urgently to identify any gangs potentially involved.\n\nShaun Sawyer, national spokesman for British police on human trafficking, said thousands of people were seeking to come to the United Kingdom illegally. While they were able to rescue many of those smuggled in, Britain was perceived by organised crime as a potentially easy target for traffickers.\n\nSlideshow (7 Images)\n\n“You can’t turn the United Kingdom into a fortress. We have to accept that we have permeable borders,” he told BBC radio.\n\nThe head of the Road Haulage Association said traffickers were “upping their game” and closer cooperation with fellow European nations was needed, albeit that may be complicated by Britain’s potential exit from the European Union.\n\n“There is simply not enough being done in terms of security, in terms of the protection of vehicles across Europe,” Richard Burnett told BBC TV.", "description": "The 39 people found dead in the back of a truck near London are believed to be Chinese nationals, police said on Thursday, as they questioned the driver detained on suspicion of murder.", "authors": ["Alistair Smout", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191024&t=2&i=1444507890&w=1200&r=LYNXMPEF9N178", "published_at": "2019-10-24"}