{"pub": "reuters", "url": "https://in.reuters.com/article/hongkong-protests-zara/fashion-brand-zara-seeks-to-distance-itself-from-hong-kong-controversy-idINKCN1VO0HL", "downloaded_at": "2019-09-05 10:32:08.276356+00:00", "title": "Fashion brand Zara seeks to distance itself from Hong Kong controversy", "language": "en", "text": "BEIJING/MADRID (Reuters) - Spanish fashion brand Zara, seeking to avoid becoming embroiled in controversy over protests in Hong Kong, issued a statement on Chinese social media expressing support for China’s sovereignty over the Asian financial hub.\n\nZara, owned by the world’s biggest clothing retailer Inditex, made its statement late on Monday after Hong Kong newspaper Ming Pao asked if closure of four Hong Kong Zara stores on Monday was in support of a student strike, prompting comment from millions of mainland social media users.\n\nZara said in its statement on China’s Weibo social media platform that it supported the “one country, two systems” policy under which China rules Hong Kong and said it had not supported strikes.\n\nThe brand became a top trending topic on Weibo, with one hashtag “Zara statement” viewed more than 170 million times as of Tuesday morning.\n\nA source close to Inditex said on Tuesday that some Zara stores in Hong Kong had been forced to delay opening on Monday because staff had trouble getting to work due to transport problems linked to the protests, but that all Zara stores in Hong Kong opened eventually on Monday.\n\nThousands of Hong Kong university and school students boycotted class on Monday and rallied peacefully for democracy, following a weekend marred by some of the worst violence since unrest escalated more than three months ago.\n\nShops in Hong Kong have often shut their doors when protests are taking place nearby.\n\nForeign brands are under increasing pressure from Chinese consumers and regulators to fall into line on contentious issues around Chinese sovereignty and its territorial claims.\n\nInditex has hundreds of stores in China including other fashion brands like Massimo Dutti and Bershka alongside Zara. China is second only to domestic market Spain in number of stores for the retailer.\n\nThe logo of the Zara store is seen in a mall at Vina del Mar, Chile July 14, 2019. REUTERS/Rodrigo Garrido/Files\n\nMany Western fashion brands have been forced to clarify their positions on Chinese sovereignty as the Hong Kong protests fuel nationalist fervour on social media.\n\nLast month, a number of Chinese brand ambassadors of fashion labels from Coach to Givenchy severed ties with the companies over products which they said violated China’s sovereignty by identifying Hong Kong and Taiwan as countries.\n\nLast year, Zara was criticised on Chinese social media for placing Taiwan, a self-ruled island that China sees as a break-away province, in a pull-down list of countries on its Chinese website.", "description": "Spanish fashion brand Zara, seeking to avoid becoming embroiled in controversy over protests in Hong Kong, issued a statement on Chinese social media expressing support for China's sovereignty over the Asian financial hub.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190903&t=2&i=1425647000&w=1200&r=LYNXNPEF820G7", "published_at": "2019-09-05"}