{"pub": "yahoo", "url": "https://sports.yahoo.com/what-to-carenot-care-about-from-week-5-cowboys-face-questions-after-faltering-against-contending-packers-040742725.html", "downloaded_at": "2019-10-07 12:16:52.866283+00:00", "title": "What to care/not care about from Week 5: Cowboys face questions after faltering against contending Packers", "language": "en", "text": "So much happens on any given Sunday in the NFL. It’s hard to keep track of it all. More importantly, it’s quite a lot to decide what we should value as signal and what we should just ignore as noise. In this space, I’ll go through all that we learned this week and give you the five things I care about coming out of Week 5, along with five things I can’t muster up the emotional energy to care for. Good news for you: We’re going to do this exercise in emotional turmoil every Sunday of the regular season.\n\n5 Things I care about\n\nCowboys lose to another NFC contender\n\nScroll to continue with content Ad\n\nThrough the first three weeks of the NFL season, I was ready to take a first-row seat on the Dallas Cowboys bandwagon. The offense looked clearly revolutionized under new coordinator Kellen Moore and newfound playmakers like Michael Gallup were jumping into a new tier. Dak Prescott straight up looked like an MVP candidate.\n\nThe last two weeks, the team looked all too much like the familiar Cowboys of 2017 to 2018. The Saints’ loss was more than troubling on offense. The first half looked much of the same in Week 5 against the Packers but did they did come alive in catchup mode.\n\nPrescott offered up his fair share of mistakes but made some truly unreal throws to Gallup and Amari Cooper. We’re talking pinpoint, peak arm-talent throws. He had to make several on the move because an offensive line that played much of the final two quarters without its starting tackles (Tyron Smith was inactive, La’el Collins hurt mid-game) didn’t have a shot to slow down the Green Bay pass rush. The starting Cowboys receivers each handled 14 targets and combined for 19 receptions for 339 yards and two touchdowns.\n\nGreat passing game stats just weren't enough to help the Cowboys beat a quality opponent. (Photo by Richard Rodriguez/Getty Images)\n\nStory continues\n\nThat’s excellent for fantasy but Dallas officially has some questions to answer. If you’re a great team, you’re supposed to trounce bad squads. Box checked. Dallas had that part down. However, you just can’t appear so undermanned against your fellow contenders. Coming off two straight losses to clear top-level teams like New Orleans and Green Bay, the Cowboys will have to hear the word “pretender” whispered at them from talking heads throughout the football universe.\n\nWeek 6 won’t provide much of a test to that label, as the Cowboys draw a matchup against an uncompetitive Jets team. We don’t get to test Dallas’ fortitude until Week 7 when they face the similarly 3-2 Eagles on Sunday Night Football. The Cowboys have a great roster with depth and high-end talent on both sides of the ball. We need to see that shine through for a full four quarters against a quality opponent. For now, it’s time to at least slow down the hype train we geared up for in September.\n\nThe Falcons are what we thought — and give Texans a boost\n\nThe moveable force came to duel with the all-too stoppable force. Houston has a clear and present weakness on the offensive line. Everyone knows it; everyone hammers the point home. The Falcons surely were aware of it but they sure as hell couldn’t do anything about it.\n\nAtlanta didn’t drop Deshaun Watson for a single sack on Sunday. To their somewhat credit: Watson escaped some close calls today, as he’s wont to do. He made one particular maneuver to get free after a quick pressure from Grady Jarrett in the red zone that kept the drive rolling and led to a touchdown on the following play. Watson’s performance today was a reminder of why he’s one of the transcendent stars of the league\n\nThe lack of pressure around Watson allowed him to sit back and pick apart a Falcons secondary that has looked downright unprepared all season. One player notably reaped the benefits. It was as if Atlanta was operating the same way as itchy fantasy managers who dropped Will Fuller coming into Week 5. Just look at the box scores, forget he exists and not see the signs that an eruption game was coming.\n\nFuller was 12th in the NFL in air yards and had an average depth of target over 17 through the first four weeks. Watson had just missed him for a few game-changing gainers. He didn’t miss much on Sunday. Fuller paced the Texans with 16 targets, catching 14 for 217 yards and three scores. His fellow receivers finished well behind him for second in the pecking order with eight looks, going 7-88 on the day. Atlanta left Fuller too many singled-up chances but a receiver throwing up those numbers is also clearly creating his own chances. Both things can be true.\n\nHouston reminded us of what a dangerous offensive team they can be when operating in peak form. Fantasy managers are certainly miffed about Hopkins’ fourth-straight slow game but it’s the sign of a healthy offense when the No. 1 doesn’t have to carry the full burden in a winning effort. The Texans can throw waves of weapons at you, and that presents challenges even teams with far better stop units than Atlanta will struggle to handle.\n\nFor Atlanta, they look like a team headed for a full-on reboot. Next week this hapless defense gets Kyler Murray and a Cardinals team coming off their first win. If Christian Kirk returns, he could follow the same path Fuller took to a big game in Week 6.\n\nPittsburgh’s front seven\n\nThe Steelers defense started off the year on a low note. The Patriots absolutely worked them in Week 1 with a dominant performance. Russell Wilson found plenty of the same holes the following Sunday, completing 83 percent of his passes at 8.6 yards per attempt and scoring three times.\n\nSince then, Pittsburgh’s stop unit has started to tighten up. The defense secured five turnovers in a loss to the 49ers, trounced the lost-at-sea division-rival Bengals last Monday and forced Lamar Jackson into mistakes in an overtime defeat here in Week 5.\n\nWhile the Steelers still have some holes in the secondary even after the addition of Minkah Fitzpatrick, they’re making up for it in the front seven. Down linemen, Stephon Tuitt and Cameron Heyward, are both having fantastic years. T.J. Watt might be having his best season and fellow rusher Bud Dupree isn’t playing like a slouch. Pittsburgh came into the week ranked top-five in sacks. They tacked on five more against Lamar Jackson and forced him into three picks.\n\nIt looked like Pittsburgh was going to be a team to attack with passing games all season. It appears we need to adjust expectations. The pass rush is keeping the Steelers outside of the NFL’s cellar. A competitive and aggressive pass rush can keep games close, which their stymied offense truly needs.\n\nTeddy Bridgewater’s best game in years\n\nFew observers have pushed to see more out of Teddy Bridgewater than I have since he came in for Drew Brees in Week 2. He looked every bit like a caretaker in his role as the Saints starting quarterback. He kept the team afloat but was far down the list of reasons they were winning. Few quarterbacks were playing as close to the vest as Bridgewater.\n\nWith all that said, it’s time to credit Teddy Bridgewater for an outstanding, elevating-type performance here in Week 5. He chucked four touchdowns, cleared 300 yards and completed 77% of his passes. More notably, his 7.3 intended air yards per attempt (per Next Gen Stats) was a marked improvement over what he was doing in the games prior.\n\nWhat’s really important? He looked more like the old Teddy Bridgewater. His natural feel for the game and decisiveness without sacrificing flavor were out on full display. Even Saints defensive tackle and fellow former Louisville alum Sheldon Rankins saw the Teddy of old today. To me, we haven’t seen this version of Bridgewater since before his devastating injury.\n\n\"That was the Teddy I went to school with.\" Sheldon Rankins — Rod Walker (@RodWalkerNola) October 6, 2019\n\nDrew Brees posted a video of himself throwing footballs this weekend. He could be back soon and he’ll return to a 4-1 operation that’s been without him for most of this season. Bridgewater completed his task. He’s done his job, he’s run his race. He may never be another team’s answer at the quarterback position but he has a longterm future in this league. Coming off today’s pristine performance, that’s where I feel like focusing my attention.\n\nPatrick Mahomes’ ankle\n\nThrough the first half of action, Patrick Mahomes was offering up several classic dominant plays. He looked like one of the transcendent stars of the game.\n\nThings changed as the game wore on and hits mounted to his dinged-up ankle. Even as he got the ball back late in the game, it felt like a task a mere mortal could not handle in slaying the Colts, who were up by multiple scores. I am on record saying Mahomes is not a mere mortal. Yet, even a passing deity can have his wings clipped and that’s sadly what he felt like to me after one of his own linemen delivered an accidental collision to that ankle.\n\nThe NFL is worse without Patrick Mahomes. He’s been as clear an elevating force in fantasy as anyone in the league through his first two starting seasons. So, yeah — I care about tracking this injury.\n\n5 Things I don’t care about\n\nAaron Rodgers not being the engine for the Packers\n\nThe Packers look like a damn good team, perhaps one of the two or three best in the NFC. I don’t care one bit that for much of their 4-1 start, Aaron Rodgers has been a cog in the machine, rather than the engine all by himself.\n\nRodgers didn’t throw a touchdown today and it didn’t matter for the Packers. Electric running back Aaron Jones more than matched counterpart Ezekiel Elliott by clearing 100 yards and scoring four touchdowns on the ground. Unlike Dallas’ offense across the way, the Packers defense cemented their status as a truly transformed unit by undressing a quality opponent. Za’Darius Smith looked like a man on a mission after catching weird heat (below) from Ray Lewis.\n\nYes, it’s well past time to adjust expectations for Rodgers in fantasy. He’s not a clear-cut every week fantasy QB1 as he’s been for so many years. And all in all, I don’t care. The Packers have so much more personality and intrigue as this version of themselves. Frankly, they look like they’re in a much better position to help Rodgers contend for a second Super Bowl ring in this iteration. We should all be thankful for that after what he’s played in the last few seasons.\n\nMike Evans preseason expectations\n\nMike Evans was a consensus Top-12 wide receiver in fantasy football drafts this summer. Ask just about anyone and they’d tell you he was the consensus No. 1 wide receiver in Tampa Bay and a lock for top-level volume. That just doesn’t look like a viable possible outcome based on what we’ve seen so far this season.\n\nAt worst, in the absolute most generous possible way of putting it: Chris Godwin is the 1B receiver in this offense. Again, that is the absolute most generous way of putting it.\n\nThrough five games, Evans is averaging 7.6 targets per game, fewer than at any year of his career. His zero-catch performance today was a low-point but Evans has been a volatile player all season. We could see a shift at any moment but through five games, we have no evidence whatsoever to make us believe Evans will suddenly become a clear target hog in this passing game.\n\nYou don’t even have to believe that Godwin is better or more talented than Evans to accept this as reality. One must only accept two simple truths. To start, Godwin is clearly a complete and total baller. There isn’t much on the wide receiver job description he can’t complete with proficiency. Even more important for the accumulation of production, Godwin has a juicier role. He plays in the slot on over 60% of his snaps. While Evans runs downfield routes exclusively as an X-receiver against press coverage, Godwin gets more layup routes. Jameis Winston sees that often during games and keeps finding Godwin. We see this happen with wide receiver corps all the time; think of the Vikings duo as another example.\n\nAll in all, it’s time to accept a new reality in Tampa Bay. Everything about Godwin’s breakout is legitimate. Evans’ path to production has changed as a result.\n\nCiting the Eagles’ sack totals coming into Week 5 anymore\n\nThe Eagles had full-on pressure to sacks-progression come into play against the hapless Jets in Week 5. Coming into Sunday’s blowout win, Philadelphia had just three sacks on the year, the fewest in the league. They’ll rocket up the list after this performance, as they dropped Luke Falk 10 times.\n\nWhile it’s clear the Eagles have major issues covering on the backend — that’s showed up when they’ve played real NFL teams — they have the talent to take down the passer. Coming into Week 5 two Eagles players ranked inside the top-10 in pressures. A performance like this was due. Even with some of the depth compromised, especially on the interior, a front with stars like Brandon Graham and Fletcher Cox will get rolling.\n\nThe Jets have as problematic an offensive line as anyone in the league, which certainly contributed to Philly’s breakout defensive game. However, this was a legitimate performance by the 2017 Super Bowl champions. While the Eagles come with a secondary that fantasy managers will want to exploit, this pressure-filled afternoon should give you some pause. The Vikings passing game could be on tap for a second-straight get-right game in Week 6 as they welcome the Eagles. They will need an offensive line that let Kirk Cousins take three ill-timed sacks against the moribund Giants defensive line to hold up its end of the bargain.\n\nAny takes about D.J. Chark I had prior to Week 1\n\nThrough five weeks, no player has caught me off guard more than Jaguars receiver D.J. Chark. He didn’t catch my attention as a prospect. As such, he wasn’t a player on my radar to make a big impact in the Jacksonville receiving corps in 2019.\n\nDede Westbrook was coming off a 100-target season in 2018. Chris Conley was an intriguing addition after going underutilized in Kansas City. Even players like Marqise Lee and Keelan Cole had their moments in the sun in previous seasons. Chark was coming off a ho-hum 14-catch rookie campaign. As soon as the games started, he left them all in the dust.\n\nChark put an exclamation point on his breakout season with a 164-yard, two-score day against the tough Panthers pass defense. It was a stiff test to pass. However, all he did in Week 5 was continue to display all the attributes he’s shown in every game so far this year.\n\nChark gets loose in the vertical game. He creates separation on his own. It seems like he pulls down a tight ball in traffic every week. The Jaguars have what looks like a true No. 1 receiver on their hands. Good luck considering benching him in any fantasy matchup going forward.\n\nMarlon Mack’s injury\n\nRemember when Marlon Mack was a clear game-time decision coming off a bad fantasy game? Remember when he was about the riskiest possible play on the Week 5 slate? Nope. Me neither.\n\nMarlon Mack was highly questionable to suit up after dealing with an ankle injury leading up to the Colts matchup with the Chiefs. You wouldn’t have known it if you watched him play. After Indianapolis got even a slight lead on Kansas City in their own building, they put the rock in Marlon Mack’s hands and never looked back.\n\nMack was a warrior on Sunday night, handling 29 carries and racking up 132 yards on the ground while the Colts slowly drained the clock. It’s a thin-margin-for-error approach, but Mack kept his offense rolling with some hard-nose, physical football on the ground. They successfully played keep-away and limited Patrick Mahomes’ chances to hurt them.\n\nThere is no doubting that Mack is one of the running backs most susceptible to being dinged by game script. He just doesn’t have much of a passing role. It was unexpected but this ended up being the perfect setup for him to thrive. The Colts tough running backs get a bye week to fully rest up next Sunday and then get three straight games against the Texans, Broncos, and Steelers when the script should be close enough that Mack will have a shot at this type of outing again.\n\nListen to the Yahoo Fantasy Football Podcast", "description": "Matt Harmon runs through the five things he cares and doesn't care about from the Week 5 NFL Sunday action, including what we know about the Packers and Cowboys after their dustup in Dallas.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/J5G51oMNzQ0shsvTydYBjA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjkuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/okc2a7jEL.PRo7xklTqEIg--~B/aD0yNzE1O3c9Mzk5OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/0c5d6fa0-e8b7-11e9-9d2f-a72f054009b0", "published_at": "2019-10-07"}