{"pub": "yahoo", "url": "https://finance.yahoo.com/news/pays-compare-using-medicares-plan-202200924.html", "downloaded_at": "2019-10-18 07:07:55.054122+00:00", "title": "It Pays to Compare Using Medicare's New Plan Finder", "language": "en", "text": "Explore your options before the end of Open Enrollment\n\nMISSION, Kan., Oct. 17, 2019 /PRNewswire/ -- (Family Features) Medicare's Open Enrollment period gives everyone with Medicare the opportunity to review their options and decide whether they want to keep their current plan or make changes for coverage beginning Jan. 1, 2020. You can keep your current plan if you're happy with it, but you must make a selection between Oct. 15 and Dec. 7.\n\nIt Pays to Compare Using Medicare’s New Plan Finder More\n\nComparing plans pays. This is the one time of the year for you to review your current Medicare Advantage or Part D prescription coverage and see if you have better options based on changes to the current plans, your budget or your health needs.\n\nMedicare's most used tool, the Plan Finder, has a new look and features, making it easier to learn about and compare coverage options, shop for health and drug plans and feel confident choosing a plan that best meets your needs.\n\nPlan Finder provides a personalized experience through a mobile-friendly and easy-to-use design to help users learn about different options. The tool walks through the enrollment process from start to finish and allows users to view and compare Part D and many of the supplemental benefits that Medicare Advantage plans offer. It also features a star rating system which gives an overall rating of the plan's quality and performance for the types of services each plan offers.\n\nTake Action Before Open Enrollment Ends\n\nMedicare Open Enrollment ends Dec. 7. Now is the time to act if you want to enroll in or make changes to your Medicare health or prescription drug plan for coverage beginning Jan. 1, 2020. If your current coverage still meets your needs, you don't have to do anything. If you miss the Open Enrollment deadline, you will likely have to wait a full year before you are able to make changes to your Medicare coverage.\n\nFor more information, visit Medicare.gov or call 1-800-MEDICARE (1-800-633-4227). TTY users can call 1-877-486-2048. Help is available 24 hours a day, including weekends. If you need help in a language other than English or Spanish, let the customer service representative know the language. You can also create a MyMedicare.gov account to manage your personal information like medical conditions, allergies and implanted devices or sign up to get your \"Medicare Summary Notices\" (eMSNs) electronically.\n\nHelp in your community is available. Get personalized health insurance counseling at no cost to you from your State Health Insurance Assistance Program (SHIP). Visit shiptacenter.org or call 1-800-MEDICARE for your SHIP's phone number.\n\nMore information about Medicare is also available on the Medicare Facebook page and by following @MedicareGov on Twitter.\n\nGet Help Paying for Prescriptions\n\nAnyone who has Medicare can get prescription drug coverage. Some people with limited resources and income may also be able to get Extra Help to pay for monthly premiums, annual deductibles and prescription co-payments related to a Medicare prescription drug plan. If you have limited income and resources, you may qualify for Extra Help to pay for some health care and prescription drug costs.\n\nMedicare estimates more than 2 million people with Medicare may be eligible for Extra Help but aren't currently enrolled in the program. To qualify, your annual income must be less than $18,735 a year ($25,365 for married couples). Even if your annual income is higher, you may still qualify. Your resources must also be limited to $14,390 ($28,720 for married couples). Resources include bank accounts, stocks and bonds, but not your house, car or life insurance policies.\n\nStory continues", "description": "MISSION, Kan., Oct. 17, 2019 /PRNewswire/ -- (Family Features) Medicare's Open Enrollment period gives everyone with Medicare the opportunity to review their options and decide whether they want to keep their current plan or make changes for coverage beginning Jan. 1, 2020.  This is the one time", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/1LUDltZ8tK8NPsYi9o_Vzw--~B/aD0yNjc7dz00MDA7c209MTthcHBpZD15dGFjaHlvbg--/http://globalfinance.zenfs.com/en_us/Finance/US_AFTP_PRNEWSWIRE_LIVE/It_Pays_to_Compare_Using-5964bbdb73cfda6b45ae6bacf19f6de9", "published_at": "2019-10-17"}