{"pub": "reuters", "url": "https://in.reuters.com/article/nigeria-security/mercy-corps-suspends-northeast-nigeria-work-after-army-shuts-offices-idINKBN1WA32Y", "downloaded_at": "2019-09-25 23:32:04.925089+00:00", "title": "Mercy Corps suspends northeast Nigeria work after army shuts offices", "language": "en", "text": "LAGOS (Reuters) - International aid agency Mercy Corps on Wednesday suspended its operations in two northeastern Nigerian states worst hit by Islamist insurgents after the army closed four of its offices in the region, the organisation said.\n\nFILE PHOTO: People sit near a burnt house after an attack by suspected members of the Islamist Boko Haram insurgency in Bulabulin village, Nigeria November 1, 2018. REUTERS/Kolawole Adewale\n\nLast week the army closed the office of another international aid agency - Action Against Hunger - in the region after accusing it of aiding the Boko Haram and Islamic State armed groups, which the government says are terrorist organisations.\n\nMilitary restrictions on humanitarian operations in northeast Nigeria are unusual and were not previously seen during the insurgency, which dates back to 2009.\n\nIn a separate development on Wednesday, Action Against Hunger said a hostage had been executed by a group that was holding one of its employees, two drivers and three health ministry workers.\n\nIslamic State’s West Africa branch, which split from Boko Haram in 2016, had previously claimed responsibility for the July kidnapping of the six people. It has become the dominant insurgent group in the region over the last year.\n\nIn a sign of heightened tensions in the region, Islamic State said via its Amaq news agency late on Wednesday that it killed 14 Nigerian soldiers in Borno state in an ambush. The Nigerian army did not immediately respond to phone calls requesting comment.\n\nNortheast Nigeria has been blighted by a decade-long insurgency led by militant group Boko Haram that has killed 30,000 people and forced two million to flee their homes. The United Nations has said 7.1 million people in the region need assistance in one of the world’s worst humanitarian crises.\n\n“Mercy Corps is suspending operations in Borno and Yobe States, Nigeria, following the closure of four of our field offices by the Nigerian military,” said Amy Fairbairn, its head of media and communications, in a statement.\n\n“We have not yet received an official reason from the Nigerian authorities for the closure and we are seeking to work with them to resolve this as soon as possible,” said Fairbairn, adding that Mercy Corps’ work in other parts of Nigeria would continue uninterrupted.\n\nA military source and an aid worker at the organisation, both speaking on condition of anonymity, said the army closed the offices on Wednesday after troops said they had found 29 million naira ($94,771) in cash being transported in northeastern Borno state by a driver who said the money belonged to Mercy Corps.\n\n‘SUPER CAMPS’ STRATEGY\n\nTwo Nigerian military spokesmen did not immediately respond to phone calls and text messages seeking comment on the reason for the closure of Mercy Corps offices.\n\nBorno is the birthplace of the insurgency and the state worst hit, with attacks intensifying over the last year primarily carried out by Islamic State’s West Africa branch. Yobe state has also been badly hit by the conflict.\n\nThe hostages with ties to Action Against Hunger were abducted two months ago near the northeastern town of Damasak, in Borno.\n\n“Action Against Hunger condemns in the strongest terms this assassination and urgently calls for the release of the hostages,” the agency said in a statement.\n\nEdward Kallon, the United Nations humanitarian coordinator in Nigeria, said he was “appalled and deeply saddened” by the news of the killing.\n\n“I am also extremely concerned about the increasingly dangerous and restrictive operating environment for implementing humanitarian assistance in crisis-affected areas,” said Kallon.\n\nEarlier on Wednesday, lawmakers in the lower house of parliament passed a motion to review the way in which non-governmental organisations operate in Nigeria.\n\nThe aid agency closures and the killing come against the backdrop of a change in the military’s approach to the insurgency.\n\nNigerian soldiers have left many towns in the region under a new strategy of withdrawing to “super camps” that can be more easily defended against insurgents. Some security experts have expressed concerns that the areas vacated are being filled by insurgents, leaving civilians vulnerable.\n\nA few days after forcing the closure of Action Against Hunger offices last week, the army said it will require anyone moving through three northeastern states to carry identification cards in an effort to root out Islamists.", "description": "International aid agency Mercy Corps on Wednesday suspended its operations in two northeastern Nigerian states worst hit by Islamist insurgents after the army closed four of its offices in the region, the organisation said.", "authors": ["Alexis Akwagyiram", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190925&t=2&i=1433933350&w=1200&r=LYNXMPEF8O2BH", "published_at": "2019-09-25"}