{"pub": "politico", "url": "https://politico.com/agenda/story/2019/10/11/higher-education-college-001288", "downloaded_at": "2019-10-11 19:39:30.539760+00:00", "title": "Who’s afraid of accountability?", "language": "en", "text": "A generation ago, most parents knew how to provide an opportunity for their child: Send your kid to college. This was certainly true for me. I was raised in the 1980s by a single mother who worked in a factory in rural Indiana. For our family, college was not possible without Pell Grants and other financial aid. But my mother never doubted that her boys were going to college because she had an abiding belief that a college degree would give us a better life.\n\nSadly, that belief is no longer universal. A growing number of Americans have lost faith in our nation’s colleges and universities. Even though the degree remains among our most powerful levers for economic mobility, education consumers are struggling to see the value in an era of rising tuition and student loan debt. One recent survey found that less than half of Americans now believe that earning a bachelor’s degree will lead to higher earnings over their lifetime.\n\nDespite such stark data, colleges and universities have been slow to recognize and respond to this shift in public opinion. After all, individuals who earn a degree still have exponentially better economic outcomes. But the ivory tower is overlooking a reality that families cannot afford to ignore.\n\nNearly half of today’s students fail to graduate within six years. And in an era when students who start (but don’t finish) college are likely to default on their loans, going to school without earning a degree can leave students worse off than they would have been if they had failed to attend at all.\n\nThe challenge stems from the fact that the majority of institutions are, themselves, largely unaccountable to both policymakers and the public. More than half of students at four-year institutions and community colleges enroll in a school within 20 miles of their home. And despite decades of collecting and reporting on a multiplicity of educational metrics, precious little information is available—and accessible—in the sort of format we have grown accustomed to in every other facet of our digital lives.\n\nWhat’s worse, education is, in economic terms, a strange good, one that’s particularly hard to value properly. Education “consumers” might not know the return on their educational investments for years or, more likely, decades. Returns are, likewise, clouded by a confluence of forces, from individual effort to regional variations—not to mention the shifting imperatives of an increasingly dynamic labor market.\n\nMy friends and colleagues on the political right may ask why we need accountability measures at all in higher education. Why not let market forces shine a light on which programs are good and which are bad? It would seem like an easy solution to simply publish information about colleges and trust that students (and their families) will pick one that meets their financial needs and career goals.\n\nBut it is foolish to assume that government—or even institutions themselves—can provide the sort of information that students really need to assess the life-changing decision they are about to make. Facing up to that reality is the first step toward not just protecting consumers, but also implementing the sort of accountability measures that could help safeguard the $120 billion in federal student aid allocated each year.\n\nAs Congress works to rewrite the Higher Education Act, conservatives can and should demand stronger accountability for federal dollars—and for students who deserve better. We can do this in three ways.\n\nFirst, we must count all students. While transparency does not equal accountability, the federal government needs to do a better job of counting all students, including transfer and part-time students. Currently, these students’ outcomes tend to fall through the cracks. The government should produce robust data on outcomes by program at each school and make sure they reflect the experience of all students who matriculate.\n\nSecond, we must use measures that matter. The federal government conducts financial and compliance monitoring of institutions and accreditors re-up their quality checks every 10 years, but the few accountability metrics currently in place ask for very little when it comes to accountability. In order for institutions of higher education to be eligible for federal student aid, major compliance requirements should come on the front end. Congress should demand outcomes data on things that matter to students and taxpayers, like completion, earnings and loan repayment.\n\nFinally, we must hold institutions and programs accountable for the consequences of poor student debt outcomes. Congress’ and the Department of Education’s current measure, the “cohort default rate” (CDR), fails to truly hold institutions accountable. When the latest version of CDR took effect in 2014, just 21 of 6,000 eligible schools failed to meet the metric. A better approach would be to also measure how successful students are in paying down their debts, rather than just whether they default, and to examine this outcome by program of study, rather than solely the institution as a whole.\n\nAccountability and a focus on outcomes is not a novel or untested idea. The nation’s high school graduation rates have improved over the past decade in large part, because we started measuring outcomes more accurately—and the startlingly low graduation rates that we discovered led to policy changes that have driven positive reform.\n\nA similar reckoning has yet to take place within higher education. We must have greater accountability for our colleges and universities, and conservatives should lead the way in making this a reality.\n\nLuke Messer, a Republican, represented Indiana’s 6th Congressional District from 2013 to 2019 and served on the House Committee on Education and the Workforce. He’s now a lobbyist with Faegre Baker Daniels in Washington, D.C., and a board member of Higher Learning Advocates, a bipartisan education advocacy group.", "description": "The conservative case for better measures of success in higher education.", "authors": ["Jenny Hopkinson", "Arthur Allen", "Dan Diamond", "Darren Samuelsohn", "Michael Grunwald", "Megan Cassella", "Paul Demko", "Marianne Levine", "Nancy Scola", "Rachana Pradhan"], "top_image": "https://static.politico.com/5b/69/101c8b5e42a781bf70a976d2624f/191011-college-campus-gty-773.jpg", "published_at": "2019-10-11"}