{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/john-bolton-trump-criticism-kim-jong-un-north-korea-nuclear-weapons-a9127846.html", "downloaded_at": "2019-10-01 12:43:11.417634+00:00", "title": "John Bolton criticises Trump’s strategy with Kim Jong-un: ‘He will never give up nuclear weapons’", "language": "en", "text": "In his first public comments since leaving the White House, John Bolton, the former US national security adviser, delivered a stark warning about Donald Trump’s approach to North Korea, undercutting the president’s insistence that its leader, Kim Jong-un, wanted to make a denuclearisation deal with him.\n\nWithout mentioning Mr Trump by name, Mr Bolton said he wanted to “speak in unvarnished terms about the threat posed by North Korea,” and made it clear he thought the US president’s outreach to Mr Kim had benefited only one side.\n\nWhile Mr Trump has made a deal with Mr Kim one of his signature foreign policy goals, Mr Bolton asserted there had been no gains with his approach.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“The strategic decision Kim Jong-un is operating through is that he will do whatever he can to keep a deliverable nuclear weapons capability and to develop and enhance it further,” Mr Bolton said during an appearance at the Centre for Strategic and International Studies on Monday.\n\n“Under current circumstances, he will never give up the nuclear weapons voluntarily.”\n\nShape Created with Sketch. Trump and Kim: leaders arrive in Vietnam for talks Show all 7 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Trump and Kim: leaders arrive in Vietnam for talks 1/7 Donald Trump and Vietnamese President Nguyen Phu Trong make their way to a meeting at the Presidential Palace in Hanoi Reuters 2/7 Donald Trump waves a Vietnamese flag as Vietnam's Prime Minister Nguyen Xuan Phuc looks on AFP/Getty 3/7 Donald Trump waves as he leaves the Presidential Palace in Hanoi AFP/Getty 4/7 North Korean leader Kim Jong-un, right, is welcomed on his arrival at the Melia Hotel in Hanoi AP 5/7 Kim Jong-un waves as he arrives by train in the Vietnamese border town of Dong Dang AP 6/7 North Korean leader Kim Jong-un receiving a situation report before the summit with Trump AFP/Getty 7/7 The motorcade carrying U.S President Donald Trump drives past Ho Chi Minh Mausoleum AP 1/7 Donald Trump and Vietnamese President Nguyen Phu Trong make their way to a meeting at the Presidential Palace in Hanoi Reuters 2/7 Donald Trump waves a Vietnamese flag as Vietnam's Prime Minister Nguyen Xuan Phuc looks on AFP/Getty 3/7 Donald Trump waves as he leaves the Presidential Palace in Hanoi AFP/Getty 4/7 North Korean leader Kim Jong-un, right, is welcomed on his arrival at the Melia Hotel in Hanoi AP 5/7 Kim Jong-un waves as he arrives by train in the Vietnamese border town of Dong Dang AP 6/7 North Korean leader Kim Jong-un receiving a situation report before the summit with Trump AFP/Getty 7/7 The motorcade carrying U.S President Donald Trump drives past Ho Chi Minh Mausoleum AP\n\nMr Bolton was pushed out from his job as Mr Trump’s third national security adviser less than a month ago amid disputes over how to handle major foreign policy challenges, including North Korea.\n\nStopping nuclear proliferation in the Korean Peninsula is where the US needs “to focus our attention,” Mr Bolton said, “not can we get another summit with Kim Jong-un or what the state of staff-level negotiations are to achieve a commitment from North Korea it will never honour”.\n\nFor Mr Trump, the showy summits have been among his signature foreign policy achievements, held up as historic firsts.\n\nBut there has been no sign that North Korea’s nuclear provocations have diminished since Mr Trump’s outreach and the exchange of “beautiful” letters from Mr Kim the president likes to show off.\n\nMr Trump last met with Mr Kim in June, when he crossed the Demilitarized Zone from South Korea and became the first sitting American president to set foot in North Korea.\n\nThe president delighted in the drama of the meeting and the historic handshake with the North Korean leader, which he had arranged with a surprise invitation via Twitter barely 24 hours earlier.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nMr Bolton had accompanied the president to a meeting with Mr Kim in Hanoi, Vietnam, earlier in the year, but he was on a previously scheduled trip to Mongolia when Mr Trump crossed the DMZ.\n\nSince then, there has been little progress in terms of denuclearisation and Mr Trump has spent less time bragging about his cosy relationship with the North Korean leader.\n\nMr Bolton spoke on the day that was North Korea’s turn to address the annual session of the UN General Assembly.\n\nKim Song, the North’s ambassador to the world body, made it clear deep differences remained with the US and he suggested his government was losing patience.\n\nRelations between the Trump administration and North Korea, the ambassador said, “have made little progress so far and the situation on the Korean Peninsula has not come out of the vicious cycle of increased tension, which is entirely attributable to the political and military provocations perpetrated by the US”.\n\nThe president has blamed Mr Bolton more than Mr Kim for the stalled talks.\n\n“[Mr Kim] wanted nothing to do with John Bolton,” Mr Trump told reporters in September.\n\nBut Mr Bolton’s departure from the administration was expected to help revive the talks, even if it remained unclear what further concessions the North Koreans would be willing to make.\n\n“The chances of a fourth summit go up a great deal now that he’s not there,” said Victor Cha, the Korea chairman at the Centre for Strategic and International Studies.\n\n“I don’t think there’s anybody now at his level that will show the same degree of caution and scepticism of North Korea’s intentions.”\n\nMr Cha said the danger was the “lifting of some of these core sanctions against North Korea in return for something that is faux denuclearisation,” in other words, an agreement to dismantle pieces of the country’s nuclear programme it does not need anymore.\n\nAt the UN General Assembly session last week, Mr Trump floated the idea another summit was in the works. “It could happen soon,” he told reporters. “It could happen soon.”\n\n“The relationship has been very good,” Mr Trump said last week. “We’ll see what happens. But we’d like to see if we can do something. And if we can, that would be great. And if we can’t, that’s fine.”\n\nWhen pressed on Monday about whether Mr Bolton thought Mr Trump’s efforts to befriend and charm Mr Kim would work, Mr Bolton demurred.\n\n“I’m not going to comment on that,” he said. “Nice try.”\n\nBut he made clear he disagreed with Mr Trump’s position that the United States was in “no rush” for North Korea to give up its nuclear weapons.\n\n“Time works against those who oppose nuclear proliferation,” Mr Bolton said. “A relaxed attitude to time is a benefit to the likes of North Korea and Iran.”\n\nThe differences between Mr Trump and Mr Bolton on North Korea were hardly a secret during his time at the National Security Council.\n\nDuring a four-day state visit to Japan in May, Mr Trump contradicted Mr Bolton and Shinzo Abe, the Japanese prime minister, who both called North Korea’s short-range ballistic missile tests a violation of UN Security Council resolutions.\n\n“North Korea fired off some small weapons, which disturbed some of my people, and others, but not me,” Mr Trump wrote on Twitter, noting he trusted Mr Kim to “keep his promise to me”.\n\nMr Trump has also cited Mr Bolton’s comments from the year before about using a “Libyan model” for disarmament in North Korea as among the reasons he was dismissed.\n\nHis reference to Muammar Gaddafi​’s agreement to swap his nascent nuclear programme for economic integration with the West angered the North Koreans who saw it as an example of why no one should trust US efforts to disarm another nation since Gaddafi was eventually killed.\n\nMr Bolton’s comments raised questions about what other splits with Mr Trump he may reveal. His remarks, however, were limited to North Korea.\n\n“I was struck by how consistent his views were with what they have historically been,” said Mr Cha, who moderated a question-and-answer session with Mr Bolton on Monday.\n\nWhile Mr Bolton declined to comment directly on his time in the administration, Mr Cha said “the fact that he spent all that time working on this issue, and was there in Hanoi, and he comes out and his views are still very sceptical, it speaks for itself”.\n\nThe New York Times", "description": "In his first public comments since leaving the White House, John Bolton, the former US national security adviser, delivered a stark warning about Donald Trump’s approach to North Korea, undercutting the president’s insistence that its leader, Kim Jong-un, wanted to make a denuclearisat", "authors": ["Annie Karni"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/01/12/John-Bolton.jpg", "published_at": "2019-10-01"}