{"pub": "thehill", "url": "https://thehill.com/homenews/media/464526-saturday-night-live-mocks-key-trump-aides-over-impeachment-fears", "downloaded_at": "2019-10-06 12:22:52.597956+00:00", "title": "'Saturday Night Live' mocks key Trump aides over impeachment fears", "language": "en", "text": "\"Saturday Night Live\" took aim at a host of Trump administration officials and aides close to the president over how they are handling the House's formal impeachment inquiry.\n\nThe latest episode began with a mock conversation between Vice President Pence, President Trump Donald John TrumpTrump criticizes supposed second whistleblower North Korea missile test raises fears of new capabilities Window narrows for Trump trade deals MORE's personal attorney, Rudy Giuliani Rudy GiulianiDefense chief on Ukraine: 'My aim is to keep the department apolitical' Trump slams 'ass' Romney for criticizing Ukraine dealings Trump lawyer Giuliani tells Fox his mission is 'to disrupt the world' MORE, and Attorney General William Barr William Pelham BarrHouse Democrats subpoena White House for Ukraine documents Hillicon Valley: Iranian hacking operation targeted campaign, government accounts | House panel pushes Zuckerberg to testify on Libra | Trump officials step up attacks on Facebook encryption Cornyn makes waves with tweet about Justice investigating Biden MORE. It later featured an appearance from Secretary of State Mike Pompeo Michael (Mike) Richard PompeoTrump defense head says US has stepped up attacks on Taliban since talks broke down Defense chief on Ukraine: 'My aim is to keep the department apolitical' Trump rails against whistleblower, impeachment inquiry MORE, played by celebrity guest Matthew Broderick.\n\nADVERTISEMENT\n\nPence, played by Beck Bennett, opens the sketch by noting that the \"impeachment farce is growing worse by the day.\"\n\n\"And it's all happening during my busy season, Halloween!\" Giuliani, played by Kate McKinnon, responded.\n\nBarr, played by Aidy Bryant, then asks where the president is, prompting Bennett's Pence to say, \"he has more important things to deal with.\"\n\n\"He's meeting with an alligator breeder about filling the moat at the border,\" he adds, referencing a New York Times report that said Trump called for creating a moat next to a wall along the southern border.\n\n\"You should've told me, I know a couple gators from when I lived in the Central Park Zoo,\" McKinnon's Giuliani chimes in.\n\n“They totally exonerate us,” McKinnon argues, eventually leading Bryant's Barr to note what the messages said.\n\nReading from a phone, Bryant said: “Well, this one says: 'I think we should stop texting about the crimes and maybe tell the crimes over the phone so that the crimes don’t leave little crime footprints.' ”\n\nPompeo, played by Broderick, then appears, at one point noting that \"this whole impeachment thing could be really bad.\"\n\n\"Who told you that?\" Bennett's Pence asked\n\n\"Like, America,\" Broderick's Pompeo replied.\n\nTrump is facing mounting scrutiny in wake of revelations about his efforts to pressure Ukraine to open an investigation into Biden and his son over unfounded allegations of corruption. The developments led House Democrats to announce a formal impeachment inquiry last month.\n\nDemocrats have subpoenaed Giuliani and Pompeo amid their effort to investigate the administration's dealings with Ukraine.", "description": "\"Saturday Night Live\" took aim at a host of Trump administration officials and aides close to the president over how they are handling the House's formal impeachment inquiry.", "authors": [], "top_image": "https://thehill.com/sites/default/files/saturdaynightlive_1006.png", "published_at": "2019-10-06"}