{"pub": "businessinsider", "url": "https://businesstimes.com.sg/transport/uk-carmakers-hit-by-%C2%A3500m-brexit-tab-call-for-eu-deal ", "downloaded_at": "2019-10-15 09:10:00.787225+00:00", "title": "UK carmakers hit by £500m Brexit tab call for EU deal", "language": "en", "text": "UK carmakers, reeling from Brexit preparation costs exceeding £500 million pounds (S$867 million), made a last-ditch call to the government to strike a deal with the European Union to safeguard the future of the industry.\n\n[LONDON] UK carmakers, reeling from Brexit preparation costs exceeding £500 million pounds (S$867 million), made a last-ditch call to the government to strike a deal with the European Union to safeguard the future of the industry.\n\nCrashing out of the EU would threaten jobs and the sector's long-term survival, the Society for Motor Manufacturers and Traders said in a statement on Tuesday. Ahead of the Oct 31 deadline, one-third of UK automotive companies are cutting jobs and 77 per cent have seen a negative impact on business in the run up to Brexit, according to the lobby group.\n\nBrexit is threatening what had been a renaissance in carmaking in the UK, as foreign investment in plants helped offset the takeover or closure of some longstanding British car brands over the decades. Last week, Nissan Motor Co. issued its starkest warning yet against a no-deal scenario, saying any tariffs on auto exports to the EU are likely to render its UK operations unviable. The previous estimate, in June, for the cost of preparing to leave was about 330 million pounds, an SMMT spokesman said.\n\n\"As the Brexit clock ticks ever closer to midnight, this survey reveals the bleak future that awaits this vital sector in the event of ‘no deal',\" said Mike Hawes, SMMT's chief executive officer in the statement. \"Damage has already been done.\"\n\nsentifi.com Market voices on:\n\nExport tariffs would make locally built autos uncompetitive when sold in mainland Europe, and customs checks and red tape would disrupt ultra-efficient, just-in-time supply lines, carmakers say. Margins are already wafer thin and many manufacturers will not survive the application of tariffs, SMMT said, adding that the cost of a ‘no-deal' Brexit would be 50,000 pounds a minute.\n\nBLOOMBERG", "description": ": THE BUSINESS TIMES Transport - [LONDON] UK carmakers, reeling from Brexit preparation costs exceeding £500 million pounds (S$867 million), made a last-ditch call to the government to strike a deal with the European Union to safeguard the future of the industry. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/15/file76xi1d70q37fdwkdewp_0.jpg?itok=-cBt-c5P", "published_at": "2019-10-15"}