{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/sep/12/joe-biden-2020-race-anti-trump", "downloaded_at": "2019-09-12 07:12:50.360681+00:00", "title": "Why is Joe Biden leading the polls? Because electability is a real thing | Lloyd Green", "language": "en", "text": "Joe Biden sits squarely atop an unwieldy Democratic presidential field, and is the only challenger who appears comfortably competitive when paired against Donald Trump in electoral battlegrounds such as Michigan, New Hampshire and Wisconsin. While other contenders lead the president in national polls, Biden is the one candidate who generates the kind of coalition necessary to avoid the debacle of 2016, that is a Democratic popular vote victory coupled with another electoral college defeat.\n\nBiden is reassuring, not strident, and in that sense he is the anti-Trump. Barack Obama’s vice-president runs well with traditional Democratic constituencies along with those swing voters necessary to cobble together a win on election day 2020.\n\nJoe Biden inspires no one — not even his own wife | Bhaskar Sunkara Read more\n\nBiden has done so despite repeated gaffes, uneven debate performances and the questionable conduct of Hunter Biden, his surviving son, and James Biden, his brother. The former Delaware senator’s continued durability is about more than simple name recognition.\n\nSimply, Biden “does” reassuring naturally, and flashes emotional intelligence. It’s more about people than a cause, and in that sense, Biden is a candidate for our tumultuous times.\n\nOn the issues, Biden is a mainstream economic liberal, not a wild-eyed would-be revolutionary. Stridency is not his thing. He is not looking to recreate the world anew, and that is reassuring in a world buffeted by Trumpian tweetstorms.\n\nUnlike Elizabeth Warren and Bernie Sanders, Biden is not looking to strip Americans of their health insurance policies for the sake of bringing a progressive Arcadia to the here and now. In Biden’s playbook, preserving Obamacare and maintaining coverage for pre-existing conditions takes priority over change for its own sake, and middle America is fine with that.\n\nLikewise, while Biden supports comprehensive immigration reform, a path to citizenship for those who came to the US illegally and are part of our social fabric, he also believes that entering the country illegally should remain a crime. Borders are more than a concept.\n\nLike it or not, immigration and borders remain a political hotspot. By the numbers, a plurality of Democrats and nearly two-thirds of Americans disagree with Warren’s and Sanders’ stance.\n\nSimply put, Biden is a creature of the cultural center, someone who resonates with suburban moms, African Americans and retirees who have earned their right to social security and Medicare after a lifetime of work.\n\nTo Trump’s chagrin, Biden has established a rapport with firefighters. Unlike Bill de Blasio, New York City’s absentee mayor and delusional presidential aspirant, Biden is capable of empathizing with the men and women in blue.\n\nIn Tell Me, Dad, Biden writes of paying his respects to two New York City policemen who were shot dead just for being cops. One was Latino, the other Asian American. Biden’s grief rings genuine: “The assassin’s bullet targeted not just two officers, not just a uniform. It targeted this city.”\n\nThen to twist the knife into the mayor, and to mark his own political turf, Biden recalls that De Blasio “seemed happy that it was me representing the administration because he knew I had a close relationship with the police and the civil rights community”.\n\nBiden’s tale is one of an old-time north-east Democratic politician who understands that culture and coalitions both count. At the same time, he was ahead of the curve when it came to same-sex marriage, nudging Obama on the issue in an unscripted moment of Sunday news show candor.\n\nAnyone who thinks that whoever emerges as the Democratic nominee will be elected president is mistaken. Who the nominee is will be crucial. The ability to speak to all Americans, and not just the party’s base is an imperative.\n\nAs demonstrated by the results of Tuesday’s special election in North Carolina’s ninth congressional district – which the Republican won by only 2% in a district Trump had captured by double-digits – the political climate has not budged all that much since the 2018 midterms, with city dwellers and suburbanites squaring off against rural voters and the chasm between the two groups growing deeper and wider.\n\nTrump is unpopular but that does not make a Democratic victory a given. Unalloyed progressive economics tethered to full-throated multiculturalism could cost them the White House. It is a reality that many Democrats understand and intuit. That is why the numbers show Biden leading the primary field. Electability is a real thing.", "description": "The former vice-president is a mainstream economic liberal, not a wild-eyed would-be revolutionary, and that’s reassuring in a Trumpian world", "authors": ["Lloyd Green"], "top_image": "https://i.guim.co.uk/img/media/acce8546250f26b2d28da6a073df5d0a2ab8125a/0_158_4229_2538/master/4229.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=f9ba0b81fa06027600f2af268d411b84", "published_at": "2019-09-12"}