{"pub": "breitbart", "url": "https://breitbart.com/news/impeachment-probe-overshadows-us-2020-democratic-race", "downloaded_at": "2019-10-13 03:49:31.032724+00:00", "title": "Impeachment probe overshadows US 2020 Democratic race", "language": "en", "text": "Washington (AFP) – Joe Biden faces scrutiny over Ukraine, Elizabeth Warren is surging and Bernie Sanders had a heart attack, but recent developments in the Democratic presidential battle are getting minimal attention, swamped by Washington’s impeachment obsession.\n\nMost Democratic candidates are pounding the pavement in early voting states like Iowa, but they are finding little oxygen for the nomination race.\n\nBroadcast and cable news have been dominated by a burgeoning Ukraine scandal that has engulfed the White House and prompted House Democrats to launch an impeachment investigation of possible abuse of power by Trump.\n\nThe drama threatens to overshadow what could be a pivotal moment in the Democratic nomination race: Tuesday’s three-hour debate with the party’s top 12 candidates.\n\nThe fourth showdown of the cycle will feature the Democratic dozen clashing on everything from health care and climate to jobs, gun control and foreign policy, as they seek to catch fire with voters.\n\nUnder normal circumstances the pre-debate chatter would center around whether Biden gets more aggressive against rising star Warren, if Sanders can rebound after health problems, or how second-tier candidates like Senator Kamala Harris or ex-congressman Beto O’Rourke can mount a comeback.\n\nBut talk of Trump’s fate is the stark new reality, and for lesser Democratic candidates struggling for a breakout moment, their path to the nomination just got harder.\n\n“There is a lot of this impeachment inquiry taking over the narrative, and we’re going to see how these Democrats will be able to shape that to their advantage,” Mitchell McKinney, director of the Political Communication Institute at University of Missouri, told AFP.\n\nThe candidate most impacted by the Ukraine crisis is Biden. A whistleblower complaint at the center of the inquiry alleged that Trump pressured Ukraine’s leader on a July 25 call to investigate the US president’s Democratic rival.\n\nTrump says he acted appropriately, but he has relentlessly hammered Biden and his son as “corrupt.”\n\n– Biden, Warren face attacks –\n\nMcKinney said Biden could flip the attention to his advantage, convincing voters that he’s the Democrat Trump fears most in 2020.\n\n“Biden must demonstrate his aggressiveness and ability to take on the issue of Donald Trump coming at him directly about him and his son,” McKinney said.\n\nHe has. Saying Trump “betrayed this nation,” Biden on Wednesday called for the president’s impeachment for the first time.\n\n“Let me make something clear to President Trump: I’m not going anywhere,” he added Friday on Twitter. “You’re not going to destroy me.”\n\nWarren called for Trump’s impeachment months ago, perhaps signaling that, while Biden earlier hedged his bets, she recognized the urgency that a growing number of Democrats feel about ousting Trump.\n\nThe 70-year-old progressive senator has surged in recent weeks, drawing virtually even with Biden in polling — and raising the likelihood that debate rivals will go after her.\n\nOnstage Democrats may also pounce on Biden, and argue that his son’s work for a Ukrainian energy company while Biden was vice president has at least the appearance of a conflict of interest.\n\nThe impeachment saga shook up the campaign trail for all candidates, and they have been recalibrating accordingly.\n\nSanders acknowledged as much on September 24, when the liberal senator who supports Trump’s impeachment spoke of its risks.\n\n“This is a complicated issue from a political point of view,” Sanders told reporters in Davenport, Iowa.\n\nOne week later the 78-year-old suffered a mild heart attack, slowing his campaign just when he needed a fresh boost.\n\n“I’m feeling great and we’re going to run a vigorous campaign,” Sanders told CNN Thursday.\n\nThe setback put the health and age of not only Sanders, but Biden — who turns 77 next month and has been criticized for lacking vitality in debates — into the spotlight.\n\nSanders must “convince voters that he’s not out of it,” and the debate is a chance to do that, McKinney said.\n\nIf he does not, and “if Warren is able to solidify… the progressive wing, we could see a continuation of her rise and a taking over of Joe Biden,” he added.\n\nWhile Warren has gained steam, the air has wheezed out of many low-polling candidates, who are grasping for anything to revive their flat-lining campaigns.\n\nBut the impeachment fracas could benefit one new face on stage: Tom Steyer.\n\nThe billionaire activist, making his debate debut Tuesday, has spent two years advocating for Trump’s removal from office.", "description": "Washington (AFP) – Joe Biden faces scrutiny over Ukraine, Elizabeth Warren is surging and Bernie Sanders had a heart attack, but recent developments", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/12/e16a6f_democratic-white-house-hopeful-joe-biden-is-pushing-fiercely-us-president-640x335.jpg", "published_at": "2019-10-12"}