{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7598551/Suzanne-Somers-73-says-takes-sex-shot-helps-make-love-twice-day.html", "downloaded_at": "2019-10-28 13:35:56.227843+00:00", "title": "Suzanne Somers, 73, says she takes a 'sex shot' that helps her make love twice a day", "language": "en", "text": "Suzanne Somers is lifting the lid on her active sex life and the 'sex shot' that keeps her and her producer husband Alan Hamel tearing off each other's clothes twice a day after nearly 43 years of marriage.\n\nFor decades, the actress, 73, has hailed bioidentical hormone replacement therapy as her fountain of youth. Now, her love-making sessions with Alan, 83, are getting a boost with shots of PT-141, a melanocortin based peptide used to generate sexual arousal.\n\n'I'm kind of in that groove, like when you were younger and you're in the mood all the time, and so is he because he's on hormone replacements,' she told DailyMail.com.\n\nHot stuff: Suzanne Somers, 73, and her husband Alan Hamel, 83, have been giving their sex life a boost with shots of PT-141, a melanocortin based peptide used to generate sexual arousal\n\nFountain of youth? For decades, they have been taking bioidentical hormones, or hormones made from plants, to keep them feeling and looking young\n\nSuzanne and Alan take bioidentical hormones, or hormones made from plants, to replace whatever their bodies are lacking, according to their lab work.\n\nThe ThighMaster icon added shots of PT-141 to their routine after learning it is a 'sexual stimulant that works on your brain.'\n\n'I thought, \"Wow, what a great thing.\" Because men have had Viagra, but this actually a shot for both men and women that's not a drug,' she explained.\n\n'It just stimulates that part of your brain that says, \"Hey, I'm kind of in the mood.\" And, so, isn't that a wonderful thing? And it's not a drug, so I love it.'\n\nThe Three's Company star said she and Alan take a shot of PT-141 about once a week, and while many of their contemporaries can barely get out of bed, they're having sex twice a day.\n\nLove at first sight: Suzanne and Alan met in a television studio 50 years ago, and she recalled having sex with him on their first date 'just in case there wasn't a second one'\n\nLove affair: The author said she and her producer husband have sex twice a day, though she joked she usually 'sleeps through one of them'\n\n'I usually say I sleep through one of them. That's usually that one at 4 o'clock in the morning,' she joked. 'But, you know, then again around 8 o'clock in the morning, I'm in the mood.'\n\nIt doesn't hurt that Suzanne and Alan have had a magnetic connection since the moment they first met in a television studio 50 years ago.\n\n'Oh, he's just so beautiful,' she gushed. 'I had sex with him on our very first date just in case there wasn't a second one. I just wanted to be with him that first time.'\n\nHer fears were unfounded, as they ended up getting married and merging their two families while continuing to have plenty of sex. Suzanne has a son, Bruce, with her first husband Bruce Somers, while Alan has a son, Stephen, and a daughter, Leslie, with his ex-wife Marilyn Hamel.\n\nAlan was by her side when she was diagnosed with breast cancer in 2000, right around the time she started writing about hormones and their effect on the body.\n\n'When I heard those words, \"You have cancer,\" I thought, \"What have I done in my diet and lifestyle that I have played host to this nasty disease?\" And when I looked at it, I saw,' Suzanne said.\n\nSupport: Alan stood by her side when she was diagnosed with breast cancer in 2000 (pictured). She underwent a lumpectomy to remove the cancer followed by radiation therapy\n\nAlternative treatment: Suzanne (pictured in 2000) sparked controversy when she opted to forgo chemotherapy in favor of treatment with Iscador, a fermented mistletoe extract\n\nThe health guru admitted she wasn't concerned about organic food at the time, and she recalled how she would nervously snack at the craft service table when she was on set. She also didn't get enough sleep, opting to write her books in the middle of the night rather than rest.\n\n'I realize in retrospect, you have to eat as though your life depends upon it in today's world,' she said. 'You've got to think positive thoughts because thoughts create. You've got to value sleep.'\n\nSuzanne underwent a lumpectomy to remove the cancer followed by radiation therapy, but she sparked controversy when she opted to forgo chemotherapy in favor of treatment with Iscador, a fermented mistletoe extract.\n\nNearly 20 years later, she insisted that she isn't 'putting down chemotherapy' in any way, she just knew it wasn't right for her.\n\n'The idea of fighting cancer with harsh chemical poisons. I just couldn't reckon with it,' she explained. 'My doctor at the time said, \"You're going to die.\" I said, \"Honestly, with all due respect, I think I will die if I do what you tell me to do.'\n\nShe also defied her doctor's orders by refusing to give up the hormones she was taking to combat menopause.\n\nLooking back: The actress, who started on hit shows such as Three's Company (pictured), believes her diet and lifestyle led to her developing cancer\n\nPast mistakes: Suzanne (pictured in 1982) said she nervously ate junk food at the craft service table when she was on set and would stay up at night writing her books instead of sleeping\n\nAdvice: Suzanne touts a 'high-fat, high-vegetable, high-protein diet' featuring organic foods. 'You have to eat as though your life depends upon it in today's world,' she said\n\n'I found it amazing at the time that there was so much criticism,' she said. 'I thought, \"Shouldn't we all be able to choose what it is that we want?\"'\n\nIn Suzanne's eyes, her unwavering belief in her alternative treatments is almost as important as the treatments themselves.\n\n'We're making a difference': Suzanne said she 'admires' fellow actress and lifestyle guru Gwyneth Paltrow\n\n'Maybe I'm all wrong, but my brain believes it so much that here I am. Woo-hoo,' she said with a laugh.\n\nThe author, whose 27th book, 'A New Way to Age,' is out in January, stressed that she is not a doctor and never says the word 'should'; she just shares what has worked for her.\n\n'I didn't mean to be a renegade or controversial,' she said. 'If you knew me, I'm the last person who would do that, but it started with the cancer, and cancer for me has become a veiled gift. I've learned everything from it. It put me on this path.'\n\nIn addition to her books, she has developed everything from her own organic cleaning products to her recently launched toxic-free beauty line, Suzanne Organics.\n\nShe touts a 'high-fat, high-vegetable, high-protein diet' featuring organic foods and speaks passionately about things that she feels have enriched her life — no matter what her critics say.\n\nBirthday suit: Suzanne celebrated her 73rd birthday on October 16 by sharing a photo of herself posing naked in a field of yellow flowers\n\nGood genes: The Step by Step star said her granddaughters Violet Somers (left) and Camelia Somers (right) eat just as healthy as she does\n\nThe actress turned businesswoman's controversies are akin to the ones Gwyneth Paltrow, 47, has spawned by promoting alternative wellness advice such as vaginal steaming on her lifestyle website, Goop.\n\nThough Suzanne admitted she's 'not that familiar' with Goop, she thinks Gwyneth is 'doing wonderful things.'\n\n'I was probably the first one out there doing this. We're making a difference,' she said. 'I can feel it. I know it, and I admire her. It's nice to find a productive use for your louder voice, and that's what being a celebrity is.\n\n'You can use it for the better good, and that's what I try to do with my voice. I'm not political. I don't get involved in anything like that,' she added. 'I figure what I do is controversial enough. I eat organic foods and I sleep eight hours a night without drugs. That's my controversy.'\n\nSuzanne is a firm believer that we are in control of our happiness, and every morning when she wakes up, she envisions herself isolating one of her body's cells and telling it everything she loves in her life.\n\n'Now that little guy's got to tell all the other 40 trillion cells, \"Okay, we love our life. We love our husband. We love our food. We love our work. We love that we live in America.\" It creates happiness,' she explained.\n\nStill got it: Suzanne donned a mini dress while celebrating model Beverly Johnson's birthday earlier this month\n\nA-list: Suzanne hung out with Jennifer Meyer, Jennifer Aniston, Laura Dern (left to right), and Courteney Cox (far right) on the Fourth of July\n\nShe also likes to advise her lecture audiences to get naked with their partners and 'exchange electrons' by holding each other. While it may seem wonky, there are certainly some benefits. Skin-to-skin contact causes a release in oxytocin, which is known as the 'love hormone.'\n\nAs for anti-aging, Suzanne is all for using creams and serums, but she believes keeping 'your insides young' will 'manifest on the outside.' Above all, she said everyone should 'value good thoughts' because 'what you think is who you become.'\n\n'The great thing about aging is wisdom and perspective. It's the one thing no young person can buy or have,' she said of the things she has learned over the years.\n\nThe Step by Step star celebrated her 73rd birthday on October 16 by posing naked in a field of yellow flowers. She shared the cheek shot on Instagram, writing: 'Here I am at 73 in my Birthday Suit!!!'\n\nNot only does she look amazing, but she also has a youthful exuberance that she credits to keeping her insides operating at maximum.\n\n'I feel the older I get, the better it is for my brand because I'm living the life I write about,' she told DailyMail.com. 'I'm living this great love affair, and I walk my talk. So the older I get, the better it is because people go, \"Well, look what she's done.\"'", "description": "The actress told DailyMail.com they've added shots of PT-141, a melanocortin based peptide, to their routine after learning it is a 'sexual stimulant that works on your brain.'", "authors": ["Erica Tempesta For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/11/20202964-0-image-a-5_1572262706417.jpg", "published_at": "2019-10-28"}