{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7617857/HARRY-COLE-Remainers-plot-elect-Harriet-Harman-Speaker-John-Bercow-Mark-2.html", "downloaded_at": "2019-10-27 04:06:32.378345+00:00", "title": "HARRY COLE: Remainers plot to elect Harriet Harman to Speaker as a John Bercow Mark 2", "language": "en", "text": "Unless he rats again, by this time next week John Bercow’s ignominious tenure as Commons Speaker will be over.\n\nBut Tories should be wary of celebrating too much for fear of finding something worse.\n\nI hear there is a plot afoot among Remainers and Labour to put Harriet Harman in the chair as the ‘continuity Bercow candidate’ – someone willing to tear up the rules to keep Boris Johnson and Brexit on the rack.\n\nUnless he rats again, by this time next week John Bercow’s ignominious tenure as Commons Speaker will be over\n\nMost Conservative MPs are backing chummy Labour man Lindsay Hoyle or feisty Tory Brexiteer Eleanor Laing but worried whips have detected a growing movement toward the PC-brigade’s beloved ‘Harperson’ among Remainer Tory rebels and older women on the Government benches.\n\nHoyle’s supporters are confident he has the numbers, but were Labour to swing behind Harman en-masse, she could clinch the post.\n\nAnd with Bercow vowing to quit as an MP as well within days, a further headache for No 10 is the Buckingham by-election.\n\nTory strategists had hoped to wrap it into the next Election – but given that is being blocked, a separate fight will likely be needed. With the controversial HS2 route ploughing through the countryside seat, and the Brexit Party revelling in delay, it will be a tasty battle.\n\nMarch of the G&T brigade\n\nCampaigners for a second referendum did little to dispel the myth that they are a bunch of middle-class elitists at their march in London last weekend.\n\nThe Marks and Spencer next to Green Park Tube station – which marked the halfway point of the route – sold out of posh cans of gin and tonic within minutes, as the empty shelves proved, while the tinnies of beer remained largely untouched.\n\nWell, the doomsday anti-Brexit campaigners did warn of empty shelves in supermarkets...\n\nEmpty shelves where gin and tonic was kept until Remainers approached\n\nIt is all getting a bit much for Brexit Secretary Stephen Barclay? In the hallowed Commons tea room last week, burly Steve spilled a pot of boiling water for his brew all over the counter. The staff cleaned it up and brought him another – only for him to spill it all over again, amid profuse apologies. When he finally managed to walk away with an unspoiled third pot, he left his bank card at the till.\n\nSlick PR man Roland Rudd has taken his ousting from the People’s Vote campaign in good humour. After The Mail on Sunday revealed the bitter internal civil war blighting the second referendum camp, the Guido Fawkes website ran an unflattering cartoon of Rudd having very girly fisticuffs with nemesis Alastair Campbell. I hear clubbable Rudd was quick on the blower to buy the original cartoon for £500 on Monday morning. He can hang it in one of the eight bathrooms in his Somerset pile...\n\nA push by backbench Tories to make it illegal to undermine the Government negotiating with foreign powers is growing in support amid more Brexit delay.\n\nAfter Remainers were accused of plotting with Brussels and Paris to stymie the referendum result, I hear the planned private member’s bill has a catchy nickname from its backers – BLAIR’S Law – short for British Legislation Against International Remainer Sabotage.\n\nPalmerston, the Foreign Office cat, has not been seen in public for weeks.\n\nHis absence has sparked dark rumours among the photographers that loiter on Whitehall, who delighted in snapping him tussling with No10 neighbour Larry.\n\nBut I hear talk of the black-and-white moggy’s demise is currently wide of the mark. ‘He’s not dead, but he is very poorly,’ says a Foreign Office source, diplomatically.\n\nI’m told Palmerston has gone to see out his days at the home of a senior official after a long and distinguished mouse- slaying career.\n\nSome vintage Sir Humphrey behaviour from circumspect officials at Highways England.\n\nThe quango’s pen-pushers were aghast when tiggerish Transport Secretary Grant Shapps told Whitehall’s ‘XO’ No Deal planning committee that he wanted to hang scores of giant ‘get ready for Brexit’ banners along motorways across the country.\n\n‘They tried every single trick in the book to kill it,’ says a weary aide, ‘including demanding special training for people to attach the signs.’", "description": "Unless he rats again, by this time next week John Bercow's ignominious tenure as Commons Speaker will be over, writes HARRY COLE.", "authors": ["Harry Cole For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/01/20229712-0-image-a-5_1572135362937.jpg", "published_at": "2019-10-27"}