{"pub": "breitbart", "url": "https://breitbart.com/crime/2019/09/22/pregnant-mother-hacked-to-death-at-south-african-resort", "downloaded_at": "2019-10-05 05:49:25.394521+00:00", "title": "Pregnant Mother Hacked to Death at South African Resort", "language": "en", "text": "A pregnant mother was reportedly stabbed to death as she slept near her family while on vacation at a resort in South Africa on Tuesday.\n\nReports said 31-year-old Karen Turner was sleeping next to her husband, Matthew, and their toddler son when two men allegedly sneaked into the chalet and began attacking them with knives at the Hluleka Nature Reserve in the Eastern Cape Province.\n\nPolice said the woman and her unborn baby died instantly while her husband was able to fight off the suspects. He was later taken to a hospital in Pietermaritzburg where he underwent surgery for his injuries.\n\nReports said the couple’s toddler was unharmed during the horrific incident.\n\nThe young mother’s brother, Ian Crouch, told News24 that he was able to speak to the husband after he came out of surgery.\n\nHe commented:\n\nHis recollection was that he was woken up by being stabbed in the stomach. There was a guy on his side of the bed stabbing him in the stomach and the other chap was stabbing my sister. He said he did manage to sort of grab the guy and there was a bit of a tussle down the stairs. After that, he doesn’t have any recollection.\n\n“The motive behind the murder is currently not known. The crime in South Africa is spiraling out of control with a shocking 21,000 murders and 45,000 rapes reported in 2018,” reports said.\n\nHowever, Crouch told news outlets on Friday that he arrived at the resort before the police on the day of the tragedy and claimed he heard a woman telling resort employees to blame the murder on a domestic dispute.\n\n“I saw the staff from the resort all gathered together. A woman was talking and said she had been told by ‘Vuyani’ to say there was no staff at the resort after 11pm and no staff before 7am,” he recalled. “She said she had been told there was a party at the chalet and there had been a domestic dispute.”\n\nVuyani Dayimani is the CEO of the Eastern Cape Parks and Tourism Agency (ECPTA) and has since denied giving any instructions to the resort’s employees regarding the incident.\n\nResort staff allegedly told authorities that people in a neighboring chalet said they heard a “commotion” just before the event took place.\n\nHowever, police captain Dineo Koena said the deceased woman’s husband “is the only person who will lead us to who did this.”\n\nReports said that although no arrests have yet been made, the investigation into the death of the mother and her unborn baby are currently underway.", "description": "A pregnant mother was reportedly stabbed to death as she slept near her family while on vacation at a resort in South Africa on Tuesday.", "authors": ["Amy Furr"], "top_image": "https://media.breitbart.com/media/2019/09/karen-turner-fb-640x335.png", "published_at": "2019-09-22"}