{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7566773/MAFS-star-Susie-Bradley-unfollows-deletes-couple-photos-NRL-bad-boy-Todd-Carney.html", "downloaded_at": "2019-10-13 00:25:56.734629+00:00", "title": "MAFS star Susie Bradley unfollows and deletes all couple photos with NRL bad boy Todd Carney", "language": "en", "text": "Married At First Sight star Susie Bradley, 27, and NRL bad boy Todd Carney, 33, appear to have split after just eight month of dating.\n\nOn Saturday, the couple unfollowed each other and removed all loved-up photos from their social media accounts.\n\n'Letting go doesn't mean giving up, but rather accepting that there are things that cannot be,' Susie cryptically shared on her Instagram Stories.\n\nIt's over! MAFS star Susie Bradley unfollows and deletes all couple photos with NRL bad boy Todd Carney after eight months of dating... but what about their matching tattoos?\n\nDespite only last month pledging their undying love for one another, the pair appear to have parted ways.\n\nOn Saturday, Todd hit the town with his friends during a boys' night.\n\nThe former Cronulla Sharks star shared a story with Pharrell Williams' Happy playing, writing: 'Boys are on!'\n\nMeanwhile, Susie also shared a night with friends drinking wine, and shared the image: 'Wine won't wake up one day and leave you.'\n\n'Because I'm happy': On Saturday night, Todd hit the town on a boys' night\n\nOuch! Susie also shared a night with friends drinking wine, and shared the image: 'Wine won't wake up one day and leave you'\n\nKeep them coming! Susie shared videos drinking at home with friends on a girls' night in after deleting all remnants of Todd from her social media pages\n\nOver the last eight months, Todd has become a committed stepfather to Susie's four-year-old daughter, Baby, from a previous relationship.\n\n'She has her own father, but when Baby's in my care, I treat her as if she's my own,' Todd said to New Idea in September.\n\nHe even recently admitted he's ready to start a family: 'If Susie and I are ready to commit to it, I'd definitely love to have kids.'\n\n'Sorry not sorry': Susie shared a glamorous photo of herself amid the split, as fans praised her and asked where Todd had gone from her page\n\n'I'd love to have kids with her!' NRL bad boy Todd only recently revealed he was planning a family with his Married At First Sight star girlfriend Susie\n\nStep-father: Susie, 26, has a three-year-old daughter from a previous relationship named Baby\n\nThe couple celebrated their six-month anniversary in August, which Susie commemorated with a heartfelt Instagram post.\n\nShe wrote at the time: 'We have laughed, we have cried, we have battled relentlessly with attention, both positive and negative, we have had our names tattooed, we've been on an overseas holiday, we have grown in love each day, learning as a new family of three.'\n\nDaily Mail Australia have contacted Susie Bradley and Todd Carney for comment.\n\nDedicated: 'She has her own father, but when Baby's in my care, I treat her as if she's my own,' Todd told New Idea on Monday\n\nA very modern romance! The couple first met in January, after Todd 'slid into Susie's DMs' on Instagram following weeks of liking each other's photos\n\nThe couple first met in January, after Todd 'slid into Susie's DMs' on Instagram following weeks of liking each other's photos.\n\nSusie, who was partnered with barista Billy Vincent on Married At First Sight, went 'Instagram official' with Todd in March.\n\nShe received a significant backlash when the pair first began dating, as MAFS fans thought that Susie was being unfaithful to Billy.\n\nOf course, MAFS is actually filmed months in advance and Susie had long since broken things off with Billy when she began dating Todd.", "description": "Married At First Sight star Susie Bradley, 27, and NRL bad boy Todd Carney, 33, appear to have split after just eight month of dating.", "authors": ["Candice Jackson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/23/19637818-0-image-a-4_1570917920961.jpg", "published_at": "2019-10-12"}