{"pub": "cnn", "url": "https://cnn.com/2019/10/16/uk/whats-going-on-on-with-brexit-intl-gbr/index.html", "downloaded_at": "2019-10-16 20:39:21.458705+00:00", "title": "What's happening with Brexit? Seriously... no one really knows", "language": "en", "text": "London (CNN) You might not have heard it, but Brexit is hitting a pretty critical moment. With just days to go until the UK is scheduled to leave the European Union, nothing is certain and time is running seriously short.\n\nSo... what's going on?\n\nGood question. The UK and EU are in secret negotiations, referred to in Brexit jargon as \"the tunnel,\" trying to reach an agreement that can be presented to the European Council of leaders on Thursday.\n\nBoris Johnson said from the moment he launched his bid to be the UK Prime Minister that he would only negotiate with Brussels if it was willing to open up Theresa May's thrice-defeated Brexit deal, formally known as the Withdrawal Agreement.\n\nIf successful, the next step is for the other 27 EU member states to give it the thumbs up or thumbs down when they meet in Brussels on Thursday.\n\nTomorrow? That sounds... soon\n\nWell, quite. Though that doesn't mean that the negotiations are not being taken seriously. Speculation as to what is happening is wild at the moment.\n\nBut the fact that very little official is being said is a sign that both sides are eager to reach a deal. When the EU is angry, its effective briefing network lets journalists know.\n\nIt's possible that the EU will ultimately decide there is insufficient time for a deal to be reached by tomorrow, but that it is willing to carry on negotiating. At that point, the summit meeting becomes about (yet another) Brexit extension.\n\nDidn't Boris Johnson promise not to delay Brexit under any circumstances?\n\nHe did. But it's not entirely up to him. If the EU27, as the remaining member states are known, agree on a technical extension for talks and to arrive at a deal, they will do so working on the assumption that the UK will have to request one.\n\nLast month, opposition lawmakers in the UK passed a bill that would force the UK to request an extension by 11 p.m. on Saturday, (6 p.m. ET), if no deal with the EU is in place. That letter doesn't need to be sent by Johnson himself, but obstructing it would be a clear violation of a clear law.\n\nWhat if there is a deal?\n\nThere is a slim chance that a deal could be reached. And if it is, then lawmakers will get their chance to vote on it on Saturday, when Parliament will sit in a special weekend session for the first time in decades. Unfortunately for Johnson, he has several hurdles to leap before then.\n\nAny deal would need approval from his Cabinet. It would then need to be agreed by all EU27 member states, who are suspicious of Johnson's motives. Finally, it would need to get through Parliament. Here, Johnson would need to square off Brexit moderates and hardliners, something Theresa May found impossible.\n\nHe will also have to get the Northern Irish DUP on board, and the mood music there isn't good. The DUP has been the single largest stumbling block to any Brexit deal and its leader, Arlene Foster, was not super enthusiastic after a 90-minute meeting with Johnson on Tuesday.\n\nSo... what's going to happen?\n\nLook, I'd tell you if I could. The reality is that events are fluid and no one really knows what's going on. Details of what a deal might look like vary depending on whom you talk to, and support for a deal both in Brussels and Westminster looks flimsy.\n\nBasically, between Johnson getting a deal and Parliament voting it through and the Prime Minister breaking the law and being arrested on live television, anything is possible.", "description": "You might not have heard it, but Brexit is hitting a pretty critical moment. With just days to go until the UK is scheduled to leave the European Union, nothing is certain and time is running seriously short.", "authors": ["Analysis Luke Mcgee"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191005122842-boris-johnson-2-super-tease.jpg", "published_at": "2019-10-16"}