{"pub": "reuters", "url": "https://reuters.com/article/us-pakistan-politics/pakistani-islamist-party-vows-to-oust-government-with-protests-idUSKBN1X11MX", "downloaded_at": "2019-10-22 14:04:44.771250+00:00", "title": "Pakistani Islamist party vows to oust government with protests", "language": "en", "text": "ISLAMABAD (Reuters) - The chief of one of Pakistan’s largest religious parties announced on Tuesday a protest campaign aimed at ousting Prime Minister Imran Khan, raising the prospect of political turmoil as the government struggles to stabilize the economy.\n\nFazal-ur Rehman, President of the religious and political party Jamiat Ulema-e-Islam - Fazal (JUI-F), gestures during a press conference in Islamabad, Pakistan October 22, 2019. REUTERS/Akhtar Soomro\n\nFazl-ur-Rehman, leader of the conservative Jamiat Ulema-i-Islam-Fazl (JUI-F) party, said the government of cricketer-turned-politician Khan was “incompetent and illegitimate” and was installed by the military establishment after a rigged election last year.\n\n“We have decided to march on Islamabad,” the heavily bearded Rehman told a news conference in the capital.\n\n“Our basic demand is that the people who’ve got no right to rule should resign immediately.”\n\nKhan won last year’s election on a promise to end corruption and help middle-class families but the economy is running into headwinds and the government in July agreed to a $6 billion bailout from the International Monetary Fund.\n\nKhan rejects his critics’ accusations that he is backed by the military, which has a long record of intervention in politics. The military also denies any involvement in civilian politics.\n\nElection authorities rejected opposition complaints of rigging in the 2018 vote.\n\nRehman is a veteran politician who heads an alliance with several seats in the National Assembly and provincial assemblies. But his real influence comes from his ability to mobilize support, particularly in numerous religious schools, or madrasas, across the country.\n\nThe main opposition parties of former prime ministers Nawaz Sharif and Benazir Bhutto have both said they would back Rehman’s campaign against Khan, though have also said they would not support any unconstitutional action.\n\nThe government has said it wants negotiations with the opposition while vowing that no one would be allowed to paralyze life in the capital.\n\n“Only the state has the monopoly over violence,” Information Minister Firdous Ashiq Awan said on Monday, adding that it was not fair for the opposition to destabilize the country at a time of tension with old rival India over the disputed Kashmir region.\n\nPakistan has also been struggling to avert a balance of payments crisis and to prevent its debt from spiraling out of control.", "description": "The chief of one of Pakistan's largest religious parties announced on Tuesday a protest campaign aimed at ousting Prime Minister Imran Khan, raising the prospect of political turmoil as the government struggles to stabilize the economy.", "authors": ["Asif Shahzad", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191022&t=2&i=1443752622&w=1200&r=LYNXMPEF9L16M", "published_at": "2019-10-22"}