{"pub": "atlantic", "url": "https://theatlantic.com/education/archive/2019/10/harvard-wins-affirmative-action-case-plaintiff-will-appeal/599281", "downloaded_at": "2019-10-02 15:26:24.276115+00:00", "published_at": "2019-10-02", "title": "Harvard Won This Round, But Affirmative Action Is Weak", "language": "en", "text": "There was a caveat near the bottom of Burroughs’ ruling though. Harvard’s admissions policy, and their use of race in admissions, withstands strict scrutiny—the highest standard of review the court uses in deciding discrimination complaints—she wrote, but “it is not perfect.” Burroughs suggested that the admissions officers should take bias training and that the university should maintain clear guidelines for how race is used in admissions. “That being said, the Court will not dismantle a very fine admissions program that passes constitutional muster, solely because it could do better.”\n\nThe fine admissions program Burroughs lauded was doing what it was intended to do: Diversify the campus. Harvard’s program has been held up as an example of the proper use of race in admissions for decades, since affirmative action had its landmark test at the Supreme Court in the University of California Board of Regents v. Bakke case which was decided in 1978. In that case, the high court ruled that the consideration of race in admissions was constitutional, but race could not be the sole factor for the decision—it needed to be used in concert with other factors.\n\nRead: The Supreme Court Justice who forever changed affirmative action\n\nIn case after case the courts have drawn a tight circle where affirmative action can live; the colleges that step outside of it will be ordered back in by a judge. In the Bakke decision, the court made it clear that the use of race in admissions could not be used as a remedy for past discrimination; instead it had to be used as a tool for diversity—to benefit all of the students on campus. An outline of Harvard’s program, the holistic admissions program which it still uses today (with small tweaks made over the years), was appended to the 1978 opinion.\n\nBut then black enrollments at Ivy League institutions stagnated. “Black students make up 9 percent of the freshmen at Ivy League schools but 15 percent of college-age Americans, roughly the same gap as in 1980,” a 2017 New York Times analysis found. Only a handful of schools are selective enough to engineer their classes using race as a factor, and the inert statistics of black students at those institutions are in part a result of the limitations on affirmative action placed by Bakke and later court cases. The schools that use race in admissions have become adept at designing their programs to be legally airtight.\n\nRead: What happens when a college’s affirmative action policy is found illegal\n\nTwenty-five years after Bakke, in 2003, Associate Justice Sandra Day O’Connor delivered the opinion of the court in another affirmative action case. This time it involved the University of Michigan. “We expect that 25 years from now, the use of racial preferences will no longer be necessary to further the interest approved today.” Perhaps by then, the court opined, a workable alternative to the use of race would have been found.", "description": "A judge ruled that the university’s use of race in admissions was not discriminatory. But decades of case law have already severely limited the scope of such policies.", "authors": ["Adam Harris"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/Harvard/facebook.png?1570029039"}