{"pub": "yahoo", "url": "https://news.yahoo.com/india-pakistan-nuclear-war-could-kill-100-million-181207404.html", "downloaded_at": "2019-10-04 13:15:31.802014+00:00", "title": "India-Pakistan nuclear war could kill 100 million, trigger global cooling", "language": "en", "text": "India and Pakistan last fought a border conflict in February 2019, but they pulled back from the brink after Pakistan returned a downed pilot to India (AFP Photo/STR)\n\nWashington (AFP) - The year is 2025 and militants have attacked India's parliament, killing most of its leaders. New Delhi retaliates by sending tanks into the part of Kashmir controlled by Pakistan.\n\nFearing it will be overrun, Islamabad hits the invading forces with its battlefield nuclear weapons, triggering an escalating exchange that becomes the deadliest conflict in history and sends millions of tons of thick, black smoke into the upper atmosphere.\n\nThis scenario was modeled by researchers in a new paper published on Wednesday, which envisaged more than 100 million immediate deaths followed by global mass starvation as the planet enters a new period of cooling, with temperatures not seen since the last Ice Age.\n\nIt comes at a time of renewed tensions between the two South Asian rivals, which have fought several wars over the Muslim-majority territory of Kashmir and are rapidly building up their atomic arsenals.\n\nThey currently each have about 150 nuclear warheads at their disposal, with the number expected to climb to more than 200 by 2025.\n\n\"Unfortunately it's timely because India and Pakistan remain in conflict over Kashmir, and every month or so you can read about people dying along the border,\" Alan Robock, a professor in environmental sciences at Rutgers University who co-authored the paper in Science Advances told AFP.\n\nIndia's Prime Minister Narendra Modi scrapped the autonomy of the part of Kashmir controlled by New Delhi in August, with his Pakistani counterpart Imran Khan warning last week that the dispute could escalate into nuclear war.\n\nThe two countries last fought a border conflict in February, but they pulled back from the brink after Pakistan returned a downed pilot to India.\n\n- Catastrophic cooling -\n\nBased on their current populations and the urban centers that would be likely targeted, the researchers estimated up to 125 million could be killed if 100 kiloton weapons were used -- that is more than six times as powerful as the bombs dropped on Hiroshima.\n\nFor reference, some 75-80 million people were killed in World War II.\n\nBut that would only be the beginning.\n\nThe research found that mass firestorms ignited by the exploding nuclear weapons could release 16 million to 36 million tons of soot (black carbon) into the upper atmosphere, spreading around the world within weeks.\n\nThe soot in turn would absorb solar radiation, heating the air up and boosting the smoke's rise. Sunlight reaching the Earth would decline 20 to 35 percent, cooling the surface by 3.6 to 9 degrees Fahrenheit (2 to 5 degrees Celsius) and reducing precipitation by 15 to 30 percent.\n\nWorldwide food shortages would follow, with the effects persisting up to a decade.\n\n\"I hope our work will make people realize you can't use nuclear weapons, they are weapons of mass genocide,\" Robock told AFP, adding the paper lent more evidence to support the 2017 UN Treaty on the Prohibition of Nuclear Weapons.\n\n\"Two countries with smaller numbers of nuclear weapons on the other side of the world still threatens the planet, so it's not something we can ignore.\"", "description": "The year is 2025 and militants have attacked India's parliament, killing most of its leaders.  New Delhi retaliates by sending tanks into the part of Kashmir controlled by Pakistan.  Fearing it will be overrun, Islamabad hits the invading forces with its battlefield nuclear weapons, triggering an", "authors": ["Issam Ahmed"], "top_image": "https://s.yimg.com/uu/api/res/1.2/6lKPQSwPCBheYcyKwKz7ew--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/4a659a3a9d90605ddd60a10ebd6c1d29e82a2263.jpg", "published_at": "2019-10-02"}