{"pub": "telegraph", "url": "https://telegraph.co.uk/music/what-to-listen-to/best-top-jazz-folk-gigs-2019", "downloaded_at": "2019-10-08 10:26:59.309901+00:00", "title": "Musical mastery of a rare order from the Carla Bley Trio at Kings Place, plus the best jazz and folk gigs of 2019", "language": "en", "text": "Carla Bley Trio, Kings Place, London N1 ★★★☆☆\n\nThere was a time when Carla Bley used to think big. This pensive but at times wildly eccentric composer-pianist for a while fronted her own big band, and in the late Sixties assembled the cream of jazz and rock talent to record her own two-hour jazz opera. She made quirky humour and huge ambition seem like natural bedfellows.\n\nThese days, Bley prefers to think small, though in truth her particular talent has always revealed itself in small things – a shift in a chordal pattern that reveals a new emotional colour, a stubborn “wrong note” in what is otherwise a “normal” jazz pattern. Bley is now in her eighties, and her playing tends ever more towards the musing and meditative, her tiny frame bent over the piano, face hidden by a shock of grey hair. Monday night’s concert, in which Bley was joined by bass guitarist Steve Swallow, her musical partner of more than half a century, and British saxophonist Andy Sheppard, showed that her musical intelligence is as sharp as ever.\n\nThe trio launched off with the kind of simplicity most trios wouldn’t dare; an absolutely straight 12-bar blues, which might have seemed dull had it not been for Swallow’s tender, searching solo high up on his bass guitar (Swallow is more expressive as a melodist on the bass guitar than many players are on the “normal” guitar). Then Sheppard joined in with a keening high note placed just so, coloured with that hugely slow, swell-like vibrato that is his trademark.", "description": "Carla Bley Trio, Kings Place, London N1 ★★★☆☆", "authors": ["Ivan Hewett", "Neil Mccormick", "Charlotte Runcie", "Rupert Christiansen"], "top_image": "https://www.telegraph.co.uk/content/dam/music/2019/10/08/TELEMMGLPICT000212396730_1-xlarge_trans_NvBQzQNjv4Bq11tASc3J8TactlUo6DlGiXISfxPkpkvr3uqeysZbcIU.jpeg?imwidth=1200", "published_at": "2019-10-08"}