{"pub": "yahoo", "url": "https://news.yahoo.com/lowell-cafe-opens-in-hollywood-riding-a-post-prohibition-legal-pot-wave-111744903.html", "downloaded_at": "2019-10-02 12:54:04.607561+00:00", "published_at": "2019-10-02", "title": "Lowell Cafe opens in Hollywood, riding a 'post prohibition' legal pot wave", "language": "en", "text": "West Hollywood is now officially home to the first legal restaurant in America where cannabis connoisseurs and curious guests can openly light up.\n\nLowell Cafe opened its doors on Tuesday. Backed by Miley Cyrus and number of other celebrity investors, the cafe is the first farm-to-table restaurant that brings cannabis and cuisine under one roof.\n\nLos Angeles-based cannabis company Lowell Herb Co. is behind the restaurant, which is one of over 10,000 licensed cannabis operators in California, according to the state's cannabis portal.\n\n“We always wanted to be an institution, as far as West Hollywood is concerned,” Kevin Brady, Lowell Cafe’s director, told Yahoo Finance in an interview. \"We wanted to be a great restaurant that you could go to and, instead of having alcohol, replacing [it] with the social aspects of cannabis.”\n\nLowell Cafe brands itself as part of a “post-cannabis prohibition” atmosphere, a place where customers can enjoy the experience of pot consumption.\n\nExperienced smokers and novices are all welcome. Lowell has “flower hosts” that are similar to a restaurant’s wine sommelier, who can offer suggestions and explain any of the product strains, flavors and their level of potency.\n\nLowell Cafe interior More\n\nThe restaurant’s menu is organically inspired, and includes different forms of cannabis consumption. While cafe-goers can explore smoking, joints, pipes, bongs, and edibles, cannabis infused foods are not yet available because of California food restrictions.\n\n“Unfortunately, the West Hollywood regulations versus the state regulations aren’t necessarily at the same level, so we wanted to make sure [Lowell Cafe] abided by that,” said Brady.\n\n“It has been a unique opportunity for sure,” said Brady. “We’ve really put a lot of effort into working with the local municipality to make all of this come to fruition.”\n\nLowell Cafe menu items More\n\nWhile it became legal for licensed businesses to sell and distribute cannabis in the state back in 2018, not everyone in the West Hollywood neighborhood is on board with Lowell Cafe’s grand opening.\n\n“We’re the first of its kind, something new, something different, and a lot of people are a bit hesitant to see what that’s going to do” to the community, Brady explained.\n\n“What we want to demonstrate every single day is that we can, not only be a great business, and a great place that employs a lot of our local community, but also being a great neighbor to the community,” he added.\n\nAmid widespread concerns about the safety of vaping, Brady touted Lowell’s products as being of “the highest quality” — and the proprietors stood behind them.\n\n“Knowing that we have great partners there, we feel really confident as far as what we’re offering here is always going to be safe for the consumer, and at the same time using our flower hosts that are going to be able to walk our guests through any sort of concerns that they have, and their cannabis experience from start to finish,” he said.\n\n\n\n\n\nSarah Smith is a Segment Producer/Booker at Yahoo Finance. Follow her on Twitter @sarahasmith\n\nRead more:\n\nJunzi Kitchen pulls in $5M, puts a new spin on Chinese food\n\nHackers have become 'super criminals' that are hard to stop\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit.", "description": "\"We wanted to be a great restaurant that...instead of having alcohol, replacing [it] with the social aspects of cannabis,\" Lowell Cafe's director said.", "authors": ["Sarah Smith", "Segment Producer Booker"], "top_image": "https://s.yimg.com/uu/api/res/1.2/LSmJEriuZnzNKgov06PWFQ--~B/aD0zMTYyO3c9NTE1OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/7e61af40-e492-11e9-b99f-e3aed0f880c6"}