{"pub": "dailybeast", "url": "https://thedailybeast.com/epstein-accuser-sues-alan-dershowitz-over-alleged-sex-ring", "downloaded_at": "2019-10-16 20:33:40.022499+00:00", "title": "Epstein Accuser Sues Alan Dershowitz Over Alleged Sex Ring", "language": "en", "text": "Editor's note: Jeffrey Epstein was arrested in New York on July 6, 2019, and faced federal charges of sex trafficking and conspiracy to commit sex trafficking. On August 10, 2019, he died in an apparent jailhouse suicide. For more information, see The Daily Beast's reporting here.\n\nA new accuser has come forward against Jeffrey Epstein, claiming the billionaire pedophile and his alleged madam, British socialite Ghislaine Maxwell, sexually assaulted her and her underage sister on different occasions in the 1990s.\n\nThe allegations surfaced Tuesday as part of a defamation suit Virginia Roberts Giuffre filed against Harvard law professor Alan Dershowitz, a friend and attorney of Epstein’s who helped secure a controversial plea deal for Epstein after he was arrested in 2006 for molesting dozens of minor girls at his Palm Beach mansion.\n\nMaria Farmer, the alleged victim, also claims she witnessed Dershowitz visit Epstein’s Manhattan mansion and head upstairs, where she says underage girls were present.\n\nGiuffre has long claimed Epstein kept her as a “sex slave” and loaned her to his famous friends including Prince Andrew. (Both men have vehemently denied this claim.) She filed the lawsuit against Dershowitz in New York federal court, claiming the high-profile defense lawyer “was also a participant in sex trafficking, including as one of the men to whom Epstein lent out [Giuffre] for sex.”\n\nThe complaint accuses Dershowitz of employing “a desperate barrage of false and increasingly defamatory attacks” on Giuffre after a Miami Herald investigation revealed how Epstein and his lawyers obtained the infamous non-prosecution agreement that essentially resulted in Epstein getting a slap on the wrist for abusing the underage girls. Epstein served 13 months of his 18-month sentence for crimes that could have sent him to prison for life.\n\nDershowitz has recently accused Giuffre and her lawyers of framing him in order to get millions of dollars from Epstein’s only known client, Limited Brands chairman Leslie Wexner. He also accused another Epstein accuser, Sarah Ransome, of fabricating recent claims that she was coerced into sex with Dershowitz. (In response, Dershowitz called Ransome’s accusations “delusional” and claimed he’d never met her.)\n\nIndeed, Dershowitz challenged his accusers to sue him for defamation.\n\nIn response to the lawsuit, Dershowitz told The Daily Beast on Tuesday: “I welcome it. This lawsuit gives me the opportunity I’ve been looking for to prove Virginia Roberts has committed perjury and will continue to commit perjury in federal court.”\n\n“I am asking the FBI to come to this trial because perjury will be committed in front of a federal judge and in a federal courtroom,” Dershowitz added. “And I will prove it is she who is committing perjury.”\n\n“I will prove it from her own mouth as I have documents from her that acknowledges that I was not one of the people that she had sex with,” Dershowitz said.\n\nThe Daily Beast has left messages for attorneys for Maxwell and Epstein, and put in a call for comment from Wexner on Tuesday.\n\nIn the affidavit, Maria Farmer says she was an artist and grad student in New York City in 1995, when she met Epstein and his alleged madam, Maxwell, at an art show. The following summer, she alleges, the pair sexually assaulted Farmer in Ohio—and molested her 15-year-old sister at Epstein’s ranch in New Mexico.\n\nThe duo are accused of sexually assaulting Farmer while she stayed at Wexner’s Ohio mansion. At the time, Epstein had allegedly enlisted Farmer for a special art project at Wexner’s property, where she stayed along with her younger brothers.\n\n“ She alleges the pair sexually assaulted her in Ohio—and molested her 15-year-old sister at Epstein’s ranch in New Mexico. ”\n\n“Epstein said that if I sold him one of my paintings for half price he would help me with my career,” Farmer stated of their first meeting. “I sold him the painting that night for half price which was approximately $6,000.”\n\nMonths later, Farmer claims in the court filing, Epstein called her and claimed he was looking for an art consultant. But instead, Farmer was hired to become a lookout for the front door of Epstein’s East 71st Street mansion. Her job involved “manning the front door at his New York mansion and keeping records of people who came to the home,” she said.\n\n“During the time I was supervising the door at Epstein’s mansion, I witnessed a number of school age girls coming to the home, some of the young girls would be wearing their school uniforms,” Farmer’s affidavit added. Those girls would enter Epstein’s Upper East Side property, then be escorted upstairs, Farmer claimed.\n\n“When I asked Maxwell why these young girls were coming over to the house so often she said that the girls were interviewing for modeling positions,” Farmer stated. “At the time, based on my observations at the home, it did not seem credible to me that these young girls were interviewing for modeling positions.”\n\n“ During the time I was supervising the door at Epstein’s mansion, I witnessed a number of school age girls coming to the home, some of the young girls would be wearing their school uniforms... ”\n\nDershowitz visited Epstein’s New York residence “a number of times” while Farmer worked for Epstein, she said. “Dershowitz was very comfortable at the home and would come in and walk upstairs,” Farmer added. She claims Dershowitz went upstairs at the same time minor girls were present there.\n\nDershowitz denied Farmer’s claims, telling The Daily Beast: “Maria Farmer stopped working for Epstein before I ever met Epstein. It’s a totally perjured affidavit. It’s all totally made up. For her lawyers to submit these obviously perjured affidavits raises serious questions about their role in this case.”\n\nMeanwhile, Farmer claims her younger sister, who was 15 years old, was abused by Epstein and Maxwell, too.\n\n“Maxwell and Epstein took an interest in my younger sister. Epstein took us to a movie in New York and during the movie he held my younger sister’s hand and was rubbing her in a sexual manner without my knowledge,” Farmer said in her affidavit.\n\nEpstein “then contacted my mother and said he wants to help put my younger sister through a special school program in Thailand,” Farmer added.\n\nThat summer, Epstein and Maxwell allegedly flew Farmer’s younger sister to Epstein’s ranch in New Mexico, where they molested her on a massage table, the affidavit alleges.\n\nThe duo is accused of touching the girl inappropriately after directing her to remove her clothes and get on a massage table. “It was not until later in the summer when I called my sister in Thailand where she was studying that I learned what had happened to her at Epstein’s New Mexico ranch,” Farmer stated in the court filing.\n\n“ I called the FBI and made the report but to my knowledge, the FBI did not take any action against Epstein or Maxwell. ”\n\nWhile Farmer worked on her art project at Wexner’s mansion, she claims, Maxwell and Epstein sexually assaulted her. “They asked me to come into a bedroom with them and then proceeded to sexually assault me against my will,” Farmer said. “I fled the room and called the sheriff’s office but did not get any response.”\n\nWexner’s security, Farmer said, refused to let her leave the property. “I was held against my will for approximately twelve hours until I was ultimately allowed to leave with my father,” Farmer said. Her father had driven to Ohio from Kentucky to get her.\n\nFarmer claims that when she returned to New York and went to police at the Sixth Precinct for help, officers allegedly told her to contact the FBI to make a report about the supposed Ohio assault.\n\n“I called the FBI and made the report but to my knowledge, the FBI did not take any action against Epstein or Maxwell,” Farmer stated. “To my knowledge I was the first person to report Maxwell and Epstein to the FBI.”\n\nAfter the alleged assault, Maxwell and Epstein called Farmer multiple times to threaten her, Farmer claims. The pair also called her art clients and people in New York’s art world in a bid to destroy her career, the affidavit states.\n\n“Maxwell and Epstein worked in concert to make sure that my career and my life was ruined,” Farmer stated. “I was terrified of Maxwell and Epstein and I moved a number of time to try to hide from them.”\n\n“I have struggled throughout my life as a direct result of Epstein and Maxwell’s actions against me and my hope is that they will be held accountable for their crimes,” Farmer concluded in the affidavit. “While I am still afraid, I am coming forward because I think it is so important to do so.”\n\n“ 'Roberts was forced to engage in sexual acts with Dershowitz in, among other locations, Epstein’s mansion' in New York City, the lawsuit claims. ”\n\nGiuffre’s complaint provides further details on the scope of Epstein’s alleged sex-trafficking operation, citing flight logs of the financier’s private jet. A graphic of a map inside the complaint shows flights to Tangier, Granada, London and Paris.\n\n“During the time period that Roberts was being trafficked by Epstein she was forced to have sex with Alan Dershowitz,” the lawsuit adds. “Roberts was forced to engage in sexual acts with Dershowitz in, among other locations, Epstein’s mansion” in New York City.\n\nGiuffre accuses Dershowitz of lying about flying on Epstein’s private plane, dubbed the “Lolita Express” by the media, which he claims he took only with his wife. The lawyer traveled on Epstein’s jet with young women, including a Victoria’s Secret model, the complaint alleges.\n\nDershowitz is also accused by Giuffre of lying about his involvement with another of Epstein’s alleged victims, Sarah Ransome, who now lives in Spain and says she was introduced to Epstein in 2006 when she was 22 and living in New York.\n\nSoon after meeting Epstein, he allegedly flew her to his private isle in the Virgin Islands, where he directed her to have sex with him and “various other girls and guests,” according to an affidavit by Ransome, filed as part of Giuffre’s lawsuit.\n\nRansome claims Epstein at one point arranged for Dershowitz to represent her, and during that time, also “lent her out to Dershowitz for sex,” the complaint alleges.\n\n“At his town house I was also lent out by him to his friends and associates to have sex,” Ransome said of Epstein in the court filing.\n\n“ She was a woman that was trying to sell a story to the New York Post that she had sex tapes of Hillary Clinton, Donald Trump, Bill Clinton and Richard Branson. ” — Alan Dershowitz\n\n“Among the people he lent me to was his friend, Alan Dershowitz,” Ransome stated in the filing, dated April 8 2019.\n\n“On one occasion I was in a bedroom at Jeffrey’s New York townhouse with Jeffrey and Nadia Marcinkova,” Ransome added, referring to a woman identified as one of Epstein’s alleged “sex slaves.”\n\n“After a short time, Alan Dershowitz entered the room, after which Jeffrey left the room and Nadia and I had sex with Dershowitz,” Ransome concluded. “I recall specific, key details of his person and the sex acts and can describe them in the event it becomes necessary to do so.”\n\nDershowitz, as he has in the past, denied ever knowing Ransome.\n\n“I’ve never met her. I was never her lawyer,” Dershowitz told The Daily Beast.\n\n“She was a woman that was trying to sell a story to the New York Post that she had sex tapes of Hillary Clinton, Donald Trump, Bill Clinton and Richard Branson,” Dershowitz added. “She claimed to have had sex with practically everyone under the sun, but not me.”", "description": "As new woman claims the billionaire pedophile abused her and her underage sister.", "authors": ["Kate Briquelet", "Lachlan Cartwright", "Senior Reporter"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1555454166/190416-briquelet-dershowitz-epstein-tease_uo1zgo", "published_at": "2019-04-16"}