{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/breaking-british-fireman-dies-front-20653216", "downloaded_at": "2019-10-19 12:29:59.041646+00:00", "title": "'British fireman' dies in front of wife and kids during triathalon in Spain", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA British firefighter died in front of his wife and children while taking part in a triathlon in Majorca, it is reported.\n\nThe 45-year-old man was taking part in the 1.2-mile swim test in the tourist resort of Peguera at about 10am on Saturday.\n\nIt is understood he was seen in difficulties about 600 metres from the shore on Playa de Tora during the Challenge Peguera-Mallorca triathlon.\n\nLifeguards rescued him and performed resuscitation until the arrival of medics, who continued the efforts for more than an hour.\n\nHowever, the man was pronounced dead.\n\nHe suffered a cardiac arrest and had symptoms of drowning, according to the Spanish island's emergency services.\n\nHave you been affected by the incident? Email webnews@mirror.co.uk.\n\n(Image: Getty Images)\n\nThe man's wife and children were on the beach and witnessed the tragedy which caused great shock, including to the other competitors, Diario de Mallorca reported.\n\nThe news website said the victim was a 45-year-old firefighter from Britain.\n\nA full investigation is under way and a post-mortem will take place.\n\nThe race continued and live video of athletes crossing the finish line was shown on Facebook.\n\nOrganisers said in a statement on Facebook: \"It is with deep regret that the organisers announce the death of a participant in the Challenge Peguera-Mallorca 2019 triathlon event. The athlete has required medical attention during the swimming segment and has been treated urgently by the medical services of the event.\"\n\n\"Our condolences to all the family and people close to the athlete, whom we will continue to support.\n\n(Image: Google Maps)\n\n\"We are working closely with the security forces and local authorities to gather all the details about this event.\n\n\"All sporting events will be held, including this afternoon's awards ceremony, and out of respect for the family, celebration events are suspended.\n\n\"Out of respect for the family's privacy, for the time being, we will not make any further comments.\"\n\nThe local council expressed its condolences\n\nMore than 1,000 competitors from around the world were taking part in the middle distance triathlon, which was this year's last race in Europe for the Challenge Family circuit.\n\nOrganisers said 26 per cent of the athletes were from Britain.\n\nThe test consists of almost two kilometres (1.2 miles) swimming on the beach of Tora, followed by two laps on a circuit of 45 kilometres (28 miles) each by bicycle and, finally, 23 kilometres (14 miles) of race distributed in four laps of almost six kilometres (3.7 miles) each.\n\nThe popular event sold out for the third consecutive year and is now regarded as one of the best end of season triathlons in Europe.\n\nIt is aimed at combining a \"high quality\" event along with an autumn beach holiday for athletes and families.", "description": "The 45-year-old man was taking part in the swim test during the Peguera triathlon when he got into difficulties off Playa de Tora", "authors": ["Rita Sobot", "Chris Kitching", "Image", "Getty Images", "Google Maps"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20653304.ece/ALTERNATES/s1200/0_BLPP_CHP_PMI_16296JPG.jpg", "published_at": "2019-10-19"}