{"pub": "dailymail", "url": "https://dailymail.co.uk/debate/article-7628381/DAILY-MAIL-COMMENT-crucial-vote-War.html", "downloaded_at": "2019-10-30 02:27:29.846152+00:00", "title": "DAILY MAIL COMMENT: The most crucial vote since the War", "language": "en", "text": "Boris Johnson offers a fully-formed, Commons-passed, EU-approved deal. It would break the Brexit deadlock and allow our country to move on to fresh fields\n\nAfter all the sound and fury, the die is cast.\n\nOn December 12, for the third time in four years, the people will go to the ballot box to elect a new government.\n\nThey may not like doing it in the cold and darkness of mid-winter.\n\nBut we simply can’t afford to wait in suspended animation any longer. Our democracy is in desperate need of renewal.\n\nTo sighs of blessed relief up and down the country, an election means the coffin lid can at last be nailed down on this clueless zombie Parliament.\n\nSurely we can do better next time. For the sake of our collective sanity, we must.\n\nThis is easily the most important general election in 40 years – arguably since the War. The result will define our country’s destiny for a generation.\n\nSo before placing your cross on the ballot paper, you must ask yourself this question: What sort of Britain do I want to wake up to tomorrow morning?\n\nThe choices are stark.\n\nBoris Johnson offers a fully-formed, Commons-passed, EU-approved deal. It would break the Brexit deadlock and allow our country to move on to fresh fields.\n\nDon’t listen to the shrill claims of his opponents that he is some sort of Right-wing ideologue. This man is a liberal, outward-looking, One-Nation Tory – as his two terms as London mayor proved.\n\nHe wants to heal and revivify the NHS, not sell it off as Jeremy Corbyn alleges. And he’s prepared to inject record amounts of new money to help it in that process.\n\nHe has plans – also backed by significant extra funding – to put 20,000 more police on the streets, raise per-pupil funding in schools and fix the broken care system that successive Governments have shamefully neglected.\n\nAnd he is able to do this without crippling tax rises because of the financial prudence exercised by the Tories since 2010.\n\nAusterity has been difficult. But it has achieved its objective.\n\nDon’t listen to the shrill claims of his opponents that he is some sort of Right-wing ideologue. This man is a liberal, outward-looking, One-Nation Tory – as his two terms as London mayor proved\n\nFrom being close to the edge of oblivion after the financial crash, the British economy has recovered in a near-miraculous way.\n\nEmployment is at a record high, the deficit has been slashed, growth has been respectable, and real terms wages are back on the rise.\n\nOf course, we are not fully out of the woods, and reckless spending would soon put us back in the poor house. But thanks to the way his party has nursed the economy, Mr Johnson can afford to give public services the boost they need.\n\nHe believes in the free market as the best engine of prosperity, a state which helps rather than dominates the individual and a fair tax system that encourages enterprise. And he believes in Britain.\n\nAll in all, his is a hopeful and confident vision for a post-Brexit future. It is a message of optimism.\n\nContrast this with Mr Corbyn (who, despite his risible posturings yesterday, had to be bounced into this election), and his prospectus of doom.\n\nHe and his raggle-taggle Momentum army would have us believe the country is on the skids and can be saved only by a dose of hard-Left Socialism.\n\nHe characterises Britain as largely a nation of victims, surviving on state handouts and the charity of food banks because of a callous and uncaring Government.\n\nOf course, in its swingeing tax cuts for the low-paid and huge increases in the minimum wage, Tory Governments have put the poor at the top of their policy priorities for the last nine years.\n\nBut Labour is not interested in the truth. Only in stoking the politics of envy and repeating the ruinous tax, borrow and spend madness of the 1970s.\n\nRenationalisation of major industries, expansion of trade union power, an end to tuition fees, abolition of private schools (pure class war), a four-day working week with no reduction in pay, a £250billion public ‘investment fund’. And how would they pay for this? By massively increasing the tax burden on hard-working families and business. They even have plans to tax your home and garden.\n\nAll in all, Mr Johnson's is a hopeful and confident vision for a post-Brexit future. It is a message of optimism. Contrast this with Mr Corbyn (who, despite his risible posturings yesterday, had to be bounced into this election), and his prospectus of doom\n\nAs we learned to our cost the last time Britain was run by a Labour government in thrall to the unions, it always ends in chaos and national penury.\n\nIn the mid-1970s we were known as the Sick Man of Europe, with public services and industry on perpetual strike, productivity through the floor and inflation peaking at a staggering 27 per cent. Like all Socialists, they ran out of other people’s money. They would do so again.\n\nLet’s not forget this is also truly the nasty party. It is riddled with anti-Semitism (and being investigated by the Equality and Human Rights Commission), its supporters troll their own female MPs with chilling rape and death threats, and its leader is an apologist for terrorists and enemies of Britain.\n\nAre these really the kind of people you want running your country?\n\nBut there’s a third possible outcome to this election – and it’s almost as bad. Another hung Parliament. Another five years of stagnation and misery.\n\nCurrently the polls show a consistent Tory lead of 10 points or more.\n\nHowever, with its fortunes in decline in Scotland and Remain-dominated London, and the Brexit Party eating into its support, winning a majority is by no means a foregone conclusion.\n\nThe resurgent Lib Dems are a very real threat in both two-way and three-way marginals. And the Brexit party could make it much worse by splitting the Tory vote. Is that really what they want?\n\nThey cannot hope to form a government of their own and among other party leaders only Boris promises to honour the referendum result.\n\nSo if they want Britain to leave the EU at all, Brexit party voters must swallow their pride and vote Johnson. It’s their last chance. If they miss this one, there’ll never be another one.\n\nEqually, Remain-inclined Tories must look beyond the European issue and stay loyal. Yes, they may be feeling a little forlorn but a vote for the Lib Dems could put Mr Corbyn into Number 10.\n\nThey must surely see that no form of Brexit could ever be worse than that.\n\nMr Corbyn and his raggle-taggle Momentum army would have us believe the country is on the skids and can be saved only by a dose of hard-Left Socialism\n\nFor his own part, Mr Johnson must use his considerable charm and diplomatic skills to reach out to all voters. The restoration of the Tory whip yesterday to ten of the 21 rebels who voted against him in the Commons is a good start.\n\nThe opposition will try to paint Boris as untrustworthy, unserious and buffoonish. This is a ludicrous caricature. He has grown immeasurably in stature these last few weeks in office and has the potential to be a great Prime Minister.\n\nElectorally, he must learn from Theresa May’s mistakes of 2017. Don’t retreat into Downing Street and speak only at contrived and structured events. Get out there and woo the undecided voters.\n\nCabinet ministers must also be allowed to get out on the stump and argue the Tory case. And though they must maintain a coherent message, they cannot just repeat the same old mantras. It sounds insincere. Look what happened to ‘strong and stable government’.\n\nThe alternative to a workable Tory majority is too grotesque to contemplate. Jeremy Corbyn at the head of a chimera alliance of Lib Dems, Scottish and Welsh Nationalists and sundry fringe parties.\n\nWhile Labour was devising ever more elaborate ways to pick your pocket and flatten the economy, the SNP would be plotting to break up the Union. That truly would be a nightmare before Christmas.\n\nAs you prepare to make your cross on Thursday, December 12, just take a moment to think on that gruesome prospect. It would give Friday the 13th a whole new meaning.", "description": "DAILY MAIL COMMENT: On December 12, for the third time in four years, the people will go to the ballot box to elect a new government. They may not like doing it in the cold and darkness of mid-winter.", "authors": ["Daily Mail Comment"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/23/20352998-0-image-a-80_1572392415752.jpg", "published_at": "2019-10-29"}