{"pub": "yahoo", "url": "https://news.yahoo.com/harris-releases-plan-six-months-191722571.html", "downloaded_at": "2019-10-08 02:17:57.686284+00:00", "title": "Harris Releases Plan for Six Months of Taxpayer-Funded Family Leave", "language": "en", "text": "Senator Kamala Harris on Monday released a paid family leave proposal that is significantly more generous than those embraced by the rest of the Democratic presidential field.\n\nAs she campaigns in Iowa, the California Democrat detailed her plan to give workers up to six months of taxpayer-funded paid family and medical leave, twice the length of time provided by a family leave bill currently under consideration in Congress.\n\nAmericans who earn less than $75,000 annually would receive their full wages during their paid leave, while those who earn more would receive incrementally less compensation. Employees would be able to take leave for personal or family medical issues, including to care for domestic partners, parents-in-law, and “chosen family.”\n\nPrerequisites for claiming the benefits include “personal serious health conditions, caring for new children or family members with serious health conditions, or addressing medical or non-medical needs,” such as those arising from domestic violence or sexual assault, Harris’ plan states.\n\nSelf-employed workers, part-time employees, and independent contractors would all be eligible to claim the benefits.\n\nThe former California attorney general also said she would put pressure on Congress to pass the Child Care for Working Families Act, which would provide child care assistance to middle and lower-class families.\n\nThe program would be run by a new Office of Paid Family and Medical Leave, which would be paid for by a “combination of employer and employee payroll contributions and government expenditures paid for by tax increases on the top one percent and big corporations.”\n\nMore from National Review", "description": "Senator Kamala Harris on Monday released a paid family leave proposal that is significantly more generous than those embraced by the rest of the Democratic presidential field.As she campaigns in Iowa, the California Democrat detailed her plan to give workers up to six months of taxpayer-funded paid family", "authors": ["Mairead Mcardle"], "top_image": "https://s.yimg.com/uu/api/res/1.2/OhJ8YCcUDEikJL54kusgDQ--~B/aD01NzY7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/f078f0fb2bd11cd683ee0ff944a931ef", "published_at": "2019-10-07"}