{"pub": "euronews", "url": "https://euronews.com/2019/09/30/polyglot-or-mono-the-word-wars-in-brussels", "downloaded_at": "2019-10-05 11:22:18.371712+00:00", "title": "Polyglot or mono: the word wars in Brussels", "language": "en", "text": "Events to celebrate multilingualism day have been held around the European Union.\n\nAnd there are still lots of people who work in and around the EU institutions who are unhappy about the dominance of English.\n\nOn the streets of Brussels, you can speak whatever language you like, but while the EU institutions here celebrate the 24 official EU languages, there are many French people who believe their diplomatic language has been sidelined.\n\n\"There's a monolanguage regime and it is Anglophone. Here if you don't speak English, this \"global English\", some kind of naturalised English, well then, simply, you barely exist,\" remarks French journalist Jean Quatremer.\n\nWhile English, German and French dominate as second languages, there are actually more native Italian speakers than French.\n\nThe European Commission insists the EU is working hard to connect everyone through language.\n\n\"I think 25 per cent of our civil staff in Brussels are translators and interpreters because every European citizen should have the opportunity to communicate with us, the European institutions, in his or her native tongue,\" explains Johannes Hahn, Austria's EU Commissioner.\n\nDespite having the most first language speakers, German isn't mandatory for the EU Commission's spokespeople.\n\n\"It's actually our fault that there's not so much German spoken. Basically, the German officials are too happy to speak in the other languages like English - they're kind of Polyglot. When really we should be insisting that more German is spoken,\" says Heide Newsom, Brussels Correspodent for Grenz-Echo.\n\nEuropean Parliament plenary sessions can be listened to in any of the EU's 24 official languages, and many meetings and press conferences around the EU have simultaneous interpretation.\n\nBut calls for diversifying away from English will only intensify if Britain exit the bloc.", "description": "Despite Brexit, English remains a key working language in the EU, which creates a certain amount of friction with the French speakers in Brussels.", "authors": ["Joanna Gill"], "top_image": "https://static.euronews.com/articles/stories/04/19/17/08/1000x563_cmsv2_fad7de3d-2b0c-52e9-88ca-29a5977b766e-4191708.jpg", "published_at": "2019-09-30"}