{"pub": "washingtonpost", "url": "https://washingtonpost.com/religion/2019/09/11/religion-scholars-baptist-church-your-anti-islam-event-isnt-very-christian", "downloaded_at": "2019-09-11 07:26:59.912243+00:00", "title": "Baptist church cancels 9/11 anti-Islam event after backlash from legislators, Christian scholars", "language": "en", "text": "\n\nA Michigan-based church has canceled a two-day event about the threat of Islam called “9/11 Forgotten? Is Michigan Surrendering to Islam?” (Marta Lavandier/AP)\n\nA Michigan-based Baptist church canceled its anti-Islam 9/11 event on the eve of the anniversary after criticism from lawmakers and Christian scholars alike, according to a news report.\n\nBloomfield Hills Baptist Church had planned to host a two-day event starting Wednesday about what it calls the threat of Islam, labeled “9/11 Forgotten? Is Michigan Surrendering to Islam?”\n\nLast week, Donald McKay, pastor of the church, told Fox 2 that, “Islam is a growing threat in the United States of America,” without offering any evidence for his conclusion.\n\nState and congressional leaders have come out to denounce the Islamophobic event as one that doesn’t belong in the state or the country, while religious scholars say the event is grounded in a lack of biblical understanding and a growing need to assuage unfounded fears.\n\nState Reps. Abdullah Hammoud and Mari Manoogian, both Democrats, issued a joint statement about how disheartened they are that a holy place would be involved in something such as this.\n\n“With the rise of mass shootings by white domestic terrorists targeting those they deem ‘other’ we are deeply disturbed that a place of worship would host an event that continues to fan the flames of hate and intolerance,” they wrote.\n\nU.S. Democratic Reps. Debbie Dingell and Andy Levin of Michigan also issued a joint statement last week, requesting that the church “forgo the anti-Muslim events planned” for the week and to recognize the country’s diversity in the wake of recent attacks of “white supremacist violence.”\n\nThe denunciations might not mean much to McKay, a self-described Islamophobe.\n\n“I wear the badge proudly,” he told Fox 2.\n\n“We believe that Muslims, committed Muslims, that are familiar with their faith are committed really to the overthrow of the United States and world domination,” he told the station.\n\nAttendees of the event would have heard about how interfaith efforts are “sabotaging” the country and the church and how “Islam is destroying America from within,” according to a flier.\n\nShahram Hadian was scheduled on the first day to discuss “the growing deception of interfaith dialogue” and “blow the lid off the lie that ‘Islam is an Abrahamic faith,’ ” according to Hadian’s Truth in Love Project website.\n\nConservative economist Jim Simpson was supposed to talk Thursday about how the Islamic faith is destroying the country.\n\nNeither Hadian nor Simpson responded to requests for comment.\n\nThere is nothing Christian about what the church is doing, only the human instinct to be fearful, said Matthew Kaemingk, an assistant professor of Christian ethics at Fuller Theological Seminary and author of “Christian Hospitality and Muslim Immigration in an Age of Fear.”\n\nAt one point, American Christians saw communism as a primary threat to identity and way of life, but new “others” were needed when communism fell, he said.\n\n“What is happening to this church is that they are falling into sin, and they’re being blinded by sin,” he said. “They are being ruled by the politics of fear and not the politics of Jesus.”\n\nMcKay told Fox 2 he wasn’t speaking on behalf of his church, even though he said: “We don’t hate Muslims. We hate the ideology they are identified with.”\n\nMcKay didn’t respond to The Washington Post’s requests for comment.\n\nHating Islamic ideology and not its practitioners is a way of trying to escape the “bigot” label, said Todd Green, an associate professor of religion at Luther College and former Islamophobia adviser to the U.S. State Department.\n\nGreen pointed to a recent Institute for Social Policy and Understanding poll published in May, which found that white evangelicals were the least likely to know a Muslim compared to Protestants, Jews and Catholics. The poll also found that those who know a Muslim as a close friend or even just as an acquaintance are more likely to have a favorable view compared with those who don’t.\n\n“The personal relationships with Muslims, that’s a game changer,” Green said. “It tends to make you less Islamophobic.”\n\nJust over 75 percent of Oakland County, where Bloomfield Hills Baptist Church is located, is white, according to census data.\n\nEvents such as these try to cast suspicion and promote hostility toward Muslims, Green said, and a “native informant” such as Hadian, an Iranian-born Muslim turned pastor, merely upholds prejudiced beliefs.\n\nBut fearing Muslims doesn’t compute when considering the number of Muslims in the country, according to Green.\n\nMuslims made up about 1.1 percent of the U.S. population in 2017, according to a Pew Research Center estimate. That number is expected to grow to 2.1 percent by 2050. Christians were nearly 71 percent of the population in 2014, according to Pew.\n\nGabriel Said Reynolds, professor of Islamic studies and theology at the University of Notre Dame, said the fears surrounding Muslims are irrational responses to a number of factors, which include the persecution of Christians in the Islamic world.\n\nFour out of the five countries with the highest rate of Christian persecution were majority-Muslim, according to Open Doors USA, a nonprofit organization serving persecuted Christians. The United States didn’t rank at all on its top 50 list of countries with high risks of Christian persecution.\n\nRead more:\n\nReport: Over 120 Syrian churches damaged by war since 2011\n\nHow anti-Semitic beliefs have taken hold among some evangelical Christians\n\nAlaska reaches settlement in case brought by Muslim inmates", "description": "Bloomfield Hills Baptist Church had planned to host a two-day event about what it calls the threat of Islam, labeled “9/11 Forgotten? Is Michigan Surrendering to Islam?”", "authors": ["Lateshia Beachum", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/2rtAjt76pmjjqV_zMOpHjDSRz9g=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/I3JQ5YVBUQI6TJ3H26VYJLXT5E.jpg", "published_at": "2019-09-11"}