{"pub": "dailybeast", "url": "https://independent.co.uk/news/uk/home-news/clash-of-the-oligarchs-1753022.html", "downloaded_at": "2019-10-01 04:28:13.291657+00:00", "title": "Clash of the oligarchs", "language": "en", "text": "Two oligarchs from the former Soviet Union, who built up vast fortunes in the anarchic era that followed the fall of communism, will go head to head today in Britain's Court of Appeal. At issue is a debt that one, Michael Chernoy, claims the other, Oleg Deripaska, has failed to repay – a small matter of £2bn.\n\nBoth men have friends in high places. Although he is a close associate of Russia's Prime Minister and former president Vladimir Putin, and is said to have been the richest man in Russia before the credit crunch, Mr Deripaska only became truly famous in Britain after both the Business Secretary, Lord Mandelson, and the Shadow Chancellor, George Osborne, found themselves aboard his yacht off the coast of Corfu last summer. Mr Chernoy, meanwhile, is a good friend of Israel's controversial right-wing foreign minister, Avigdor Lieberman, who is currently under a police investigation for corruption that could yet remove him from office.\n\nFor British political junkies there is an added frisson, in that Mr Deripaska's public relations are being handled in London by Tim Allan, a former long-standing aide to Tony Blair, and Mr Chernoy's by Lord Bell, the one-time PR guru of Margaret Thatcher.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe case turns on two dramatically different versions of what happened when the two men met at London's Lanesborough Hotel back in March 2001. Almost every important fact is disputed by the two men, even down to whether they had lunch together at the Lanesborough that day. Mr Chernoy says they did; Mr Deripaska says that he has no recollection of it. Mr Chernoy's contention was that they met to discuss details arising out of a merger between Sibal, the aluminium company they jointly controlled, and Sibneft, owned by three other oligarchs including the Chelsea Football Club owner Roman Abramovich, in which both companies would together take a 50 per cent share in Rusal, the world's largest producer of aluminium.\n\nAccording to Mr Chernoy, Mr Deripaska agreed to pay him $250m for his Sibal shares, and to hold 20 per cent of Rusal shares on trust for him, selling them some time between March 2005 and March 2007 and handing over the proceeds minus the $250m (£150m) already paid. Rusal later merged with two other companies to form United Company Rusal (UCR) and the former Rusal shareholders held 66 per cent of the new entity – a stake estimated last year to be worth $23bn. Mr Chernoy's claim is therefore for 13.2 per cent of UCR – or $4.35bn at last year's values after deductions.\n\nMr Deripaska's version is that, far from being a business partner of Mr Chernoy, he paid him the $250m because of a protection racket Mr Chernoy operated with a Russian mobster, Anton Malevsky, the reputed head of the Ismailova organised crime gang. The sum was being paid, Mr Deripaska insisted, to buy off Mr Chernoy.\n\nMr Chernoy has cited two documents which he said were produced by Mr Deripaska that day, one detailing the $250m payment and the other providing for the future sale of shares. Mr Deripaska insisted the second document did not relate to Mr Chernoy at all, but was a proposal he intended to put forward to Mr Malevsky, who died in a parachuting accident in South Africa later that year.\n\nToday, Mr Deripaska is appealing against last year's High Court ruling that granted Mr Chernoy's application for the case to be tried in Britain rather than in Russia. The Ukrainian-born Mr Chernoy has not visited Russia since he emigrated to Israel in 1994 and argues that if he does he could be assassinated or arrested on trumped up charges. He also claims he would not receive a fair trial because the courts are heavily influenced by a government friendly to Mr Deripaska.\n\nWhile much of that High Court judgment hinged on whether Russian courts were sufficiently fair and independent to try the case, it inevitably also examined some of the background of the two men and an association between them that goes back to the early 1990s. Both have been accused of links with Russian organised crime. Such groups figured in the often violent \"aluminium wars\" that characterised the struggle for control of the industry in the 1990s. Both men deny such links.\n\nIn the initial hearing last year, Mr Justice Clarke said he considered that Mr Deripaska had \"much the better side of the argument\" in rejecting Mr Chernoy's assertion that there was an oral agreement for any dispute to be decided in the British courts.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nBut \"insofar as any judgment can be made on the present material\", the judge added, Mr Chernoy had \"much the better side of the argument\" on whether there was an agreement to sell the Rusal shares and \"account to Mr Chernoy for the price\".\n\nHe was careful to preface his remark on the latter point by identifying the one certain fact in the whole saga. \"I cannot and do not purport to determine who is right on this,\" he said. \"One side or other is plainly telling lies on a grand scale.\"\n\nOleg Deripaska\n\nAGE: 41, BORN IN: Russia, LIVES IN: Moscow with £25m pad in Belgrave Square, NET WORTH: £2.1bn according to Forbes Rich List 2009, FAMILY: Married with two children, FAMOUS FRIENDS: Vladimir Putinand Lord Mandelson\n\nMichael Chernoy\n\nAGE: 57, BORN IN: Ukraine, and raised in Uzbekistan, LIVES IN: Israel after emigrating there in 1994, NET WORTH: Unknown, FAMILY: Married with four children, FAMOUS FRIENDS: Israeli Foreign Minister, Avigdor Lieberman", "description": "Two oligarchs from the former Soviet Union, who built up vast fortunes in the anarchic era that followed the fall of communism, will go head to head today in Britain's Court of Appeal. At issue is a debt that one, Michael Chernoy, claims the other, Oleg Deripaska, has failed to repay – a small matter of £2bn.", "authors": ["Donald Macintyre"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2009/07/19/23/220992.bin", "published_at": "2009-07-19"}