{"pub": "reuters", "url": "https://uk.reuters.com/article/soccer-spain-rcd-mad-report/mallorca-claim-stunning-win-over-real-madrid-idUKKBN1WY0OW", "downloaded_at": "2019-10-20 00:43:40.433328+00:00", "title": "Mallorca claim stunning win over Real Madrid", "language": "en", "text": "PALMA, Mallorca (Reuters) - Real Madrid’s unbeaten start to the La Liga season came to an abrupt and surprising end as Real Mallorca claimed a stunning 1-0 victory at a rocking Son Moix on Saturday to climb out of the relegation zone.\n\nSoccer Football - La Liga Santander - RCD Mallorca v Real Madrid - Iberostar Stadium, Palma, Spain - October 19, 2019 Mallorca's Iddrisu Baba in action with Real Madrid's Brahim Diaz REUTERS/Javier Barbancho\n\nThe Balearic Islanders had only managed six goals in their opening eight games of their first season back in the big time, but one was enough to down their illustrious visitors.\n\nIt was a cracker too, thrashed home in the seventh minute by Ivorian Lago Junior who with one swing of his right foot wrote his name into Mallorcan sporting folklore alongside tennis great Rafa Nadal who celebrated his wedding earlier.\n\nLocal boy Nadal is a Real Madrid fan but surely would have raised a glass in honour of Lago Junior and the fighting spirit of a team written off a relegation fodder before the season.\n\nReal Madrid, 5-0 winners on their most recent trip to the island in 2012, were without several big names including Luka Modric, Gareth Bale, Toni Kroos and Eden Hazard, but could have no complaints as they failed to function.\n\nDefeat cost them the chance of reclaiming top spot from Barcelona who won earlier in the day and they will have to bounce back quickly with a crucial Champions League clash against Galatasaray on Tuesday having picked up only one point in their opening two matches.\n\nA disgruntled Zidane refused to use the absentees as a reason for the loss.\n\n“These players are injured, and we have others who are good too. But they must show that every time they play, that they have the level to play for Madrid. Today we didn’t,” he said.\n\n“We must be more consistent if we are to do anything good this year, have more life in our play. Today we didn’t have that. “Our start to the game was very bad.\n\n“In second half we did not create many clear chances, we lacked a bit of everything today.”\n\nWILD CELEBRATIONS\n\nIt was no smash and grab raid by Vicente Moreno’s Mallorca who produced a tenacious display full of energy to beat Real for the first time since 2006, sparking wild celebrations.\n\nMoreno led Mallorca back to La Liga via the playoffs in June and after an opening day win they have found it tough.\n\nBut they backed up their win over Espanyol before the international break with a performance that will fuel belief they can survive.\n\n“We have achieved in the two previous years more important things than winning one game,” Moreno told reporters. “Three points was vital, regardless of the opponent.\n\n“We played the game we had to do. There were times we lacked peace of mind and suffered, but in the end we had some luck. Everything has come together and from time to time you win.”\n\nMadrid began casually and were rocked when Lago Junior cut in from the left and lashed a right-footed shot across Thibaut Courtois and inside the far post.\n\nThe home fans were in delirium soon afterwards when top scorer Ante Budimir thought he had made it 2-0 by thumping a shot past Courtois but the goal was rightly ruled offside.\n\nSlideshow (4 Images)\n\nKarim Benzema struck the woodwork for Madrid before halftime with a half volley and Brazilian Vinicius Jr threatened with his pace, although there was no end product.\n\nWith James Rodríguez and Isco making little impact the expected second-half siege failed to materialise and Madrid played the last 15 minutes with 10 men after Alvaro Odriozola received a second yellow card for a reckless foul that summed up their night.\n\nMallorca held firm with relative ease for their third victory since returning to the top flight following a six-year absence. They moved up to 14th with 10 points while Real are second, one point behind Barcelona.", "description": "Real Madrid's unbeaten start to the La Liga season came to an abrupt and surprising end as Real Mallorca claimed a stunning 1-0 victory at a rocking Son Moix on Saturday to climb out of the relegation zone.", "authors": ["Martyn Herman", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191019&t=2&i=1442786952&w=1200&r=LYNXMPEF9I0LO", "published_at": "2019-10-20"}