{"pub": "afr", "url": "https://afr.com/companies/financial-services/this-was-probably-the-last-decent-chance-amp-had-20190825-p52kn4", "downloaded_at": "2019-10-05 06:05:06.993238+00:00", "title": "'This was probably the last decent chance AMP had'", "language": "en", "text": "But where many others would have run in fright, De Ferrari saw a burning platform. Could the royal commission provide an opportunity for him to become an agent of change? It was a role he’d always craved.\n\nHe began to dig around AMP’s purpose, and was struck by its Latin motto, “Amicus certus in re incerta”, which translates as “a certain friend in uncertain times”. This tickled his sense of history and played to his Catholicism.\n\nWithin the week, De Ferrari had spoken to David Murray. The former Commonwealth Bank boss had been appointed chairman of AMP in early May 2018, defusing an investor revolt just days after the inglorious exit of Catherine Brenner. The royal commission had revealed her heavy-handed intervention in a supposedly independent investigation by the company’s legal advisers into the fees-for-no-service scandal.\n\nMurray knew of De Ferrari as he had been an adviser at Credit Suisse since finishing up as chairman of the 2014 financial system inquiry.\n\nAMP chairman David Murray, right, with De Ferrari at the company's AGM in May. Louie Douvis\n\nIt was at a Credit Suisse management offsite in mid-2017 at the Royal Motor Yacht Club in Sydney that Murray caught a presentation by De Ferrari to the bank’s senior management team. The topic: the forces of change sweeping through financial services markets in Asia.\n\nWhen De Ferrari’s name appeared on the list Egon Zehnder put to the desperate AMP board a year later, Murray did his own digging.\n\nHe figured the beleaguered AMP could do with a dose of the Credit Suisse culture: a unique blend of United States investment banking entrepreneurialism and Swiss wealth expertise. He discovered De Ferrari had led the technological transformation of Credit Suisse’s private banking business in Asia, the centrepiece of which was a new digital platform to engage with customers.\n\nHis CV pointed to an entrepreneurial spirit. Before his 17 years at Credit Suisse, the son of a chemist at Dow Chemicals had spent time at McKinsey and in start-ups, and had worked across Asia for Nestlé.\n\nAdvertisement\n\nAMP had found a match.\n\nDe Ferrari decided he’d had enough serving the uber rich, and his family was keen on a new adventure. He negotiated a healthy package – a potential $8.3 million in annual salary, bonus and long-term incentives, and an additional $12 million if he sticks around to 2022 to buy out the incentives he was due at Credit Suisse – and the appointment was announced in August.\n\nOn December 1, he showed up for work at the Sydney Cove building that had opened as home to the Australian Mutual Provident Society in 1962.\n\nIn a wide-ranging interview with AFR BOSS magazine seven-and-a-half months into the gig, De Ferrari is reflective.\n\n“My dream has always been trying to build a new type of financial services company that thinks more like a fast-moving consumer goods tech start-up,” he says. “AMP was a unique opportunity. It was a large financial institution that had great assets, millions of clients, a strong presence in the market and communities, and a beautiful sense of purpose. But it was under such pain and disruption that it had a huge mandate for change.”\n\nFor De Ferrari, who has just turned 50, and the AMP board that selected him, the stakes could not be higher. Murray tells BOSS: “This was probably the last decent chance AMP had. The company has a very solid, long history, notwithstanding the royal commission. It is still a very important brand. But as one of the larger financial institutions, it had to reform itself if the whole system was to reconstruct its credibility with the public in Australia. Those were things that seemed to appeal to Francesco.”\n\nMeeting BOSS the week after presenting his bold transformation plan to a sceptical market on August 8, De Ferrari is looking relaxed and chirpy. He clearly has personality, presence and a healthy dose of charisma.\n\nDuring the photo shoot, he’s flirty with his minders. When the interview kicks off upstairs, in a glass-panelled boardroom overlooking Sydney Harbour on a chilly winter afternoon, a waitress enters to take a drinks order. He cheekily asks for a vodka. (It’s changed to a cappuccino.) Brokers say AMP lunches are fun again after a decade of dreariness and turmoil as management lurched from crisis to crisis.\n\nAdvertisement\n\nJohn Knox, chief executive of Credit Suisse in Australia, who worked with De Ferrari on the firm’s Asian executive committee for four years, describes his style as “very friendly and positive. He’s a leader for growth and rebuilding a business. He likes that challenge.\n\n“I remember him talking about us needing to make our clients better investors, because if they are better investors, they will make more money, and what’s good for them should be good for us.”\n\nThe outgoing chief executive of UBS in Australia, Matthew Grounds, who has also worked closely with De Ferrari, adds: “He is obviously dealing with a challenging situation, but doing so with energy and drive, and providing a clear direction for the company’s future.”\n\nWith the royal commission sapping staff morale, De Ferrari is trying to restore a sense of entrepreneurship and pride. Within weeks of his arrival, he launched an employee share plan which gave each AMP staff member $1000 in shares. He asked them for three things: think like the owners of the business; spend the company’s money as if it were your own; and don’t sell products or services to anyone that you wouldn’t buy yourself.\n\nDe Ferrari must also deal with anger from advisers after he ended a long-standing arrangement. David Rowe\n\nBut turning around AMP’s morale – not to mention the stock price, which has lost $12 billion in market capitalisation since the royal commission revelations – will require huge effort. Among professional analysts who have tracked its misfortunes over many years, there is scepticism anyone could fix its woes in the three-year timetable De Ferrari has set.\n\nHe is reinventing the entire business model for AMP, and for the wealth management industry more broadly. All while three of the four major banks have decided to bail rather than fix the mid-market financial advice model. The fourth, Commonwealth Bank of Australia, is a reluctant participant at best.\n\nAt the top of his extensive to-do list is re‑establishing trust with regulators, after the Hayne inquiry revealed AMP’s disregard for long-held concerns of the Australian Securities and Investments Commission (ASIC) relating to overcharging customers. De Ferrari looks like he will have to navigate the company through complex litigation, as ASIC considers whether to bring proceedings against it.\n\nDe Ferrari on a call with an AMP customer. Supplied\n\nAMP is also at war with many of its advisers. Plans to substantially reduce the multiple at which advisers can sell back their businesses to AMP, under a long-standing arrangement, have been met with threats of legal action.\n\nAdvertisement\n\nDe Ferrari says if advisers are not willing to recognise the realities of digitisation washing over their industry and many others, there’s no place for them in his new AMP.\n\nIt’s the one part of the interview where his relaxed vibe changes to a more defensive and confrontational tone. AMP has not specified a number, but it is expected to lose about 30 per cent of its 2300-strong team of advisers.\n\n“The wealth business is going to shrink before it can grow again,” De Ferrari says. “What’s core for me personally, and for AMP, is this is a once-in-a-lifetime opportunity to re-pivot our business to really solve a large societal need. The low interest rate environment and lack of advice in this country is going to be a big issue. If we get this right, we can make a material difference.”\n\nThis focus on a broader social mission is consistent with De Ferrari’s thinking throughout his career. After graduating near the top of his class at the Stern School of Business at New York University (an economics and international relations major), he received an offer to join Goldman Sachs. But after a stint in India working with Mother Teresa, he decided Wall Street wasn’t for him.\n\nThe practising Catholic is grounded in family. He describes one of the reasons he joined AMP was to satisfy his “kids’ litmus test”. Would Credit Suisse’s wealth strategy, which is primarily focused on serving rich clients, cut the mustard in terms of paternal credibility?\n\n“I see myself at my 80th birthday party, and what my kids are going to say about their dad that made them proud. Making rich people richer isn’t going to be in the top five. But the ability to use what I learnt over 17 years [at Credit Suisse] and make a difference for people – that is going to matter a lot.”\n\nDe Ferrari leads a staff briefing. Supplied\n\nFor now, his family has given the move their thumbs up. His eldest son has stayed in Singapore to finish school, but his other son and three daughters are enjoying their new base in Darling Point.\n\nDe Ferrari enjoys casual tennis games with the children on weekends, and is keen to learn to surf when the weather gets warmer. He’s been doing the odd bit of yoga and meditation. Sydney “is a great lifestyle – if you have time to enjoy it,” he says. “I got sold this dream of weekends in Australia. But I spend most of Saturday in a car, shuffling my kids around.”\n\nAdvertisement\n\nHis best career choice is “marrying my wife”, he says. It’s both love and pragmatics. “I would not be where I am if I didn’t have a wife, and family, to support me on my adventures. Every good, strong CEO needs a very solid set-up to be able to weather everything that goes on in these jobs.”\n\nFor the past couple of months, there’s certainly been a lot going on. He’s been bunkered down with senior executives, including a new head of wealth management, Alex Wade, who also came from Credit Suisse, consultants from Bain, and investment bankers from UBS and Credit Suisse doing deals to support the growth plan.\n\nAt the interim results on August 8, there was a lot to digest. The team reinvigorated the sale of AMP’s life insurance unit, unveiled the foundations of a new strategy to bring financial advice to the masses, and announced a $650 million capital raising to pay for it.\n\nIf De Ferrari can reinvent the model for financial advice, he will be seen as a miracle worker. Slicing the cost of advice to a level customers are willing to pay might sound simple, but it’s proved elusive. Pulling it off will require AMP to flip the existing economics of the advice industry on its head and refocus its attention to customers.\n\nA big focus of our business model is going to be to simplify: the product sets, the operating model and the fees to the client. — Francesco De Ferrari, AMP CEO\n\n“The client for AMP has been the financial adviser,” De Ferrari says in his hybrid US-European accent, leaning forward intently. “In the strategy we have put forward, the client is the end client. That is where we are going to pivot the organisation, and that is a fundamental shift.”\n\nMajor banks tried to crack retail wealth, making massive acquisitions of wealth businesses at the turn of the millennium, but divisions under-delivered and caused most of the reputational damage.\n\n“The Aussie banks have behaved no differently than the global ones,” De Ferrari says. “My experience has been if you try to build wealth, from a banking perspective it is very hard to make it work. But if you start from wealth and then you go into banking, you have a completely different rate of success.”\n\nSo what does the plan for AMP look like? The new model will not be some fully automated, “robo advice” offering. This term typically refers to online wealth advisers who assess customers with a web-based questionnaire before placing them into low-cost exchange traded funds (ETFs).\n\nAdvertisement\n\nAMP does have plans for more automation and customer self-service, but motivated, productive, professional, educated and engaged financial advisers, who are willing to work with new technologies, will be central to the future. The new model is about connecting customers’ whole financial lives into an “ecosystem” that manages their goals, tracks budgets, and involves advisers along the way.\n\nSome AMP insiders are thinking about a model where advisers work like doctors who run diagnostics then sit with patients to digest the results, reassure, treat and manage, maintaining relationships over lifetimes.\n\nAt the heart of the new strategy will be AMP’s Goals360 platform, which it wants to repurpose for the mass market. AMP is thought to have invested more than $200 million in the digital tool, which helps clients map out what they want to achieve in life and advises about investments needed to meet these goals.\n\n“Goals360 is a phenomenal tool,” De Ferrari says. “It is more sophisticated than what most private banks would have today. AMP is the only company I have seen that has invested in digitising the front-end piece of advice.”\n\nAMP, which is expected to spend more than $1 billion over the next three years to reshape its business, also plans to broaden the scope of its North wrap platform, to orient it around customers as much as advisers.\n\nDe Ferrari also pledges to work with the technology community, realising the limitations of trying to build everything in-house. That time, he says, is “long gone”.\n\nLocal fintech start-up MoneyBrilliant, which AMP acquired in 2016, is set to play a core role facilitating engagement with new customers. Its app analyses customer spending data and provides tips for savings.\n\nThe erosion of trust triggered by the royal commission could provide AMP's biggest challenge. Tamara Voninski\n\nAMP is not alone in thinking about how to bring digital advice to the mass market. De Ferrari says he’s looked at all competitor models but is taking his cues more broadly than the financial services sector.\n\nAdvertisement\n\n“Financial services is not prepared for what is coming. I find it fascinating to think how the next generation behaves. It is dramatically different to what we have in mind. This business is going to be tech and data driven.”\n\nHe sees a future where AMP will tap big data to help it suggest financial products to customers, based on the choices made by those at a similar life stage, level of earnings or number of dependants, just like Amazon’s or Netflix’s algorithm serves up ideas for new books to read or films to watch.\n\n“You could get to an Amazon-based more generic advice tool – that does not require an 80-page statement of advice and three meetings that cost you $5000 – to get some directional advice on certain things,” he says.\n\nHe’s watching Chinese fintech powerhouse Ant Financial. “They have used behavioural profiling in credit scoring … This won’t suit all markets. But you can see they start from the customer need and build solutions.”\n\nDe Ferrari is also learning from mobile apps like the wildly popular game Candy Crush. “It effectively uses behavioural psychology and the release of endorphins in your brain to get you to play and learn as you play.”\n\nMany observers think incumbents will struggle to respond to the speed of technology developments and will be burdened by legacy systems, bureaucracy and a lack of IT development skills.\n\nCiti analyst Nigel Pittaway says: “One of the issues at the moment is that most of the technology seems to need further development for this to come to fruition, with robo solutions currently inadequate.\n\n“Another difficulty in developing technological solutions currently is that the industry is changing very rapidly, so technology needs to be able to provide the solutions relevant in a number of years’ time when the advice industry could look very different.”\n\nRoyal commissioner Kenneth Hayne was also sceptical that technology would provide the solution to the wealth industry’s woes.\n\nAdvertisement\n\nClient engagement is another challenge. One of the reasons the banks have fled wealth is their inability to engage with customers on smartphones about their financial life journey. The introduction of open banking should help, as it will give wealth service providers insights into customers’ spending patterns, says Patrick Garrett, co-founder and CEO of digital advice start-up Six Park.\n\nThe erosion of trust triggered by the royal commission could provide the biggest challenge. Consumer research released by ASIC in late August found “significant distrust of the industry” as a key reason Australians weren’t seeking financial advice, along with a perception it is only for the wealthy.\n\nDe Ferrari will have to restore trust as negative headlines keep rolling and advisers revolt, and if lawsuits are forthcoming.\n\n“In the longer run, scaled advice to the mass market presents opportunity, but demands a leap of faith,” says Morgan Stanley analyst Daniel Toohey, who believes AMP could evolve advice into a tech-based ecosystem for planners and customers. “But brand damage from the fallout during the royal commission is a major impediment to execution in the near term.”\n\nDe Ferrari addresses an AMP leadership group ... “His town halls were well structured, comprehensive and substantial. Staff realise he knows what he is talking about,\" says one private investment banker. Supplied\n\nOn top of the $80 million it has already spent on customer remediation, AMP is expecting to pay a further $700 million. As with the banks, the costs of running the program have been large. Complex instructions have been slowing things down and increasing administration costs, for which De Ferrari says ASIC should shoulder some responsibility.\n\n“Why can’t we find a way to run this faster and get more money to clients faster? It’s been a complicated set of discussions.”\n\nThe reality is AMP and the major banks are going to have to work together with regulators to restore trust, he says, revealing the olive branch he put out to the chairmen of ASIC and the Australian Prudential Regulation Authority. “Financial institutions and regulators are on the same team. We have to be. I, with no shame, go to both [ASIC’s] James Shipton and [APRA’s] Wayne Byres and say ‘I am here to help, I want to fix this business model, I need your help in doing that’.”\n\nTo survive, AMP will need to flip its economic model on its head to earn more from selling advice directly to clients and less from packaging up products and providing distribution via platform administration.\n\nAdvertisement\n\nOf its $1.3 billion in wealth management revenue in 2017-18, AMP earned just $100 million from providing advice, according to Morgan Stanley. “The challenge is navigating the broader market fee squeeze across product and platform as the model shifts while recapturing advice fees to offset this,” Toohey says.\n\nAMP will need to be far more nimble. The group was slow to understand the significance of banning commissions on financial products and the end of volume-based payments to dealer groups in 2012. It was slow to see that life insurance was becoming expensive, and failed to grasp the extent of conflicts of interest inherent in the business model. “A big focus of our business model is going to be to simplify: the product sets, the operating model and the fees to the client,” De Ferrari says.\n\nThat is something he’s tackled before, when he ran Credit Suisse’s operations in Italy. It had a similar business model to AMP, built around “financial agents” and employees, which had been hit with European regulations that outlawed conflicted remuneration.\n\nDe Ferrari created a model where both channels – directly employed advisers and entrepreneurial, aligned ones – operated side-by-side, and the firm’s economics was indifferent to which one customers used for advice.\n\n“We had to completely rethink how we presented our value proposition to clients. The most important thing is to create a structure for fees that eliminates conflicts for the end client. If you do that, you can solve the equation.” The transformation took three years, and the Italian business became profitable.\n\nIn Singapore, he built digital capabilities to create Credit Suisse’s Digital Private Bank. Its idea was to augment the adviser and, using technology to create content, support research and provide risk analytics and portfolio measurement tools. It is used by 60 per cent of the private bank’s clients.\n\nDe Ferrari also knew the power of the cross sell, bringing new customers into Credit Suisse’s wealth world via the investment bank and mortgage offerings. “Leadership happens in repetition, it is systematic,” says an Asian-based private banker who worked on the same floor as De Ferrari in Singapore during this period. “His town halls were well structured, comprehensive and substantial. Staff realise he knows what he is talking about.”\n\nBoard satisfied\n\nAfter resetting his remuneration triggers to reflect the sagging AMP share price, AMP’s board appears satisfied with De Ferrari's first few months in the role. Murray says AMP’s strategy reset has been far more complex than the board or De Ferrari first thought: “It’s still early days in a multi-year change program, but so far he has done everything the board asked him to do when we appointed him.”\n\nThe interview time is up and BOSS asks De Ferrari what he has found the biggest change working here. He names three: the intensity of scrutiny on business (“I have not seen that in any other market”); the high price of things in the land of the oligopoly; and the complexity of regulation.\n\nHe says the latter will make it harder for Australia to become a centre for regulatory technology, as the government wants it to be. “I don’t think I would take Australia as a foundation to build regtech because the ‘reg’ is very complex,” he says.\n\nBut true to his style, De Ferrari wants to end on a positive note. He says Australia has a competitive advantage in exporting its “competency in managing pension schemes”, pointing to AMP being the only foreign player to have a joint venture in the Chinese pension sector, one that China sought out because it saw a unique core competency, of which “Australia should be proud”.\n\n“And if we can crack digital, goals-based advice, this could be another thing Australia could export and be proud of.”\n\nJust as De Ferrari wants his kids to be of him.", "description": "Others might have run away in fright when offered the top job at AMP. Francesco De Ferrari saw it as an opportunity to reinvent the business.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3243%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_127%2C$y_370/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/52d09cf0b18b8d0b886893874b6c68764db9ce6b", "published_at": "2019-08-25"}