{"pub": "nyt", "url": "https://nytimes.com/2019/09/26/us/politics/trump-treason-spies-whistle-blower.html", "downloaded_at": "2019-09-26 23:46:52.636643+00:00", "title": "‘Spies and Treason’: Read a Transcript of Trump’s Remarks Related to the Whistle-Blower", "language": "en", "text": "And then they talk about me, and I didn’t do anything. I don’t know if I’m the most innocent person in the world.\n\n(Laughter)\n\nTRUMP: But you know you look at that — most presidential, I just said I’m the most presidential except for possibly Abe Lincoln when he wore the hat — that was tough to beat.\n\n(Laughter)\n\nHonest Abe, when he wore that hat, that was tough to beat. But I can’t do that, that hat wouldn’t work for me. Yeah, I have better hair than him. But Honest Abe was tough to beat. Remember we used to do that during the campaign. They used to say, when I speak, the crowd would be crazy, I’d go crazy — we would all go crazy. We had a lot of fun together. We had 25,000 — We’ve never had an empty seat. From the day I came down the escalator, with a potential — unbelievable woman who became a first lady.\n\n(Applause)\n\nThe crowds loved her, the people love her.\n\nBut we’ve never had an empty seat, not one. I really believe that. There was one case where we had a tremendous snowstorm, and it was just about frozen. It was like a monster storm, I don’t even know how it got there. I said, “how’s the crowd?” “It’s just not full, sir.” I said what does that mean. There’s like two seats on top. Thousands and thousands of people couldn’t get there. So they show pictures of the empty seats. The worst storm they’ve had in years. They show pictures of like nine empty seats. They could have been people just went to the bathroom together.\n\n(Laughter)\n\nI always say just get the biggest arena. Good location if you can, but get the biggest arena. We did it the other night, Tuesday night. We had two congressmen, one who was possibly going to win, he was up by two, he won by about 27, I think, or something like that. A lot. The other one was down by 17. And they said, “Sir, don’t campaign for him please.” “Why?” “Because if he loses, they’re going to kill you, the press.” I said they’re going to kill me whether I campaign or not. It’ll make it a little bit worse. They’ll say he worked and he failed. Trump failed. The guy was down 17 points and he ended up winning by a lot. In fact, the whole night, CNN. . . (inaudible)\n\nTRUMP: The studio was going to stay up for weeks, and toward the end of the night they were taking it down. Their so-called stars were leaving. They don’t have many stars. But they were taking — the stars were leaving. The candidate Dan Bishop won by a lot. He was down by 17, and they had lines a mile long. I mean the lines going into those voting booths were unbelievable. And without the rally speech, and a couple of tweets and Twitter stuff is good. We have like way over 100 million people on six or seven different platforms. It’s actually much higher than that, higher than just about everybody. And it helps. It helps. They have signs oftentimes when I speak. This woman the other night, beautiful woman, she’s got a son: “Please keep tweeting sir, it matters.” And it does matter, because we get our voice out. If we don’t do that, we don’t get the voice out.\n\nI can’t say what a great job Kelly []Kraft] is doing, and I can’t say what a wonderful husband he is. Look at how devoted he is. He’s a rich man, too. He’s loaded. What are you doing here? Why are you working? He’s so proud of his wife he can’t leave his office. That’s really great though, huh? Are you all proud of her? He said very much. And he’s really a fantastic guy, he’s been a friend of mine for a long time. Before I met Kelly, I met Joe [Kraft]. And Joe impressed me because of his knowledge of energy. Now he could be paid — O.K., you’re going to pay a guy 50 — for him that’s not quite good enough, although he might. He might. It’s easy money, Joe, you have to say. But he would be an expert on energy, he would be a real expert. He would be somebody you would pay a lot of money to, but not Joe Biden’s son.", "description": "President Trump made remarks to the United States Mission to the United Nations on Thursday, the same day a House committee released a declassified version of a complaint.", "authors": ["The New York Times"], "top_image": "https://static01.nyt.com/images/2019/09/26/us/politics/vid26-whistle-blower/vid26-whistle-blower-facebookJumbo.jpg", "published_at": "2019-09-26"}