{"pub": "washingtonpost", "url": "https://washingtonpost.com/entertainment/museums/in-real-life-jerome-was-a-combative-intellectual-artists-made-him-lovable/2019/09/17/618d524a-d950-11e9-ac63-3016711543fe_story.html", "downloaded_at": "2019-09-18 23:21:46.426120+00:00", "title": "Leonardo's St. Jerome is one of several powerful depictions currently on view", "language": "en", "text": "\n\nAn exhibition introduction to Leonardo da Vinci’s “Saint Jerome” at the Met. (The Metropolitan Museum of Art)\n\nArt and architecture critic\n\nJerome is my favorite saint, and I’m not remotely religious. In art, he is generally depicted as an old man in his study, reading or writing, or in the wilderness, alone with his books and the company of a faithful lion. All of this is mostly an invention, or a repurposing of Jerome’s identity during the Renaissance, when the truculent theological ideologue of Catholic Church history was recast as a meditative scholar who sought the solace of nature.\n\nGreat depictions of Jerome abound, especially in this anniversary year of Leonardo da Vinci’s 1519 death. The Metropolitan Museum of Art is hosting a one-work exhibition of Leonardo’s “St. Jerome Praying in the Wilderness,” an unfinished but still powerful painting borrowed from the Vatican Museums. Among the most exquisite works in the National Gallery’s survey of Andrea del Verrocchio — Leonardo’s teacher — is a small painting on paper (now affixed to wood) of an old, soulful man, identified as St. Jerome. Near the end of the Rijksmuseum’s mammoth “All the Rembrandts” exhibition, which closed in June, was a room with several of his deeply moving etchings of St. Jerome, in various guises but true to the model of a saint living simply, with his books and his lion, several of them in the outdoors. Another harrowing depiction of Jerome, perhaps by Donatello with contributions from his student Bertoldo di Giovanni, is among the masterworks in an exhibition devoted to Bertoldo at the Frick.\n\nMost Western art museums have a Jerome or two. The story of Jerome and the lion who befriended him after the saint healed the beast’s paw — which reached a wide audience through a 13th-century collection of saints’ biographies known as “The Golden Legend” — was a set piece for Renaissance artists, a narrative rooted in fable that inspired hundreds of variations on the basic theme of scholar and cat. The lives of the saints, often full of bloody incident, served a variety of purposes, including giving artists permission to paint certain kinds of paintings. St. Sebastian was an excuse to paint beautiful young men, often nude or nearly so, and St. Peter, who was crucified upside down, was a popular way to depict the physical agony that is often absent from images of Christ on the cross.\n\nSt. Jerome, who died in his 70s in 420 A.D., gave permission for artists to paint detailed interior representations of his study, sometimes dramatically lit by a candle, with a skull among his objects of mediation. But Jerome also inspired artists to depict landscapes, usually some characteristically leafy European fantasy of the “barren desert” where he supposedly spent years beating his chest with a rock and pondering the vanity of life. Over time, these two settings became conflated, and one often finds Jerome in something like an outdoor study, with his books, and sometimes a red robe and cardinal’s hat hanging on a tree or rock. This last detail, which is anachronistic, suggests he held a position that didn’t exist within the Church when he was alive. Jerome, rather, was a “Doctor” of the Church, or theological scholar and advocate.\n\nIn Leonardo’s painting, he is represented not as a scholar or alone in mediation, but a man fully in thrall to religious agony. He is bony and held together by long, wiry muscles in an image that incorporates everything Leonardo had learned from his dissections of the human body. Indeed, the saint seems to be a living corpse, caught between life and death. Leonardo was grappling with the body in new ways, attempting to build up a representation of it based on the underlying structure of its bones and sinews, not simply a fleshy container draped in cloth and covered in skin.\n\n\n\nLeonardo’s “Saint Jerome Praying in the Wilderness,” begun c. 1483. (Leonardo da Vinci/Vatican City, Musei Vaticani. Photo copyright Governatorate of the Vatican City State — Vatican Museums)\n\nVerrocchio’s “Saint Jerome,” c. 1465. (Andrea del Verrocchio/National Gallery of Art)\n\nIn her magnificent, four-volume survey of Leonardo’s career, “Leonardo da Vinci Rediscovered,” Carmen Bambach underscores the importance of the head — particularly the center of the cranium — within Leonardo’s exploration of anatomy. “He would have considered this to be the seat of the soul,” she writes. And it is precisely this part of the painting that is most complete, and emerges with the greatest emotional clarity from the mainly brown and tan hues of the underpainting that covers the rest of the panel.\n\nLeonardo’s agonized saint isn’t the Jerome I love. Rather, I prefer the domesticated Jerome who became a figure for scholarship, study and humanism during the Renaissance. And the lion, for me, is essential, even if it is almost certainly a fiction added by later writers who sought to humanize the lawyerly and confrontational Doctor of the Church. Jerome was one of the most prolific writers of the Latin Christian tradition, and among his books is a fiery tract in which he excoriates another writer for having suggested that properly married women were in no ways inferior to virgins. The real Jerome considered this “the hissing of the old serpent” and argued passionately for ideals of “purity” and “virginity” that lay the foundations for church dogma still used to denigrate women, LGBT people and anyone who doesn’t fit an antique ideal of chastity.\n\nAs the Renaissance gathered speed, he became celebrated more for having translated the Bible than for his myriad tracts arguing the details of orthodoxy. The lion episode helped align him with the virtues celebrated by the new religious orders that had risen during the late Middle Ages, including the Franciscans, with their focus on charity. Renaissance humanists found in Jerome a man of erudition and wide learning, largely overlooking the combative ways he employed that knowledge.\n\nEven the Protestant Rembrandt felt a special affinity for Jerome, not as a Catholic saint, but as a humanist. In at least one his etchings, the cardinal’s wide-brimmed hat has been replaced with a straw one, and several of the artist’s Jeromes look like genial old men on a picnic. He invested a range of emotions into his Jerome images — there are at least seven etchings — but none has the tormented look of Leonardo’s desperate figure.\n\nArtists, often taking their cues from apocryphal literature and legend, have remade Church history for centuries, perhaps no more strikingly than the sanitizing and humanizing of Jerome. The lion isn’t just a sentimental detail. Solitude can become toxic, especially if one is transfixed by an idea or suffering from spiritual mania. The lion saves Jerome from this, ties him to the world, engages his better nature. Unfinished in Leonardo’s painting, the lion is staring open-mounted at his companion, but it is unclear if he is roaring in protest at or sympathy with Jerome’s masochism.\n\nIt is the remaking of Church history I find admirable. Artists embraced their own idea of Jerome and succeeded in establishing that as the dominant idea. Jerome’s writings are now obscure except to theologians and those interested in Church history. But his lion is one of the most universally recognized symbols in the history of art.\n\nJerome is a better man for the lion and the intervention of artists. His long afterlife as a humble scholar is proof that the Church has proved susceptible to reformation again and again, mainly by people who have little patience for the sort of thing at which the real Jerome was so good.\n\nRead more by Philip Kennicott:\n\nThe first major U.S. show devoted to the artist who helped forge Leonardo da Vinci’s genius\n\nRobert Frank’s photographs captured the bleak reality we’re still living in today\n\nDoes the Kennedy Center have a vision for its elegant but awkward new annex?", "description": "Leonardo’s unfinished Jerome, in New York, is one of several magnificent representations.", "authors": ["Philip Kennicott", "Art", "Architecture Critic", "September At Am", "Philip Kennicott Is The Pulitzer Prize-Winning Art", "Architecture Critic Of The Washington Post. He Has Been On Staff At The Post Since", "First As Classical Music Critic", "Then As Culture Critic."], "top_image": "https://www.washingtonpost.com/resizer/poljhYhcfBmYuQ9U-7DaC9kBTFc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZHXWO5GVTII6TBVMB4SQZSIXLA.jpg", "published_at": "2019-09-17"}