{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/20/moment-of-madness-senseless-red-card-ruins-french-", "downloaded_at": "2019-10-20 13:23:39.146529+00:00", "title": "Moment of madness: Senseless red card ruins French RWC hopes", "language": "en", "text": "OITA, Japan (AP) - It was savage, it was reckless and - gallingly for the French - it was so unnecessary.\n\nFrance lock Sebastien Vahaamahina’s sending-off against Wales in the Rugby World Cup on Sunday will go down as one of the most mindless acts of violence in the 32-year history of the competition.\n\nIt probably cost his team a place in the semifinals, too.\n\nVahaamahina clasped his hands together in a praying gesture and nodded his head toward Jaco Peyper after the South African referee brandished the red card. He held out an apologetic hand toward his teammates, too, before trudging off the field.\n\nWhat possessed him to swing his right elbow flush into the face of Wales flanker Aaron Wainwright at a 49th-minute maul is anyone’s guess.\n\nFrance coach Jacques Brunel said it was a “reflex” action. Wales coach Warren Gatland called it “an error of judgment” that happens when “you have a lot of testosterone in a pretty high intensity match.”\n\nIt was the first red card in a World Cup knockout game since Wales captain Sam Warburton’s for a tip-tackle in the same fixture in the 2011 semifinals.\n\nWhile that was slightly unfortunate for Warburton, there was no arguing against Vahaamahina’s red card.\n\nFrance flanker Wenceslas Lauret said his teammate had apologized in the locker room but will “carry on paying for it.”\n\n“Obviously he blames himself,” France flyhalf Camille Lopez said. “He got a red card in a quarterfinal and he left us with 14 for part of the match, so of course he blames himself. But the group won’t in the slightest.”\n\nThat’s a very charitable reaction.\n\nThe French were leading 19-10 in the 49th minute, and playing their best rugby not just of the tournament but maybe this year, when Vahaamahina was sent off. They went on to lose agonizingly, 20-19 , bringing to an end the international coaching career of Brunel.\n\nHe departs with 13 losses in 23 matches as France coach, and confusion about where exactly his team stands in the world rugby’s pecking order.\n\nLes Tricolores remain frustratingly inconsistent. How can the team struggle to see off Tonga in the pool stage, then play so well against Wales - for about 50 minutes anyway - a few weeks later?\n\nTheir first-half performance in the quarterfinal was excellent and contained one of the tries of the tournament, an 80-meter move that started with a burst through the line from Virimi Vakatawa outside his own 22 and finished with Charles Ollivon racing over the line between the posts.\n\nGatland said he was thrilled that his team was only nine points behind at halftime.\n\n“I want to stress the quality of our team,” Brunel said, “which showed courage … and lots of panache.”\n\nBrunel will be replaced by former France captain Fabien Galthie and said he bequeaths a young team “with all the potential” going into the four-year cycle for the 2023 World Cup, held in France.\n\nFlyhalf Romain Ntamack is only 20. Scrumhalf Antoine Dupont, one of the standout players against Wales, is 22. Imposing center Gael Fickou is 25 and should be at his peak of his powers in four years’ time.\n\nFrance has won the world under-20 championship the past two years.\n\n“We need time to build up a team that will have results for confidence, and that is probably what we lacked,” Brunel said.\n\n“But they will keep on learning and it will make them mature. There is a brighter future for this team.”\n\nIt is unlikely to include captain Guilhem Guirado, who suggested he had reached the end of his international career.\n\nAnd it remains to be seen how deep the scars will be on Vahaamahina, who might be French rugby’s bête noir for some time after his moment of madness.\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\n___\n\nSteve Douglas is at www.twitter.com/sdouglas80\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "It was savage, it was reckless and - gallingly for the French - it was so unnecessary.", "authors": ["The Washington Times Http", "Steve Douglas"], "top_image": "", "published_at": "2019-10-20"}