{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/magazine/we-asked-these-lawmakers-to-pose-with-their-favorite-junk-food/2019/08/28/f4def724-b9f7-11e9-a091-6a96e67d9cce_story.html", "downloaded_at": "2019-09-10 02:20:19.754802+00:00", "title": "We asked these lawmakers to pose with their favorite junk food", "language": "en", "text": "Six members of Congress dish about their favorite junk food.\n\n\n\nSen. Mike Lee (R-Utah) holds some Aggie's ice cream. “Eating Aggie ice cream takes me back to Utah. It is home sweet home in delicious frozen form.”\n\n\n\nSen. Mazie Hirono (D-Hawaii) enjoys a bowl of mochi crunch.\n\n\n\nRep. Lucy McBath (D-Ga.) eats popcorn. “Popcorn is just so quick and easy — it’s a snack for every occasion!”\n\n\n\nRep. Dan Crenshaw (R-Tex.) adds toppings to his Blue Bell Ice Cream.\n\n\n\nRep. Carol Miller (R-W.Va.) holds her signature homemade candied pecans. “I enjoy making my homemade pecans because they are healthy, fun to make and bring everyone together to snack on.”\n\n\n\nRep. Frederica S. Wilson (D-Fla.) with her favorite junk food. “French fries are golden, warm and crunchy and are never disappointing. I have always loved them; it was love at first bite!”\n\nCredits:\n\nPhotos: Anisha Sisodia\n\nPhoto editor: Dudley Brooks\n\nPhoto/tech assistant: Paris Preston\n\nMakeup/groomer: Shauné Hayes\n\nProducer: Daniele Seiss\n\nProduction assistant: Monique Woo\n\nMore from the Magazine:\n\nSen. Josh Hawley’s crusade against Big Tech\n\nThe quiet endurance of Rep. Marcy Kaptur\n\nHow reporters for niche publications conquered Capitol Hill", "description": "A nonpartisan, nonpolitical photo spread.", "authors": ["Anisha Sisodia", "Daniele Seiss", "Health", "Fitness", "Human Interest.", "In Addition To Her Work At The Post", "Seiss Writes Fiction"], "top_image": "https://www.washingtonpost.com/resizer/S33MusOCwhzVaqeZAjdWGB02Xhc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YV4NY4V5FYI6TODTMOWOMNVPBA.jpg", "published_at": "2019-08-28"}