{"pub": "independent", "title": "Carli Lloyd ‘not afraid’ to play NFL: USA footballer considers career switch after kicking 55-yard field goal", "url": "https://independent.co.uk/sport/football/womens_football/carli-lloyd-nfl-field-goal-kick-watch-video-usa-womens-national-football-team-a9083331.html", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:22:11.847909+00:00", "text": "Fresh off the United States’ victory in the Women’s World Cup, could Carli Lloyd be entertaining thoughts about a career change?\n\nThe 37-year-old footballer nailed a 55-yard field goal during a joint practice between the Philadelphia Eagles and Baltimore Ravens last week. And on Wednesday she was peppered with questions about a possible NFL future.\n\n“It’s gone from just having fun kicking to, ‘Will she play in the NFL?’ At first I was just laughing about it but the more that I spoke with my husband, he’s all for it and my friends and family, they’re really encouraging me to potentially take up this opportunity,” said Lloyd, who is in Philadelphia with the national team for a victory tour match against Portugal on Thursday night.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt’s not the first time she’s hit a long field goal. During the World Cup qualifying tournament last fall, she got a 45-yarder at the Cowboys’ practice facility in Texas.\n\nLloyd is well known for her kicking ability. In the World Cup title match in 2015, Lloyd scored three goals including a blast from midfield to give the United States a 5-2 victory over Japan. But she acknowledged that kicking in the NFL is very, very different from scoring from 50-yards out — like wearing pads and facing 300-pound opponents.\n\n“You can’t really touch a kicker, but it happens. I’m not naive to that. But there is that part of it, no doubt. And there’s challenges as far as being with all males and the locker room and there’s a whole range of things, and I get that,” she said. “But I’m not afraid to step up in front of the whole world and actually do it.”\n\nIndianapolis Colts kicker Adam Vinatieri, a veteran of five Super Bowls, said earlier this week that he thought Lloyd’s kick was “pretty cool”.\n\nBut like Lloyd, he also said it’s one thing to kick in practice, and another to perform in a game.\n\n“For you to go out and hit a ball without a rush and a snap and a hold and no get-off time and stuff, it’s different than doing live stuff,” Vinatieri said. “But I saw it, it was pretty impressive how far she kicked the ball.”\n\nUS coach Jill Ellis, who is stepping down from the team following the victory tour, joked when asked about it: “Did you hear the next one that I’m going to be her agent?”\n\nEllis said if any woman could break into the NFL, it would be Lloyd.\n\n“When I first came on the scene, I saw Carli Lloyd strike a ball and I said, ‘Holy crap that’s the hardest I’ve ever seen a woman hit a ball,”’ Ellis said. “She certainly has the velocity, and I think it’s very cool. I think it would be great.”\n\nAP", "description": "Fresh off the United States’ victory in the Women’s World Cup, could Carli Lloyd be entertaining thoughts about a career change? The 37-year-old footballer nailed a 55-yard field goal during a joint practice between the Philadelphia Eagles and Baltimore Ravens last week. And on Wednesday she was peppered with questions about a possible NFL future.", "authors": ["Sports Staff"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/29/10/Carli-Lloyd-in-practice-with-the-Baltimore-Ravens.jpg"}