{"pub": "euronews", "url": "https://euronews.com/living/2019/10/22/jennifer-lopez-and-alex-rodriguez-launch-ethical-ready-meal-range", "downloaded_at": "2019-10-23 09:39:22.814115+00:00", "title": "Jennifer Lopez and Alex Rodriguez launch ethical ready meal range", "language": "en", "text": "Celebrity power couple Jennifer Lopez and Alex Rodriguez have launched their own range of ethical ready meals.\n\nThe pair’s new brand, Tiller & Hatch, features frozen meals that are designed to be heated up quickly in an electronic pressure cooker, producing portions big enough for the whole family. The pressure cooker method also meant less clean up, minimising burnt-on residue, said the brand.\n\nSinger and actress J. Lo and baseball star Arod said they were committed to health and wellness as a central part of their lives, and wanted to ensure the meals produced by their brand were nutritious and wholesome. In addition, a portion of the proceeds from all sales will go to fund a variety of shelters, food banks and charities working to fight hunger.\n\nTiller & Hatch\n\nThe brand went on sale in US Walmart stores today (21 October), while it has also launched as an affordable subscription delivery service.\n\nThe meaty ready meals feature only meat not treated with hormones or antibiotics, with the menu prepared to be “restaurant quality” dishes by Bruce Hecker of Bruce's Catering, known for serving the entertainment industry.\n\nRead more |Can a chocolate bar end poverty? The story of radical equality\n\nThe brand has started off with eight ready meals, with plans for organic meals and options to fit specific dietary lifestyles like vegetarian and Paleo diets to follow in the near future.\n\n- Cajun style chicken stew with pork andouille sausage\n\n- Coconut chicken stew with vegetables and rice\n\n- Santa Fe style pasta with chicken breast\n\n- Chicken tortilla stew with black beans, red pepper and corn\n\n- Farfalle pasta with marinara and ground turkey\n\n- Italian style stew with chicken\n\n- Farfalle with marsala sauce and chicken\n\n- Southwestern style minestrone soup with meatballs\n\n\"This is an option we wish had been available to our families growing up,\" said Rodriguez.\n\n\"We are committed, like Tiller & Hatch, to doing good. This partnership offers us the opportunity to provide affordable and nutritious meals to families across America while making significant charitable contributions to shelters and food-based charities across the country.\"", "description": "The pair are giving back to food shelters and charities fighting hunger.", "authors": ["Euronews Living"], "top_image": "https://static.euronews.com/articles/stories/04/25/05/76/1000x563_cmsv2_e168d83c-7299-52fb-9344-5d3d6a56275f-4250576.jpg", "published_at": "2019-10-22"}