{"pub": "businessinsider", "url": "https://businesstimes.com.sg/companies-markets/rex-international-makes-oil-and-gas-discovery-in-norwegian-sea", "downloaded_at": "2019-10-16 01:38:07.464438+00:00", "title": "Rex International makes oil and gas discovery in Norwegian Sea", "language": "en", "text": "CATALIST-LISTED oilfield services firm Rex International on Wednesday announced that an oil and gas discovery has been made from the drilling of exploration and appraisal wells in the Norwegian Sea.\n\nThe recoverable oil equivalents of the discovery is around three to six million standard cubic metres, or 19 to 38 million barrels, based on the preliminary estimates of PGNiG Upstream Norway, the operator of the drilling licence PL838.\n\nThe exploration well and appraisal well on the Shrek prospect are the first and second wells drilled on PL838, Rex said in a bourse filing on Wednesday morning.\n\nRex’s 90 per cent-owned subsidiary Lime Petroleum AS owns a 30 per cent stake in the PL838 licence. Lime Petroleum had agreed in June to acquire the stake, together with a 30 per cent interest in PL838B, another licence in the Norwegian Sea.\n\nsentifi.com Market voices on:\n\nThe operator PGNiG has a 40 per cent interest in both licences, while Aker BP holds the remaining 30 per cent.\n\nRegulatory approval for the transfer of interests in the two licences was obtained in September, and the transfer is set to be completed on Oct 31 and become effective from Jan 1.\n\nThe wells in PL838 were drilled in the central part of the Norwegian Sea, about five kilometres south of the Skarv FPSO (floating production storage and offloading) and 210 kilometres north-west of the Brønnøysund town.\n\n“The objective was to prove the existence of petroleum in Lower to Middle Jurassic reservoir rocks of the Fangst and Båt Groups,” Rex said.\n\nIt is possible that the new field discovered will be tied back to the Skarv FPSO facility, the company added.\n\nDan Broström, executive chairman of Rex, said: “We have based our decision to farm-in to PL838 on the interpretation from Rex Virtual Drilling and our own geological and geophysical studies.”\n\n“With this discovery, we will have the option to move towards production, or to repeat our proven business model in Norway to farm-in, find oil, monetise and recycle capital, as we have done with the Rolvsnes discovery,” Mr Broström added.\n\nThe drilling result in the Shrek prospect comes several months after Rex monetised the Rolvsnes discovery in the North Sea. Lime Petroleum had inked a deal in January to sell its 30 per cent interest in the Rolvsnes discovery in the PL338C licence as well as related assets for a cash consideration of US$43 million and a contingent payment of a further US$2 million\n\nShares of Rex International were trading up 0.8 Singapore cent or 10.1 per cent at 8.7 Singapore cents as at 9.04am on Wednesday, after the discovery was announced.", "description": ": THE BUSINESS TIMES Companies & Markets - CATALIST-LISTED oilfield services firm Rex International on Wednesday announced that an oil and gas discovery has been made from the drilling of exploration and appraisal wells in the Norwegian Sea. . Read more at The Business Times.", "authors": ["Fiona Lam"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-16"}