{"pub": "cbc", "url": "https://cbc.ca/books/margaret-atwood-s-the-testaments-breaks-canadian-book-sales-records-1.5295795", "downloaded_at": "2019-09-25 23:28:11.181081+00:00", "title": "Margaret Atwood's The Testaments breaks Canadian book sales records | CBC Books", "language": "en", "text": "Margaret Atwood's The Testaments has broken Canadian sales records.\n\nThe novel, which is a sequel to Atwood's The Handmaid's Tale, sold more print copies in the first week than any other Canadian book since BookNet Canada began tracking sales data in 2005.\n\nBookNet Canada is a non-profit organization that tracks Canadian book sales. Their data represents approximately 85 per cent of overall Canadian sales.\n\nThe Testaments's publisher, Penguin Random House Canada, said that the title has sold more than 80,000 copies in Canada since its publication on Sept. 10.\n\n\"The book's sales thus far have exceeded even our most enthusiastic expectations,\" Jared Bland, the publisher of McClelland & Stewart, the imprint of Penguin Random House Canada that published The Testaments, told CBC Books in an email. \"It's a wonderful tribute to how essential the broader story of Gilead has become to these times in which we live and to how beloved Margaret Atwood is here in Canada.\"\n\nThe Testaments is set 15 years after the events of The Handmaid's Tale and includes the \"explosive testaments\" of three women: a young woman growing up inside Gilead, a high school student living in Canada who wants to see Gilead fall and Aunt Lydia, a powerful woman who knows the inner workings of Gilead all too well.\n\nAtwood initially had no intention of writing a sequel. She started to consider the idea after watching politics become more conservative after the 9/11 attacks.\n\n\"I was no, no, no, no, no for awhile, but then No. 1: history changed,\" Atwood told The Current. \"Instead of going away from Gilead, we turned around and started coming back toward Gilead.\"\n\n\"People who think that progress is a one-way street and only ever goes in one direction have not read a lot of history. You cannot count on the yellow brick road leading to the City of Oz.\"\n\nThe original inspiration for The Handmaid's Tale was also rooted in history and politics.\n\n\"Nothing went into The Handmaid's Tale or into The Testaments that has no precedent in human history itself,\" Atwood told Shelagh Rogers on The Next Chapter.\n\nThe Testaments is having a phenomenal run outside of book sales. The novel is on the Booker Prize shortlist and the Scotiabank Giller Prize longlist.\n\nIt has also been optioned for the screen by Hulu and MGM Television, the same studios that produce the TV adaptation of The Handmaid's Tale.", "description": "The sequel to the 1985 classic The Handmaid's Tale has sold more than 80,000 copies in Canada.", "authors": [], "top_image": "https://i.cbc.ca/1.5209523.1564152712!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/the-testaments-by-margaret-atwood.jpg", "published_at": "2019-09-25"}