{"pub": "yahoo", "url": "https://news.yahoo.com/measles-outbreak-kills-more-4-150059587.html", "downloaded_at": "2019-10-09 19:06:54.271814+00:00", "title": "Measles outbreak kills more than 4,000 in Congo this year", "language": "en", "text": "DAKAR, Senegal (AP) — More than 4,000 people have died in Congo this year in the world's largest measles outbreak, the United Nations children's agency said Wednesday.\n\nThe Central African nation is also battling an Ebola outbreak that has killed about half that number since August 2018.\n\nSince January, more than 200,000 cases of measles have been reported across Congo, UNICEF said. More than 140,000 involve children under 5, who also make up nearly 90 percent of deaths.\n\n\"We're facing this alarming situation because millions of Congolese children miss out on routine immunization and lack access to health care when they fall sick,\" said the UNICEF country representative, Edouard Beigbeder. \"On top of that, a weak health system, insecurity, community mistrust of vaccines and vaccinators and logistical challenges all contribute to a huge number of unvaccinated children at risk of contracting the disease.\"\n\nHealth officials are facing many of the same challenges in the Ebola outbreak in eastern Congo that has killed more than 2,000 people. Multiple armed groups have been fighting over the mineral-rich land for decades and threatening residents. The insecurity has led to mistrust of authorities, including health workers.\n\nUNICEF said health workers were rushing additional medical kits to help care for more than 110,000 people infected with the measles, a highly contagious and potentially deadly virus. More than 1.4 million children have been vaccinated this year.\n\nThe U.N. agency said Congo's government will launch a vaccination campaign at the end of October to make sure children in every province are vaccinated.\n\n___\n\nFollow Africa news at https://twitter.com/AP_Africa", "description": "More than 4,000 people have died in Congo this year in the world's largest measles outbreak, the United Nations children's agency said Wednesday.  The Central African nation is also battling an Ebola outbreak that has killed about half that number since August 2018.  Since January, more than", "authors": ["Carley Petesch"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-09"}