{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7623361/Pride-Britain-Awards-Love-Island-winners-Amber-Gill-Amber-Davies-don-plunging-ensembles.html", "downloaded_at": "2019-10-28 23:46:19.802118+00:00", "title": "Pride of Britain Awards: Love Island winners Amber Gill and Amber Davies don plunging ensembles", "language": "en", "text": "They're both called Amber, they're both Love Island winners, and they're both single.\n\nAnd, although Amber Gill and Amber Davies both stepped out in plunging ensembles on Monday night to attend the Pride of Britain Awards held the Grosvenor House Hotel in London, the ladies made distinctly different style statements.\n\nReigning Love Island champion Amber slipped her jaw-dropping curves into a glamorous red gown, while West End star and 2017 show winner Amber looked chic in a sleek trouser suit.\n\nWow! Amber Gill (left) and Amber Davies (right) both stepped out in plunging ensembles on Monday night to attend the Pride of Britain Awards held the Grosvenor House Hotel in London\n\nGeordie beauty Amber ensured she didn't go unnoticed as she arrived clad in her plunging red silk dress, which boasted a thigh-high split.\n\nShe boosted her height with a strappy pair of silver stilettos and kept her accessorises to a minimum, letting her frock do the talking.\n\nThe beautician's natural afro curl was parted in the centre and styled into a stunning half-up, half-down 'do.\n\nHer natural beauty was enhanced with a flawless make-up look and finished off with a dramatic pair of false eyelashes.\n\nVa va voom: Reigning Love Island champion Amber slipped her jaw-dropping curves into a glamorous red gown\n\nGlamorous: Geordie beauty Amber ensured she didn't go unnoticed as she arrived clad in her plunging red silk dress, which boasted a thigh-high split\n\nChic: West End star and 2017 show winner Amber oozed sophistication in a sleek John Richmond trouser suit featuring glittering silver lapels and short voluminous sleeves\n\nMeanwhile, Amber Davies oozed sophistication as she went bra-less beneath a black John Richmond trouser suit featuring glittering silver lapels and short voluminous sleeves.\n\nShe strolled along the red carpet in an elegant pair of pointed Alevi stilettos, while carrying her belongings in an edgy Alexander McQueen bag.\n\nStyled by Lorraine McCulloch, Amber's ensemble was finished off with an array of David Robinson bracelets and a subtle pair of diamond earrings.\n\nThe talented star's tresses were swept up into a sleek bun and her stunning features were enhanced with a dramatic smokey eye, with a burgundy manicure by Mimi McCulloch adding the final touch.\n\nDesigner duds: She strolled along the red carpet in an elegant pair of pointed Alevi stilettos, while carrying her belongings in an edgy Alexander McQueen bag\n\nBeauty: The talented star's tresses were swept up into a sleek bun and her stunning features were enhanced with a dramatic smokey eye\n\nLove Island lovelies: Amber posed next to former Love Island star Laura Anderson\n\nReigning champion Amber Gill is the current Love Island champion, winning the show with Greg O'Shea, with whom she had a short-lived romance.\n\nAmber Davies won the show in 2017 with ex Kem Cetinay, and has gone on to star on the West End, and in her own reality show.\n\nMore than 100 of the UK's biggest stars will come together at the Daily Mirror Pride of Britain Awards to honour the nation's unsung heroes on the landmark 20th anniversary of the event.\n\nThe awards recognise and celebrate ordinary people up and down the country doing extraordinary things.\n\nElegant: Laura looked exceptional in an elegant black floor-length gown, which boasted a feathery strapless neckline\n\nFlawless: Laura's flawless visage was adorned with a pretty make-up application\n\nHosted by Carol Vorderman, celebrities and public figures including Prince Charles, Robert Downey Jr, Sir Ben Kingsley, Dua Lipa, Ant & Dec, Chris Pratt, Michael Sheen, Adam Lambert, Christine Lampard, Sir Michael Caine, Jonathan Ross, Suranne Jones, and the judges and casts of Strictly Come Dancing and X Factor will be honouring this year's awe-inspiring winners.\n\nCarol Vorderman said: 'Pride of Britain is such a huge part of my life, it's hard to believe it's 20 years since we first started. In that time, it has found a place at the heart of British life, and the winners represent the very best of us. I never fail to be humbled by them, and this year's are no different.'\n\nThe Daily Mirror Pride of Britain Awards, in partnership with TSB, will be broadcast on ITV on 5th November at 8pm.\n\nPretty in pink: Love Island runners up Tommy Fury and Molly-Mae Hague put on a loved-up display, with the blonde beauty turning heads in a bespoke Pretty Little Thing dress\n\nCute couple: Former Love Islanders and current X Factor: Celebrity star Eyal Booker cosied up to girlfriend Delilah Hamlin on the red carpet", "description": "Reigning Love Island champion Amber slipped her jaw-dropping curves into a glamorous red gown, while West End star and 2017 show winner Amber looked chic in a sleek trouser suit", "authors": ["Ellie Phillips For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/20/20296608-0-image-a-42_1572294630095.jpg", "published_at": "2019-10-28"}