{"pub": "euronews", "url": "https://euronews.com/2015/02/18/oscar-best-male-is-a-fight-between-four-novices-and-veteran", "downloaded_at": "2019-10-06 00:22:46.176518+00:00", "title": "Oscars Best Male is a fight between four novices and veteran", "language": "en", "text": "Four novices and a veteran are up for Best Actor at this weekend’s Academy Awards. Among the newcomers in particular, the battle is likely to be tough.\n\nSixty-three year old Michael Keaton makes his own career comeback in ‘Birdman’ playing a fading Hollywood action star who plans to reinvent himself in a Broadway production. Unbelievably, this is Keaton’s first Oscar nomination.\n\nInitially considered to be the front-runner, Keaton now faces stiff competition for the Oscar prize from Eddie Redmayne, who earlier this month picked up a BAFTA for ‘The Theory of Everything’.\n\nThe Briton has earned his first Oscar nomination for his role of physicist Stephen Hawking. The physically demanding role, sees Redmayne portray Hawking during several stages of motor neuron disease, which has left him mostly paralyzed.\n\nFollow our live online coverage of the Oscars ceremony from midnight CET on Sunday February 22\n\nSteve Carell is also up for his first Oscar for ‘Foxcatcher’. He plays convicted murder John E DuPont, heir to the DuPoint family fortune, who shot and killed Olympic gold-medalist Dave Schultz in 1996.\n\nCarrel is instantly recognisable for his role in the US version of ‘The Office’ as well as comedies Bruce Almighty and The Forty Year Old Virgin.\n\nBest known for the British TV series ‘Sherlock’, Benedict Cumberbatch earns his first Oscar nomination for his portrayal of mathematician Alan Turing.\n\nThe mathematician helped break the Nazi ‘Enigma’ code during World War II. Convicted for homosexual acts, his punishment was chemical castration, which he was pardoned for two years ago, posthumously.\n\nBut the real veteran of the competition is the three time nominee Bradley Cooper. In ‘American Sniper’, he stars as Navy Seal Chris Kyle, said to be the most lethal sniper in United States Military History.\n\nCooper was previously nominated for best actor for “Silver Linings Playbook” and best supporting actor for “American Hustle”.\n\nHe is also nominated for Best Picture category as the film’s producer. But will the Academy recognise him this time?", "description": "Michael Keaton, Eddie Redmayne, Steve Carell and Benedict Cumberbatch are nominated for the Best Actor prize.", "authors": [], "top_image": "https://static.euronews.com/articles/299796/1000x563_299796.jpg", "published_at": "2015-02-18"}