{"pub": "reuters", "url": "https://reuters.com/article/us-usa-election-debate/biden-attacks-warren-sanders-over-cost-of-healthcare-plans-in-democratic-debate-idUSKCN1VX114", "downloaded_at": "2019-09-13 08:31:47.160321+00:00", "title": "Biden attacks Warren, Sanders over cost of healthcare plans in Democratic debate", "language": "en", "text": "HOUSTON (Reuters) - Democratic presidential front-runner Joe Biden clashed with progressive challengers Elizabeth Warren and Bernie Sanders on healthcare in a debate on Thursday, defending Obamacare and pushing them to be honest about the cost of their plans.\n\nSenator Bernie Sanders, former Vice President Joe Biden and Senator Elizabeth Warren debate during the 2020 Democratic U.S. presidential debate in Houston, Texas, U.S. September 12, 2019. REUTERS/Mike Blake\n\nWith the top 10 Democratic candidates sharing the debate stage for the first time, they focused more on their shared opposition to Republican President Donald Trump and pared back some of the bickering that marked the first two debates this summer.\n\nBiden was sharper and more aggressive than in either of the first two debates, when he came under frequent attack for his record on race and criminal justice during his long tenure in the U.S. Senate.\n\nBut like the first two debates, the Democrats were quick to leap into battle on healthcare, the issue that has ignited the most heated disagreements in the campaign for the party’s nomination to face Trump in the November 2020 election.\n\nBiden, who served as vice president for eight years under Barack Obama, said he would build on Obama’s landmark 2010 Affordable Care Act, popularly known as Obamacare. He accused Warren and Sanders of wanting to tear it down with Medicare for All, a proposed government-run healthcare program that would eliminate private insurance.\n\n“I know that the senator says she’s for Bernie. Well I’m for Barack. I think Obamacare worked,” Biden said, asking Warren and Sanders to explain how they would pay for their plans. “This is about candor, honesty, big ideas.”\n\nWarren, a U.S. senator from Massachusetts who has moved into second behind Biden in many opinion polls of the Democratic race, praised Obama’s healthcare efforts but said more was needed.\n\n“Now the question is how best can we improve on it,” she said, adding that under Medicare for All, those at the top would pay more but the middle class would pay less.\n\nAside from the exchange over healthcare, Biden and Warren avoided any direct confrontations. Sanders and former U.S. Housing Secretary Julian Castro led the charge against Biden.\n\nSanders, who sponsored a bill in the U.S. Senate to create a Medicare for All plan, said the program based on the existing government-run Medicare program for Americans 65 and older was the most cost-effective approach. Some analysts have estimated his plan would cost $32 trillion over a decade.\n\nBiden said his proposal would give Americans more options, including staying with their plans if they like them.\n\n“I’ve never actually met anybody who likes their health insurance company,” Warren fired back.\n\nCastro accused Biden of flip-flopping in his description of his own plan.\n\n“Are you forgetting what you said two minutes ago?” Castro, 44, asked Biden, 76, who has faced questions about his age.\n\nWhen Mayor Pete Buttigieg of South Bend, Indiana, noted the exchange was what people did not like about politicians, Castro shot back: “That’s called an election.”\n\nPRAISE FOR OBAMA\n\nU.S. Senator Amy Klobuchar of Minnesota also tried to calm things down, noting: “A house divided cannot stand,” quoting from a famous speech by Abraham Lincoln.\n\nThe candidates made an effort to praise the legacy of Obama, after facing criticism from some Democrats after the last debate for attacking his policies on healthcare and immigration.\n\nBut Castro, who has lagged badly in opinion polls, accused Biden of being quick to tie himself to Obama when it suited him and walk away when it did not.\n\n“He wants to take credit for Obama’s work but not have to answer any questions,” Castro, who served in Obama’s administration, said in his second attack of the night on Biden.\n\n“I’m fulfilling the legacy of Barack Obama and you’re not,” Castro told Biden. “That’ll be a surprise to him,” Biden responded.\n\nSanders took aim at Biden’s vote as a senator to authorize the U.S. military invasion of Iraq. He said: “I never believed” either President George W. Bush or Vice President Dick Cheney’s arguments in favor of the invasion.\n\nWhile the debate was under way, Trump spoke to Republican lawmakers on a retreat in Baltimore, and said the Democrats were reinforcing the need for his re-election.\n\n“You really have to elect me. Whether you like me or not, it makes no difference, because our country will go to hell if any of these people get in,” Trump said.\n\nThe debate was narrowed to one night and 10 candidates after the party toughened the requirements for qualifying. The previous two Democratic debates in June and July featured 20 candidates split over two nights.\n\nAuthor Marianne Williamson, one of the contenders who did not qualify for the debate, commented on Twitter that it featured “nice people” but was not a game changer.\n\n“All incremental. Ultimately boring,” she wrote.\n\nEntrepreneur Andrew Yang opened the debate by promising to give $1,000 a month to 10 Americans for the next year, calling it a “freedom dividend.” The offer drew laughs from a few other contenders.\n\n“It’s original, I’ll give you that,” Buttigieg said.\n\nThe sharp bickering during the first two rounds of the debates dismayed some Democrats, who have urged the candidates to rein in their attacks and focus on laying out their own affirmative agendas.\n\nSlideshow (27 Images)\n\nThe candidates this time tried to emphasize their areas of agreement. Biden praised former U.S. Representative Beto O’Rourke for his work after a mass shooting in his hometown of El Paso, Texas, drawing a sustained ovation from the debate crowd.\n\nO’Rourke, who has called for gun licensing and a mandatory gun buyback for assault weapons, was asked if he was going to take away people’s guns.\n\n“I am if it was a weapon that was designed to kill people on a battlefield,” he said. “Hell yes, we’re going to take your AR-15, your AK-47.”", "description": "Democratic presidential front-runner Joe Biden clashed with progressive challengers Elizabeth Warren and Bernie Sanders on healthcare in a debate on Thursday, defending Obamacare and pushing them to be honest about the cost of their plans.", "authors": ["Tim Reid", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429265896&w=1200&r=LYNXNPEF8C04J", "published_at": "2019-09-13"}