{"pub": "cryptonews", "url": "https://cryptonews.com/news/bank-of-lithuania-received-dozens-of-inquires-about-stos-4938.htm", "downloaded_at": "2019-10-25 16:02:43.754629+00:00", "title": "Bank of Lithuania Received 'Dozens' of Inquires About STOs", "language": "en", "text": "Source: iStock/adventtr\n\nThe Bank of Lithuania (BoL) sees an increased interest in security token offerings (STOs) and estimates that this new form of raising capital will become more popular. The bank issued the Guidelines on STO earlier this week and is reaching the final stage in creation of its blockchain-based technological platform.\n\nVaidas Cibas, Head of Regulated Markets Surveillance Division at the Bank of Lithuania, told Cryptonews.com that they have received a number of calls about STOs. It’s quite common for innovations to cause a surge of interest, he explained, but one can’t know until later who among the interested was just exploring and who will end up actually incorporating that innovation and using it. One company attempted to raise capital via an STO in Lithuania, but the number of STO consultation calls to the BoL could be counted in the dozens, according to Cibas.\n\n\"How many of these would become real STOs is quite difficult to say, especially since the environment is really dynamic,” he added.\n\nHowever, STOs may become more popular in the future. “There are quite a few companies that are interested in STOs and who apply to the Bank of Lithuania for this reason, so we believe that this instrument will grow in popularity in the future,” Cibas said.\n\nSTO is complicated enough these days, he explained, as it’s a new way of raising funds, so the technical solutions are lacking and there are no well-developed processes. “In other words, the market is still looking for the right ways to implement it,” he said. This is a trend common in other EU countries, “there are only a few STOs, and they are usually non-public, available for pre-defined group of investors only.”\n\n“I have no doubt that blockchain will be applicable to the financial market,” concluded Cibas, “with only two questions remaining: how quickly will this become the norm, and how widely it will be applied.\"\n\n\"It becomes crucial to set rules\"\n\nThe Bank has issued the Guidelines on STO on October 21st, after finding that the STOs which are regulatory compliant are replacing initial coin offerings (ICOs).\n\n“The current focus on STOs is taking over the waning interest in ICOs. Businesses are interested in this particular way of raising capital as an alternative to bank lending,” Marius Jurgilas, Member of the Board of the Bank of Lithuania, was quoted as saying in a press release.\n\nSource: The Bank of Lithuania\n\n“In a strict regulatory environment, such as the securities market,” Jurgilas explained, “it becomes crucial to set rules in order to avoid any miscommunication, misunderstandings and their consequences.” This is why the BoL decided to establish its regulatory approach to tokens as a financial instrument. In their new Guidelines they:\n\nfocus on their classification: what tokens should be categorized as having features of securities or other financial instruments\n\nconsider ‘investment-type’ tokens and hybrids of ‘investment-type’ and/or ‘utility-type’ and/or ‘payment-type’ tokens that are likely to be covered by the existing financial markets regulation and the supervisory framework\n\nnot consider tokens of pure ‘payment-type’ and ‘utility-type’ nature as these do not fall within the scope of the Guidelines\n\nprovide recommendations related to the issue of security tokens\n\nclarify applicable legal regulation.\n\nLearn more: This is Where STOs are Ahead of the Rest Crypto Industry\n\nLBChain to enter its final testing stage\n\nSeparately, the BoL announced on October 22nd that it has chosen information technology companies IBM Poland and Tieto Lietuva to proceed to the next stage of the bank’s plan to create LBChain. This final testing stage is said to being soon – for which the open participation call to fintechs and startups has been issued – after which the winner will be announced.\n\nLBChain is the BoL’s blockchain-based sandbox which combines regulatory and technological infrastructures. It allows fintech companies to test whatever business solution they came up within a controlled environment, given that they get regulatory support from the BoL and technological support from blockchain integrators.\n\nExamples of tested solutions so far include a payment token, a crowdfunding platform, cross-border payments, a KYC (know your customer) solution for AML (anti-money laundering) compliance, a mobile POS and payment card solution, a smart contract for factoring, and an unlisted share trading platform.", "description": "The Bank of Lithuania (BoL) sees an increased interest in security token offerings (STOs) and estimates that this new form of raising capital will become more popular. The bank issued the Guidelines on STO earlier this week and is reaching the final stage in creation of its blockchain-based technological platform.", "authors": ["Sead Fadilpašić"], "top_image": "https://cimg.co/w/articles/0/5db/2fe37152c9.jpg", "published_at": "2019-10-25"}