{"pub": "cbs", "url": "https://cbsnews.com/news/jose-andres-pitch-baseballl-world-series-washington-nationals-booing", "downloaded_at": "2019-10-29 00:18:14.461135+00:00", "title": "José Andrés thanks MLB for \"inviting an immigrant\" to throw first pitch at World Series", "language": "en", "text": "Celebrity chef José Andrés was met with a rousing reception when he threw out the ceremonial first pitch before Game 5 of the World Series between the Houston Astros and Washington Nationals Sunday night. Andrés, known for his humanitarian work throughout the world, later expressed gratitude to Major League Baseball for \"inviting an immigrant\" to throw the first pitch at Nationals Park, where President Trump was also in attendance.\n\nAndrés, 50, has restaurants all over the U.S. and is the founder of World Central Kitchen, a non-profit dedicated to to providing meals in the aftermath of natural disasters. He was lauded by the Nationals for his organization and its work in helping feed those in need.\n\nThe world-renowned chef, who is originally from Spain, posted his thanks on Twitter Monday. \"Thank you @Nationals @MLB @astros For inviting an immigrant! To throw first pitch! In a game full of immigrants! Inviting me representing millions of first responders doing amazing work helping everyone! Specially @WCKitchen today we pass 1.5 million meals in Bahamas alone...,\" Andrés wrote.\n\nThank you @Nationals @MLB @astros For inviting an immigrant! To throw first pitch! In a game full of immigrants! Inviting me representing millions of first responders doing amazing work helping everyone! Specially @WCKitchen today we pass 1.5 million meals in Bahamas alone... pic.twitter.com/f3vzj71YNU — José Andrés (@chefjoseandres) October 28, 2019\n\nThe cheers he got ahead of the game, which the Astros won 7-1, is in direct contrast to how the Washington crowd responded to Mr. Trump.\n\nWhen Mr. Trump and his wife, first lady Melania Trump, were introduced at the ballpark in the third inning, they were met with a chorus of boos. Chants of \"Lock him up!\" broke out in some sections, including one below where the president was sitting. Later in the game several fans also unfurled a big \"Impeach Trump\" banner in the stands.\n\nAndrés and President Trump have publicly feuded in recent years. In 2016, the chef canceled plans to bring one of his restaurants to the president's D.C. hotel, blaming Mr. Trump's rhetoric on immigrants. In an interview on \"CBS This Morning\" last year, Andrés said Mr. Trump deserved some of the blame for the death toll from Hurricane Maria in Puerto Rico.", "description": "Andrés, a frequent Trump critic, got a much more positive reception than the president, who was booed at the game", "authors": ["Christopher Brito"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/10/28/3c8d2157-1794-4bce-9dbb-0d8174162f45/thumbnail/1200x630g2/16b552b1782e4adb25383feb7866460f/gettyimages-1183851145.jpg", "published_at": "2019-10-28"}