{"pub": "zdnet", "url": "https://www.zdnet.com/article/latest-windows-10-20h1-preview-brings-linux-memory-improvements-and-more-ways-to-express-yourself", "downloaded_at": "2019-10-30 10:17:19.533471+00:00", "title": "Latest Windows 10 20H1 preview brings Linux memory improvements - and more ways to express yourself", "language": "en", "text": "Windows 10 version 1909: Why this feature update should be a pleasant surprise Microsoft is getting the November 2019 Update ready for release to the general public. Ed Bott explains what makes this update different from the feature updates you’ve come to dread. Read more: https://zd.net/2P1kysX\n\nMicrosoft's latest release of the Windows 10 20H1 preview gives insiders on the Fast Ring new kaomoji, Windows Subsystem for Linux 2 memory management improvements, and Microsoft is rolling out Your Phone connection improvements to more Galaxy phones.\n\nThe new Windows 10 Insider preview build from the 20H1 branch is number 19013 and it builds on the kaomoji — or Japanese emoticon such as /ᐠ。ꞈ。ᐟ\\ — introduced in version Windows 10 version 1903. Users now have more kaomoji options to share with friends.\n\nIn this build, WSL2 also releases unused Linux memory back to the Windows machine. This will happen automatically when memory in the Linux VM is no longer in use.\n\nSEE: 20 pro tips to make Windows 10 work the way you want (free PDF)\n\nAdditionally, for Windows power users Microsoft has released PowerToys version 0.12. Microsoft revived PowerToys for Windows 10 in September as an open source project on GitHub. Now there's dark mode support, a new utility called PowerRename for renaming batches of files, and tweaks to the Fancy Zones window manager.\n\nOne update not limited to insiders are Microsoft's latest improvements to the Your Phone experience with Samsung Galaxy devices. The streamlined connection process for Windows 10 that was originally enabled for the Galaxy Note 10 recently was extended to the Galaxy Gold, S10, S10+, and S10e.\n\nMicrosoft is now bringing it to the mid-range Samsung Galaxy A30s, A50s, and A90 smartphones. Users will need to install the update that enables the 'Link to Windows' feature, which removes the dependency on Bluetooth Low Energy for connections.\n\n\"With the new experience rolling out, we'll be removing the Bluetooth connectivity option, effective immediately. If you were previously enjoying Phone screen over Bluetooth and you have a phone model that doesn't yet support Link to Windows, the Phone screen node will disappear automatically within the Your Phone app,\" Microsoft notified users.\n\nThis new non-Bluetooth experience is available for Android phones running Android 9.0 or higher and at least the Windows 10 October 2018 Update. Additionally, the phone must be the same network as the PC.\n\nMicrosoft also fixed a long list of bugs in this build and there remain for known issues that it is working on fixes for.", "description": "Microsoft also extends the non-Bluetooth method for connecting Galaxy phones to Windows 10 PCs.", "authors": ["Liam Tung"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/10/30/b2f36c14-3986-4fcf-9b1c-f6f6ed02ecb7/thumbnail/770x578/5f421e1268770a012f42d0af3a432954/istock-1044319784.jpg", "published_at": "2019-10-30"}