{"pub": "realclearpolitics", "url": "https://insidehook.com/daily_brief/sports/led-by-juan-soto-nationals-take-game-1-of-world-series", "downloaded_at": "2019-10-23 14:56:59.378016+00:00", "title": "Led By Juan Soto, Nationals Take Game 1 of World Series", "language": "en", "text": "Soto becomes the second-youngest player ever to homer in his first World Series game\n\nJuan Soto of the Washington Nationals singles against the Houston Astros during the eighth inning in Game One of the 2019 World Series at Minute Maid Park on October 22, 2019 in Houston, Texas. (Photo by Tim Warner/Getty Images)\n\nLed by a strong performance by 20-year-old Juan Soto that included a game-tying home run, a double and a single, the Washington Nationals squeaked by the Houston Astros in Game 1 of the World Series last night, winning 5-4 and giving Astros starter Gerrit Cole his first loss in five months.\n\nSoto drove in three of the Nationals’ five runs, and he became just the fourth player in MLB history to hit a home run in the World Series before his 21st birthday, joining Miguel Cabrera, Andruw Jones and Mickey Mantle. The 417-foot blast also makes him the second-youngest hitter of all time to homer in his first World Series game. (Andruw Jones was 19 when he homered in Game 1 of the 1996 World Series.)\n\n“After the first at-bat, I just said, ‘It’s another baseball game,'” Soto said after the game. “In the first at-bat, I’m not going to lie, I was a little bit shaking in my legs.”\n\n“He’s got kind of the ‘it’ factor,” Houston manager AJ Hinch said of Soto. “He’s got the twitch. He’s got fast hands. He’s got no fear. I think that’s really big for a young hitter early in his career to just kind of leave it out there. It looks like he’s completely in control of enjoying the moment, and he hit all sorts of different pitches.”\n\nThis is Juan Soto's first #WorldSeries game. But you wouldn't know it based on these at-bats. pic.twitter.com/XTjcwHbl3a — MLB (@MLB) October 23, 2019\n\nThe Nationals and Astros will play Game 2 tonight (Oct. 23) at 8 p.m. EST. Stephen Strasburg will make the start for the Nats, while Justin Verlander will take the mound for the Astros.\n\nSubscribe here for our free daily newsletter.\n\nRead the full story at ESPN", "description": "Led by a three-hit, three-RBI performance by 20-year-old Juan Soto, the Washington Nationals took game 1 of the World Series.", "authors": ["Bonnie Stiernberg"], "top_image": "https://www.insidehook.com/wp-content/uploads/2019/10/GettyImages-1182789688.jpg?fit=1024%2C683", "published_at": "2019-10-23"}