{"pub": "yahoo", "url": "https://sg.news.yahoo.com/nasa-plans-send-water-hunting-184222648.html", "downloaded_at": "2019-10-25 22:02:55.402063+00:00", "title": "NASA plans to send water-hunting robot to moon surface in 2022", "language": "en", "text": "A passenger plane is seen with the full moon behind as it begins its final landing approach to Heathrow Airport in London, Britain\n\nBy Joey Roulette\n\nWASHINGTON (Reuters) - NASA will send a golf cart-sized robot to the moon in 2022 to search for deposits of water below the surface, an effort to evaluate the vital resource ahead of a planned human return to the moon in 2024 to possibly use it for astronauts to drink and to make rocket fuel, the U.S. space agency said on Friday.\n\nThe VIPER robot will drive for miles (km) on the dusty lunar surface to get a closer look at what NASA administrator Jim Bridenstine has touted for months: underground pockets of \"hundreds of millions of tons of water ice\" that could help turn the moon into a jumping-off point to Mars.\n\n\"VIPER is going to assess where the water ice is. We're going to be able to characterize the water ice, and ultimately drill,\" Bridenstine said on Friday at the International Astronautical Congress in Washington. \"Why is this important? Because water ice represents something significant. Life support.\"\n\nVIPER stands for Volatiles Investigating Polar Exploration Rover.\n\nThe rover is expected to arrive on the moon's south polar region in December 2022, carrying four instruments to sample lunar soil for traces of hydrogen and oxygen - the basic components of water that can be separated and synthesized into fuel for a planned fleet of commercial lunar launch vehicles.\n\nIn development at NASA's Ames Research Center in California, the VIPER robot will log \"about 100 days of data that will be used to inform the first global water resource maps of the moon,\" NASA said in announcing the plans.\n\nNASA is in the process of kickstarting its Artemis programme, an accelerated mission to put people back on the moon for the first time since the 1970s to train and prove technologies that would later be sent on a Mars mission. Scientists have eyed lunar water as a key resource for enabling long-duration astronaut missions on the moon, though its form and exact amount are unknown. VIPER will aim to find out.\n\nNASA crashed a rocket onto the moon's south pole in 2009 to confirm traces of lunar water ice in the plume of dust kicked up upon impact.\n\n\n\n\n\n(Reporting by Joey Roulette; Editing by Bill Tarrant and Will Dunham)", "description": "NASA will send a golf cart-sized robot to the moon in 2022 to search for deposits of water below the surface, an effort to evaluate the vital resource ahead of a planned human return to the moon in 2024 to possibly use it for astronauts to drink and to make rocket fuel, the U.S. space agency said on", "authors": ["Joey Roulette"], "top_image": "https://s.yimg.com/uu/api/res/1.2/FEKM6oM4SExCtG85bF4CZQ--~B/aD01NDE7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/802b0eb2ace0d06aac24fd43fb8b7760", "published_at": "2019-10-25"}