{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/13/japanese-man-sues-asics-saying-he-was-punished-for-taking-paternity-leave", "downloaded_at": "2019-09-13 07:23:42.678083+00:00", "title": "Japanese man sues Asics, saying he was punished for taking paternity leave", "language": "en", "text": "Father says he was transferred from personnel to warehouse role and given ‘meaningless’ tasks after returning from leave\n\nA worker at a major sportswear maker in Japan is suing his employer, claiming he was unfairly treated after taking paternity leave, in a rare legal challenge to the country’s conservative attitude towards gender roles.\n\nThe 38-year-old man, who has requested anonymity after suffering a backlash on social media, claimed at the Tokyo district court this week that Asics punished him for taking a year’s leave after the birth of his children, in 2015 and 2018.\n\nHe had been accused of not being a “team player”, he told the court. “But it’s wrong. I believe the company is attempting to squash an individual who tried to correct its injustice. The management in fact seems to value when men work outside and women stay at home.”\n\nParental leave in Japan is among the most generous in the world, entitling men and women to a year off work, or longer if there is no public childcare provision. But very few men use their paternity leave entitlement, fearing their careers will suffer.\n\nWomen outperform men after Japan medical school stops rigging exam scores Read more\n\nThe alleged mistreatment of men who take leave has given rise to a new phrase, patahara – short for paternity harassment. The term is modelled on matahara – or maternity harassment – used to describe abuse experienced by working women after becoming pregnant or giving birth.\n\nThe employee in the Asics case was initially criticised on Twitter, being described as “selfish” for taking a year of leave for each of his sons, now aged four and one.\n\nThe inability of male employees to take paternity leave is among the obstacles facing the prime minister, Shinzo Abe, as he attempts to increase the number of women in the workplace, particularly in senior positions, and raise the country’s low birth rate.\n\nA corporate culture that values loyalty to the company and long hours, especially from male employees, means just 6% of eligible fathers take paternity leave, according to government data – way below the goal of 13% by 2020.\n\nMore than 70% of men who take paternity leave are away for less than a fortnight. That compares to more than 80% of mothers who use their allowance beyond the mandatory eight weeks after birth.\n\nThe challenge to social norms received a boost recently when the new environment minister, Shinjiro Koizumi – a rising star of Japanese politics – said he would consider taking paternity leave when his wife gives birth next year.\n\nThe court plaintiff said: “There are plenty of people who want to take childcare leave, as it’s their right, but they cannot because their workplace makes it difficult. Someone had to speak up.”\n\n“I’d been thinking, I’m going to be a salaryman for something like 40 years, so what’s a year or two of leave compared to that.”\n\nThe plaintiff, one of a handful of men who have taken their employers to court, said he was transferred to a warehouse operated by an Asics subsidiary after he returned from his first period of paternity leave.\n\nAlthough he did not receive a pay cut or official demotion, he said the physical nature of the work was in stark contrast to his previous role in the company’s personnel department.\n\nAsics allowed him to return to a desk job after he injured his shoulder, but gave him “meaningless” tasks such as translating company guidelines into English, even though he has minimal language skills.\n\nHe wants to be reinstated in his original job, along with 4.4m yen ($41,000) in damages.\n\nAsics denies the allegations and said it had tried to negotiate with the plaintiff’s union representatives and legal team.\n\n“We put effort into fostering diversity, and we will continue to make greater efforts to ensure our work environment and policies allow people to remain active through pregnancy, birth and childcare,” the firm said in a statement.\n\nThe father’s lawyer, Naoto Sasayama, said: “The culture established in a post-war Japan expects men to be the sole breadwinner. Stay-at-home men are considered extremely strange. We want to give hope to all those dads who want to take paternity leave.”\n\nAgencies contributed to this report.", "description": "Father says he was transferred from personnel to warehouse role and given ‘meaningless’ tasks after returning from leave", "authors": ["Justin Mccurry"], "top_image": "https://i.guim.co.uk/img/media/e3eb3bcd7241db92d7e6716848993965fe73c0c2/0_53_2121_1273/master/2121.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0905adeca8a982f8228b69f612775a21", "published_at": "2019-09-13"}