{"pub": "cbs", "url": "https://cbsnews.com/news/lizzo-i-can-be-beautiful-and-be-fat-cbs-sunday-morning", "downloaded_at": "2019-10-03 23:26:46.907977+00:00", "published_at": "2019-10-03", "title": "Lizzo: \"I can be beautiful and be fat\"", "language": "en", "text": "Chart-topping singer, songwriter and actress Lizzo can be \"beautiful and be fat,\" she tells Tracy Smith in an interview for \"CBS Sunday Morning\" to be broadcast October 6.\n\nIn a revealing and emotional interview, Lizzo opens up about her childhood, the death of her father, her long path to success, and a lifetime of listening to well-meaning (and sometimes mean) comments about her weight.\n\nShe told Smith things turned around for her once she started to believe beauty comes in all sizes: \"Like, when I'm looking at my body and I'm shaming every little thing about it, I have to look at all of those things that I'm shaming, and I have to find love in those things. And I think that is why I'm able to call myself fat,\" Lizzo said.\n\n\"I can also feel healthy and still be fat,\" she added. \"I can be healthy and be fat. I can be beautiful and be fat. I can be beautiful and all of those things. And I think it's because I learned to actually look all of my insecurities in the face, call them by their name, and fall in love with them.\"\n\nThe singer Lizzo with correspondent Tracy Smith. CBS News\n\nLizzo, whose real name is Melissa Jefferson, is one of the hottest acts in music today, with such hits as \"Juice\" and \"Truth Hurts.\" She also appears in Jennifer Lopez's hit film \"Hustlers.\" However, she told Smith, she faced many hurdles along the way, including stretches of poverty, homelessness, self-doubt and heartache. She credits frequent talks with Manny Gonzales, her band teacher at Houston's Elsik High School, who gave her the focus she needed.\n\n\"I've had a lot of talks with my band director in here, where he was like, 'You gotta get it together, 'cause you are really special. And you could be doing something with your life. But you're not applying yourself,'\" Lizzo recalled on a trip back to her old school. \"And those talks really impacted me. Now, I'm like, 'Wow, those talks really meant something to me.'\"\n\nTo watch the music video of Lizzo's \"Truth Hurts,\" click on the video player below:\n\nFor more info:\n\n\n\nThe Emmy Award-winning \"Sunday Morning\" is broadcast on CBS Sundays beginning at 9 a.m. ET, and is rebroadcast on Pop TV at 12:30 p.m. ET/9:30 a.m. PT. \"Sunday Morning\" also streams on CBSN beginning at 9:30 a.m. ET and repeated at 1 p.m. ET, and is available on cbs.com, CBS All Access and On Demand.\n\nBe sure to follow us at cbssundaymorning.com, and on Twitter (@CBSSunday), Facebook, and Instagram (#CBSSundayMorning).", "description": "In an interview with \"CBS Sunday Morning,\" the #1 Billboard artist says her life turned around once she started to believe beauty comes in all sizes", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/03/75213b0f-cb08-454a-a9b4-903e68c263a1/thumbnail/1200x630/edd6734aebed9104b0cf7852abc083c1/lizzo-interview-promo.jpg"}