{"pub": "yahoo", "url": "https://sports.yahoo.com/yankees-reliever-betances-told-surgery-not-recommended-212908099--mlb.html", "downloaded_at": "2019-09-19 23:06:47.661984+00:00", "title": "Yankees reliever Betances told surgery not recommended", "language": "en", "text": "NEW YORK (AP) -- Yankees reliever Dellin Betances has been told surgery is not recommended for the partially torn Achilles tendon that ended his season after eight pitches.\n\nBetances received a second opinion from Dr. Martin O'Malley of the Hospital for Special Surgery, who concurred with Dr. Justin Greisberg of New York-Presbyterian Hospital.\n\n''He'll be in a walking boot for another four weeks, and then they'll kind of re-evaluate where he is, but the belief is that he will not need surgery,'' Yankees manager Aaron Boone said Thursday. ''I guess that could possibly change, but they feel pretty confident that this is something that will not need surgery.''\n\nScroll to continue with content Ad\n\nBetances hurt his left foot when he hopped on the mound Sunday at Toronto after striking out Brandon Drury, his second and final batter.\n\nBetances appeared to think it was the third out of the inning and landed awkwardly on the artificial turf at Rogers Centre . His foot was sore when he arrived at Yankee Stadium before Tuesday's game .\n\nA four-time All-Star, Betances is a 31-year-old right-hander eligible for free agency after the World Series. Boone spoke with New York on the brink of clinching the AL East title.\n\nBetances was diagnosed with an impingement in his pitching shoulder after his fourth spring training appearance on March 17. His rehabilitation stopped when the team said June 11 that he had strained his right latissimus dorsi muscle, and Betances did not start a minor league injury rehabilitation assignment until September.\n\n---\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP-Sports", "description": "Yankees reliever Dellin Betances has been told surgery is not recommended for the partially torn Achilles tendon that ended his season after eight pitches.  Betances received a second opinion from Dr. Martin O'Malley of the Hospital for Special Surgery, who concurred with Dr. Justin Greisberg of", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/U_MwqotgmfFuRSJNGfo4aw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD03NjA-/https://s.yimg.com/uu/api/res/1.2/GO01EAZjfBdbjyO_lpEOhA--~B/aD0zODA7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201909172148785206885", "published_at": "2019-09-19"}