{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/what-is-a-credit-union-an-alternative-to-traditional-banks", "downloaded_at": "2019-10-16 23:16:41.898074+00:00", "title": "Credit unions may seem like traditional banks, but they typically offer better interest rates and lower fees", "language": "en", "text": "While credit unions offer many of the same services as banks, they are member-owned, not-for-profit organizations.\n\nBecause they exist to serve their members, credit unions tend to offer low fees and attractive interest rates on loans and credit cards.\n\nYou may be eligible to join a credit union by virtue of where you live, where you work, or your family connections.\n\nRead more personal finance coverage.\n\nOn the surface, credit unions look a lot like banks.\n\nBoth are financial institutions that offer products like savings and checking accounts, and personal loans. But when you look a little deeper, you'll find that there are several major differences between banks and credit unions.\n\nCredit unions offer some unique advantages, which can make them an attractive banking choice. But they may not be for everyone. Let's take a look at what a credit union is and its pros and cons.\n\nWhat is a credit union?\n\nCredit unions are member-owned, not-for-profit organizations. Let's break that definition down a bit.\n\nSince credit unions are member-owned, each member gets a voice in how the credit union is run. And rates and fees are designed to benefit members, not line the pockets of outside investors.\n\nSince credit unions are not-for-profit institutions, profits are funneled back to members in the form of interest rate discounts, higher savings account rates, and slashed fees.\n\nAccording to the latest data from the National Credit Union Administration, credit unions offer more attractive rates on nearly every type of financial product. In some categories, the difference is slight, but in other areas, it's more pronounced.\n\nFor example, the average interest rate for 60-month car loans from credit unions is more than 1.5% lower than the average bank.\n\nHow can you join a credit union?\n\nThere are various ways you could become eligible to join a credit union. One of the most common bonds that credit union members share is geographic location. With these kinds of credit unions, you simply need to live, work, or go to school in a particular geographic area in order to join. Find a credit union near you.\n\nDepending on where you work, you may also be eligible for a credit union membership through your employer. And if someone in your family is already a member of a credit union, you'll usually be allowed to join as well.\n\nAre there downsides to credit unions?\n\nApart from the fact that they can be more difficult to join, credit unions may come with a few additional disadvantages.\n\nFirst, you'll have fewer brick-and-mortar stores and ATMs outside your geographic area. Thankfully, many credit unions offer free ATM access throughout the US via national ATM networks. But if you travel a lot, this is definitely something you'll want to look into before you join a credit union.\n\nSecond, your credit union may not be able to offer as many products and services as a national bank. Don't expect to have five different checking and savings account options or dozens of credit card choices.\n\nCredit unions are like the Aldi of banking. You'll probably have fewer options, but what you are offered should be competitive and affordable.\n\nAnd, lastly, they may not offer as many technological \"bells and whistles,\" like mobile apps or fully-featured websites. But if all you need is online bill pay, that shouldn't be a problem with most credit unions.\n\nIs a credit union right for you?\n\nAt one time, credit unions were far-and-away the best banking choice in terms of rates and fees.\n\nBut with the advent of online banks, free checking and high-yield savings accounts are becoming more common. Credit unions can still be a great choice, but they have competition now.\n\nAs you're shopping around, make sure to compare credit unions with community banks, online banks, and even large national banks. And if it turns out that a credit union offers the best features and rates and you're eligible to join, go for it!\n\nMore coverage from How to Do Everything: Money", "description": "While credit unions offer many of the same services as banks, they are member-owned, not-for-profit organizations.", "authors": ["Clint Proctor"], "top_image": "https://image.businessinsider.com/5da7871ecc4a0a54a01a4b15?width=1200&format=jpeg", "published_at": "2019-10-16"}