{"pub": "businessinsider", "url": "https://businessinsider.com/backlash-donald-trump-jr-speaking-kim-guilfoyle-university-of-florida-2019-10", "downloaded_at": "2019-10-03 07:46:38.749329+00:00", "published_at": "2019-10-03", "title": "Students and staff at the University of Florida slam 'ignorant and shameful' decision by student body to use $50,000 in student fees to pay Donald Trump Jr. and Kim Guilfoyle for speaking engagement", "language": "en", "text": "The University of Florida is facing backlash for paying Donald Trump Jr. and senior adviser for President Donald Trump's re-election campaign, Kim Guilfoyle, $50,000 in student activity fees to speak at a campus event this month.\n\nStaff and students told Business Insider that the use of student funds was inappropriate and called for the event, hosted by university's ACCENT Speakers Bureau, to be cancelled.\n\nACCENT Speakers Bureau Chair Henry Fair defended the decision to the student newspaper and said it was important to bring \"prominent, influential and, oftentimes, controversial speakers to campus.\"\n\nDespite the controversy, some former students have expressed support for the event and said ACCENT was fulfilling its mission statement to bring in speakers \"across the political spectrum.\"\n\nVisit Business Insider's homepage for more stories.\n\nThe University of Florida is facing backlash for a scheduled speaking event that will feature the president's son, Donald Trump Jr., and former Fox News host Kim Guilfoyle, who serves as a senior adviser for President Donald Trump's re-election campaign.\n\nDetails of the October 10 event were announced on Tuesday by the ACCENT Speakers Bureau, an agency of the University of Florida's student government.\n\nAccording to The Independent Florida Alligator, the daily student newspaper of the University of Florida, the pair will be paid $50,000 for the speaking engagement. That money is funded by student activity fees, though the event itself is free and open to the public.\n\nACCENT Speakers Bureau Chair Henry Fair defended the decision in an email to the Alligator, saying that the event hopes to spark discussion.\n\n\"Part of our mission is to engage the UF campus community in discussions on important issues by bringing prominent, influential and, oftentimes, controversial speakers to campus,\" he wrote.\n\nThe university has hosted controversial figures in the past, including white nationalist Richard Spencer, in 2017, which prompted widespread criticism and protest.\n\nStudents and staff have slammed the decision to invite Trump Jr. and Guilfoyle to speak and have voiced concern that their money was being used to fuel a political agenda.\n\nRead more: Michael Cohen says Trump 'frequently' told him that Donald Trump Jr. has 'the worst judgment of anyone in the world'\n\nSeveral students have created a Facebook event called \"Protest: Say NO to Donald Trump Jr. and Kimberly Guilfoyle,\" which calls for students to boycott the event.\n\n\"This is an insult to the multicultural organizations that have had their funds stripped away from them by Student Government,\" the event page writes.\n\nKaitlyn Muchnok, a PhD candidate at the university, wrote on Twitter that the decision to invite Trump Jr. was \"ignorant and shameful.\"\n\nMuchnok told Business Insider that she was furious that her student fees were being used to fund the event.\n\n\"It disgusts me that student fees will be used to pay Donald Trump Jr. $50,000,\" she said. \"There are countless experts on American politics, history, etc. on UF's own campus that could provide a diversity of views on current events.\"\n\nShe told Business Insider that it was up to the university to be more \"selective\" when providing a public platform for discussion, adding that she felt Trump Jr. was \"unqualified.\"\n\nCory Watson, a lab tech in the neuroscience department, told Business Insider that the decision to pay Donald Trump Jr. $50,000 for the event is \"insane.\"\n\n\"That money could've gone to much better causes,\" he said.\n\nUniversity of Florida said in a statement on Wednesday that inviting Trump Jr. and Guilfoyle to speak does not violate rules against using student money for political gain, the Gainesville Sun reported.\n\nDespite the controversy, some people voiced support for the event. Jared Schermer, a former student at the university, said that ACCENT was fulfilling its mission statement to invite speakers from \"all over the political spectrum.\"\n\n\"Not a Trump supporter, but ACCENT has 'controversial speakers' in its mission statement and has brought in speakers from all over the political spectrum. This obviously fits that criteria. If you don't want to go, don't,\" he commented on a post by ACCENT announcing the event.\n\nACCENT Speakers Bureau and University of Florida's Student Union did not immediately respond to Business Insider's request for comment.", "description": "\"It disgusts me that student fees will be used to pay Donald Trump Jr. $50,000,\" one University of Florida student told Business Insider.", "authors": ["Rosie Perper"], "top_image": "https://image.businessinsider.com/5d0aab98b587c646d743c715?width=1200&format=jpeg"}