{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/cancel-your-apple-arcade-trial-today-if-youre-not-using-it", "downloaded_at": "2019-10-18 01:18:00.504423+00:00", "title": "Cancel Your Apple Arcade Trial Today If You're Not Using It", "language": "en", "text": "Photo: Alex Cranz, Gizmodo\n\nWe’ve all been there — sign up for a free trial, and then get dinged with a pesky automatic subscription renewal. If you’re one of the early adopters who leapt onto the Apple Arcade train as soon as it launched, here’s a friendly reminder that you might want to cancel before your credit card gets charged.\n\nApple Arcade launched September 19 with a free one-month trial. And so far, the response has been fairly positive. Not only did the service launch with 100 titles, it’s free of the microtransactions and ads that can ma, ke mobile gaming so frustrating.\n\nOverall, in the short time Apple Arcade has been available, Gizmodo is a fan of the service — as is our sister site Kotaku, which characterised it as “mobile gaming without all the bullshit.” (For what it’s worth, after pondering whether to shell out after the free trial, Kotaku’s Mike Fahey decided Apple Arcade is worth the $7.99.)\n\nThat said, we get it. The avalanche of content and endless subscription wars are tiring.\n\nThere’s probably at least ten shows, podcasts, books, albums and other video games piling up and collecting dust in your queue. Maybe, even if you like Apple Arcade overall, you just can’t justify the extra $7.99 on a service that’ll mostly be relegated to your train commute. If that’s the case, this is your chance to cancel before you pay a dime.", "description": "We’ve all been there — sign up for a free trial, and then get dinged with a pesky automatic subscription renewal. If you’re one of the early adopters who leapt onto the Apple Arcade train as soon as it launched, here’s a friendly reminder that you might want to cancel before your credit card gets charged....", "authors": ["Sam Rutherford", "George Dvorsky"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/bq7rbotovrmboyocmoyk.jpg", "published_at": "2019-10-18"}