{"pub": "yahoo", "url": "https://news.yahoo.com/more-vietnamese-fear-relatives-among-055219202.html", "downloaded_at": "2019-10-26 06:55:20.365502+00:00", "title": "More Vietnamese fear relatives are among 39 dead in truck", "language": "en", "text": "Police leave the home of Joanna and Thomas Maher with an evidence box at Wiltshire close in Warrington, Cheshire, Friday, Oct. 25, 2019, after a man and a woman, both aged 38 and from Warrington, have been arrested on suspicion of manslaughter and conspiracy to traffic people in connection with the 39 bodies found in a lorry in Essex on Wednesday. ( Jason Roberts/PA via AP)\n\nHANOI, Vietnam (AP) — More Vietnamese families came forward Saturday with information their relatives may be among the 39 people found dead in the back of a container truck in southeastern England.\n\nBritish police initially said they believed the victims were Chinese but acknowledged this was a \"developing picture.\"\n\nPolice on Friday arrested three people on suspicion of manslaughter and conspiracy to traffic people. The 25-year-old driver of the truck remains in custody on suspicion of murder.\n\nIn Vietnam, the father of 20-year-old Nguyen Dình Luong feared his son was among the dead.\n\nHe told The Associated Press he had not been able to reach him since last week, when he told his father he would join a group in Paris that was trying to reach England.\n\n\"He often called home but I haven't been able to reach him since the last time we talked last week,\" Nguyen Dình Gia said. \"I told him that he could go to anywhere he wants as long as it's safe. He shouldn't be worry about money, I'll take care of it.\"\n\nHe said his son left home in central Ha Tinh province to work in Russia in 2017, then on to Ukraine. In April 2018, he arrived in Germany then traveled to France. He told his family that he wanted to go to the U.K.\n\nLuong's older brother, Pham Dình Hai, said that Luong had a tattoo of praying hands on a cross on his right shoulder. The family said they shared the information with local authorities.\n\nThe Vietnamese Embassy in London said Friday that it contacted police about a missing woman feared to be one of the dead. An embassy spokesman said it was contacted by a family in Vietnam who says their daughter had been missing since the truck was found.\n\nThe BBC reported it had been in contact with six Vietnamese families who feared their relatives are among the victims. Relatives of 26-year-old Pham Tra My told the broadcaster they had been unable to contact her since receiving a text Tuesday night saying she was suffocating.\n\n\"I'm so sorry mom and dad....My journey abroad doesn't succeed,\" she wrote. \"Mom, I love you and dad very much. I'm dying because I can't breathe .... Mom, I'm so sorry.\"\n\nChina said it could not yet confirm the victims' nationalities or identities. There was speculation circulating online in Vietnam that the victims may have been traveling on false Chinese passports.\n\n\"The police said that they were urgently carrying out the verification work and the identities of the victims cannot be confirmed at present,\" said Tong Xuejun, a Chinese consular official in London.\n\n\"We hope the British side can verify the victims' identities as soon as possible,\" he said. \"What I want to stress is that no matter what their nationalities are, this incident is a huge tragedy which arouses attention of the international community to issues of illegal immigration.\"\n\nChinese Foreign Ministry spokeswoman Hua Chunying said Chinese authorities were also seeking information from police in Belgium, since the shipping container in which the bodies were found was sent to England from the Belgian port of Zeebrugge.\n\nBritish police believe the truck and container took separate journeys before ending up at the industrial park. They say the container traveled by ferry from Zeebrugge to Purfleet, England, where it arrived early Wednesday and was picked up by the truck driver and driven the few miles to Grays.\n\nThe truck cab, which is registered in Bulgaria to a company owned by an Irish woman, is believed to have traveled from Northern Ireland to Dublin, where it caught a ferry to Wales, then drove across Britain to pick up the container.\n\nGroups of migrants have repeatedly landed on English shores using small boats to make the risky Channel crossing, and migrants are sometimes found in the back of cars and trucks that disembark from the massive ferries that link France and England.\n\nBut Wednesday's macabre find in an industrial park was a reminder that criminal gangs are still profiting from large-scale trafficking.\n\nThe tragedy recalls the deaths of 58 Chinese migrants who suffocated in a truck in Dover, England, in 2000 after a perilous, months-long journey from China's southern Fujian province. They were found stowed with a cargo of tomatoes after a ferry ride from Zeebrugge, the same Belgian port featured in the latest tragedy.\n\nIn February 2004, 21 Chinese migrants — also from Fujian — who were working as cockle-pickers in Britain drowned when they were caught by treacherous tides in Morecambe Bay in northwest England.", "description": "More Vietnamese families came forward Saturday with information their relatives may be among the 39 people found dead in the back of a container truck in southeastern England.  In Vietnam, the father of 20-year-old Nguyen Dình Luong feared his son was among the dead.  \"He often called home but I", "authors": ["Hau Dinh"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.sKTGLvIQziTpfHOmmNnwg--~B/aD0xNzAwO3c9MTI1MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/0132d33eabf42ed2882ed1ff2701ad77", "published_at": "2019-10-26"}