{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7542153/Jenna-Dewan-beams-joy-cloaks-growing-bump-beneath-baggy-khaki-shirt.html", "downloaded_at": "2019-10-06 00:27:40.554348+00:00", "title": "Jenna Dewan beams with joy as she cloaks her growing bump beneath baggy khaki shirt", "language": "en", "text": "She got in some weekend shopping before her growing baby bump makes it difficult to get about.\n\nJenna Dewan was spotted out in the Los Angeles neighborhood of Studio City on Friday.\n\nThe actress and dancer, 38, is expecting her first child with her new actor-singer beau Steve Kazee, 43.\n\nOut and about: Jenna Dewan was spotted in the LA neighborhood of Studio City on Friday\n\nAnd she played things coy by hiding her bump under a loose khaki shirt teamed with a black T-shirt and skin-tight black leggings.\n\nJenna appeared to be shopping for clothes - or Halloween outfits - for her six-year-old daughter Everly Tatum as she held up a tiny pair of jeans.\n\nShe shares her little cutie with her ex-husband, Channing Tatum, 39.\n\nJenna and the hunky Magic Mike star shocked their family, friends and fans when they announced their separation on Instagram in April last year.\n\nCovering up: The actress and dancer, 38, is expecting her first child with her new actor-singer beau Steve Kazee, 43\n\nBrunette beauty: She let her long hair spill over her shoulders and hid her eyes behind shades\n\nThe couple's split ended nearly nine years of marriage after they fell in love on the set of musical Step Up in 2006.\n\nMeanwhile, Jenna has moved on with Steve, and they have been together since last October.\n\nSteve seemed delighted to draw attention to Jenna's baby bump, resting his hand on her tummy when they walked the blue carpet at the WWE 20th anniversary bash at the Staples Center in downtown Los Angeles on Friday.\n\nRetail therapy: Jenna was spotted looking through a rail of children's costumes perhaps looking for a Halloween outfit for daughter Everly Tatum, six\n\nThey won't fit her: But the jazzy jeans look like they'd be ideal for Everly, whom she shares with her ex, Channing Tatum, 39\n\nIs there a problem?: Jenna checked her cell phone and the street and she appeared to be expecting someone\n\nShe wore a stylish black jumpsuit with a plunging neckline and she looked up lovingly at her silver fox baby daddy who wore a black shirt with a pattern of white leaves and black pants.\n\nChanning has also found new love - British pop star Jessie J, 31.\n\nHe has even rented a mansion in Suffolk with Jessie and now splits his time between the UK and Los Angeles.\n\nStill waiting: Jenna checked her phone as she continued to hang around\n\nSmile and wave: The star spotted her pal on the streets in Studio City", "description": "The actress and dancer, 38, who is expecting her first child with her new actor-singer beau Steve Kazee, 43, was seen  out shopping in the Los Angeles neighborhood of Studio City on Friday.", "authors": ["Bobbie Whiteman For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/00/19346298-0-image-a-80_1570317157520.jpg", "published_at": "2019-10-05"}