{"pub": "huffpost", "url": "https://huffpost.com/entry/chef-jose-andres-first-pitch-trump_n_5db33abde4b05df62ebea7cb", "downloaded_at": "2019-10-25 21:56:01.060763+00:00", "title": "Chef, Trump Critic José Andrés To Throw First Pitch Of Game 5 With Trump In Attendance", "language": "en", "text": "The Washington Nationals announced Friday that D.C. chef José Andrés will throw the first pitch in a potential Game 5 of the World Series. And the president, whom Andrés has routinely criticized, is expected to be there to see it.\n\n“I’m humbled,” Andrés tweeted on Friday following the announcement.\n\nIt’s possible that the series will end between the Nationals and Houston Astros before a Game 5, but should the game happen, President Donald Trump said he would also attend.\n\nI’m humbled by the invitation, and I realize is a big big big honor but I really hope that by Saturday night all of WASHINGTON will be celebrating that the @Nationals are the 2019 @MLB World Series Champions...🙏😘😘👨‍🍳⚾️🏆 https://t.co/V6EvP9L7Lr — José Andrés (@chefjoseandres) October 25, 2019\n\nAndrés, who was born in Spain, has been vocal about his dislike of Trump and pulled out of a planned deal to open a restaurant in Trump International Hotel after the president called Mexicans crossing the border “rapists” who bring drugs into the U.S.\n\nWhen asked Thursday if Trump would like to throw the first pitch, Trump said he’d look too “heavy” in a bulletproof vest.\n\n“They’ve got to dress me up in a lot of heavy armor — I’ll look too heavy,” he told reporters.\n\nThe real reason is more obvious: Trump tried his hand at throwing a first pitch in 2006. It wasn’t a great look for him.\n\nAP Photo/Charles Krupa Donald Trump throws out the ceremonial first pitch before the start of the game between the Boston Red Sox and the New York Yankees in the second game of a day/night doubleheader on Aug. 18, 2006, at Fenway Park in Boston.", "description": "If the World Series between the Houston Astros and Washington Nationals goes to Game 5, Andrés will pitch with the president in attendance.", "authors": ["Senior Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5db33c91210000872ead3eca.jpeg?cache=tgbvgy68wi&ops=1778_1000", "published_at": "2019-10-25"}