{"pub": "businessinsider", "url": "https://businessinsider.com/larry-ellison-oracle-board-candidates-next-ceo-2019-9", "downloaded_at": "2019-09-20 22:42:24.197975+00:00", "title": "Larry Ellison is giving Oracle's board five internal candidates for the next CEO, should Mark Hurd be unable to return", "language": "en", "text": "Many people inside Oracle were not shocked when the company announced earlier this month that co-CEO Mark Hurd was ill and taking a leave of absence.\n\nEmployees had been speculating about his health for over a year, several of them told us. They had noticed a dramatic change in his hair and weight, and that he was uncharacteristically canceling meetings and public appearances at the last minute.\n\nDespite decades in the public eye as a tech exec, Hurd is a notoriously private individual. So the company has said very little about what kind of illness Hurd is battling, or how likely it is he will return to his job. And internally, employees tell us that many believe the situation is so serious, he may never return. Oracle declined to comment for this story.\n\nRead: A former WeWork executive who made $300,000 and is now suing describes strange cultlike culture, including endless flows of alcohol at mandatory sleepover camp for employees and the CEO's children on his lap during an all-hands meeting\n\nThis means that right now, Safra Catz is the one and only CEO of the company. She previously said she had no desire to be Oracle's sole CEO and that she plans to retire from the company whenever Ellison leaves. She could, of course, change her mind and stay on after Ellison retires — if he ever does. Ellison never discusses retirement, but he is 75 and will presumably hand the reins over at some point.\n\nOn Thursday, during Oracle's annual OpenWorld tech conference held in San Francisco this week, the company held a financial analyst meeting, where chairman and CTO Larry Ellison was asked about succession planning with Hurd gone. And it sounds like Catz is, indeed, getting a new co-CEO.\n\nWhen Ellison was asked about succession planning he said he promised to provide the board of directors with a list of five internal candidates who could be named CEO.\n\n\"A lot of people have said, 'God, you guys are weird. Two CEOs? That's ridiculous. That's bad governance,'\" Ellison quipped. \"I believe in a dual CEO structure. The normal case [at Oracle] would be dual CEO here for obvious reasons. That it's good to have capacity and good to have specialization. And then, God forbid, if something untoward should happen, you have capacity, you are not incapacitated.\"\n\nA 'well-functioning' triumvirate\n\nThe Ellison/Catz/Hurd combo was a \"well-functioning\" triumvirate executive team, as one former Oracle employee described it. Ellison handles the technical/engineering parts. Catz is Oracle's finance and M&A wizard. Hurd was in charge of sales and marketing.\n\nEllison emphasized that Catz is not planning on leaving any time soonm but he also described Oracle as a \"complicated\" company. It offers a lot of products including making its own hardware, as well as a large sales and service organization. That's why he likes the dual CEO structure, and why Oracle wants to promote someone internally, who knows the company, into the top job.\n\n\"We should have people in the company capable of being promoted into that position. So when there is a succession, we're not running out and doing a search,\" he said.\n\nHe didn't specify if this person could expect to be promoted to the co-CEO spot alongside Catz, should Hurd be unable to return, or if these people would be groomed for an eventual CEO role later.\n\nSome analysts in the room believed that Oracle is leaning towards maintaining the co-CEO role — such as Instinet's Christopher Eberle, who wrote about the CEO search in a research note.\n\nSo who, internally, could take Hurd's place?\n\nEllison actually tossed out a couple of names on stage while answering the question. One of them was Steve Miranda, executive vice president of Oracle Applications product development, who's been with the company since 1992.\n\nHe also mentioned Don Johnson, vice president of Oracle Cloud Infrastructure product development. Johnson gave his own presentation to the assembled analysts that morning.\n\nJohnson has also risen high in Ellison's estimation, particularly since Thomas Kurian, Oracle's former cloud boss, left to run Google Cloud. Some employees say Johnson's rise within the company was even one reason why Kurian left, after swatches of the engineering team were peeled from Kurian and assigned to Johnson.\n\nEd Screven is probably Ellison's go-to engineering mastermind. He's on the board as a named officer, with the title of chief corporate architect. He's internally known as a brilliant engineer and Oracle's real chief technologist — however, the people we've talked to don't see him as the CEO type.\n\nNot everybody wants the job\n\nEllison said that not everyone who could be on the list wants the job, including himself.\n\n\"By the way, not everyone who's doing a spectacular job even wants to be CEO. Let me tell you, I'm really happy about not being CEO,\" he said. \"I much prefer my job I have now. I like it better than being CEO.\"\n\nThat said, Oracle is still very much Ellison's company. He still sets the strategy and makes decisions.\n\nAs for Miranda and Johnson, they are both more on the technical and engineering side of the house. Hurd's job was sales and marketing.\n\nSome potential candidates in that vein could be Dave Donatelli, a former HP executive who followed Hurd to Oracle during Meg Whitman's reign at HP. Donatelli is executive vice president for the worldwide sales and marketing strategy for Oracle Cloud, reporting to Hurd.\n\nEmployees also tell us that Oracle's EMEA group has been really crushing their sales numbers recently, too, particularly with the company's all important autonomous database cloud products. The head of EMEA is Loïc Le Guisquet.", "description": "Ellison likes the co-CEO structure, he said. With Mark Hurd out, he's working to find 5 internal executives who may be promoted to replace him as CEO.", "authors": ["Julie Bort"], "top_image": "https://amp.businessinsider.com/images/5d85345d2e22af48ff1a0bf2-1334-667.jpg", "published_at": "2019-09-20"}