{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7575805/Inter-scramble-increase-release-clause-Lautaro-Martinez-Barca-interested.html", "downloaded_at": "2019-10-15 16:22:34.247051+00:00", "title": "Inter scramble to 'increase release clause of Lautaro Martinez' with Barca interested", "language": "en", "text": "Inter Milan want to increase the £96 million release clause of Lautaro Martinez in a bid to ward off interest from Barcelona.\n\nThe Argentine striker has been in enthralling form this season, bagging three goals in nine appearances in all competitions, including a strike against the Catalan giants in the Champions League.\n\nHis performances seem to have caught the attentions of Barcelona, with Inter scrambling to renew his contract in a bid to raise, or even abolish, his clause, according to Tuttosport.\n\nThe Argentine striker has been in enthralling form this season, bagging three goals in nine\n\nInter are worried that the Blaugrana could easily trigger his current one.\n\n'Talk of Barcelona's interest is true,' the player's agent Alberto Yaque told Ole back in July.\n\n'No-one's called us, but we know that they've been looking at him strongly. It's true that Barcelona like him.'\n\n'Talk of Barcelona's interest is true,' the player's agent Alberto Yaque said back in July\n\nLAUTARO MARTINEZ'S SEASON IN NUMBERS Serie A Appearances: 7 Goals: 2 Assists: 1 Champions League Appearances: 2 Goals: 1 Assists: 0\n\nReports also suggested last month that his international strike mate, Lionel Messi also likes him - and informed his club to pounce on the goalscorer whose current deal runs until June 2023.\n\nThe 22-year-old has netted eight Serie A goals across 34 appearances for the Nerazzurri but it is all action displays and potential that may excite Barca, who are in the midst of a youth revival.\n\nAlongside Romelu Lukaku and Alexis Sanchez, the Argentine has managed to revitalise an attack that lost the goal-scoring ability of Mauro Icardi, who joined PSG in the summer.\n\nValuations of the starlet hover around the £90 million mark, since his early goal against Ernesto Valverde's side.", "description": "The Argentine striker has been in enthralling form this season, bagging three goals in nine appearances in all competitions, including a strike against the Catalan giants in the Champions League.", "authors": ["Leigh Mcmanus For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/16/19747012-0-image-a-20_1571151779331.jpg", "published_at": "2019-10-15"}