{"pub": "marketwatch", "url": "https://marketwatch.com/story/why-saudi-arabias-output-hit-wont-lead-to-shocking-prices-at-the-gas-pump-2019-09-16", "downloaded_at": "2019-09-16 23:14:31.721867+00:00", "title": "Why Saudi Arabia’s output hit won’t lead to shocking prices at the gas pump", "language": "en", "text": "Global crude production has taken a serious hit following the weekend attack on Saudi oil facilities, leading to a spike in oil prices, but for gasoline — and U.S. drivers — this market-moving event couldn’t have come at a better time.\n\n“Motorists are lucky this didn’t happen during summer driving season,” said Patrick DeHaan, head of petroleum analysis at GasBuddy. Labor Day on Sept. 2 marked the end of the season.\n\nGasoline prices at the pump are little changed since the Saturday attack on Saudi Arabia’s oil facilities cut an estimated 5.7 million barrels a day from the kingdom’s oil production, equal to more than 5% of the world’s daily supply.\n\nOn Monday afternoon, the average per-gallon price for regular gasoline stood at $2.560, compared with yesterday’s average of $2.559, according to gas-price tracker GasBuddy.\n\nRead: Global oil surges after Saudi ‘supply shock’\n\nThe “timing is fortunate,” said Denton Cinquegrana, chief oil analyst at the Oil Price Information Service by IHS Markit. “If this happened four months ago, we could be talking about a much more significant retail [gasoline] price spike.”\n\nHowever, this is the time of year when the market has switched away from the summer gasoline blends, which are required to meet tougher environmental standards, toward winter blends, which are cheaper and easier to make, he said.\n\nSaudi Arabia was producing around 9.6 million to 9.7 million barrels of oil a day before the attack, so this is “a serious hit, but this will be measured in days, weeks or months,” said Cinquegrana.\n\nHe also pointed out that the amount of oil the U.S. imports from Saudi Arabia has reached its lowest level in at least a decade.\n\nIn May of this year, the U.S. imported 462,000 barrels a day of oil and petroleum products from Saudi Arabia, the lowest monthly figure since March 1987, according to the Energy Information Administration, based on data going back to January 1977.\n\nStill, “we are seeing [gasoline] prices react across the supply chain and around the country” in futures, spot and wholesale prices, Cinquegrana said. The front-month October reformulated gasoline contract RBV19, -0.98% rallied by 12.8%, or 19.9 cents, to settle at $1.7524 a gallon on the New York Mercantile Exchange on Monday.\n\nAt the pump, however, “I don’t think it’s going to be a drastic move,” he said, adding that prices may potentially move higher, in the 10-cents-a-gallon vicinity, over the next couple of days.\n\nGasBuddy Retail gas prices have been trending lower in recent weeks.\n\nOil prices, meanwhile will be “elevated for weeks, if not months,” said DeHaan. “A risk premium will likely stick around ... as this remains fresh for quite awhile — at least as long as it takes [Saudi Arabia] to get back to 100% normal, but, even after [that], the shock that such an event happened in Saudi Arabia, a stable and reliable oil producer, will likely continue to haunt the market.”\n\nOn Monday, October West Texas Intermediate crude CLV19, -1.51%, the U.S. benchmark, rose nearly 15%, up $8.05, to $62.90 a barrel.\n\nRead: Here’s what happened to the global economy the last eight times oil prices have doubled\n\nRetail gas prices may climb by “pennies or so per day, starting midweek, lasting probably one to two weeks or longer,” with prices eventually going up by 10 cents to 25 cents per gallon, if Saudi Arabia can’t quickly restore production, said DeHaan.\n\nDrivers will “probably notice,” but “I'd classify this as minor still, compared to such events like Hurricane Harvey, Katrina or refinery outages like in 2015 when BP’s Whiting, Ind., refinery went down,” he said.\n\nThe switch to cheaper winter gasoline blends will help limit the price increases, said DeHaan. “For many motorists, there is no reason to run out to fill up. You aren’t going to wake up tomorrow (or later) to a massive spike like what we've seen in previous dramatic events.”\n\nFurther, he said, “I don’t think we’ll see any locations in the U.S. surpass their previous 2019 high.”\n\nMeanwhile, President Donald Trump tweeted that he had authorized the release of oil from the U.S. Strategic Petroleum Reserve, if needed.\n\nIf the U.S. does release oil from the reserve, it will be a “week or more before refiners get that crude, and not all refiners have access,” DeHaan said. The “West Coast is basically cut off from easy access.”\n\nRefiners and oil companies would likely “bid on the oil ... then pay the U.S. government,” he said, adding that this has happened several times before following major weather events, such as hurricanes that disrupted oil production in the Gulf of Mexico.", "description": "Global crude production has taken a serious hit following the weekend attack on Saudi oil facilities, leading to a spike in oil prices but for gasoline, this...", "authors": ["Myra P. Saefong", "Markets Commodities Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR377_oil_sa_ZG_20190916120903.jpg", "published_at": "2019-09-16"}