{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/18/bryce-harper-so-happy-nationals-says-he-isnt-jealo", "downloaded_at": "2019-10-19 10:57:35.899629+00:00", "title": "Bryce Harper 'so happy' for Nationals, says he isn't jealous of old team's success", "language": "en", "text": "Bryce Harper awoke on his 27th birthday Wednesday in a strange new world — one where the Washington Nationals, the team he left via free agency last offseason, were finally in the World Series.\n\nThe Nationals clinched the first World Series berth in their history Tuesday night with a four-game sweep of the St. Louis Cardinals in the National League Championship Series. That they finally overcame their playoff demons just eight months after Harper signed with the Philadelphia Phillies was not lost on the baseball-watching public.\n\nNor did people forget that Harper had an ironic slip of the tongue during his introductory press conference in Philadelphia: “We want to bring a title back to D.C.”\n\nWith all that, many have wondered how Harper took it as his old team powered its way into the World Series.\n\nHarper told The Athletic he wasn’t envious of his former Nationals teammates getting as far as they did so soon after he chose to leave.\n\n“No, because like I said, I made my decision, and that was my decision,” Harper said. “And it was the final decision that I made. You know, jealousy isn’t good. For me, it’s about having the gratitude to go out and do what I do each day and not having an attitude towards anybody else.”\n\nHarper even admitted that by not signing him back, the Nationals were able to spend on more pitchers last offseason, most notably starters Patrick Corbin and Anibal Sanchez.\n\nBut he didn’t say the Nationals were better off without him. And again, he swore he wasn’t jealous.\n\n“I think it’s about being able to be the person that I am and not saying to myself, ‘Oh my gosh, I can’t believe I’m not a National,’” Harper said. “Or, ‘Oh my gosh, those guys are doing what they’re doing. I can’t believe it. I’m so jealous.’ No. I’m so happy for them. You know how hard it is to get into the postseason and win games.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Harper told The Athletic he wasn't envious of his former Washington Nationals teammates getting as far as they did so soon after he chose to leave.adam", "authors": ["The Washington Times Http", "Adam Zielonka"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/29/marlins_phillies_baseball_10557_c0-99-2377-1485_s1200x700.jpg?b8cd2a888e12967d1cb3f401e67bbad612550ed7", "published_at": "2019-10-18"}