{"pub": "investing.com", "url": "https://in.investing.com/analysis/whats-brewing-in-alcohol-industry-200432274", "downloaded_at": "2019-10-04 02:41:08.236979+00:00", "title": "What's brewing in Alcohol Industry?", "language": "en", "text": "India’s alcohol industry is believed to be worth $35 billion, being third largest in the world. There have been several structural changes in the society which is driving the demand of booze. Indians drink on an average around 5.9 litres per year as compared to global average of 6.5 litres per year.\n\nSome of them as per our research and from the report of \"India Whisky Market Outlook, 2023\" are:\n\nChange of perception towards consumption of alcohol - No celebration now is considered complete without toasting glasses of alcohol, especially family gathering or professional parties. Consuming liquor is perceived as Experiential - Indian population being relatively young, with around 53% of the population under the age of 30 years as per data provided by the Ministry of Statistics and Programme Implementation. With the advent of the economy moving more towards the service oriented economy, segment of young people who are employed in prestigious jobs with more exposure to western culture is on the rise and they regularly experiment by consuming different types of liquor. Increasing stress in Life - The continuous work pressure, increasing psychological dissatisfaction led by social media, imbalanced life has led to the stressful life of the millennial and this is taken as one of the strong reasons why consumption of alcohol has increased and the demand is created in the market. Women's increased alcohol consumption - As per the reports of a survey conducted by the Community Against Drunken Driving (CADD), \"More women are drinking and women are drinking more\". After traditionally being non drinkers for decades, the women’s alcohol consumption is expected to grow by 25% over the next 5 years. 'Pinking' of the alcohol market, combined with sustained messages from the movies and TV, that alcohol is the best way for women to relax and reward themselves, is all adding up to this rise.\n\nSo……\n\nHere’s the list of companies whose latest quarter’s profit margins were higher than their 8 quarter’s average:\n\nAssociated Alcohols and Breweries Ltd. Globus Spirits & Bottling Ltd. United Spirits Ltd. United Breweries Ltd.\n\nAssociated Alcohols and Breweries Ltd.30.99% United Breweries Ltd.28.46% United Spirits Ltd.21.17%\n\nAssociated Alcohols and Breweries Ltd.44.37% United Breweries Ltd.24.72% United Spirits Ltd.151.11%\n\nOut of the above companies, below are the ones with good ROCE as well:Weekly Trading Volumes saw spike in these stocks for last 9 months:", "description": "Shares Analysis by Jamnadas Virji Advisory covering: . Read Jamnadas Virji Advisory's latest article on Investing.com India.", "authors": [], "top_image": "https://in.investing.com/analysis/not found", "published_at": "2019-10-03"}