{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7561875/Molly-Mae-Hague-Tommy-Fury-cosy-display-Amber-Gills-clothing-line-launch.html", "downloaded_at": "2019-10-11 13:18:51.049724+00:00", "title": "Molly-Mae Hague and Tommy Fury put on a cosy display at Amber Gill's clothing line launch", "language": "en", "text": "Their relationship has been going from strength to strength since they struck up a romance on this year's series of Love Island.\n\nAnd Molly-Mae Hague and Tommy Fury looked every inch the happy couple as they attended the Amber Gill X MissPap launch party in London on Thursday.\n\nMolly-Mae, 20, looked stunning for the event, donning a white blazer with matching trousers while she added height to her frame with a pair of nude heels.\n\nEvent: Molly-Mae Hague, 20, and Tommy Fury, 20, looked every inch the happy couple as they attended the Amber Gill X MissPap launch party in London on Thursday\n\nThe reality star also carried a white handbag and added a touch of glamour with a shimmering gold necklace.\n\nStyling her platinum blonde locks into a ponytail, Molly-Mae looked in high spirits as she held hands with her beau at the event.\n\nTommy, 20, looked dapper in a crisp white shirt which he paired with black trousers along with matching shoes and belt.\n\nThe couple's outing comes after Molly-Mae recently explained to fans via her vlog that she was 'struggling with the mounting pressures of fame' and 'was running on no sleep.'\n\nStyle: Molly-Mae looked stunning for the event, donning a white blazer with matching trousers while she added height to her frame with a pair of nude heels\n\nShe told her followers during a PrettyLittleThing photoshoot: 'Everything gets on top of you after a few weeks of go, go, go. I think last night hit me a little bit but I'm OK. I'm alive and well.\n\n'I'm nervous. I guess because [the shoot] it's all about me. It's a lot of pressure. All I know is it's going to be a very full on, busy day, wish me luck.'\n\nSince leaving the Love Island villa this summer, Molly-Mae has quickly lined her pockets both with her fashion deal and a newly-announced partnership with hair product brand Beauty Works.\n\nAnd before entering the show, which helped propel her Instagram follower count well beyond 3 million, Molly-Mae made a name for herself reviewing beauty and fashion products herself.\n\nFashion: The reality star also carried a white handbag and added a touch of glamour with a shimmering gold necklace\n\nEnsemble: Styling her platinum blonde locks into a ponytail, Molly-Mae looked in high spirits as she held hands with her beau at the event\n\nMeanwhile, Tommy left some fans disappointed after he allegedly refused to travel to Plymouth for a PA event earlier this month because he didn't 'want to make the journey down.'\n\nThe boxer was meant to be appearing at the Fever & Boutique club in the port city but cancelled last minute.\n\nAnnouncing the bad news on Facebook, the club wrote: 'Tommy’s management company confirmed on Wednesday that he would be making an appearance tonight but earlier today he decided that he doesn’t want to make the journey down to Plymouth.\n\nSuave: Tommy looked dapper in a crisp white shirt which he paired with black trousers along with matching shoes and belt\n\n'We are absolutely gutted and we've been frantically trying to sort a replacement out and our friend Sam Bird has kindly offered to step in with a DJ set and PA to keep the party going!\n\n'We are so sorry to let everyone down and even though it is completely out of our control we will be offering all ticket holders a free drink tonight & for those wanting to come down and see Sam tonight we still have tickets available on the door.'\n\nOn the night, the boxer was seen with Molly-Mae Hague at Shocktober Fest in Crawley, where they enjoyed a number of theme park rides.\n\nMailOnline contacted Tommy's representatives for comment at the time.", "description": "The reality stars looked every inch the happy couple as they attended the Amber Gill X Misspap launch party in London on Thursday.", "authors": ["Sean O'Grady For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/08/19576256-0-image-a-9_1570778462647.jpg", "published_at": "2019-10-11"}