{"pub": "axios", "url": "https://axios.com/huawei-china-us-sanctions-trump-tariffs-5g-98bc2ee3-e8ab-481a-a801-eec72c14e9b8.html", "downloaded_at": "2019-10-17 01:49:41.558179+00:00", "title": "How China's Huawei is weathering U.S. sanctions", "language": "en", "text": "Driving the news: Huawei took the unusual step of releasing aggregate results for the first half of the year, rather than detailing second quarter performance. But since the company touted 39% growth in the first quarter, it's clear that its business took a substantial hit in the second quarter.\n\nEven Huawei officials acknowledge growth won't be what it had anticipated. The company previously was targeting $130 billion in revenue this year, but now expects it to be closer to last year's $105 billion.\n\nDetails:\n\nPhones and tablets: Huawei's device business is clearly being hurt by consumer concerns over whether its phones will continue to have access to the latest versions of Android and Google services. PC sales have also been affected, as those devices rely on software from Microsoft and Intel (or Intel-compatible) processors. Huawei has been developing its own operating system, but details remain scant.\n\nHuawei's device business is clearly being hurt by consumer concerns over whether its phones will continue to have access to the latest versions of Android and Google services. PC sales have also been affected, as those devices rely on software from Microsoft and Intel (or Intel-compatible) processors. Huawei has been developing its own operating system, but details remain scant. Cellular network equipment: Huawei touts its continued business in 5G and says no customers with signed deals have cancelled, although the U.S. has been applying pressure on allies to avoid using Huawei.\n\nHuawei touts its continued business in 5G and says no customers with signed deals have cancelled, although the U.S. has been applying pressure on allies to avoid using Huawei. Corporate networking: This area has been more strongly hit, Huawei acknowledges, due to limitations on server products from Intel and other suppliers.\n\nWhat's next: Huawei is preparing for a tough couple of years as it figures out what, if any, U.S. components it can count on and makes alternate plans as necessary.\n\nThe next 2 years will \"probably be the most challenging time,\" Huawei SVP of public affairs Joy Tan tells Axios.\n\n\"We just need to figure out how we can patch some of the holes in the supply chain,\" Tan adds.\n\nYes, but: Huawei is quick to point out the impact the ban is having on the U.S. companies that supply it with goods.\n\nThat's everyone from Microsoft and Google to chipmakers Intel, Qualcomm and Texas Instruments. They also include smaller tech suppliers like NeoPhotonics, which has recently counted on Huawei for half its revenue.\n\nIn all, Huawei says it purchases $11 billion worth of U.S. goods and services and is responsible for 40,000 to 50,000 jobs, citing calculations from the Economic Policy Institute.\n\nAnd then there's the cost to carriers of keeping low-priced Huawei products off the U.S. market. Huawei maintains that adds 15% to the cost of network equipment here.\n\nBetween the lines: One thing both Huawei and its critics seem to agree on, at least publicly, is that it would be better if the U.S. focused on its national security concerns with Huawei rather than sweeping the firm up in the larger trade conflict.\n\n\"Huawei did not ask to be included in the trade discussion,\" Tan says. \"Huawei does not want to be a bargaining chip.\"\n\nOur thought bubble: That might be Huawei's public position, but the company's best chance to avoid tight restrictions is likely to be through a broad trade settlement.\n\nGo deeper: Apple's global smartphone sales take 3rd place", "description": "The Chinese tech giant is feeling the effects.", "authors": [], "top_image": "https://images.axios.com/ayrPqt8RiOwZaELMlfEcVcuWwnA=/0x0:1190x669/1920x1080/2019/08/07/1565185496421.png", "published_at": "2019-08-07"}