{"pub": "reuters", "url": "https://in.reuters.com/article/britain-banksy/banksy-takes-aim-at-british-life-in-suburban-homewares-shop-idINKBN1WH11V", "downloaded_at": "2019-10-02 12:51:39.625410+00:00", "published_at": "2019-10-02", "title": "Banksy takes aim at British life in suburban 'homewares' shop", "language": "en", "text": "LONDON (Reuters) - Banksy has set up a “homewares” store in a south London suburb, displaying politically-provocative pieces such as the Union Jack stab-proof vest he designed for British rapper Stormzy.\n\nThe anonymous British street artist from the western English city of Bristol opened “Gross Domestic Product” in Croydon, saying it was “where art irritates life”.\n\nBut the shop will not be open to the public and all sales will be undertaken online, Banksy said in an Instagram post.\n\n“We hope to offer something for everyone, prices start from £10 but availability will be limited - all of these products are hand made in the UK using existing or recycled materials wherever possible,” he wrote.\n\nThe shop had come about as a greeting cards company had been trying to seize custody of the name Banksy and the artist said he had been advised the best way to prevent this was to sell his own range of branded merchandise.\n\nAs well as the vest designed for Stormzy’s history-making performance at this year’s Glastonbury music festival, items include a ‘Tony the Tiger’ rug, showing the cartoon character used to advertise sugar-coated cereal with decayed teeth.\n\nA sign says it is designed to be a “conversation piece - especially if the conversation centers around the UK spending over 7.8 million pounds a year on tooth extractions for the under 5’s”.\n\nOnlooker Neil Banks said he’d been following Banksy for years. “It’s super cool to bring it to an area where you wouldn’t expect it and I think it still belongs on the streets really, on the walls, but it’s great to see that,” he said.\n\nOther installations include a ‘Met Ball’ home entertainment lighting system made from a mirrored police riot helmet and a ‘Baby Mobile’, a crib flanked by security cameras, designed to “prepare your baby for a lifetime of constant scrutiny both state sanctioned and self imposed”.", "description": "Banksy has set up a \"homewares\" store in a south London suburb, displaying politically-provocative pieces such as the Union Jack stab-proof vest he designed for British rapper Stormzy.", "authors": ["Polly Rider", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191002&t=2&i=1436210612&w=1200&r=LYNXMPEF910SX"}