{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7626657/Hollywood-filmmakers-actors-join-Judd-Apatow-blasting-Netflix-chipmunk-mode-speeds.html", "downloaded_at": "2019-10-30 00:15:51.318647+00:00", "title": "Hollywood filmmakers and actors join Judd Apatow in blasting Netflix over 'chipmunk mode' speeds", "language": "en", "text": "Hollywood heavyweights are weighing in on Netflix's testing of a new feature that allows viewers to speed up shows and enable them to potentially binge-watch programs faster.\n\nComedian, director and producer Judd Apatow was first to hit out at the 'chipmunk mode' feature on Twitter Monday, saying he would recruit other show creators to his cause.\n\nHis rallying worked and by Tuesday, the news had caught the attention of Breaking Bad actor Aaron Paul, actress Patricia Arquette, director Peter Ramsey and several others who expressed their disdain for the plan.\n\nComedian, director and producer Judd Apatow (pictured) wants Netflix to put the brakes on a new feature that allows viewers to speed up playback on programming, enabling them to potentially binge-watch shows at a faster rate.\n\nApatow, producer of the Netflix romantic comedy series Love, and who appears in his own standup on the streaming network, flatly said 'no' to the 'variable playback speed' feature in a tweet he made Monday\n\nBreaking Bad actor Aaron Paul told Netflix to 'stop' in a tweet, while actress Patricia Arquette plainly said 'oh hell no'\n\nBreaking Bad film El Camino is featured on Netflix and its star Aaron Paul is not happy about the feature\n\nActress Patricia Arquette plainly said 'oh hell no' in response to the 'chipmunk mode' feature\n\nOne Twitter user joked about the future of streaming if Netflix enables 'Chipmunk Mode' for faster bingeing\n\nNetflix is selectively trying out the feature on Android mobile phones, allowing users to speed through episodes of programming, or films and documentaries on the site by 1.25 and 1.5 times, reports Android Police.\n\nAs binge-watchers of streaming media are hard-pressed to keep up with the latest shows, the feature would allow for the consumption of more media, and in less time.\n\nApatow, producer of the Netflix romantic comedy series Love, and who appears in his own standup on the streaming network, flatly said 'no' to the 'variable playback speed' feature, which already is available on rival sites, including YouTube.\n\n'No @Netflix no', Apatow tweeted on Monday. 'Don't make me have to call every director and show creator on Earth to fight you on this. Save me the time', he threatened. 'I will win but it will take a ton of time'.\n\n'Don't f**k with our timing', Apatow added bluntly.\n\nBreaking Bad star Aaron Paul plainly told Netflix to 'Stop' in a tweet.\n\n'There is NO WAY @Netflix will move forward with this. That would mean they are completely taking control of everyone else's art and destroying it. Netflix is far better than that. Am I right Netflix?' Paul wrote.\n\nSpider-Man: Into the SpiderVerse director Peter Ramsey tweeted: 'Does everything have to be designed for the laziest and most tasteless?'\n\nAnt-Man director Peyton Reed said: 'This is a terrible idea, and I and every director I know will fight against it.'\n\nAnd actress Patricia Arquette simply stated: 'Oh hell no'.\n\nThe Netflix feature includes a screenshot of the variable speeds set at 1.25 and 1.50 times faster, as well as 0.25 and 0.50 times slower\n\nAnt-Man director Peyton Reed tweeted: 'This is a terrible idea, and I and every director I know will fight against it.'\n\nDirector Brad Bird behind The Incredibles and Mission: Impossible: Ghost Protocol tweeted his disdain for the feature\n\nSpider-Man: Into the SpiderVerse director Peter Ramsey tweeted: 'Does everything have to be designed for the laziest and most tasteless?'\n\n300 actor Neil Napier joked about the future of Hollywood films\n\nDirector Brad Bird, behind The Incredibles and Mission: Impossible: Ghost Protocol, tweeted it was 'another spectacularly bad idea and another cut to the already bleeding-out cinema experience.\n\n'Why support and finance filmmakers visions on one hand and then work to destroy the presentation of those films on the other???' he added.\n\nIf the feature is made available to all Netflix subscribers, it means they will be able to speed through popular programs, including Breaking Bad, House of Cards, Stranger Things, Orange is the New Black, Bojack Horseman and its new show, The Politician.\n\nApatow's tweet reminds Netflix why he wants such a feature stopped.\n\n'We give you nice things', he writes. 'Leave them as they were intended to be seen'.\n\nIf the feature is made available to all Netflix subscribers, it means they will be able to speed through popular programs, including 'Breaking Bad', 'House of Cards', 'Stranger Things', 'Orange is the New Black', 'Bojack Horseman' and its new show, 'The Politician'\n\nNetflix wouldn't be the first site to give viewers the option to change speeds of the videos they watch.\n\nUsers on YouTube have been able for years to accelerate a broadcast, including its audio, by increments of 25 per cent to 100 per cent.\n\nAndroid Police's report on the Netflix feature includes a screenshot of the variable speeds set at 1.25 and 1.50 times faster, as well as 0.25 and 0.50 times slower, during a streaming broadcast of 'The Standups', a series directed by comedian Troy Miller, featuring standup comics.\n\nNetflix confirmed it was testing the new feature.\n\n'We're always experimenting with new ways to help members use Netflix', said the streaming service in a statement to Android Police. 'This test makes it possible to vary the speed at which people watch shows on their mobiles'.\n\n'As with any test, it may not become a permanent feature on Netflix', the site added.", "description": "Breaking Bad actor Aaron Paul told Netflix to 'stop' in a tweet, while other Hollywood filmmakers expressed their disdain for Netflix's new 'chipmunk mode' feature.", "authors": ["Kayla Brantley", "Ralph R. Ortega For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/16/20336430-0-image-a-34_1572367492905.jpg", "published_at": "2019-10-29"}