{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/01/hong-kong-protesters-rain-on-chinas-anniversary-parade", "downloaded_at": "2019-10-02 12:48:59.863892+00:00", "published_at": "2019-10-01", "title": "Hong Kong protesters rain on China’s anniversary parade", "language": "en", "text": "October 1 was meant to be a carefully choreographed showcase of China’s military and economic might on the 70th anniversary of communist rule, and a celebration of the strongman president, Xi Jinping.\n\nBut after a picture-perfect parade was beamed around the world from Beijing, the one part of the country that is not under his full control ripped up the playbook, with the people of Hong Kong pouring on to the streets to challenge Xi’s vision for China.\n\nBy mid-afternoon in Hong Kong an 18-year-old student had been shot point blank in the chest by a policeman, swathes of the city were engulfed in violent chaos and Beijing’s militaristic anniversary celebrations had been swept from international headlines.\n\n“This was meant to be such a celebration but it’s really a PR disaster,” said Louisa Lim, a senior lecturer at the University of Melbourne and author of The People’s Republic of Amnesia, a book about the 1989 protests against the Chinese government.\n\nTimeline People's Republic of China at 70 Show Hide After more than 20 years of civil war, Mao Zedong leads the communists to victory over the nationalists, and proclaims the founding of the People's Republic of China on 1 October. China launches a five-year economic plan, the \"Great Leap Forward\", collectivising farming and investing in heavy industry. The plan is abandoned after two years after poor harvests lead to starvation and millions of deaths. The 10-year \"Cultural Revolution\" causes economic and political upheaval, as Mao attempts to purge communist China of remaining capitalist and traditional elements of society, and enforce Maoism as the dominant and permanent ideology. Chairman Mao dies. China's \"one-child policy\" is introduced to curb population growth. Troops fire on protesters in Tianaman Square who had been campaigning for greater freedom and democracy. The uprising is crushed. The opening of the Shanghai and Shenzhen stock exchanges symbolise the increasing economic liberalisation of China. Control of Hong Kong is handed back to China from the UK. Two years later Portugal transfers the sovereignty of Macau back to the Chinese. China joins the World Trade Organization. Yang Liwei becomes the first Chinese astronaut. Within 10 years the country will successfully deploy a robot rover on the moon. After years of tension, including riots over how Japanese schoolbooks are accused of portraying the events of the second world war, and tensions over territorial claims in the South China Sea, Wen Jiabao becomes the first Chinese prime minister to address Japan's parliament. Beijing hosts the Summer Olympic and Paralympic Games. China overtakes Germany as the world's biggest exporter of goods. The following year it becomes the world's second-largest economy, over-taking Japan. The Chinese economic \"miracle\" falters, as growth falls to its lowest level for 25 years. China becomes increasingly embroiled in a trade war with the US. A series of major pro-democracy protests in Hong Kong challenge Chinese rule there. The country's human rights record also comes under scrutiny for its treatment of the Uighurs, with claims that more than 1 million of them have been detained in camps the Chinese have euphemistically called “vocational education centres”.\n\nShe pointed out that as the streets of Hong Kong filled with teargas, water cannon and smoke and flames from the fires lit by protesters, senior leaders in Beijing were filing into a gala dinner. Among them was Carrie Lam, the chief executive of Hong Kong.\n\n“It makes China’s leaders look so heartless, watching violinists and fireworks and here the people of Hong Kong are demonstrating for their lives, and a kid is in hospital,” said Lim. “It really is a split screen.”\n\nIndividually the teachers, logistics workers, retirees, students and others who came out to demonstrate have very little power beyond the right to protest; under Hong Kong law they cannot even choose their own leader in elections.\n\nBut together they represent perhaps the biggest challenge yet to Xi, risking injury and arrest to denounce his “China dream” as a sham, expose the fragility of his claim to national unity, and fight for a different future.\n\nQuick guide What are the five demands of the Hong Kong protesters? Show Hide The complete withdrawal of the proposed extradition bill Hong Kong’s leader, Carrie Lam, has said her government will formally withdraw the bill that ignited months of protests. Hong Kong residents had feared it could be used by China to extradite people for political reasons. They want guarantees that it cannot be reintroduced at a later date. Withdrawal of the use of the word 'riot' in relation to the protests Protesters want the government to officially recognise that their movement has been a series of legitimate protests, rather than a riot, as has been stated in official communications. Unconditional release of arrested protesters and charges against them dropped Hundreds of people have been arrested in recent weeks, and the protesters are demanding that all of them be freed, and that no convictions should stand against any of them. An independent inquiry into police behaviour Police use of force has escalated since the demonstrations began, while protesters have also resorted to increasingly violent measures. Demonstrators say an inquiry into police brutality is the number-one priority. Implementation of genuine universal suffrage Hong Kong's chief executive is currently selected by a 1,200-member committee, and nearly half of the 70 legislative council seats are filled by limited electorates representing different sectors of the economy. The protesters want to be able to vote for their leaders in free and open democratic elections. Photograph: Anushree Fadnavis/X06783\n\nChina’s approach to National Day celebrations in Beijing and Hong Kong underscored how hampered the leadership is in its approach to tackling a popular uprising.\n\nThe party has years of practice at central planning, propaganda messaging and bruising political control, and almost no experience responding to popular pressure.\n\nThat meant details of the triumphant parade through Beijing were so meticulously planned that residents along the route were forced to move out and guidelines painted on to the road to ensure each inch driven by Xi’s limousine would be in perfect formation.\n\nYet faced with a surge of popular protest in Hong Kong, the Communist party appears helpless. Here the government can’t easily control messaging, use force to crush its opponents or the legal system to round them up, and officials seem unable or unwilling to come up with alternatives.\n\n“The problem is that their playbook isn’t really equipped for a population like Hong Kong’s, and yet still they keep going with it, even as the situation gets more acute,” Lim said.\n\n“It shows the limits of the strategy used towards Hong Kong. It seems the authorities believe brute force and intimidation would work, but if you look at the sheer numbers that came out today, even though the protests were not authorised, people are not intimidated.”", "description": "Beijing’s carefully planned celebrations turned into a PR disaster for Xi Jinping", "authors": ["Emma Graham-Harrison", "Simon Tisdall"], "top_image": "https://i.guim.co.uk/img/media/930137082f9f17ad9853eae1fec6e9da976605f2/0_40_5461_3277/master/5461.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6e0565515913831dd715687c53fca056"}