{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/elections/2019/09/27/democratic-debate-who-made-october-debate-stage/3790609002", "downloaded_at": "2019-10-06 13:12:14.203661+00:00", "title": "12 candidates, one night: Here's who has made the October debate", "language": "en", "text": "CLOSE Thursday night's Democratic presidential debate in Houston, Texas made clear that there are three main candidates leading the field, Joe Biden, Elizabeth Warren and Bernie Sanders, according to AP Washington Bureau Chief Julie Pace. (Sept. 13) AP, AP\n\nWASHINGTON — The Democratic National Committee plans to hold the October presidential debate over just one night, setting up a stage packed with 12 candidates for the first time this year.\n\n“Pending a final decision after the certification deadline, it is the intention of the DNC and our media partners to hold the October debate over one night on Tuesday, Oct. 15,” party officials wrote in an email Friday.\n\nCNN and The New York Times will be hosting the debate, which will air live at 8 p.m. ET from the campus of Otterbein University in Westerville, Ohio.\n\nThe following candidates will appear on stage together:\n\nFormer Vice President Joe Biden\n\nSen. Cory Booker of New Jersey\n\nSouth Bend, Indiana, Mayor Pete Buttigieg\n\nFormer HUD Secretary Julián Castro\n\nRep. Tulsi Gabbard of Hawaii\n\nSen. Kamala Harris of California\n\nSen. Amy Klobuchar of Minnesota\n\nFormer Rep. Beto O'Rourke of Texas\n\nSen. Bernie Sanders of Vermont\n\nTom Steyer, billionaire and activist\n\nSen. Elizabeth Warren of Massachusetts\n\nAndrew Yang, entrepreneur\n\nOther candidates have until Oct. 1 to qualify, but it appears unlikely any others will meet the qualifications of receiving 2 percent support in four DNC-approved polls and donations from 130,000 unique donors.\n\nGabbard and Steyer are additions to this stage from the September debate, where only 10 candidates faced off.\n\nDespite Gabbard qualifying, she criticized the DNC over it’s debate criteria Friday, saying that “there’s been a lack of transparency in that whole process about which polls are selected, which aren’t, which they’re seeing as qualifying, which ones are actually polling.”\n\nThe DNC recently released more difficult requirements candidates must meet to qualify for the November debates, setting up the possibility that several additional candidates may miss the stage compared to the upcoming October matchup, and potentially ending some campaigns.\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/elections/2019/09/27/democratic-debate-who-made-october-debate-stage/3790609002/", "description": "Rep. Tulsi Gabbard and billionaire Tom Steyer are additions to this stage from the September debate, where only 10 candidates faced off.", "authors": ["Savannah Behrmann", "Published P.M. Et Sept."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/13/USAT/2595273a-daa0-4924-8396-bfa1d945ce04-AP_Election_2020_Debate_2.JPG?crop=4684,2635,x0,y91&width=3200&height=1680&fit=bounds", "published_at": "2019-09-27"}