{"pub": "cnbc", "url": "https://cnbc.com/2019/10/08/ex-microsoft-ceo-steve-ballmer-plenty-of-profit-in-hardware.html", "downloaded_at": "2019-10-09 00:28:57.752831+00:00", "title": "Former Microsoft CEO Steve Ballmer on Surface: 'There's plenty of profit in hardware'", "language": "en", "text": "Steve Ballmer, chairman of the Los Angeles Clippers and co-founder of Ballmer Group, speaks during the GeekWire Summit in Seattle on Oct. 8, 2019.\n\nApple sells more computers than Microsoft. Nevertheless, Steve Ballmer thinks Microsoft, with its ever-expanding line of hardware, is on the right track.\n\nMicrosoft regained the title of world's most valuable company from Apple last year and has generally held onto it. The company has seen gains from its public cloud and the transition of its Office business to a subscription model. Hardware have drawn less attention, but growth has returned to Microsoft's Surface of tablets, laptops and other gadgets.\n\n\"Despite the rhetoric, there's actually plenty of profit in hardware, at least if you look at the number one hardware company in the world,\" Ballmer, owner of the Los Angeles Clippers, told GeekWire Co-Founder Todd Bishop on Tuesday at the 2019 GeekWire Summit conference in Seattle. \"There's a lot of profit being made on the Mac and the iPhone and others. I think Microsoft gets a chance to participate through the Surface.\"\n\nBallmer was involved in the 2012 introduction of the Surface tablet, which forms the core of the Surface lineup. Surface generated about $5.7 billion in revenue in the 2019 fiscal year, up 23% from the previous fiscal year.\n\nBallmer said Microsoft's overall hardware operation, which totaled $6.1 billion in the 2019 fiscal year, is still growing into a big business. Microsoft does not disclose hardware or Surface profits.\n\nLast week Microsoft unveiled an array of new Surface devices, including the new Surface Earbuds and two products due next year, the Surface Neo two-screened PC and Android-based Surface Duo.\n\n\"The new Surface lineup is amazing! Amazing! In the category of competitiveness, go, Microsoft, go!\" Ballmer said.\n\nBeyond his involvement with Surface, Ballmer was the person in charge when Microsoft announced its Azure cloud offering in 2008.\n\n\"The cloud thing, I think, has worked out well,\" Ballmer said.\n\nAnd although Nadella was quoted as saying last week that \"the operating system is no longer the most important layer for us,\" Ballmer said Windows remains a crucial sort of profit, building on previous remarks about the subject.\n\n\"Windows makes billions and billions and billions per year. At least this investor wants to see that profit stream stay around for a very, very long time,\" Ballmer said. \"There aren't a lot of new profit streams you can invent that generate the kind of profit that Windows does.\" Windows revenue grew less than 5% in the 2019 fiscal year.\n\nBallmer said he remains a Microsoft investor. He was replaced by Satya Nadella as the company's CEO and left its board in 2014.\n\nWATCH: Fmr. Microsoft CEO: There are real issues in tech right now", "description": "Ballmer said Microsoft's overall hardware operation, which totaled $6.1 billion in the 2019 fiscal year, is still growing into a big business.", "authors": ["Jordan Novet"], "top_image": "https://image.cnbcfm.com/api/v1/image/106170547-1570555810297gettyimages-1174510241.jpeg?v=1570555896", "published_at": "2019-10-08"}