{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/kylie-jenner-files-restraining-order-against-stalker-fan-who-showed-up-at-her-home-11014716", "downloaded_at": "2019-10-30 23:24:22.313470+00:00", "title": "Kylie Jenner 'files restraining order' against stalker fan", "language": "en", "text": "The man reportedly showed up at Kylie’s home (Picture: Rex)\n\nKylie Jenner has reportedly filed a restraining order against a man who showed up at her home and demanded to see her.\n\nThe guy in question was said to have visited the makeup mogul’s home on 29 October, walking up to her driveway and aggressively knocking at the door, according to documents obtained by TMZ.\n\nThe documents, which were filed by Kylie’s lawyer Shawn Chapman Holley, also state that the man claimed he was there to see her, before a security guard escorted him off the property. The man was subsequently arrested.\n\nA security guard later filed legal documents stating that the man was behaving erratically, and was still able to find his way onto the property and get to Kylie’s front door, despite the fact that she lives in a gated community.\n\nAlthough Kylie was not at home during the incident, she is reportedly ‘scared’ for the safety of herself and her daughter, one-year-old Stormi, and is worried that the guy will continue to stalk her and try and visit her home again in the future.\n\nAdvertisement\n\nAdvertisement\n\nThe man has since been ordered to stay 100 yards away from Kylie herself as well as her home and car.\n\nIt comes after model Blac Chyna has also found herself involved in a lawsuit with the Kardashian family, over her axed TV series Rob & Chyna.\n\nBlac Chyna has also found herself involved in a lawsuit with the Kardashian family (Picture: STARMAX/Backgrid)\n\nIn legal documents filed by Chyna, she claimed the Keeping Up With The Kardashians stars were behind the decision for her show to be cancelled by network E!, although they strongly deny this.\n\nThe case is set to be taken to court next year.\n\nReps for Kylie declined to comment when approached by Metro.co.uk.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Strictly’s Craig Revel Horwood mercilessly trolls Bruno Tonioli over shirtless selfies\n\nMORE: Melanie Griffith, 62, is feeling herself as she takes advantage of full-length mirror with lingerie selfies", "description": "Kylie Jenner has reportedly filed a restraining order against a stalker man who appeared at her home, demanding to see her.", "authors": ["Isla Williams"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_91771059-e1572465655360_1572467180.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}