{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-dominos-piza-grp-outlook/dominos-pizza-to-exit-four-international-markets-idUKKBN1WW0L7", "downloaded_at": "2019-10-17 08:09:58.376262+00:00", "title": "Britain's Domino's Pizza to exit four international markets", "language": "en", "text": "FILE PHOTO: A call out mechanic fixes a Dominos delivery scooter in the Clapham district of London, Britain June 8, 2018. REUTERS/Simon Dawson/File Photo\n\n(Reuters) - Domino’s Pizza Group Plc (DOM.L), Britain’s biggest pizza delivery company, said on Thursday it will exit its international markets, where it has been facing mounting losses.\n\n“We have concluded that, whilst they represent attractive markets, we are not the best owners of these businesses,” outgoing Chief Executive Officer David Wild said.\n\nThe company, which is a franchise of U.S.-based Domino’s Pizza Inc (DPZ.N), said third-quarter group system sales rose 3.4% to 313.5 million pounds ($400.15 million) on strong demand in the UK and Ireland.\n\nThe British company owns Domino’s operations in Switzerland, Iceland, Norway and Sweden, and is a minority shareholder in the Germany operations as well.\n\nHowever, it reported a 2.7% dip in international system sales, which have taken a hit from macroeconomic events, including declining tourist numbers in Iceland.\n\nEurope’s economy has slowed this year as the U.S.-China trade tensions weakened global growth, and consumers and businesses in and around the United Kingdom worried about the impact of Brexit on jobs and incomes.\n\nThe company, which has 57 stores in Norway, said it had implemented a turnaround plan in the country during the quarter, but early signs have been mixed and improvement in sales were weaker than expected.\n\nThe decision to exit these markets comes a few months after the company announced the retirement of its CEO Wild, while in the midst of trying to resolve a profit sharing row with disgruntled franchisees in the UK and Ireland.", "description": "Domino's Pizza Group Plc , Britain's biggest pizza delivery company, said on Thursday it will exit its international markets, where it has been facing mounting losses.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191017&t=2&i=1441774234&w=1200&r=LYNXMPEF9G0H9", "published_at": "2019-10-17"}