{"pub": "independent", "url": "https://independent.co.uk/sport/football/international/cristiano-ronaldo-portugal-vs-lithuania-worlds-best-player-fernando-santos-a9100401.html", "downloaded_at": "2019-09-11 14:03:43.365481+00:00", "title": "Lithuania vs Portugal: Cristiano Ronaldo offers ‘clear and irrevocable proof’ that he is world’s best player, says coach Fernando Santos", "language": "en", "text": "Portugal head coach Fernando Santos has said that Cristiano Ronaldo‘s four goal showing against Lithuania offers “clear and irrevocable proof” that the Juventus forward is the best player in the world.\n\nRonaldo scored his eighth international hat-trick in Vilnius, in the process becoming the all-time leading scorer in European Championship qualifying with 25.\n\nThe four goals take his overall tally to 93, just 16 behind men’s international record scorer Ali Daei of Iran.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“This is the clear and irrevocable proof that he is the best player in the world,” Santos said after his side’s victory.\n\n“There is no stadium in the world where Ronaldo is not applauded. He is the best in the world.”\n\nShape Created with Sketch. International XI Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. International XI 1/11 Jan Oblak Slovenia Getty 2/11 Joshua Kimmich Germany Getty 3/11 Kalidou Koulibaly Senegal 4/11 Virgil van Dijk Netherlands 5/11 Andrew Robertson Scotland Action Images via Reuters 6/11 N'Golo Kante France PA 7/11 Kevin De Bruyne Belgium EPA 8/11 Luka Modric Croatia AFP/Getty 9/11 Moahamed Salah Egypt Liverpool FC via Getty Images 10/11 Lionel Messi Argentina Getty 11/11 Cristiano Ronaldo Portugal Getty Images 1/11 Jan Oblak Slovenia Getty 2/11 Joshua Kimmich Germany Getty 3/11 Kalidou Koulibaly Senegal 4/11 Virgil van Dijk Netherlands 5/11 Andrew Robertson Scotland Action Images via Reuters 6/11 N'Golo Kante France PA 7/11 Kevin De Bruyne Belgium EPA 8/11 Luka Modric Croatia AFP/Getty 9/11 Moahamed Salah Egypt Liverpool FC via Getty Images 10/11 Lionel Messi Argentina Getty 11/11 Cristiano Ronaldo Portugal Getty Images\n\n“We went to Paris in my first game, and the hotel in France was just across the street. There were a thousand people at our door.”\n\nThe Juventus striker opened the scoring from the penalty spot inside ten minutes, before Lithuania equalised midway through the first half.\n\nBut Ronaldo added three in 15 second half minutes, and a stoppage time goal from William Carvalho completed a 5-1 victory.\n\nPortugal are second in Group B, five points behind leaders Ukraine, though Santos’ side have a game in hand.\n\nAnd Santos believes his star man is far from finished.\n\n“I think it’s strange when he doesn’t score. They say it is ending ... Nothing is ending. You have to be careful because it never ends.”", "description": "Portugal head coach Fernando Santos has said that Cristiano Ronaldo‘s four goal showing against Lithuania offers “clear and irrevocable proof” that the Juventus forward is the best player in the world. Ronaldo scored his eighth international hat-trick in Vilnius, in the process becoming the all-time leading scorer in European Championship qualifying with 25.", "authors": ["Harry Latham-Coyle"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/11/10/Cristiano-Ronaldo.jpg", "published_at": "2019-09-11"}