{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/us-singles-out-iran-readies-response-to-saudi-oil-attacks", "downloaded_at": "2019-09-16 23:19:25.638500+00:00", "title": "US singles out Iran, readies response to Saudi oil attacks", "language": "en", "text": "The United States readied its response on Monday to the \"unprecedented\" attack on Saudi oil facilities as President Donald Trump said Iran was likely to blame, fanning new fears of conflict in the Gulf region.\n\n[WASHINGTON] The United States readied its response on Monday to the \"unprecedented\" attack on Saudi oil facilities as President Donald Trump said Iran was likely to blame, fanning new fears of conflict in the Gulf region.\n\nMr Trump said he was ready to help key ally Saudi Arabia counter the weekend drone attacks, which triggered a record leap in global oil prices, but would await a \"definitive\" determination on who was responsible.\n\n\"We have a lot of options,\" the US leader told reporters, saying there was no rush to react and that talks with allies would come first.\n\n\"I'm not looking to get into new conflict, but sometimes you have to,\" he said. \"That was a very large attack, and it could be met by an attack many, many times larger.\"\n\nsentifi.com Market voices on:\n\nAfter meeting with Trump, US Secretary of Defense Mike Esper also singled out Iran as a regional destabilising force, while stopping short of directly accusing Tehran over the strike.\n\nThe US military, he said, is working with its partners to \"address this unprecedented attack and defend the international rules-based order that is being undermined by Iran.\"\n\nORIGIN OF ATTACK STILL MURKY\n\nDetails of the Saturday strikes on Abqaiq - the world's largest oil processing facility - and the Khurais oil field in eastern Saudi Arabia remained unclear, but left crude oil output by the world's top exporter slashed in half.\n\nThe Iran-supported Huthi rebels in Yemen claimed responsibility for the attack, which likely involved, according to reports, both drones and cruise missiles that struck their targets with surprising accuracy.\n\nBut some analysts said it appeared the weapons were fired not from Yemen in the south but from other directions.\n\nIn Riyadh officials said the attack involved \"Iranian weapons,\" but likewise fell short of directly accusing their regional arch-rival.\n\n\"The Kingdom condemns this egregious crime, which threatens international peace and security, and affirms that the primary target of this attack are global energy supplies, as this attack is in line with the previous attacks against Saudi Aramco pumping stations using Iranian weapons,\" the Saudi foreign ministry said in a statement.\n\nAt a press conference in Ankara, Iranian President Hassan Rouhani said the attacks were an act of self-defense by the Huthis, against the Saudi-led forces conducting an air campaign against them since 2015.\n\n\"Yemen is the target of daily bombings... The people of Yemen have been forced to respond, they are only defending themselves,\" Mr Rouhani said.\n\nCALLS FOR RESTRAINT\n\nAfter Mr Trump's weekend statement that the US was \"locked and loaded\" to respond, Russia and China both called Monday for restraint, amid worries the situation could escalate and put a large portion of the world's energy supplies at risk.\n\n\"We oppose all actions that enlarge or intensify conflict,\" China's foreign ministry said, while the Kremlin urged \"all countries to avoid hasty steps or conclusions that could exacerbate the situation.\"\n\nSpeaking in Baghdad, Nato chief Jens Stoltenberg said he was \"extremely concerned about a risk of escalation\" and called on \"all parties to prevent any such attacks occurring again.\"\n\nBut he likewise condemned Iran for stoking violence across the Mideast.\n\n\"Iran is supporting different terrorist groups and being responsible for destabilising the whole region,\" he charged.\n\nCONGRESS WARNS AGAINST US INVOLVEMENT\n\nMr Trump meanwhile downplayed the threat to global oil markets. The London benchmark, Brent North Sea crude had its largest one-day jump ever Monday, soaring US$8.80 or 14.6 per cent to settle at US$69.02 a barrel.\n\nMr Trump said the economy could handle higher prices and that the United States was prepared to release part of its strategic oil reserve if necessary to dampen the impact.\n\nIn Congress though legislators warned about opening up a new front of conflict, while US troops remain on the ground in Syria, Iraq and Afghanistan nearly 18 years after the September 11, 2001 attacks.\n\n\"Direct engagement by US military in response to Iran's attacks on Saudi oil infrastructure would be a grave mistake,\" said Republican Senator Mitt Romney.\n\n\"The US has continued arms sales so Saudi Arabia can defend itself. If SA responds against Iran attacks, the US should be ready to support in a non-kinetic role,\" he said in a tweet.\n\n\"The United States must not launch an offensive war against Iran without congressional approval,\" said Democratic Representative Ro Khanna.\n\n\"The Huthis are NOT Iran. We can't let another deception lead to war in the Middle East,\" he said.\n\nAFP", "description": ": THE BUSINESS TIMES Government & Economy - [WASHINGTON] The United States readied its response on Monday to the \"unprecedented\" attack on Saudi oil facilities as President Donald Trump said Iran was likely to blame, fanning new fears of conflict in the Gulf region. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/09/17/nz_dt_170940_0.jpg?itok=p4lVU8m-", "published_at": "2019-09-16"}