{"pub": "japantoday", "url": "https://japantoday.com/category/national/Man-found-dead-in-overturned-car-as-typhoon-approaches", "downloaded_at": "2019-10-12 06:46:31.113903+00:00", "title": "Man found dead in overturned car as typhoon approaches eastern Japan", "language": "en", "text": "A car is overturned by strong winds in Ichihara, Chiba Prefecture, on Saturday.\n\nJapan was at its highest alert level Saturday morning as a major typhoon edged closer to the coast of central Japan and threatened to sweep through Tokyo and other eastern areas, with train operators and airlines set to suspend most services in the metropolitan area.\n\nTyphoon Hagibis, which could dump amounts of rain not seen since a deadly typhoon in 1958, is expected to make landfall on the Pacific coast of central Japan or eastern Japan on Saturday evening, the Japan Meteorological Agency said.\n\nPeople struggle with umbrellas at a crossing in Shibuya,Tokyo, on Saturday. Photo: AP/Kiichiro Sato\n\nThe projected path of the typhoon may result in further damage to areas in Chiba Prefecture near Tokyo where another powerful typhoon triggered widespread power outages in September.\n\nChiba's prefectural government said a tornado hit part of Ichihara city and destroyed a house and damaged at least nine others. Local officials said a man in his 50s was found dead in an overturned car in the city, though it was not immediately known if the tornado caused his vehicle to roll over. Five people sustained non-life-threatening injuries, according to the prefectural government.\n\nSurging waves hit against the breakwater behind fishing boats at a port in Kiho, Mie Prefecture, on Saturday. Photo: AP/Toru Hanai\n\nCentral Japan prefectures, such as Mie and Shizuoka, and Kanagawa southwest of Tokyo have issued evacuation advisories to many of their municipalities. The Tokyo metropolitan government advised residents mainly in its western suburbs to evacuate.\n\nAs of 12 p.m. Saturday, Typhoon Hagibis was traveling north-northeast at a speed of 30 kilometers per hour, some 210 km west of Hachijo Island in the Pacific. It had an atmospheric pressure of 945 hectopascals at its center and was packing winds of up to 234 kph.\n\nA street is empty in Yokohama on Saturday afternoon. Photo: REUTERS/Matthew Childs\n\nThe typhoon is forecast to bring winds of 216 kph to the Tokai region in central Japan and the Kanto-Koshin region, including the Tokyo metropolitan area, and could potentially knock over houses, the agency warned.\n\nTokyo Electric Power Company Holdings Inc said damage to a power-transmission line caused a brief power outage in wide areas of Chiba. The line has been repaired, but some 4,100 homes were still without power in the prefecture.\n\nAs of around 1 p.m., the power outage was also affecting about 6,400 other homes in the rest of the utility's service area.\n\nUp to 1,000 millimeters of rain is expected in the Tokai region, and 600 mm in the Kanto-Koshin region, in the 24-hour period through midnight Saturday, the agency said.\n\nThe transport ministry said no departures or arrivals were allowed at Tokyo's Haneda airport after 2 p.m.\n\nA passenger walks past a notice on the suspension of bullet train services at Tokyo Station on Saturday. Photo: AP/Eugene Hoshiko\n\nThere will be no shinkansen bullet train service between Tokyo and Nagoya on Saturday. Just six early-morning trains ran between Nagoya and Shin-Osaka, and operations between Shin-Osaka and Okayama are canceled from the afternoon.\n\nEast Japan Railway Co said it gradually suspended train runs in the Tokyo metropolitan area from Saturday morning and halted services around 1 p.m., including its Tohoku and Hokuriku shinkansen services.\n\nA man sleeps next to an airline counter at the domestic terminal of Tokyo's Haneda Airport, after flights were suspended Saturday due to Typhoon Hagibis. Photo: REUTERS/Kim Kyung-hoon\n\nAll Nippon Airways has canceled all domestic flights and most international flights Saturday to and from Haneda as well as Narita airport east of the capital.\n\nJapan Airlines has also canceled most of its Saturday flights.\n\nTokyo Disneyland and Tokyo DisneySea, located in a bayside area near the capital, will be closed from Saturday morning to Sunday noon, according to operator Oriental Land Co. It will be the first whole-day closure for the theme parks since 2011 when a massive earthquake and tsunami hit northeastern Japan.\n\nMany department stores in and around Tokyo including Mitsukoshi, Isetan and Seibu were closed Saturday. Their operators said they will decide later whether to open on Sunday.\n\nA man looks at a notice stating a shop is closed temporarily ahead due to the typhoone in Tokyo on Saturday. Photo: REUTERS/Kim Kyung-hoon\n\nA supermarket shelf in Tateyama, Chiba Prefecture, is almost empty Friday night after panic buying ahead of Saturday's typhoon. Photo: KYODO\n\nAmong manufacturers, Toyota Motor Corp and Honda Motor Co suspended operations at some of their plants Saturday.\n\nAccording to the weather agency, the predicted rainfall amounts would be in line with those deposited by Typhoon Ida in September 1958, which left 1,200 people dead or missing across Japan.\n\n© KYODO", "description": "Japan was at its highest alert level Saturday morning as a major typhoon edged closer to the coast of central Japan and threatened to sweep through Tokyo and other eastern areas, with train operators and airlines set to suspend most services in the metropolitan area. Typhoon Hagibis, which could dump…", "authors": ["No Business", "Chip Star", "Haaa Nemui", "Do The Hustle", "Wrath Of God", "Chris Clancy", "Wendell Arthur", "Derek Grebe"], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/df/a2/4de3db9eafe0f0a7750f99d0a62028c9c756/damage.jpg", "published_at": "2019-10-12"}