{"pub": "afr", "url": "https://afr.com/world/north-america/what-biden-learned-at-the-last-two-impeachments-20191010-p52zde", "downloaded_at": "2019-10-10 06:18:05.049816+00:00", "title": "What Biden learned at the last two impeachments", "language": "en", "text": "He urged against \"Alice-in-Wonderland\" justice: \"sentence first, verdict afterwards.\" He said that if he had to render a judgment on that day, his choice would be \"Not Guilty.\" Biden was no fan of the president's, he said — and might well find him culpable once all facts were aired. But this was a time for \"restraint.\"\n\n\"I have a feeling,\" he said, \"that my children and my grandchildren will be looking back on what I said or did not say in April of 1974.\"\n\nForty-five years later, Biden finds himself consumed by an impeachment drama of a different sort. He is at the inadvertent centre of the emerging Democratic case against President Donald Trump, who in a July phone call pressed the president of Ukraine to investigate Biden and his son. It is a testament to the long and winding arc of Biden's public life that he has been a player in every major impeachment debate of the last half-century.\n\nYet while other 2020 candidates have long argued that Trump's conduct demands an extraordinary constitutional response, Biden has approached the subject with striking wariness — quick to defend his name but disinclined to position himself as an impeachment crusader — despite the perils the president's unsubstantiated attacks may pose to Biden's own campaign.\n\nOn Wednesday, after weeks of caution — leaving the task to Congress, taking care to stay in his lane — Biden called unambiguously for Trump's impeachment for the first time, saying the president had \"betrayed this nation.\"\n\nIt was a moment that Biden reached reluctantly. Though he had said before that Trump had probably violated his \"constitutional responsibility,\" the former vice president has also called Trump's prospective impeachment \"a tragedy.\" A review of Biden's history with the topic, as a senator during the Nixon and Clinton administrations, helps explain why.\n\nDecades before he moved from ensemble figure to leading character in the nation's impeachment theatre, friends and peers from his Senate days say those episodes made plain to Biden just how damaging and unseemly the proceedings could be for all involved.\n\nAdvertisement\n\nIn both public remarks and private conversations with colleagues, Biden conveyed his discomfort with overturning the will of the voters, regardless of the executive transgression. He suggested that public opinion should be taken into consideration, even for senators who preferred to vote their conscience, since it was the choice of the electorate that lawmakers presumed to override.\n\nJudging Clinton\n\n\"This. Is. Their. President,\" he thundered at an event in November 1998 as President Bill Clinton's fortunes rested with Congress, summarizing the view of Democratic voters whom Biden said he had met. \"Don't screw with him unless you have an overwhelming case that you can make that you're being fair about it.\"\n\nAnd in an early signal of Biden's deference to formal protocol, his experiences in the 1970s and 1990s seemed to crystallize the abiding faith in institutions — deep respect for the Senate, a reverence for process — that remains his hallmark, even as his current competitors suggest he is out of step with the crackling tribalism of the Trump era.\n\n\"He stuck with kind of an institutional approach to things, which he did for his whole career,\" said Ted Kaufman, a longtime friend and aide who worked for Biden during Watergate and later succeeded him briefly as senator. \"Let the system work.\"\n\nFor a young lawmaker straining to find his way amid personal tragedy, the Nixon fracas was an early test of Biden's defer-to-convention instincts and a jarring introduction to the capital. After his election in 1972, Biden had spoken to Nixon in an uncomfortable, minute-long courtesy phone call from the president after Biden's wife and young daughter were killed in a car crash that December. (\"I understand you were on the Hill at the time, and your wife was just driving by herself,\" Nixon said, stammering for a few beats, according to a recording. \"The main part is, you can remember that she was there when you won a great victory.\")\n\nIn his floor speech on impeachment, labeled in the Congressional Record under \"Fairness to the President,\" Biden described himself as a harsh critic of Nixon, but he added that the president was due the \"utmost presumption of innocence.\"\n\nIn his 2007 memoir, \"Promises to Keep,\" Biden described a formative memory of a crucial meeting after Nixon asked Sen. John Stennis, a conservative Democrat from Mississippi, to run interference for the White House by listening to the Watergate tapes and summarizing them for his colleagues, rather than insisting on their wide release.\n\nAdvertisement\n\n\"I remember what he said in the Democratic caucus that day: 'I've thought long and hard on what my obligation is,'\" Biden wrote, quoting Stennis, \"'and I've decided I am a Senate man. I am not the president's man. Therefore, I will not listen to the tapes. I am a man of the Senate.' I'm proud to say I am a Senate man, too.\"\n\nKaufman said that it was not until August, days before Nixon's resignation, that Biden became convinced that the president must go.\n\nThe senator was walking to catch a train when word arrived that Charles Wiggins, a Republican congressman who had led the Nixon defense, had changed his mind amid revelations that Nixon had worked to conceal the Watergate break-in.\n\n\"He just said, 'OK, this is it,'\" Kaufman recalled of Biden. \"And he dictated, literally, to the staff person on what was a big deal: 'It was time for Nixon to resign.'\"\n\nA quarter-century later, when the Senate impeachment trial of Clinton began, Biden was not afforded the luxury of a presidential resignation. But with the leader of his own party under scrutiny, Biden often invoked his appeals for caution in the Nixon age as evidence that he was being intellectually consistent.\n\nBut at times, impeachment has also coaxed less subtle flourishes from Biden. In an appearance at the National Press Club in November 1998, after distinguishing between immoral and impeachable behavior, he set off on a hypothetical about Clinton and Monica Lewinsky, implying that had Lewinsky been Biden's daughter, he would have clocked the sitting president.\n\n\"Were it my daughter — notwithstanding this particular young woman is not the epitome of what I would want a young woman to be — I would be looking for the man,\" Biden said. \"Those who know me know I'm not joking. I'd be looking for him to give him a straight right.\"\n\nNotwithstanding this particular senator's fatherly dream sequence, he also reminded the crowd of his credibility on the broader question of Clinton professional fate.\n\n\"I made that plea in 1974, and I make the plea again,\" Biden said. \"The plea for restraint.\"\n\nThe New York Times", "description": "Former US vice president Joe Biden has experience of presidential impeachments - he was around for the last two.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.4474%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_16%2C$y_49/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/faee01369e46bbd5f7dc6c8ec1bd88c0455cf62f", "published_at": "2019-10-10"}