{"pub": "yahoo", "url": "https://sg.news.yahoo.com/el-chapos-son-led-dramatic-200823424.html", "downloaded_at": "2019-10-25 22:32:16.356137+00:00", "title": "El Chapo's son led dramatic rescue of his half brother in Mexico battle", "language": "en", "text": "Cartel gunmen are seen outside during clashes with federal forces following the detention of Ovidio Guzman, son of drug kingpin Joaquin \"El Chapo\" Guzman, in Culiacan\n\nBy Anthony Esposito and Ana Isabel Martinez\n\nMEXICO CITY (Reuters) - Ivan Archivaldo Guzman, the leader of Los Chapitos wing of the Sinaloa Cartel, was behind the assault on security forces that prompted the release of his half-brother from a house in the city of Culiacan last week, a top Mexican official said.\n\nThe men's father is Joaquin \"El Chapo\" Guzman, Mexico's most infamous drug kingpin, who himself slipped away from authorities on multiple occasions before being sentenced to life imprisonment in the United States this year.\n\nYounger brother Ovidio Guzman was briefly captured by Mexican security forces on Oct. 17 in an upscale neighbourhood of Culiacan, until hundreds of heavily-armed Sinaloa Cartel gunmen forced his release.\n\nThe botched raid has called into question Mexico's security strategy and put pressure on President Andres Manuel Lopez Obrador, who has insisted that the release was necessary to protect the lives of civilians and security personnel.\n\nQuestions have circulated about the role of the older Guzman brother in launching the fierce counterattack led by gunmen in armoured vehicles armed with mounted weapons that left parts of the city smoldering.\n\nLate on Thursday, Security Minister Alfonso Durazo said Ivan Archivaldo had played a key part.\n\n\"He was one of those leading the mobilization of various criminal elements in Culiacan,\" Durazo said, while denying reports that the elder brother had also been briefly captured.\n\n\"Ivan Archivaldo was not at the home that was taken over by (security) personnel who participated in this operation,\" he said.\n\nA senior security official told Reuters that Ovidio was found in the house with his partner, their two daughters, and two guards. The official asked not to be named because he was not authorized to speak to the media.\n\nThe Sinaloa Cartel, along with the Jalisco New Generation Cartel, are Mexico's largest and most powerful drug trafficking organizations.\n\nSince El Chapo left the scene, his partner Ismael \"El Mayo\" Zambada has taken on a coordinating \"godfather\" role overseeing several factions in the organization, an official at the U.S. Justice Department told Reuters.\n\nFour brothers, led by Ivan Archivaldo, form one group collectively known as Los Chapitos, or \"little Chapos.\" El Chapo's brother heads another unit, and veteran trafficker Rafael Caro-Quintero leads another, the official said. In a 2018 interview with a Mexican magazine, Caro-Quintero denied he was still a drug trafficker.\n\n\n\n\n\n(Reporting by Anthony Esposito; Additional reporting by Ana Isabel Martinez; Editing by Daniel Wallis)", "description": "Ivan Archivaldo Guzman, the leader of Los Chapitos wing of the Sinaloa Cartel, was behind the assault on security forces that prompted the release of his half-brother from a house in the city of Culiacan last week, a top Mexican official said.  The men's father is Joaquin \"El Chapo\" Guzman", "authors": ["Anthony Esposito", "Ana Isabel Martinez"], "top_image": "https://s.yimg.com/uu/api/res/1.2/0BRP27kflZ26ez4a0vjW7w--~B/aD01MzM7dz03OTk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/reuters.com/6d334e671d43f52b615440709a876724", "published_at": "2019-10-25"}