{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/how-to-access-a-lost-ipad-thats-locked-with-apples-find-my", "downloaded_at": "2019-10-28 01:33:02.987846+00:00", "title": "How Do I Access A Lost iPad That's Locked With Apple's 'Find My'?", "language": "en", "text": "Apple’s “Find My” feature can be a powerful tool for recovering lost or stolen devices. It can also be a pain in the arse if you’ve purchased or otherwise legally acquired a used device that’s still tied to another person’s account.\n\nLifehacker reader Johnathan writes:\n\nThanks for the “how to set up a locked Mac” article. My father was given a tablet that was found over a year ago. We left it with lost and found and it was given back to us after the reclaim period ended. The find my phone machine feature was not disabled of course and my father contacted apple hoping they would be able to use that feature to get the device back to its owner. He was upset that apple would not contact its owner because of “privacy” issues. He felt they were cornering the owner into buying a new device instead of contacting them that someone had found their device. It’s now just sitting in his home unused. Is there a way he can get it up and running for himself?\n\nLet’s get the bad news out of the way. If you’re staring at an Activation Lock, you’re stuck. Apple isn’t going to remove this for you, nor do you have any way to do this yourself. You would have to contact the original owner of the device—which it seems like you’re unable to do—to have them enter their Apple ID/password or passcode on the iPad, or erase and remove the iPad from their iCloud account.\n\nTo be succinct, activation lock = bad. You are now the proud owner of an expensive paperweight, not a tablet.\n\nAnd, no, booting your iPad into recovery mode and attempting to reset it by connecting it to a Mac isn’t going to help. You’ll still see the Activation Lock screen when you try to set up your iPad, because that’s tied into Apple’s Find My feature.\n\nOn the plus side, this is at least encouraging for those who own devices that have been lost and/or stolen. With Find My activated, an attacker is only going to be able to use the iPhone for parts—nothing more. That doesn’t get you your device back, I realise, but hopefully it’s at least some kind of deterrent for a potential iPhone or iPad thief.\n\nAs for Apple’s reluctance to unlock your device, disable Activation Lock, or even tell you the contact information for the device’s previous owner, that’s all to be expected. While you’re simply trying to gain access to a device that’s clearly been lost for some time—and likely forgotten—Apple has no way of verifying your story.\n\nConsider the alternative. Suppose you recently lost your iPhone and someone had picked it up, either as an innocent purchasing it from someone who stole it from you, or something they found and decided to keep (if they had no way of contacting you). Or, worse, suppose someone just stole your iPhone out of your hands.\n\nWould you want this thief to be able to hit up any ol’ Apple store and eradicate your only security measure—Find My—with a simple story? Again, I realise that most iPhone thieves nowadays are probably just selling the devices for parts (or hoping you haven’t turned Find My on), but I do think it’s at least a slight setback to some would-be attackers to know that a device they’re targeting will be little more than a brick, assuming they lack the technical know-how to disassemble it.\n\nSimilarly, I would not want a company to cough up personal information about me—my email, my phone number, or any other method to reach me—simply because someone found (or stole) my phone. While I realise that means I’m shutting the door on a potential recovery option, I feel a lot better knowing that I can just use Find My to provide that information by marking my device as lost, rather than worrying that Apple is going to give a thief even more details about me.\n\nIn a perfect world, you’d be able to report a device as lost or stolen to Apple, which could be a way to give Apple permission to provide some means to contact you if a device was taken in to an Apple Store. That’s getting a bit nitpicky, though; and, again, you can always report a device as lost yourself via Find My. Apple, rightly so, probably prefers not to get involved as much as possible, lest it find itself in some tricky grey areas over who technically owns a missing device—especially if a second person purchased a device that was previously reported as missing. Yikes.\n\nSpeaking of, this is exactly why it is critical that you verify “Find My” is turned off whenever your purchasing a secondhand iPhone or iPad. Apple could not be any clearer about this, and for good reason; if you buy a device with the activation lock still turned on, you won’t be able to do anything with it when you go to reset it and set it up with your account credentials.\n\nWhile this answer doesn’t provide you the outcome you were looking for, I hope it at least explains a bit why the iPad you found is probably useless at this point. That’s a bummer for you, but think of the bright side—you didn’t lose an expensive tablet you paid for. Rather, you simply can’t use an expensive tablet you found.", "description": "Apple’s “Find My” feature can be a powerful tool for recovering lost or stolen devices. It can also be a pain in the arse if you’ve purchased or otherwise legally acquired a used device that’s still tied to another person’s account....", "authors": ["Ronelle Welton", "Bill Nimorakiotakis", "Chris Jager"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/youxoxermzzlgce54cqg.jpg", "published_at": "2019-10-28"}