{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/modack-extortion-case-art-of-police-deception-and-infiltration-discussed-20180202", "downloaded_at": "2019-10-15 15:09:06.588334+00:00", "title": "Modack extortion case: Art of police ‘deception and infiltration’ discussed", "language": "en", "text": "Cape Town - Senior Western Cape policeman Major General Jeremy Vearey may have infiltrated the notorious numbers gangs, including the 26s and 27s, as he is adept at the \"art of deception\", a lawyer has suggested in the Cape Town Magistrate’s Court.\n\nRooshdeen Rudolph, who is representing an accused in the extortion case centred around suspected underworld kingpin Nafiz Modack, went into Vearey’s background and skills on Friday.\n\nVearey is the head of the cluster of Cape Town police stations. Officers within the Cape Town cluster arrested Modack and his co-accused.\n\nModack is accused of extortion and intimidation alongside Carl Lakay, Ashley Fields, Colin Booysen – suspected Sexy Boys gang boss Jerome Booysen’s brother - and Jacques Cronje.\n\nThey face charges relating to the nightclub security industry in that they allegedly took over security operations at clubs and restaurants, forcing owners to pay them.\n\nFor a detailed breakdown on what has been happening in the underworld nightclub security takeover, see News24's showcase Underworld Unmasked\n\nThe group was arrested on December 15 and lodged a bail application shortly afterwards.\n\nRudolph, who represents Lakay, continued cross-examining Charl Kinnear - a police colonel who is investigating fights in Cape Town clubs - on Friday.\n\nKinnear previously testified there was a recorded conversation in which Modack alleged Vearey was a 27s gang member who worked for a man named Red.\n\nHe had also testified that there was another recording of Modack in a meeting with Vearey and Russell Christopher, a former State Security Agency official who trained with Vearey in the ANC's intelligence structures prior to 1994.\n\nThe meeting happened on May 5, 2017.\n\n'Art of deception'\n\nOn Friday, Kinnear elaborated on Vearey and Christopher, saying: \"General Vearey and Russel Christopher were trained in intelligence by the British government\".\n\nRudolph put it to Kinnear that, when it came to infiltration, \"your main source of artillery is the art of deception\".\n\nBut Kinnear said he had no knowledge of intelligence training and operations.\n\nHowever, Rudolph pushed on. \"These people are well trained in the art of deception,\" he said.\n\nHe said Vearey could therefore have passed himself off as a member of the 26s or 27s gang.\n\nProsecutor Esna Erasmus then interjected, saying Rudolph was attacking the character of police officials.\n\nRudolph persisted, saying the idea of Vearey passing himself off as a gang member was not impossible or \"ludicrous\".\n\nKinnear responded by saying: \"I would think that if General Vearey were to be part of all the gangs, the gangs would be utterly stupid (because) he's arresting them all the time\".\n\n'Gang infiltration could benefit SA'\n\nRudolph said he was not attacking Vearey’s character as it could be of the benefit to the country if he had infiltrated the 26s, 27s and 28s gangs.\n\nBut Kinnear said: \"I do not agree at all.\"\n\nEarlier on Friday, a shocking audio clip was played in the court.\n\nIn the clip, international steroid smuggler Brian Wainstein, who was murdered in his Constantia home in August last year, can be heard shouting at controversial businessman Mark Lifman.\n\nLifman, in the recording, initially tells another man \"you guys\" were told who to be careful of, and added that this included \"that fat f##k\", who the second man was on his way to see.\n\nA third man's voice, believed to be that of Wainstein, then suddenly interrupts. This man sounds infuriated and shouts at Lifman, swearing several times.\n\n\"You're a f###ing dead bastard... I'm going to f##k you up... If I see you, I will destroy you. Do you understand me?\" the third man shouts.\n\nThe clip then ends.\n\nPreviously in court it was alleged Lifman was controlling certain police officers and that he was part of a grouping which was opposed to a grouping headed by Modack.\n\nREAD: Mark Lifman controls the police, attorney alleges in court\n\nIn early January, during the bail application, Kinnear testified that a firearm was stolen during an altercation, which he said was the start of several underworld skirmishes, in Parow in March.\n\nOn Thursday he said the firearm matter involving Mihalik was unlikely because the people allegedly involved were \"at loggerheads\". The audio clip played in court on Friday was to back this up.\n\nThe bail application is expected to continue on Wednesday when the State is expected to re-examine Kinnear.", "description": "Senior policeman Major General Jeremy Vearey may have infiltrated the notorious numbers gangs, including the 26s and 27s, as he is adept at the \"art of deception\", the the Cape Town Magistrate’s Court has heard.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/6867/64680d534a144e55aa0edb2d509db9e4.jpg", "published_at": "2018-02-02"}