{"pub": "realclearpolitics", "url": "https://politico.com/story/2019/09/19/mcconnell-backs-election-security-amendment-1502971", "downloaded_at": "2019-09-19 23:09:21.082436+00:00", "title": "McConnell backs election security amendment after facing criticism", "language": "en", "text": "Senate Majority Leader Mitch McConnell. | Alex Wong/Getty Images congress McConnell backs election security amendment after facing criticism\n\nSenate Majority Leader Mitch McConnell said Thursday he is backing a measure to improve election security after Senate Democrats slammed him for blocking bipartisan election security legislation.\n\nThe amendment to an appropriations package would provide an additional $250 million to the Trump administration to assist states with improving their voting systems and preventing foreign interference.\n\nStory Continued Below\n\n“I am proud to have helped develop this amendment and to co-sponsor it in committee,” McConnell said on the floor. McConnell has previously supported addressing election security through appropriations.\n\nMcConnell added that the amendment brings the total funding for election security to $600 million since fiscal year 2018.\n\nSenate Democrats have pressed McConnell to bring election security legislation to the floor, citing Russian interference in the 2016 presidential election. But McConnell and many Republicans oppose that legislation, noting that 2018 was a more secure election year and citing concerns about centralizing the U.S. election system. That reluctance has prompted critics to label the Kentucky Republican “Moscow Mitch” — a nickname the majority leader has made clear he disdains.\n\nAfter McConnell’s announcement, Senate Minority Leader Chuck Schumer said Senate Republicans “have finally relented and taken a step in the right direction.”\n\n“Senate Democrats believe this new funding is not a substitute for passing the comprehensive bipartisan election security legislation that experts say is desperately needed,” Schumer's spokesperson wrote in an email to reporters.\n\n", "description": "The amendment brings the total funding for election security to $600 million since fiscal year 2018.", "authors": ["Marianne Levine"], "top_image": "https://static.politico.com/7f/dc/e8566b5a421dbf4d96762cca4149/190919-mcconnell-gty-773.jpg", "published_at": "2019-09-19"}