{"pub": "reuters", "url": "https://in.reuters.com/article/pakistan-media/pakistani-plan-for-media-courts-sparks-fears-for-press-freedom-idINKBN1W31VV", "downloaded_at": "2019-09-18 23:33:26.935374+00:00", "title": "Pakistani plan for media courts sparks fears for press freedom", "language": "en", "text": "ISLAMABAD (Reuters) - Pakistani government plans to launch specialist media courts sparked a furious backlash on Wednesday from media and rights advocates who said the move was an attack on freedom of speech.\n\nFILE PHOTO: Pakistani Prime Minister Imran Khan sits during a meeting with U.S. Secrretary of State Mike Pompeo (not pictured) in Washington, U.S., July 23, 2019. REUTERS/Mary F. Calvert/File Photo\n\nGovernment spokesman Firdous Ashiq Awan said late on Tuesday that cases against the media would be heard by the special tribunals, which would be overseen by higher courts.\n\nThe All Pakistan Newspapers Society (APNS) said the move was a “black day” for the Pakistani media and that they would fight the measures in the legislature and judiciary.\n\n“Special courts aimed at intimidating and strangulating the media and freedom of expression are not only unconstitutional but also contrary to the spirit of democracy,” Hameed Haroon, APNS president, and Sarmad Ali, APNS secretary general, said in an emailed statement.\n\nJournalists and human rights advocates have feared the introduction of the courts amid complaints of growing pressure on broadcasters and newspapers to avoid covering critics of Prime Minister Imran Khan’s administration.\n\nIn July, opposition parties accused Khan of intimidating broadcasters into a blackout on TV coverage of his critics, after several channels were briefly taken off-air and opposition protests and news conferences passed unreported.\n\nKhan, who took office last year, has denied censoring media and has called the accusations a “joke”.\n\nGovernment spokesman Awan said in a tweet that the existing media oversight body to be replaced by the special courts had been criticised for being under state control, and that the new courts would meet judicial standards and process cases faster.\n\n“The whole process will be a true reflection of laws and high democratic values,” she said, adding that journalists could also take complaints about the government to the media courts.\n\nBut that did not quell the fears of many freedom of speech advocates, with the non-governmental watchdog Human Rights Commission of Pakistan (HRCP) saying it was alarmed.\n\n“How are tribunals expected to maintain the media’s independence?” it said in a tweet. “Given the government’s woeful record on press freedoms, HRCP urges it to refrain from pressurising the media further.”\n\nPakistan’s press has had a turbulent relationship with successive governments and the powerful military for many years.\n\nWriters and bloggers say several cases of reporters being abducted and beaten, critical columnists being denied space, advertising business cut to media houses and sackings of TV commentators have created a climate of fear and self-censorship.", "description": "Pakistani government plans to launch specialist media courts sparked a furious backlash on Wednesday from media and rights advocates who said the move was an attack on freedom of speech.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190918&t=2&i=1431264782&w=1200&r=LYNXMPEF8H16Z", "published_at": "2019-09-18"}