{"pub": "fox", "url": "https://foxnews.com/lifestyle/mom-funny-bedtime-trick-kids-viral", "downloaded_at": "2019-10-04 16:54:52.007694+00:00", "title": "Mom's funny bedtime trick for calming down her kids goes viral: 'I'm not even sorry'", "language": "en", "text": "One creative mom in Massachusetts has been hailed as a “genius” after successfully convincing her young children to relax before bedtime with a hilarious trick that has since gone viral on social media.\n\nJessica D'Entremont’s daughters Emma, 4, and Hannelore, 3, were particularly riled up one recent evening, prompting the parent to start brainstorming ways to get them to simmer down before bed, Fox 59 reports.\n\n\"We got home and they were running around extra hyper and I knew the transition to bed was going to be a lot of tears and meltdowns,\" the Boston woman told Today.\n\nWOMAN'S SIMPLE FRIDGE HACK GOES VIRAL\n\nInspired, D'Entremont told her daughters to put on their glow-in-the-dark Halloween pajamas and lie very still below a ceiling light to “charge” the outfits, and the ploy proved to work like a charm.\n\n\"Looking for a way to keep your kids still[?]\" D'Entremont later wrote in a Sept. 29 Facebook post, sharing an adorable picture of her daughters lying on the ground in their PJs, intently focusing on the ceiling above them. \"Buy them glow-in-the-dark pjs. Tell them they have to lie really still under the light to 'charge' them… I'm not even sorry,” she added.\n\nMuch to the mom’s surprise, her hilarious hack has since gone viral with over 207,000 likes, 124,000 shares and tens of thousands of comments. Several Facebook users declared D'Entremont a “genius” for the simple way to earn “5 minutes of peace\" when wrangling youngsters before bedtime.\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\n\"I think it's nice sometimes to see something just innocent and playful and relatable,\" the woman told Today of the incredible reaction to the silly stunt. \"What parent doesn't want five minutes of quiet? I think everyone — parents, grandparents, aunts and uncles, nannies and babysitters, teachers — anyone who is around kids just got it.\"\n\n“Both [of my daughters] have sensory processing disorder and I’m always looking for ways to add stillness and calm into their sensory diet,” D'Entremont, who works as a nurse in palliative and hospice care, told Fox 59.\n\n“It worked perfectly and they were so intent and serious I just had to snap a picture,” she said.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nD'Entremont detailed in an update that Emma and Hannelore later tried to \"test\" her trick, so she started putting their glow-in-the-dark pajamas back in their drawers during the day, hiding them from the light, to boost the credibility of the bedtime ploy.", "description": "The creative parent has been hailed as a \"genius.\"", "authors": ["Janine Puhak", "Janine Puhak Is An Editor For Fox News Lifestyle. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/kids-pjs-istock.jpg", "published_at": "2019-10-04"}