{"pub": "euronews", "url": "https://euronews.com/2019/10/04/scotland-becomes-first-country-in-uk-to-ban-smacking", "downloaded_at": "2019-10-05 11:04:52.820916+00:00", "title": "Scotland becomes first country in UK to ban smacking", "language": "en", "text": "Scotland has become the first country in the UK to criminalise the smacking of children.\n\nMembers of Scottish Parliament (MSPs) passed the Children (Equal Protection from Assault) (Scotland) Bill by 84 votes to 29 on Thursday.\n\nThe bill, introduced by Scottish Greens MSP John Finnie in September 2018, makes it a crimimal offence to smack children and abolishes the legal defence of \"reasonable chastisement\" previously available to parents. Effectively, children in Scotland will have identital legal protection from assault as adults once the law comes into force.\n\nFinnie's bill had the support of children's charities including NSPCC Scotland, Barnardo's Scotland, Children 1st, domestic violence charity Zero Tolerance and the Church of Scotland.\n\nThe Scottish Conservatives opposed the ban, saying that it risks criminalising \"good parents\". Campaign group Be Reasonable Scotland also argued against the ban, saying that it would come at the expense of the victims of \"genuine child abuse\", as police and social services would be \"flooded with trivial cases\".\n\nElsewhere in the UK, parents and carers in England and Wales face criminal charges if they hit a child hard enough to leave a mark, bruise, cut, graze or scratch, with the legal situation similar in Northern Ireland. A bill removing the defence of reasonable punishment, similar to the one passed in Scotland, is currently being debated in the Welsh Assembly.\n\nWhile the Scottish law is progressive by UK standards, it is the 58th country in the world to introduce such a measure and similar bans are already in place in the majority of European countries.\n\nSweden was the first country in the world to ban smacking, in 1979. Austria, Finland and Norway followed suit in the 1980s, and Croatia, Cyprus, Denmark, Latvia in the Nineties.\n\nBans were introduced in the 2000s by Bulgaria, Germany, Greece, Hungary, Iceland, Liechtenstein, Luxembourg, the Netherlands, Poland, Portugal, Romania, Spain and Ukraine. They have come into force in Albania, Estonia, Ireland, Lithuania, Malta, San Marino and Slovenia in the last decade and, last year, in France.\n\nBelgium, Czech Republic, Hungary, Italy, Slovakia and Switzerland are yet to implement a smacking ban.\n\nReactions to the Scottish ban have been mixed. Trainspotting author Irvine Welsh came out in favour, referring to his own experiences of corporal punishment in a tweet that read: \"Disappointing. I was given the belt almost every week at school and it made me into a cruel, psychotic drug addict. Now our so-called elected representatives would deny future generations such opportunities. PC gone nuts.\"\n\nArgyll and Bute MSP Michael Russell, last night tweeted: \"When banning smacking came up in [in the Scottish Parliament] in 2001 I was shadow education minister and opposed it, like the majority of MSPs. Very pleased that the Parliament and I have learned & changed & therefore delighted to vote for [John Finnie's] successful Bill this evening.\"\n\nControversial commentator Brendan O'Neill meanwhile called the ban \"an outrageous assault on parental freedom\". In an article on his website Spiked, he wrote: \"This is an outrageous intrusion into the sovereignty of the family.\n\n\"It is yet another expression of the PC middle classes’ arrogant presumption that they know better than the rest of us how children should be brought up... The quinoa mums and blogging dads who make up the commentariat and the political elite have always looked with snobbish horror at parents who smack.\"", "description": "Members of the Scottish Parliament on Thursday voted by 84 votes to 29 in favour of a ban on all physical punishment. But where else in Europe is smacking children banned?", "authors": ["Lindsey Johnstone"], "top_image": "https://static.euronews.com/articles/stories/04/20/72/34/1000x563_cmsv2_755c7966-e536-55fb-a7d6-d6506c954fd1-4207234.jpg", "published_at": "2019-10-04"}