{"pub": "nymag", "url": "https://vulture.com/2019/09/podcasting-history-three-eras.html", "downloaded_at": "2019-10-01 00:16:08.268135+00:00", "title": "We’re Entering the Era of Big Podcasting", "language": "en", "text": "The history of podcasting can be told in three stages. Photo: Vulture and Getty Images\n\nYou have to admit: “Podcast” is a silly word. Sure, it’s no sillier than “YouTube” or “TikTok,” perhaps, and the portmanteau logic of combining the words “iPod” and “broadcast” is generally defensible. But the word retains a makeshift feel even to this day — which is fitting, I suppose, given its origins as an afterthought. Ben Hammersley, who coined the term in a 2004 column for The Guardian, busted it out simply because his editor needed one more sentence to fit the piece, which was about a revolutionary new audio distribution technology, on the printed page. With minutes to go, he wrote: “But what to call it? Audioblogging? Podcasting? GuerillaMedia?”\n\nThe second word stuck. “I just made up a bullshit sentence,” Hammersley would tell me years later. “Honestly, I don’t really even remember doing it.”\n\nIt’s a cliché these days to say that “podcasting is on the rise,” but it’s also true. Indeed, it’s as true today as it was back when Hammersley coined the word in 2004. And, remarkably, the medium has grown even as its underlying technology, developed in the early aughts, has essentially stayed the same. There were a few bumps here and there, of course, and while some of those bumps drove people elsewhere, those who stuck around saw themselves part of a tiny village that grew into a vibrant town — which then exploded into an industrious city, one that can be tremendously hard to keep up with.\n\nA lot has happened in the brief history of podcasting (so far). What started as a quiet digital backwater is now increasingly growing in prominence, drawing the attention of audiences and moneyed interests alike. In all probability, the medium is heading into a future where it firmly becomes part of the broader entertainment industrial complex. And the story of how we go here can be told via two major turning points: The first was everything that happened before and after 2014. The second turning point is happening right now.\n\nThe First Era: The Pioneers\n\nGoing all the way back to the medium’s creation, podcasting was mostly defined by its blogging roots. Both worlds shared a similar political spirit in that, much like the early bloggers, the development of podcasting was largely motivated by a belief in the internet’s ability to democratize speech, a desire to circumvent gatekeepers, and an impulse to exist and create on one’s own terms.\n\nNot that we should romanticize the early days too much. The earliest podcasts were mostly chat-heavy amateur affairs — crudely recorded, barely edited, insular. This would change, gradually, as podcasting slowly but steadily grew in visibility and attracted a wider range of participants. Eventually, the universe of podcast creators would expand beyond ultra-early adopters to include a wide range of backgrounds: technology writers, former MTV video jockeys, journalists, talk-radio personalities, various comedians (including Scott Aukerman, Tig Notaro, and Paul Scheer), public-radio veterans tired of the system’s limitations, public-radio organizations seeking alternative means of distribution (NPR and WNYC, in particular), B-list celebrities working to expand their footprint (most notably Joe Rogan), and so on. This broadening of the creative pipeline translated into a greater mix of podcasts for audiences to try out.\n\nOf course, we can’t talk about this history without acknowledging the centrality of Apple, whose iterative inclusion of podcasts into iTunes — and later, spinning out the directory as a standalone app that comes bundled with the iPhone — was both fundamental to the medium’s development and the establishment of the company’s dominance as the majority podcast distributor. That Apple practiced a largely hands-off approach, allowing podcasts to operate without having to pay fees (as in the case of its App Store), was crucial to the ecosystem’s incubation, as it allowed podcasts to grow on their own terms and timeline.\n\nEarly podcast companies, mostly in the form of networks, were created in search of a business model (including, most notably, Midroll Media, nowadays rebranded as Stitcher), but money remained a problem. Because the underlying technology of the medium has stayed virtually unchanged throughout its history, podcast listener data remained quite crude. This state of affairs has largely been interpreted to be the major hurdle preventing a free flow of advertising dollars into the space, limiting active podcast advertisers to a pool of particularly experimental, forward-thinking companies. (Shout-out to Mailchimp.) However, some particularly ideological corners of the podcast ecosystem find this state of data crudeness to be a virtue, given the broader internet’s invasive history with digital advertising and user privacy.\n\nIn any case, podcasting kept growing in listenership, slowly but steadily, despite the relatively slow uptake of actual business. It even continued to do so through the Great Recession. According to Edison Research, which has tracked podcast listening going back to 2006, listenership kept growing slightly through the latter half of the aughts — two percentage points between 2008 and 2010 — even as what little investment money there was dried up and some podcast creators began to pull back.\n\n(As it turned out, the Great Recession became an important creative phase for podcasting, as many of the staple shows we know today were launched during this period. A brief list of podcasts that debuted in the second half of the aughts: WTF With Marc Maron, Comedy Bang! Bang!, The Adam Carolla Show, The Memory Palace, and The BS Report. This American Life started podcast distribution in 2006. Radiolab did the same in 2009.)\n\nPodcast listening would eventually flatten out by the early 2010s. Edison Research’s numbers show that monthly listening stayed pretty much the same on average between 2010 and 2013, and frankly, we don’t really know why. Whatever the reason, it doesn’t really matter. Because in 2014, This American Life dropped the first season of Serial, which became a pop-culture phenomenon and kicked everything into overdrive.\n\nThe Second Era: Boom Years\n\nThese days, you can find a decent number of prominent podcasting figures willing to play down Serial’s importance to the trajectory of the medium. “Podcasts were already taking off,” they argue.\n\nThere are ways that you can sharpen that argument. One could claim, perhaps, that Serial’s breakout moment in the culture only contributed to the boom of narrative podcasts. One could further compound the argument with the idea that podcasts in the tradition of talking heads — from personality-driven fare like WTF With Marc Maron and The Joe Rogan Experience, to round-table discussions shows like Slate Political Gabfest, to free-form comedy shows like Comedy Bang! Bang! — were consistently gaining audience year over year, and that any one of them could have broken out in much the same. And maybe if we’d never had Serial, someone else would have become the dominant shorthand of this rising industry.\n\nMaybe. But Serial’s late 2014 debut is nonetheless a strong historical marker. To wit: According to Edison Research, the number of monthly podcast listeners in America practically doubled in the five years after 2014, from around 39 million Americans to an estimated 90 million. In the five years preceding 2014, the same metric grew by only 35 percent.\n\nIn other words: There was podcasting before 2014, and there was podcasting after 2014.\n\nThe years following the late 2014 moment saw an insane flurry of podcast activity. The number of new podcasts — from established media companies to independent creators to regular ol’ folks like your cousin — have spiked tremendously. This has led to the rise of more hits, more podcast businesses, and more newly minted podcast celebrities, but it’s also led to a slight feeling of saturation, so much so that some corners feel compelled to ask if we’re hitting Peak Podcast. (We’re not.)\n\nMeanwhile, advertising money has begun to pour in to the point that proper accounting can finally be conducted. A study by the Interactive Advertising Bureau, published earlier this year, found that the budding industry drove $479 million in podcast advertising revenue last year, up from $314 million in 2017. Ad revenue is projected to hit $1 billion by 2021, apparently. And then there’s all the interest from Hollywood, which has begun to view podcasts as both a rich source of intellectual property and a space to test out intellectual property. Among the podcasts to have hit television: Homecoming, Pod Save America, Lore, Dirty John, and … Startup, in the form of the ill-advised Alex, Inc.\n\nAll this activity had the arc of a crescendo. Every week yielded another new project, another milestone, another expression of deep ambition. Things felt like they were moving, thunderously — but to where, exactly, it was unclear.\n\nThe New Era: Big Podcasting\n\nAnd then, earlier this year, we found out. In February, Spotify, which had previously dipped its toes into podcast distribution to seemingly pedestrian effect, jumped head first into the pool by spending over $340 million to acquire Gimlet Media, a podcast studio, and Anchor, a podcast publishing platform. (Spotify would later also acquire Parcast, another podcast studio.) These eye-popping acquisitions, with their unprecedented price tags, were immediately followed by a declaration of intent. “With the addition of Gimlet and Anchor, Spotify will now become the leading global podcast publisher with more shows than any other company … we want to become the world’s leading audio platform,” wrote Daniel Ek, Spotify’s CEO, in the blog post announcing the acquisitions.\n\nWith this move, Spotify has likely triggered the start of a whole new podcasting era, one that’s farther away than ever from the medium’s makeshift and slow-but-steady origins. Let’s call it Big Podcasting for now. In the months since the acquisitions, there’s been a steady stream of subsequent developments in the Spotify camp: exclusive partnership announcements, buzzy talent hiring, further expressions of ambition — not to mention new shows that have already debuted, with big names like Jemele Hill and Joe Budden attached. It all suggests a future in which Apple is no longer the dominant distributor and where the company might feel compelled to change its relatively relaxed relationship to podcasts, thus possibly breaking podcasting’s relationship with its blog-affiliated past for good.\n\nWhat happens next? Assuming Spotify successfully realizes its podcasting ambitions, we’re probably going to see a rapid acceleration of money — and further corporate interest — in the space, pulling the entire medium out of the relative fringes and deeper into the mainstream entertainment industrial complex. (The most explicit example of this is Endeavor Audio, the new podcast division created by Endeavor, the entertainment conglomerate.) This is both good and bad in much the same way that any major metropolitan city or big-business environment is good and bad: There will be winners and losers, there will be fortune and famine, there will be the gentrifiers and the gentrified. (And there will be more podcasts, so many more podcasts.)\n\nThe question is whether there will remain a solid middle class, which in this metaphor almost completely refers to the class of independent creators. How will they fare? How will their business positions be maintained? Who will support them? And will we see a future in which podcasting is broken up into different paywalled platforms, not unlike what we’re seeing with the streaming wars? (My guess: probably, to some extent.)\n\nWhich brings us back to Apple, the longtime impartial steward of the podcast ecosystem. A recent Bloomberg report raised the possibility that Apple may be looking into funding its own original podcasts, presumably as a way to match up against Spotify’s machinations toward audio dominance. If true, and if the company follows through, this would all but break Apple’s impartial position, rendering the Apple Podcast platform yet another battleground in a broader corporate arms race forming around podcasting. What will happen to independent podcasting, then, lies with how Apple will respond to the changing podcast world around it. Which is also to say: The future of podcasting lies, ironically, with Apple, where it once began.\n\nIt’s barely been a year, but one thing seems increasingly certain: There was podcasting before 2019, and there will be podcasting after 2019. What podcasting will look like in 2024 remains very much up for grabs.", "description": "What started as a quiet digital backwater is now growing in prominence, drawing the attention of audiences and moneyed interests alike. In all probability, the medium is heading toward the entertainment industrial complex.", "authors": ["Nicholas Quah"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/30/30-podcast-opening-essay.w1200.h630.jpg", "published_at": "2019-09-30"}