{"pub": "news.com.au", "url": "https://realestate.com.au/news/melbournes-own-buckingham-palace-sells-in-canterbury/?rsf=syn:news:nca:news:spa:strap", "downloaded_at": "2019-10-15 23:08:03.785215+00:00", "title": "Melbourne’s own Buckingham Palace sells in Canterbury", "language": "en", "text": "The palatial pad crowned Melbourne’s own Buckingham Palace has sold in Canterbury.\n\nBuyers fell in love with the style of the new European-inspired residence that took two years to build at 29 Stanley Grove.\n\nRay White Balwyn agent Helen Yan said it sold for more than $7 million.\n\nRELATED: Melbourne’s own Buckingham Palace for sale in Canterbury\n\nYarra Ranges palace poised to attract royal sum\n\nNot your average French provincial-style home in Balwyn\n\nToorak mansion resembling the White House sells for big sum\n\nPrice hopes when it was first listed for sale in May were $7.8-$8.2 million.\n\n“The buyers liked the quality of the build and the location,” Ms Yan said.\n\n“We had four parties put offers forward. It was a very good result, there are not very many buyers around at the moment.”\n\nThe international buyers, who have permanent residency in Australia, plan on living in the regal residence.\n\nVendors Sam Hawli and Hao Chen, of Tag Corporation, have built several other French provincial-style homes throughout Melbourne — but they considered this one their best.\n\n“It was a long process — it took just under two years when it usually takes a year, but there was a lot of detail in this one,” Mr Hawli said.\n\n“I hope the buyer will appreciate the hard work.”\n\nIt may not have 775 rooms like Buckingham Palace, but the family home is almost as impressive.\n\nMarketed as “a luxurious and exquisite family jewel”, the property has multiple living zones including a sitting room that doubles as a music room and a formal living room with a marble gas log fireplace.\n\nThe kitchen comes with Gaggenau appliances, swathes of Carrara marble, induction cooking, a Liebherr fridge and freezer, and a butler’s pantry.\n\nThe top floor is accessible via a lift or sweeping staircase and is highlighted by a main bedroom retreat featuring a walk-in wardrobe, a marble and porcelain ensuite with freestanding bath, and an office.\n\nThe other four bedrooms also have walk-in wardrobes and access to ensuites.\n\nThe basement level boasts a four-car garage, gym, cellar, wet bar and deluxe tiered cinema.\n\nMORE: Wheelers Hill auction: 1970s time capsule among big sellers in southeast\n\nBarry Plant returns to auction his old Templestowe home\n\nWorld War II bunker conversion: Yelta property for sale as a house\n\ntessa.hayward@news.com.au", "description": "The palatial Canterbury pad crowned Melbourne’s own Buckingham Palace has sold for a regal sum. The “exquisite jewel” packs five bedrooms, five bathrooms and five living rooms.", "authors": ["Tessa Hayward"], "top_image": "https://www.realestate.com.au/blog/wp-content/uploads/2019/10/15111913/capi_09965ff60fbc9eb6324a3a6486f0028d_def7dc222722c3ccfddcf6b623595eb6.jpeg", "published_at": "2019-10-15"}