{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-usa-oil-kemp/column-u-s-oil-drilling-slowdown-hits-wider-economy-idUKKBN1WH1WK", "downloaded_at": "2019-10-03 07:52:27.433408+00:00", "published_at": "2019-10-02", "title": "Column: U.S. oil drilling slowdown hits wider economy", "language": "en", "text": "LONDON (Reuters) - A downturn in oil and gas drilling is making a small but significant contribution to the overall slowdown in U.S. business investment and economic growth, intensifying the much bigger problems caused by the trade war with China.\n\nA pumpjack is shown outside Midland-Odessa area in the Permian basin in Texas, U.S., July 17, 2018. REUTERS/Liz Hampton/File Photo\n\nAs domestic oil and gas production grows and becomes increasingly important to the U.S. economy, the fortunes of the industry increasingly have macroeconomic as well as microeconomic implications.\n\nThe last slump in oil and gas drilling contributed to the mid-cycle economic slowdown in 2015/16, which helped fuel the political discontent that resulted in the election of populist President Donald Trump to the White House.\n\nNow the pattern risks being repeated as oil and gas companies cut back on new well drilling and completions in response to lower oil prices, with ripples felt throughout the entire supply chain.\n\nTotal business fixed investment was up by 2.6% in the second quarter of 2019 compared with a year earlier, but sharply down from the recent peak of 6.9% seen between the second quarters of 2017 and 2018.\n\nFixed investment in industries other than mining, oil and gas had grown by 3.0% in the second quarter, down from 6.0% a year earlier, according to preliminary estimates from the U.S. Bureau of Economic Analysis.\n\nBut investment in mining, oil and gas fell by 7.7% compared with growth of almost 28% in the second quarter of 2018 (“National income and product accounts”, BEA, Sept. 26).\n\nMining and oil and gas investment had slowed to a seasonally adjusted annualised rate of $114 billion in the second quarter of 2019, down from $124 billion in the second quarter of 2018.\n\nGiven the continued slide in oil and gas prices as well as the number of active rigs drilling, investment is set to fall even further in the third and fourth quarters of this year.\n\nDuring the last downturn, investment slumped from a peak of $173 billion in the fourth quarter of 2014 to just $63 billion in the second quarter of 2016.\n\n(Chartbook: tmsnrt.rs/2n0CEju)\n\nThe current downturn is much milder, so far, so the hit to the economy is unlikely to be as severe. But it is interacting with and compounding the slowdown caused by tariffs and uncertainty associated with the trade war with China.\n\nACCELERATOR\n\nInvestment in oil, gas and mining, including well drilling, accounts for only a relatively small share of all private business investment.\n\nFixed investment in oil, gas and mining structures has accounted for around 12% of all private non-residential fixed investment in structures per quarter since 2002, and around 6% of all private non-residential investment including equipment, software and intellectual property.\n\nBut oil and gas investment is much more volatile than investment in other industries so it has an outsized impact on the marginal growth rate.\n\nChanges in oil and gas also have a multiplier effect via the supply chain – including equipment producers, services companies, accommodation providers, steel makers, railroads and trucking firms.\n\nThe slump in oil and gas drilling in 2015/16 was both a consequence of the economic slowdown (as oil consumption growth faltered) and a contributing cause (as oil and gas investment fell).\n\nSomething similar is playing out in 2019 and will likely extend into the first part of 2020, with the downturn in the oil and gas sector acting as a drag on overall economic growth.\n\nThe industry cycle also has strong regional and distributional effects, with drilling booms lifting the economies of Texas, North Dakota and other oil-producing states faster than the national average in 2011-2014 and again in 2017-2018.\n\nHowever, that means any economic slowdown will be felt harder in these states.\n\nJohn Kemp is a Reuters market analyst. The views expressed are his own.\n\nRelated columns:\n\n- Rising oil prices boost U.S. economy (Reuters, May 15, 2018)\n\n- U.S. economy slows sharply as oil and gas slump deepens (Feb. 1, 2016)\n\n- Oil shock is hurting U.S. economy (Reuters, Jan. 19, 2016)", "description": "A downturn in oil and gas drilling is making a small but significant contribution to the overall slowdown in U.S. business investment and economic growth, intensifying the much bigger problems caused by the trade war with China.", "authors": ["John Kemp", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191002&t=2&i=1436306399&w=1200&r=LYNXMPEF9119X"}