{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/2019/10/15/broncos-lb-johnson-making-most-of-chance-after-long-layoff/40319945", "downloaded_at": "2019-10-15 08:01:35.362406+00:00", "title": "Broncos LB Johnson making most of chance after long layoff", "language": "en", "text": "CLOSE\n\nENGLEWOOD, Colo. (AP) — If Alexander Johnson is indeed rusty, his Denver Broncos teammates can't wait to see how he'll play when he shakes that rust off.\n\nJohnson's first two NFL starts this month have produced 18 tackles, two pass breakups, two quarterback hits, 1½ sacks, a tackle for loss and an end zone interception in back-to-back wins over the Chargers and Titans.\n\n\"He's been killing it since he stepped in and I'm happy for him,\" Broncos linebacker Von Miller said. \"I'm not surprised, as he does all that stuff in practice. He's a great guy off the football field. We box in the offseason, we've done so much stuff. He's been talking about it and meditating and waiting for his shot. It's definitely inspiring.\"\n\nStarting for the first time since his senior year at Tennessee in 2014 has allowed Johnson to display his pregame \"Dinosaur \" jaunt through the tunnel.\n\nOn Sunday, he tweeted he was the \"first Dinosaur to come back from extinction in the football world.!!Thank you God\"\n\n\"There's a lot of moving pieces in this defense and you can see him plucking away and learning and feeling more and more comfortable,\" safety Justin Simmons said. \"Yeah, he's definitely an old-school SEC-looking linebacker.\"\n\nDenver coach Vic Fangio has tempered his applause for Johnson with admonitions to clean up assignment mistakes.\n\nFollowing Johnson's starting debut at Los Angeles two weeks ago, his first start since Nov. 15, 2014, for Tennessee against Kentucky, Fangio said the inside linebacker \"made a bushel full of mistakes\" that he was lucky to get away with.\n\nHe cleaned most of those up Sunday in a 16-0 win over Tennessee.\n\n\"He did, to a degree,\" Fangio said. \"Still had one or two. ... But he played good.\"\n\nJohnson was a three-time All-SEC selection at Tennessee from 2011-14 and a four-year starter in Knoxville whose college career came to an end when a woman accused him and teammate Michael Williams of rape in November 2014. They were indicted in February 2015.\n\nForty-one months later, on July 27, 2018, both men were acquitted on all counts, and three months later Johnson signed with the Broncos.\n\nHe played just one game as a 26-year-old rookie and spent time on Denver's practice squad. This season, he played in three of the first four games but only on special teams.\n\nWith Josey Jewell bothered by a sore hamstring, Johnson got his chance to finally fulfill his childhood dream and start in the NFL, one he kept alive through his Christian faith and the inner peace he found in, of all places, mixed martial arts.\n\nA few lockers away from his, newly signed cornerback Coty Sensabaugh was lamenting last week about not being in training camp this summer because \"there's just no simulating football games.\"\n\nSensabaugh had been away less than a year. So, how did Johnson overcome his long layoff from football?\n\n\"Well, I stayed in shape. Obviously, I worked a full-time job and I also was a personal trainer. I trained people and I trained myself and then I picked up doing MMA and that right there was probably one of the biggest things I could have done during the time I was off,\" Johnson said.\n\nJohnson said he knew very little about cage fighting until Knoxville-based UFC fighter Scott Holtzman invited him to the gym one day.\n\nSo, he went, \"and I'm like, 'Yep, I think I found my second-favorite sport,'\" Johnson said.\n\n\"It's a violent sport but you've also got to think and be smart and be reactive. Within seven months of me starting, I was ready for my first fight,\" he said.\n\nAlthough an injury scrubbed his octagon debut, Johnson continued MMA training because it was much more rigorous than anything he'd ever done in football.\n\n\"In football training, I can do a couple reps, rest, do a couple reps, rest. Whereas in fighting, you don't have any rest,\" he said.\n\nIn the cage, there's no catching your breath between rounds. There's no whistle every few seconds as there is in football.\n\n\"Fighting is constant,\" Johnson said. \"So, like in football you can have one bad play right here and correct yourself and you can accumulate another whole bunch of plays on top of that. But in fighting, you get caught wrong or miss a free punch or block the wrong way, you can be done. You can be knocked out.\"\n\nWhat he really came to love about the sport, though, was how it brought him such peace.\n\n\"Anything that happened that day or anything that's on your mind bothering you, you can't carry that into the gym because you've got to clear your mind. You've got to be focused on your craft while you're in the gym,\" Johnson said.\n\nHe said training has helped him become a better football player because he understands now how to make the most out of his strength and technique and not waste any energy.\n\n\"Simple things as when you punch somebody and your feet are off the ground or you're trying to lean, it's not going to be a powerful punch. But if I punch somebody and I'm stepping, I'm exerting energy from the ground and it's going to be more powerful,\" Johnson said.\n\nHe's using what he learned in MMA, he said, to help him minimize his mistakes on the football field and \"keep stacking up some more good games.\"\n\n___\n\nFollow Arnie Melendrez Stapleton on Twitter: http://twitter.com/arniestapleton\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Denver Broncos linebacker Alexander Johnson is making the most of his NFL breakout five years after his senior season at Tennessee", "authors": ["Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/sites/usatoday/images/favicon.png", "published_at": "2019-10-15"}