{"pub": "yahoo", "url": "https://news.yahoo.com/gop-congressman-undecided-impeachment-wont-183155831.html", "downloaded_at": "2019-10-20 12:52:14.350818+00:00", "title": "GOP congressman weighing impeachment won't seek new term", "language": "en", "text": "FILE - In this Jan. 3, 2019, file photo, House Speaker Nancy Pelosi of Calif., second from left, poses during a ceremonial swearing-in with Rep. Francis Rooney, R-Fla., right, on Capitol Hill in Washington. said out loud Friday, Oct. 19, what others in his party are not, namely that White House Chief of Staff Mick Mulvaney acknowledged a “quid pro quo” was at work when Trump held up U.S. aid to Ukraine in exchange for Kyiv’s investigation of Democrats and the 2016 elections. Mulvaney later claimed his comments had been misconstrued, but Rooney says he and other Republicans heard them clearly. (AP Photo/Susan Walsh, File)\n\nWASHINGTON (AP) — Florida Rep. Francis Rooney, one of the few Republicans openly weighing whether to impeach President Donald Trump, said Saturday he will not run for reelection.\n\nAsked if he needed or hoped for a third term in 2020, he told Fox News, \"I don't really think I do and I don't think I really want one.\" He later confirmed to The Associated Press that he will not run again, thereby adding his name to an already extensive list of GOP retirements.\n\nRooney said Friday he was \"still thinking about\" whether to vote to impeach Trump, saying Trump's acting chief of staff, Mick Mulvaney, had acknowledged a quid pro quo was at work when Trump held up U.S. aid to Ukraine in exchange for Ukraine's investigation of Democrats and the 2016 elections. Mulvaney later claimed his comments had been misconstrued, but Rooney said he and other Republicans heard them clearly.\n\n\"I just don't think that the power and prestige of our country is supposed to be used for political things,\" he said in an AP interview. He also said he was still thinking about whether he believed Trump's conduct was impeachable.\n\nAnything short of a \"no\" on that question, even from only one of 197 Republicans in the House, is notable as Democrats drive to impeach Trump.\n\nTrump has made clear that he does more than notice what he considers acts of disloyalty. He is fond of making examples of Republicans by threatening to sink their reelection bids and following through in a few cases.\n\nOn Friday night, Trump tweeted, \"REPUBLICANS MUST STICK TOGETHER AND FIGHT!\" That tweet was accompanied by a video targeting Sen. Mitt Romney, R-Utah, who has been critical of Trump's handling of Turkey's assault on Syrian Kurds.\n\nWhen Rep. Justin Amash of politically critical Michigan became the first House Republican to call for Trump's impeachment earlier this year — and quit the party — the backlash from Trump's orbit was swift.\n\nThat was before revelations about Trump's pressure on Ukraine, which made his impeachment by the end of the year a real possibility.\n\nA year ago, at a presidential rally in Estero, Trump praised Rooney as \"a man who's so great to me on television. This guy is special. He was a great businessman. Now he's a great congressman, Francis Rooney.\"\n\nHe went on: \"I love him when he defends me. He's brutal. He gets the job done, right, Francis? Thank you, man.\"\n\nRooney, 65, serves on the House Foreign Affairs Committee, and is a solid member of the Republican establishment. Among the wealthiest members of the House, he won his second term last year with 62 percent of the vote. His foreign policy bona fides come in part from his service as ambassador to the Holy See under President George W. Bush.\n\nRooney has at times been a Trump critic. He was one of 13 House Republicans to join a Democratic effort early this year to stop the president from declaring a national emergency to pay for his border wall with Mexico.\n\nHe told Fox News \"I've done what I came to do,\" citing his priorities of securing money for the Everglades and enacting an offshore drilling ban, and \"I want to be a model for term limits.\"\n\n___\n\nAssociated Press writers Andrew Taylor and Zeke Miller and news researcher Monika Mathur contributed to this report.", "description": "Florida Rep. Francis Rooney, one of the few Republicans openly weighing whether to impeach President Donald Trump, said Saturday he will not run for reelection.  Asked if he needed or hoped for a third term in 2020, he told Fox News, \"I don't really think I do and I don't think I really", "authors": ["Laurie Kellman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/60O3b8f.NsMGrfNgfQIe5Q--~B/aD0yOTYwO3c9NDQ0MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/bd56c36d3476bd0b4b38be1c47862f70", "published_at": "2019-10-20"}