{"pub": "cnbc", "url": "https://cnbc.com/2019/09/18/elon-musk-tweeted-new-photos-of-the-spacex-starship-rocket-prototype.html", "downloaded_at": "2019-09-18 23:23:15.677849+00:00", "title": "See Elon Musk's prototype Mars rocket as SpaceX prepares for test flights", "language": "en", "text": "Elon Musk may have his sights set on Mars, but his SpaceX Starship will have to make it to orbit first.\n\nThat important step is reportedly next on the agenda for Musk's SpaceX and its Starship rocket prototype, which is under construction at facilities in Texas and Florida.\n\nOn Tuesday, Musk tweeted new photos showing the latest construction updates for the shiny, stainless steel Starship that's being built at SpaceX's Boca Chica, Texas facility.\n\nAnd in typical Musk fashion, the billionaire tech mogul couldn't resist a pop culture reference alongside the new images.\n\nOne photo shows the view from the inside of a hangar filled with spare parts and construction equipment in the foreground and the shiny cylindrical body of the Starship prototype visible in the background. \"Droid Junkyard, Tatooine,\" Musk captioned the photo in an apparent joking reference to the fictional planet from the \"Star Wars\" movie franchise.\n\nIn a second tweet, Musk posted a photo showing a metal dome being lifted by wires to be placed on top of the Starship's cylindrical shaft, accompanied by another joking caption: \"Area 51 of Area 51.\"\n\nOn September 9, SpaceX filed an application with the Federal Communications Commission for the transmitter that will be mounted in the Starship prototype, a sign that Musk then confirmed on Twitter meant the company is closer to launching an orbit-class test flight. On the test flight, the reusable Starship rocket will aim to reach an altitude of more than 12 miles above the Earth's surface before returning safely to the ground.", "description": "SpaceX CEO Elon Musk tweeted new photos of the company's Starship orbital rocket prototype under construction. SpaceX is getting closer to \"orbit-class\" test flights, Musk said recently.", "authors": ["Tom Huddleston Jr."], "top_image": "https://image.cnbcfm.com/api/v1/image/106032591-1563813200879gettyimages-1157175928.jpeg?v=1568823742", "published_at": "2019-09-18"}