{"pub": "yahoo", "url": "https://sports.yahoo.com/report-five-teams-shown-interest-145804205.html", "downloaded_at": "2019-09-15 23:18:33.732951+00:00", "title": "Report: Five teams have shown interest in Minkah Fitzpatrick trade", "language": "en", "text": "Defensive back Minkah Fitzpatrick reportedly received permission from the Dolphins this week to discuss the possibility of a trade with other teams and a handful of teams have shown interest in such a deal.\n\nESPN reports that five teams have expressed interest in trading for the 2018 first-round pick. The identities of those teams were not revealed, although there was an indication this week that the Cowboys have at least spoken to the Dolphins in recent days.\n\nThe Dolphins are reportedly looking for a first-round pick and “something else” in order to deal Fitzpatrick. Per the report, some teams do not believe the Dolphins will find takers at that price.\n\nIan Rapoport of NFL Media also reports that a first-round pick is a must for the Dolphins in a trade, but has a rosier report in terms of Miami’s chances of landing that compensation. He reports that there’s been “real and serious” interest and that a deal could come to fruition this week.\n\nFor now, Fitzpatrick remains a Dolphin and he’ll be in the lineup against the Patriots on Sunday.", "description": "Defensive back Minkah Fitzpatrick reportedly received permission from the Dolphins this week to discuss the possibility of a trade with other teams and a handful of teams have shown interest in such a deal. ESPN reports that five teams have expressed interest in trading for the 2018 first-round pick.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/5J.x8NdAq9.IsCFLa9S6.A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjEuMzU1OTMyMjAzMzg5OA--/https://s.yimg.com/uu/api/res/1.2/o.buTNWIazgqs1XX8mAgNw--~B/aD01MzI7dz05NDQ7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/profootballtalk.nbcsports.com/a5c4fa2f5c59cf69437058048b15f76a", "published_at": "2019-09-15"}