{"pub": "politico", "url": "https://politico.com/story/2019/09/04/democrats-climate-2020-1481499", "downloaded_at": "2019-09-05 03:50:48.480061+00:00", "title": "Democrats seize on climate as 2020 primary weapon", "language": "en", "published_at": "2019-09-04", "text": "Sen. Elizabeth Warren, pictured here at the July Democratic debates, called Wednesday for weaning the nation off nuclear power. | Paul Sancya/AP Photo 2020 elections Democrats seize on climate as 2020 primary weapon In a marathon forum on climate change, Democratic contenders began to seek separation from one another on the key issue.\n\nIt wasn’t the debate that climate activists wanted.\n\nBut one marathon stretch of climate forums on Wednesday nevertheless marked a sharp turn in the 2020 presidential contest. In seven hours on CNN, the leading Democratic candidates showed the first signs of weaponizing climate change in the primary campaign.\n\nStory Continued Below\n\nProdding one another across televised segments and, by proxy, through the network’s moderators, Sen. Bernie Sanders pressed more moderate Democrats on a proposal to ban hydraulic fracturing. Sen. Elizabeth Warren called for weaning the nation off nuclear power, while former Vice President Joe Biden — while fielding criticism about his fundraising — cast his international experience as instrumental in getting the “rest of the world to come along” on climate.\n\n“I think I can do that better than anybody,” Biden said, “no matter what their plan.”\n\nFor months, Democratic candidates had released climate-related plans with common promises: Re-entering the Paris climate agreement, spending trillions of dollars on clean energy initiatives and achieving “net-zero” emissions by 2050 or earlier. Distinctions among their approaches appeared minute compared to the alternative — a president who denies climate science, suggested windmills cause cancer and called climate change a Chinese hoax.\n\nTypical of Democrats’ standard view of the field was former Senate Majority Leader Harry Reid who, when asked Wednesday if any plan stood out to him as uniquely strong, told reporters, “No, I think they’ve all been really within the framework of what I think would be important to help save our planet.”\n\nBut within hours of Reid giving that answer, the Democratic candidates were beginning to seek separation from one another on the issue.\n\nWarren called for spending $3 trillion over 10 years to advance clean-energy goals. Sen. Kamala Harris called for $10 trillion in public and private funding to create a clean energy economy by 2045, while South Bend, Ind., Mayor Pete Buttigieg proposed his own goal for net-zero emissions by 2050, including a call for economy-wide price on carbon.\n\n\"We have seen, I think, an arms race now, in a good way, of candidates competing to have the most effective plans,\" Washington Gov. Jay Inslee told CNN.\n\nBiden, as he has frequently as the party’s front-runner, was quickly put on the defensive, saying he was unaware that Andrew Goldman — the co-host of a fundraiser he is scheduled to attend Thursday — helped found a fossil fuel company.\n\n\"I didn't realize he does that. If you look at the SEC filings, he's not listed as an executive. That's what we look at, the SEC filings. Who are those executives? I kept that pledge. Period,\" Biden said. \"I’m going to look at what you just told me and figure out if that’s accurate.\"\n\nBiden said that his staff told him Goldman did not have any responsibility related to the company, was not on the board and he was not involved in its operations.\n\nBut he added if Goldman was in fact connected to the company, Western LNG, \"I will not in any way accept his help.\"\n\nIf the exchange made Biden uncomfortable, he did not appear to be alone. Harris skirted a question about nuclear power, while Julián Castro, a former Obama Cabinet secretary, was forced to answer for his support for hydraulic fracturing when he was mayor of San Antonio.\n\nAsked if he would ban fracking now, he said, “I support local communities and states that want to ban fracking. I have not called for an immediate ban on fracking. What I am doing is moving us away from fracking and natural gas and investing in … renewables to get us to net zero [carbon emissions] by 2045.”\n\nInslee himself, after dropping out of the presidential race last month, has become an unlikely prize for the remaining candidates to fight over. Despite his low polling position, Inslee had consumed much of the focus on climate change in the primary. And with his departure, the climate mantle has become more readily available to other, more viable candidates. Several candidates have called him in recent days, and his significance was evident Wednesday.\n\nWarren said she “proudly adopted” many of Inslee’s proposals. Castro, who this week released his own plan to achieve net-zero emissions by 2045, offered a “shout out” to Inslee for the work he did in his campaign, while Harris quoted him directly.\n\n“Governor Inslee, I’m stealing your line,” Harris said. “He said … ‘So, Donald Trump says wind turbines cause cancer.’ And Jay Inslee famously and … with great humor said, ‘No, they don’t cause cancer. They cause jobs.‘”\n\nInslee’s departure “does open the issue up a little bit more for the rest of them,” said Bill Carrick, a Democratic strategist. “There’s more room for them to get some attention for their positions.”\n\nEven from the sidelines of the forum, candidates were working to gain exposure on the issue. Tom Steyer, the billionaire megadonor and climate activist who was excluded from the forum because he did not meet the threshold for the next Democratic debate, chose Wednesday to release an analysis of his own climate plan, asserting it would create 46 million jobs over 10 years.\n\n“From my standpoint, what I’m saying is an order of magnitude different from what everybody else is saying,” Steyer told POLITICO of his approach to climate change. “What I’m saying is this is job one, and no one else is saying that … There’s no one else [in the primary field] who has a history of actual action on this of any kind.”\n\nThe one-upmanship on climate would have seemed improbable for an issue that long languished in the backwaters of American politics. And the political effect of their jockeying is unclear.\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nWhile Harris was on CNN on Wednesday, her state’s former governor, Jerry Brown, a longtime champion of policies to combat climate change, said climate change is now “more in the presidential debate than ever,” drawing increasing media attention in part because severe weather and in part because of “Trump going bonkers” on the issue.\n\nBrown, who ran unsuccessfully for president three times, said it would remain difficult for a Democratic presidential candidate to try to win an election solely on climate, an issue he said is “not like losing your job, or being denied treatment at a hospital, or being unable to find shelter.”\n\nHowever, he said, “I think the eloquence by which you can attack the Trump position, the plausibility and excitement with which you can lay out a green and sustainable agenda, all of that could serve a candidate very well. … I think there is an opportunity there, but it’s going to require incredible imagination and a certain boldness on the part of the candidate.”\n\nSo far, despite public interest in climate change, the issue has not appeared to produce movement in public opinion polls. Inslee languished in the presidential contest despite his singular focus on climate. And the results of a Morning Consult survey of voters who rank candidates’ climate plans as “very important” to them, released Wednesday, mirrored national polling generally: Biden is running first among such voters at 30 percent, followed by Warren and Sanders at 21 percent and 20 percent, respectively.\n\nBut with polls showing Democratic voters — and especially young Democratic voters — increasingly concerned about climate, the issue has gained voice this year. Following the CNN town hall, MSNBC will sponsor a two-day forum on climate later this month.\n\n“If you had asked me eight months ago, I think there was a lot of discussion of how we make climate change an issue in the campaign, and what do we need to do,” said Paul Getsos, national director of the Peoples Climate Movement.\n\nBut now, he said, “Climate is being discussed in a way. The question is, our work … is to move it beyond a talking point … We have to work to make sure that actual, concrete policies are implemented.”\n\nOne major reason climate activists had lobbied for a climate-specific presidential debate was to force candidates — in front of a large audience — to take positions on climate change that they could be held to if elected.\n\nThe forums are widely viewed by climate activists — and many candidates — as a lesser alternative to such a debate, which the Democratic National Committee has declined to sanction.\n\n“I think there is not a lot of earned trust for the Democratic Party from people who care about climate,” said Jonathan Lipman, a Democratic strategist who does communications work for several climate and social justice-focused groups.\n\nHowever, he said, “The candidates know that, which is why you’re seeing this bidding war today” of releasing increasingly robust climate plans. “That’s new. That’s a paradigm shift … That was the goal of forcing a debate: Don’t just say at a rally that you’re going to do something on climate change. What happens when you’re all pushing each other to be more specific? I think the town halls accomplish a lot of the same stuff.”\n\nGavin Bade contributed to this report.", "description": "In a marathon forum on climate change, Democratic contenders began to seek separation from one another on the key issue.", "authors": ["David Siders", "Zack Colman"], "top_image": "https://static.politico.com/47/98/c518b7fe42f99b21de7b07e9321a/190904-warren-cnn-ap-773.jpg"}