{"pub": "metro", "url": "https://metro.co.uk/2019/10/14/jeremy-renner-claims-ex-wife-bragged-bagging-avenger-bitter-custody-battle-rages-10919098", "downloaded_at": "2019-10-14 23:26:09.647929+00:00", "title": "Jeremy Renner accuses ex-wife of bragging about ‘bagging an Avenger’", "language": "en", "text": "Jeremy and Sonni share custody of their daughter Ava Pacheco (Picture: Getty)\n\nJeremy Renner has reportedly accused his ex-wife of bragging that she had ‘bagged an Avenger’ during their short-lived marriage, as their bitter custody battle rages on.\n\nThe Hawkeye star is currently locked in a nasty court case with his former wife Sonni Pacheco, over their six-year-old daughter Ava.\n\nIn court documents earlier obtained by TMZ, Sonni reportedly claimed Jeremy once ‘put a gun in his mouth and threatened to take his own life’.\n\nNow the publication reports that Jeremy, 48, has hit back in new legal documents and accuses Sonni of fabricating her allegations for money.\n\nJeremy is also said to have accused his former spouse of bragging to friends that she had ‘bagged an Avenger’, while also joking that she wanted to introduce her own pals to the Avengers cast so they could ‘bag’ one too.\n\nThe Hollywood star reportedly feels that Sonni made the strong allegations of emotional abuse to stir bad press while he was promoting movies.\n\nAdvertisement\n\nAdvertisement\n\nJeremy reportedly wants the court to limit the time Sonni spends with Ava until she receives treatment for what he alleges to be mental health issues, and until she can ‘overcome her overwhelming obsession with demonising’ him.\n\nJeremy reportedly wants his wife to have limited time with Ava (Picture: Getty Images)\n\nSlamming the allegations made in Sonni’s court documents, reps for Jeremy earlier told Metro.co.uk: ‘The well-being of his daughter Ava has always been and continues to be the primary focus for Jeremy.\n\n‘This is a matter for the court to decide. It’s important to note the dramatizations made in Sonni’s declaration are a one-sided account made with a specific goal in mind.’\n\nThe documents reportedly state: ‘Jeremy put a gun in his mouth, threatened to kill himself, and fired the gun into the ceiling while Ava was asleep in her bedroom.’\n\nJeremy and Sonni married in January 2014 but split in December after less than a year of marriage.\n\nThe former couple share custody of Ava but Sonni has requested a judge to implement supervised visits for Jeremy.\n\nJeremy has previously spoken of his joy at being a father and once told Playboy: ‘When it’s daddy and Ava time, that’s all I do.\n\n‘You’re talking to a guy who’s really happy in his f**king flip-flops right now with his little daughter in her pyjamas running around in the house, waiting for me.’\n\nAdvertisement\n\nAdvertisement\n\nMetro.co.uk have contacted Jeremy’s reps for comment.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Jeremy Renner ‘put gun in his mouth and threatened to kill himself’ according to ex-wife amid bitter custody battle\n\nMORE: Avengers’ Jeremy Renner ‘requests sole custody of daughter Ava’ amid court battle with ex-wife Sonni Pacheco", "description": "Jeremy Renner has reportedly accused his wife of making serious allegations against him for money in their custody battle.", "authors": ["Alicia Adejobi"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89903701_1571093913.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-14"}