{"pub": "reuters", "url": "https://reuters.com/article/us-unicredit-plan/italys-biggest-bank-wants-to-become-less-italian-idUSKBN1X01HD", "downloaded_at": "2019-10-21 15:09:13.289284+00:00", "title": "Italy's biggest bank wants to become less Italian", "language": "en", "text": "MILAN (Reuters) - The chief executive of UniCredit (CRDI.MI) has a plan to revive his company’s ailing share price - make it less Italian.\n\nFILE PHOTO: The UniCredit bank headquarters in Milan, Italy, March 27, 2017. REUTERS/Stefano Rellandini/File Photo\n\nItaly’s biggest bank is looking at whether it can distance itself from its home country’s stagnating economy and fractious politics by putting some of its most prized assets under one roof in Germany, people familiar with the matter said.\n\nJean Pierre Mustier will unveil on Dec. 3, as part of his new business plan, a scheme to set up a new sub-holding company in Germany to house the bank’s foreign operations, the sources said.\n\nBy keeping its assets in Germany, Austria, Eastern Europe and Turkey away from Italy, UniCredit could reduce their Italian identity - and associated credit rating - making their funding cheaper, the sources said.\n\nMustier, a Frenchman appointed in July 2016 to reinvigorate the then weakly capitalized Milanese bank, has sold businesses, cut jobs and shut branches to strengthen UniCredit’s balance sheet. Sources earlier this year said the bank had put on ice a possible bid for German rival Commerzbank (CBKG.DE).\n\nBut UniCredit, which describes itself as pan-European, operates in 14 countries and makes just over half of revenues outside Italy, is still essentially perceived by investors as a risky Italian institution.\n\nThe new plan is an indication of Mustier’s belief that the Italian economy is holding back UniCredit’s share price and risks pushing up the bank’s funding even more if the economic outlook deteriorates.\n\n“Who can say for sure that Italy’s debt won’t be downgraded to junk?” said one source, speaking on condition of anonymity and describing the corporate reorganization as an insurance policy if Italy’s economy continues to perform poorly.\n\n“The bank has to be ready for that kind of possibility,” the person said, noting Moody’s currently rates the euro zone’s third biggest economy - burdened with the second highest debt to GDP ratio in the single currency bloc - just one notch above non-investment grade. Germany has a triple-A rating with all major credit ratings agencies.\n\nSOVEREIGN DEBT PROXY\n\nItalian banks - which are struggling with bad loans, a sluggish economy and political instability - have traditionally been seen as a proxy for the country’s sovereign debt because they hold vast amounts of government bonds.\n\nUniCredit trades at 0.5 times book value, among the lowest levels in the industry, despite having a better than average return on equity. Its share price has fallen 30% since April last year, wiping out much of the rally it had after Mustier took charge.\n\nTo place a $3 billion, five-year bond in November last year, when a sell-off in Italian assets sent borrowing costs for the country’s banks soaring and shut all but the strongest names out of the funding market, UniCredit had to pay a steep 7.8% coupon.\n\n“UniCredit is by size one of Europe’s leading banking groups but, because of its Italian roots, investors associate it with the Italy risk to an extent which is in my opinion excessive given its geographical diversification,” Stefano Caselli, banking and finance professor at Milan’s Bocconi University.\n\n“It’s clear that UniCredit pays a price both in terms of regulatory capital and cost of funding for being Italian,” he said. “So a diversification strategy aimed at allowing the bank to link its cost of funding to the countries where it is present makes total sense.”\n\nSome other Italian companies with big foreign operations, including car maker Fiat Chrysler (FCHA.MI) and broadcaster Mediaset (MS.MI), have moved or are in the process of moving their legal headquarters to the Netherlands as part of a pivot away from Italy.\n\nThe European Central Bank would have to approve the plan to set up the holding company in Germany - where UniCredit already owns lender HVB - potentially taking at least a year, meaning the shift would not happen for sometime.\n\nCUTTING EXPOSURE\n\nMustier has repeatedly said that UniCredit will remain listed and headquartered in Milan and reiterated the bank’s commitment to its home country.\n\nBut since May he has steadily cut the bank’s exposure to Italy, including by selling its stake in online broker FinecoBank (FBK.MI) and announcing it would reduce its 55 billion euros ($61.37 billion) portfolio of Italian government bonds.\n\nThe bank is also considering cutting 10,000 jobs, or around 10% of its workforce, as part of the new 2020-2023 plan, almost all of them in Italy, sources said in July.\n\nSlideshow (3 Images)\n\nUniCredit has said any workforce reduction will be handled through early retirement.\n\nBut the planned cuts, together with a wider management reshuffle earlier this year, have helped to create a perception among some employees and rivals that the bank is less focused on its Italian operations.\n\n“You can tell that the Italian commercial business is not a priority for them, they are not aggressive, they are not chasing clients,” said the chief executive of another Italian bank.", "description": "The chief executive of UniCredit has a plan to revive his company's ailing share price - make it less Italian.", "authors": ["Silvia Aloisi", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191021&t=2&i=1443361828&w=1200&r=LYNXMPEF9K108", "published_at": "2019-10-21"}