{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/desperate-trapped-survivors-banged-wreckage-20441153", "downloaded_at": "2019-10-05 10:20:42.453995+00:00", "title": "Desperate trapped survivors 'banged on wreckage' after plane crash that killed five", "language": "en", "text": "The video will start in 8 Cancel\n\nClick to play Tap to play\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHorrific details have emerged of today’s air crash in Ukraine when a plane “ran out of fuel”.\n\nFive people were killed in the cargo aircraft and had their \"heads blown off”, according to a witness account.\n\nThe Ukraine Air Alliance plane is reported to have run out of fuel before a planned stopover at Lviv, en route from Vigo in Spain to Istanbul, Ukraine's Infrastructure Minister Vladislav Krikliy said.\n\nThree desperate survivors were banging on the fuselage after being trapped in the cargo section of the Antonov-12 plane which crashed approaching Lviv airport.\n\nLocal resident, Igor Sklyarevsky said: \"The plane scythed down trees like grass.\n\n(Image: VIA REUTERS)\n\n(Image: AFP via Getty Images)\n\n“The cockpit is trashed, and the crew's heads are blown off.\n\n“Body parts were scattered all over there.”\n\nThe wounded were “stuck in the cabin, knocking (on the fuselage) to save them.\"\n\nA rescuer said: \"People were knocking and moaning.\n\n“They were trapped by the cargo, badly wounded.\n\n(Image: MYKOLA TYS/EPA-EFE/REX)\n\n“There was blood everywhere, their bones were broken.\"\n\nTwo of the injured faced surgery and are now in intensive care.\n\nThose killed were named as chief pilot Vitaly Stepanenko, co-pilot Igor Maevsky, navigator Yury Kuzmenko, technician Igor Zavadyuk, and radio operator Vladimir Kirilenko.\n\nThe injured were listed as engineers Oleg Shakhov and Andrey Amelkin, along with technician Andrey Koryakin.\n\n(Image: AFP via Getty Images)\n\nReports said the plane - built in 1968 - ran out of fuel as it approached Lviv Airport.\n\nBut there are claims the aircraft may have been overloaded with an unspecified cargo.\n\nThere are also questions about the plane’s circuitous route from Spain to Istanbul yet aiming for a refuelling stop in Ukraine.", "description": "Desperate survivors banged on the fuselage after being trapped in the cargo section of the plane after the crash in Ukraine", "authors": ["Will Stewart", "Image", "Via Reuters", "Afp Via Getty Images", "Mykola Tys Epa-Efe Rex"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20446832.ece/ALTERNATES/s1200/0_Five-dead-as-An-12-military-aircraft-crash-landing-in-Lviv-region-Ukraine-04-Oct-2019.jpg", "published_at": "2019-10-04"}