{"pub": "theverge", "url": "https://theverge.com/2019/9/19/20874506/vape-flavored-ban-lung-disease-epidemic-regulations-effect", "downloaded_at": "2019-10-05 15:06:51.916251+00:00", "title": "Banning flavored vapes won’t stop deadly lung disease", "language": "en", "text": "As the number of respiratory illnesses linked to e-cigarettes continues to rise, lawmakers and governors in states across the country are pushing for regulations on the products — including bans on flavors and increased oversight of counterfeit cartridges. But well-intentioned as they may be, it’s not clear that the proposals are targeting the source of the problem, or what kind of public health benefits they’ll have in the future.\n\n“I think the best regulations are those that are informed by science. That isn’t the case here,” says Thomas Eissenberg, co-director of the Center for the Study of Tobacco Products at Virginia Commonwealth University.\n\n“the best regulations are those that are informed by science. That isn’t the case here.”\n\nBans on flavored e-cigarettes were the first to take hold: Michigan announced a ban in early September, though it hasn’t gone into effect, and New York state passed an immediate ban on all flavors but tobacco and menthol this week. Lawmakers in Washington, DC also proposed a flavored e-cigarette ban this week, while internationally, India announced a complete ban on all e-cigarettes. Those bans didn’t come out of nowhere — organizations like the American Academy of Pediatrics have long called for bans on flavored products. Items featuring sweet flavors are particularly attractive to adolescents and teenagers, and are thought to have contributed to the dramatic increase in e-cigarette and nicotine use in that age group. However, the flavors aren’t thought to be the cause of respiratory problems.\n\n“Hopefully, this will decrease the number of adolescents and young adults vaping,” says Laura Crotty Alexander, an associate professor of medicine studying e-cigarettes at the University of California at San Diego. “But does it have anything to do with vaping illnesses sweeping the nation? Nope.”\n\n“does it have anything to do with vaping illnesses sweeping the nation? Nope.”\n\nMany of the reported illnesses — but not all — have appeared in people using bootleg and illicit vaporizer pods containing THC, the psychoactive compound in marijuana. However, the illnesses and flavors are being conflated in conversations around legislation, says Michael Siegel, professor of community health sciences at the Boston University School of Public Health. “Either they’re conflating them unknowingly, or they’re taking advantage of this outbreak to get policies passed that they otherwise wouldn’t be able to,” he says.\n\nSiegel thinks California’s proposed e-cigarette policies, which direct regulators to crack down on counterfeit and illicit products, is more likely to prevent illnesses. “If you want to get to the bottom of the outbreak, you have to figure out how to stem the tide of illicit products on the market,” he says.\n\nBut because it’s still not clear what, exactly, is causing the illnesses, blocking black market or counterfeit products specifically still isn’t guaranteed to have an impact, Crotty Alexander says. Investigators are struggling to pin down a main culprit — a specific chemical or additive related to the illness. It’s very possible that more than one product is contributing to the outbreak, Crotty Alexander notes — people using e-cigarettes or vapes came down with respiratory illnesses before this current outbreak, so different cases could have been caused by different ingredients. That said, researchers are still on the lookout for what’s caused this particular rise in cases.\n\n“they can see the difference between a background slow burn and a spike.”\n\n“Because of the surge right now, it seems likely that a fair number of these cases are due to one thing in particular. The CDC has a lot of experience in these outbreak type situations —they can see the difference between a background slow burn and a spike. This is a spike,” Crotty Alexander says. “It suggests a different chemical has entered the market, or that a certain brand or e-liquid is more popular right now compared with a year ago.” But that brand isn’t necessarily a counterfeit product: vaping liquids, even those sold by major companies, contain thousands of chemicals, most of which haven’t been tested for safety. For that reason, she says, you could argue that there isn’t much difference between products considered counterfeit and those sold by companies.\n\nIf the illnesses are stemming from additives or chemicals also found in regular vaping products, cracking down on counterfeit or unregulated products would only help in the short term, Eissenberg says. “If, in the long term, the normal nicotine liquids also cause these illnesses, then we still have a problem.”\n\nWhile public health investigators continue to search for the source — or sources — of the illness that has sickened 530 people, the Centers for Disease Control and Prevention recommends that people “consider refraining from using e-cigarette or vaping products.”\n\nRegulators making decisions around vaping now are doing so with only limited information about the products and their health effects, because the research is still in early stages, Eissenberg says. “We need to jump-start the research necessary to guide regulation in the future,” he says. “I think a valuable side effect of a very unfortunate cluster of disease is that more attention and resources will be put behind the work.”", "description": "As the number of respiratory illnesses linked to e-cigarettes continues to rise, lawmakers and governors in states across the country are pushing for regulations on the products — including bans on flavors and increased oversight of counterfeit cartridges. But well-intentioned as they may be, it’s not clear that the proposals are targeting the source of the problem, or what kind of public health benefits they’ll have in the future.", "authors": ["Nicole Wetsman", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/9OqQmZiEMp9n6QOOU663XgiAGNw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19205217/acastro_190916_1777_vape_0001.0.jpg", "published_at": "2019-09-19"}