{"pub": "yahoo", "url": "https://finance.yahoo.com/news/7-dividend-stocks-buy-brands-183035431.html", "downloaded_at": "2019-10-16 23:23:38.732289+00:00", "title": "7 Dividend Stocks to Buy (With Brands You Can Find In Your Kitchen)", "language": "en", "text": "As time passes, fewer investors are familiar with Peter Lynch. That’s a shame. The famous former Fidelity fund manager delivered astounding returns for more than a decade in the 1970s and 1980s — 29.2% per year annualized — and wrote popular investing books describing his philosophy.\n\nPut very simply, Lynch is best known for the idea of looking for investments in stuff that you know. If you work in a specific industry, you likely have knowledge that most general market participants don’t. Similarly, you may know more about local companies, banks, etc. in your city than the market as a whole. And in everyday life, there are plenty of things you can invest in as well.\n\nIn fact, looking around your house, you can probably find items made from dozens of different publicly listed companies. Some of these may be big-ticket items such as your A.O. Smith (NYSE:AOS) water heater or your Whirlpool (NYSE:WHR) fridge. But there’s plenty of money to be made in small repeat purchases as well.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThe foods, drinks, spices, cleaning supplies and so on that are in your kitchen right now have historically been some of the stock market’s all-time best performers. Coca-Cola (NYSE:KO), for example, has been so spectacularly successful that it helped make Atlanta a larger and more prosperous city than its regional rivals. When a soft drink formula can literally change an area’s financial outlook, you realize that you shouldn’t overlook the vast profit potential of everyday items.\n\nWith that in mind, it’s worth taking a look at these seven dividend-paying stocks that make items that you can find in the average American kitchen.\n\nSource: suriyachan / Shutterstock.com\n\nDividend Yield: 2.8%\n\nFirst off, let’s start with a double-threat. PepsiCo (NYSE:PEP) is, as most of us are aware, Coca-Cola’s leading rival; however, it’s a more attractive business than Coca-Cola at this point because of its other business.\n\nSpecifically PepsiCo also owns Frito Lay, the dominant player in chips and snack foods. Counting brands like Doritos, Fritos and Cheetos, PEP has a place in most people’s pantries, even if you don’t drink Pepsi.\n\nFolks have heard they should take in fewer sodas and eat less junk food. However, so far, consumption patterns haven’t changed much. People like their little indulgences. That said, soda taxes are a concern, which makes PepsiCo’s diversified revenue stream a safer bet than Coca-Cola over the long haul.\n\nAt 23x forward earnings, PEP stock isn’t especially cheap, but it’s a reasonable price for a company with great brands and a solid 2.8% dividend yield.\n\nSource: Mike Mozart via Flickr (Modified)\n\nDividend Yield: 2.1%\n\nIf you’re like many Americans, you probably associate Hormel Foods (NYSE:HRL) with its iconic SPAM brand. That’s understandable, the company has sold this product for so long that it has its own museum now. Even there, the company continues to innovate. For example, I just bought some of the company’s new Pumpkin Spice SPAM and can’t wait to try it. Still, I can’t blame you for potentially wanting to pass on a maker of canned meat.\n\nBut there’s far more to the business than SPAM. Hormel is now No. 1 or No. 2 in more than 40 different grocery store items, ranging from its traditional strengths like bacon, turkey, canned chili and deli meats to a variety of more millennial-focused items. These include almond and other nut butters, ready-to-eat guacamole, free-range pesticide-free deli meat, imported Mexican salsas and other trendier items.\n\nStory continues\n\nHormel has reported strong organic growth in its existing brands for years now, even as many of its packaged foods rivals have struggled immensely. That’s because Hormel dominates niches, like guacamole, rather than being one of a “zillion” cereals, yogurts or ketchups, for example, competing for shelf space and consumer attention.\n\nHRL stock is also an appealing investment for the same reason its products are great in your pantry: they’re built to last. Things like canned chili and SPAM are good to have around during storms and natural disasters. HRL stock is good to have in an economic disaster.\n\nThe company has no debt, making its balance sheet rock solid. And it has paid an increasing annual dividend for more than 50 consecutive years; rain or shine, Hormel will pay you more money every year to keep owning its stock. Shares are down slightly in recent months on fears that the swine fever in Asia will cause higher pork prices. That may be true for a quarter or two; long-term, however, Hormel will continue to make its loyal shareholders tons of money.\n\n\n\n\n\nHershey (HSY)\n\nHershey (HSY) dividend stocks to buy More\n\nSource: mhiguera via Flickr\n\nDividend Yield: 2%\n\nIf I had a dollar for every time someone told me Hershey (NYSE:HSY) stock was too expensive, I could buy a ton of chocolate. Thankfully, I bought a healthy portion of HSY stock years ago, and with the dividend, I also can buy many Hershey products for my family.\n\nHershey stock is up 44% so far in 2019, leading people to say that Hershey is a great company but it’s simply overpriced. In the short-run, that may be true. At 25x earnings, the stock is significantly above its historical median of around 21x. Given its high short-term valuation and big gains already in 2019, don’t expect miracles from HSY stock over the next three or six months.\n\nIf you’re willing to hold for a few years, however, you should expect Hershey stock to proceed much higher. Why’s that? The company has a dominant position in a high profit-margin, recession resistant market. There’s only Hershey (44%) and Mars (30%) on a national scale, with no other chocolate producer making up more than 10% of the market. As a result, Hershey and Mars can keep prices high because few people like store brand chocolate.\n\nAlso, chocolate sales tend to be recession resistant, meaning that earnings and dividends remain strong even during economic downturns.\n\n\n\n\n\nBrown-Forman (BF.A) (BF.B)\n\nBrown-Forman (BF.A) (BF.B) dividend stocks to buy More\n\nSource: Shutterstock\n\nDividend Yield: 1.1%\n\nOur next two picks are recent portfolio additions of Terry Smith. Smith, for those unfamiliar, is the manager of Fundsmith, Britain’s largest mutual fund. Fundsmith has gained 17% per year — or 269% total — since the fund launched in 2010, absolutely smashing the fund’s benchmark, which is up 128% over the same stretch.\n\nSmith’s basic philosophy is simple: Buy great companies at a fair price, and then do nothing. As long as the companies continue to deliver returns, once you get in at a reasonable valuation, he wants to hold on forever. Between his simple philosophy and breathtaking returns, it’s no wonder that he is often called the British Warren Buffett.\n\nWhat food and beverage items is Smith buying lately? First up is Brown-Forman (NYSE:BF.A) (NYSE:BF.B), the maker of Jack Daniels whisky, along with a variety of other spirits and liquors. Over the past 50 years or so, the Brown family has transformed Jack Daniels from a small regional whiskey to an international powerhouse. The company is now repeating its success with other brands such as its fast-growing tequila business.\n\nBrown-Forman is undoubtedly a great business. But with BF stock near all-time highs, is it still a great buy? Smith thinks so. He established his stake this summer. Despite trading near 30x earnings, you can still make a case for investing in BF stock at these prices. The company has historically grown both earnings and its dividend more than 10% per year; there has been no slowdown in results more recently either. The company’s balance sheet is strong, insulating it from downturns.\n\nAnd even within the highly profitable liquor space, Brown-Forman’s profit margins are exceptionally high. BF stock represents a low-risk steadily growing business with an unimpeachable brand in Jack Daniels. And if you like whiskey or tequila, the dividends can help defray the cost of that item from your budget.\n\nMcCormick (MKC)\n\nMcCormick (MKC) dividend stocks to buy More\n\nSource: Blue Genie via Flickr\n\nDividend Yield: 1.4%\n\nTerry Smith’s other recent purchase is also likely to show up in your kitchen. That’s because Smith picked up stock in McCormick (NYSE:MKC), the famous spices and seasonings leader. Between McCormick’s brand seasonings and its private label business, the company controls well over half the total market in America and has strong position in international geographies such as Mexico as well.\n\nMcCormick, like Hershey, perpetually seems expensive on a price-to-earnings basis, as it generally trades around 25x earnings. Throughout the 1990s, for example, it never dropped under 20x earnings even once. Good luck trying to buy it cheaper than the S&P 500 on valuation. That said, McCormick has continued to post double-digit total returns for decades now and has hiked its dividend every year for decades making it a Dividend Aristocrat.\n\nHow can McCormick reliably put so much more money in your pocket every year? Simply put, spices are a great business. They are cheap relative to the cost of making a meal, and you don’t buy them too frequently. When the price of oregano goes up from $2.69 to $2.89, who is going to complain or switch to a different product? Additionally, McCormick is a dominant player in food service — when you get some specific menu item at a chain restaurant, for example, there’s a great chance McCormick provided the flavoring to give it its distinct taste and smell. McCormick has a large R&D team devoted to cooking up specific flavor pairings such as, say, mango chipotle, that inevitably end up on menus around the country.\n\nWhat attracted Smith to McCormick stock recently, after it had already appreciated significantly? Probably McCormick’s recent purchase of the French’s and Frank’s brands. Frank’s Red Hot sauce in particular is booming, but it had been owned by absentee foreigners who weren’t marketing it effectively in the U.S. Under McCormick’s ownership, sales are surging, leading overall earnings growth to accelerate sharply.\n\n\n\n\n\nMolson Coors (TAP)\n\nMolson Coors (TAP) dividend stocks to buy More\n\nSource: Drew Stephens via Flickr\n\nDividend Yield: 4.1%\n\nIf you’re a beer person, this one is for you. Molson Coors (NYSE:TAP), unlike many on this list, has not performed great in recent years. In fact, the stock is down more than 40% from its historic highs. It’s not hard to see why people are nervous; there has been a significant shift toward craft beer, and people have assumed that the macro brewers like Molson Coors will suffer greatly under this shift.\n\nIt’s simply not so, however. Craft beer makes up just 13% of the U.S. market, and its market share growth has slowed dramatically over the past year or two. Craft beer is a great product, and it has certainly disrupted the market. But it’s not going to put the macro beers out of business; there’s still plenty of value in brands, marketing and macro’s much lower prices. Particularly in a recession, it will be hard for many people to justify drinking craft all the time.\n\nAlso, Molson Coors has a few irons in the fire as far as craft goes. For folks that don’t want to drink the company’s namesake brands, they have other brands such as Blue Moon as well. Sure, some beer snobs will turn up their nose at even “major” craft brands like Blue Moon or Sam Adams (NYSE:SAM). But in general, running a brewery is a hard business, and the majority of the nation’s beer will still come from major corporate enterprises one way or another. And Molson Coors will benefit as it does.\n\nWhy buy TAP stock now? For one thing, based on its steady operating results, the company just hiked its dividend by 40% and now pays a dividend yield of more than 4% annually. Management didn’t get the memo that craft killed their business, apparently. The stock is also selling for just over 10x earnings. That’s crazy cheap for a brewer; normally beer and liquor businesses sell at a major premium to the market, not a discount. As people realize that Molson Coor’s profits and cash flow remain steady, shares will get bid up sharply. In the meantime, enjoy the big dividend.\n\n\n\n\n\nColgate-Palmolive (CL)\n\nColgate-Palmolive (CL) dividend stocks to buy More\n\nSource: Shutterstock\n\nDividend Yield: 2.5%\n\nFinally, while you might not find this brand in your kitchen, after all that eating and drinking, you probably want to brush your teeth. Colgate-Palmolive (NYSE:CL) is the maker of the famous toothpaste brand Colgate, along with a variety of other hygiene products and cleaning supplies.\n\nCL stock has had a disappointing run over the past five years; shares have traded basically flat. Over that time, however, shares went from expensive to reasonably priced, as earnings have climbed nicely in the interim.\n\nThe company has faced some setbacks over that stretch. The collapse of the Venezuelan economy cost Colgate one of its better international markets. And its Hill’s pet food acquisition has taken longer to pay off than expected. Despite these setbacks, Colgate has managed to grow earnings without the share price going up … yet. That could change as investors look to pick up more solid defensive dividend stocks in the coming months.\n\nAt the time of this writing, Ian Bezek owned TAP, MKC, HSY, AOS, BF.B, BF.A, and HRL stock. You can reach him on Twitter at @irbezek.\n\nMore From InvestorPlace\n\nThe post 7 Dividend Stocks to Buy (With Brands You Can Find In Your Kitchen) appeared first on InvestorPlace.", "description": "As time passes, fewer investors are familiar with Peter Lynch. That's a shame. The famous former Fidelity fund manager delivered astounding returns for more than a decade in the 1970s and 1980s -- 29.2% per year annualized -- and wrote popular investing books describing his philosophy.Put very simply", "authors": ["Ian Bezek"], "top_image": "https://s.yimg.com/uu/api/res/1.2/gu4IiXSrWPBUPXGHGtAJvw--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/aeea52eca65af4b93e53e721c272b84d", "published_at": "2019-10-15"}