{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/oct/02/us-attorney-general-william-barr-met-italian-officials-to-discuss-russiagate", "downloaded_at": "2019-10-02 15:27:52.946423+00:00", "published_at": "2019-10-02", "title": "US attorney general 'met Italian officials to discuss Russiagate'", "language": "en", "text": "The US attorney general, William Barr, held at least two meetings with Italian intelligence officials in Rome on Friday as he seeks to trace the origins of the FBI’s investigation into Russia’s alleged collusion in Donald Trump’s 2016 presidential election campaign, Italian media reported.\n\nBarr and US attorney John Durham met the officials after getting authorisation from the Italian prime minister, Giuseppe Conte, the Corriere della Sera reported.\n\nThe scope of Barr’s investigation in Rome was to find out whether Italy had played a role in the so-called Russiagate affair, whether secret documents had been obtained and, in particular, to collate information on Joseph Mifsud, a Maltese professor who allegedly told Trump’s former campaign aide George Papadopoulos in 2016 that the Kremlin was in possession of thousands of emails that revealed “dirt” about Hillary Clinton that could help Trump’s campaign.\n\nWilliam Barr discussed FBI Russia inquiry with UK intelligence Read more\n\nPapadopoulos later served a jail sentence for lying to the FBI about the claims that Mifsud, who has been missing since October 2017, was the source of his information on Russia. Papadopoulos also said, without evidence, that Mifsud was an agent of the Italian secret service who had sought to entrap him. Barr was reportedly also trying to find out whether Italian secret service agents had helped Mifsud to find a safe hiding place.\n\nThe Mueller report said Mifsud had “connections to Russia” and former FBI chief James Comey has called him a “Russian agent”. Mifsud flew to Moscow in April 2016 and held talks with senior Russian politicians and officials. On his return to London, he had breakfast with Papadapoulos, Trump’s foreign policy aide. According to Mueller, Mifsud said the Kremlin was sitting on “thousands of emails” hacked from the Democratic party, which could damage Hillary Clinton. At the time, the Democrats were unaware their servers had been breached. Russian GRU military intelligence was behind the hack, Mueller found.\n\nBarr’s latest trip to Rome comes two months after he met UK intelligence agencies in London to discuss Britain potentially cooperating with Trump’s administration on the inquiry examining the FBI’s investigation into the alleged collusion with Russia, sources told the Guardian. Corriere reported that Barr first came to Rome in mid-August, when he met Gennaro Vecchione, the director general of the security intelligence department (DIS).\n\nDuring the latest visit he met Vecchione again, before meeting Luciano Carta, the chief of the external intelligence and security agency (AISE) and his counterpart, Mario Parente, at the internal intelligence and security agency (AISI). Corriere said the meetings were held at the DIS headquarters in Rome, although other sources claim they took place at the office of the American embassy.\n\nThe embassy was unable to confirm whether the meeting was held in its offices at Palazzo Margherita, but a justice department spokesperson, Kerri Kupec, confirmed on Monday that a team led by Durham was gathering information from several foreign countries.\n\n“As the Department of Justice has previously announced, a team led by US attorney John Durham is investigating the origins of the US counter-intelligence probe of the Trump 2016 presidential campaign,” Kupec said. “Mr Durham is gathering information from numerous sources, including a number of foreign countries. At attorney general Barr’s request, the president has contacted other countries to ask them to introduce the attorney general and Mr Durham to appropriate officials.”\n\nThe Daily Beast reported on Wednesday that Barr and Durham met Italian agents at the US embassy in Rome, where they were shown evidence that Italy had on Mifsud, including a tape he handed over to the authorities when he applied for police protection after disappearing in October 2017. On the tape, he reportedly explained why he might be in danger.\n\nItaly’s ministry of justice would not immediately confirm whether its officials were also involved in the Rome meetings.\n\nThe news of Barr’s latest visit emerged as the US secretary of state, Mike Pompeo, began a three-day visit to Italy on Tuesday. Pompeo has met Conte and the president, Sergio Mattarella, and will also be visiting his ancestral home in the Abruzzo region.\n\nBarr is reportedly pressing a range of foreign powers to cooperate with his effort to piece together the origins of the FBI investigation into the Trump campaign’s links with Russia.\n\nBarr’s critics claim he is seeking to discredit the FBI investigation by constructing a vast conspiracy theory that foreign powers were working to secure Hillary Clinton’s election in 2016.\n\nThe inquiry by the special counsel Robert Mueller showed that Russia was attempting to swing the presidential election in favour of Trump. “The FBI and other US agencies concluded that Russian interference in the 2016 election was ‘sweeping and systematic’,” it said.\n\nMike Pompeo admits he took part in Trump’s phone call with Ukraine leader Read more\n\nBarr’s counter-attack has been given an added urgency as Trump seeks to find a way to block potential impeachment hearings. The president is facing claims he threatened to withdraw military aid from Ukraine unless it cooperated with his efforts to find dirt on the former US vice-president Joe Biden, a potential challenger in the 2020 presidential election.\n\nBefore vanishing, Mifsud denied any wrongdoing but said he had helped to connect Papadopolous with Russian officials.\n\nItalian newspapers reported earlier this year that for seven months after his disappearance, Mifsud had been staying in an apartment in Rome that was allegedly rented out by Link Campus University, where Mifsud had taught. At the time, the university denied any knowledge of Mifsud’s whereabouts. Link Campus University is where the Five Star Movement, which is ruling in coalition with the centre-left Democratic party, introduced its manifesto and recruited two of its ministers.", "description": "William Barr reportedly seeking foreign help to investigate origins of FBI inquiry into Trump", "authors": ["Angela Giuffrida"], "top_image": "https://i.guim.co.uk/img/media/43a84384585d87da4cd135f9aaf2de3766085ec8/0_4_2124_1274/master/2124.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2cd90b3abd6ef60f4a8b40afcd2d6ae9"}