{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/thomas-cook-rescue-deal-fosun-banks-creditors-holidays-cancelled-labour-a9115096.html", "downloaded_at": "2019-09-22 00:30:45.152645+00:00", "title": "Thomas Cook set for last-ditch rescue talks today as MPs urge ministers to step in", "language": "en", "text": "Britain’s original package-holiday company will begin the most critical negotiations in its 178-year history at 9am on Sunday morning.\n\nThomas Cook, which is heavily in debt and seeking refinancing, will meet its lenders and the Chinese conglomerate, Fosun, at the City law firm Slaughter & May.\n\nA consortium of banks, led by RBS, had agreed to pump £450m into the ailing travel firm, in a debt-for-equity swap that would see them take a 75 per cent stake in Thomas Cook Airlines.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe remaining 25 per cent would go to Fosun, which is the largest shareholder in Thomas Cook with 18 per cent of the equity.\n\nFosun would pay in a further £450m and take 75 per cent of the rest of the business.\n\nShape Created with Sketch. Airlines that went bust Show all 7 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Airlines that went bust 1/7 Air Berlin Air Berlin, which operated flights to and from Berlin Tegel, went bankrupt in 2017 Getty 2/7 Small Planet Lithuanian airline Small Planet filed for insolvency at the end of 2018 Igor Dvurekov 3/7 VLM Antwerp-based VLM went bankrupt in September 2018 Flo Weiss 4/7 Germania German airline Germania filed for insolvency in February 2019 Getty 5/7 Cobalt Cobalt, based in Larnaca, Cyprus, stopped flying in October 2018 Steve Lynes 6/7 WOW Air Icelandic Wow Air ceased operation in March 2019 Getty 7/7 Primera Primera, known for its cheap transatlantic fares, went bust in October 2018 Getty 1/7 Air Berlin Air Berlin, which operated flights to and from Berlin Tegel, went bankrupt in 2017 Getty 2/7 Small Planet Lithuanian airline Small Planet filed for insolvency at the end of 2018 Igor Dvurekov 3/7 VLM Antwerp-based VLM went bankrupt in September 2018 Flo Weiss 4/7 Germania German airline Germania filed for insolvency in February 2019 Getty 5/7 Cobalt Cobalt, based in Larnaca, Cyprus, stopped flying in October 2018 Steve Lynes 6/7 WOW Air Icelandic Wow Air ceased operation in March 2019 Getty 7/7 Primera Primera, known for its cheap transatlantic fares, went bust in October 2018 Getty\n\nBut the banks are now demanding that Thomas Cook arrange an extra £200m financing facility to see the firm through what is expected to be an extremely tough winter for the UK travel industry.\n\nIf the deal falls apart, Thomas Cook could fail within days, requiring 150,000 British holidaymakers to be repatriated.\n\nThe Transport Salaried Staffs Association (TSSA), which represents a number of head-office and travel agency staff at the company, has written to the business secretary, Andrea Leadsom, demanded an urgent meeting with about the rescue.\n\nThe general secretary, Manuel Cortes, said: “It is incumbent upon the government to act if required and save this iconic cornerstone of the British high street and the thousands of jobs that go with it.\n\n“Thomas Cook can be a highly successful business and must be given every opportunity to flourish.\n\n“No British government in its right mind would countenance the loss of so many jobs and the prospect of just one major travel operator – TUI – controlling the mass market.” The shadow business secretary, Rebecca Long Bailey, said: “This is yet more evidence of this Government’s indifference to British jobs and businesses going under.\n\n“All viable options must be explored by Thomas Cook and the government must consider stepping in and taking an equity stake to avoid this crisis.”\n\nThomas Cook was nationalised between 1948 and 1972.", "description": "Britain’s original package-holiday company will begin the most critical negotiations in its 178-year history at 9am on Sunday morning. Thomas Cook, which is heavily in debt and seeking refinancing, will meet its lenders and the Chinese conglomerate, Fosun, at the City law firm Slaughter & May.", "authors": ["Simon Calder"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/05/20/17/thomascook.jpg", "published_at": "2019-09-22"}