{"pub": "news24", "url": "https://parent24.com/Fertility/Trying_to_conceive/plot-twist-when-trying-to-conceive-dads-age-matters-too-20190416", "downloaded_at": "2019-10-05 11:35:45.979061+00:00", "title": "Plot twist: When trying to conceive, dad's age matters too", "language": "en", "text": "Plot twist: When trying to conceive, dad's age matters too\n\nIt’s not just women who need to consider their age when planning a family. Studies reveal that men show a 50% lower chance of conceiving after a year of trying at age 35, compared with men younger than 25. Plus, older age in fathers is linked with a variety of health conditions affecting their offspring.\n\nMom's age and fertility and the neurodevelopmental and mental health of her baby are thought to all be linked. But studies are revealing that dad's age matters too when trying to conceive. Sarah Robertson from the University of Adelaide looks into why men should consider their age too when it comes to starting a family.\n\nAlso read: When is the best time for you to have a baby? Well, your body says before 35\n\n\n\nWomen are regularly reminded of their ticking biological clock. It turns out men should also pay attention to age when it comes to having a family.\n\n\n\nA new study published today in the British Medical Journal provides persuasive evidence that children – and pregnant moms – are more likely to have health problems when dads are older.\n\nMen’s fertility declines with age, but not as sharply as women’s. Men can continue to father children into later life – as Mick Jagger and other celebrity fathers demonstrate.\n\nBut it takes longer to get pregnant. One study in European men showed a 50% lower chance of conceiving after a year of trying at age 35, compared with men younger than 25.\n\nPlus, women with partners age 35 and older may be more likely to experience miscarriage than those with younger partners.\n\nRead more: Most men don't realise age is a factor in their fertility too\n\nHigher odds of premature birth\n\nThe latest study shows that the chances of pregnancy and birth problems are also increased when dads are older.\n\nResearchers at Stanford University in California analysed data on all 40 million live births in the United States between 2007 and 2016 to look at how paternal age affects outcomes for the infant and the mother.\n\nAs the father’s age increased, so did the chances of the infant being born prematurely, having a low birth weight, or requiring medical intervention after delivery, such as assisted ventilation, admission to neonatal intensive care, or antibiotics.\n\nWhen fathers were aged 45 years or more, their children had 14% higher odds of being born premature (less than 37 weeks) and their babies had a 14% greater risk of low birth weight (less than 2.5kg) than when fathers were aged 25 to 34 years.\n\nInfants with fathers aged 45 years or more were also 14% more likely to be admitted to a neonatal intensive care unit, and 18% more likely to have seizures.\n\nIf the father was 55 years or older, newborns also tended to score less well on the Apgar test used to assess the health of a child at birth.\n\nThese effects were present after adjusting for the mother’s age, smoking, race, education, and number of prenatal visits.\n\nAlso read: Trying to conceive? Here's the one thing you probably didn't think to check\n\n\n\nFuture risk of disease\n\nThese latest findings add to earlier studies showing older age in fathers is linked with a variety of health conditions affecting the offspring.\n\nScientists in Denmark have calculated the chances of congenital problems linked to older fatherhood and show that several conditions become more prevalent. These include rare developmental conditions such as achondroplasia (dwarfism) and cleft palate.\n\nCancer rates among offspring also seem to rise as dads become older.\n\nRead more: Why men need to think about their fertility too\n\nArguably the most concerning impact is on neurodevelopment and mental health. Offspring of older fathers have an increased risk of schizophrenia, mental retardation, and autism spectrum disorders.\n\nThe risk of schizophrenia increases by 47% when fathers are over 45 years old.\n\nThe rate of childhood autism increases by 80% when dads conceive after age 45.\n\nSign up for the Conversation newsletter:\n\nSign up to Thrive, a weekly dose of evidence to help you live well.\n\nSo what’s going on?\n\nChanges in the sperm of older men are likely to contribute. The number of defective sperm containing DNA mutations increase steadily every year as men age. These arise as exposure to radiation, environmental toxins, alcohol and smoking take their toll.\n\nAgeing itself results in less testosterone and a decline in the number and function of testicular cells.\n\nHowever, genetics isn’t the full explanation. In particular, increased risk of psychiatric illness doesn’t seem to be due to spontaneous mutations in sperm DNA. While mutations contribute, they account for only about 10% to 20% of the effect.\n\nAnother possibility is that genetic risk factors naturally more prevalent in men destined to be older fathers might be passed on to their offspring, rather than new mutations.\n\nAlso read: Male infertility, an open letter: \"I had to make my peace with it but it hurts\"\n\n\n\nMothers also at risk\n\nThe latest data showed negative effects of delayed fatherhood not just for the infants, but also the pregnant mothers.\n\nThe risk of gestational diabetes for pregnant women increased in line with the age of the father, with women carrying the child of a man aged 55 years or older having a 34% higher odds of gestational diabetes.\n\nThe researchers estimate that around 13% of premature births and 18% of gestational diabetes in pregnancies associated with older fathers were attributable to the advanced age of the father.\n\nRead more: What's the point of sex? It's communication at a biological level\n\nThis is hard to reconcile with a genetic explanation. Other biological effects of seminal fluid on pregnancy health may be to blame.\n\nThe female immune system responds to seminal fluid by generating immune tolerance, which protects against inflammatory exposures that can harm the fetus. Human seminal fluid contains signals known to stimulate the female immune response, but it’s not yet proven whether these factors decline as men age.\n\nWhat does this all mean for men contemplating fatherhood?\n\nMost older dads don’t have fertility problems and can father babies without serious physical or developmental problems.\n\nOverall, the father’s age is substantially less important than the mother’s age, and generally the pregnancy disorders and infant health problems are rare. So the current research evidence doesn’t justify dissuading older men from becoming fathers.\n\nBut the medical community must do a better job of communicating to couples an understanding of the risks of advanced paternal age.\n\nMost importantly, we must include men in conversations about pregnancy planning and preconception care, to ensure all couples have the best chance of raising a healthy child.\n\nSarah Robertson, Professor and Director, Robinson Research Institute, University of Adelaide\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.\n\nChat back:\n\nDid you and your partner struggle to conceive at first? What eventually worked for you? Tell us your story and we may publish it. Do let us know if you'd like to remain anonymous.\n\nAlso read:", "description": "It’s not just women who need to consider their age when planning a family. Studies reveal that men show a 50% lower chance of conceiving after a year of trying at age 35, compared with men younger than 25. Plus, older age in fathers is linked with a variety of health conditions affecting their offspring.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8949/4e8a8e07ddb7476f8c137e183295e7e8.jpg", "published_at": "2019-04-16"}