{"pub": "zdnet", "url": "https://www.zdnet.com/article/10-technologies-most-likely-to-help-save-planet-earth", "downloaded_at": "2019-09-13 11:09:54.627855+00:00", "title": "These 10 technologies are most likely to help save planet Earth", "language": "en", "text": "Huge asteroid to fly by Earth closer than most satellites do on Friday the 13th 2029 Tonya Hall talks to Brent Barbee, aerospace engineer at NASA, to talk about a hypothetical asteroid encounter marshaling a 21st century planetary defense to the rescue.\n\nThe planet is in jeopardy. Humans are both causing and contending with deforestation, ocean acidification, and climbing temperatures, to name a few of our less-than-benign legacies.\n\nThe facts are complex but the trends aren't easily disputed. And yet, the topic of global peril is an ire-raising one these days, liable as not to put a reader into a defensive crouch. Perhaps it's because we're thrummed over the head with the worst of it all and rarely allowed to revel in solutions.\n\nLess controversial, therefore, maybe the idea that technology has a role to play in making our planet a more comfortable and sustainable place for humans to continue plodding along. Living up to the lofty title of this piece with a definitive list of 10 technologies that will help our planet survive is probably a losing proposition. You're likely as not to take issue with some aspect of this list. That's OK. It's what the comments section is for; I'd love to hear from you.\n\nIt's also worth noting that some of these technologies come with risks of their own. In fact, our number one best bet to help our planet could also spell doom for our species.\n\nBut, as I look at the threat landscape, as well as the tools under development to help, some optimism can't help but creep in. Here are my picks for 10 technologies most likely to help save the Earth.\n\n10. Solar glass\n\nWhat if every window in a skyscraper could generate energy? That's the promise of solar glass, an emerging technology that's getting a lot of buzz in design and sustainability circles. Just like it sounds, solar glass is suitably transparent window material but also captures the sun's energy and converts it into electricity.\n\nThe big hurdle has been efficiency. High-performance solar cells can achieve 25% efficiency or greater, but maintaining transparency means sacrificing the efficiency with which light is converted into electricity. But a University of Michigan team is developing a solar glass product that offers 15% efficiency and climbing while letting a full 50% of light pass through. According to projections from nearby Michigan State, 5 to 7 billion square meters of usable window space exists, enough to power a full 40% of US energy needs with a solar glass product.\n\n9. Graphene\n\nStronger than steel, thinner than paper, more conductive than copper, graphene is truly a miracle material—and until recently a completely theoretical one. Graphene is an ultra-thin layer of graphite that was first discovered in 2004 at the University of Manchester. It is now the subject of intense research and speculation, with many predicting it will be next in line after bronze, iron, steel, and silicon in promulgating the cultural and technological evolution of our species.\n\nA mere one-atom thick, graphene is flexible, transparent, and highly conductive, making it suitable to a huge range of planet-healing applications. These include water filtration, superconductors capable of transferring energy across vast distances with minimal loss, and photovoltaic uses, to name a few. By vastly increasing efficiencies over current materials, graphene may prove to be a cornerstone in our green rebirth.\n\n8. Plant-based plastic\n\nWe have to put an end to single-use plastics. Initiatives are already underway across the U.S. to ban or severely limit their use. Where I live, in LA, plastic straws are only given out upon request and single-use plastic bags have disappeared from grocery stores. But the problem is deep-rooted and deeply ingrained in our consumption economy. I live near the ocean, and the quantity of plastic debris that's visible on an average day is devastating.\n\nPlant-based plastics that biodegrade are one palatable solution, as they could, in theory, replace many of the plastic products already in circulation. An Indonesian company called Avani Eco has been making bio-plastic out of cassava since 2014. Like fake meat and solar glass, this should become a booming sector in the years ahead. But beware: Not all bioplastics biodegrade, and the merit of some production techniques is debated. Part of becoming a responsible consumer in the next decade will be knowing the life cycle of the products we choose to buy, from creation to entropy.\n\n7. Fake meat\n\nDear carnivores, I have good news and bad news. First the bad: Meat production is absolutely atrocious for the planet. In 2017, more than 15,000 world scientists signed a Warning to Humanity calling for, among other things, drastically diminishing our per capita consumption of meat. One issue is land use. The production of beef relies on 164 square meters of grazing land per 100 grams of meat and is one of the major causes of deforestation in Central and South America, leading to unprecedented carbon release into the atmosphere. The Food and Agriculture Organization believes livestock accounts for about 14.5% of anthropogenic greenhouse gas emissions. Animals also use huge amounts of freshwater while the contaminated runoff from industrial livestock operations pollutes local waterways.\n\nThe good news? Fake meat is finally good. Really good. Companies like Beyond Meat and Impossible Foods are delivering delicious alternatives to meat that stand as pretty decent substitutes for the real thing. As much as the technological achievement and advanced food science, the real triumph of these companies is that they've made fake meat culturally hip. You can now order meatless burgers at Burger King and get a meat-free taco at Del Taco.\n\n(Image: Getty Images/iStockphoto)\n\n6. Batteries\n\nPower is the limiting factor holding back a lot of green technologies. Wind and solar, for example, are capable of generating vast amounts of electricity, but adoption of the technologies has been throttled by a major shortcoming: Sometimes it isn't windy or sunny. Electric cars, similarly, are making huge strides, but until range increases and charging times diminish, fossil fuels are going to rule.\n\nExisting battery technology won't cut it. For one thing, it's too expensive. According to the Clean Air Task Force, for California to meet ambitious goals of powering itself through renewables only, the state would need to spend $360 billion on energy storage systems. One company called Form Energy is developing what are known as aqueous sulfur-flow batteries that will cost somewhere between $1 to $10 per kilowatt-hour, compared with lithium's $200 per kilowatt-hour cost. Storage times should increase, too, perhaps lasting months. Form's solution could help California meet its energy targets before the middle of the century, providing a roadmap for the rest of the world.\n\n5. Environmental sensors\n\nTo heal the planet, we need to measure it. Distributed sensors are one of the unsung technologies allowing that to happen, and the continued spread of the networked sensor environment will be one of the undergirding technologies behind nearly every sustainability effort imaginable.\n\nWant an example? Back in the 1980s, taller smokestacks helped reduce local air pollution on the east coast. The problem was the smokestacks were correlated to a higher rate of acid rain, which was leading to vast deforestation. How was the connection drawn? Early networked pollution sensors.\n\nThe technology, of course, has advanced since then. Networked sensors as small as a dime are already monitoring air and water quality, identifying pollutants, tracking acidification, and capturing real-time data on phenomena that are crucial to our social and economic wellbeing. Wearable air quality sensors are on their way, and localized sensor networks monitoring energy and water usage in buildings are cutting down on waste. The further proliferation of these sensors will dramatically impact the way we live.\n\n(Image: Getty Images/iStockphoto)\n\n4. Smart grids\n\nThe way our power infrastructure -- collectively known as the grid -- works now is a troubling holdover from the 19th and 20th centuries. Power production is still largely centralized and distributed downstream, eventually reaching end users. The problem is that these grids are highly sensitive to fluctuations in usage and output. To make them work reliably, they demand an overproduction of energy. They're prone to attack, and they tend to rely on pollution-emitting energy sources.\n\nSmart grids are already being rolled out in testbeds in the US and internationally. The concept isn't so much a single technology as the deployment of numerous energy, distribution, networking, automation, and sensing technologies to design a new grid for the 21st century. Smart grids will enable local production of energy down to the household level, which can be fed back into the grid upstream. Sensing technology and more accurate prediction models will fine-tune energy production to avoid overproduction, and better battery technology (see #7 on this list) will enable storage of renewably sourced energy. The concept even reaches beyond the light socket. As appliances get smarter, the grid may start to automatically signal them to shut off to conserve power. All of this could add up to a huge change in how our power infrastructure functions. According to a study by the Electric Power Research Institute, by 2030, Smart Grid technologies might help us reduce carbon emissions by 58% compared to levels from ten years ago.\n\n(Image: Getty Images/iStockphoto)\n\n3. Carbon capture\n\nThere's too much carbon dioxide in the air, and it's warming our planet. What if we could capture and sequester it?\n\nThat's the premise of Carbon Capture and Storage (CCS), an emerging class of technologies that are primed to play an important role in the health of our planet in the decades ahead. According to the CCS Association, capture technologies allow the separation of carbon dioxide from gases produced in electricity generation and industrial processes by one of three methods: pre-combustion capture, post-combustion capture, and oxyfuel com­bustion. The carbon is transported by pipeline and stored in rock formations far below ground.\n\nIn 2017, the world's first CO2 capture plant went live in Switzerland. Startups in the US and Canada have developed carbon capture plants of their own. At scale, the technology could help reverse one of the most alarming environmental trends of our time.\n\n(Image: Getty Images/iStockphoto)\n\n2. Nuclear fusion\n\nOur sun is powered by the fusion of hydrogen nuclei, forming helium. For decades, scientists have been working on harnessing the same process to create sustainable terrestrial power. The effort is extremely compelling from an ecological standpoint because it represents a zero-carbon emissions form of energy. Unlike nuclear fission, the process that powers current nuclear plants, fusion does not result in the production of long-lived radioactive nuclear waste.\n\nThe problem is heat. To generate net positive energy when two particles fuse, the reaction has to take place at millions of degrees celsius, and that means whatever vessel you're using to do the fusing will, well, melt. The answer is to suspend the reaction in a floating plasma so the extreme heat doesn't touch the chamber, a process researchers believe can be achieved using high-powered magnets. The typical timeline offered for fusion power is 30 years, but a team at MIT working with a new class of magnets believes it can get fusion power into the grid in just 15 years, which would be a huge boon in the fight to slow the planet's warming trend.\n\nArtificial intelligence\n\nSure, it may doom us all via any number of sci-fi premises (nuclear annihilation, strategic species eradication, the rise of the robots) but artificial intelligence also might be our best bet computing ourselves out of the grave state we find ourselves in.\n\nMicrosoft's AI for Earth program is one effort underway to harness the potential of AI for the good of the planet. The program has given more than 200 research grants to teams applying AI technologies to planetary health in one of four areas: biodiversity, climate, water, and agriculture. Primitive AI and machine learning algorithms are currently analyzing icy surfaces to measure changes over time, helping researchers plant new forests with precise layouts to maximize carbon sequestration, and enabling warning systems to help stem destructive algae blooms.\n\nAI is having an impact on agricultural practices and will soon transform how farming is done in industrialized nations, reducing our reliance on pesticides and drastically lowering water consumption. AI will make autonomous vehicles more navigate more efficiently, lowering air pollution. AI is being deployed by material scientists to develop biodegradable replacements to plastics and develop strategies to clean our oceans, which receive some eight million metric tons of plastics annually.\n\nFundamentally, AI will be the bedrock of our future efforts to undo the damage already done to the planet while figuring out scalable solutions to sustaining our species' energy, food, and water needs.\n\nThat, or it'll be our species' probably-deserved undoing.", "description": "In an uncertain future, these technologies can be a force for progress. Of course, number one could also spell our doom.", "authors": ["Greg Nichols"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/09/12/3be8c200-1317-4f06-96c5-52ba41f7a1d4/thumbnail/770x578/842486a9803020f9773e9e45e2a17a4c/smoke-3178047-960-720.jpg", "published_at": "2019-09-13"}