{"pub": "dailybeast", "url": "https://thedailybeast.com/fyre-festival-fraudster-billy-mcfarland-busted-by-prison-guards", "downloaded_at": "2019-09-24 13:36:01.588089+00:00", "title": "Fyre Festival Fraudster Billy McFarland Busted by Prison Guards", "language": "en", "text": "Fyre Festival fraudster Billy McFarland was caught with a prohibited recording device in prison this summer and is expected to be sent to a higher security federal prison as a result, according to two people familiar with the situation.\n\nMcFarland, 27, is serving a six-year sentence in the federal correctional facility in Otisville, New York, 70 miles northwest of Manhattan. The minimum-security prison is used to housing famous criminals, such as President Donald Trump’s former lawyer turned fixer Michael Cohen and Mike “The Situation” Sorrentino of Jersey Shore.\n\nOfficials have decided to transfer McFarland to a more secure facility after he was found to have the device, according to people familiar with the matter, but in the meantime is being held in the prison’s special housing unit, or SHU (“shoe”). Prisoners in the SHU are confined to a small cell containing a sink, a toilet, and little to no sunlight, former Otisville inmates told The Daily Beast. Sometimes prisoners share the cell with one other inmate.\n\n“If you are claustrophobic, it’s not great,” one former prisoner said.\n\nPrisoners are kept in the cell for 23 hours a day and only allowed out for one hour of recreation time, the former inmates said.\n\n“ I told him the public doesn’t need a book to know you’re a fucking idiot. ” — Josh Raab\n\nFederal inmates are prohibited from possessing electronic devices or cellphones in prison, which are categorized among the “greatest severity level prohibited acts” such as killing, assault, and escaping, according to the Bureau of Prisons website. Those found to be flouting the rules face a host of penalties ranging from losing their earned statutory “good time,” segregation, a fine, and a change of housing.\n\n“For privacy and safety and security reasons, the Bureau of Prisons (BOP) does not release information on an individual inmate's conditions of confinement such as an inmate’s housing quarters or whether the inmate is the subject of allegations, investigations, or sanctions in prison,” a BOP spokesperson said.\n\nMcFarland’s publicist, Brandon Rubinshtein, and girlfriend Anastasia Eremenko did not respond to repeated requests for comment.\n\nSince entering Otisville, McFarland has worked in a warehouse and the sewage-treatment plant, an overnight job that entails overseeing general maintenance and watching over the sewage system, according to the former prisoner who served time alongside McFarland.\n\n“They commonly call it the shithouse,” he said.\n\nLast year, McFarland pleaded guilty to two counts of wire fraud and two counts of fraud for defrauding investors and music fans who had bought tickets to the Fyre music festival in the Bahamas. Instead of seeing acts such as Blink 182 and Major Lazer perform in a Caribbean paradise, hundreds of ticket-holders were left stranded on an island without basic necessities like clean drinking water. Locals on the island who had worked on the festival went unpaid by McFarland.\n\nA judge ordered McFarlane to pay $26 million in restitution to his victims.\n\nThe fraud was so notorious that it spurred two documentaries—Fyre on Netflix and Fyre Fraud on Hulu—that detailed how social-media influencers were used to promote the festival.\n\nWhile serving his time, McFarland has been busy writing a memoir in which he intends to tell his side of the story about the failed festival.\n\n“PROMYTHTYUS: THE GOD OF FYRE shows how, as an eight year old, my discovered passion for technology, intuition for viral marketing, and constant drive to set my own path by outgunning authority and the status quo, combined with an incessant passion and demand to live life to the fullest, started me down a path that would take me through the absolute extremes of society,” McFarland wrote in a message from prison reviewed by The Daily Beast.\n\n“It was going to be a roller coaster of how Billy got to where he was,” Josh Raab, a freelance editor who was consulted about working on McFarland’s book, told The Daily Beast. New York magazine was first to report the existence of a book project.\n\nMcFarland outlined the book for Raab in a series of messages.\n\n“I tell how I went from hiding suitcases of cash under my bed at 13, to eloping from my private high school to join underground fighting gyms, to failing college, but getting a check from the man who Forbes described ‘America’s Most Reckless Billionaire’ just days later, to crashing a plane I shouldn’t have been flying, to becoming a confidant of celebrities, super-models, and politicians, to getting arrested by the FBI and confined to a 9’ by 12’ amidst violence and gang wars.”\n\nRaab, who ultimately decided not to work on the project, concluded the book was another of McFarland’s scams.\n\n“I thought the most interesting thing was the fact he had written 100 pages on a kindergarten scheme to sell crayons,” Raab said. “One of the things I seemed to be tasked with was telling Billy that can’t be in the book.\n\n“I told him the public doesn’t need a book to know you’re a fucking idiot. This will have to be a ‘come to Jesus’ moment. You need to come to terms with what you did.”\n\nThe prison source who served alongside McFarland said the serial schemer had shared some details of the book with him.\n\n“He’s going to name names in the book. Some people are going to be surprised when the book comes out. Some people are going to be taken aback. I imagine it will be very controversial.”\n\nSome of those names are Donald Trump Jr. and Tiffany Trump, Dave Chappelle, Kris Jenner, and Jay-Z, according to a pitch memo from McFarland and Rubinshtein to Raab.\n\nMcFarland, who is scheduled for release in 2024, had high hopes for the book in messages from prison reviewed by The Daily Beast.\n\n“Most of all, I hope my story entertains, teaches, warns, and inspires, while providing restitution to my former team and also to the incredible people of the Bahamas,” McFarland wrote.", "description": "The felon is expected to be kicked out of a comfy prison where he worked in the “shithouse” and on a memoir.", "authors": ["Lachlan Cartwright", "Senior Reporter"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569274045/190923-lachlan-Mcfarland-tease_kqhj05", "published_at": "2019-09-24"}