{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/style/washington-is-again-captivated-by-an-anonymous-source-its-different-now/2019/09/27/3234ec60-e0a3-11e9-b199-f638bf2c340f_story.html", "downloaded_at": "2019-09-28 21:31:55.172551+00:00", "title": "Washington is again captivated by an anonymous source. It’s different now.", "language": "en", "text": "\n\nProtesters call for the impeachment of President Trump in Lafayette Square in front of the White House. (Carolyn Kaster/AP)\n\nIn Washington, there is no figure quite as recognizable as the anonymous figure. They’ve written best-selling books (“Primary Colors”); been primary sources for both history-altering stories (Deep Throat) and juicy tales of palace intrigue (This account is the result of more than two dozen interviews); and one has even written a viral op-ed in the New York Times about resisting President Trump from within the administration.\n\nYet, in the annals of anonymity, nothing seems quite as fraught, quite as intriguing or quite as dangerous as the whistleblower. On Thursday, the day after Rep. Adam B. Schiff (D-Calif.) and his colleagues on the House Intelligence Committee read a complaint regarding Trump’s communications with Ukrainian President Volodymyr Zelensky — (“very well written,” Schiff opined) — the whistleblower’s report was declassified and gobbled up by the masses. The president raged behind closed doors that it appeared to be a work of spycraft bordering on “treason,” and the New York Times published hints about who, exactly, this person might be.\n\nFor once, this doesn’t feel like just another version of D.C.’s favorite parlor game of Guess Who.\n\n“It’s important that we protect the identity of this whistleblower,” Rep. Katie Porter, a freshman Democrat from California, said in a hallway interview.\n\n“That’s what we hope to do,” House Speaker Nancy Pelosi (D-Calif.) said in a news conference. “Protect the whistleblower.”\n\n“We will do everything we can to protect this courageous whistle­blower,” tweeted Schiff, who said his committee is trying to figure out a way for this person to testify.\n\n“What I’d like to see with the whistleblower is,” said House Minority Leader Kevin McCarthy (R-Calif.), “who this person is.”\n\nWhoever this person is, they’ve put Washington in a tizzy. The whistleblower alleged, among other things, that Trump had pressured the president of Ukraine to “initiate or continue an investigation into the activities of former Vice President” — and potential 2020 election opponent — “Joseph Biden and his son, Hunter Biden,” and led the White House to release a summary of Trump’s call with the Ukrainian president, which, oddly, seemed to back up parts of the complaint.\n\n[Whistleblower painstakingly gathered material and almost single-handedly set impeachment in motion]\n\nBefore the whistleblower, Democrats couldn’t even agree whether they were on the path to impeachment. After, Pelosi called Democrats together for an all-hands meeting and announced her support for an impeachment inquiry, which, according to the six committees already investigating Trump, was already underway.\n\n“I think she is saying full steam ahead on an impeachment inquiry,” Rep. Pramila Jayapal, a Democrat from Washington, said coming out of that Tuesday meeting. “Obviously we’re in an impeachment inquiry, but there has been some confusion around exactly what that means.”\n\nWhat does it mean for Rep. Brad Sherman, a Democrat from California who introduced articles of impeachment more than two years ago?\n\n“There is no great joy,” he said. For all the celebrating on Resistance Twitter, and all caps diatribes from @RealDonaldTrump (“THE GREATEST SCAM IN THE HISTORY OF AMERICAN POLITICS!”), politicians on both sides of the aisle did their best to remain subdued. No talk about excitement from Democrats, just lip-biting grimaces and words like “sober,” “somber” and “sad.”\n\n“It is not a matter of personal vindication,” Sherman said. “There is no ‘I told you so.’ ”\n\nIt would be a little early for that. There would still be time for plenty of plot twists before the end, if this were a film. And, according to Republicans, it is.\n\n“We’ve seen this movie before,” said Rep. Michael R. Turner, a Republican from Ohio.\n\n“Many Americans have seen this movie too many times,” said Rep. Brad Wenstrup, another Republican from Ohio.\n\nThe Ohioans were speaking from behind the dais Thursday at an Intelligence Committee hearing featuring the acting director of national intelligence, Joseph Maguire, who handled the whistle­blower’s complaint. Of concern to the Republicans was their belief that Democrats were just continuing their singular quest to ruin the president and have now enlisted the help of an unnamed, unreliable narrator.\n\n“The complaint relied on hearsay evidence,” said Rep. Devin Nunes of California, the highest-ranking Republican on the committee. “The whistleblower displayed arguable, political bias against Trump.”\n\n[Who’s who in the whistleblower complaint]\n\nIt is true that in the report, the whistleblower admitted to not being “a direct witness to most of the events described” and that the inspector general found an “arguable political bias on the part of a rival candidate.” But that didn’t change the fact that the whistleblower — who was informed of “various facts” by “more than half a dozen U.S. officials” — provided a report that the inspector general found both “urgent” and “credible.” But when the person at the center of a scandal is a blank canvas, politicians can try to paint him or her however they’d like.\n\nSo Republicans paint the whistleblower as a “partisan” with “second-hand” information or, worse, as a joke.\n\nRep. Steve Stivers, an oft-grinning Republican from Ohio known for his easy laughs and frequent jokes, whipped out a cellphone with a picture of President Bill Clinton and Monica Lewinsky in the Oval Office.\n\n“Here’s some breaking news!” he cracked on Thursday, holding up his cellphone for others to see near the House floor.\n\nOn the picture, the meme under Clinton read: “Everyone remembers my whistleblower.”\n\nHe roared with laughter at people’s appalled reactions.\n\nDemocrats don’t think any of this is funny.\n\n“Director, you don’t believe the whistleblower is a political hack, do you?” Schiff asked Maguire.\n\n“I don’t know who the whistleblower is, Mr. Chairman,” Maguire answered. “I’ve done my utmost to protect his anonymity.”\n\nNot everyone has been keen on keeping the secret. Rep. Dan Crenshaw, a freshman Republican from Texas and former Navy SEAL, said he’s not so sure this whistleblower is actually a whistle­blower.\n\n“Not by the traditional definition,” he said. When most of us think of a whistleblower, he said, we think of someone who was asked to do something illegal, refused and then sounded the alarm.\n\n“I have an intelligence background, so I know what an intelligence analyst writes like,” he continued. “This sounds like that, like they did their own investigation. And then developed their own report. So you have to ask yourself, is that really a whistleblower?”\n\nAround the time Crenshaw posed this question, standing alone outside a Capitol Hill office building, the president was in a meeting with staffers and families of the delegation at the U.S. Mission to the United Nations, with a similar theory.\n\n“I want to know who’s the person, who’s the person who gave the whistleblower the information? Because that’s close to a spy,” Trump said, according to audio obtained by the Los Angeles Times. “You know what we used to do in the old days when we were smart? Right? The spies and treason, we used to handle it a little differently than we do now.”\n\nJust an hour after the Times published its report on these not-so-veiled threats from the president (one form of punishment for treason, historically, has been death), it published another bombshell — reporting that the whistleblower worked for the CIA and other details that could potentially identify him.\n\nFor more than a year now, the Times has managed to keep the author of its anonymous op-ed a secret. It’s possible that the whistle­blower won’t be so lucky.\n\n“Maybe the two are the same person,” a Republican staffer in the Senate said. After requesting anonymity, of course.\n\nRachael Bade contributed to this report.", "description": "In the annals of anonymity, nothing seems quite as fraught, quite as intriguing or quite as dangerous as the whistleblower.", "authors": ["Ben Terris", "Feature Reporter Covering National Politics", "Ben Terris Is A Writer In The Washington Post'S Style Section With A Focus On National Politics. He Previously Worked At National Journal", "Where He Wrote Political Features Primarily Focused On Congress."], "top_image": "https://www.washingtonpost.com/resizer/t-uRWNmft4wsKrB0KNEt9MC5EDo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/567FJYXATEI6TDOIJGHKXQJJUA.jpg", "published_at": "2019-09-27"}