{"pub": "reuters", "url": "https://in.reuters.com/article/uk-china-canaan/chinas-bitcoin-miner-canaan-creative-files-for-400-million-ipo-on-nasdaq-idINKBN1X80RE", "downloaded_at": "2019-10-29 08:42:55.319774+00:00", "title": "China’s bitcoin miner Canaan Creative files for $400 million IPO on Nasdaq", "language": "en", "text": "FILE PHOTO: A small toy figurine is seen on representations of the Bitcoin virtual currency displayed in front of an image of China's flag in this illustration picture, April 9, 2019. REUTERS/Dado Ruvic/File Photo\n\nBEIJING (Reuters) - Canaan Creative, one of China’s biggest bitcoin mining hardware makers, filed to publicly list on the Nasdaq on Monday to raise $400 million, marking at least its third attempt to do so after previous failed tries in mainland China and Hong Kong.\n\nThe Hangzhou-based company, which describes itself as the world’s second largest bitcoin mining machine designer and maker in its prospectus, said it wanted to use the cash to fund research into artificial intelligence and blockchain research, as well as pay off debts.\n\nIt did not say why it had decided to try again for another initial public offering at this time. It tried to list itself in China three years ago through a reverse merger by buying a Shandong-based electric equipment maker and then again filed for a Hong Kong float last year, however both plans fell through as regulators had doubts about its business model and prospects.\n\nIts application on Nasdaq comes shortly after Chinese President Xi Jinping made comments last week encouraging the development of blockchain technology, which sent the shares of blockchain and digital currency-linked firms, and the bitcoin price, soaring.\n\nThe fate of bitcoin and bitcoin mining in China, however, remains unclear as Beijing shut down local cryptocurrency exchanges in 2017 and in April signalled that it wants to eliminate bitcoin mining in the country. Chinese state media have also said that blockchain innovation should not be seen as a boost for virtual currency speculation.\n\nFounded in 2013, Canaan designs and sells high-performance integrated circuits and is behind the Avalon series of bitcoin mining machines. Banks working on Canaan’s Nasdaq IPO are Credit Suisse, Citigroup, China Renaissance and CMB International.", "description": "Canaan Creative, one of China's biggest bitcoin mining hardware makers, filed to publicly list on the Nasdaq on Monday to raise $400 million, marking at least its third attempt to do so after previous failed tries in mainland China and Hong Kong.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191029&t=2&i=1446112432&w=1200&r=LYNXMPEF9S0GC", "published_at": "2019-10-29"}