{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/28/its-world-series-wake-nationals-react-umpires-game", "downloaded_at": "2019-10-28 07:34:56.271634+00:00", "title": "'It's the World Series! Wake up!:' Nationals react to umpires in Game 5", "language": "en", "text": "Victor Robles tossed his gear in disgust. The Nationals outfielder couldn’t believe umpire Lance Barksdale had ruled Gerrit Cole’s fastball a strike, thus ending the at-bat and the seventh inning. He threw his helmet, yelled and then hurled his batting gloves toward the plate, as well.\n\nThe reaction spotlighted what turned out to be a controversial night for the umpires. Replays showed Cole’s pitch off the plate, and it wasn’t the only call that was off the mark.\n\nBut standing at his locker inside the clubhouse, his anger subsided, Robles downplayed the impact the vall had in Washington’s 7-1 loss Sunday in Game 5 against the Houston Astros. Down 3-2, the Nationals are now on the brink of elimination and have bigger problems to worry about as the series shifts back to Houston.\n\n“It was a very important at-bat and I’ve always said we’re all human, we all make mistakes,” Robles said through a translator. “I feel like he might have made a mistake on that pitch, but that’s part of being human, human nature.”\n\nThe Nationals have plenty to point to as to what went wrong, why they’ve now lost three straight after taking a 2-0 lead in Houston. Their starting pitching hasn’t been quite as strong, and that was again the case when Joe Ross made an emergency start after Max Scherzer was scratched with a neck injury. Their bats have gone quiet, registering just four hits in Game 5.\n\nBut Barksdale’s outing will still draw plenty of criticism nationally — especially since there’s a strong push from fans and experts to replace umpires with “robot umps,” or let technology call balls and strikes.\n\nRob Friedman, who runs the popular Twitter account “Pitching Ninja,” tweeted a video out to his nearly 180,000 followers highlighting two botched calls from Barksdale. One showed a Tanner Rainey pitch that seemed to paint the corner, only to be called a ball. And the other showed Cole’s high-and-away fastball that was called a strike.\n\nFriedman included four “robot” emoji in the caption, making his thoughts clear on the matter.\n\nThe Nationals, too, were upset in the course of the game. On Rainey’s pitch, mics picked up catcher Yan Gomes saying, ‘Oh, it’s my fault?’ when discussing the call with Barksdale.\n\nManager Dave Martinez then shouted: “Come on, Lance! It’s the World Series! Wake up!”\n\nUmp doesn’t call strike three. Tells Gomes he was taking off on him. Gomes replies ‘Oh it’s my fault?”\n\n\n\nThen Martinez kindly asks the ump to wake up because its the World Series. pic.twitter.com/iRUr349bQh — Jomboy (@Jomboy_) October 28, 2019\n\nAt his locker, Gomes said he wasn’t going to talk about the calls.\n\nThen, he continued.\n\n“I’ll keep saying, the fact you’re asking about him,” Gomes said. “You’re answering your own questions.”\n\nIn his post-game press conference, Martinez also avoided the subject. He said he wasn’t going to criticize, telling reporters umpires have a “tough job, and they try to do the best they can.”\n\nReliever Sean Doolittle, though, said the Nationals can’t use the calls as an excuse — adding he didn’t think anyone was doing that.\n\nRyan Zimmerman echoed the same.\n\n“Lance did not lose us the game tonight, the first baseman said. “Gerrit Cole beat us. I think that’s the best way to put it.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Victor Robles tossed his gear in disgust. The Nationals outfielder couldn't believe umpire Lance Barksdale had ruled Gerrit Cole's fastball a strike, thus ending the at-bat and the seventh inning. He threw his helmet, yelled and then tossed his batting gloves toward the plate as well.", "authors": ["The Washington Times Http", "Matthew Paras"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/27/World_Series_Astros_Nationals_Baseball_91001.jpg-2572d_c0-197-4685-2929_s1200x700.jpg?ad5bdb6d7c3326092118eb59ee43a57e3ef0e3dd", "published_at": "2019-10-28"}