{"pub": "fox", "url": "https://foxnews.com/politics/bernie-sanders-phone-call-union-fourm", "downloaded_at": "2019-10-14 00:19:00.829380+00:00", "title": "Bernie Sanders unfazed by ringing phone interrupting Skype call at union candidate forum", "language": "en", "text": "Senator Bernie Sanders showed an unwavering level of focus in the face of bothersome technology during a conference call with the United Food and Commercial Workers (UFCW) International Union presidential candidate forum on Sunday.\n\nIn a funny series of events, the presidential candidate was interrupted not once, but twice by his home phone, which played the familiar caller ID \"call coming from\" voice before a woman appeared to answer the phone during a roughly 20-minute interview with the UFCW.\n\nAs if that wasn't enough, towards the end of his forum - as he discussed needing bold solutions to our nation's problems - a loud ding could be heard coming from his home, indicating a text message being sent to a phone nearby.\n\nSANDERS ADDRESSES HEALTH AFTER RECENT HEART ATTACK, SAYS 'I'M GETTING STRONGER EVERY DAY'\n\nAgain, somehow he didn't seem to notice and appeared to brush it off like his most recent heart surgery.\n\nSanders, who was hospitalized on Oct. 2 for a blocked artery, seemed to be in good spirits, delivering his points at the candidate forum.\n\nOn Oct. 2, he wrote on Twitter he was feeling good and thanked those around him for the \"well wishes.\"\n\nBERNIE SANDERS' DAUGHTER-IN-LAW DIES FROM CANCER SHORTLY AFTER BEING DIAGNOSED\n\n\"I'm feeling good. I'm fortunate to have good health care and great doctors and nurses helping me to recover,\" he wrote at the time. \"None of us know when a medical emergency might affect us. And no one should fear going bankrupt if it occurs.\"\n\nDuring the forum, the Vermont senator talked about some of his presidential proposals including his feelings on a 32-hour workweek, pension promises, wage theft, wealth equality, and automation.\n\nHe relayed a need to be an \"organizer in chief\" by taking on greed and corruption within this country and didn't hold back words when addressing his feelings towards Donald Trump.\n\nCLICK FOR THE ALL-NEW FOXBUSINESS.COM\n\n\"Here is the story. We live in an unprecedented moment in American history and by that I mean only that we have the most dangerous president in the history of this country somebody who is a pathological liar a racist a sexist, a homophone xenophobe and a religious bigot.....We have a corrupt political system in which billionaires are able to spend hundreds of millions of dollars to buy elections undermining the whole thrust of what American democracy is supposed to be about,\" Sanders said.", "description": "Bernie Sanders showed an unflinching level of focus in the face of bothersome technology during a Skype call with the United Food and Commercial Workers (UFCW) International Union presidential candidate forum on Sunday.", "authors": ["David Aaro", "David Aaro Is A Freelance Reporter At Fox News Digital Based In New York City."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/d62ee7ac-AP19216020679996.jpg", "published_at": "2019-10-13"}