{"pub": "foxbusiness", "url": "https://foxbusiness.com/economy/rv-industry-created-a-technical-institute-to-combat-vocation-shortage", "downloaded_at": "2019-09-24 13:31:42.364397+00:00", "title": "RV industry moves to create jobs and satisfy customers", "language": "en", "text": "If any industry has benefited from the economic expansion of the last 10 years, it is the recreational vehicle (RV) industry.\n\nContinue Reading Below\n\nA combination of millennials seeking new adventures coupled with new high-end RVs kept the highways and byways filled with vehicles from the likes of Winnebago and Thor Industries. But the RV Industry Association is forecasting a 14.3% drop in towable RV shipments for 2019 and an 11.3% drop for motorhomes. This slowdown could cost jobs which could impact customer service and ultimately hurt the overall economy. But the industry is not pulling over to the side of the road and taking these developments lying down.\n\nMonday the RV association unveiled The RV Technical Institute in Elkhart, Ind., a new multi-million dollar technician training facility that aims to defeat the skill gap in RV vocations and reducing the length of repair times for consumers.\n\nIn a press release sent to FOX Business, an increase in trained technicians “will reduce the repair event cycle times and improve the RV consumer experience.” It also detailed that this move is an investment in the industry’s future by teaching students rewarding skills that can earn an income of up to six figures.\n\nCurt Hemmeler, the director of the new center, says the shortage of skilled workers has translated to long wait times for customers waiting for repairs. “Currently it’s a 21-day average [wait] that it takes to get a unit fixed and we know that isn’t where we want it to be,” Hemmeler told WFYI in Indianapolis.\n\nAdvertisement\n\nTicker Security Last Change %Chg WGO WINNEBAGO INDS 40.10 +0.07 +0.17% THO THOR INDUSTRIES 53.81 -0.41 -0.76%\n\nThose repairs may be more frequent for owners based on a recent analysis. Earlier this month, Bank of America Merrill Lynch issued a sour report on the RV industry. While millennials may have contributed to the RV renaissance, BAML wrote, \"We believe millennials are more likely to buy used RVs or rent RVs rather than owning, given the big-ticket, 100% discretionary nature of the purchase and a greater degree of comfort with the sharing economy.\"\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nA study by the RV Industry Association reported an estimate that the RV industry contributed $114 billion to the U.S. economy in 2018, which is equivalent to 2.2 percent of the national GDP in outdoor recreation.", "description": "The recreational vehicle industry is combating its vocation shortage and falling sales with a dedicated training institute.", "authors": ["Cortney Moore"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/08/0/0/Rvs-Big-Top-iStock.jpg?ve=1&tl=1", "published_at": "2019-09-23"}