{"pub": "yahoo", "url": "https://news.yahoo.com/she-saved-school-her-armed-190904728.html", "downloaded_at": "2019-10-16 00:03:17.898424+00:00", "title": "She Saved a School From Her Armed Son, but Now She Faces Charges", "language": "en", "text": "The mother of a teenager who took his own life after exchanging gunfire with police in 2018 at Dennis Intermediate School in Richmond now faces several felony charges. (Photo: FOX 59-TV)\n\nAn Indiana woman who called the police in December and told them that her 14-year-old son had threatened to shoot up his former school will face criminal charges if prosecutors have their way.\n\nProsecutors in Wayne County filed an affidavit Friday recommending six felony charges against the woman, Mary York, 43, in the episode, which ended when her son killed himself at David W. Dennis Intermediate School in Richmond, Indiana.\n\nThe police did not release the boy’s name because of his age.\n\nProsecutors said in the affidavit that York prematurely removed her son from a mental health facility; took him off prescription medication because he had said it made him feel weird; and failed to tell the police when he fired a handgun inside their home in October 2018, according to The Richmond Palladium-Item.\n\nOn Dec. 13, York called the police around 8:15 a.m. and told the dispatcher that her son had taken her boyfriend hostage at gunpoint and was threatening to shoot up Dennis Intermediate School, according to the police. The school serves grades 5 through 8.\n\nYork’s son was no longer a student at the school, but he had been bullied there in the past, she told the Indianapolis station WISH-TV in April.\n\nWhen the boy arrived at the school, he was armed with a rifle, a pistol, ammunition, two bottles filled with gasoline, rags for Molotov cocktails and a handwritten plan of action, Capt. David Bursten, an officer with the Indiana State Police, said at a news conference in April.\n\nPolice officers were at the school when the boy entered the building by shooting a glass door, Bursten said.\n\nThe boy shot at officers from a stairwell inside the school while Nichole Vandervort, the school’s principal, monitored the situation through video security footage. Vandervort provided updates to police officers of the boy’s movements, Bursten said.\n\nThe boy fired his rifle six times at the officers and used the seventh and last round to take his own life. The boy had no other injuries, Bursten said.\n\nThe captain said there would have been more lives lost that morning if York hadn’t made the “gut-wrenching decision” to call law enforcement.\n\nYork told the Indianapolis station WXIN on Monday that she did not see any warning signs and she couldn’t believe that her son would do something like this.\n\n“I tried everything I could to stop him,” she said.\n\nThe recommended charges against York are one count of dangerous control of a child for his possession of a firearm and five counts of neglecting a dependent, which are all felonies. She also faces one misdemeanor count of criminal recklessness, according to prosecutors.\n\nYork did not immediately respond to a request for comment Monday. It is unclear whether she has a lawyer.\n\nYork told WISH-TV in April that the guns belonged to her then-boyfriend and were locked away in the house. She said her son was depressed and anxious because he was bullied at Dennis Intermediate School.\n\nHe had been admitted to a mental health facility several months before the shooting, but the facility said “nothing was wrong” when it released him to her, she added.\n\n“They’re blaming me and my son, but they need to be blaming the school system and this medical facility that let me take him out,” York said.\n\nMedical records indicate that the boy said he heard voices that commanded him to kill students who bullied him, but there were no documented incidents of the boy being bullied in school records outlined in the affidavit, The Richmond Palladium-Item reported.\n\nAfter investigating the incident, Bursten said there was no reason to believe the boy was targeting a specific person, and the police found that bullying was not relevant to the investigation. The boy intended to “cause maximum damage and harm,” he added.\n\nDavid Snow, the mayor of Richmond, said at the April news conference that the community should keep talking about mental health, encouraging those with mental illness to seek help.\n\n“It is so important as a community that we remove the stigma of mental health,” he said, “and to make mental health resources both available and affordable.”\n\nYork described her son as a really caring boy who liked go-karts and swimming.\n\n“I can’t ever see him again now,” York told WISH-TV. “I just feel like everything was not done right. I feel like there’s so many people that failed him.”\n\nThis article originally appeared in The New York Times.\n\n\n\n\n\n© 2019 The New York Times Company\n\n\n\n\n\n", "description": "An Indiana woman who called the police in December and told them that her 14-year-old son had threatened to shoot up his former school will face criminal charges if prosecutors have their way.Prosecutors in Wayne County filed an affidavit Friday recommending six felony charges against the woman, Mary", "authors": ["Mariel Padilla"], "top_image": "https://s.yimg.com/uu/api/res/1.2/JarDqOXkoqjPSDsvcwpl9A--~B/aD04MDk7dz0xMjIzO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/1f5ad9c0-ef84-11e9-8f5e-3bcfccb29035", "published_at": "2019-10-15"}