{"pub": "realclearpolitics", "url": "https://thefederalist.com/2019/09/17/waiting-juarez-trumps-remain-mexico-program-ruin-smugglers-trade", "downloaded_at": "2019-09-19 23:06:50.737682+00:00", "title": "Waiting In Juarez: How ‘Remain in Mexico’ Is Ruining Smugglers’ Trade", "language": "en", "text": "The ‘Remain in Mexico’ program is prompting thousands of migrants to give up on their asylum claims and return to Central America, while others decide to wait in limbo.\n\nCIUDAD JUÁREZ, Mexico — Mariela Hernandez says she isn’t going back to Guatemala, no matter what. She illegally crossed into the United States from Mexico with her five-year-old daughter near El Paso, Texas, in early August. Two days later, they were sent back to Mexico.\n\nHernandez, a petite woman with an intense gaze and a firm voice, says she is going to wait in Juarez even though her odds of being granted asylum in the United States are very slim. She says she left her country after being attacked in her home, hit on the head repeatedly with a pistol, and robbed. She was afraid to call the police because they’re corrupt, so she took her oldest child and headed north, leaving her three-year-old son in the care of her sister back in Guatemala.\n\nAnother Guatemalan woman, 33-year-old Earlene Alvarez, is holding a four-month-old baby. She says she and her husband and their children were forced to move three times in Guatemala because of the gangs. They finally decided to leave the country because they are afraid of the gangs, they have no opportunities there, and they want a better future for their children.\n\nBoth women know many people from their hometowns who have already made the journey north, entered the United States, and were quickly released. They say they paid smugglers thousands of dollars to get this far, sometimes more than once. Hernandez still owes her smuggler $2,500. “I just want an opportunity to come to the United States and work,” she says. “I don’t understand why others were allowed in but not us. What changed?”\n\nWhat changed was the Migrant Protection Protocols. Launched as a pilot program in El Paso and San Diego in January, the Trump administration expanded and accelerated the MPP program, also known as “remain in Mexico,” as part of a deal struck with Mexico in June to crack down on illegal immigration from Central America.\n\nThe program requires migrants seeking asylum in the United States to wait in Mexico while their cases are being adjudicated—a process that takes months. All told, the United States has sent nearly 43,000 non-Mexicans back across the Rio Grande to await their hearings. Last week, MPP hearings began in a sprawling tent facilities erected in Laredo, Texas, where migrants appear before an immigration judge via video conference.\n\nLike most of the migrants in the program, Hernandez and Alvarez don’t have attorneys, nor any documentation of their claimed troubles in Guatemala. But even if they did, nothing about their stories suggests they would qualify for asylum under U.S. law. Simply living in a country with high rates of poverty and crime like Guatemala or Honduras, or even being the victim of a crime, doesn’t necessarily meet the threshold for asylum, which tends to be reserved for those targeted on the basis of race, religion, nationality, political opinion, or membership in a particular group.\n\nThe smugglers didn’t tell them any of this. They promised these women that if they crossed the border, they would be picked up by Border Patrol and quickly released. Hernandez and Alvarez had good reason to believe this. After all, so many people they knew back home had gotten in this way.\n\nThe women won’t have their next hearings in the United States until late November and early December, and in the meantime they’re staying with about 600 other migrants in a massive shelter in Juarez operated by the Mexican federal government. It’s the only such shelter in the country, established last month specifically to house migrants in the MPP program.\n\nThe building is a cavernous former factory that’s been converted into makeshift housing, mostly for families. There is no air conditioning, but the shelter is clean and orderly. It teems with more than 150 children of all ages, some playing soccer in the parking lot outside, others napping on plastic mattresses in one of the spacious loading bays that now serve as sleeping areas. A special disaster response unit of the Mexican Army provides three meals a day, and a staff of about 50 employees of Mexico’s Secretariat of Labor and Social Welfare run the place.\n\nThe shelter’s director, Rene Gonzales, calls it a prototype, and says the federal government plans to established similar shelters all along the border for migrants in the MPP program. In addition to providing food and housing, the shelter in Juarez, which has a maximum capacity of 1,200, is also helping migrants find work in Mexico. Nearly all the men at the shelter have asked for work, and dozens of them have already found jobs. The Ministry of Labor, explains Gonzales, is supplying them temporary work permits. “Our intention is for them to stay in Juarez and get a job.”\n\nBut not all of them will stay, even with the promise of a job and a work permit. According to Gonzales, about a third of the migrants at the shelter choose to return to their home countries every week—that means hundreds, just from this one shelter. They leave every Tuesday on buses chartered by the International Organization for Migration, the United Nations’ immigration agency.\n\nThat’s consistent with recent reporting from Reuters, which found that the IOM’s “Assisted Voluntary Return Program,” as it’s called, has paid for buses or flights for more than 2,100 non-Mexican migrants over the past ten months. The $1.65 million program is being funded by the U.S. State Department, and appears to be ramping up as the number of migrants returned to Mexico under the MPP increases.\n\nThis of course cuts against the dominant narrative of the border crisis, which is that the hundreds of thousands of Central Americans who have crossed the southwest border in recent years are fleeing violence and persecution and had no choice but to leave. If persecution or certain death await them back home, why would so many opt to return?\n\nOne possible reason is that Juarez, like much of northern Mexico, is dangerous. After years of trending downwards, violence is again on the rise here, with more than 1,000 homicides in the city so far this year, including 10 in the first three days of September. In a city riven by crime and corruption, migrants are especially vulnerable to kidnapping. Gangs will snatch migrants from shelters, bus stations, or right off the street, then call their relatives in the United States and demand payment. Human rights groups have criticized the MPP program on precisely these grounds, saying it fails to protect migrants who must wait in border towns like Juarez, Reynosa, or Nuevo Laredo—some of the most dangerous places in Mexico.\n\nA more likely reason is that these migrants didn’t leave behind their families and homes in a poor, volatile country just to live and work in another poor, volatile country. Most will freely admit that a major motivating factor for them was the prospect of earning much more in the United States than they could at home, and being able to send money back to family they left behind. For these migrants, staying in Mexico, where wages are a fraction of what they are in the United States, largely defeats the purpose of emigrating in the first place.\n\nBarred From Claiming Asylum, Many Migrants In Limbo\n\nOn the west side of the city, off a gravel street in a neighborhood of crumbing cinderblock houses, a somewhat different group of migrants are staying at the Good Pastor shelter and Methodist church, a modest cluster of buildings operated by Pastor Juan Fierro García and three other staffers. Fierro says at the height of the border crisis in May, he had as many as 260 people staying here, crammed in every corner. Today, there are only 87. Without a steady source of support, he says, “We have relied on the grace of God.”\n\nHe takes me through a cramped courtyard crisscrossed with hanging laundry and into a small sanctuary strewn with cots and mattresses, the orange pews piled high with luggage and belongings. Unlike at the federal shelter, nearly half of the migrants staying here are not part of the MPP program, and in fact have not yet set foot in the United States.\n\nThey are instead waiting their turn to apply for asylum at the port of entry, and therefore subject to the Trump administration’s policy of “metering,” in which U.S. border officials only admit a certain number of asylum-seekers per day. A waiting list for Juarez is managed through a Facebook page operated by a Chihuahua state government office set up to help migrants. Out in the courtyard, a yellow piece of paper taped to the wall lists the number of those currently on the waitlist: 12,527.\n\nMost of those on the list have been waiting for months. A 25-year-old man from the African country of Cameroon who declined to give his name has been waiting since May. He doesn’t dare cross the border illegally, he says, because he thinks it will jeopardize his asylum claim. Because he doesn’t speak Spanish and has no temporary legal status in Mexico, he’s also wary of venturing too far from the shelter.\n\nAlthough the man doesn’t have a lawyer, he does have what sounds like a legitimate claim to asylum. He says he took part in a protest with other anglophone students of what they claimed was unfair treatment by the ministry of education (Cameroon has both anglophone and francophone universities). At the protest, he was detained by police and severely beaten. He has since lost sight in his right eye.\n\nHe’s not the only one at the shelter with a story of political persecution. Another man, a young doctor from Uganda, says he was imprisoned for 95 days for his association with an opposition party. Upon his release, he fled to Mexico under the assumption that he could apply for asylum in the United States at the border. He’s been waiting in Juarez for two months, after spending three months in a Mexican detention center in Vera Cruz.\n\nYet another man, a Nicaraguan who also declined to give his name out of fear for his family members back home, has been at the shelter with his wife and three daughters for three months. They fled after he was identified in news footage of the protests against president Daniel Ortega last May. Police ransacked his house twice and threatened him and his family.\n\nHe says he has information about people killed in the protests, and that one protester died in his arms. He showed me video footage he took on his phone of gun battles in the street, as well as a Facebook post threatening him by name, featuring his picture. When he arrived in Juarez, he says, federal police stole 8,000 pesos from him, so now he doesn’t venture out much.\n\nAll these men have what appear to be straightforward asylum claims. They say they didn’t leave their countries because they wanted better economic opportunities or because they wanted to send money home to their families, they left because they feared for their lives. They seem to fit the profile of political refugees, not economic migrants. Yet thanks to the perverse effect of the MPP program, which has swamped federal immigration courts up and down the southwest border, combined with the Trump administration’s metering policy at ports of entry, none of them have been able even to file an asylum claim, let alone plead their case before U.S. officials.\n\nWhat’s more, they might never get the chance. Last week, the U.S. Supreme Court allowed the enforcement of a Trump administration rule that denies asylum to anyone who passed through another country on their way to the United States. The rule is being challenged in federal court, but while the case goes forward it means the men at the Good Pastor shelter, who appear to be fleeing political persecution, can’t apply for asylum in the United States unless they first apply for asylum, and are rejected, in Mexico.\n\nIn El Paso, Immigration Court Is Swamped With MPP Cases\n\nNone of this is to say some of the Central Americans in the MPP program don’t have valid asylum claims, but the case outcomes suggest that most of them don’t—the asylum denial rate for the El Paso immigration court is about 85 to 90 percent. One immigration attorney in El Paso told me that so far, the success rate for MPP cases is only about 4 percent.\n\nYet in recent months, MPP cases have consumed immigration court dockets. At the federal courthouse in downtown El Paso, four immigration judges hear hundreds of MPP cases nearly every day of the week. Lately, that’s all they do.\n\nOn a recent weekday morning in the courtroom of Judge Robert Hough, the process plays out more or less the same for every migrant. Almost none of them have lawyers, so Judge Hough begins by urging them all to seek legal counsel rather than represent themselves. Then he calls them up one by one, informs them of the charges against them, tells them they are subject to removal from the country, asks if they are afraid of returning to their home country (they all say yes), and asks if they brought a completed asylum application to submit.\n\nThe judge then asks if they have any questions, and every time they answer with the exact same phrase, “I’m afraid of returning to Mexico.” Judge Hough then replies, “The government will look into that.” Sometimes, if a migrant presses the issue, he’ll say something like, “Understand that I’m concerned with what happens in this court. If you have fears about returning to Mexico, the government will look into that.” These exchanges play out like a script, all day long.\n\nAn attorney for Immigration and Customs Enforcement told me that everyone who expresses a fear of returning to Mexico will be given a “non-refoulement” interview by a U.S. Customs and Immigration Service officer later that same day. Non-refoulement is a well-established principle, codified in both U.S. and international law, that a government will not return refugees or asylum-seekers to a country where they are likely to face persecution. Depending on the circumstances of those in the MPP program, after their interview they will either be detained in the United States, released with orders to appear at their next hearing, or sent back to Mexico. The vast majority are sent back.\n\nFor many, being sent back to Mexico is just the latest letdown in a harrowing journey full of letdowns—nothing at all what they expected and certainly not what smugglers promised them. Back in Juarez at the federal shelter, Irma Angelica Morales Perera, a shy 21-year-old woman with a soft voice, recalls how she was locked in a room with dead animals when she reached Juarez with her four-year-old daughter. She had already paid the smugglers, but they demanded another 2,500 pesos before they would let her cross the river.\n\n“I feel betrayed by the smugglers,” she says. “They told us we would get into the United States, but it was a lie.”\n\nFor years now, smugglers have been profiting off the dysfunctions in the U.S. immigration system. For a time, it worked. Now, through the blunt instrument of the MPP program, the Trump administration is dismantling the smugglers’ trade. Thousands of Central Americans are now arriving back in their home countries with the same story as Morales: they said if we paid, we would get into the United States, but it was a lie.", "description": "The ‘Remain in Mexico’ program is prompting thousands of migrants to give up on asylum and return to Central America, while others are trapped in limbo.", "authors": ["John Daniel Davidson"], "top_image": "https://thefederalist.com/wp-content/uploads/2019/09/El-Buen-Pastor-sanctuary-sweeping.jpg", "published_at": "2019-09-17"}