{"pub": "fox", "url": "https://foxnews.com/media/democratic-debate-john-delaney-warren-sanders", "downloaded_at": "2019-09-13 00:57:32.451262+00:00", "published_at": "2019-09-12", "title": "2020 contender John Delaney slams fellow Democrats 'You wonder...who comes up with these ideas'", "language": "en", "text": "Ahead of tonight's Democratic primary debate in Houston, 2020 candidate and former Rep. John Delaney D-Md. unleashed on his primary opponents declaring the race to be wide open.\n\n\"Our top three contenders...based on polling, I think are all vulnerable for different reasons. And I think tonight they are going to have to address those vulnerabilities,\" he said on Fox Nation's \"Deep Dive.\"\n\nDELANEY: SENATOR SANDERS DOESN'T KNOW ANYTHING ABOUT THE HEALTH CARE INDUSTRY\n\nDelaney drilled down on the two leading candidates, who are seen to lean farthest to the left. \"I think with respect to Senator Sanders and Senator Warren, they're fundamentally running on a bunch of ideas that a majority of the American people don't support, and that's a huge problem for the general election.\"\n\n\"People are talking about giving people $1,000 a month...which would double overnight all federal spending. So some of this stuff, you wonder actually who comes up with these ideas,\" said Delaney, referencing Democratic candidate Andrew Yang, who has proposed giving every American citizen a guaranteed income.\n\nThomas Del Beccaro, former California Republican Party Chairman and Forbes Contributor believes the problem runs deep in the Democratic party. \"It's not if, its when socialism. You can't go double spending and not see socialism in sight. The government is already 37% of the economy, you push it above 50-55%, then you start heading to where France is, and by the way, Greece is a short flight away.\"\n\nFormer Vice President Joe Biden also did not escape Delaney's criticism. \"For the Vice President, who I have deep respect for, I don't think he has put forth the kind of ideas that the Democratic party is looking for,\" said Delaney, adding that he believes that he is the best candidate, \"what I think we want is a pragmatic idealist. Someone who actually has big ideas, but can show the American people how they can get them done.\"\n\nUnfortunately for Delaney, he failed to qualify to appear at this third Democratic Presidential debate in Houston tonight.\n\nTo see more of \"Deep Dive\", visit Fox Nation and join today.\n\nCLICK HERE TO SIGN UP FOR A FOX NATION FREE TRIAL\n\nFox Nation programs are viewable on-demand and from your mobile device app, but only available only for Fox Nation subscribers. Go to Fox Nation to start a free trial and watch the extensive library from Tomi Lahren, Pete Hegseth, Abby Hornacek, Laura Ingraham, Greg Gutfeld, Judge Andrew Napolitano and many more of your favorite Fox News personalities.", "description": "Ahead of tonight's Democratic primary debate in Houston, 2020 candidate and former Rep. John Delaney D-Md. unleashed on his primary opponents declaring the race to be wide open.", "authors": ["Matt London"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/07/DebateStage073119.jpg"}