{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/video-appears-to-show-rocket-flies-past-iraq-youtuber-protests-2019-10", "downloaded_at": "2019-10-07 12:05:38.460242+00:00", "title": "A YouTuber documenting deadly protests in Iraq posted a video that appeared to show a rocket-propelled grenade flying just past his head", "language": "en", "text": "A video shot by a YouTuber in the midst of protests sweeping Iraq appears to show a rocket flying just past his ear.\n\nThe video was posted from Baghdad on Sunday night by Firas al-Sarrai, a popular Iraqi Instagram and YouTube personality.\n\nThe Washington Post's Beirut bureau chief Liz Sly, who covers Iraq, said the object \"seems to be an RPG.\" Others said it was more likely to be a tear gas canister or flare.\n\nDemonstrators protesting unemployment and corruption since Tuesday have been fired upon with live gunfire by government forces.\n\n104 people have been killed and thousands have been injured, the Iraqi military said Sunday.\n\nVisit Business Insider's homepage for more stories.\n\nA video shot by a YouTuber in the centre of deadly protests in Iraq appears to show a rocket propelled grenade flying narrowly over his head.\n\nThe video was posted from the Sadr City suburb of Baghdad on Sunday night by Firas al-Sarrai, a popular Iraqi Instagram and YouTube personality.\n\nIn the video, a man, most likely al-Sarrai, begins introducing himself to the camera, and says \"these are the demonstrations, look how they open fire on the protesters\" but is cut off as he ducks to avoid a projectile which whistles just overhead.\n\nIn the background gunshots can be heard.\n\nBusiness Insider has not been able to independently verify that al-Sarrai is the man in the video.\n\nWhile al-Sarrai, writing in Arabic, identified the projectile as a \"missile,\" some users on the social media platform identified it as a flare or tear gas grenade.\n\nThe Washington Post's Beirut bureau chief Liz Sly said the projectile \"seems to be an RPG\" on Twitter.\n\nBusiness Insider has reached out to al-Sarrai and weapons experts for clarification.\n\nDemonstrators gather at a protest after the lifting of the curfew, following four days of nationwide anti-government protests that turned violent, in Baghdad. Reuters\n\nProtests against government corruption, high unemployment, and poor public services which started on Tuesday have been met with brutality from the Iraqi government.\n\nLive gunfire met protesters in Baghdad on Sunday, resulting in 10 deaths. The total death toll since protests began stands at 104, a spokesman for Iraq's Interior Ministry said Sunday, according to the Associated Press.\n\nThe Iraqi military said \"excessive force\" was used during clashes on Sunday night in a statement, but said it was the work of rogue agents.\n\nRead more: Iraq blacked out the internet for 70% of the country and blocked social media to try to quell deadly anti-corruption protests\n\n\"Excessive force outside the rules of engagement was used and we have begun to hold accountable those commanding officers who carried out these wrong acts,\" the full statement said.\n\nIraqi security forces fire tear gas to disperse anti-government protesters who set fires and close a street during a demonstration in Baghdad, Iraq, Saturday, Oct. 5, 2019. Associated Press\n\nIraqi Prime Minister Adil Abdul Mahdi had tried to pour cold water on protests by imposing a curfew in Baghdad and other Iraqi cities from Thursday, but protesters defied it.\n\nThe government had previously blocked access to Facebook, WhatsApp, and Instagram on Wednesday, and shortly after, cut internet access for the whole country by 70%.\n\nRead more: As US tensions with Iran simmer, unrest is boiling over next door\n\nThe internet shutdown remained in place as of Sunday night, according to internet freedom monitor NetBlocks.\n\nPrime minister Abdul Mahdi said on Sunday he would introduce new measures to address housing, unemployment, and public services, the Guardian reported.\n\n\"I will go and meet them [protesters] without weapons and sit with them for hours to listen to their demands,\" he said.\n\nAccording to a statement from the office of US Secretary of State Mike Pompeo, Abdul Mahdi told Pompeo in the wake of Sunday's violence that \"control and stability had been restored,\" Reuters reported.", "description": "The video was taken in Baghdad on Sunday night, where 10 protesters were killed in clashes with troops across Iraq. The death toll now stands at 104.", "authors": ["Bill Bostock"], "top_image": "https://image.businessinsider.com/5d9afd61591bb72dcc08a2ed?width=1200&format=jpeg", "published_at": "2019-10-07"}