{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/chris-packham-calls-im-celebrity-20744241", "downloaded_at": "2019-10-29 00:21:07.558669+00:00", "title": "Chris Packham calls for I'm A Celebrity Bushtucker Trials to be axed", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest I'm a Celebrity stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nChris Packham has urged I’m a Celebrity bosses and Ant and Dec to drop the Bushtucker trials featuring animals ahead of the new series.\n\nThe Autumnwatch star says they are “cruel” and wanted to meet the presenters to demand that they are axed.\n\nHe said: “When I see them being harmed or killed for entertainment, I wonder if we are not in the Middle Ages. It is no different from a circus, you know, and we have got rid of our circuses with wild animals.”\n\nIn 2014, he wrote an open letter to hosts Ant McPartlin and Dec Donnelly, asking them to stop “undermining a respect for life”.\n\n(Image: PA)\n\n(Image: Gourley/ITV/REX/Shutterstock)\n\nAnd he said he still wanted to sit down with the duo to talk about his concerns.\n\npoll loading Should ITV scrap bushtucker trials? 0+ VOTES SO FAR Yes No\n\nHe said: “I have never met Ant and Dec but if I did, I would be chatting about it.\n\n(Image: ITV/REX/Shutterstock)\n\n“People make a lot of money out of this but people made a lot of money out of child labour and slavery other unpleasant things and it didn’t continue when they realised they were wrong.”\n\nAn ITV spokesman said: “I’m A Celebrity complies with all national and regional laws concerning the use of insects, animals and reptiles.”\n\nAutumnwatch returns tonight on BBC Two and iPlayer .\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033.", "description": "The Autumnwatch presenter wants ITV to bin off the trials as the latest campmates prepare to head Down Under", "authors": ["Tom Bryant", "Jane Oddy", "Image", "Pa", "Gourley Itv Rex Shutterstock", "Itv Rex Shutterstock"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20743581.ece/ALTERNATES/s1200/0_Im-a-Celebrity-Get-Me-Out-of-Here-TV-Show-Series-17-Australia-03-Dec-2017.jpg", "published_at": "2019-10-28"}