{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/9/honoring-the-fellow-americans-we-lost-9-11", "downloaded_at": "2019-09-09 23:25:47.989311+00:00", "title": "Honoring the fellow Americans we lost 9-11", "language": "en", "text": "ANALYSIS/OPINION:\n\nThis week, we honor the memories of those fellow Americans we lost in New York, Shanksville, Pennsylvania, and at the Pentagon on September 11, 2001. We also remember the acts of heroism of America’s first responders, our armed forces and average Americans.\n\nThere were other individuals, often overlooked, who were instrumental on that day and who were critical to helping America recover in the aftermath. They were this country’s federal civilian workforce.\n\nAs the director of the U.S. Office of Personnel Management (OPM) during 9/11, I had the privilege of witnessing America’s federal workforce commit a million acts of quiet defiance against terrorism when those men and women bravely returned to work the day after the attack.\n\nAcross the country, America’s civil servants realized that one of the most important things they could do was help keep America running, which is exactly what al Qaeda had wanted to stop. They came to work despite not knowing if they would be the next targets — if the bridges they were crossing would be attacked, if their offices would be bombed, or if the monuments and symbols of American democracy they worked in and around would be the next to fall.\n\nI witnessed the depth of pride America’s federal workers had for their country and their willingness to provide some sense of stability for their fellow Americans in the face of adversity. I witnessed the best in people on one of America’s worst days.\n\nAs President Trump looks at reorganizing and reforming the federal civil service system for a new era, committed American patriots like these who continue to serve their country deserve a best-in-class personnel system:\n\n• One that rewards better performance with better pay;\n\n• One that allows agencies to more easily fire poor performers;\n\n• One that’s more flexible in its incentives to effectively recruit highly talented people;\n\n• And one that reforms a cumbersome hiring process that frustrates prospects and makes it difficult to quickly fill needed positions.\n\nChanges like these draw the caliber of employees the American people deserve.\n\nWhile many on the left claim that the president is waging a restructuring campaign to denigrate our civil servants, nothing could be further from the truth. The vast majority of workers — those people I saw return to their posts after 9/11 — are highly competent and dedicated to the mission. Policies that make it impossible to deal with bad apples or impossible to pay workers on the basis of talent rather than tenure are no favor to good civil servants.\n\nAt the same time that changes are being looked at, no matter where various functions of OPM become housed, it’s imperative that certain principles remain intact to protect good workers and the American people they serve.\n\nFirst and foremost is the longstanding merit system for recruiting and hiring, where the selection and advancement of employees is determined on the basis of ability, knowledge and skills, not who you know or who you supported for president.\n\nWhile not compromising on the merit system, government must also ensure that preferences for hiring veterans continue. Not only does our nation owe those who risk their lives a great debt of gratitude, the American people benefit when veterans join the civilian workforce. Their unique life experiences, incredible work ethic, teamwork and deep civic-mindedness make them assets at any workplace.\n\nAdditionally, protections for whistleblowers who identify illegal, unethical or grossly wasteful behavior must remain in place, as well as protections preventing federal workers from being coerced for political purposes. Likewise, rules prohibiting civil servants from using their official authority to try to influence elections are equally important.\n\nThe civil service includes everyone from accountants, clerks and maintenance people to park rangers, engineers, law enforcement and intelligence officers. Government workers are responsible for foreign policy, national defense, environmental protection and space development. They operate the atomic energy program, develop flood-control measures, and conduct research in physics, electronics, geology, and other fields that have far-reaching effects on the health, prosperity, and security of our nation.\n\nMany of the processes and structures of the current civil service system are antiquated. They were devised for a time when the civil service was largely clerical, and they are inadequate for today’s specialized workforce. Our system must be one that will attract and motivate the best and brightest to heed the call to public service.\n\nAn overhaul of the federal government’s basic human resources functions is long overdue. While most people would agree that the administrative state has grown too large and too powerful and must be reduced, the people who remain — talented, patriotic, apolitical and hardworking — are critical to the functioning and flourishing of our democracy and this great American experiment.\n\n• Kay Coles James is president of The Heritage Foundation (heritage.org).\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "This week, we honor the memories of those fellow Americans we lost in New York, Shanksville, Pennsylvania, and at the Pentagon on September 11, 2001. We also remember the acts of heroism of America's first responders, our armed forces and average Americans.", "authors": ["The Washington Times Http", "Kay Coles James"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2014/09/11/087d5ca9c6c662235f0f6a70670022e1_c0-125-3000-1874_s1770x1032.jpg?f52fad753beb582a85b1710fc9f6c2ec1ddbd99f", "published_at": "2019-09-09"}