{"pub": "afr", "url": "https://afr.com/world/europe/johnson-must-add-one-last-brexit-feat-20191018-p5323m", "downloaded_at": "2019-10-19 10:48:10.777419+00:00", "title": "Johnson must add one last Brexit feat", "language": "en", "text": "Tonight Boris Johnson, Prime Minister for fewer than 100 days, will attempt one of the greatest surprises in the British Parliament’s long history to match the ones he has achieved in the past few weeks. Mr Johnson has already defied expectations to re-open a Brexit deal the European Union said was closed. He has fudged the Irish conundrum on where to put the new border between Ireland and Northern Ireland by backflipping his old position and placing it in the Irish Sea, even bringing some Tory ‘Spartan’ hardliners with him. He got the ferocious Ulster loyalist Democratic Unionist Party to accept this symbolic divide between them and mainland Britain. Then he charmed Ireland’s Prime Minister Leo Varadkar into dropping Theresa May’s detested backstop, which had protected Irish interests by holding the British in the EU’s customs union until Brussels alone decided they could go.\n\nBoris has won Brussels. But can he win at home? AP\n\nTwo weeks ago these things looked impossible. Now Mr Johnson has to make the impossible add up again. He needs 320 votes to pass the Brexit deal. He depends on Labour pro-Brexit rebels breaking ranks, and excommunicated pro-Remain Tory rebels returning to the fold. Even then he is five short: while the ten DUP members have conceded over customs, they have baulked over consent, with a demand to keep veto powers on these arrangements that might defeat even Mr Johnson’s powers of creative vagueness.\n\nBut while Mr Johnson trails on numbers, he has momentum. Even if he loses tonight and delay beckons, he can claim that his threats to leave without a deal forced Brussels to negotiate, maintaining his credibility with his Leaver base, the biggest committed bloc of voters in the election around the corner. Labour’s Jeremy Corbyn now wants a second referendum– having opposed one for three years – but with no guarantee of a decisive result that either ends the country’s long Brexit Wars, or gets a better deal. Since Mr Johnson lost his majority in early September, Labour and his other parliamentary opponents have kept him dangling and unable to govern, refusing to vote for a fresh election while they pass laws blocking his government from leaving the EU without a deal. But with Mr Corbyn now 15 points behind in the polls, it’s his credibility that is collapsing as a result of these tactics, not Mr Johnson’s.\n\nThis deal may let each side avoid what they fear most: either more delays that leave Brexit dead; or, and less likely now, an uncontrolled slide into default no-deal on October 31.\n\nBut Britain is still taking an economic gamble with its future that almost everyone advised it against. The systemic political damage is already done, as a sovereign parliament tries to interpret the result of a deeply flawed direct plebiscite. Worst of all, this fight over legitimacy has undermined the idea of losers’ consent that allows democracies to move on.\n\nThe referendum has opened up a buried seam of populist nationalism in Tory England. It is more insular than imperialist; and oddly it is liberal metropolitan Remainers who have now become the most shrill, wrongly denouncing it as far-right chauvinism and colonial nostalgia. It’s true too that from the Civil War to the Sex Pistols, Britons have been given to passing bouts of radicalism. But if Brexit is won tonight, it must end the ideology and turn minds to the practicalities of life beyond the EU bloc.", "description": "The British Prime Minister has already exceeded all expectations. Now he has to make the impossible add up again.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3208%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_12%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/06d2689ff6c0130a1504329a2927851b63318b06", "published_at": "2019-10-18"}