{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/2019/10/11/judge-grants-request-sackler-family-owners-opioid-maker-purdue-pharma-halt-civil-lawsuits", "downloaded_at": "2019-10-12 00:18:58.466128+00:00", "title": "Judge grants request from Sackler family, owners of opioid maker Purdue Pharma, to halt civil lawsuits", "language": "en", "text": "\n\nPeople leave the U.S. District Court after Purdue Pharma's first hearing since filing for bankruptcy in White Plains, N.Y., on Sept. 17. (Seth Wenig/AP)\n\nWHITE PLAINS, N.Y. — A U.S. bankruptcy judge on Friday temporarily halted scores of lawsuits against Purdue Pharma, and its owners, the Sackler family, a request opposed by states who say the family siphoned billions in profits from the company.\n\nExtending that relief to the Sacklers, who haven’t filed for bankruptcy protection, is “extraordinary” but appropriate in this case, Judge Robert Drain said from the bench. Drain’s ruling stays action for three weeks in state and federal lawsuits against the Sackler family members, who own the company, as well as Purdue Pharma and related companies.\n\nDuring the three-week reprieve, Purdue Pharma agreed to address one of the key concerns raised by attorneys general who objected to including the Sacklers in the temporary injunction: Access to more information about the family’s finances.\n\n“We are disappointed by the court’s ruling, but pleased that it is limited in time to less than 30 days. We will use this time to ensure that we get access to the Sacklers’ financial information,” Connecticut Attorney General William Tong said in a statement.\n\nNew York Attorney General Letitia James, who also objected to including the Sacklers in the injunction, said: “We’re pleased with the court’s desire for transparency and its recognition of the public’s need to know the facts that led to this national epidemic. We look forward to further proceedings and holding the Sacklers responsible for the role they played in the opioid crisis.”\n\nIn a statement after the hearing, Purdue said the decision \"is an essential next step in preserving Purdue’s assets for the ultimate benefit of the American public. The company will work tirelessly and collaboratively during this pause in the litigation to continue to build support for the settlement structure.“\n\nBoth sides will return to court Nov. 6.\n\n[Purdue Pharma family profits from sale of ski resorts in regions plagued by opioid addiction]\n\nThe company argued that halting litigation was necessary to allow progress on a tentative settlement with more than 2,600 plaintiffs who have accused Purdue of deceptively marketing its blockbuster opioid pain pill, OxyContin. Without that protection, the Sacklers had said they may back out of the settlement, valued at $10 billion to $12 billion. As part of that deal, the Sacklers agreed to relinquish control of their firm and contribute at least $3 billion to the settlement.\n\nThe drug maker would inevitably be dragged into any litigation against the family, draining resources that could otherwise go to addressing the opioid crisis, Purdue Pharma’s attorneys argued. “Litigation against the Sacklers is litigation against Purdue,” Ben Kaminetzky, an attorney for Purdue Pharma, told the court. “Continued litigation harms everyone.”\n\n[Sacklers could hold on to most of personal fortune in proposed Purdue Pharma settlement]\n\nThe states that objected cited, among other things, deposition testimony stating that the Sackler family took $12 billion to $13 billion in cash out of Purdue Pharma. In light of those sums, the states contend, the Sacklers’ proposed $3 billion contribution to the settlement is not enough.\n\n“The problem is that the Sacklers who have $13 billion, $14 billion are getting a free pass by putting in $3 billion,” said Beth Kaswan, an attorney for some of the objecting parties. “I would like to see financial statements for all of the shell companies. [Otherwise] how will I know if they are further transferring assets that are already in shell companies.”\n\nDuring the more than seven hour hearing, Drain grew visibly frustrated and raised his voice several times while attorneys for states objecting to the injunction argued their cases. The state attorneys general “could be assured that the Sacklers are not getting a free ride on disclosures,” he said. “I think reasonable people can negotiate information sharing.”\n\n“It appears clear to me that the continued pursuit of litigation would materially affect the debtors” Purdue Pharma, he said. If one state’s lawsuit was allowed to continue, others would jump back into court as well, he said.", "description": "District Judge Robert Drain’s ruling is an unusual step halting action in about 25 lawsuits brought by various states against Purdue and members of the Sackler family, which owns the company. The stay only lasts for three weeks to give the parties time to seek more financial information about the family's finances.", "authors": ["Renae Merle", "Reporter Covering White-Collar Crime", "Wall Street", "October At Pm", "Renae Merle Covers White-Collar Crime", "Wall Street For The Washington Post. She Has Also Worked For The Wall Street Journal", "The Associated Press."], "top_image": "https://www.washingtonpost.com/resizer/lgLeFlkyFEVbjhD3eH_MahkjvyE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/AJCYFDGZPMI6TINFCYVYVHE4UI.jpg", "published_at": "2019-10-11"}