{"pub": "mirror", "url": "https://mirror.co.uk/money/thrifty-mum-bags-four-stunning-20558041", "downloaded_at": "2019-10-11 12:53:25.456199+00:00", "title": "Thrifty mum bags four stunning £139 Coast dresses for just 1p each", "language": "en", "text": "Get the biggest money stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA mum-of-two bagged the deal of the century when she saved more than £555 on dresses.\n\nMichelle Nolan, from Liverpool, pulled off one of the best bargains we've ever seen - bagging four Coast dresses for just 1p each.\n\n\"I thought it must have been a glitch,\" she said.\n\nBut it wasn't - and a few days later the dresses, which normally sell for £139 each, were delivered.\n\n\"I honestly didn’t expect them to turn up,\" Michelle said.\n\n“They arrived this morning to my shock and they were even nicer than they looked online. The pictures don’t do it justice.\n\n\"This is by far the the best bargain I have ever gotten.\"\n\n(Image: Michelle Nolan/Latestdeals.co.uk)\n\nThe good news is Michelle's explained exactly how she found the deal.\n\n\"I was shopping online on Sunday night on the House of Fraser website looking for a jacket for work,” Michelle told money-saving community LatestDeals.co.uk .\n\n“I browsed the sale items and then selected 'sort low to high', and this dress, along with a few other Coast bits, came up for 1p.\"\n\nAt that price though, not a lot was left.\n\n“A lot of them were sold out when I selected them, but I saw this dress and it was in stock so I ordered four dresses in two different sizes.\n\n\"I ordered four as my friend is planning her wedding and I thought she could use them for her bridesmaids' dresses if she likes them.\"\n\nIt might be the best deal she's seen, but Michelle, who has a 6-year-old son and a 4-year-old daughter, is no stranger to saving money.\n\n\"I have saved a fortune in bargains I have spotted on Facebook , from clothes, perfumes and candles to tons of toys for the kids,” Michelle said.\n\n“In Tesco, I use scan and shop to check prices and I have easily saved hundreds of pounds on kids' toys for birthdays and Christmas for my children as well as my nieces and nephews.\n\n\"I have managed to buy baby Annabelle dolls for £8 from £50!\"\n\nBut her key tip is the same one she used to bag the bargain dresses.\n\n\"Always check the sale categories and sort by price low to high: that way, you see what the best deals are without having to go through the thousands of sale pages,” Michelle said.", "description": "Mum of two Michelle Nolan bagged the deal of the decade when she spotted an astonishing discount online", "authors": ["James Andrews", "Image", "Michelle Nolan Latestdeals.Co.Uk"], "top_image": "https://i2-prod.mirror.co.uk/money/article20558177.ece/ALTERNATES/s1200/0_michelle.jpg", "published_at": "2019-10-11"}