{"pub": "usatoday", "url": "https://usatoday.com/story/sports/mlb/columnist/bob-nightengale/2019/10/14/gerrit-cole-astros-yankees-alcs-mlb/3978559002", "downloaded_at": "2019-10-14 23:29:52.364157+00:00", "title": "Having spurned the Yankees as a teenager, Astros' Gerrit Cole has another chance to break New York hearts", "language": "en", "text": "CLOSE What I'm Hearing: As Gerrit Cole takes the mound for Game 3 of the ALCS, our very own Bob Nightengale details his impending free agency and his potential suitors, one being the team he's about to face. USA TODAY\n\nNEW YORK — He's the one that got away for the New York Yankees.\n\nThe Yankees first laid eyes on him more than a decade ago, fell deeply in love, proposed, and were ready to exchange vows.\n\nBut for the past 11 years and four months, Gerrit Cole has done nothing but break the Yankees’ hearts.\n\nHe spurned the Yankees after they drafted him in the first round of the 2008 draft, choosing the college life at UCLA instead.\n\nStill infatuated, and seeing an opening, the Yankees strongly started pursuing him again two years ago.\n\nThe Pittsburgh Pirates announced they were breaking up with him, but instead of sending him to New York, traded him to the Houston Astros.\n\nALCS: Correa loses his mind after saving Astros' season\n\nMLB PLAYOFFS: Our idea for a new postseason award\n\nNow, putting out their feelings for the world to see, the Yankees once again are bracing themselves for heartbreak.\n\nOn Tuesday, the hottest pitcher in the game, takes the mound for the Houston Astros in Game 3 of the American League Championship Series at Yankee Stadium.\n\nIn his last 22 starts, Cole is 18-0 with a 1.66 ERA. He has 251 strikeouts in 162 ⅓ innings, yielding a .125 batting average.\n\n“I can’t think of anyone I’d rather pitch in this game,’’ Astros second baseman Jose Altuve said. “Come on, who’s better? And he loves this kind of situation.’’\n\nCole won Games 2 and 5 in the ALDS against Tampa Bay. (Photo: Troy Taormina, USA TODAY Sports)\n\nReally, the most intrigue in this game may not be the outcome, but how the Yankees' crowd reacts.\n\nDo they taunt him, jeer him and try to rattle him like any prideful Yankee fan knowing he can singlehandedly damper their World Series aspirations? Or are they on their best behavior, knowing they’ll have one final chance to wed this winter?\n\nHe’ll be a free agent, and to assure he lives happily ever after in New York, all it costs is cold, hard cash.\n\n“He is going to blow the doors off,’’ Astros teammate Wade Miley says. “Oh, my God, you think someone will give him $300 million? How about $260 million?’’\n\nCole, 29, is that good, and is just about a lock to eclipse David Price’s record setting contract with the Boston Red Sox – $217 million over seven years.\n\nWill the Yankees, who desperately need an ace, shell out that kind of money?\n\nHow about the Texas Rangers who are moving into their fancy new digs?\n\nThe St. Louis Cardinals could have a knockout 1-2 punch with Jack Flaherty.\n\nHey, if Anthony Rendon doesn’t take the Washington Nationals' money, why not give it to Cole?\n\nCould the Astros become the first team to have a $90 million trio of starters in Justin Verlander, Zack Greinke and Cole?\n\nWhy not a bidding war in Los Angeles between the Dodgers and Angels?\n\nCole, with players whispering sweet-nothings in his ear during the All-Star break, and dropping subtle recruiting hints throughout the year, is trying his best to keep a poker face, refusing to reveal his hand.\n\n“We’ll see,’’ Cole says. “That’s a question I’d be more prepared to answer in the offseason. I’m not really focused on that now.’’\n\nYet, those in the Astros’ clubhouse believe they know the vicinity where he’s headed, with outfielder Josh Reddick boldly predicting, “It will be west of Nevada.’’\n\n“We know he wants to be a West Coast guy,’’ Reddick says. “He’s a California guy, so he probably wants to be close to home. I know he mentioned Oakland a couple of times because of how he’s pitched there in the past.\n\n“But that probably won’t happen. They’d have to clear the whole roster to afford him.\n\n“It makes you wonder what teams are going to be able to afford him, because there’s so many teams that can’t afford somebody like that.’’\n\nPredictions, anyone?\n\n“I got the Angels,’’ Miley says, “and paying him at least $250 million.’’\n\nAnd sticking a dagger into the Yankees’ hearts one final time.\n\nThe Yankees’ attraction to Cole more than a decade agol, convinced he had the makings to be a star. Scouting director Damon Oppenheimer was among those at the game when Cole nearly threw a no-hitter for Orange Lutheran, firing 96-mph fastballs, only for a kid named Shane Boras to break it up with an opposite-field single. That kid’s father, Scott Boras, became Cole’s advisor and agent.\n\nThe Yankees drafted him with the 28th pick in 2008, and figured it would be no problem signing. Besides, didn’t Cole tell them he always loved the Yankees? He was the 11-year-old kid who sat in the front row of the 2001 World Series between the Yankees and Arizona Diamondbacks, holding a sign that read: “Yankees Fan Today, Tomorrow, Forever.’’\n\nYet, when it came time to negotiate a professional contact and listen to the Yankee proposals, there was only silence.\n\n“Our scouting was absolutely accurate,’’ Cashman says, “but the signability was completely wrong. He was going to college. They had no interest in even entertaining offers.\n\n“They come from money, so he didn’t need the money, and the dad really wanted him to have the college experience. So, he had the best of both worlds.’’\n\nSays Cole: “My Dad and I put an evaluation of what a UCLA education was valued at, how that compared to where I got drafted, and what the signing bonus would be. It was just too large of a discrepancy.\n\n“They were really understanding, but at that point, they had just signed A.J. [Burnett] and CC [Sabathia]. They were gearing up for the World Series. So they had bigger fish to fry.’’\n\nThe Yankees never had a chance to re-draft him three years later. The Pirates had the first overall pick. They spent $8 million to make sure he didn’t get away.\n\nA decade after drafting him the first time, the Yankees thought they had another chance to finally land him, making a series of strong trade proposals to the Pirates. On Jan. 13, 2018, Pittsburgh sent him to Houston and not New York, receiving a package of Joe Musgrove, Michael Feliz, Colin Moran and Jason Martin.\n\nThe Yankees were spurned again.\n\n“Beauty is in the eye of the beholder,’’ Cashman said, “so obviously Pittsburgh felt their best deal was with the Astros.’’\n\n“Some things are not meant to be.’’\n\nHe went 20-5 with a league-leading 2.50 ERA during the regular season, and although the Tampa Bay Rays thought he might regress to the mean, he actually took his game to a different level in the AL Division Series. He faced 54 batters, struck out 25 of them, and permitted only six hits and a walk.\n\n“He’s like the kid still pitching in Little League that was a little too good for the league, you know?” said Yankees manager Aaron Boone, wanting to check his birth certificate. “He’s obviously a great pitcher in the prime of his career. And he’s in a really good stretch right now.’’\n\nHe’s not just dominating teams, but embarrassing them, striking out 351 batters in 228 innings in the regular season and postseason, generating 676 swings-and-misses this season. It’s the most strikeouts by a right-handed pitcher since Nolan Ryan in 1974.\n\n“It’s crazy what he’s doing right now,’’ said former Cy Young and MVP winner Justin Verlander. “He just keeps getting better and better.’’\n\nVerlander and Cole, who will almost certainly finish 1-2 in the Cy Young voting this season, got their families together for a celebration last week after clinching the Division Series. Cole had his mom and dad in town, aunt and uncle, friends, and a certain brother-in-law who has made him awfully envious over the years.\n\nCole’s wife, Amy, is the sister of San Francisco Giants shortstop Brandon Crawford, who just so happens to have a couple of World Series rings in his jewelry box.\n\n“That’s what I want,’’ Cole says. “I think about it all of the time.\"\n\nCole isn’t sure who’s coming to New York for his first playoff game at Yankee Stadium Tuesday, but with a day game, and the possibility of nasty shadows around home plate, he’d sure love to see sunny skies.\n\n“New York. Cold weather,’’ he says. “It will feel very Octoberish. That’s when you’ve got to perform your best, in October.\n\n\"It’s the biggest stage. And it’s the most fun. I just wish it could be the postseason all of the time, but you have to work your ass off to get there.\"", "description": "Houston's dominant right-hander was the Yankees' first-round pick all the way back in 2008, but he chose to go to college instead of signing.", "authors": ["Bob Nightengale", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/14/USAT/63668fb4-308c-4b7f-949a-1033037eb298-USATSI_13493252.jpg?crop=2995,1684,x785,y108&width=3200&height=1680&fit=bounds", "published_at": "2019-10-14"}