{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7584547/Victoria-Beckham-means-business-chic-checked-skirt-suit-steps-NYC.html", "downloaded_at": "2019-10-18 01:17:53.506003+00:00", "title": "Victoria Beckham means business in chic checked skirt suit as she steps out in NYC", "language": "en", "text": "She has been blazing the promo trail with her new cosmetics line.\n\nSo naturally, Victoria Beckham is determined to look sensational at every turn - as proved once again on Thursday when she stepped out in New York.\n\nThe fashion designer, 45, who recently stated she is 'more confident' now she's older, looked sensational in an elegant two-piece while donning the same £1,190 leather peep toe boots she has favoured in recent days.\n\nA vision: So naturally, Victoria Beckham is determined to look sensational at every turn - as proved once again on Thursday when she stepped out in New York\n\nVictoria looked simply stunning as she strutted out of the hotel in an elegant suit complete with a perfectly tailored skirt and an elegant blazer.\n\nMaking the ensemble pop, the brunette beauty paired the look with a chic red shirt and held on to a golden clutch bag with a silver clasp.\n\nAs with the day before, the stunner caught the eye in the £1,190 leather peep toe boots, which showed off her pillar box red pedicure.\n\nHer brunette tresses were slicked into a chignon at the nape of her neck while she covered her eyes with a pair of over-sized sunglasses.\n\nHappy days: The fashion designer, 45, who recently stated she is 'more confident' now she's older, looked sensational in an elegant two-piece while donning the same £1,190 leather peep toe boots she has favoured in recent days\n\nMiaow! She wore the leopard print boots the day before - proving herself to be quite the fan of the chic heels\n\nStunner: Her brunette tresses were slicked into a chignon at the nape of her neck while she covered her eyes with a pair of over-sized sunglasses\n\nVictoria arrived in Manhattan earlier this week to promote her new self-titled beauty brand, after launching it in the UK.\n\nAcross the pond, the mother-of-four appeared on This Morning in a pre-recorded segment, where she revealed she feels more confident in herself and spoke about how she used to have 'little paranoias' when she was younger.\n\nVictoria said: '[I] definitely feel more confident now. Definitely. There were things that I used to, little paranoias that I used to have when I was younger about myself that I just don’t care so much about now that I’m older.\n\nExpensive taste: As with the day before, the stunner caught the eye in the £1,190 leather peep toe boots, which showed off her pillar box red pedicure\n\nLuxury: Posh Spice was staying at The Mark Hotel\n\nStepping out: other.' On Tuesday, the fashion designer was quizzed by Hoda Kotb on the Today show about the 'secret sauce' that has kept her romance with husband David working for so long\n\n'You know, I think it’s about focusing on the good bits and just being kind to yourself, you know. I mean, I think everybody should be kind to themselves and kind to each other.'\n\nOn Tuesday, the fashion designer was quizzed by Hoda Kotb on the Today show about the 'secret sauce' that has kept her romance with husband David working for so long.\n\nAdmitting they always put their four children first, she said: 'The kids are our priority, everything we do revolves around the children. We both work really hard, we love what we do professionally.", "description": "The fashion designer, 45, who recently stated she is 'more confident' now she's older, looked sensational in an elegant two-piece", "authors": ["Ciara Farmer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/16/19843838-0-image-a-114_1571324820077.jpg", "published_at": "2019-10-17"}