{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/12/nfl-hurdling-basketball-ejections-and-a-cyclists-imaginary-penalty", "downloaded_at": "2019-09-12 11:32:14.397548+00:00", "title": "NFL hurdling, basketball ejections and a cyclist's imaginary penalty | Classic YouTube", "language": "en", "text": "1) The NFL is back, baby, and game of the opening weekend had to be New Orleans Saints’ last-gasp 30-28 victory over Houston Texans. There was an officiating blunder and three scoring plays in the dramatic finale, including a monstrous 58-yard match-winning field goal by Wil Lutz as time expired. Play of the weekend? How about Washington’s Vernon Davis hurdling his way to a 48-yard touchdown against Philadelphia Eagles? DJ Chark’s over-the-shoulder catch from a monstrous pass to score for the Jaguars against the Chiefs was seriously impressive too.\n\n2) Is Astou Ndour’s ejection for Chicago Sky against Washington Mystics the harshest in basketball history?\n\nAstou Ndour (@NdouraStou) I have always shown great respect for the referees and my career supports me.I still don't understand very well what happened today and I don't agree, but I respect the decision.I will continue to work hard.Let’s go #Quickturn #Bigchallengecoming #Playoffstime #SkyTown@WNBA⁩ pic.twitter.com/2jWNlcCXYy\n\n3) There were some sublime goals over the weekend, none more so than from Chelsea’s Bethany England, who sealed a 1-0 win against Spurs in front of 25,000 fans at Stamford Bridge on the opening weekend of WSL with a sumptuous strike. But was it better than Caroline Weir’s match-winner for City in the Manchester derby? You decide. In Euro 2020 qualifying, there weren’t many goals hit more ferociously than Marcel Halstenberg’s against Northern Ireland. We’ve seen that technique before haven’t we? Ah yes, Benjamin Pavard. And in case you missed it, Rochdale have been quietly reinventing themselves as Guardiola-era Barcelona this season.\n\n4) For some reason or other, the Vuelta riders did a lap of the San Mamés stadium as they departed Bilbao. It was a curious sight as the high-tech bikes trundled en masse around the turf. One rider, Edward Theuns, couldn’t help himself and raced off to the penalty spot to take an imaginary penalty with his cycle helmet. Chapeau!\n\n5) For cricket fans the Oval Test tends to herald the encroaching of autumn, and the latest one ever begins on Thursday, with the final Ashes Test now something of a dead rubber. So let’s relive some that had a few more at stake, starting way back in 1953 when England finally and famously regained the Ashes to end a 19-year drought. Viewers of Sky during rain breaks are more than familiar, of course, with Kevin Pietersen’s heroics in 2005 that ended a similar run of Australian dominance. England’s series-clincher in 2009 was pretty memorable too, with Stuart Broad’s turbo-charged spell and Andrew Flintoff signing off his Test career with his sensational run-out of Ricky Ponting. Lest we be accused of Anglocentric bias, let’s rewind to 2001, a dead-rubber, when perhaps the greatest Australian side of recent times put England to the sword once more, thanks in part to a crocked Steve Waugh’s heroic hundred.\n\n6) We don’t think anything will beat this ridiculous kick-off return in the end-of-season college football highlights package.\n\nOur favourites from below the line last week\n\n1) Surf’s up: a spectacular paddle-in wave from Nathan Florence at Teahupoo.\n\n2) Good old Nicklas Bendtner not quite finding his shooting range in training.\n\n3) Adrenaline junkies might enjoy this tightrope walk. Vertigo sufferers, not so much.\n\n4) And the genius side of Nick Kyrgios, away from all the strops.\n\nSpotters’ badges: whobroughtoranges, evilboy 14, BlackCaeser.\n\nGuardian YouTube football channel\n\nDo subscribe if you fancy.\n\nGuardian YouTube sport channel\n\nDo subscribe if you fancy.", "description": "This week’s roundup also features Oval Ashes Test memories, WSL highlights and some spectacular surfing", "authors": ["Guardian Sport"], "top_image": "https://i.guim.co.uk/img/media/e59e90c40dcf79d10c2c8c3f00f1e82b82babbf9/0_0_5312_3187/master/5312.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=bbe23467e1dd86f9182235420f41c10d", "published_at": "2019-09-12"}