{"pub": "usatoday", "url": "https://usatoday.com/story/sports/horseracing/2019/10/27/santa-anita-36th-horse-dies-southern-california-track/2482366001", "downloaded_at": "2019-10-28 02:45:11.632911+00:00", "title": "Two-year-old filly Bye Bye Beautiful becomes 36th horse to die at Santa Anita race track", "language": "en", "text": "CLOSE\n\nARCADIA, Calif. (AP) — A 2-year-old filly injured her right front leg less than a half-mile from the finish line in a race at Santa Anita and was euthanized, the 36th horse to die at the Southern California track since December.\n\nThe incident occurred in Sunday's third race. It was the second fatality in three days and the fourth since the fall meet began Sept. 27.\n\nSanta Anita is hosting the Breeders' Cup world championships this week for a record 10th time.\n\nBye Bye Beautiful was pulled up past the half-mile pole by jockey Tiago Pereira. Track veterinarian Dr. Dana Stead saw that the filly had sustained a right front leg lateral condylar fracture that involved the medial sesamoid bone. Because of the severity of the injury, Stead made the decision to euthanize the horse, according to a statement from The Stronach Group, which owns the track.\n\nPereira wasn't injured.\n\nBye Bye Beautiful will undergo a necropsy at UC Davis, which is required by the California Horse Racing Board.\n\nThe filly was making her second start for trainer Eric Kruljac. She was fourth in her first start last month at Los Alamitos in Orange County.\n\nOn Friday, a 6-year-old mare named GQ Covergirl injured her front legs on the training track and was euthanized.\n\nKy. Colonel, a 5-year-old gelding, collapsed and died from an apparent heart attack while jogging on the training track Oct. 6.\n\nSatchel Paige, a 3-year-old gelding, was euthanized after breaking his left front ankle during a race Oct. 19.", "description": "A 2-year-old filly was injured at Santa Anita and euthanized Sunday, becoming the 36th horse to die at the Southern California track since December.", "authors": ["Associated Press", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/28/USAT/9fc52434-ad82-4128-8cbf-086180192779-AFP_AFP_1LP955.JPG?crop=4253,2392,x0,y66&width=3200&height=1680&fit=bounds", "published_at": "2019-10-27"}