{"pub": "indiatimes", "url": "https://femina.in/relationships/love-sex/should-you-break-up-over-whatsapp-133796.html", "downloaded_at": "2019-10-13 12:22:35.688649+00:00", "title": "Should you break up over WhatsApp?", "language": "en", "text": "Next Story : 9 ethnic styles you should try this festive season\n\nBreaking up with someone is always a sad affair. Normally, as the past generation was wont to do, one would be expected to meet his or her lover in person and slowly break the news. But, in this digital age, ending a relationship can be a little more complicated. Thanks to the ever burgeoning world of online or mobile messaging services, people may be tempted to break up over just a WhatsApp message. That may help one to avoid emotional drama or ugly one-on-one fights. But, the point is, should you really break up over text messages, even if you have dated the person for a very short while? Let's weigh the pros and cons.Do ask yourself this question before you decide to end a relationship over a messaging service. Would you have yourself liked it? Wouldn't you feel hurt and humiliated? Basically, try to treat him the same way as you'd treat yourself.If it had been a serious relationship, meeting in person would perhaps be a better idea. After all, that's what relationship etiquette demands. You have shared precious moments together, so meeting him in person for a final goodbye seems reasonable and considerate.No matter how serious the relationship had been, if it had been an abusive love affair, it's better to quit over text messages. Maintain your distance from an abuser at all costs.Saying goodbye in person can be emotionally overwhelming. A lot of things may remain unsaid. So, perhaps, it's better if you take your time, think it over and write an extensive goodbye text. You can pour your heart out, leaving nothing unsaid.", "description": "It may help your avert drama and fights, but should you really break up via online messages? Let's weigh the pros and cons.", "authors": [], "top_image": "https://femina.wwmindia.com/content/2019/sep/breaks1567582505.jpg", "published_at": "2019-09-05"}