{"pub": "fox", "url": "https://foxnews.com/opinion/curtis-hill-investigation-into-google-aims-to-protect-consumers-and-free-market", "downloaded_at": "2019-09-15 00:07:52.087201+00:00", "title": "Curtis Hill: Is Google an illegal monopoly? 48 state attorneys general – including me – are investigating", "language": "en", "text": "“Our aim is not to do away with corporations,” President Theodore Roosevelt once said. “We are not hostile to them; we are merely determined that they shall be so handled as to subserve the public good. We draw the line against misconduct, not against wealth.”\n\nA few days ago I stood shoulder-to-shoulder with fellow attorneys general on the steps of the U.S. Supreme Court. The occasion was our announcement of a wide-ranging multistate investigation into Google’s business practices – particularly its advertising techniques and its search engine.\n\nGOOGLE HITS BACK AT CRITICS AMID ANTITRUST INVESTIGATIONS\n\nWe are determined to learn whether this giant of the tech industry has engaged in anti-competitive behavior in violation of state and federal antitrust laws.\n\nPerhaps the most remarkable aspect of this investigation is its bipartisan nature. Our group of attorneys general includes 26 Democrats and 23 Republicans. We represent 48 states, Puerto Rico and the District of Columbia. These days, achieving this kind of consensus among so diverse a collection of individuals is a virtual miracle.\n\nThe common cause that brings us together is our mutual interest in protecting our states’ consumers by making sure Google plays by the rules.\n\nWe’re talking about a company that controls a hefty chunk of all online searches and advertising.\n\nIn fact, as The Washington Post reported, Google captures 75 percent of all spending on U.S. search ads. This year the company is forecast to earn more than $48 billion in U.S. digital ad revenue. Google’s parent company has more cash on hand – $117 billion – than any other company in the world.\n\nOn Google’s explosive success, let’s be clear: If the company has gained its advantages in the marketplace through free and fair competition, then good for Google. There is no doubt, after all, that Google provides useful products and valuable services to Americans and others around the globe.\n\nThese days, folks looking for relevant information online are figuring out that Google’s top search results often take them to entities paying premium fees to appear first in the search results. Or, in other cases, the top search results lead them to other Google-operated sites such as YouTube.\n\nIf facts uncovered in this investigation indicate that Google engaged in calculated manipulation to improperly thwart competition, however, then we must pursue appropriate follow-up actions to protect the free market. We must promote conditions under which all entities may compete on a level playing field in accordance with the rule of law.\n\nIn the long run, monopolies often wind up providing customers lower quality and/or higher prices than companies forced to compete.\n\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\n\nThese days, folks looking for relevant information online are figuring out that Google’s top search results often take them to entities paying premium fees to appear first in the search results. Or, in other cases, the top search results lead them to other Google-operated sites such as YouTube.\n\nConsider the wisdom of economist Milton Friedman, who spent his life advocating for the free market.\n\n“The great danger to the consumer is the monopoly – whether private or governmental,” Friedman once said. “His most effective protection is free competition at home and free trade throughout the world. The consumer is protected from being exploited by one seller by the existence of another seller from whom he can buy and who is eager to sell to him.”\n\nGoogle’s control of online advertising markets has been particularly harmful to online journalism outlets and other web publishers. Free societies benefit when the marketplace rewards the dissemination of news, research and ideas produced by diverse sources.\n\nSpeaking for myself, I never take lightly the decision to participate in actions against businesses.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWe all recognize the great contributions of companies large and small to the American way of life: employing workers; providing goods and services to consumers; generating tax revenue and producing all the other benefits that businesses create for society in general.\n\nWe all should support policies that enable businesses to innovate and thrive. This includes maintaining an environment of free and fair competition.\n\nJust like individual citizens, corporations must be held accountable for following the law. To this end, I look forward to continuing to work with my fellow state attorneys general to continue this investigation.\n\nCLICK HERE TO READ MORE BY CURTIS HILL", "description": "The bipartisan investigation into Google's business practices aims to protect consumers by making sure the tech giant plays by the rules.", "authors": ["Curtis Hill", "Curtis Hill Is Indiana S Attorney General."], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/10/694940094001_6085003690001_6085002488001-vs.jpg", "published_at": "2019-09-14"}