{"pub": "thehill", "url": "https://thehill.com/policy/healthcare/464948-2020-democrats-embrace-aggressive-step-on-drug-prices", "downloaded_at": "2019-10-09 10:42:23.155591+00:00", "title": "2020 Democrats embrace aggressive step on drug prices", "language": "en", "text": "Democratic presidential candidates are threatening to take a drastic step that even the Obama administration rejected to lower drug prices without congressional approval.\n\nADVERTISEMENT\n\nThe move involves invoking an obscure section of a 1980 law to break the patent on a drug when it is priced too high. The idea, known as \"march-in rights,\" would allow the government to \"march in\" and break a patent to allow a cheaper version of a drug to be made by another company.\n\nThe move has long been controversial and the authority to use it has never been invoked before. But Democratic presidential candidates are increasingly embracing the idea and touting it as a concrete action they could take if they win the White House, given that it does not require congressional action.\n\nCandidates have also touted the idea as a way to one-up President Trump Donald John TrumpPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Trump directed Perry, State Dept. officials to talk to Giuliani on Ukraine: report Murkowski warns against rushing to conclusions on Trump impeachment MORE on drug prices, an issue which is a top priority for voters. While Trump has railed against high drug prices and proposed some steps to address the issue, he has yet to oversee any major action that has gone on to lower prices.\n\nADVERTISEMENT\n\nBreaking drug patents to lower prices gained new attention on Monday, when South Bend, Ind., Mayor Pete Buttigieg Peter (Pete) Paul ButtigiegSmall-dollar donors reshape Democratic race Fifth DNC debate to be held Nov. 20 in Georgia Warren, Biden running neck and neck in Democratic primary: poll MORE, a Democratic contender, included it in his campaign proposal on drug prices.\n\nSens. Bernie Sanders Bernie SandersBudowsky: Biden and Warren at POTUS Rubicon Sanders says he'll slow down pace on campaign trail after heart attack Small-dollar donors reshape Democratic race MORE (I-Vt.) and Kamala Harris Kamala Devi HarrisSmall-dollar donors reshape Democratic race Fifth DNC debate to be held Nov. 20 in Georgia Feinstein officially endorses Biden: 'I've seen firsthand his legislative ability' MORE (D-Calif.) have proposed the idea in their plans as well.\n\nThe plan has long been championed by the progressive wing of the party, but the support from Harris and Buttigieg shows its growing acceptance by more mainstream Democrats as well, a stark shift in recent years.\n\n“It’s a completely different game,” said Peter Maybarduk, a director at the progressive group Public Citizen, which champions the idea. “It’s become pretty mainstream over the past few years.”\n\nWhile Democrats have many ideas to lower drug prices, such as allowing the secretary of Health and Human Services to negotiate prices, the march-in proposal is key because it does not require Congress, meaning a Democratic president could use it even if the Senate remains in Republican hands in 2021.\n\n“This is an easy thing for the government to do,” Maybarduk said. “These are all tools the president can use with a stroke of a pen.”\n\nIn a sign of the shifting terrain, as recently as 2016, the Obama administration was declining to use the authority.\n\nObama officials rejected a push from advocates in 2016 to break the patent on the prostate cancer drug Xtandi, which had a list price of about $129,000.\n\nThe march-in authority is available when public funding through research at the National Institutes of Health (NIH) was used to develop a drug and the drug is not available to the public on “reasonable terms.”\n\nNIH Director Francis Collins noted in his 2016 rejection letter that Xtandi was not in “short supply,” but advocates think the standard should be the price, not just whether there is a shortage of the drug.\n\n2020 Democrats, though, are vowing to move more aggressively.\n\nSanders in August said if elected his administration “will exercise federal march-in rights.”\n\n“The greed and corruption of the pharmaceutical industry is killing Americans,” he added. “When I am President, starting on my first day in office, that greed and corruption will come to an end.\"\n\nHarris and Buttigieg have said they would use the authority for “egregious offenders” and “worst offender” drug companies, respectively.\n\nWarren has not made the push as explicitly during this campaign, but she did join a 2016 letter, along with Sanders, praising the idea of march-in rights and urging the Obama administration to hold a public hearing on invoking it over Xtandi\n\nBiden, who has tied himself closely to his former boss Obama, particularly on health care, remains a question mark on the issue.\n\nThe pharmaceutical industry, a powerful force in Washington, though, fiercely opposes the idea, warning it would harm their ability to develop new treatments.\n\n“Circumventing patent rights on medical innovation with march-in — which has never been used — threatens our country’s ability to remain competitive,” said Tom Wilbur, a spokesman for the Pharmaceutical Research and Manufacturers of America.\n\n“The effect of government marching-in and forcing companies to hand over [intellectual property] rights because of cost will only jeopardize our country’s ability to deliver new medicines to address our most costly and challenging diseases,” he added.\n\nBut breaking drug company patents also has support from others in the health care industry. America’s Health Insurance Plans, the insurance industry trade group, called for using similar authority, known as Section 1498, in a letter to the Trump administration last year.\n\n“Nobody has used it for this purpose, but we now are seeing multiple presidential candidates saying they now will invoke this authority,” said Maura Calsyn, a health policy expert at the Center for American Progress, a think tank aligned with mainstream Democrats and that supports using march-in rights to lower drug prices.\n\nCalsyn said the idea from the Democratic side stands in contrast to Trump’s moves.\n\n“You haven’t heard anything about this in all of their talk about lowering drug prices, which they haven’t done,” she said.", "description": "Democratic presidential candidates are threatening to take a drastic step that even the Obama administration rejected to lower drug prices without congressional approval.", "authors": [], "top_image": "https://thehill.com/sites/default/files/meds_money.jpg", "published_at": "2019-10-09"}