{"pub": "guardian", "url": "https://theguardian.com/science/2019/oct/09/nobel-prize-in-chemistry-awarded-for-work-on-lithium-ion-batteries", "downloaded_at": "2019-10-09 12:00:42.397553+00:00", "title": "Nobel prize in chemistry awarded for work on lithium-ion batteries", "language": "en", "text": "The Nobel prize in chemistry has been awarded to three scientists for their work in developing lithium-ion batteries.\n\nJohn B Goodenough of the University of Texas at Austin, M Stanley Whittingham of Binghamton University and Akira Yoshino of Meijo University will receive equal shares of the 9m Swedish kronor (£74o,000) prize, which was announced by the Royal Swedish Academy of Sciences in Stockholm on Wednesday.\n\nAt 97 years old, Goodenough is the oldest laureate to receive a Nobel prize in any discipline; Whittingham is the second British-born researcher to win a science Nobel this year.\n\nIon age: why the future will be battery powered Read more\n\nLithium-ion batteries have long been tipped for the award, not least since they have proved pivotal in the development of the high-tech world we inhabit.\n\n“Lithium-ion batteries have brought the greatest benefit to humankind,” the academy said.\n\nFar lighter and more compact that earlier types of rechargeable battery, they are found in everything from mobile phones to laptops and electric cars.\n\n“The [electric car] batteries no longer weigh two tonnes, but 300kg,” said Prof Sara Snogerup Linse, a member of the Nobel Committee for Chemistry. “The ability to store energy from renewable sources, the sun, the wind, opens up for sustainable energy consumption,” she added.\n\nWhen asked how it felt to receive the call, Yoshino simply said “Amazing, surprising”.\n\nSpeaking in an interview with the Times earlier this year, Goodenough said he had not appreciated the impact his work would have.\n\n“At the time we developed the battery it was just something to do,” he said. “I didn’t know what electrical engineers would do with the battery. I really didn’t anticipate cellphones, camcorders and everything else.”\n\nWednesday was already expected to be a particularly good day for Goodenough – he is to receive the prestigious Copley medal at the Royal Society in London in the evening.\n\nProf Mark Miodownik, a materials expert at University College London, said it was right that lithium-ion batteries were celebrated. “They are one of the most influential pieces of materials science that influence the modern life of everyone on the planet,” he said.\n\n“It is remarkable too that although 30 years old, they have not been eclipsed by a better battery technology even now, which makes you realise what a remarkable discovery they are.”\n\nBatteries work by turning chemical energy into electricity. A typical battery is made up of two electrodes, an anode and a cathode, which are usually separated by a liquid that can carry charged particles.\n\nBoth electrodes are connected to an electrical circuit. When the battery is powering an electrical device, electrons travel from the anode to the cathode through the electrical circuit, while positively charge ions move through the electrolyte. In a rechargeable battery, energy can be put into the device to reverse this process.\n\nWhile rechargeable batteries were around in the 1970s, they had drawbacks, not least in the amount of energy they could store. Lithium, it was thought, could be an answer since it is a very light metal and easily loses an electron. However, lithium’s reactivity also made it tricky to harness.\n\nIn the 1970s Stanley Whittingham cracked the problem when looking to develop approaches for fossil-free energy in light of the oil crisis. His device, the first functional lithium battery, used lithium metal in the anode and lithium ions tucked into titanium disulphide for the cathode. Unfortunately, when this battery was repeatedly recharged, it ran the risk of exploding – a situation the local fire brigade were, apparently, none too pleased about. To improve safety, Whittingham combined metallic lithium with aluminium in the anode.\n\nGoodenough picked up the baton at the University of Oxford, and replaced the titanium disulphide in the cathode with cobalt oxide – an approach that doubled the voltage produced.\n\nYoshino used the cathode developed by Goodenough to create the first commercially-viable lithium-ion battery in 1985, with the anode in his battery composed of lithium ions and electrons housed within a carbon material called petroleum coke.\n\nThe upshot was a lightweight, compact battery that could be recharged many, many times – the bedrock of modern technology. The battery continues to be developed, not least to improve its environmental impact.\n\nProf Dame Carol Robinson, president of the Royal Society of Chemistry, said battery technology remains an exciting field.\n\n“It’s not the end of the journey, as lithium is a finite resource and many scientists around the world are building on the foundations laid by these three brilliant chemists,” she said.\n\nOn Monday, William Kaelin, Sir Peter Ratcliffe and Gregg Semenza won the 2019 Nobel prize in physiology or medicine for their work on understanding how cells adapt to low levels of oxygen, and on Tuesday the physics prize was shared between James Peebles, Michel Mayor and Didier Queloz for their work on cosmology and the discovery of the first exoplanet.\n\nTwo literature awards will be announced on Thursday after last year’s prize was postponed, the peace prize winner will be announced on Friday, followed by economics on Monday.", "description": "John B Goodenough, M Stanley Whittingham and Akira Yoshino honoured for development that sparked portable technology revolution", "authors": ["Nicola Davis"], "top_image": "https://i.guim.co.uk/img/media/562affa359cbe92872816437365299dbf1802002/26_94_741_445/master/741.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3bb97042a5555240e52ae638fd24f1cb", "published_at": "2019-10-09"}