{"pub": "marketwatch", "url": "https://marketwatch.com/story/esper-recuses-himself-from-decision-on-jedi-cloud-contract-because-of-sons-employer-2019-10-22", "downloaded_at": "2019-10-23 08:50:21.116079+00:00", "title": "Esper recuses himself from decision on JEDI cloud contract because of son’s employer", "language": "en", "text": "WASHINGTON — Defense Secretary Mark Esper has removed himself from decision-making on a cloud computing contract potentially worth $10 billion, citing his son’s employment with one of the original contract bidders.\n\nIn a written statement Tuesday, Pentagon spokesman Jonathan Hoffman said Esper recused himself from decisions on the so-called JEDI contract “out of an abundance of caution to avoid any concerns regarding his impartiality.”\n\nThe Pentagon is in the final stages of determining the winner of the initial $1 million Joint Enterprise Defense Infrastructure, or JEDI, contract, which could be worth as much as $10 billion over 10 years if all options are exercised.\n\nHoffman did not identify Esper’s son by name. His son Luke is identified on his LinkedIn page as a “digital strategy consultant” at IBM, which was an original bidder for the JEDI contract.\n\nIBM IBM, +1.04% was dropped from the competition, along with Oracle ORCL, -1.85% , and both companies have complained that the contracting process is rigged in favor of Amazon Web Services Inc., a division of Amazon AMZN, -1.12% .\n\nAmazon and Microsoft Corp. MSFT, -1.49% are finalists for the contract.\n\nA U.S. Federal Claims Court judge last summer ruled in favor of the Pentagon’s assertion that the contracting process has been fair. In August, the Pentagon’s independent auditor disclosed that it was conducting a broad review of the handling of the project. The probe includes an investigation of potential misconduct by current or former Defense Department officials involved in the project.\n\nHoffman said Esper was not legally required to recuse himself, but did so after receiving what Hoffman called informational briefings on the JEDI contract.\n\nEsper delegated decision-making responsibility on the JEDI program to Deputy Defense Secretary David Norquist, Hoffman said.", "description": "Defense Secretary Mark Esper has removed himself from decision-making on a cloud computing contract potentially worth $10 billion, citing his son’s...", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HL963_esper0_ZG_20190622141639.jpg", "published_at": "2019-10-22"}