{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7630297/Drop-rate-higher-students-unconditional-offers.html", "downloaded_at": "2019-10-30 12:09:47.355866+00:00", "title": "Drop-out rate higher among students with unconditional...", "language": "en", "text": "Teenagers who are given unconditional university offers are more likely to drop out, new figures show.\n\nDrop-out rates are 10% higher for students who accepted an unconditional offer than would have been expected if they had taken up an offer that had conditions attached, according to universities regulator the Office for Students.\n\nIt means that hundreds of students who would have been expected to continue their studies are dropping out of degree courses in their first year at English universities and colleges.\n\nThe watchdog said it was concerned at the figures, warning that admissions systems are “not fair and not working in students’ best interests”.\n\nWe have published new analysis which reveals that young people who receive unconditional offers before getting their exam results are more likely to drop out in their first year of university: https://t.co/IW2pCzhILt#university #college #unconditionaloffers #courses pic.twitter.com/RlVseqQNiS — The Office for Students (OfS) (@officestudents) October 30, 2019\n\nSchool leaders agreed and said students should be encouraged to choose courses that best suit their interests and ambitions, rather than those for which they were given unconditional offers.\n\nThe OfS analysis, which covers 18-year-olds in England at English universities and colleges, shows the recorded non-continuation, or drop-out, rate, for students who accepted unconditional offers was 7.08%.\n\nUsing modelling, the regulator estimates a non-continuation rate of 6.44% if these unconditional offers were replaced with conditional offers.\n\nTherefore, the OfS says, the dropout rate is 10% higher for students who accepted unconditional offers than would have been expected if they had accepted conditional offers.\n\nThe analysis goes on to say that, across the 2015/16 and 2016/17 academic years, this equates to 185 fewer students continuing with their studies.\n\nIf these patterns continue, and the rates of unconditional offers made continues to rise, more than 200 students a year who would have been expected to continue their degree studies could drop out, the OfS said.\n\nThe figures take into account other factors that can affect continuation rates, such as what subjects students study and where.\n\nThere has been growing concern about the rising use of unconditional offers – in which students are guaranteed a place at an institution, regardless of their results in their A-levels or other qualifications – and in particular the use of “conditional unconditional” offers.\n\nThis is when a student is given an unconditional place on the condition that they make a university or college their firm first choice.\n\nThere are fears that such offers lead to sixth-formers taking their foot off the pedal during their studies, and not scoring as good grades as they may have been expected to achieve in their A-levels and other qualifications.\n\nIn 2012 and 2013, under 1% of university applicants held at least one unconditional offer, but by 2018, this had risen to nearly one in four (23.7%).\n\nLatest figures suggest that this year (2019), as at the end of June, more than 24.5% of applicants held at least one unconditional offer.\n\nOfS chief executive Nicola Dandridge said: “We already know that students who receive an unconditional offer are more likely to miss their predicted grades at school. It is a cause of real concern that they are also more likely to drop out of university once they get there.\n\n“Drop-out rates are overall low in England, so this is a small effect. But we are not talking about one or two students – this is a couple of hundred students per year who have made a significant investment of time and money in a degree from which they are unlikely to benefit.”\n\nSome unconditional offers are necessary, Ms Dandridge said, but “many are not”.\n\n“Although it is up to universities to decide who to admit and how, they must take responsibility for the impact of those decisions, and provide the right support for all students to be successful – especially if the offer they receive makes them less likely to do well at school.\n\n“As our regulatory framework sets out, admissions systems must be reliable, fair and inclusive.\n\n“What we are seeing here are admissions systems that are not fair, and are not working in students’ best interests.”\n\nASCL general secretary Geoff Barton said the excessive use of unconditional offers is not in the best interests of students (Jason Senior/ASCL/PA)\n\nGeoff Barton, general secretary of the Association of School and College Leaders (ASCL), said: “This analysis provides further evidence that the excessive use of unconditional offers is not in the best interests of students.\n\n“We are particularly concerned about so-called ‘conditional unconditional offers’ where the offer is made on the condition that the student makes the university their first choice.\n\n“These offers encourage students to sign up for courses which are not necessarily the best choice for them and this is probably why they are then more likely to drop out.\n\n“To make matters worse, the use of these offers can also demotivate students when they are taking their A-levels and other post-16 qualifications leading them to do less well in these important qualifications.\n\n“We would encourage students to choose the university course which best suits their interests and ambitions, and we would urge universities to desist from the practice of making this type of offer.”", "description": "The Office for Students has raised concerns that teenagers who accept unconditional university offers are more likely to drop out of degree courses.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/11/wire-20373036-1572436785-311_636x382.jpg", "published_at": "2019-10-30"}