{"pub": "yahoo", "url": "https://sports.yahoo.com/mets-slammed-marlins-fall-5g-back-brewers-6-024456174--mlb.html", "downloaded_at": "2019-09-24 13:54:21.600771+00:00", "title": "Mets slammed by Marlins, fall 5G back of Brewers with 6 left", "language": "en", "text": "Mets slammed by Marlins, fall 5G back of Brewers with 6 left Miami Marlins third base coach Fredi Gonzalez greets Jorge Alfaro (38) as Alfaro rounds the bases after hitting a solo home run during the second inning of a baseball game against the New York Mets, Monday, Sept. 23, 2019, in New York. (AP Photo/Kathy Willens)\n\nNEW YORK (AP) -- The New York Mets have had a funhouse mirror season - always different, depending when and where you look. Division contenders or also-rans? Buyers or sellers? Second-half Cinderellas or too little, too late?\n\nApproaching the end of the ride, New York has no doubts about where it stands now.\n\n''Our backs are against the wall,'' manager Mickey Callaway said.\n\nScroll to continue with content Ad\n\nSteven Matz allowed two homers to Jorge Alfaro, including a grand slam, and the Mets lost to the Miami Marlins 8-4 Monday night to dim their fading postseason hopes.\n\nAmed Rosario cut into Miami's big lead with his own slam, but the Mets dropped five games behind idle Milwaukee for the final NL playoff spot with six games remaining. They also trail Washington by 5 1/2 games for the top wild card.\n\nMiami piled on when a replay decision led to two runs, and the Mets - despite a surprising surge after the All-Star break - moved to the brink of elimination. New York (81-75) would be locked out of the postseason with a loss Tuesday and victories by Washington and Milwaukee. The Nationals are scheduled for a doubleheader against the Phillies.\n\n''I think this team has performed pretty well when their backs are against the wall,'' Callaway said. ''So, we need to step it up.''\n\nMarlins left-hander Caleb Smith (10-10) dodged trouble early, stranding seven over the first four innings. Rosario got to him in the sixth, hitting a two-out slam to cut the deficit to 6-4.\n\n''We thought we could come back at that point,'' Rosario said via translator. ''But we weren't able to complete that.''\n\nThe Mets left 11 runners on base and ended an eight-game winning streak against Miami at Citi Field dating to last season.\n\nStory continues\n\nMatz (10-10) followed a seven-run outing at Colorado last week by allowing six runs in five-plus innings in his 100th big league start.\n\n''Tonight was two pitches to Alfaro, in my mind,'' Callaway said.\n\nThe left-hander crouched on the mound and then trudged off after Alfaro's slam in the sixth. Jon Berti, Miguel Rojas and Starlin Castro hit consecutive singles before Alfaro, Miami's cleanup hitter, connected for his first career slam and 17th homer this season.\n\n''That was really a big blow,'' Matz said. ''A terrible pitch.''\n\nAlfaro also homered leading off the second and had a career-high five RBIs. Rojas had an RBI single in the third, and Berti posted his first four-hit game.\n\nAlfaro had three hits in his previous 31 plate appearances entering Monday.\n\n''I think he's making strides,'' manager Don Mattingly said. ''He's not chasing as much. Getting the ball in the strike zone, trying to be more consistent with what he's swinging at.''\n\nMiami padded its lead in the seventh after a crucial replay challenge. Harold Ramirez hit a two-out, bases-loaded chopper to first baseman Pete Alonso, who flipped to pitcher Brad Brach for what was initially ruled an out. Replays showed Ramirez's toe narrowly beat Brach's foot to the base, and Ramirez was awarded a two-run single for an 8-4 lead.\n\n''I honestly didn't think he'd be that close,'' Brach said. ''I just made sure I caught the ball, because that's the most important thing. Kind of slowed up there for a second to catch it.''\n\nAfter tagging first, Brach spun around to throw home and try to catch Berti, who turned hard around third and scored the second run. Brach held up when first base umpire Jordan Baker called Ramirez out.\n\n''If he's not going full-out from second base on that, they're not going to give him that run,'' Mattingly said of Berti. ''But when you look up, when that play got made at first, he was halfway and moving.''\n\nThe Mets loaded the bases with two outs in the first inning, but Smith induced an infield fly from Todd Frazier to escape. Frazier popped up again with two outs and two on in the third.\n\nPUNCHING UP\n\nThe Mets pitching staff surpassed last year's club for the franchise strikeout record when former closer Edwin Diaz got No. 1,447 in the eighth.\n\nTRAINER'S ROOM\n\nMarlins: 1B/OF Garrett Cooper (left knee contusion) won't play again this season, partly because Mattingly has seen enough from the 28-year-old to ensure he fits into Miami's 2020 plans. ... OF Magneuris Sierra is done for the year with a hamstring strain, but Mattingly is hopeful he'll play winter ball. The speedy 23-year-old batted .350 in 15 games.\n\nMets: 2B Robinson Cano was not in the lineup a day after taking a pitch off his left big toe, but Callaway said it was a planned day off and he expects Cano to be fine.\n\nUP NEXT\n\nMets right-hander Noah Syndergaard (10-8, 4.22 ERA) is scheduled for his penultimate start of the season - and possibly with the franchise, given his uneven relationship with the front office. It also will be the second-to-last start for Miami right-hander Sandy Alcantara (5-14, 4.00 ERA) in an encouraging rookie season.\n\n---\n\nFollow Jake Seiner: https://twitter.com/Jake-Seiner\n\n---\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP-Sports", "description": "The New York Mets have had a funhouse mirror season - always different, depending when and where you look.  Approaching the end of the ride, New York has no doubts about where it stands now.  ''Our backs are against the wall,'' manager Mickey Callaway said.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/C4_bmpHlZesv55LWGd4pZg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/7wkvO4FqPo88QxyV_adx7g--~B/aD0xOTI4O3c9Mjg5MjtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/Sports/ap/201909232107760368131", "published_at": "2019-09-24"}