{"pub": "businessinsider", "title": "A 36-year-old white man has reportedly been identified as the Odessa, Texas shooter", "url": "https://businessinsider.com/seth-ator-odessa-texas-shooter-identified-reports-2019-9", "language": "", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:15:57.012151+00:00", "text": "The shooter in a rampage that killed seven people and injured 21 in Odessa, Texas, has been identified as Seth Ator by multiple reports.\n\nAtor, a 36-year-old resident of Odessa, Texas, was identified by CBS News and the Associated Press, citing multiple law-enforcement sources.\n\nAuthorities had previously said they were delaying identifying the shooter, who they described only as a white man in his 30s. Odessa Police Chief Michael Gerke said earlier Sunday that he did not want to give the shooter notoriety for \"what he did.\"\n\nLocal outlet KMID-TV reported that FBI investigators were seen executing a search warrant at Ator's house Sunday afternoon.\n\nAtor has a previous criminal record for trespassing and resisting arrest, according to the Texas Department of Public Safety records obtained and reported by The Daily Beast.\n\nThe rampage began at a traffic stop. According to the Texas Department of Public Safety, the driver was in a gold vehicle that was still moving when the gunman \"pointed a rifle toward the rear window of his car and fired several shots toward the DPS patrol unit.\"\n\nRead more: The death toll has risen to 7 after a gunman terrorized a Texas city by opening fire from a moving vehicle, authorities say\n\nTwenty-one people were ultimately shot and seven were killed in the incident. The gunman was shot dead by Texas police Saturday afternoon after he stole a USPS truck to continue his rampage.\n\nThe suspect reportedly died in a hospital in nearby Midland, Texas.\n\nThis most recent shooting marks the third mass shooting in Texas in the past year, including the shooting in El Paso, Texas, that killed 22 people less than a month ago. Texas Governor Greg Abbott lamented the number of deaths in a press conference Sunday and vowed \"action\" to prevent further tragedies.\n\n\"Words alone are inadequate. Words must be met with action,\" Abbott said. \"We must broaden our efforts to address (Odessa) and we must do so quickly. We need solutions that will keep guns out of the hands of criminals like the killer in Odessa while also ensuring that we safeguard rights.\"\n\nAbbott was pressed specifically on any plans to ban assault rifles, since officers had identified an assault rifle in Saturday's attack.\n\nAbbott said it's the \"kind of thing legislators are already talking about,\" but added that assault rifles weren't used in all of the state's mass shootings.\n\n\"We're gonna look at every issue,\" he said. \"There's no issue that we will not look at.\"", "description": "Odessa, Texas authorities had previously said they were delaying identifying the shooter, who they described only as a white man in his 30s.", "authors": ["Ellen Cranley"], "top_image": "https://amp.businessinsider.com/images/5d6c23e6f4fc2469cc54d78b-1920-960.jpg"}