{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/08/WS5d9c5da5a310cf3e3556f397.html", "downloaded_at": "2019-10-08 11:39:28.267222+00:00", "title": "Nobel Prize in Physics awarded", "language": "en", "text": "By Earle Gale in London | chinadaily.com.cn | Updated: 2019-10-08 17:57\n\nGoran K Hansson, central, secretary general of the Royal Swedish Academy of Sciences, and academy members Mats Larsson, left, and Ulf Danielsson, announce winners of the 2019 Nobel Prize in Physics during a news conference at the Royal Swedish Academy of Sciences in Stockholm, Sweden, Oct 8, 2019. [Photo/VCG]\n\nThe Nobel Prize in Physics has been won by three scientists for their work on understanding our universe.\n\nCanadian-born Princeton University professor James Peebles won one half of the prize \"for theoretical discoveries in physical cosmology\". The other half of this year's prize was won jointly by Swiss scientists Michel Mayor and Didier Queloz, both professors at the University of Geneva, who were honored \"for the discovery of an exo-planet orbiting a solar-type star\".\n\nMats Larrson, chairman of the committee that awarded the prize, said their work helped in \"the development of our understanding of the universe and the Earth's place in it\".\n\nHe said the discovery of planets in the universe that have conditions that are similar to those on Earth \"was a revelation that forever changed our view of the Earth's place in the universe\".\n\nThe prize, which is widely considered to be the most prestigious award a scientist can receive in the field of physics,will be physically presented at a lavish event in The Concert Hall in Stockholm, Sweden, on Dec 10, the anniversary of the death of Alfred Nobel, the Swedish businessman and scientist after whom the awards are named and whose vast fortune has funded them.\n\nThe prize was announced by the Royal Swedish Academy of Sciences, as it is each year, and is given annually in recognition of those who have made the most outstanding contributions on behalf of all mankind in the field of physics.\n\nThe prize is one of the original five Nobel Prizes set up back in 1901. The others are the prize in chemistry, literature, medicine, and the Nobel Peace Prize.\n\nPast winners of the prize in physics, which has now been awarded 210 times, have been honored for their work in discovering X-rays,properties of nuclear power, and understanding magnetic fields, among other things. Past winners include such luminaries as Albert Einstein, Marie Curie, and Guglielmo Marconi.\n\nThe winners of the prize in physics are selected by a committee each year following the polling of 3,000 key people, including university professors and past winners, who suggest names that are whittled down to a shortlist of about 15 candidates.\n\nThe Nobel Prize winners are announced at a series of events at this time of year with the Nobel Peace Prize conferred by the Norwegian Nobel Committee.", "description": "Nobel Prize for Physics awarded to 3 scientists for their contribution to understanding of the evolution of the universe.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/08/5d9c6ac3a310cf3e97a022cc.jpeg", "published_at": "2019-10-08"}