{"pub": "marketwatch", "url": "https://marketwatch.com/story/how-to-handle-a-dead-persons-credit-report-2019-09-05", "downloaded_at": "2019-09-05 10:29:15.890720+00:00", "title": "How to handle a dead person’s credit report", "language": "en", "text": "While it’s not something many people think about until faced with the issue, obtaining a credit report for a dead person is important. You may need to make sure the credit report is accurate and take stock of any creditors you need to notify of the death, or see if there’s any unresolved debt that you’re not aware of.\n\nIt’s not uncommon for criminals to try to take advantage of the fact that someone who has died isn’t checking their credit, which can increase the chances of identity theft and credit card fraud. That’s why it’s crucial to handle this process as quickly as possible.\n\nObtaining someone else’s credit report\n\nIn general, only the person who is the subject of the credit report should have access to it. But there are times when you may need to pull someone else’s report, such as the death of a loved one. Other instances may be when you’re checking someone’s credit as part of an application for a job or a rental property or if you’re helping someone work on their credit. Here are some commonly asked questions about obtaining someone else’s report.\n\nHow do you check someone’s credit history? You must have permission to check someone’s credit history, which can be as simple as them checking a box on a rental or job application. Once you have their permission, you can use their Social Security number, name and date of birth to do a background check that includes a credit history.\n\nYou must have permission to check someone’s credit history, which can be as simple as them checking a box on a rental or job application. Once you have their permission, you can use their Social Security number, name and date of birth to do a background check that includes a credit history. Can you look up someone else’s credit file? Yes, you can, but you have to have their permission and their personal information to be able to pull the correct report. This is common in situations where an agency or individual is helping another person repair their credit or address inaccuracies after identity theft.\n\nYes, you can, but you have to have their permission and their personal information to be able to pull the correct report. This is common in situations where an agency or individual is helping another person repair their credit or address inaccuracies after identity theft. Should you notify credit bureaus of a death? Yes, you should notify the three major credit bureaus as soon as possible after a death to ensure that the account is marked as deceased and no one else can open credit in the person’s name.\n\nObtaining the credit report of the dead\n\nOne of the most common situations where you will need to obtain someone else’s credit report is if a loved one dies and you are the financial power of attorney and/or executor of the estate. Here are the steps you need to take to obtain your loved one’s credit report after they’ve died and how to protect their legacy.\n\n1. Collect all the paperwork\n\nIt’s a lot easier to begin the process of obtaining a credit report if you already have the paperwork needed. Each of the three different credit bureaus may have different requirements to be able to report someone dead and obtain their report, so you may want to call and find out what documents are required beforehand. The most commonly requested are:\n\nA copy of the durable financial power of attorney, if applicable\n\nProof that you have been named executor of the estate\n\nTestamentary letters from the probate court\n\nAn official copy of the death certificate\n\nIt’s a good idea to get at least one copy of these documents for each of the three bureaus, but you’ll also probably want a copy for yourself and another backup just in case.\n\n5 key tax questions when you’re responsible for a loved one’s estate\n\n2. File the will if necessary\n\nBefore you can start the process of obtaining the credit report, you’ll need to file the will with the probate court. To do this, you’ll need a certified copy of the death certificate, which can be obtained from your local health department for a small fee. If there is no will or named executor of the estate, you may need to file with the courts to be named as executor.\n\n3. Submit a death certificate and other documents to the credit agencies\n\nOnce you have all of your documents gathered together, you’re ready to start submitting the paperwork to the credit bureaus. Remember that you’ll need to report the death and ask for the report from all three major bureaus: Experian, EXPGY, +1.37% TransUnion TRU, +0.31% and Equifax. EFX, +0.55% Along with the death certificate, power of attorney and testamentary letters, you’ll also need to include a cover letter explaining that the person has passed and that you need to obtain the reports to put their affairs in order. Your letter should also include:\n\nThe deceased’s name\n\nLast used mailing address\n\nSocial Security number\n\nYou may also need to send along a check or pay via phone or online to obtain the report, depending on the bureau’s policies and how recently the credit report was last obtained.\n\n4. Review the credit report\n\nGo through the credit report thoroughly checking for any inaccuracies—name and address misspellings are common—and make note of any open accounts that need to be paid with the estate or notified of the death. It’s a common misconception that all debts are automatically cleared when a person dies, but this isn’t the case, so it’s important to know what will still need to be taken care of. Make sure to be on the lookout for anything unusual–it could be a sign of suspicious activity.\n\n5. Update any creditors and the Social Security Administration\n\nThe last step is to update the credit bureaus, any outstanding creditors and the Social Security Administration of the death. You may be asking, “What happens to your credit report when you die?” Until the credit bureaus are notified that a death has occurred, nothing happens to the credit report. Once the proper documentation has been submitted and the request made, the bureaus will mark the account as deceased.\n\nDon’t miss: My dying friend wants to marry me so I can have his Social Security — should I do it?\n\nThis means that no further credit will be extended in the person’s name and no additional accounts can be opened up, which helps protect against identity theft and credit card fraud. The death certificate should be all that’s needed to complete this step.", "description": "If someone close to you dies, you may need to wrap up a few loose ends with regard to their credit.", "authors": ["Gerri Detweiler"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ483_cr_dea_MG_20190830111913.jpg", "published_at": "2019-09-05"}