{"pub": "cnn", "url": "https://us.cnn.com/2019/08/11/health/legionnaires-outbreak-sheraton-atlanta-largest-in-georgia/index.html", "downloaded_at": "2019-09-22 07:20:06.107927+00:00", "title": "Deadly Legionnaires' outbreak at Atlanta hotel is the largest on record in Georgia", "language": "en", "text": "Atlanta (CNN) An outbreak of Legionnaires' disease tied to a prominent Atlanta hotel is the largest recorded Legionella outbreak in Georgia, an official with the public health department told CNN on Sunday.\n\nOn Monday, Atlanta-based attorneys filed the first lawsuit against the hotel, seeking compensation on behalf of a man who visited the property during the outbreak. In an email to CNN, Stewart Trial Attorneys said it and the Wetherington Firm represent more than 40 people who stayed at or visited the hotel during the outbreak.\n\nOne person died of the disease and 11 other cases were confirmed after stays or visits at the Sheraton Atlanta Hotel between June 12 and July 15, Nancy Nydam, a spokeswoman for the Georgia Department of Public Health , said in an email.\n\nThere also have been 63 probable cases, Nydam said. Probable cases are those who have symptoms of the disease but have not yet had a laboratory test to confirm it. Last week, there were 61 probable cases\n\n\"Every hotel knows that bacteria lives in its water systems. That's why they have policies, that's why they have procedures, that's why they have treatment programs for making sure that Legionnella doesn't grow in the water systems. The only way that this could happen is if someone didn't follow the procedures,\" attorney Matt Wetherington said during a press conference on Monday.\n\n\"The mere occurrence of a Legionnaires' disease outbreak shows that something went wrong,\" he said. \"It is our hope that we will be able to get answers for the families and that they will be able to get compensation for their injuries.\"\n\nIn response, Sheraton Atlanta Hotel general manager Ken Peduzzi said in a statement to CNN on Monday that \"the hotel does not comment on legal matters.\"\n\nIn a separate statement on Friday, Peduzzi said the hotel closed July 16 and will remain shut until at least August 14.\n\n\"During our closure, we have been working closely with the Georgia Department of Public Health, Fulton County Board of Health and environmental experts to conduct testing to ensure there is no threat of Legionella infection,\" Peduzzi wrote. \"A thorough cleaning of the hotel's entire water distribution system has been completed as a precautionary measure, including cleaning, scrubbing and chlorination of all water features.\"\n\nHe said the hotel is awaiting more test results before announcing a reopening date.\n\nLegionnaires' disease is a serious type of pneumonia caused by Legionella bacteria, which are naturally found in the environment, usually in fresh water, according to the Georgia Department of Public Health. The bacteria can grow in warm water and can be found in shower heads and faucets, hot tubs, cooling towers, hot water tanks, decorative fountains or plumbing systems in large buildings.\n\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\n\nLegionnaires' disease is treated with antibiotics, and most people who get sick make a full recovery, according to the state health department. However, people at an increased risk of illness tend to be 50 or older, current or former smokers, people with chronic lung disease or weak immune systems.\n\nAbout one in 10 people with Legionnaires' disease dies, according to the US Centers for Disease Control and Prevention. About 7,500 US cases of Legionnaires' disease were reported to the CDC in 2017, the agency said, adding that it's likely an underestimate because the illness is underdiagnosed.", "description": "An outbreak of Legionnaires' disease tied to a prominent Atlanta hotel is the largest recorded Legionella outbreak in Georgia, an official with the public health department told CNN on Sunday.", "authors": ["Jacqueline Howard"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190716135433-marriott-atlanta-super-tease.jpg", "published_at": "2019-08-11"}