{"pub": "yahoo", "url": "https://news.yahoo.com/us-ramps-iran-pressure-european-summit-bid-flounders-142952267.html", "downloaded_at": "2019-09-27 00:04:58.490992+00:00", "title": "No UN breakthrough: Iran rules out talks as US intensifies sanctions", "language": "en", "text": "Iranian President Hassan Rouhani rules out talks with the United States so long as sanctions are in place (AFP Photo/TIMOTHY A. CLARY)\n\nUnited Nations (United States) (AFP) - Iran's president on Wednesday closed the door on meeting Donald Trump despite last-minute European efforts to ease tensions as the United States again ramped up punishing sanctions.\n\nFrench President Emmanuel Macron had shuttled between his US and Iranian counterparts over two days at the United Nations, trying to arrange a historic encounter that he hoped could reduce the risk of all-out war in the Middle East.\n\nBut Iranian President Hassan Rouhani, addressing the UN General Assembly, said he would refuse talks so long as the United States maintains its economic pressure.\n\n\"I would like to announce that our response to any negotiation under sanctions is negative,\" Rouhani said.\n\nHe dismissed the idea of a photo-op with Trump, who is fond of drama and held three made-for-television meetings with North Korean leader Kim Jong Un.\n\n\"Memento photos are the final stage of negotiations, not the first one,\" he said.\n\nHe doubted the sincerity of the Trump administration to negotiate, pointing to officials' boasts of applying \"the harshest sanctions in history\" against Iran.\n\n\"How can someone believe them when the silent killing of a great nation, and pressure on the lives of 83 million Iranians, especially women and children, are welcomed by American government officials?\"\n\n\"The Iranian nation will never, ever forget and forgive these crimes and these criminals,\" he said.\n\n- Targeting Iran through China -\n\nTrump had already ruled out easing economic pressure and, hours before Rouhani's speech, his administration said it was stepping up sanctions.\n\nIn a proclamation posted on the White House website Wednesday, Trump authorized the restriction and suspension of entry of senior Iranian government officials and their immediate family into the United States, calling Tehran \"a state sponsor of terrorism.\"\n\n\"Given that this behavior threatens peace and stability in the Middle East and beyond, I have determined that it is in the interest of the United States to take action,\" the proclamation said.\n\nOn Trump's last scheduled day at the annual UN summit of world leaders, Secretary of State Mike Pompeo said the United States would punish Chinese companies and their chief executives for buying Iranian oil.\n\n\"We're telling China, and all nations -- know that we will sanction every violation of sanctionable activity,\" Pompeo told a pressure group opposed to Iran's clerical regime on the sidelines of the United Nations.\n\n\"This is one of the largest sanctions actions the United States has taken against entities and individuals identified as transporting Iranian oil since our sanctions were re-imposed in November 2018,\" Pompeo said in a statement.\n\n\"This action is aimed to deny the Iranian regime critical income to engage in foreign conflicts, advance its ballistic missile development, and fund terror around the world,\" he said.\n\nChina, which is embroiled in a trade war as well as myriad other disputes with the United States, is believed to be the biggest foreign buyer of Iranian oil.\n\nThe Trump administration in May said it would unilaterally force all countries to stop buying Iran's oil, its major export, sending tensions soaring.\n\nThe United States blamed Iran for an attack earlier this month on the oil infrastructure of rival Saudi Arabia, which is waging a devastating offensive in Yemen.\n\nFrance, Britain and Germany this week said they agreed with the US findings.\n\nPompeo, speaking at a news conference with Trump, said the United States had found a united front at the United Nations on Iran -- but was open to talks.\n\n\"We want a peaceful resolution with the Islamic Republic of Iran,\" Pompeo said.\n\n\"In the end, it'll be up to the Iranians to make that decision, or whether they'll choose violence and hate.\"\n\n- Seeking to salvage deal -\n\nBut the European powers, while criticizing Iran, believe that diplomacy is the best way forward.\n\nThe Europeans remain part of a nuclear accord negotiated by former US president Barack Obama, under which Iran drastically reduced its nuclear program in return for unmet promises of sanctions relief.\n\nEU foreign policy chief Federica Mogherini acknowledged struggles to preserve the pact, from which Iran has stopped strict compliance as it presses for economic benefits.\n\n\"I will not hide that it is increasingly difficult to do it,\" she told reporters after talks among European powers.", "description": "Iran's president on Wednesday closed the door on meeting Donald Trump despite last-minute European efforts to ease tensions as the United States again ramped up punishing sanctions.  French President Emmanuel Macron had shuttled between his US and Iranian counterparts over two days at the United", "authors": ["Shaun Tandon"], "top_image": "https://s.yimg.com/uu/api/res/1.2/x2q9ucNZeSnoGq5dMczwTA--~B/aD01NzQ7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/1ea9be63ffcf50ca531780dbfc0daa44699faf8a.jpg", "published_at": "2019-09-26"}