{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-new-zealand-ireland-result-score-rory-best-retire-a9162866.html", "downloaded_at": "2019-10-19 14:12:07.384372+00:00", "title": "Rugby World Cup 2019: Retiring Ireland captain Rory Best pays emotional tribute after New Zealand defeat", "language": "en", "text": "Retiring captain Rory Best paid an emotional tribute to Ireland after a clinical performance from New Zealand ended their World Cup dream in Tokyo.\n\nAaron Smith scored two of the All Blacks’ seven tries in a comprehensive 46-14 quarter-final victory to set up a semi-final showdown against England.\n\nDefeat against the back-to-back champions signalled the end of Best’s international career, while head coach Joe Schmidt will be leaving his role.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBest, 37, struggled to hold back tears in his post-match pitchside interview. “I would just like to thank this unbelievable Irish crowd. It started off with an incredible atmosphere and they were brilliant,” he said.\n\n“But the All Blacks were fantastic tonight. We felt we prepared well all week, we felt we had a game plan, we felt we had enough in our armoury to beat them.\n\nShape Created with Sketch. Ratings: New Zealand vs Ireland Show all 30 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Ratings: New Zealand vs Ireland 1/30 Beauden Barrett - 8 AP 2/30 Sevu Reece - 8 AFP via Getty Images 3/30 Jack Goodhue - 7 AFP via Getty Images 4/30 Anton Lienert-Brown - 8 Getty Images 5/30 George Bridge - 8 AFP via Getty Images 6/30 Richie Mo'unga - 7 Getty Images 7/30 Aaron Smith - 8 AFP via Getty Images 8/30 Joe Moody - 7 Getty Images 9/30 Codie Taylor - 8 AFP via Getty Images 10/30 Nepo Laulala - 7 Getty Images 11/30 Brodie Retallick - 6 AP 12/30 Sam Whitelock - 7 World Rugby via Getty Images 13/30 Ardie Savea - 8 AFP via Getty Images 14/30 Sam Cane - 7 Getty Images 15/30 Kieran Read - 7 World Rugby via Getty Images 16/30 Rob Kearney - 6 World Rugby via Getty Images 17/30 Keith Earls - 5 PA 18/30 Gary Ringrose - 5 World Rugby via Getty Images 19/30 Robbie Henshaw - 6 AFP via Getty Images 20/30 Jacob Stockdale - 6 Getty Images 21/30 Johnny Sexton - 5 PA 22/30 Conor Murray - 6 World Rugby via Getty Images 23/30 Cian Healy - 6 REUTERS 24/30 Rory Best - 5 AP 25/30 Tadhg Furlong - 5 AFP via Getty Images 26/30 Iain Henderson - 6 EPA 27/30 James Ryan - 5 AFP via Getty Images 28/30 Peter O'Mahony - 6 PA 29/30 Josh van der Flier - 5 AFP via Getty Images 30/30 CJ Stander - 6 REUTERS 1/30 Beauden Barrett - 8 AP 2/30 Sevu Reece - 8 AFP via Getty Images 3/30 Jack Goodhue - 7 AFP via Getty Images 4/30 Anton Lienert-Brown - 8 Getty Images 5/30 George Bridge - 8 AFP via Getty Images 6/30 Richie Mo'unga - 7 Getty Images 7/30 Aaron Smith - 8 AFP via Getty Images 8/30 Joe Moody - 7 Getty Images 9/30 Codie Taylor - 8 AFP via Getty Images 10/30 Nepo Laulala - 7 Getty Images 11/30 Brodie Retallick - 6 AP 12/30 Sam Whitelock - 7 World Rugby via Getty Images 13/30 Ardie Savea - 8 AFP via Getty Images 14/30 Sam Cane - 7 Getty Images 15/30 Kieran Read - 7 World Rugby via Getty Images 16/30 Rob Kearney - 6 World Rugby via Getty Images 17/30 Keith Earls - 5 PA 18/30 Gary Ringrose - 5 World Rugby via Getty Images 19/30 Robbie Henshaw - 6 AFP via Getty Images 20/30 Jacob Stockdale - 6 Getty Images 21/30 Johnny Sexton - 5 PA 22/30 Conor Murray - 6 World Rugby via Getty Images 23/30 Cian Healy - 6 REUTERS 24/30 Rory Best - 5 AP 25/30 Tadhg Furlong - 5 AFP via Getty Images 26/30 Iain Henderson - 6 EPA 27/30 James Ryan - 5 AFP via Getty Images 28/30 Peter O'Mahony - 6 PA 29/30 Josh van der Flier - 5 AFP via Getty Images 30/30 CJ Stander - 6 REUTERS\n\n“They just started off out of the blocks hard at us, put us on the back foot and, like good sides do, they never let us get off that again.”\n\nBest paid tribute to the efforts of Schmidt to help move Irish rugby forward.\n\n“I have loved every minute of it, the support I have got from the fans home and away and the coaching staff,” he said on ITV1. “Joe Schmidt as well who is moving on, he brought my game particularly to another level when he came here and a massive credit must go to him.”\n\nSchmidt felt his side gave New Zealand too many “access points” into the game.\n\n“We turned the ball over, but we missed opportunities to get into their zone and really put some pressure on,” he said. “We kind of gave them a leg up and, when they get a points differential like they had, you are chasing the game.\n\n“When you chase the game, you take risks that, if you are not executing perfectly, they’re going to capitalise on the back of it.”\n\nSchmidt admits Ireland had been somewhat “flat” since earning their place as the number one side in the world, but that he leaves them “in a really good place”.\n\nHe said: “When you reach a height, there is always a risk that you’re going to just slip off that height a little bit.\n\n“I don’t think it was any complacency or anything else. I think we made a target of ourselves, certainly teams went after us a little bit more.\n\n“We had been able to kind of sneak up on New Zealand a couple of times, and sneak up on a few other teams.”\n\nAll Blacks forward Brodie Retallik felt his side produced an “awesome spectacle” as he turned his attention towards the clash with England.\n\n“We have only seen bits and bobs (of England), and I saw a bit of the Australia game, but they are playing with great skill,” he said.\n\n“They have great outside backs with a good forward pack, but we will knuckle down to playing them this week.”\n\nPA", "description": "Retiring captain Rory Best paid an emotional tribute to Ireland after a clinical performance from New Zealand ended their World Cup dream in Tokyo. Aaron Smith scored two of the All Blacks’ seven tries in a comprehensive 46-14 quarter-final victory to set up a semi-final showdown against England.", "authors": ["Sports Staff"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/19/14/Rory-Best.jpg", "published_at": "2019-10-19"}