{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7615017/Southampton-0-9-Leicester-Ayoze-Perez-scores-hat-trick-Ryan-Bertrand-hits-brace.html", "downloaded_at": "2019-10-25 22:31:05.640557+00:00", "title": "Southampton 0-9 Leicester: Ayoze Perez and Jamie Vardy score hat-tricks in emphatic win", "language": "en", "text": "Advertisement\n\nRain fell, winds swirled, and as the heavens opened over St Mary's, Leicester blew Southampton away with a performance to make their Boss smile from above.\n\nSunday marks one year since the death of Vichai Srivaddhanaprabha and, for all the displays of remembrance this week, few will be as fitting as this 9-0 win by Brendan Rodgers' side.\n\nOn Friday night the travelling Leicester fans wore commemorative scarves carrying the four word legacy of their late chairman: Making the impossible possible.\n\nJamie Vardy and Ayoze Perez both scored hat-tricks as Leicester secured an incredible 9-0 victory against Southampton\n\nThe Leicester players celebrate Perez's first goal, with Leicester getting the biggest ever away win in the English top flight\n\nPerez scored his first goal, and Leicester's third, with a well-struck effort in the 19th minute of the game at St Mary's Stadium\n\nThis team, carved in the image of the man who led them to that unlikely title triumph, are making their supporters dream once more.\n\nHere again they played with confidence and invention, goals from Ben Chilwell, Jamie Vardy, Youri Tielemans and two from Ayoze Perez ending the contest before half time. Perez secured his hat-trick shortly after the break before Vardy and James Maddison made this the biggest ever away win in a top-flight match since the Football League began 131 years ago.\n\nVardy completed his hat-trick with an injury-time penalty after a foul by Jan Bednarek. Minutes earlier, Maddison scored a brilliant free kick. He celebrated by pointing to the sky and looking up to the heavens. This was another special night.\n\nPerez was on target again in the 39th minute after he was teed up by Ben Chilwell, with Leicester running riot in the first half\n\nLeicester continued to dominate in the second half, with Perez (left) finding the back of the net again to complete his hat-trick\n\nSouthampton had to play the majority of the game with ten men after Ryan Bertrand (left) was sent off in the 12th minute\n\nBertrand received the first VAR-awarded red card in Premier League history following a rash challenge on Perez (right)\n\n'It was the perfect performance. From the very first whistle in the game we showed our intent,' Brendan Rodgers said afterwards.\n\n'I'm so pleased with the performance, it had everything you could want. We went in front, deservedly so. And then when Ryan got sent off, we showed a wonderful demonstration of how to play against ten men.\n\n'The players made it look a lot easier than it actually is. All round collectively it was an absolutely outstanding night and brilliant for the supporters to travel all the way down here on a wet night.\n\n'To see the team score nine goals and be very focused, hopefully they will be very proud.'\n\nFor the third consecutive home game, meanwhile, Ralph Hasenhuttl's side pressed the self-destruct button inside the first half.\n\nThey lost Ryan Bertrand to an early red card and never recovered. For their manager, this looks set to be be the final straw.\n\nBut this night belonged to Leicester. They are now second and only 2/1 to make the top four. That doesn't flatter them, either. Few teams in the country are playing with such fluidity and skill.\n\nBefore the game Rodgers spoke about the need to retain Vichai's spirit. His legacy lives on through his son, Top. It was he who appointed Rodgers in February and under the Northern Irishman Leicester are breaking new ground again.\n\nMATCH FACTS, PLAYER RATINGS AND LEAGUE TABLE SOUTHAMPTON (5-3-2): Gunn 4.5; Bertrand 2, Yoshida 4.5, Vestergaard 5 (Danso 46, 5), Bednarek, 5, Valery 4.5 (Armstrong 5.5); Romeu 5.5, Hojbjerg 5, Ward-Prowse 5; Redmond 5.5, Ings 5.5 (Stephens 46, 5.5) Subs not used: McCarthy, Long, Adams, Boufal, Goals: None Yellow cards: None Red cards: Bertrand LEICESTER (4-3-3): Schmeichel 6; Pereira 6.5, Evans 6.5, Soyuncu 6.5, Chilwell 8; Ndidi 7, Maddison 7, Tielemans 7.5; Barnes 8 (Albrighton 72 6), Vardy 7.5, Perez 8.5 (Gray 6) Subs not used: Ward, Justin, Morgan, Choudhury, Praet Goals: Chilwell 10, Tielemans 17, Perez 19, 39, 57, Vardy 45, 58, 90 Yellow cards: None Red cards: None Att: 28,762 Referee: Andre Marriner MOM: Perez Season at a glance Live tables\n\nFixtures\n\nScores Premier League\n\nPremier League\n\nChampionship\n\nLeague One\n\nLeague Two\n\nScottish Premiership\n\nScottish Div 1\n\nScottish Div 2\n\nScottish Div 3\n\nLigue 1\n\nSerie A\n\nLa Liga\n\nBundesliga\n\n\n\n\n\nChilwell (left) put Leicester in the lead in the tenth minute after Harvey Barnes' effort was pushed out to him by Angus Gunn\n\nChilwell celebrates after scoring his first Premier League goal since his effort against Tottenham back in May 2017\n\nYouri Tielemans celebrates after he doubled Leicester's advantage with a well-taken goal in the 17th minute of the game\n\nTielemans' team-mates Vardy (left) and Perez (right) join him to celebrate his goal in Leicester's game against Southampton\n\nTielemans' goal put Leicester 2-0 up as the Foxes capitalised upon the early dismissal of Southampton's Bertrand\n\nJamie Vardy is congratulated by Perez after adding further to Leicester's lead with their fifth goal just before half time\n\nHere they were supreme from the off and it took only 10 minutes for the floodgates to open.\n\nChilwell drove forward and his cross was turned goalwards by Harvey Barnes. Gunn's save fell kindly to the onrushing Chilwell, who slotted home.\n\nVAR then added insult to injury. Shortly before the goal Bertrand had lost control of the ball and in stretching to win it back, caught Perez halfway up his leg. It was missed by most inside St Mary's. But not by Mike Dean. Andre Marriner had no choice but to show a straight red card.\n\nSaints had barely gathered themselves when the game was taken away in the space of two minutes.\n\nAgain it was Chilwell and Barnes who combined for Leicester's second. The left back drove 50 yards before feeding his winger, who picked out Tielemans inside the area. The Belgian had enough time to take a touch and fire home. Moments later scorer turned provider. Tielemans shared a one-two with Perez, who opened his Leicester account with a simple finish.\n\nBoos rang out around three corners of St Mary's but worse was to come for Southampton.\n\nShortly before the break Chilwell looped a cross towards the back post. Yan Valery left it, unaware that Perez was closing in behind him. The forward fired high into the net to send streams of supporters home early. Even fewer lasted until the break.\n\nVardy got in on the act when he turned Maya Yoshida and fired home from inside the box. After half time Perez who netted their sixth before Vardy scored a second and sparked the Leicester supporters into a fresh tribute to their late chairman.\n\nThe remaining home fans clapped. It was about all they could applaud on Friday night.\n\nBut still Leicester weren't done yet. This team are going places. People have been foolish to write them off before.\n\nVardy inflicted more misery upon Southampton when he scored his seventh Premier League goal of the 2019-20 campaign\n\nSouthampton were left dejected after they endured a torrid first half that saw them concede five goals against Leicester\n\nVardy got his second goal of the game, and Leicester's seventh, when he managed to score a header in the 58th minute\n\nAn excellent free-kick from James Maddison, scored in the 85th minute, added to the scoreline as Leicester won 9-0\n\nVardy was jumping for joy after he completed his hat-trick and made it 9-0 to Leicester in the closing stages of the game\n\nBrendan Rodgers' Leicester are, temporarily at least, up to second place in the Premier League following their emphatic win\n\nLeicester supporters (pictured) paid tribute to former chairman Vichai Srivaddhanaprabha one year on from his death\n\nLeicester's Harvey Barnes battles for possession with Southampton's Maya Yoshida (right) during the clash at St Mary's", "description": "DANIEL MATTHEWS AT ST MARY'S STADIUM: Ayoze Perez and Jamie Vardy both hit hat-tricks as Leicester thrashed Southampton 9-0 to move up to second place in the Premier League.", "authors": ["Daniel Matthews For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/23/20199400-0-image-a-3_1572041074822.jpg", "published_at": "2019-10-25"}