{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/messi-and-ronaldo-are-footballs-federer-and-nadal-heres-why-2019-10", "downloaded_at": "2019-10-09 10:51:59.286728+00:00", "title": "Why Lionel Messi and Cristiano Ronaldo are the Roger Federer and Rafael Nadal of football", "language": "en", "text": "Lionel Messi and Cristiano Ronaldo are to soccer what Roger Federer and Rafael Nadal are to tennis, according to Juventus FC and former Italy goalkeeper Gianluigi Buffon.\n\n\"Federer is infinite class, while Nadal is perseverance, sweat and also talent,\" Buffon told Football Italia. \"Leo Messi is Federer, while Ronaldo is like Nadal.\"\n\nMessi and Ronaldo have dominated European football for years, winning a combined 61 domestic honours and five Ballon d'Or trophies each.\n\nIn the same era, Federer and Nadal have commanded the tennis world, winning 20 and 19 Grand Slam titles respectively.\n\nRead more of our soccer stories here.\n\nVisit Business Insider's homepage for more stories.\n\nLionel Messi and Cristiano Ronaldo are to soccer what Roger Federer and Rafael Nadal are to tennis.\n\nThat is according to the Juventus FC and former Italy goalkeeper Gianluigi Buffon. The 41-year-old was talking to Football Italia about his idols when he drew the comparison between the rivals.\n\n\"Federer is infinite class, while Nadal is perseverance, sweat and also talent, otherwise you cannot win all the Grand Slams he achieved,\" the veteran shot-stopper said.\n\n\"Nadal's hard work and constant desire to improve himself allowed him to be on a par with the most talented tennis player in history.\n\n\"The comparison is obvious and makes me smile, as Leo Messi is Federer, while Cristiano Ronaldo is like Nadal.\"\n\nRead more: Lionel Messi has surpassed Ronaldo as Europe's highest ever scorer and evidence shows Cristiano will struggle to leapfrog the FC Barcelona forward again\n\nMessi and Ronaldo have been soccer's two most heralded stars over the past two decades. Together they have a combined 61 domestic trophies and many individual honours — including five Ballon d'Or's each.\n\nSimilarly, Federer and Nadal have dominated the world of tennis during that same period.\n\nFederer, 38, has won 20 Grand Slam titles, whilst Nadal has won 19 — his latest coming when he beat Daniil Medvedev to secure the 2019 US Open title in September.\n\nBuffon has also had a glistening career of his own, having won 24 major honours with Parma, Juventus, and Paris Saint Germain, in a career that has spanned almost 25 years.\n\nRead more:\n\nLionel Messi has been twice as good as Cristiano Ronaldo in the modern era, according to a computer algorithm\n\nCristiano Ronaldo and Lionel Messi should not have been included in FIFA's world team of the year, Liverpool star says\n\n2 teenage soccer stars who once played together as children could soon become the sport's biggest rivals since Lionel Messi and Cristiano Ronaldo", "description": "The Juventus FC goalkeeper Gianluigi Buffon has compared two of football's great rivals to two tennis greats.", "authors": [], "top_image": "https://image.businessinsider.com/5d9d99303b33a75d0a4eccd4?width=1200&format=jpeg", "published_at": "2019-10-09"}