{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7565819/Pussycat-Dolls-Kimberly-Wyatt-37-welcomes-child-C-section.html", "downloaded_at": "2019-10-12 13:07:13.786135+00:00", "title": "Pussycat Dolls' Kimberly Wyatt, 37, welcomes her third child via C-section", "language": "en", "text": "Pussycat Dolls' Kimberly Wyatt, 37, has welcomed her third child with Max Rogers.\n\nHer beloved husband, 37, took to Twitter on Friday to write: 'Happy to announce that @KimberlyKWyatt gave birth this afternoon...\n\n'Mum & baby are doing very well. Looking forward to sharing all the details in a few weeks,for now we will switch off and welcome the new arrival to our family. My wife is incredible. @NHSEnglandLDN is a privelage (sic).'\n\nBumping along nicely: Pussycat Dolls' Kimberly Wyatt, 37, has welcomed her third child with Max Rogers\n\nEarlier that day, Kimberley shared a final photo of her bump ahead of her operation and wrote: 'Saying goodbye to my baby bump! ...See you on the other side.'\n\nIn May, the singer revealed her pregnancy news to OK! Magazine as she admitted their imminent arrival was an 'amazing surprise'.\n\nShe told the magazine: 'It was a surprise - but an amazing one. We weren’t planning on having a third child this quickly!... I can’t deny I’d like to have a boy but ultimately we just want a happy and healthy baby.'\n\nMax went on: 'We’ve had our boy names since before we were married. And if it’s a girl we’ll continue with the tree theme.'\n\nYay! Her beloved husband took to Twitter to write: 'Happy to announce that @KimberlyKWyatt gave birth this afternoon' (pictured in July)\n\nHappy family: Kimberly and Max, who married in September 2013 after three and a half years as a couple, are already parents to two girls, Willow, four, and Maple, one (pictured in May)\n\nKimberly and Max, who married in September 2013 after three and a half years as a couple, are already parents to two girls, Willow, four, and Maple, one.\n\nUpon announcing Maple's arrival in 2017, the loved-up couple said: 'We always wanted Willow to have a sibling and really hoped that they would be as close in age as possible, although you don't always get to choose when these things happen'.\n\nShe went on: 'Max is an amazing father and when I watch him with Willow, reading to her and the relationship they have, it melts my heart...\n\n'We work hard but our family life is so precious – the priority – and now we're just so excited to meet our new little one.'\n\nYay! In May, she revealed the news to OK! Magazine as she admitted the baby news was an 'amazing surprise'\n\nKimberly first came to fame as one of the members in the Pussycat Dolls alongside Nicole Scherzinger, Carmit Bachar, Ashley Roberts, Jessica Sutta, Melody Thornton.\n\nFollowing her time in the now-defunct band, she admitted their time of flying high in the charts left them 'without lives' - an existence she did not want.\n\nShe said: 'We didn’t have lives. Our life was being on stage. It was being a performer, it was being in shape, it was being the best dancer I could possibly be.\n\nHere come the girls! Kimberly first came to fame as one of the members in the Pussycat Dolls alongside Nicole Scherzinger, Carmit Bachar, Ashley Roberts, Jessica Sutta, Melody Thornton\n\n'One day I realised I might wanna have a family and in order to do that I’d have to make a few changes, and I’ve made those changes ever since.'\n\nSince then, there has been talk of a reunion, as a group insider previously told The Sun: 'Talk of the girls ­getting back together has been rife for a few years now and they have finally found a time which works for them all.\n\n'They are still deciding whether it will involve a full tour or just a handful of performances but they are excited to be getting out there together again.\n\n'The girls feel the time is right to let bygones be bygones and put any differences they had behind them and celebrate the great songs they made.'", "description": "Her beloved husband took to Twitter to write: 'Happy to announce that @KimberlyKWyatt gave birth this afternoon'", "authors": ["Ciara Farmer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/13/19626324-0-image-a-11_1570884493543.jpg", "published_at": "2019-10-12"}