{"pub": "investing.com", "title": "Stronger Rand ... but Risks Abound", "url": "https://za.investing.com/analysis/stronger-rand--but-risks-abound-200431045", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 09:03:51.651459+00:00", "text": "A week of uncertainty - with the on the defensive - saw more range-bound trading from the local currency. As much as many would like to see it break free of the R15/$+ levels, it seemed fairly well settled there, still not inclined to test that psychological level.\n\nHowever, you can always be sure that quiet markets are not going to last. And with the Trade War ongoing, and events like Brexit playing out, a trigger is just around the corner, so let's get into the full review to see how we can prepare for just that.\n\nKey Moments (26-30 Aug 2019)\n\nHere are some of the biggest headlines for the week:\n\nTrade War - the game of 'tariff ping-pong' has continued, but now it seems that there is some positive news on the horizon...\n\n- the game of 'tariff ping-pong' has continued, but now it seems that there is some positive news on the horizon... Mboweni's plan - Tito stepped up to the forefront this week with a new document outlining how he is going to grow SA's GDP\n\n- Tito stepped up to the forefront this week with a new document outlining how he is going to grow SA's GDP No-Deal - every day is a day closer to Brexit without an exit plan, but with Boris Johnson blazing forward\n\n- every day is a day closer to Brexit without an exit plan, but with Boris Johnson blazing forward - some say it will grow the economy, others say it will crash it...\n\n- some say it will grow the economy, others say it will crash it... Hong Kong chaos - with China intervening, the is nearing breaking point...\n\nThe Rand started Monday with a massive gap between the close on Friday and the open on Monday - all of 12c!\n\nUSD/ZAR Chart\n\nThis can be confusing to many persons as to how it happens...but the market fairly often gaps like this.\n\nBut nature hates a vacuum and so, almost invariably, the market is drawn back to fill this price gap.\n\nIt had been a weekend of worries for investors, as Trade War fears continued without any sign of relief.\n\nHowever, on Monday that changed. The event that caused the seas to calm a little was when President Trump stated he had a phone call with his Chinese counterpart and that the Chinese are ready for a deal, and so we wait for some kind of resolution.\n\nLater in the week some more good news did surface: Risk appetite spiked as the Chinese commerce minister came out yesterday saying they will not retaliate immediately to the recent US tariff increase and will line up another bout of face-to-face trade talks in September.\n\nIt appears that this may fall onto the backburner for a while now, in view of those talks - with Trump a little softer on the subject, rather than the fire and brimstone of the week before!\n\nHowever, it seemed to be fire and brimstone in the UK as Boris Johnson came out all cylinders firing in his plan to make Brexit happen, to the point where he has (with the Queen's approval) closed parliament, to try to ensure he can yank Britain out of the EU by the end of October.\n\nThis did not go down well.\n\nJeremy Corbyn called it “a smash-and-grab raid against our democracy.”\n\nMany investors outside 10 Downing Street in London agreed as they protested the \"coup\".\n\nThe Pound has now lost 15% against the Dollar in a little over a year as this situation has steadily gotten worse:\n\nGBP/USD Prediction\n\nWith time running out now, it appears that a 'hard' Brexit is going to be the only way an end is reached - which will basically be Britain 'crashing' out of the EU, rather than gently exiting, this could, and likely will be, destructive for businesses and consumers alike, with problems like food shortages not an unrealistic possibility.\n\nIn other news:\n\nAfter the flurry of global updates, here is some of the local: The local unit had a glimmer of hope as National Treasury released an economic policy document which highlighted strategies to revive our struggling economy in the long term. The five key strategy points: 1) modernizing network industries; 2) lowering barriers to entry; 3) promoting agriculture; 4) implementing a flexible industrial and trade policy and 5) improving export competitiveness and regional trade. The target: raise the country's economic growth rate by up to 3% and create as many as a million job opportunities.\n\n\n\nAs always, it is not the plans which are the problem but the execution - and it will be the same with this one...only time will tell!\n\n\n\n\n\nAs always, it is not the plans which are the problem but the execution - and it will be the same with this one...only time will tell! Also locally was the debate around the controversial NHI plan from the Health Minister. While there are a lot of unknowns, it is clear that this is going to be a MASSIVE overhaul of the whole health system for medical companies, pharmacies, insurance companies and consumers. The Health Minister insists that it will \"boost SA's economy\", while a Nedbank economist was clear that the \"Country cannot afford NHI\". We agree absolutely - in fact, it would be a disaster.\n\n\n\n\n\nLike most countries, SA relies heavily on exports to US & China, and one of the key indicators of how the trade spat has impacted the local economy is the . In July, SA recorded a surprise trade deficit of R2.88bn from an upward revised surplus of R5.5bn. August has been rough for emerging markets as data from the IMF shows that investors pulled out as much as $ 13.8 billion this month alone; the highest since Trump’s election in November 2016.\n\n\n\n\n\nTo make matters worse for China, the Hong Kong mess is steadily getting worse as protests rage on. China has now gotten fully involved, sending in troops to try and calm the situation down. Arrests are being made, and it is now clear that the very thing which Hong Kong citizens feared is true: China's intention is to have a complete hold over the region, and it will never be free from the Communist regime's influence.\n\nAs for the Rand, amongst all of this, it was actually a good end to the week. After the market had tested R15.50/$, we saw a recovery in the latter half which took us to sub R15.20 levels by the close of the week.\n\nRand Dollar Prediction Movement\n\nIt had been an up and down few days and looks like that uncertainty will continue as long as events like the Trade War and Brexit play out, and that was the wrap - for the week and the month!\n\nThe Week Ahead (3-7 Sept 2019)\n\nWell, here we are in a brand new September, and there is plenty this week to give us a few surprises, with some key economic data releases\n\nUS\n\nSA Q2\n\nUS Payrolls\n\nAnd then we have US Chair Powell speech...\n\n... which could prompt a knee-jerk reaction from Trump's Twitter finger\n\n... which in turn could prompt some reaction from the market!\n\nOf course, then we still have the unfolding sagas with the US/China trade war, Brexit, and the Hong Kong crisis to keep everyone on their toes.\n\nSo expect a bumpy ride, folks!\n\nBig question : How is this likely to impact the Rand?\n\nAnd again, our simple answer is, we do not try and decipher the news or fundamentals to give us direction. We simply let the market itself tell us what is happening, by analyzing the patterns of sentiment .\n\nApplying the Elliott Wave Principle (the study of human behaviour in financial markets) to the market provides us with the best guess as to where the market is likely to be headed - much better than anything else we know.\n\nBased on our analysis, we expect some more Rand strength, but we still have a couple of possible Elliott waves counts playing out at present, and the next couple of weeks will be critical to determine whether the preferred or alternate counts play out, as there are some critical inflection points to watch.\n\nLook forward to sharing my outlook with you.\n\nTo your success~\n\nJames Paynter\n\nOriginal post", "description": "Forex Analysis by James Paynter covering: USD/ZAR. Read James Paynter's latest article on Investing.com South Africa.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg"}