{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/10/trumps-calls-foreign-leaders-long-worried-aides-leaving-genuinely-horrified", "downloaded_at": "2019-10-05 22:52:43.056334+00:00", "title": "Trump’s calls with foreign leaders have long worried aides, leaving some “genuinely horrified”", "language": "en", "text": "In another call, in April 2017, Trump told Philippine President Rodrigo Duterte, who had overseen a brutal campaign that has resulted in the extrajudicial killings of thousands of suspected drug dealers, that he was doing an “unbelievable job on the drug problem.”\n\nTrump’s personal goals seeped into calls. He pestered Japanese Prime Minister Shinzo Abe for help in recommending him for a Nobel Prize, according to an official familiar with the call…\n\nIn a summer 2018 call with Prime Minister Theresa May, Trump harangued the British leader about her country’s contribution to NATO. He then disputed her intelligence community’s conclusion that Putin’s government had orchestrated the attempted murder and poisoning of a former Russian spy on British soil.\n\n“Trump was totally bought into the idea there was credible doubt about the poisoning,” said one person briefed on the call. “A solid 10 minutes of the conversation is spent with May saying it’s highly likely and him saying he’s not sure.”…\n\nAs a result, staff fretted that Trump came across ill-informed in some calls, and even oafish. In a conversation with China’s Xi, Trump repeated numerous times how much he liked a kind of chocolate cake, one former official said. The president publicly described the dessert the two had in April 2017 when Trump and Xi met at the president’s Mar-a-Lago resort as “the most beautiful piece of chocolate cake you have ever seen.”", "description": "", "authors": ["Washingtonpost.Com Politics Trumps-Calls-With-Foreign-Leaders-Have-Long-Worried-Aides-Leaving-Some-Genuinely-Horrified"], "top_image": "", "published_at": "2019-10-05"}