{"pub": "marketwatch", "url": "https://marketwatch.com/story/zuckerberg-faces-capitol-hill-heat-on-libra-elections-fraud-2019-10-23", "downloaded_at": "2019-10-23 16:01:07.877883+00:00", "title": "Facebook’s Zuckerberg faces Capitol Hill heat on Libra, elections fraud", "language": "en", "text": "It’s shaping up as another bruising day on Capitol Hill for Mark Zuckerberg.\n\nBetween skepticism about Facebook Inc.’s FB, +1.11% ability to safeguard against election fraud to outright skepticism over its cryptocurrency project Libra, the company’s embattled chief executive impassively fielded a torrent of contentious questions from members of the House Financial Services Committee on Wednesday.\n\n“I guess I’m not the ideal messenger now,” an unflinching Zuckerberg admitted when pressed on why Facebook -- the subject of investigations from the Federal Trade Commission and 47 state attorneys general for its business practices -- should be entrusted with handling financial transactions via Libra. “I actually don’t know if Libra is going to work.”\n\nZuckerberg, who on Monday outlined several new security measures leading up to the 2020 presidential election, also addressed the elephant in the congressional room.\n\nRead more: Zuckerberg unveils Facebook’s new security measures to combat 2020 election interference\n\n“This has been a challenging few years for Facebook,” Zuckerberg said in a measured tone. “In 2016, we were on our back foot in defending elections.”\n\nThe hostile tone toward Zuckerberg was set by Rep. Maxine Waters, D-Los Angeles, chairwoman of the House Financial Services Committee. She demanded Facebook stop work on Libra until the company addresses a series of unrelated “deficiencies” in its social-media business.\n\n“You have opened up a serious discussion about whether Facebook should be broken up,” Waters said.\n\nNo one is above the law including Mark Zuckerberg. Facebook has allowed election interference, released private data, violated civil rights laws, among other offenses & now they’re trying to launch a #BigTechTakover by creating this mysterious #ZuckBuck? Not on my watch! @FSCDems — Maxine Waters (@RepMaxineWaters) October 23, 2019\n\nWhen pressed why several high-profile members of the Libra Association -- Visa Inc. V, +0.37% , Mastercard Inc. MA, -0.18% , PayPal Holdings Inc. PYPL, -1.53% , eBay Inc. EBAY, +0.01% , and Unicorn Stripe -- have abandoned the project, Zuckerberg could only muster that it was possibly because Libra is a “risky” project.\n\nZuckerberg’s testimony follows the July congressional grilling of David Marcus, the executive in charge of Libra, whom lawmakers dinged for vague answers.\n\nRead more: Facebook’s Libra cryptocurrency project gets blistering reception from Senate\n\nThe acrimony on Wednesday ran deep and cynically despite Facebook’s disclosure late Monday that it has spent $12.3 million so far this year to influence U.S. lawmakers and regulators — nearly equal to the $12.6 million it contributed to lobbying efforts in 2018.\n\nRead more: Facebook discloses record lobbying spending as Zuckerberg braces for House hearing", "description": "Between skepticism about Facebook Inc.’s ability to safeguard against election fraud to outright skepticism over its cryptocurrency project Libra, the...", "authors": ["Jon Swartz", "Senior Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT850_Zuck_ZG_20191023102419.jpg", "published_at": "2019-10-23"}