{"pub": "yahoo", "url": "https://news.yahoo.com/donald-trump-china-envoy-discuss-183047836.html", "downloaded_at": "2019-10-11 20:20:46.994099+00:00", "title": "Donald Trump says he and China reached a 'phase one' trade deal - in principle", "language": "en", "text": "WASHINGTON – President Donald Trump said Friday he and his Chinese counterparts have reached a \"phase one\" deal in principle to pause their long-running trade war – but details still have to be put to paper and a formal agreement is at least weeks away.\n\nWhile claiming general agreements to prevent intellectual property theft and for the Chinese purchase of up to $50 billion in U.S. agricultural products, Trump said he hopes to sign a deal with specifics when he and Chinese President Xi Jinping meet at an economic summit next month in Chile.\n\n“I don’t think it should be a problem getting it papered,\" Trump said.\n\nIn the meantime, Trump said he will hold off on new tariffs against China.\n\n\"Phase two\" of a new agreement will involve tougher issues, including the forced technology transfers that China imposes on U.S. businesses, Trump said.\n\nTrump met with China's top trade negotiator Friday after aides discussed the prospects of a temporary deal that could freeze the ongoing trade war between the world's two largest economies.\n\n\"All would like to see something significant happen!\" Trump wrote on Twitter.\n\nStocks climbed after Trump expressed confidence ahead of his meeting with China Vice Premier Liu He, China's top trade envoy.\n\nA variety of competing interests are at work as the U.S. and China try to strike some sort of permanent deal, said two White House aides speaking on condition of anonymity to discuss ongoing negotiations.\n\nOn the one hand, some officials pushed for a temporary agreement that would delay new U.S. tariffs set to go into effect Tuesday; they would hike tariffs on at least $250 billion in Chinese goods to 30% from 25%. In return for postponing the tariffs, China would agree to buy more U.S. agricultural products.\n\nOn the other hand, Trump has said he would not sign a \"mini-deal,\" and that he wants only a full-blown trade agreement that would settle long-time disputes over tariffs, currency rates, technology sharing, and intellectual property laws.\n\n\"We’re looking for a complete deal,\" Trump told reporters on Sept. 20. \"I’m not looking for a partial deal.\"\n\nMeanwhile, China – which has criticized various U.S. trade policies throughout the week – had signaled an interest in something temporary as talks got underway Friday.\n\n\"A partial deal is a more feasible objective,\" said an editorial in English in the state-run China Daily newspaper. \"Not only would it be of tangible benefit by breaking the impasse, but it would also create badly needed breathing space for both sides to reflect on the bigger picture.\"\n\nIn a morning tweet, Trump claimed that \"good things are happening at China Trade Talk Meeting. Warmer feelings than in recent past, more like the Old Days.\"\n\nSince summer 2018, the U.S. has slapped tariffs, ranging from 10% to 25%, on about $360 billion in Chinese imports. The early tariffs largely focused on intermediate and industrial goods but the most recent have targeted consumer products such as clothing and electronics.\n\nChina has retaliated with duties on about $110 billion in U.S. shipments to that country, largely hitting agricultural products such as soybeans, fruit and vegetables, in an attempt to undercut support for Trump among his base in the farm belt. The levies also affected coffee, chemicals, cars, auto parts, whiskey, cigars and TVs.\n\nWith negotiations at an impasse in May, Trump significantly escalated the battle, boosting a 10% tariff on $250 billion in Chinese imports to 25% and announcing levies on the remaining $300 billion in products not already subject to duties.\n\nAlthough Trump initially delayed the new tax on nearly $300 billion in mostly consumer products, he upped the ante in August following another fruitless round of trade talks. A 15% tariff on $112 billion of the imports took effect Sept. 1, up from a planned 10%, ensnaring items such as clothing and shoes. A 15% tariff on the remaining $160 billion -- including toys, cell phones and laptops – is set to hit Dec. 15.\n\nRetailers and manufacturers have absorbed much of the costs, but have started passing some along to American shoppers and warned further price increases are likely on the way.\n\nAlso, a 25% tariff on the $250 billion in largely intermediate goods is set to rise to 30% Tuesday, barring a trade deal in the coming days.\n\nLast month, both sides tamped down the crossfire ahead of the talks, with Trump delaying the duty on the $250 billion in products by two weeks and China excluding some items, such as animal feed and petroleum products, from its tariffs.\n\nThis article originally appeared on USA TODAY: Donald Trump claims 'phase one' trade deal with China - in principle", "description": "As Donald Trump prepared to meet with China's top trade envoy, a variety of competing interest are at work, aides said.", "authors": ["David Jackson", "Paul Davidson", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/JoTzGtwcglEm8VrO_Uz4tw--~B/aD0yNTQ0O3c9MzI0NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/d80b753eab5540cc092ed982284afd57", "published_at": "2019-10-11"}