{"pub": "marketwatch", "url": "https://marketwatch.com/story/nikes-new-ceo-is-expected-to-keep-digital-development-in-the-fast-lane-2019-10-23", "downloaded_at": "2019-10-23 23:21:41.392637+00:00", "title": "Nike’s new CEO is expected to keep digital development in the fast lane", "language": "en", "text": "ServiceNow Inc. CEO John Donahoe is getting a warm welcome to the Nike Inc. C-suite, with analysts bullish that his appointment to succeed Mark Parker will keep digital development on the fast track.\n\nNike NKE, -3.43% announced late Tuesday that Donohoe would assume the role, effective Jan. 13, 2020, adding to the list of chief executive switcheroos that have lately made headlines.\n\nParker will become executive chairman and continue to lead the board.\n\nRead: Nike, ServiceNow and SAP CEOs play a game of musical chairs\n\n“Nike is in the process of amplifying their digital capabilities and speed and Mr. Donahue will accelerate that trajectory,” wrote Cowen analysts led by John Kernan. “The succession plan, led by Tim Cook, CEO of Apple and a Nike board member since 2005, has been in the works for a long time and now is a fantastic time for Mr. Parker to pass the baton.”\n\nCowen rates Nike stock outperform with a $105 price target.\n\nJPMorgan analysts note that Donahoe’s experience and skill set in digital commerce and technology were highlighted as an asset in the announcement. In a statement, Parker said Donohoe is “ideally suited to accelerate [the company’s] digital transformation.”\n\nJPMorgan notes management’s emphasis that the appointment is one to “accelerate rather than overhaul” Nike’s plan. Donohoe has been involved with Nike’s strategy since 2014, which includes an evolution away from the wholesale business and a focus on digital engagement and other initiatives.\n\nJPMorgan rates Nike shares overweight with a $105 price target.\n\nSee: Under Armour’s new CEO will have to bring back the excitement the brand has lost\n\nStill, there’s a hint of caution about the transition.\n\n“Incoming CEO John Donahoe appears highly qualified and complementary to Nike’s broader digital ambitions, but also must answer some potential questions including a lack of direct brand experience,” wrote Baird analysts led by Jonathan Komp.\n\nBaird also notes that Nike has seen a “long stretch” of success with Parker, who has been CEO since 2006. And the company has tried, unsuccessfully, to bring in an outside CEO in 2004, William Perez, who resigned in 2006.\n\nBaird rates Nike stock neutral with a $92 price target.\n\nEven with all of his assets, Wedbush analysts led by Christopher Svezia say following Parker is tough.\n\nDon’t miss: Dick’s Sporting Goods junked $5 million in assault-style-rifle inventory when it stopped selling them\n\n“New CEO has large sneakers to fill as company dominates consumer, innovation,” reads the Wedbush headline.\n\nStill, analysts say, Donohue “appears to be a formidable choice to lead Nike.”\n\nWedbush rates Nike stock outperform with a $100 12-month price target.\n\nNike stock is up 26% for the past year while the Dow Jones Industrial Average DJIA, +0.17% has gained 6.5% for the period.", "description": "Nike announced that ServiceNow Chief Executive John Donohoe will succeed Mark Parker as CEO.", "authors": ["Tonya Garcia"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HL933_nikest_ZG_20190621123922.jpg", "published_at": "2019-10-23"}