{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/22/chinese-state-tv-nba-broadcast-season-opener-blackout-hong-kong", "downloaded_at": "2019-10-23 08:31:10.992042+00:00", "title": "Chinese state TV blacks out NBA season opener after threat of 'retribution'", "language": "en", "text": "China’s state broadcaster, CCTV, went against tradition and did not show any NBA games on the opening day of the new season.\n\nCCTV customarily shows the first game of the NBA season, which started in North America on Tuesday night, the early hours of Wednesday in China. However, the season opener, between the reigning champion Toronto Raptors and the New Orleans Pelicans was blacked out. The Raptors-Pelicans game was also absent from the NBA’s streaming partner in China, Tencent, although the broadcaster was scheduled to show a later game between LeBron James’s LA Lakers and their cross-city rivals, the Clippers.\n\nHow the NBA's rift with China laid bare the cost of free speech Read more\n\nThe lucrative relationship between the NBA and China has been damaged since the Houston Rockets general manager, Daryl Morey, tweeted in support of anti-government protestors in Hong Kong earlier this month. The incident has threatened the league’s sponsorship and broadcasting deals in China, which are worth hundreds of millions of dollars. Yahoo Sports estimates that the dispute with China could depress the league’s salary cap – and therefore NBA wages – by up to 15% next season.\n\nFacebook Twitter Pinterest Pro-Hong Kong activists hand out t-shirts outside of the Toronto Raptors game on Tuesday. Photograph: Cole Burston/Getty Images\n\nOver the weekend the NBA’s commissioner, Adam Silver, said Chinese officials had demanded that the Rockets fire Morey. The Chinese government denied the claims and a commentary on CCTV said Silver would face “retribution sooner or later” for the comments.\n\nSome of the NBA’s biggest names have been caught up in the dispute. After James said that freedom of speech can lead to “a lot of negative” protestors in Hong Kong burned his jersey. A small group of protestors gathered outside the Staples Center before the Clippers-Lakers game on Tuesday. They offered fans attending the game t-shirts with the slogan: “Fight For Freedom Stand For Hong Kong”. Protestors also handed out shirts with pro-Hong Kong messages before the Raptors’ game in Toronto.", "description": "China’s state broadcaster, CCTV, went against tradition and did not show any NBA games on the opening day of the new season", "authors": ["Guardian Sport"], "top_image": "https://i.guim.co.uk/img/media/2186eab67e0cd42863131cdcf5e21f219aacba0d/0_15_3200_1921/master/3200.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=005e120ac03150405434f8cd358d9943", "published_at": "2019-10-22"}