{"pub": "huffpost", "url": "https://huffpost.com/entry/houston-astros-roberto-osuna-brandon-taubman_n_5daf53b4e4b0422422cd1577", "downloaded_at": "2019-10-23 08:31:39.918503+00:00", "title": "MLB To Investigate Houston Astros Staffer's Outburst At Female Reporters", "language": "en", "text": "Major League Baseball said Tuesday that it will investigate Houston Astros staffer Brandon Taubman for reportedly taunting a group of female reporters after the team secured a berth in the World Series.\n\nOn Saturday, his team having narrowly defeated the Yankees 6-4, the Astros assistant general manager zeroed in on three female reporters in the clubhouse ― one of whom was wearing a domestic violence awareness bracelet ― and repeatedly yelled, “Thank God we got Osuna! I’m so fucking glad we got Osuna!”\n\n“Osuna” refers to the Astros’ newly acquired closer, Roberto Osuna, who joined the team this year after serving a 75-game suspension for allegedly assaulting the mother of his child. (The charges were dropped after the woman refused to testify.)\n\nTaubman’s conduct was first detailed in a Sports Illustrated report on Monday that the Astros dismissed as “misleading and completely irresponsible.” Team officials accused the sports news outlet of attempting “to fabricate a story.”\n\n“His comments had everything to do with the game situation that just occurred and nothing else,” the statement added ― a particularly confusing claim because even though the Astros won, Osuna had a terrible game.\n\nThe next day, however, the organization was forced to walk back its categorical denial after several eyewitnesses publicly confirmed the reporting.\n\n“The Astros called this [Sports Illustrated] report misleading,” Houston Chronicle sports reporter Hunter Atkins said on Twitter. “It is not. I was there. Saw it. And I should’ve said something sooner.”\n\n“Can confirm,” added Yahoo Sports baseball reporter Hannah Keyser.\n\nIn the Astros’ mea culpa statement, Taubman said he was sorry for his “inappropriate language” and “overexuberance in support of a player,” but asserted that any deeper reading of his remarks would be a misinterpretation.\n\nThat issue will now be addressed by MLB, a league that ignored domestic violence cases for 22 years under former Commissioner Bud Selig, but has paid increasingly more attention since current Commissioner Rob Manfred took over in 2015.\n\n“Domestic violence is extraordinarily serious and everyone in baseball must use care to not engage in any behavior — whether intentional or not — that could be construed as minimizing the egregiousness of an act of domestic violence,” the league said in a statement Tuesday. “We became aware of this incident through the Sports Illustrated article. The Astros have disputed Sports Illustrated’s characterization of the incident. MLB will interview those involved before commenting further.”\n\nThe Astros are scheduled to play Game 1 of the World Series on Tuesday night against the Washington Nationals.", "description": "Brandon Taubman reportedly taunted them with praise of Roberto Osuna, who sat out 75 games over domestic violence claims.", "authors": ["National Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5daf6a3b2100008821ad399d.jpeg?cache=plb4fc5yi9&ops=1778_1000", "published_at": "2019-10-22"}