{"pub": "yahoo", "url": "https://news.yahoo.com/trump-impeachment-key-witness-defies-145059626.html", "downloaded_at": "2019-10-30 02:27:09.147244+00:00", "title": "Trump impeachment: Key witness defies subpoena after White House orders him not to testify", "language": "en", "text": "Donald Trump walks towards Air Force One at Andrews Air Force Base after speaking to reporters: AP\n\nA top aide to Donald Trump’s former national security adviser, who sat in on the phone call with Ukraine that’s now at the heart of an impeachment inquiry, has failed to turn up to testify before Congress.\n\nAn attorney for Charles Kupperman, the deputy to ex-National Security Adviser John Bolton, failed to comply with a House subpoena after the White House ordered him not to speak with the three committees investigating the president, citing executive privilege.\n\nMr Kupperman was subpoenaed by the Democratic-led committees to discuss the 25 July phone call in which Mr Trump urged Ukrainian President Volodymyr Zelensky to launch investigations into one of his political rivals, Joe Biden, as well as the origins of the Russian investigation. A whistleblower complaint alleged the White House withheld crucial financial aid to the country while pressing Ukraine to conduct the probes.\n\nMr Kupperman’s attorney said he had filed a lawsuit requesting the US District Court in Washington to determine whether his client “should comply with the House’s subpoena or with the President’s assertion of immunity and instruction that he not appear and testify”.\n\nThe lawsuit said Mr Kupperman was worried that he “will inflict grave Constitutional injury on either the House or the President” if he were left on his own to decide whether to comply with the subpoena or the orders from the White House.\n\nA judge had not stepped in by the time Mr Kupperman was scheduled to testify before the committees spearheading the inquiry against the president: Foreign Affairs, Intelligence and Oversight.\n\nDespite the committee chairmen writing in a statement that the hearing would go on as scheduled, Mr Kupperman, whose lawyer said he took “no position” on the matter, was a no-show come Monday morning on Capitol Hill.\n\nThe chairmen said his absence could provide evidence of contempt and that Mr Kupperman should be present.\n\nTheir statement read: “Dr Kupperman’s lawsuit — lacking in legal merit and apparently coordinated with the White House — is an obvious and desperate tactic by the President to delay and obstruct the lawful constitutional functions of Congress and conceal evidence about his conduct from the impeachment inquiry”.\n\nMr Kupperman reportedly resigned from his post in the days after his boss, Mr Bolton, left the White House. The former national security adviser said he offered his resignation to the president, while Mr Trump insisted he fired the career government official.\n\nMr Bolton, also seen as a key witness in the impeachment inquiry against Mr Trump, was not in agreement with the president’s alleged dealings surrounding Ukraine. He reportedly described Mr Trump’s personal attorney Rudy Giuliani as “a hand grenade who’s going to blow everybody up” and described efforts to uncover dirt on Democrats as a \"drug deal\".\n\nFiona Hill, a former diplomat who testified before the House committees, said she was instructed by Mr Bolton to tell a lawyer for the National Security Council about a 10 July meeting White House officials had about Ukraine.\n\nShe said that Mr Bolton told her he did not want to be a part of “whatever drug deal” Mr Trump’s close advisers were “cooking up” when it came to Ukraine.\n\nThe week ahead could prove significant in terms of the impeachment probe.\n\nOn Thursday the committees expect to hear from Tim Morrison, a National Security Council official who is also believed to have been listening in on the phone call between Mr Trump and Mr Zelensky.\n\nHis attorney has said that he plans to testify even if the White House tries to block him.\n\nMr Morrison is expected to be a key witness because he was repeatedly mentioned in the most explosive testimony the committees have heard so far, from William Taylor, the top US diplomat in Ukraine.\n\nHe said that Mr Morrison had told him about a conversation with Gordon Sondland - the US ambassador to the EU - in which it was claimed that the president had personally insisted that Mr Zelensky announce publicly that Joe Biden and his son were under investigation.\n\nRepublicans have focused on the second, third and fourth-hand nature of the claims.\n\nOther witnesses this week could include Alexander Vindman, the White House National Security Council's top Ukraine expert; Kathryn Wheelbarger, acting assistant secretary of defence for international security; and two State Department Ukraine specialists, Catherine Croft and Christopher Anderson.\n\nHowever, it is not yet clear whether they will turn up to give evidence.\n\nRead more\n\n‘Giuliani’s a grenade who’ll blow everyone up’, John Bolton rages\n\nBolton's testimony in Trump impeachment probe in doubt\n\nBoth Democrats and Republicans may relish public impeachment hearings\n\nJudge orders DOJ must give secret Mueller evidence to Congress\n\nLindsey Graham lashes out over impeachment probe\n\nChaos as Republicans storm Trump impeachment hearings", "description": "A top aide to Donald Trump’s former national security adviser, who sat in on the phone call with Ukraine that’s now at the heart of an impeachment inquiry, has failed to turn up to testify before Congress.An attorney for Charles Kupperman, the deputy to ex-National Security Adviser John Bolton, failed", "authors": ["Chris Riotta"], "top_image": "https://s.yimg.com/uu/api/res/1.2/b9Qidm0hQ6gMXR8ewudlHA--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/e8e9205feb38491aecfbad09d74dc521", "published_at": "2019-10-28"}