{"pub": "abcnews", "url": "https://abcnews.go.com/Sports/beijing-olympics-unveils-adorable-panda-mascot-suit-ice/story?id=65665864", "downloaded_at": "2019-09-18 07:25:09.447329+00:00", "title": "Beijing Olympics unveils adorable panda mascot in a suit of ice for 2022 games", "language": "en", "text": "Meet Bing Dwen Dwen, the adorable face of the 2022 Winter Olympic Games.\n\nBing Dwen Dwen is the official #mascot of Olympic Winter Games #Beijing2022! With a suit of ice, a heart of gold and a love of all things winter sports, this panda is ready to share the true spirit of the #Olympics with the whole world. pic.twitter.com/TSalSny3q1 — Beijing 2022 (@Beijing2022) September 17, 2019\n\nInterested in Olympics? Add Olympics as an interest to stay up to date on the latest Olympics news, video, and analysis from ABC News. Add Interest\n\nThe Beijing organizing committee shared a photo on Twitter of the black and white bear in a glistening suit of ice and wrote \"this panda is ready to share the true spirit of the Olympics with the world.\"\n\nThey also posted an animated short that shows the spunky bear's magical origin story. Bing Dwen Dwen transforms his icy outer layer into ice skates, a snowboard and more, featuring the marquee sports of the winter games.\n\nNihao #BingDwenDwen! Let's find out how this adorable panda #mascot came to life as we count down to #Beijing2022! pic.twitter.com/rfAMd9o0pm — Beijing 2022 (@Beijing2022) September 17, 2019\n\nWhile there's still plenty of time for nations to prepare for the games, International Olympic Committee President Thomas Bach said he expects the mascot launch \"will generate even more interest in these Games, especially among young people.\"\n\n“The launch of the mascot today will generate even more interest for these Games, especially among young people. What I can say already is that it will be a wonderful ambassador for China and the Olympic Winter Games Beijing 2022.” - IOC President Thomas Bach #Beijing2022 pic.twitter.com/oTYonu4HKB — IOC MEDIA (@iocmedia) September 17, 2019\n\nThe mascot launch ceremony took place Monday evening at Shougang Park in Beijing, China. The 2022 Winter Olympics takes place Feb. 4 to 20.\n\nThe air is still buzzing with excitement following this evening’s #mascot launch in Shougang Park. Let us know what you think of #BingDwenDwen & #ShueyRhonRhon! #Beijing2022 pic.twitter.com/reO2uoEl4Y — Beijing 2022 (@Beijing2022) September 17, 2019\n\nThe organizing committee also unveiled Shuey Rhon Rhon, a red paper lantern child that will be the mascot for the Paralympic Games.", "description": "The official account for the Beijing Organising Committee for the 2022 Olympic and Paralympic Winter Games shared a photo of Bing Dwen Dwen, the panda mascot.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Sports/Bing-Dwen-Dwen-ht-er-190917_hpMain_16x9_992.jpg", "published_at": "2019-09-17"}