{"pub": "marketwatch", "url": "https://marketwatch.com/story/10-lessons-from-retirement-2019-01-25", "downloaded_at": "2019-09-28 12:04:47.808006+00:00", "title": "10 retirement lessons from a retired retirement pro", "language": "en", "text": "For the better part of 40 years, I spent a great deal of time helping thousands of workers prepare for retirement. We ran seminars for workers and spouses on topics like retirement income, insurance, lifestyle, relocation and more. I think it’s fair to say that, if someone took advantage of the programs offered, they would have been well prepared financially and emotionally for retirement.\n\nSadly, relatively few workers utilized all that was available to them—this despite the support and urging of the unions that represented them. I retired in 2010, suffering in part from banging-your-head-against-the-wall syndrome.\n\nSince then, I’ve learned a great deal more about retirement, both from my own experience and from others. Here are my top 10 lessons:\n\n1. No matter how well you’ve prepared and how generous your sources of retirement income, money is always on your mind. For some reason, I’ve found the financial “what ifs” still stare us in the face. Perhaps it’s because we know there are no do-overs and hence our financial resources are finite.\n\nRead: The first year of early retirement has been one of the hardest of my life\n\n2. I am convinced that, once retired, the ability to rebuild savings remains essential. You cannot handle a significant, unexpected expense from your main retirement savings without jeopardizing your financial future. That means you need emergency money, outside of your regular retirement plan, and you need to replenish that fund if it’s used.\n\n3. In the old days, we used to tell employees about the three-legged stool of retirement income: company pension, Social Security and personal savings. Today, the stool has different legs. For most Americans in the private sector, there’s no company pension and instead only a 401(k) plan. The new legs are now employer plan savings, Social Security and other savings. Since retiring, I better appreciate the value of having substantial savings, beyond what you accumulate in your employer’s plan.\n\n4. Maintaining your lifestyle isn’t as easy as it looks. After nine years, I’ve maintained mine. But that’s only been possible because of a measure of frugality, coupled with my goal of retiring with enough income to replicate 100% of my base salary, rather than the standard advice to aim for 80%.\n\n5. Inflation is real. For many people, health care spending, property taxes and rent will be the big inflation concerns. There’s no escaping inflation, so you need to plan. I would suggest having a pool of money that you leave untouched and allow to grow, until you need it later in retirement to offset increasing expenses.\n\n6. The transition to retirement isn’t easy. I found it very hard to let go of my professional life. For instance, I used to be invited to speak at conferences around the country, staying in top resorts. In a blink of an eye, that was gone.\n\n7. Busy or bored? It’s your choice. When I asked folks—who were about to retire—what they planned to do, typical answers included “play golf,” “fish” and “tinker around the house.” Those aren’t enough. But take heart: You’ll soon be busy. The question is, will you be busy doing what you want to do?\n\n8. Where did all the “friends” go? When you work with people for many years, your relationship with them might seem like it’s about more than just business. But when you retire, and you lose your authority and influence, it can feel like you dropped off the planet. Your true friends will remain. But your value to others will be gone—and so will they. Don’t be surprised.\n\n9. There is an old saying, “I married you for better or worse, but not for lunch.” When I announced I was planning to retire, my wife said, “Fine, but I’m not changing my activities.” She hasn’t and nor should she. When you add eight to 12 hours a day to the time you spend with a person, there’s an adjustment. Talk about it.\n\n10. There is an end to retirement. I don’t want to be maudlin. But before graduating school or college, we look forward to a career. During our career, we look forward to retirement. Once retired, we look forward to waking up.\n\nOK, it isn’t that bad and it isn’t like the end of the movie is a big secret. Still, when you receive notices of former co-workers passing, it’s a little depressing. Keep calm and carry on.\n\nRichard Quinn blogs at QuinnsCommentary.com. Before retiring in 2010, Dick was a compensation and benefits executive. His previous blogs include Healthy Change, Saving Ourselves and Required Irritation. Follow him on Twitter @QuinnsComments.\n\nThis column originally appeared on Humble Dollar. It was republished with permission.", "description": "How to plan, save and keep calm.", "authors": ["Richard Quinn"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GK453_math_t_ZG_20180606222306.jpg", "published_at": "2019-01-25"}