{"pub": "arstechnica", "url": "https://arstechnica.com/science/2019/10/shipping-not-land-based-sources-may-account-for-a-lot-of-ocean-trash", "downloaded_at": "2019-10-05 10:18:42.376637+00:00", "title": "One of the most remote islands is plagued by plastic waste", "language": "en", "text": "Roughly halfway between Argentina and South Africa, in the middle of the South Atlantic Ocean, is the most remote settlement on earth. The island of Tristan da Cunha, home to 251 descendants of a handful of 19th-century settlers, is the only inhabited island in its tiny archipelago.\n\nNearby is an inhospitable rock called Inaccessible Island, named for its forbidding cliffs and difficult landings. But something does land on the island: plastic. A paper in PNAS this week pieces together where a lot of that plastic comes from and points to a disconcerting potential source of plastic pollution—international shipping.\n\nThe Great Atlantic Garbage Dump\n\nA colossal amount of garbage is brought together by vast oceanic currents. Islands near these currents tend to feel the effects, with loads of trash stranding on their shores.\n\nInaccessible Island is in the heart of a \"trashstrom:\" surveys have found that the quantities of debris washed up here are some of the highest of any oceanic island. People mostly don't come here—there are just one or two landings here per year—so the trash just accumulates, working its way into the sand and the crevices.\n\nSome of the few people who come study that trash, as it can offer up clues about what's in the South Atlantic Garbage Patch. There's a stretch along the west coast of the island where people have been documenting what has washed up since the 1980s and carefully piling up the documented trash to keep track of what's new.\n\nPeter Ryan, an ornithologist at the University of Cape Town, led a team of researchers in documenting 3,515 pieces of Inaccessible Island's trash in 2009 and another 7,368 items in 2018. Once the beach was cleared in 2018, Prof. Ryan and his colleagues kept track of anything new that washed up over 10 weeks. Then they compared the trash, year on year, and noticed some interesting patterns.\n\nMostly single-use, mostly for drinking\n\nThere was, as you might expect, all sorts of things in those huge collections of garbage. But the biggest single category—about 30%—was bottles, and 98% of those bottles were plastic. This doesn't necessarily mean that 98% of the bottles dumped in the ocean were plastic; glass bottles are more likely to break, and plastic bottles can more easily travel on the wind, so they might be more likely to show up in this kind of context.\n\nOf those plastic bottles, the majority were for drinks, with water bottles making up most of the drinks bottles. The fraction of these bottles went up in the more recent count, which suggests that they're increasing in abundance. This finding was based on just two points in time, though, so it's worth being a little cautious about it, but the increase in plastic drinks bottles compared to other kinds of debris does coincide with the growth of the global bottled-water market.\n\nWhat's best about these bottles is that some of them can give clues about where they come from because many of them are stamped with details of when and where they were manufactured. Things can get a little hazy here—some of the bottles have the date of manufacture, some a best-before date, and some have both, so it's possible to mistake the date you're looking at. But the dates gave the researchers some sense of where the bottles had come from and how long they'd taken to get there.\n\nIn the 1980s, South America was the main contributor of plastic bottles on the island. That makes sense—it's (comparatively) right there. But in 2009, bottles manufactured in Asia just beat out South America, and by 2018, Asian-source bottles (mostly from China) made up 75% of the total.\n\nToo far, too fast\n\nWhere did these bottles come from? Models of ocean currents suggest that debris from India and Southeast Asia would take three to five years to end up in the South Atlantic, while trash from China and its neighboring countries probably wouldn't get there at all. So, garbage from land-based sources probably doesn't make sense. And the newly washed-up bottles from Asia had more recent dates than the newly washed-up bottles from South America, suggesting they hadn't travelled far.\n\nWhat about imports? Could southern Africa and South America be drinking from loads of Chinese-manufactured drinks bottles? Turns out both of these regions manufacture pretty much all their drinks bottles locally. So Ryan and his team think shipping might be the culprit. Dumping of plastics into the sea from ships was banned internationally in 1989, but of course adherence is a different matter.\n\nThe researchers gathered huge mounds of trash, but a point of caution here is that not all of that trash yielded useful information on dates and sources. There were 952 accumulated drinks bottles, which is a big number, but some of the other sub-categories were quite small—for instance, just 17 plastic bottles from South America washed up on the freshly-cleared beach over 10 weeks. Compared to 102 bottles from China in that period, that certainly looks meaningful, but you really need more data points to be sure. And trends may be quite different for a range of different kinds of trash.\n\nAll the same, the research is an intriguing—and alarming—new possibility for investigating the source of the trash flowing into our oceans. It's assumed that most plastic trash comes from land-based sources, write Ryan and his colleagues. But that may not be the case, they point out, and \"urgent action is needed to reduce illegal dumping by all vessels.\"\n\nPNAS, 2018. DOI: 10.1073/pnas.1909816116 (About DOIs).", "description": "And plastic water bottles are a particularly frequent culprit.", "authors": ["Cathleen O'Grady"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/47448001511_b05cac8c96_k-760x380.jpg", "published_at": "2019-10-04"}