{"pub": "cbc", "url": "https://cbc.ca/news/canada/saskatoon/a-saskatchewan-writer-s-family-story-is-now-a-film-by-an-oscar-nominated-director-1.5318443", "downloaded_at": "2019-10-12 00:19:27.528531+00:00", "title": "A Saskatchewan writer's family story is now a film by an Oscar-nominated director | CBC News", "language": "en", "text": "A tragic moment in the family history of a Saskatchewan writer is now a film, directed by Academy Award and Golden Globe nominated director Zaza Urushadze.\n\nAnton, adapted from Saskatchewan writer Dale Eisler's work of historical fiction, Anton, his friend and the Russian Revolution, premieres this weekend in Chicago.\n\nIt's a story that Saskatchewan writer Dale Eisler had always known, but struggled to write..\n\nSet in Ukraine in 1919, it tells the story, through viewpoint of a young boy, of the little-known struggle of Germans who had settled there to farm the land, but who then became the target of Bolshevik militias during the Russian Revolution.\n\nDale Eisler has a pretty impressive resume. He's a journalist, author, professor, and has been a diplomat. But he can now add screenwriter to his list of achievements. Eisler's book, \"Anton, a Young Boy, his Friend and the Russian Revolution\" has been made into a foreign-language film. It is showing across the United States in the next few months, including the film's premiere in Chicago on October 12. Dale Eisler joined Garth Materie in studio to talk about his first film. 10:00\n\nA day in a farming village\n\nAt the heart of the story for Eisler is the killing of his grandfather in the farming village of Odessa, which was witnessed by his wife and their nine children.\n\nWhen Eisler published the book in 2010, it came in the form of historical fiction because it was impossible to gather the facts from family members because, as Eisler recalled, they \"would get very emotional so … I couldn't really explore it the way I wanted to.\"\n\n[The family] would get very emotional. - Dale Eisler on the difficulties he encountered telling the story\n\nThere was one small, factual account of that day that left a deep scar on Eisler's family. It was found in a history book that helped prop up the family's TV in Eisler's childhood home.\n\n\"It talked about this particular village where my mother lived at the time,\" he recalled.\n\n\"'On this date 12 of the village's men were killed,' and then there was a footnote at the bottom of the page where they list the names of the people and there was my grandfather's name. So that was the only kind of documented history I had of it.\"\n\nA scene from the Russian Revolution in 1917. (The Associated Press)\n\nFrom novel to screen play\n\nThe book found good reviews, and often readers would remark that the story would make an interesting movie. So Eisler wrote a screenplay and pitched it in Hollywood, where it eventually ended up in the hands of Urushadze, a director who was once nominated for an Oscar for best foreign language film for his film Tangerine.\n\nisler says he is pleased with Urushadze's adaptation of his novel and is excited about the Chicago premiere.\n\nSadly, he can't say when the film will screen here in Saskatchewan.\n\n\"It's an art house-type movie with a pretty limited scope in terms of commercial interests,\" he said. \"Subtitled movies just are like that.\"\n\nIf the movie is well received, Eisler says, he hopes it will come to this province in 2020.", "description": "Saskatchewan writer Dale Eisler's book \"Anton, a young boy, his friend and the Russian Revolution\" is now a movie set to premiere in Chicago.", "authors": [], "top_image": "https://i.cbc.ca/1.5318477.1570818239!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/dale-eisler.jpg", "published_at": "2019-10-11"}