{"pub": "metro", "url": "https://metro.co.uk/2019/10/14/england-fan-dies-bulgaria-found-helpless-condition-10917049", "downloaded_at": "2019-10-14 23:27:35.908904+00:00", "title": "England fan dies in Bulgaria after being found ‘in helpless condition’", "language": "en", "text": "Bulgaria fans hang national flags alongside England ones ahead of the UEFA Euro 2020 qualifier tonight (Picture: Reuters)\n\nAn England fan has died in Bulgaria ahead of tonight’s Euro 2020 qualifier, after reportedly being found in a ‘helpless condition’.\n\nThe unnamed 32-year-old was said to be acting ‘aggressively, raging and threatening’ when he was discovered at around 10am today.\n\nA spokeswoman for the Ministry of Interior said no cause of death has been identified.\n\nShe said: ‘A 32-year-old man has sadly died.\n\n‘At 10am today, the police received a signal to attend a man in a helpless condition, in the city centre.\n\n‘He was a foreign national, from Britain, and he was taken to hospital but he sadly died.\n\nA man selling flags poses for a photograph before the match (Picture: Reuters)\n\n‘Police are working to clarify all the circumstances in the incident.\n\n‘There is no further detail on any injuries.\n\nAdvertisement\n\nAdvertisement\n\n‘There will be a forensic examination to find out what the cause of death was.’\n\nA statement on the authority’s website added that in hospital, the victim ‘suddenly began to act aggressively, raging and threatening’.\n\nA Foreign Office statement added: ‘We are supporting the family of a British man who died following an incident in Sofia, and our staff are in contact with the UK and Bulgarian authorities.’\n\nIt came as England prepare to take on Bulgaria in Sofia tonight.\n\nEngland supporters were involved in violent clashes with police in Prague on Friday, ahead of the Three Lions’ 2-1 defeat to the Czech Republic.\n\nAsked about the trouble after the defeat, England manager Gareth Southgate said: ‘Of course, always disappointing and I think I’ve always spoken about how we would want everybody to conduct themselves.’\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "An England fan has died in Bulgaria ahead of tonight's Euro 2020 qualifier, after reportedly being found in a 'helpless condition'. The unnamed 32-year-old was said to be acting 'aggressively,...", "authors": ["Jen Mills"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_89857881_1571084419.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-14"}