{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/09/17/warrens-masterful-speech-new-york", "downloaded_at": "2019-09-17 23:24:45.185770+00:00", "title": "Warren’s masterful speech in New York", "language": "en", "text": "\n\nSen. Elizabeth Warren (D-Mass.) speaks during an event at Washington Square Park in New York on Monday. (Jeenah Moon/Bloomberg)\n\nOpinion writer\n\nSen. Elizabeth Warren’s speech in New York on Monday night connected the struggles of the past to the struggles of today and, hopefully, the changes the nation will make in the future. The address was designed to counter both the moderate argument that she’s too far left to be elected, as well as one that challenged the progressive wing of the party, where some have attacked her for her Republican past and her technocratic willingness to work within the system to accomplish her goals. Warren offered a strong argument that she’s the candidate who can accomplish many of the goals cherished by the left, while also making a strong appeal to female voters. It was a masterful, inspiring speech.\n\nWhen she bounded onto the stage, at Washington Square Park in lower Manhattan, you wouldn’t have expected someone so enthusiastic to start her address with a depressing story. But Warren began by recalling the Triangle Shirtwaist Factory Fire of 1911, which killed 146 garment workers — almost all women — in just 18 minutes, only a block from where she was standing. It wasn’t just the bosses who locked them in the factory to prevent theft who were to blame for the fire and the deaths, Warren said; it was a corrupt political establishment, doing the bidding of wealthy business owners, who created the conditions that led to the tragedy. “Business owners got richer, politicians got more powerful, and working people paid the price,” Warren said. “Does any of that sound familiar?”\n\nWhy, yes, it does.\n\nFrom the Triangle fire, Warren argued that our inability to make any positive change on matters ranging from climate change, income inequality, gun control and health-care reform is the result of the corrupt capture of our government by the obscenely wealthy to keep and increase their money and power, the rest of us be damned. She outlined her plan, debuted Monday morning, to tackle Washington corruption. It’s similar to legislation she introduced last year. “Corruption has put our planet at risk. Corruption has broken our economy. And corruption is breaking our democracy,” she said. She also discussed her wealth tax, which would raise money to pay for universal child care, make public colleges tuition free, and wipe out the vast majority of student debt. “Two cents,” the crowd chanted, quoting back her line at how little — a 2 percent annual tax on assets — that plan will cost people with a net worth of more than $50 million.\n\nWarren then turned to the female-dominated reform movement of the Gilded Age. She evoked Frances Perkins, witness to the Triangle fire, whose activism changed fire safety rules after the tragedy, and who went on to serve as Franklin Roosevelt’s secretary of labor, helping to enact everything from Social Security to the nation’s first national minimum wage law. “Frances pushed from the inside,” Warren said. “Frances Perkins became the first woman in history to serve in the Cabinet. And what did she do when she got there? Big structural change.” It took Perkins and all the women — so many of the reformers were women — who marched with her, over and over again, to slowly but surely reform the system and American lives for the better, Warren said. To make change, she argued, requires the cooperation of both the activists who challenge the power and the bridge figures, like Perkins — and Warren, or so her argument goes.\n\nWill it all translate into primary votes for Warren? It’s hard to say. If the rally showed the enthusiasm of Warren supporters — she spent hours after the event taking selfies with more than 4,000 people, her campaign said — it showed signs of Warren’s continuing struggles, too. New York is a majority-minority city and region, but that wasn’t much in evidence. On the other hand, Wall Street and the tech sector were hardly represented either. It was the New York the teachers and students, artists and social workers — the white ones, that is.\n\nThere were more women than men, too. Amy Straub, a 40-something wedding video editor from Queens supported Sanders in 2016, but she has switched to Warren this time. Yes, she would like to vote for a woman, and yes, she likes Warren’s plans, but there’s something more ephemeral, too. “I feel more hopeful with Warren,” Straub said. It was a sentiment that came up over and over again. “There’s something about Elizabeth Warren,” said Fiona Murray, 50, a Manhattan musician, who called her “inspiring.”\n\nPerhaps that hope and inspiration is because Warren projects a peppy, can-do attitude. That fits with the optimistic, self-help culture of the United States, where no obstacle is too big to be overcome with hard work. Warren once did a turn as a personal finance guru, writing a book that offered advice to economically strapped Americans. She’s now attempting to perform that feat again, but for our politics. “I know what’s broken, I’ve got a plan to fix it and that’s why I’m running for president of the United States,” she said Monday. She has a plan to wrest back control of the government from corporations that value American lives less than their own bottom line. The rest of us, she is saying, just need to follow her lead. The crowd in New York seemed convinced. We’ll find out how compelling a message that is for the Democratic voters of Iowa and New Hampshire in less than five months.\n\nRead more:\n\nEd Rendell: I like Elizabeth Warren. Too bad she’s a hypocrite.\n\nRob Stutzman: Why Elizabeth Warren is the one to watch\n\nJennifer Rubin: In New Hampshire, Elizabeth Warren shows why she’s on the rise\n\nJennifer Rubin: Warren just emphasized her biggest weakness\n\nAndy Puzder: Elizabeth Warren is the real economic threat\n\nMax Boot: Elizabeth Warren has lots of ideas. Bad ideas.", "description": "She connected the struggles of the past to the struggles of today and, hopefully, the changes the nation will make in the future.", "authors": ["Helaine Olen", "Opinion Writer Focusing On Politics", "Economics", "American Life", "Opinion Writer", "September At Pm", "Helaine Olen Is A Contributor To Post Opinions", "The Author Of", "Pound Foolish", "Exposing The Dark Side Of The Personal Finance Industry."], "top_image": "https://www.washingtonpost.com/resizer/f5UWpoh5SiPL1HkXhbs02LUKsA8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7QPNQ2WY7MI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-17"}