{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/27/syracuse-hosts-fcs-foe-holy-cross-in-the-carrier-d", "downloaded_at": "2019-09-27 09:29:44.381381+00:00", "title": "Syracuse hosts FCS foe Holy Cross in the Carrier Dome", "language": "en", "text": "Syracuse isn’t where it hoped to be when the season started, but there’s nothing like a win to alter the mindset.\n\n“Without a doubt, man, I feel like a change is coming,” senior defensive end Alton Robinson said.\n\nThe Orange (2-2), coming off an important home win over Western Michigan, will try to make it two in a row when Championship Subdivision foe Holy Cross (1-2) visits the Carrier Dome on Saturday, the final game of a three-game homestand.\n\nSyracuse leads the all-time series against the Crusaders 23-5 and has won the last 12 games, though the teams have not met since the Orange triumphed 5-3 in 1973 on the road. Syracuse notched a fourth-quarter safety to win it, breaking a tie when Holy Cross punter Tom Rock was tackled in the end zone after the snap sailed over his head.\n\nWith plenty of reminders all around - The Citadel upset Georgia Tech 27-24 in overtime two weeks ago - Syracuse isn’t about to take any foe lightly. Even one whose only victory - 13-10 over New Hampshire - was secured with a fumble recovery in the end zone with under 2 minutes to play in the fourth quarter.\n\n“I feel like we’ve got to be ready to go at all times,” said Robinson, who had six tackles, including 3.5 for a loss, two sacks and five quarterback hurries in the 52-33 win over WMU . “They do a couple of different things offensively that we haven’t seen in a while.”\n\nOrange coach Dino Babers remains wary, the memory of lopsided losses to Maryland and No. 1 Clemson a reminder of what can go wrong.\n\n“I would hope that we didn’t get too down because we had two losses, and I would hope that we’re not too up because we had a win over Western Michigan,” Babers said. “There’s a process going on here. We’ve talked about it from day one.\n\n“We’ve really had a more difficult road to hoe than what people are giving us credit for,” Babers added, noting that Syracuse began the season with road games against Liberty and the Terps. “I just think we need to let it happen, be patient, let it come to us, and as these guys grow up we’re going to get better and better. I think they got better, but they’re not exactly where I want them right now.”\n\nOther things to know when Holy Cross visits Syracuse on Saturday:\n\nTRICKERY COMING?\n\nMaine put a brief early scare into the Orange in Doug Marrone’s second year as Syracuse head coach nine years ago, using gimmicks and trick plays before falling 38-14.\n\nMore of that coming?\n\n“Maybe,” Holy Cross tailback Domenic Cozier said. “We’re definitely going to try to let her rip. We know we’ve really got nothing to lose. We’ve been working on looks they’ve never seen before. We’ve been practicing them all week, so it’ll be interesting.”\n\nTHE STREAK\n\nSyracuse recovered three fumbles and intercepted a pass against Western Michigan to extend its streak of consecutive games with a takeaway to 18, the third-longest active streak in FBS behind Houston (21) and Mississippi State (19). The Orange also have intercepted at least one pass in 17 straight games, the longest active streak nationally. Holy Cross QB Connor Degenhardt has not thrown an interception. Babers was hopeful secondary standouts Andre Cisco and Ifeatu Melifonwu would return from injuries.\n\nDISCIPLINE, NO DISCIPLINE\n\nHoly Cross ranks third in the nation in fewest penalty yards (26.7 per game) while Syracuse is 126th with 36 penalties in four games, and only three other teams have more penalty yards than the Orange’s 311.\n\nMOE’S MOMENT\n\nSyracuse RB Moe Neal needs five yards to become the 23rd player in program history to reach 2,000 career rushing yards. The Holy Cross defense is allowing nearly 300 yards rushing per game, though that total includes a 45-7 loss at Navy to open the season. The Midshipmen’s option attack accounted for 428 rushing yards.\n\nORANGE RULE\n\nSince Division I was split into two tiers in 1978, Syracuse is 17-0 against teams from the Championship Subdivision, all but one of the wins coming inside the Carrier Dome. The Crusaders, who joined the FCS in 1982, have three wins in 17 games against Bowl Subdivision opposition, all against Army (1986, 1987, and 2002). Before the NCAA split the divisions, Holy Cross defeated Syracuse 14-13 at Worcester, Massachusetts in 1958, a year before the Orange won their lone national championship, making the Crusaders the last current FCS team to beat Syracuse.\n\n___\n\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Syracuse isn't where it hoped to be when the season started, but there's nothing like a win to alter the mindset.", "authors": ["The Washington Times Http", "John Kekis"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/27/clemson_syracuse_football_22489_c0-151-3600-2249_s1770x1032.jpg?86a0ad2941f4f8cac64fde118e16286d6ebd0c8d", "published_at": "2019-09-27"}