{"pub": "wsj", "url": "https://wsj.com/articles/trump-administration-advances-plan-to-shift-3-6-billion-in-military-funds-to-border-wall-11567551501?mod=rsswn", "downloaded_at": "2019-09-03 23:42:32.617243+00:00", "title": "Trump Administration Advances Plan to Shift $3.6 Billion in Military Funds to Border Wall", "language": "en", "published_at": "2019-09-03", "text": "WASHINGTON—The Trump administration is moving ahead with plans to divert $3.6 billion from military-construction projects to build or fortify portions of a wall along the U.S.-Mexico border.\n\nDefense Secretary Mark Esper called House Speaker Nancy Pelosi (D., Calif.) on Tuesday to detail the funding shifts, which would be divided about evenly between domestic and international military projects, the Pentagon said.\n\nMr. Esper authorized diverting funds for 11 wall projects, which would delay as many as 127 military projects, the Pentagon said.\n\nDefense officials wouldn’t say which military projects would be affected until the Pentagon had notified all members of Congress whose districts would be affected, a process they said would be completed by Wednesday. Defense officials said that affected embassies also were being notified.\n\nRelated video President Trump has declared a national emergency to fund a barrier at the border with Mexico. But what constitutes a national emergency and how will the funding work? Jason Bellini reports. Photo: Getty\n\nPentagon officials said the military-construction projects had been deferred, not canceled, but Mr. Esper’s decision could amount to defunding the projects. Democrats have vowed to not re-appropriate money for the affected military projects.\n\nThe diverted funding would be used to build or replace 175 miles of wall construction along the U.S.-Mexican border, defense officials said. Construction could begin as soon as three months from now on land owned by the Pentagon along the border, Deputy Under Secretary of Defense Comptroller Elaine McCusker told reporters Tuesday. Wall construction on other government or private land would begin later, Ms. McCusker said.\n\nArmy Lt. Gen. Andrew W. Poppas, director of operations for the Joint Staff, said the Pentagon anticipated that some of the roughly 5,000 active duty and National Guard troops now at the border could leave as construction projects are completed. But he said he couldn’t provide details over how many troops would be leaving or when.\n\nPresident Trump declared a national emergency in February, ordering government agencies to search for a total of $6.7 billion they could divert from military and other projects toward border-wall construction. That allowed him to skirt Congress, which had signaled it was willing to give him significantly less. In July, the Supreme Court ruled in a 5-4 decision that Mr. Trump had the authority to order such a transfer.\n\nWrite to Michelle Hackman at Michelle.Hackman@wsj.com, Andrew Duehren at andrew.duehren@wsj.com and Nancy A. Youssef at nancy.youssef@wsj.com", "description": "The Trump administration is moving ahead with plans to divert $3.6 billion from military-construction projects to build or fortify portions of a wall along the U.S.-Mexico border.", "authors": ["Michelle Hackman", "Andrew Duehren", "Nancy A. Youssef", "Michelle.Hackman Wsj.Com", "Andrew.Duehren Wsj.Com", "Nancy.Youssef Wsj.Com"], "top_image": "https://images.wsj.net/im-103699/social"}