{"pub": "guardian", "url": "https://theguardian.com/technology/2019/oct/29/google-pixel-4-xl-review-not-quite-ready-for-primetime", "downloaded_at": "2019-10-29 07:46:30.847701+00:00", "title": "Google Pixel 4 XL review: not quite ready for primetime", "language": "en", "text": "Google’s latest Pixel 4 XL smartphone is its bravest yet, throwing out the conventions of old, integrating cutting-edge technology and attempting to round it all out with a special mix of software direct from the Android-maker.\n\nBy now you probably know the drill. The Pixel 4 XL is a metal and glass sandwich like practically every other phone. Unlike most though the aluminium sides have a black textured coating, which aids grip, while the back feels almost like super-smooth skin or silk rather than glass. It also has bold, contrasting colours, if you choose the white or orange variant, that make it stand out well against the competition.\n\nThe 6.3in QHD+ OLED screen is big but not massive by today’s 6.5in-plus standards. It has a 90Hz refresh rate, but just in certain lighting conditions for now, which Google says it’s working on a fix to increase. Generally it makes the experience of using it smoother and more fluid. It’s crisp, colourful and has good viewing angles but can’t reach the same super-bright heights as rivals – the 90Hz display on the OnePlus 7T Pro has far more wow factor. A chunky top bezel hides a new Face Unlock system and Google’s new party trick: the Soli radar system.\n\nFacebook Twitter Pinterest The frosted glass back feels very different to those fitted to rivals. Photograph: Samuel Gibbs/The Guardian\n\nThe Pixel 4 XL is a large phone that doesn’t feel too big in the hand. The textured sides and frosted glass back help with grip. I never felt I would drop it. At 8.2mm thick and 75.1mm wide it compares favourably to Apple’s iPhone 11 Pro Max and the OnePlus 7T Pro, while undercutting both by as much as 29g.\n\nIt feels like a phone you’re meant to use without a case, rather than something that needs protecting – although dropping it runs the risk of it smashing, like any other phone, so whether people will use it without a case is another matter.\n\nThe bottom has a USB-C port, the back supports wireless charging, there’s an accent colour on the power button and you can still squeeze the sides on the bottom half of the phone to activate Google Assistant.\n\nSpecifications\n\nScreen: 16cm (6.3in) QHD+ OLED (90Hz, 537ppi)\n\nProcessor: octa-core Qualcomm Snapdragon 855\n\nRAM: 6GB\n\nStorage: 64 or 128GB\n\nOperating system: Android 10\n\nCamera: Dual rear cameras (12.2+16MP) with OIS, 8MP front-facing camera\n\nConnectivity: LTE, wifi 5, NFC, eSIM, Bluetooth 5, GPS, 3D face recognition\n\nDimensions: 75.1 x 160.4 x 8.2mm\n\nWeight: 193g\n\nSpeed, but not for long\n\nFacebook Twitter Pinterest The battery life isn’t great, so you might be reaching for the charger more than you’d expect. Photograph: Samuel Gibbs/The Guardian\n\nThe Pixel 4 XL has 6GB of RAM, at least 64GB of storage and one of Qualcomm’s top processors, the Snapdragon 855, which was only recently replaced by the slightly faster 855+ as used in the OnePlus 7T and 7T Pro.\n\nIn day-to-day tasks the Pixel 4 XL felt fast and fluid – significantly faster than a Samsung Galaxy S10, but not quite as super-slick as the OnePlus 7T. Most will be very happy and the Pixel 4 XL is likely to continue feeling fast and responsive a couple of years down the line if the previous generation Pixels are anything to go by.\n\nWhat’s not so great is battery life. The Pixel 4 XL only lasts just over 26 hours between charges with medium usage, which means 7am on day one until 9am on day two in the working week. That’s not really long enough to guarantee the Pixel 4 XL will be alive and kicking at the end of a night out to see you home.\n\nThat was while using it as my primary device, with 200 or so emails, messages and push notifications, a couple of hours of browsing in Chrome, five hours of Spotify via Bluetooth headphones, 50 minutes of Into the Badlands from Amazon Prime Video, and taking about 15 photos.\n\nFor comparison, the OnePlus 7T lasts 34 hours or the similarly sized iPhone 11 Pro Max lasts just shy of 48 hours under similar conditions. Turning off the ambient display feature added about two hours to the battery life.\n\nThe Pixel 4 XL fast-charges at up to 18W via any USB-C Power Delivery charger, one of which is included in the box, and wirelessly charges at up to 11W. A full charge via cable took just under two hours, hitting 70% in 50 minutes.\n\nAndroid 10\n\nFacebook Twitter Pinterest The new Google Recorder app is a brilliant example of using on-device AI technology for useful new functions, rather than whizz-bang gimmicks. Photograph: Samuel Gibbs/The Guardian\n\nThe Pixel 4 XL is one of the first smartphones to ship with the latest version of Android 10, here with a level of polish only OnePlus rivals, and a bunch of Pixel-exclusive features, some of which will make it to third-party smartphones at some point.\n\nAndroid 10 introduced a system-wide dark mode, full theming support for changing colours, icon shapes, typefaces and more, and vastly improved gesture navigation, which makes using large-screen smartphones a lot easier. You’re going to get at least three years of software updates from the release of the phone, and major Android version updates before anyone else.\n\nThe big new Pixel 4 XL software advance is on-device natural language processing. Normally when you speak to your phone for Assistant, search or similar, it sends what you say across the internet to be understood on Google’s server farm.\n\nNow Google has managed to make that technology run on the phone itself, with some very impressive results. It’s considerably faster, recognising what you say instantly, doesn’t require an internet connection, and is better for privacy because your voice doesn’t leave the device.\n\nA new version of Assistant uses it to great effect. You can rattle off commands at breakneck speeds and it will understand the lot. If you want to open the camera, shoot a photo and share it to a friend you can now do it faster with your voice than you probably can with taps.\n\nThe Google Recorder app is equally impressive, transcribing voice recordings on-device in real time and tying text and audio together so you can search through them. Lastly Google’s new Live Captions can put subtitles on any video, even if it’s muted – perfect for those who can’t turn the sound up but want to know what’s happening in a video.\n\nThese thoroughly impressive software features are what Google does best.\n\nUnfortunately the new Assistant only works in US English for now. Worse, you can’t use it if you have a G Suite account (Google’s commercial services including email) logged into your phone. Google says it’s working on a fix.\n\nMotion Sense\n\nFacebook Twitter Pinterest Motion Sense uses the Soli radar technology to detect and track objects and gestures happening above and around the phone. Photograph: Samuel Gibbs/The Guardian\n\nOne of the products of Google’s advanced projects research division is Soli, which is a miniaturised radar system enabling the new Motion Sense feature. It detects when you’re within 60cm and shows the ambient display. Reaching for the phone lights up the screen fully and gets it ready to recognise your face, but it can also snooze alarms and silence calls.\n\nA swipe through the air above the phone can skip tracks in music apps or from the lockscreen, and more gestures are promised. It worked well when on a desk, but was harder to trigger when handheld.\n\nThe technology is certainly novel and works surprisingly well, but these sorts of gestures aren’t a new thing and I’m not sure Google has hit on the killer feature for Soli yet.\n\nFace Unlock\n\nFacebook Twitter Pinterest Face Unlock shows promise, but needs the support of third-party apps to come into its own. Photograph: Samuel Gibbs/The Guardian\n\nGoogle has dumped the fingerprint scanner for its new 3D face recognition technology. Face Unlock works essentially the same way as Apple’s Face ID, except faster. A little too fast in some instances, unlocking the phone when I didn’t actually intend to. A simple glance at the phone is all that’s required, although you don’t actually need to have your eyes open for it to recognise you – which might be a problem for those with prying partners. Google says it’s working on a fix (can you spot the trend here?).\n\nIt works through polarised sunglasses and not once did it fail to recognise me. By default it skips the lockscreen and opens the phone straight up to whatever you were doing, which I wish Apple’s Face ID did.\n\nBut most third-party apps don’t support Face Unlock now. That’s because to do so they have to implement a new unified biometric system which allows the phone to decide whether to use a fingerprint, a face or something else. Most don’t, which means they don’t even see the Face Unlock system.\n\nUsed to just using my fingerprint for everything, I’d forgotten what a pain entering strong pins or 55-digit passwords into apps can be. Once apps are updated, using Face Unlock with apps such as LastPass is a fantastic, seamless experience; the kind of experience you’ve had on a top iPhone for the last three years.\n\nFewer than 10 apps currently do so, though. And even leaders in fintech such as Monzo are saying it will take a while to implement, so you can forget your traditional banking apps. At least this one isn’t up to Google to fix.\n\nCamera\n\nFacebook Twitter Pinterest The Google camera app continues to be one of the best for point-and-shoot uses, now with a little more manual adjustment available. Photograph: Samuel Gibbs/The Guardian\n\nGoogle has made a name for itself with some of the best smartphone cameras on the market, and the Pixel 4 XL is no different, now with a dual-camera system on the back. It is arguably the best point-and-shoot camera available.\n\nStill photos are full of drama and with an amazing amount of detail, even in very difficult lighting conditions. New for the Pixel 4 XL is the ability to manually alter the foreground and background brightness independently. Portrait mode for people, pets or objects is also improved particularly around things such as wisps of hair.\n\nA 2x telephoto camera has significantly improved the zoom, using the firm’s Super Res Zoom technology to reach to 8x while still preserving a lot of fine detail. It compares favourably with the iPhone 11 Pro, but can’t hold a candle to the 5x optical and up to 50x digital zoom of the Huawei P30 Pro.\n\nGoogle’s Night Sight mode continues to lead the market in capability and flexibility, and can now shoot three-minute exposures of stars with astrological mode – not that I could test that given the British weather over the last two weeks.\n\nThe single selfie camera is also good, with a wider angle than most front-facing cameras. Video capture is generally solid, but caps out at 4K at 30fps and is by no means market-leading. If video is your medium of choice there are better cameras than the Pixel 4 XL. The lack of the fun ultrawide-angle camera popular with other manufacturers is also disappointing, as is Google dumping free full-resolution Photos backup, which has been a Pixel value-add for years.\n\nObservations\n\nFacebook Twitter Pinterest Pikachu and friends can invade your homescreen if you want. Photograph: Samuel Gibbs/The Guardian\n\nIf you have your phone by your bed at night the ambient screen never shuts off because you’re typically within the Motion Sense bubble all the time – there really needs to be a scheduler or for the display to turn off when you activate do-not-disturb mode.\n\nThere’s a new Pokemon live wallpaper where you can wave at or pet Pikachu and others using Motion Sense.\n\nPrice\n\nThe Google Pixel 4 XL costs £829 ($899) with 64GB or £929 ($999) with 128GB of storage.\n\nFor comparison, the smaller Google Pixel 4 costs £669 ($799), the OnePlus 7T costs £549, the OnePlus 7T Pro costs £699, the Samsung Galaxy S10+ costs £899, the Samsung Galaxy Note 10+ costs £999, the iPhone 11 costs £729 and the iPhone 11 Pro Max costs £1,149.\n\nVerdict\n\nThere will be a time when the Google Pixel 4 XL might be a great phone, but that time isn’t now.\n\nI love the design, the feel, the 90Hz screen and incredible camera. The new on-device natural language understanding is a marvel. The next-generation Google Assistant feels like we’re finally putting the kind of AI we’re used to seeing in films in our phones, not on some server somewhere providing the illusion of being in our devices. This is the smartest phone I’ve ever used and I genuinely enjoyed Google’s moments of magic.\n\nBut for every feature that’s good, there’s a problem that needs fixing. The screen’s great, but not always at 90Hz and not always bright enough, and the battery life just isn’t long enough for a top-end phone in 2019.\n\nThe fact that the new Assistant doesn’t work when you have a G Suite account on your phone – a product made and sold to companies by Google – is frankly embarrassing. As is the oversight that some may want to make sure they’re actually looking at their phone with their eyes before it unlocks – Apple knew this and has had it in Face ID for three years.\n\nThe biggest issue for me, however, is that the Android app ecosystem just isn’t ready for a phone that has dumped the fingerprint sensor. Face Unlock is genuinely great. A transformational leap just as Face ID was three years ago on the iPhone X, but only when it works. And it doesn’t work in my banking apps, my security apps or Evernote. Only one app I routinely use a fingerprint with supports Face Unlock.\n\nThat situation will change once all the apps have been updated, but I’m not holding my breath for the very slow-moving banks to support Face Unlock any time soon, and that’s a real problem.\n\nThe Pixel 4 XL is therefore a very hard phone to grade. Once Google fixes the problems and apps have been updated, the only thing really holding the phone back is below-average battery life. If that’s something you can live with, and you trust Google to fix things, then by all means buy the Pixel 4 XL.\n\nBut at £829, or really £929 if you want a reasonable 128GB of storage space, there are better, problem-free experiences to be had out there from the likes of OnePlus, and for less money too.\n\nPros: amazing on-device natural language processing, next-generation Google Assistant, brilliant camera, Face Unlock, Google Recorder app, Android 10 + fast updates, 90Hz screen. Cons: poor third-party app support for Face Unlock, Face Unlock needs eyes-open fix, Google Assistant needs G Suite fix, below-average battery life, no fingerprint scanner option.\n\nFacebook Twitter Pinterest The status bar at the top glows when Motion Sense is available in your current app, and flashes across the screen in the direction of your mid-air swipes to show it has detected something happening. Photograph: Samuel Gibbs/The Guardian\n\nOther reviews\n\nThis article contains affiliate links, which means we may earn a small commission if a reader clicks through and makes a purchase. All our journalism is independent and is in no way influenced by any advertiser or commercial initiative. By clicking on an affiliate link, you accept that third-party cookies will be set. More information.", "description": "Face Unlock, radar and on-device voice skills show Google’s magic, but some bits need fixing", "authors": ["Samuel Gibbs"], "top_image": "https://i.guim.co.uk/img/media/ce35f9eedf1f077938e26bf8a639ef8b58cf6c97/441_550_4260_2557/master/4260.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&enable=upscale&s=a9fb4d6da609902ffb0184b8e5302f6d", "published_at": "2019-10-29"}