{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7567147/Kanye-West-called-slavery-choice-took-Sunday-Service-Howard-University.html", "downloaded_at": "2019-10-13 03:52:39.373734+00:00", "title": "Kanye West - who once called 'slavery a choice' - took his Sunday Service to Howard University", "language": "en", "text": "Rapper Kanye West surprised students at the historically black Howard University with a pop-up Sunday Service - but received mixed reviews.\n\nWest arrived on the last day of their Homecoming week after whispers of his appearance began to swirl on social media Friday.\n\nAt 8am, West and his crew made a temporary home of Howard University's lawn and began to blast his version of music infused, non-traditional gospel.\n\nScroll down for video\n\nRapper Kanye West surprised fans when he held a Sunday Service at Howard University during their Homecoming celebration on Saturday\n\nWest (pictured) began his Sunday Service at 8am and was quickly surrounded by young people eager to hear his service\n\nHundreds of young people swarmed the rapper, swaying to the beat and hanging onto West's every word.\n\nWhile there, Kanye intermingled his Sunday Service with remarks on the disproportionate number of black people in the prison system.\n\n'One in three African Americans are in prison in America and we be concerned about a ball game, about a rap album,' he said, according to Fox 5.\n\n'The message on the radio station is about how you need to cheat on your man, cheat on your boyfriend, cheat on your girlfriend. All this controlled music, people aren't even writing their own rhymes, it's all a setup.'\n\nWest was not formally scheduled to perform during Homecoming, but rumors of his appearance began Friday night\n\nWest also said Christian's are being too stringent with religion.\n\nThe Washington Post reports he said: 'If you believe Jesus died for your sins — that's the gospel! Christians, we're making it too hard for people.'\n\nTo some listeners, his call for diversity struck a chord.\n\nDuring his Sunday Service, West (pictured) spoke about prison reform and his views on Christianity\n\nAmanda Brundidge, 29, told the publication: 'He's expanding people's minds, that religion can come in all colors. You come as you are. You don't have to be perfect and it's beautiful.'\n\n'People were cautious, but he's just trying to redeem himself with the culture,' 33-year-old Raymond Metzger said.\n\nTeaira Brewer, Metzger's girlfriend said this performance was West's way of coming back to black culture after a tumultuous few years.\n\n'This is a healing. He's trying to let people know he's still here,' she said.\n\n'He's like: \"Okay, I hear you.\" He's going through something. But he's trying to say: 'I haven't forsaken you.'\n\nWriter Frederick Joseph posted on Twitter that 'Black people need to stop making space for his anti-Blackness'\n\nOther people have not been so quick to forget his comments saying slavery was a choice and his 'anti-blackness' that became a subject of contention after West's vocal support of President Donald Trump.\n\nWriter Frederick Joseph said in a tweet: 'Can't blame Kanye anymore, he's shown us who he is. Black people need to stop making space for his anti-Blackness.'\n\nHe also said: Y'all will defend and support Kanye, who actively uses is platform to spread misinformation and regress the Black community, while letting queer Black people fight and die alone for our community.'\n\nHoward University professor Keneshia Grant expressed her uncertainty about West's Sunday Service\n\nHoward University Professor Keneshia Grant said: 'This Kanye church thing makes me uncomfortable. There, I said it.'\n\nGrant's tweet is one of a collective sentiment that has openly criticized West's Sunday Service and his apparent shift toward Christianity.\n\nPeople have accused West, who once went by 'Yeezus', of being insincere in his approach to Christianity.\n\nWest's (pictured) new gospel album 'Jesus is King' is reportedly dropping October 25\n\nColumnist Tobi Oredein of Premier Christianity said in a recent article: 'My major issue with Kanye's Sunday Services is that they appear to be exclusive clubs for the rich and famous.'\n\n'As I watched these Sunday Services, I also wondered who was being glorified,' she said.\n\n'He's employing a choir of people who are not only singing his songs, but are all dressed in his apparel. Is Christ really at the center of this gathering? I'm not sure he is.'\n\nRegardless, West is doing what he does best by continuing to be unapologetic.\n\nWest is still scheduled to release his upcoming gospel album, 'Jesus is King' and he told concertgoers it will reportedly drop October 25.", "description": "Kanye West held a Sunday Service performance at the historically black Howard University on Saturday - one year after making a controversial comment that slavery was a choice", "authors": ["Lauren Edmonds For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/03/19643740-0-image-a-53_1570934329984.jpg", "published_at": "2019-10-13"}