{"pub": "usatoday", "url": "https://usatoday.com/story/sports/ncaaf/sec/2019/10/19/derek-mason-interview-vandebilt-upset-missouri/4042123002", "downloaded_at": "2019-10-20 03:35:45.668413+00:00", "title": "Vanderbilt coach Derek Mason gives fiery interview after Commodores' upset of Missouri", "language": "en", "text": "CLOSE SportsPulse: USA TODAY Sports' Paul Myerberg provides his opinion of the top three programs in the history of college football. USA TODAY\n\nVanderbilt coach Derek Mason must have heard the talk about his job status.\n\nHow do we know? Just listen to his postgame interview with SEC Network on-field reporter Dawn Davenport after Vanderbilt upset Missouri 21-14 on Saturday at home.\n\n\"Well, first of all, honor to God. You know, it's been a rough patch. But I told my team this, and I want everyone to understand this: a lot of people want this job, so they think, but I am the man who is built for this job. Every day, man, we grind. We grind! Don't question us. Don't question who we are, what we do or how we play. We're Vanderbilt men. COMMODORES, EVERY DAY!\"\n\nDerek Mason is FIRED UP 🔥 pic.twitter.com/lN2KHFvF58 — SEC Network (@SECNetwork) October 19, 2019\n\nTime will tell if Mason's energetic response becomes a part of Vanderbilt football lore. Maybe it's a blip in a season to forget. Maybe Vandy pushes for a bowl berth, given that only one ranked team (Florida) remains in its final five games.\n\nMore: Winners and losers from Week 8 in college football led by Wisconsin, Oregon\n\nMore: Oregon stays in the College Football Playoff mix after road defeat of Washington\n\nBut Mason wants everyone to know that he is committed to Vanderbilt, and he's rarely been shy to show his passion for the Commodores.", "description": "Vanderbilt coach Derek Mason was fired up and gave an instantly-legendary interview after the Commodores upset the Missouri Tigers.", "authors": ["Nick Gray", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/20/USAT/4031f50d-06e7-475c-a9cb-8014ac220f3c-USATSI_13540909.jpg?crop=4038,2271,x0,y179&width=3200&height=1680&fit=bounds", "published_at": "2019-10-19"}