{"pub": "independent", "url": "https://independent.co.uk/independentpremium/trump-twitter-ban-rules-kamala-harris-2020-election-results-shares-a9158386.html", "downloaded_at": "2019-10-16 23:13:18.634475+00:00", "title": "Why won’t Twitter ban Donald Trump? Because he’s its greatest asset", "language": "en", "text": "You’re on watch world leaders. Tweet out something that violates Twitter’s terms and conditions and you’re going to be put on the naughty step. Or rather, your tweet will be put on the naughty step. #playnicenow\n\nIf it violates Twitter’s rules but there is a “clear public interest value to keeping the Tweet on the service” it will be placed behind a notice that “provides context about the violation” but allows people to click through and see it all the same.\n\nThey just won’t be able to like, or retweet it.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nOf course, any accounts that promote terrorism, incite violence against individuals, post someone’s intimate photos or personal details, encourage self-harm or child sexual exploitation, will be subject to disciplinary action. Even if they’re the property of the leader of the free world or his rivals.\n\nOtherwise, well: “When it comes to the actions of world leaders on Twitter, we recognise that this is largely new ground and unprecedented. We understand the desire for our decisions to be ‘yes/no’ binaries, but it’s not that simple. The actions we take and policies we develop will set precedent around online speech and we owe it to the people we serve to be deliberate and considered in what we do.” #yeahyeahyeah\n\nUnless you’ve been hiding under a rock for the past three years or so you’ll be aware of the driving force behind Twitter’s blog post setting this out.\n\nIt’s the continuing controversy over some of the more incendiary outpourings of the Tweeter in chief, Donald Trump.\n\nEarlier this month, Kamala Harris, the Democratic presidential candidate, waded into the debate with a call on the company to suspend his account.\n\nIt followed his tweeting: “....If the Democrats are successful in removing the President from office (which they will never be), it will cause a Civil War like fracture in this Nation from which our Country will never heal.” Pastor Robert Jeffress, @FoxNews”.\n\nHarris declared: “When this kind of abuse is being spewed from the most powerful office in the United States, the stakes are too high to do nothing.”\n\nBut this was hardly the first such bellicose outpouring from the president. Nor will it be the last, especially with what looks set to be the nastiest presidential election since, well, the last one looming.\n\n“Our goal is to enforce our rules judiciously and impartially. In doing so, we aim to provide direct insight into our enforcement decision-making, to serve public conversation, and protect the public’s right to hear from their leaders and to hold them to account,” said Twitter in its response.\n\nI’ll give you 1000-1 against on Twitter using those rules, any rules, to rein or hold Trump to any sort of account. It’s simply not in its interests to do so.\n\nTrump’s Twitter feed is a nuclear-powered controversy generation machine with global reach. Not a week goes by without something he tweets sparking a firestorm. And those firestorms generate clicks, and those clicks generate profit.\n\n“We recognise that we’re operating in an increasingly complex and polarised political culture,” says Twitter.\n\nThat paragraph is astonishing for either its lack of self-awareness or for its deep cynicism.\n\nTwitter, and its social media peers, have played a major role in the creation of that climate, which explains why they’re coming under pressure from more thoughtful politicians who are increasingly alarmed at the results.\n\nShape Created with Sketch. Business news: In pictures Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Business news: In pictures 1/11 Corbyn wishes Amazon a happy birthday In a card sent to Amazon CEO Jeff Bezos on the company's 25th birthday, Labour leader Jeremy Corbyn writes: \"You owe the British people millions in taxes that pay for the public services that we all rely on. Please pay your fair share\" 2/11 No deal, no tariffs The government has announced that it would slash almost all tariffs in the event of a no-deal Brexit. Notable exceptions include cars and meat, which will see tariffs in place to protect British farmers Getty 3/11 Fingerprint payment NatWest is trialling a new bank card that will allow people to touch their hand to the card when paying rather than typing in a PIN number. The card will work by recognising the user's fingerprint NatWest/PA Wire 4/11 Mahabis bust High-end slipper retailer Mahabis has gone into administration. 2 Jan 2019 Mahabis 5/11 Costa Cola Coca-Cola has paid £3.9bn for Costa Coffee. A cafe chain is a new venture for the global soft drinks giant PA 6/11 RIP Payday Loans A funeral procession for payday loans was held in London on September 2. The future of pay day lenders is in doubt after Wonga, Britain's biggest, went into administration on August 30 PA 7/11 Musk irks investors and directors Elon Musk has concluded that Tesla will remain public. Investors and company directors were angry at Musk for tweeting unexpectedly that he was considering taking Tesla private and share prices had taken a tumble in the following weeks Getty 8/11 Jaguar warning Iconic British car maker Jaguar Land Rover warned on July 5, 2018 that a \"bad\" Brexit deal could jeopardise planned investment of more than $100 billion, upping corporate pressure as the government heads into crucial talks AFP/Getty 9/11 Spotif-IPO Spotify traded publically for the first time on the New York Stock Exchange on Tuesday. However, the company isn't issuing shares, but rather, shares held by Spotify's private investors will be sold AFP/Getty 10/11 French blue passports The deadline to award a contract to make blue British passports after Brexit has been extended by two weeks following a request by bidder De La Rue. The move comes after anger at the announcement British passports would be produced by Franco-Dutch firm Gemalto when De La Rue’s contract ends in July. The British firm said Gemalto was chosen only because it undercut the competition, but the UK company also admitted that it was not the cheapest choice in the tendering process. 11/11 Beast from the east economic impact The Beast from the East wiped £4m off of Flybe’s revenues due to flight cancellations, airport closures and delays, according to the budget airline’s estimates. Flybe said it cancelled 994 flights in the three months to 31 March, compared to 372 in the same period last year. 1/11 Corbyn wishes Amazon a happy birthday In a card sent to Amazon CEO Jeff Bezos on the company's 25th birthday, Labour leader Jeremy Corbyn writes: \"You owe the British people millions in taxes that pay for the public services that we all rely on. Please pay your fair share\" 2/11 No deal, no tariffs The government has announced that it would slash almost all tariffs in the event of a no-deal Brexit. Notable exceptions include cars and meat, which will see tariffs in place to protect British farmers Getty 3/11 Fingerprint payment NatWest is trialling a new bank card that will allow people to touch their hand to the card when paying rather than typing in a PIN number. The card will work by recognising the user's fingerprint NatWest/PA Wire 4/11 Mahabis bust High-end slipper retailer Mahabis has gone into administration. 2 Jan 2019 Mahabis 5/11 Costa Cola Coca-Cola has paid £3.9bn for Costa Coffee. A cafe chain is a new venture for the global soft drinks giant PA 6/11 RIP Payday Loans A funeral procession for payday loans was held in London on September 2. The future of pay day lenders is in doubt after Wonga, Britain's biggest, went into administration on August 30 PA 7/11 Musk irks investors and directors Elon Musk has concluded that Tesla will remain public. Investors and company directors were angry at Musk for tweeting unexpectedly that he was considering taking Tesla private and share prices had taken a tumble in the following weeks Getty 8/11 Jaguar warning Iconic British car maker Jaguar Land Rover warned on July 5, 2018 that a \"bad\" Brexit deal could jeopardise planned investment of more than $100 billion, upping corporate pressure as the government heads into crucial talks AFP/Getty 9/11 Spotif-IPO Spotify traded publically for the first time on the New York Stock Exchange on Tuesday. However, the company isn't issuing shares, but rather, shares held by Spotify's private investors will be sold AFP/Getty 10/11 French blue passports The deadline to award a contract to make blue British passports after Brexit has been extended by two weeks following a request by bidder De La Rue. The move comes after anger at the announcement British passports would be produced by Franco-Dutch firm Gemalto when De La Rue’s contract ends in July. The British firm said Gemalto was chosen only because it undercut the competition, but the UK company also admitted that it was not the cheapest choice in the tendering process. 11/11 Beast from the east economic impact The Beast from the East wiped £4m off of Flybe’s revenues due to flight cancellations, airport closures and delays, according to the budget airline’s estimates. Flybe said it cancelled 994 flights in the three months to 31 March, compared to 372 in the same period last year.\n\nThey profit from it. Twitter’s shares have come off a bit of late but they’re still trading at around $40 (£31) having staged quite the rally since they were languishing at around $14 early in 2017.\n\nThe second-quarter results smashed through Wall Street’s estimates and, while there have been worries expressed about how its slimmed-down ad strategy might impact on the near term, the concerns about the viability of the business that were once commonplace have died down.\n\nTrump has helped no end. He is in many ways the business’s greatest asset. I’d be amazed if any of his tweets ended up on the naughty step. There’s no way Twitter’s going to cramp his style.", "description": "You’re on watch world leaders. Tweet out something that violates Twitter’s terms and conditions and you’re going to be put on the naughty step. Or rather, your tweet will be put on the naughty step. #playnicenow If it violates Twitter’s rules but there is a “clear public interest value to keeping the Tweet on the service” it will be placed behind a notice that “provides", "authors": ["James Moore"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/16/13/Tongass.jpg", "published_at": "2019-10-16"}