{"pub": "investing.com", "url": "https://newsbtc.com/2019/10/10/why-bitcoin-price-should-retake-8600-to-maintain-bull-trend", "downloaded_at": "2019-10-10 15:50:54.189977+00:00", "title": "Why Bitcoin Price Should Retake $8,600 to Maintain Bull Trend", "language": "en", "text": "After a precipitous Bitcoin (BTC) price drop to $7,800 — a level which analysts have said will make or break the cryptocurrency bull run — on the weekend, investors were running scared.\n\nBut at the 11th hour, when all seemed lost, bulls stepped in. Since Monday, the leading cryptocurrency has recovered by some 10% to $8,600. Analysts say that it is imperative that Bitcoin claims $8,600, or else the bear trend threatens to continue.\n\nBTC Needs to Hold $8,600\n\nWhile Bitcoin has enjoyed some positive price action over the past 72 hours, the party has stopped — or at least paused temporarily — at $8,600. There, the cryptocurrency has found itself stuck, failing to break above that level.\n\nThis is for good reason. An analyst, whose analysis can be seen below, recently noted that at $8,600 exists a confluence of key technical trendlines that are preventing Bitcoin from heading higher. These include the 21-day exponential moving average, a level used to differentiate short-term trends; the 200-day exponential and simple moving averages, believed to be many to be indicative if an asset is in a long-term bull or bear trend; and the yearly VWAP.\n\n$btc $btcusd Hey guys, just so you know, we are at resistance, and it's HEAAAAAAVY resistance right here right now 8600 is confluence of:\n\n-21 daily EMA\n\n-200 daily EMA\n\n-200 daily SMA\n\n-yearly VWAP If it can go above,imo it's bullish ASF, but for now, it's HARD as rock resistance pic.twitter.com/Vu7KzfzLCV — Coiner-Yadox (@Yodaskk) October 9, 2019\n\nThey claim that if Bitcoin manages to decisively retake $8,600 on a daily time frame, which would mean a negation of any bearish implications caused by remaining under the aforementioned levels, it will be extremely bullish for the cryptocurrency’s price outlook.\n\nThe abovementioned analyst isn’t the only one accentuating the importance of $8,600. As reported by NewsBTC previously, trader Walter Wyckoff suggested that a rejection of $8,600 will lead to “ramen for a while”, or a long price lull, to cut the colloquialisms.\n\nWhy Bitcoin Recovered\n\nWith Bitcoin starting to look bullish, you may be wondering — what is behind the recent move higher?\n\nInterestingly, there isn’t a single catalyst that analysts and investors have cited. Rather, there are three:\n\nAnnouncements at Ethereum-centric Devcon: In a comment to Bloomberg, Galaxy Digital’s Josh Lim said that updates regarding Ethereum’s Serenity iteration — a new version of Ethereum slated to promote massive adoption due to scaling solutions — and the unveiling of new apps on the blockchain has likely provided bulls with reasons to buy. Bitcoin ETF hype: Joe DiPasquale, CEO of the cryptocurrency hedge-fund firm BitBull Capital, argued to CoinDesk that the hopeful comments from Bitwise Asset Management regarding its Bitcoin ETF application have bulls enthused. Bitwise’s head of research, Matt Hougan, said earlier this week that his firm is “closer than ever” in ensuring that a Bitcoin ETF gets through the U.S. SEC’s gauntlet. (Importantly, the application has since been denied by the SEC. BTC was unaffected.) Federal Reserve’s resumption of balance sheet expansion: DiPasquale also looked to Federal Reserve chairman Jerome Powell’s announcement that the Fed would be resuming the growth of its balance sheet. While Powell noted that this isn’t quantitative easing — a monetary policy that some have said is a key reason why Bitcoin matters — many in the Bitcoin community have said that this latest decision only accentuates the cryptocurrency’s disinflationary, non-sovereign, and decentralized nature.\n\nFeatured Image from Shutterstock", "description": "After a precipitous Bitcoin (BTC) price drop to $7,800 — a level which analysts have said will make or break the cryptocurrency bull run — on the weekend,", "authors": [], "top_image": "https://www.newsbtc.com/wp-content/uploads/2019/02/shutterstock_351548024-700x400.jpg", "published_at": "2019-10-10"}