{"pub": "fox", "url": "https://foxbusiness.com/politics/see-you-at-the-polls-trump-and-pelosi-have-it-out", "downloaded_at": "2019-10-17 09:16:15.461420+00:00", "title": "'See you at the polls': Trump and Pelosi have it out", "language": "en", "text": "A White House meeting with congressional leaders called to discuss the situation in Syria, turned into an explosive confrontation.\n\nContinue Reading Below\n\nPresident Trump called House Speaker Nancy Pelosi a \"third-grade\" politician. She said he's having a meltdown.\n\nAnd with that Trump and Pelosi chalked up the latest meeting that ended abruptly with a walkout at the White House.\n\nIt's a familiar ritual, with Trump and congressional leaders meeting on official business, only to see the session devolve into colorful, name-calling commentary that's a new kind of addition to the history books.\n\nThe House had just voted, 354-60, to overwhelmingly oppose the president's announced U.S. troop withdrawal, a rare bipartisan rebuke. Trump's action has opened the door for a Turkish military attack on Syrian Kurds who have been aligned with the U.S. in fighting the country's long-running war.\n\nPelosi mentioned the House vote and Sen. Chuck Schumer, the Democratic leader, started to read the president a quote from former Defense Secretary James Mattis on the need to keep U.S. troops in Syria to prevent a resurgent of Islamic State fighters.\n\nBut Trump cut Schumer off, complaining that Mattis was \"the world's most overrated general. You know why? He wasn't tough enough.\" Trump went on, \"I captured ISIS.\"\n\nPelosi explained to Trump that Russia has always wanted a \"foothold in the Middle East,\" and now it has one with the U.S. withdrawal, according to a senior Democratic aide who was also granted anonymity.\n\n\"All roads with you lead to Putin,\" the speaker said.\n\nThen it began.\n\nTrump said to Pelosi, \"I hate ISIS more than you do.\"\n\nPelosi responded, \"You don't know that.\"\n\nSchumer intervened at one point and said, \"Is your plan to rely on the Syrians and the Turks?\"\n\nTrump replied, \"Our plan is to keep the American people safe.\"\n\nPelosi said: \"That's not a plan. That's a goal.\"\n\nTrump turned to Pelosi and complained about former President Barack Obama's \"red line\" over Syria. According to Schumer, he then called her \"a third-rate politician.\"\n\nAt that point, the genteel Rep. Steny Hoyer of Maryland, the House Majority Leader, interjected, \"This is not useful.\"\n\nPelosi and Hoyer stood and left the meeting. As they did, Trump said, \"Goodbye, we'll see you at the polls.\"\n\nFrom the White House driveway, Pelosi told reporters Trump was having some kind of \"meltdown\" inside. She said they had to leave because Trump was unable to grasp the reality of the situation.\n\nTrump insisted later on Twitter that it was Pelosi who had a \"total meltdown,\" calling her \"a very sick person!\"\n\nHe also tweeted pictures from the room.\n\n\"Nervous Nancy's unhinged meltdown!\" he tweeted with another.\n\nIn that photo, Pelosi can be seen, surrounded by congressional leaders and military brass around a table at the White House, finger outpointed. She is standing up, literally, to Trump.\n\nPelosi turned the photo into the banner on her Twitter page.\n\nThe Associated Press contributed to this article.", "description": "Both Trump and Pelosi accused each other of having a meltdown.", "authors": ["Ken Martin"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/PelosiFinger-.jpg?ve=1&tl=1", "published_at": "2019-10-17"}