{"pub": "yahoo", "url": "https://sports.yahoo.com/mlb-team-roundup-san-francisco-224135847.html", "downloaded_at": "2019-10-16 23:18:52.457601+00:00", "title": "MLB Team Roundup: San Francisco Giants", "language": "en", "text": "Follow @Rotoworld_BB and @drewsilv on Twitter.\n\n2019 Record: 77-85\n\nThird Place, NL West\n\nTeam ERA: 4.38 (15th in MLB)\n\nTeam OPS: .694 (28th in MLB)\n\nScroll to continue with content Ad\n\nWhat Went Right\n\n2019 was set up as a rebuilding year for the Giants. They hired front office executive Farhan Zaidi away from the rival Dodgers last winter to spearhead a new youth movement and seemed poised to deal away a number of legacy players for prospects by the middle of the summer. But the team found some success in June and then roared to a 19-6 record in July to suddenly and surprisingly move into National League Wild Card contention ahead of the July 31 trade deadline. Madison Bumgarner was kept around all season and posted a solid 3.90 ERA, 1.13 WHIP, and 203/43 K/BB ratio over 34 starts covering 207 2/3 innings. Jeff Samardzija stuck around as well and registered his lowest ERA (3.52) since 2014 while logging 32 starts and 181 1/3 innings. Will Smith, another prime trade candidate, put up a 2.76 ERA and 96 strikeouts in 65 1/3 innings of relief and finished top-five among all MLB closers in saves with 34. Mike Yastrzemski debuted at age 28 in late May and excelled to the tune of an .852 OPS with 21 home runs over his first 107 big league games. He even went deep September 17 at Fenway Park, where his grandfather Carl built a Hall of Fame career in the ‘60s, ‘70s, and ‘80s. Kevin Pillar proved to be a strong early-season pickup from the Blue Jays, as he launched a personal-best 21 home runs and played high-level defense within the spacious and tricky outfield dimensions at Oracle Park. Alex Dickerson slashed .290/.351/.529 in 171 plate appearances after being acquired from the Padres in June.\n\nWhat Went Wrong\n\nStory continues\n\nIt was admirable that the Giants flirted with contention in the final year under future Hall of Fame manager Bruce Bochy, who announced that he would be retiring back in February. But that run of success in June and July created a false sense of hope at an unfortunate time on the baseball calendar, as Zaidi and Co. probably could have fetched legitimate young talent for Bumgarner and Smith at the July 31 trade deadline. They are both scheduled to become free agents this winter. Zaidi did trade away Mark Melancon, Sam Dyson, Drew Pomeranz, and Ray Black, but Bumgarner and Smith were the big chips that likely would have brought back big returns. Tony Watson probably belongs in that category too. He had a 2.79 ERA on the morning of July 31 but went on to surrender 12 earned runs over his final 12 innings of work, finishing with an ERA of 4.17. Scooter Gennett was acquired from the Reds in a deadline trade but got released on August 27 after batting just .234 with a .254 on-base percentage and 21 strikeouts in 67 plate appearances. Joe Panik was also cut loose in August after a nearly-six-year run as the Giants’ primary second baseman. He went on to bat .277 with a .738 OPS in 39 games with the Mets, after hitting .235 with a .627 OPS through his first 103 games this season with the Giants. Dereck Rodriguez had a 2.81 ERA in 118 1/3 innings as a rookie in 2018 before stumbling to a 5.64 ERA over 99 innings (16 starts, 12 relief appearances) in 2019. The lack of offense this summer in San Francisco deserves its own section.\n\nFantasy Slants\n\n** Buster Posey was the third catcher off the board in the average Yahoo draft this spring, ahead of the likes of Willson Contreras and Yasmani Grandal. It didn’t make sense at the time, and Posey’s ADP looks even sillier now after he batted just .257/.320/.368 with seven home runs and 38 RBI across 114 games in 2019. The 32-year-old has totaled 12 home runs over his last 893 plate appearances since the beginning of the 2018 season. He probably shouldn’t be a top-10 consideration at the catcher position next year, let alone top five.\n\n** Evan Longoria rebounded to some degree in his second year with the Giants, slugging 20 home runs alongside a .762 OPS -- up from 16 home runs and a .694 OPS in 2018 -- but even those improved numbers don’t exactly stand out in this power-heavy era of baseball and the 34-year-old third baseman will likely go undrafted in most formats next spring. Brandon Belt (17 home runs, .742 OPS) and Brandon Crawford (11 home runs, .654 OPS) are in a similar boat -- as in, not particularly fantasy relevant leading into 2020.\n\n** Kevin Pillar may carry some late-round interest with his double-digit home run and double-digit stolen base potential, though there is some speculation that he could be non-tendered this winter. On the speed front, new second baseman Mauricio Dubon might be worth a look. Acquired from the Brewers in the Pomeranz trade, Dubon stole three bases in 28 games down the stretch with the Giants and had three different 30-plus stolen base seasons in the minor leagues.\n\n** Madison Bumgarner is likely to depart via free agency and Jeff Samardzija doesn’t generate enough strikeouts at age 34, going on 35, so the most intriguing fantasy starter on this roster is probably Johnny Cueto. The veteran right-hander returned from Tommy John surgery in the final month of the 2019 regular season and threw 10 scoreless innings across his first two starts before yielding nine earned runs over his final two outings covering just five frames. He’s worth monitoring next spring.\n\n** The back end of the Giants’ bullpen figures to look very different in 2020, as Will Smith and Tony Watson are both free agents and will probably be priced out of range for a restructuring club like this one. Reyes Moronta is the best bet to take over at closer, if he’s not dealt away in an offseason trade. The hard-throwing 26-year-old right-hander boasts a 2.66 ERA with 160 strikeouts in 128 1/3 career innings at the major league level, though control remains an issue.\n\nKey Free Agents: Madison Bumgarner, Will Smith, Tony Watson, Pablo Sandoval, Stephen Vogt\n\nTeam Needs: Everything? For a team that was in contention for at least a portion of the 2019 season and finished third in the National League West, there are glaring holes up and down this roster. The good news is the Giants have a number of decent prospects in the system already and Zaidi would seem capable of finding more. Also, the ownership group in San Francisco has never shied away from aggressive spending.\n\n", "description": "In the latest MLB Team Roundup, Drew Silva breaks down a Giants team in transition. (Getty Images)", "authors": ["Drew Silva"], "top_image": "https://s.yimg.com/ny/api/res/1.2/bQequAYP3p0AX2IYfmv9gw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/w3cX4fTce6lyX7u5rzvstw--~B/aD0xMTMyO3c9MjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rotoworld.com/bd60ef113b5d251832fce0d6ecadadc2", "published_at": "2019-10-16"}