{"pub": "atlantic", "url": "https://theatlantic.com/science/archive/2019/10/the-worst-day-in-earths-history-contains-a-warning-for-us/600466", "downloaded_at": "2019-10-22 15:08:08.344986+00:00", "title": "The Worst Day in Earth’s History Contains an Ominous Warning", "language": "en", "text": "A new paper, published this week in the Proceedings of the National Academy of Sciences, offers a possible answer: The impact changed the chemical content of the ocean, rendering seawater more acidic and inhospitable to the tiny plankton that form the base of the marine food chain. Combined with the other impacts of the asteroid—darkened skies and a snap of global cooling—this ecologic disruption doomed much of life on Earth.\n\nThe finding may be satisfying for asteroid fans, but it is an ominous one. Ocean acidification, a hallmark of the planet’s previous mass extinctions, is happening again today.\n\nRead: Caring for the last member of a doomed species\n\nHow does an asteroid prompt an extinction? It chooses the right location. The Yucatán Peninsula was an excellent one, says Pincelli Hull, an author of the paper and a geology professor at Yale. The peninsula is essentially an “old buried reef,” she told me, an accumulation of dead coral and other sea life that is now more than a mile thick. When the asteroid hit, untold megatons of that old organic material—rich in nitrogen and sulfur—instantly became dust and shot up into the atmosphere.\n\nSoon it began to rain down, falling now as nitric oxide and sulfuric acid. “It was raining brimstone and acid from the sky,” Hull said. The air would have reeked of acrid smog and burnt matches. As the acid fell, it accumulated in the oceans, wearing away the shells of the small, delicate plankton that serve as the basis of the marine food chain. Within a few centuries of the impact, ocean acidity had spiked by at least 0.3 pH units.\n\nThis spike in ocean acidification may have lasted for less than 1,000 years. But even that pulse “was long enough to kill off entire ecosystems for sure,” Hull said. Ocean acidification also likely worsened other sweeping environmental changes wrought by the impact, such as the years-long darkness caused by orbiting debris and ash from the global wildfires.\n\nWith this new finding, it now appears that all three of the worst mass extinctions in Earth’s history featured huge spasms of ocean acidification. They include the K-T extinction; the End-Triassic Extinction, when volcanoes in New Jersey killed 75 percent of all species; and the dread End-Permian Event, the worst extinction in the history of the planet, which killed roughly 85 percent of all species and nearly sterilized the oceans. Scientists call that event “the Great Dying.”\n\nRead: The Anthropocene is a joke\n\nAnd that pattern is worrying, because the oceans are acidifying again today. Carbon dioxide—the same air pollutant that causes global warming—also dissolves in the oceans and increases the acidity of seawater. Since the late 1980s, the planet’s oceans have become about 0.02 pH units more acidic every decade, according to a report last month from the Intergovernmental Panel on Climate Change. More than a fifth of all modern carbon pollution has already dissolved into the oceans, the report also found.\n\nModern acidification is not yet at the same magnitude as the K-T pulse. It’s “moving toward that scale, but it’s not quite there yet,” Hull said. What unites our world and the K-T period, she said, was that a number of environmental catastrophes can overlap with ocean acidification to produce a major upheaval.", "description": "One of Earth’s most dramatic extinctions was caused in part by ocean acidification, which has become a problem in our own era.", "authors": ["Robinson Meyer"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/RTREQIM/facebook.jpg?1571752161", "published_at": "2019-10-22"}