{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/2020-democrats-differ-health-care/story?id=64636048", "downloaded_at": "2019-09-13 07:33:03.838043+00:00", "title": "Medicare for All or single payer: Here's how the 2020 Democrats differ on health care", "language": "en", "text": "Amid debate over rising medical costs, surprise hospital bills and high prescription drug prices, health care remains a top priority for voters in the 2020 presidential election.\n\nInterested in Democratic Party? Add Democratic Party as an interest to stay up to date on the latest Democratic Party news, video, and analysis from ABC News. Add Interest\n\nHere are the candidates who have put out proposals so far and what we know about those who have yet to do so. The list doesn't include every Democratic candidate, but highlights candidates who have significant positions or experience that sets them apart.\n\nWhere Democrats stand on a single-payer system that eliminates private insurance\n\nThe debate on Medicare for All, which would overhaul the nation's current health care system, has begun to sow division in the 2020 field.\n\nAccording to Politifact, eliminating the private insurance market would \"shake up nearly a fifth of the nation's economy.\"\n\nSome candidates are rallying behind the concept, others are against it and some have suggested forming a hybrid system that would call for universal health care while at the same time allowing people to chose private insurance if they want it.\n\nFormer Vice President Joe Biden released a plan in July that his campaign said would make the Affordable Care Act easier to navigate with more choices for Americans.\n\nJohn Locher/AP Photo\n\nThe plan would expand upon the Affordable Care Act passed under the Obama-Biden administration and provide a public, government-run insurance option for consumers to purchase on the existing exchanges with the goal on keeping costs down and expanding access for patients to buy into. This proposal differs from a Medicare for All system that several of Biden's 2020 rivals advocate for -- a contrast the former vice president has already started to draw on the campaign trail.\n\n\"We should not be starting from scratch. We should be building from what we have. There is no time to wait. And I that's why I think, what I'm proposing -- and we can do it -- is to keep Obamacare, restore the cuts that have been made, and add a public option,\" Biden said during an event in Dover, New Hampshire, in July. \"If they like their employer-based insurance, you get to keep it. The fact of the matter is, all the other proposals make you -- you lose it. Period.\"\n\nThe Biden campaign estimates that the plan will cost $750 billion over 10 years. Senior advisers said Biden would rescind President Donald Trump's tax cuts for the wealthy, raise the maximum tax bracket to 39% and get rid of the capital gains tax loophole for wealthy families with incomes greater than $1 million a year in order to cover the hefty price tag.\n\nDr. Phil Verhoef, a board member of Physicians for a National Health Program, told ABC News that he does not believe that building on the Affordable Care Act is the solution to solving a troubled health care system.\n\n\"Bidens' proposal is effectively let's fix the way the ACA was weakened under the Trump administration and then let's add a public option on top of that for people to be able to buy in Medicare,\" Verhoef said. \"The reason that I think this is problematic is it preserves how complex our health care system is right now.\"\n\nShortly after his announcement, Sen. Bernie Sanders, I-Vt., countered Biden via Twitter.\n\nI fought to improve and pass Obamacare.\n\n\n\nI traveled all over the country to fight the repeal of Obamacare.\n\n\n\nBut I will not be deterred from ending the corporate greed that creates dysfunction in our health care system. We must pass Medicare for All. — Bernie Sanders (@BernieSanders) July 15, 2019\n\n\"I fought to improve and pass Obamacare. I traveled all over the country to fight the repeal of Obamacare,\" Sanders wrote. \"But I will not be deterred from ending the corporate greed that creates dysfunction in our health care system. We must pass Medicare for All.\"\n\nFrederic J. Brown/AFP/Getty Images\n\nIn April, Sanders again introduced his signature health care legislation, which if passed and signed into law, would provide government-run, Medicare-style health insurance for all Americans and outlaw most duplicative private insurance in the process.\n\n\"The Medicare for All Act will provide comprehensive health care to every man, woman and child in our country without out of pocket expenses. No more insurance premiums, deductibles or co-payments. Further, this bill improves Medicare coverage to include dental, hearing and vision care,\" Sanders' team wrote in a summary of the bill distributed ahead of a press conference on Capitol Hill.\n\nSanders has introduced the bill several times in the last decade, but the latest version is more sweeping. It now calls for expanded coverage to include and pay for long-term care, as well as no co-pays for doctors visits.\n\nOne study last year from the Mercatus Center at George Mason University estimated that Sanders' legislation could cost the federal government more than $32 trillion dollars over 10 years.\n\nHis plan offers few concrete deals on how to pay for the expanded federal system, but in the past the senator has backed significantly higher income taxes for wealthy Americans and businesses in the country.\n\nFellow 2020 Democratic presidential candidates Sens. Cory Booker, Elizabeth Warren, Kamala Harris and Kirsten Gillibrand signed on as cosponsors for Sanders' Medicare for All bill in the Senate. Gillibrand dropped out of the presidential race on Aug. 28.\n\nRebecca Cook/Reuters\n\nWhile Harris is a supporter of Sanders' legislation, his campaign says the plan that she released in July stops short of what the Vermont senator envisions for Americans.\n\nThe key distinction between the two senators' plans is that Harris still sees the private system playing a role. Her plan is more of a hybrid health insurance system that allows private companies to be able to offer health insurance plans within the Medicare system for consumers.\n\nHarris' plan also calls for a 10-year transition to a single-payer system while Sanders plan calls for four years.\n\nHarris also pointed out that she views Sanders plan as too tough on the middle-class. She said that she doesn't like Sanders' options to tax households making above $29,000 an additional 4% income-based premium. Instead, she is proposing to exempt households making below $100,000, along with a higher income threshold for middle-class families living in high-cost areas.\n\nSanders' campaign manager Faiz Shakir criticized Harris' plan saying it centers on Medicare privatization, insurance executives and introducing more corporate greed and profiteering into the Medicare system.\"Call it anything you want, but you can't call this plan Medicare for All.\"\n\nBiden's campaign also criticized the plan.\n\n\"This new, have-it-every-which-way approach pushes the extremely challenging implementation of the Medicare for All part of this plan ten years into the future, meaning it would not occur on the watch of even a two-term administration,\" Kate Bedingfield, a Biden deputy campaign manager, said in a statement. \"The result? A Bernie Sanders-lite Medicare for All and a refusal to be straight with the American middle class, who would have a large tax increase forced on them with this plan.\"\n\nVerhoef said the plan Harris proposed is flawed for a few reasons, most notably is that it still has a role for private insurance companies and is effectively creating Medicare-Advantage plans for everybody.\n\n\"She's basically saying let's keep private insurers in here and lets heavily regulate what they provide and give people the option of purchasing these heavily regulated Medicare-Advantage plans,\" Verhoef said. \"The idea that we are really going to regulate insurance companies this much I think is a little bit pie in the sky itself.\"\n\nHowever, Maura Calsyn, managing director of health policy at the Center for American Progress, told ABC News that while there might be political backlash to Harris' proposal that medical experts like herself view her proposal as a serious one that deserves consideration.\n\n\"The vast majority of Americans have private insurance and I think it's very easy in the abstract to say that everybody should just not worry about transitioning from those plans and that everything will be just fine,\" Calsyn said. \"I do think that a plan like Kamala Harris', giving people a choice, is really an important feature and I don't think its importance can be overstated.\"\n\nDuring the first presidential debate, Sen. Amy Klobuchar, D-Minn., vocalized her support for a hybrid plan which allows uninsured Americans to sign up for a public plan. The public option plans would essentially allow individuals to choose between public insurance plan, like Medicare or Medicaid, or a private insurance plan.\n\nCharlie Neibergall/AP Photo\n\n\"It's something Barack Obama wanted to do, which is a public option,\" Klobuchar said. \"I'm concerned about kicking half of America off their health insurance.\"\n\nFormer Rep. Beto O'Rourke echoed a similar sentiment saying that he would \"preserve choice\" by not eliminating private insurance.\n\nSen. Julian Castro, Andrew Yang, Michael Bennet, John Delaney and Marianne Williamson have also expressed that they would support private insurance playing some role in the health care system.\n\nAn issue that affects candidates and voters nationwide\n\nCandidates supporting a complete overhaul of the health care system might have a tough time winning over voters on this issue. According to a recent Gallup poll, most Americans are happy with their current health coverage.\n\nThe poll found that 69% of Americans rate the coverage and 80% rate the quality of the health care they personally receive as \"excellent\" or \"good.\"\n\nHowever, the same poll found that only 34% of Americans view health care coverage in the U.S. in general as positive.\n\nIn an ABC News/Washington Post poll released in April, 19% of Americans said that health care is one of the most important issues when voting for president in the 2020 election. Among leaned Democrats, health care ranked as the most important issue with voters, with 29% responding.\n\nThe poll also found that Americans, by a 17-point margin, say President Donald Trump's handling of health care makes them more likely to oppose than support him for a second term.\n\nABC News' Libby Cathey contributed to this report.", "description": "Here's how 2020 Democrats former Vice President Joe Biden, Sens. Kamala Harris, Bernie Sanders and others differ on health care.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/biden-ap-as-190729_hpMain_16x9_992.jpg", "published_at": "2019-09-12"}