{"pub": "independent", "url": "https://independent.co.uk/travel/asia/japan-tokyo-ogasawara-islands-tourism-travel-a9161316.html", "downloaded_at": "2019-10-19 11:37:45.453057+00:00", "title": "The subtropical islands that are 1,000km from Tokyo but still part of the city", "language": "en", "text": "White sands, forest-topped islands and sapphire waters. The scene screams Hawaii, yet technically I’m in Tokyo. I’m in the Ogasawara Islands, an archipelago of more than 30 islands in the Pacific Ocean which, despite being sprinkled 1,000km south of the frenetic skyscraper-filled capital, are considered a subprefecture of it.\n\nThese oceanic islands, formed by undersea volcanic eruptions some 62 million years ago, are Japan’s equivalent of the Galapagos – never connected to a continent, home to unique flora and fauna, divine beaches and world-class diving. During three weeks’ travel across Japan, not a single person I met had visited. Most hadn’t even heard of the Ogasawara Islands.\n\nDespite being made a Unesco World Heritage site in 2011 due to its distinct ecosystems, one-of-a-kind plants and uniquely evolved land snails, Ogasawara has remained off the beaten track. To get there requires a 24-hour ferry from Tokyo, which only departs once a week; only 300 overseas visitors make the trip each year.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn the age of instant travel gratification, the pull of a slow journey to a rarely visited wilderness is irresistible. So, in my final week in Japan I board the Ogasawara-Maru, a hulking liner with an 890-berth capacity, bound for Chichijima, the larger of Ogasawara’s two inhabited islands, home to 2,000 people. Puttering away from the Tokyo skyline, internet connection trails off and the rock of the open ocean ramps up.\n\nShape Created with Sketch. Japan in bloom: cherry blossoms in 2019 Show all 13 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Japan in bloom: cherry blossoms in 2019 1/13 Blossom along Tokyo's Chidorigafuchi Moat Getty 2/13 Cherry blossom-watching on the Meguro River Getty 3/13 Blossom along the Meguro River in Tokyo Getty 4/13 Riding a boat underneath cherry blossom along Tokyo's Meguro River Getty 5/13 Tokyo's Meguro River Getty 6/13 Japan cherry blossom Tokyo's Meguro River Getty 7/13 Illuminated cherry trees with the Roppongi Hills Mori Tower in the distance Getty 8/13 Illuminated cherry trees along the Meguro River Getty 9/13 Cherry blossom along the Chidorigafuchi Moat Getty 10/13 Admiring cherry blossoms during a tea ceremony in Yokohama AP 11/13 Taking a selfie underneath the cherry blossom in Yokohama AP 12/13 Japanese Emperor Akihito, left, and Empress Michiko see weeping cherry in Kyoto AP 13/13 Cherry blossom in Asakusa, Tokyo AFP/Getty 1/13 Blossom along Tokyo's Chidorigafuchi Moat Getty 2/13 Cherry blossom-watching on the Meguro River Getty 3/13 Blossom along the Meguro River in Tokyo Getty 4/13 Riding a boat underneath cherry blossom along Tokyo's Meguro River Getty 5/13 Tokyo's Meguro River Getty 6/13 Japan cherry blossom Tokyo's Meguro River Getty 7/13 Illuminated cherry trees with the Roppongi Hills Mori Tower in the distance Getty 8/13 Illuminated cherry trees along the Meguro River Getty 9/13 Cherry blossom along the Chidorigafuchi Moat Getty 10/13 Admiring cherry blossoms during a tea ceremony in Yokohama AP 11/13 Taking a selfie underneath the cherry blossom in Yokohama AP 12/13 Japanese Emperor Akihito, left, and Empress Michiko see weeping cherry in Kyoto AP 13/13 Cherry blossom in Asakusa, Tokyo AFP/Getty\n\nAccommodation ranges from a roll-mat space on a communal cabin floor to fancier private suites, but I opt for a mid-range room with two skinny single beds. On the top deck are Japanese retirees rocking waistcoats and sun visors in an oddly chic ballroom-on-hols look, while on the promenade levels are birdwatchers who pap brown boobies torpedoing into the water with military precision. A fellow lone traveller, Japanese teacher Noriko Eguchi, is here for “what’s under the water”. She’s a scuba nut, tempted by tales of sea turtles and wild dolphins. Also, between January and April, humpbacks pass by, while from June to November sperm whales arrive.\n\nTwenty-four hours later, forested peaks with licks of blinding-white beaches come into view, and we drop anchor in Futami Bay. Chichijima’s main town constitutes two sleepy streets – a strip of brightly painted guesthouses and a handful of places to eat. Showing me around is translator Ludy Sforza, who swapped Tokyo for Chichijima seven years ago. He points out two dinky supermarkets, saying: “I don’t like to shop today. When the boat brings fresh food, it’s too hectic.” I’m charmed that supermarket rush hour means a 10-deep queue.\n\nAlong a tiny parade of restaurants, one is California-cool; another has Hawaii-look surfboard stacks outside; and a Japanese seafood joint sits close to a house where an American flag flutters. The multicultural scenery reflects the Ogasawara Islands’ complex history. Discovered by Japan’s Ogasawara Sayadori in the 16th century, Chichijima was first settled in 1830 by a group of Americans, Hawaiians and Europeans. In the late 19th century, the islands became a Japanese territory, were later evacuated and used as military bases in the Second World War, before falling under American occupation in 1946, then handed back to the Japanese in 1968. Nowadays, several cultures co-exist.\n\nFor a slow-paced place, there’s plenty to do. First up, beaches. Ten minutes from the guesthouses I stay at – Pension Cabbage Beach and Papa’s Island Resort, both simple, homely spots where flip-flops are left at the doors – are the white sands at Sakaiura Beach. Just offshore are the remains of a Second World War vessel where sea turtles outnumber snorkellers. A short drive away is Kominato Beach, a combination of silvery sand and a mirror-like lagoon edged by pillow lava hills which look like clenched giant’s fists.\n\nOut at sea the next morning, a boat from Take Nature Academy whizzes me through bumpy waves towards Minamijima, an uninhabited, protected island limited to 100 visitors a day. Leaving Futami Bay, pods of bottlenose dolphins skip through the waters. It kills me not to stop and swim with them, but tide levels have to be just-so to land on Minamijima, so we press on. The scene is straight out of Jurassic Park: rapier limestone rocks carpeted with violet and green beach cabbage where wedge-tailed shearwaters make their nests, the surrounding sea thick with white-tip reef sharks. Keiichi, my guide, advises me not to look back as we scramble up some precarious rock-hewn “steps”. Up top, the views are even better: Ogiike lagoon has a heart-stopping fan-shaped cove with Durdle Door-like arch, islets which rise from the water like prehistoric creatures, and a beach littered with 800-year-old semi-fossils – the remains of mandarina luhuana, a long-extinct endemic snail.\n\nThe following day is all underwater wow, diving with Papa’s Diving Studio, north of Chichijima. At Barachin, batfish and wrought-iron butterflyfish dart through a shipwreck, and a blunt slipper lobster – seemingly a cross between gargantuan woodlouse and a creature from Stranger Things – gallops across the ocean floor. Snorkelling close to the port, 10 green sea turtles skull nonchalantly past, unbothered by my presence.\n\nHiking on Chichijima is another highlight. Guide Hiroshi Sato leads me to Higashidaira, a sanctuary for the rare red-headed pigeon. In a dry shrub forest filled with octopus trees which look like mangroves-on-stilts, he points out uniquely evolved plants – ones which would be thorny on the mainland, but here, have lost their thorns due to lack of predators. Among tangled banyan trees at nearby Mulberry mountain, gas mask filters lie discarded, echoes from Chichijima’s wartime past. Our final stop is a nondescript patch of greenery. Hiro points at some unremarkable-looking mushrooms on a log. I’m bemused. He cups his hands around them and suddenly they glow neon green. No one’s quite sure why these bioluminescent mushrooms, known as green pepe, do what they do, and I’ve never seen anything quite like it.\n\n“One of my friends refers to these islands as a different planet,” Ludy says to me later on, over passion fruit liqueur at a Chichijima haunt named after the psychedelic ’shrooms. “That ship is like a spaceship. You wake up, step outside and it’s another world. There is some kind of magic here, I think.”\n\nWhen it’s time to leave, 150 plus locals line the dock, Auld Lang Syne booms from speakers and the Ogasawara-maru’s promenade decks are packed with waving passengers. A flotilla of dive boats fire up their engines and escort us out of the bay. In our own closing ceremony, dive crews strip to their wetsuits and flip into the ocean, to raucous applause and laughter from the boat deck; an extraordinary goodbye from an otherworldy place.\n\nTravel essentials\n\nGetting there\n\nInternational travellers should contact the Ogasawara Tourist Association in good time before travel to help with on-the-ground-arrangements (accommodation, ferries, activities) as operators speak limited English.\n\nReturn flights from London Heathrow to Tokyo via Bangkok with Thai Airways cost from £649pp.\n\nThe Ogasawara-maru sails once a week from Tokyo’s Takeshiba Pier (twice a week during the summer months) to Chichijima, with prices ranging from £170-515pp each way, outside of peak season.\n\nStaying there\n\nPension Cabbage Beach is a cheery blue-and-white clapboard fronted guesthouse fringed by palm trees with rustic rooms and a laid-back vibe. Rooms with a shared bathroom from £57pp.\n\nRun by the team behind Papa’s Diving Studio, rooms at Papa’s Island Resort are spacious but simple, with plenty of useful facilities for scuba divers such as washing machine/hanging space out back for wet clothes. Rooms from £118pp, half-board.\n\nVisiting there\n\nTours to Minamijima Island and dolphin watching/swimming trips with Take Nature Academy are from £40/80pp for half/full day.\n\nGuided forest walks can be arranged via the Ogasawara Tourist Association, costing from £37/60pp for a half/full day.\n\nScuba diving with Papa’s Diving Studio costs £110pp for two dives, plus £88pp to rent gear.", "description": "White sands, forest-topped islands and sapphire waters. The scene screams Hawaii, yet technically I’m in Tokyo. I’m in the Ogasawara Islands, an archipelago of more than 30 islands in the Pacific Ocean which, despite being sprinkled 1,000km south of the frenetic skyscraper-filled capital, are considered a subprefecture of it.", "authors": ["Ianthe Butt"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/18/12/minimajima-island-beach.jpg", "published_at": "2019-10-18"}