{"pub": "rt", "url": "https://rt.com/news/470294-turkey-syriam-border-reinforcements", "downloaded_at": "2019-10-06 05:34:49.295960+00:00", "title": "Turkish troops & armored vehicles amass at Syrian border after Erdogan announces IMMINENT incursion (PHOTOS, VIDEOS)", "language": "en", "text": "Turkey is deploying reinforcements to the Syrian border following President Erdogan’s announcement of a looming military operation against US-backed Kurdish militants, videos shared on social media and national TV show.\n\nMilitary convoys were captured in dozens of photos and videos, confirming the Turkish leader’s claim that preparations have been finalized to establish a so-called ‘safe zone’ on Syrian soil along the Turkish border and that the operation could be launched “as soon as today or tomorrow.”\n\nTurkey sends nine truckloads carrying military vehicles and one bus carrying reinforcements to its border with Syria hours after President Erdogan announces his army ready to start operations against YPG terrorists pic.twitter.com/rNhldjNGWp — TRT World Now (@TRTWorldNow) October 5, 2019\n\nAdditional armored vehicles and troops were sent to the border town of Akcakale, across from Tal Abyad in Syria, state television TRT confirms.\n\nMultiple videos shared on Twitter show dozens of military vehicles and buses, allegedly full of military personnel, moving towards the border in convoys.\n\nAlso on rt.com Turkey ready to start own ops in N. Syria ‘today or tomorrow’ as setting up safe zone with US became ‘fairytale’ – Erdogan\n\nHelicopters are also increasingly ‘active’ in the border area airspace, according to some reports.\n\nŞanlırfa 20. Zırhlı Tugay Komutanlığı'ndan hareket eden 10 TIR üzerindeki zırhlı araçlar ile içi asker dolu 8 otobüs Suriye sınırındaki Akçakale ilçesine sevk edildi. pic.twitter.com/IEDQBaVgWK — Kirpi ve Kobra (@kirpivekobra) October 5, 2019\n\nAnkara and Washington agreed earlier in August to create a ‘peace corridor’ to facilitate the return of displaced Syrians into northern Syria – until Turkey realized that joint “land and air patrols with US were a fairytale.” Erdogan even openly suggested that Washington was after a safe zone “not for Turkey but for the terrorist group.”\n\n#BREAKING#Turkey\n\nMANY Turkish heavy weapons are on the way to the #Syria|n border tonight in preparation for the offensive against #YPG. pic.twitter.com/3t3aB1jHGM — Noe Paz (@YairNoaj) October 5, 2019\n\nNeither the US nor Turkey bothered to consult Damascus, which has repeatedly blasted all their joint and unilateral endeavors as flagrant violations of Syria’s sovereignty and territorial integrity.\n\nAlso on rt.com US-Turkey ‘safe zone’ deal is attack on Syrian sovereignty, could topple peace efforts – Damascus\n\nLike this story? Share it with a friend!", "description": "Turkey is deploying reinforcements to the Syrian border following President Erdogan’s announcement of a looming military operation against US-backed Kurdish militants, videos shared on social media and national TV show.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5d995eba85f540458c55ddf6.JPG", "published_at": "2019-10-06"}