{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/09/hollywoods-great-leap-backward-free-expression/598045", "downloaded_at": "2019-09-15 10:55:04.673648+00:00", "title": "Hollywood’s Great Leap Backward", "language": "en", "text": "This outcry is wholly justified. But as a long-time observer of a different medium that has also been losing ground to China’s censors, I have to wonder: Why isn’t there a similar outcry about China’s mounting attack on the film industry, not just in Hong Kong but also in the United States?\n\nOver the years, the U.S. government has often praised and defended Hollywood films as a key component of American soft power—that is, as a story-telling medium that can, without engaging in blatant propaganda, convey American ideals, including free expression itself, to foreign populations around the world. But Hollywood has long since abandoned that role. Indeed, not since the end of World War II have the studios cooperated with Washington in furthering the nation’s ideals. Instead, the relationship today is purely commercial—on both sides. For example, Hollywood frequently enlists Washington’s help in fighting piracy and gaining access to foreign markets. But even while providing that help, Washington refrains from asking Hollywood to temper its more negative portrayals of American life, politics, and global intentions. (The exception is the Department of Defense, which insists on approving the script of every film produced with its assistance.)\n\nThings are different in China. In that country, which is fast becoming the world’s largest and most important movie market, the ruling Communist Party exercises no such restraint. On the contrary, Beijing has a very clear idea of how a film industry should operate—namely, as an essential part of the effort to bring public opinion in alignment with the party’s ideological worldview. To that end, Beijing has been using Hollywood’s insatiable need for investment, and its vaulting ambition to reach a potential audience of 1.4 billion people, to draw it into China’s orbit.\n\nThis summer, some industry-watchers objected when the trailer for the forthcoming Top Gun: Maverick—a sequel financed in part by the Chinese firm Tencent—omitted the Japanese and Taiwanese flag from Tom Cruise’s jacket. But over the past 20 years, most news stories about the Hollywood-China relationship—for instance, recent reports about the negative impact of the U.S.-China trade war on Hollywood’s bottom line—have been skewed more toward Hollywood’s active efforts to penetrate the huge Chinese market than to its passive acceptance of China’s increasingly heavy-handed censorship.\n\nThat censorship is increasing because, in keeping with President Xi’s decree, every film released in China must now be vetted not only by the Central Propaganda Department but also (depending on its subject matter) by the Ministry of State Security, the State Ethnic Affairs Commission, the National Health and Family Planning Commission, the Ministry of Public Security, the State Bureau of Religious Affairs, the Ministry of Education, the Ministry of Justice, the Ministry of Foreign Affairs, and numerous other bureaucratic entities.", "description": "Beijing moves to co-opt the American film industry as it seeks to penetrate the world’s largest market.", "authors": ["Martha Bayles", "Author Of"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTR28ENA/facebook.jpg?1568404099", "published_at": "2019-09-15"}