{"pub": "businessinsider", "url": "https://businessinsider.com/amazon-prime-members-spend-more-money-sneaky-ways-2019-9", "downloaded_at": "2019-09-14 01:52:43.569024+00:00", "title": "From free two-day shipping to special Prime member-only deals, here's how Amazon gets you to spend more", "language": "en", "text": "Following is a transcript of the video.\n\nNarrator: Amazon is massive. In 2018, the company earned an estimated $232 billion in retail commerce. And it's all thanks to its customer base. The average Amazon customer spends about $600 a year on the site. And Prime members? They spend $1,400 each. So, how does Amazon keep getting people to spend their money?\n\nFree shipping is nearly synonymous with the Amazon brand. Even if you're not an Amazon Prime member, you can qualify for free shipping if your order hits the $25 minimum. So you'll likely end up throwing in something extra, like a pair of socks, just to reach that minimum. And Amazon makes it super easy to find that little something extra to add to your order, with sections like \"frequently bought together\" and \"customers who bought this item also bought,\" which are generated from shopping profiles similar to yours.\n\nDennis Green: So, Amazon is always collecting data on its customers. It makes these psychographics that target its customers. You know, that's how it comes up with the \"if you like this, you might also like this\" kind of thing.\n\nNarrator: Since most people use the search bar rather than browse around, Amazon wants to make sure they still get lots of options in front of customers. The aim is to sell a higher number of items to offset its losses from free shipping. It also makes it as easy as possible to order more with one-click ordering.\n\nGreen: It's kind of simple logic that people like to impulse purchase sometimes, and for an ability to facilitate these impulse purchases, one-click ordering is great 'cause it can just, you know, you're like, oh, I see it, I want it, I bought it.\n\nNarrator: But watch out: You may end up paying more with these instant purchases, since Amazon's prices are always fluctuating. Amazon analyzes competitors' prices and user data to update its product prices over 2.5 million times a day. That's a price change every 10 minutes for an average product listing.\n\nA one-click purchase makes it easier to buy without browsing around for a better deal. But if one-click ordering and free shipping aren't enough, the next step up for an Amazon customer is Amazon Prime. Perhaps one of Amazon's smartest developments. Today, there are over 100 million members paying $119 a year for Amazon Prime. And as of October 2018, they were spending an average of $1,400 a year, $100 more than the year before. But why? Well, one of the perks that comes with Amazon Prime is expedited shipping, free of charge, of course.\n\nGreen: Amazon Prime members spend more than regular Amazon customers just because they're locked in. They are so addicted to the convenience. They love seeing their packages show up in two days or one day or on the same day.\n\nNarrator: And because studies show same-day-delivery users shop more frequently, spend more, and are more loyal than other customers, Amazon announced it would invest $800 million in one quarter alone to make one-day delivery the new standard for its Prime customers. And it isn't the only way Amazon is investing in its Prime program.\n\nGreen: Amazon's constantly promoting Prime on its website. It's doing free trials; it'll do a 30-day free trial, and then if you try to cancel it, it'll be like, oh, but you can stay for another seven days for only $2. It's just, they're always trying to think of new ways to target this core customer that's kind of on the edge of becoming a Prime member but not quite there yet.\n\nNarrator: Another major way Amazon promotes its Prime program is with Prime Day. Since launching in 2015, the July shopping event has offered extensive price cuts and deals for a limited time. Prime Day 2019 was Amazon's largest shopping event in Amazon history. In a recent survey, 60% of Americans said that they felt Prime Day pressured them to buy quickly, and 20% said they were already planning to spend $300.\n\nGreen: Think about it; it's like Black Friday in the middle of July, and it's just a day for you to treat yourself and buy that thing that you've been looking at. Like, that's really the design of it.\n\nNarrator: Amazon offered a free Prime trial for customers looking to participate in Prime Day. As always, their bigger-picture goal is to get as many people integrated into the Amazon ecosystem as possible. And the Amazon ecosystem isn't just Prime. You've got Amazon devices like Alexa and Kindle as well. That's why you'll often see Amazon offer devices like the Echo or Kindle at a discount. Because Kindle users spend even more than Prime members. On average, $1,450 per year.\n\nGreen: Kindle owners are obviously also more likely to buy from the Kindle e-shop for their e-books. So, there's just, like, a lot of ways that Amazon can kind of tie in its digital offerings with its physical offerings and kind of create this cohesive ecosystem that at some point a customer might just never have to leave.\n\nNarrator: But should you be buying everything on Amazon?\n\nGreen: My general advice for Amazon customers is that it's not always the best price. And a lot of other online companies are kind of beefing up their offerings. So you might get an item in two days without it being advertised as two-day shipping, and it might even be at a better price. So, look elsewhere. There's a lot of companies, especially Walmart, Target, the big box stores that you might think of as, you know, kind of staid and old-school, are actually beefing up their online operations and can almost match Amazon. Not quite, but almost.\n\nEDITOR'S NOTE: This video was originally published September 4, 2019.", "description": "Amazon dominates online shopping. The average Amazon Prime member spends around $1,400 per year. Here's how the e-commerce giant gets you to buy more.", "authors": ["Jack Houston", "Irene Kim"], "top_image": "https://amp.businessinsider.com/images/5bfbd87cd1e84415b709b664-1334-667.jpg", "published_at": "2019-09-13"}