{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7616135/Nicola-Roberts-1-25million-mansion-repossessed-bank.html", "downloaded_at": "2019-10-26 08:42:13.659932+00:00", "title": "Nicola Roberts has her £1.25million mansion repossessed by the bank", "language": "en", "text": "Nicola Roberts has had her stunning £1.25million Surrey mansion repossessed by the bank.\n\nThe former Girls Aloud star, 34, was forced to do a mutual deal with the bank so she could move out and start afresh after being left terrified of her stalker ex-boyfriend Carl Davies, who was aware of where she resided.\n\nThe singer has explained that it was 'her own decision' to go to the bank after the property, which she purchased in 2009, failed to sell at a heavily slashed price of £825,000.\n\n'It was my decision': Nicola Roberts, 34, has had her stunning £1.25million Surrey mansion repossessed by the bank\n\nSpeaking to The Sun, Nicola has admitted that she is finally at peace after having her former home repossessed by the bank.\n\nNicola revealed: 'It was my decision to go to the bank and ask if they would take the house in exchange for clearing the mortgage.\n\n'I had been trying to sell the house for years, and was so unhappy there that I decided to take the hit financially in order to move on and find a new property away from the bad memories.\n\nNicola was able to secure her belongings from the home - which was first listed in February 2017 - before it was put back on the market, due to the mutual bank agreement.\n\nTerrifying: The former Girls Aloud star was forced to do a mutual deal with the bank after being left terrified of her stalker ex-boyfriend Carl Davies (Pictured 2007)\n\n'Was so unhappy': The singer has explained that it was 'her own decision' to go to the bank after the property, which she purchased in 2009, failed to sell at a heavily slashed price of £825,000\n\nThe star initially took out a mortgage with the bank Coutts, and then went onto transform the Surrey pad with new facilities such as a hi-tech gym, a dreamy walk-in wardrobe, and a terrace overlooking the idyllic gardens.\n\nHowever, during her time living at the property, Nicola was subjected to an ill-fated relationship with Carl Davies, now 44.\n\nDavies, who sent Nicola up to 3,000 messages, including threats to stab and burn her, was given a suspended 15-month prison sentence by Guildford Crown Court, Surrey last year.\n\nMoving on: Nicola has admitted that she is finally at peace after having her former home repossessed by the bank\n\nMutual: Nicola was able to secure her belongings from the home - which was first listed in February 2017 - before it was put back on the market, due to the mutual bank agreement\n\nShe revealed at the time she was scared to leave her windows open at night or take her dogs for a walk.\n\nNicola said in a victim impact statement: 'The messages he sent reminded me of all the terrible things that happened when we were together.\n\n'It was like walking on eggshells and the constant messaging was bringing all those feelings back.'\n\nTrial: Davies, who sent Nicola up to 3,000 messages, including threats to stab and burn her, was given a suspended 15-month prison sentence by Guildford Crown Court last year (Pictured 2007)\n\n\n\n", "description": "Nicola Roberts, 34, has had her stunning £1.25million Surrey mansion repossessed by the bank.", "authors": ["Jabeen Waheed For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/09/20210872-0-image-a-12_1572078677404.jpg", "published_at": "2019-10-26"}