{"pub": "fox", "url": "https://foxnews.com/sports/penalty-pump-fake-espn-takes-down-confusing-graphic-mid-game-after-viewers-erupt-on-twitter", "downloaded_at": "2019-09-10 23:34:05.945215+00:00", "title": "ESPN's 'Monday Night Football' NFL telecast changes confusing graphic mid-game", "language": "en", "text": "The return of “Monday Night Football” initially earned ESPN a flag on the play from viewers nationwide who were left seriously confused by a new graphic that made it appear as if a penalty had been called on every down -- and which prompted a hurried mid-game redesign.\n\nInstead of the New Orleans Saints and Houston Texans taking center stage on the broadcast, a swift social media backlash occurred after fans at home were left frustrated by the ESPN scoreboard, which used a bright yellow bug to indicate down-and-distance — the same color typically used to signal a penalty has been called.\n\n‘NOLA NO-CALL’ LAWSUIT IS NO MORE; FAN DROPS HIS FIGHT\n\nBut even more confusing, when a penalty was actually called, the bug turned black — which is the standard no-flag look on most telecasts.\n\nPeople watching at home erupted on Twitter.\n\nThe network caught on quickly after an ESPN spokesperson tweeted that the organization's “production team is aware of the feedback,” and the telecast adjusted the bug to the standard colors for the second half of the game.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nOblivious to the on-air color controversy, the Saints beat Houston, 30-28.", "description": "The return of “Monday Night Football” initially earned ESPN a flag on the play from viewers nationwide who were left seriously confused by a new graphic that made it appear as if a penalty had been called on every down -- and which prompted a hurried mid-game redesign.", "authors": ["Paulina Dedaj", "Paulina Dedaj Is A Writer", "Reporter For Fox News. Follow Her On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/saints-titans-2-AP.jpg", "published_at": "2019-09-10"}