{"pub": "foxbusiness", "url": "https://foxbusiness.com/markets/taco-bell-debuts-first-ever-vegetarian-menu-without-beyond-meat-impossible-foods", "downloaded_at": "2019-09-10 23:30:22.287241+00:00", "title": "Taco Bell debuts vegetarian menu without Beyond Meat, Impossible Foods", "language": "en", "text": "Taco Bell is launching a new vegetarian menu -- and it doesn’t include fake meat.\n\nContinue Reading Below\n\nAs more fast-food chains double down on menu items with meatless alternatives from Beyond Meat and Impossible Foods, Taco Bell has teamed up with the American Vegetarian Association to rollout meatless alternatives to classics like its Crunchwrap Supreme and burritos.\n\nWhen asked Tuesday if the company will ever add alternative meat items to menus, Taco Bell’s chief food innovation officer Liz Matthews told FOX Business: “I wouldn’t say we’ll never do that. It’s really easy for brands to do what everyone else is doing. We want to go after things that are really exciting and are successful, and not just mediocre. At this point, we’re not leaning into that.”\n\nThe nationwide vegetarian menu will roll out Thursday at more than 7,000 of the chain’s locations and comes after its successful test run in Dallas earlier this year. The menu will include the black bean Crunchwrap Supreme and black bean Quesarito, as well as the classic seven-layer burrito and bean burrito.\n\nTaco Bell’s decision to implement a permanent vegetarian menu comes as other fast-food competitors like Burger King, White Castle, and KFC have been adding alternative meat products from the likes of Beyond Meat and Impossible Foods to menus. California-based Tex-Mex chain Del Taco said it sold 2 million of its meatless tacos made with a plant-based substitute from Beyond Meat two months after the launch. It was so well-received, the chain rolled out meatless burritos.\n\nAdvertisement\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nAround 11% of Taco Bell customers follow a vegetarian diet, and that number is increasing every year, the chain confirmed. Still, the chain's No. 1-selling item is its beef crunchy taco, showing consistent demand for meat. The bean burrito is the second best-selling item.\n\nMatthews says Taco Bell's vegetarian menu will be on par with the prices of its regular meat items.", "description": "Taco Bell is launching its first-ever vegetarian menu. But it doesn't plan to serve fake meat from Beyond Meat or Impossible Foods anytime soon.", "authors": ["Jeanette Settembre"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2017/11/0/0/TACO-BELL.jpg?ve=1&tl=1", "published_at": "2019-09-10"}