{"pub": "businessinsider", "url": "https://businessinsider.com/drew-brees-saints-nfl-anti-lgbtq-focus-on-the-family-2019-9", "downloaded_at": "2019-09-06 12:07:18.608621+00:00", "title": "Drew Brees promotes 'Bring Your Bible to School Day' in video for anti-LGBTQ group 'Focus on the Family'", "language": "en", "text": "New Orleans Saints quarterback Drew Brees appeared in a video for Focus on the Family to promote \"Bring Your Bible to School Day\" on October 3.\n\nBrees is now being criticized for the appearance. BringYourBible.org is a website published by Focus on the Family. He later said he was unaware of the group's anti-LBTQ views and that he was just focused on \"Bring Your Bible to School Day.\"\n\n\"I do not support any groups that discriminate or that have their own agendas that are trying to promote inequality,\" Brees said in a statement.\n\nAccording to the Human Rights Campaign (HRC), Focus on the Family is an American Christian conservative organization with a history of anti-LGBTQ activities.\n\n\"As an evangelical Christian ministry committed to the authority of Scripture as the inspired Word of God, Focus on the Family believes that sex is given by God as an expression of love to be shared and enjoyed exclusively between a husband and wife,\" Focus on the Family's website states. \"Further, we are convinced that the Bible leaves no room whatsoever for confusion or ambiguity where homosexual behavior is concerned.\"\n\nJames Dobson, the founder of Focus on the Family, wrote in his book \"Marriage Under Fire\" that, \"Focus on the Family promotes the truth that homosexuality is preventable and treatable.\"\n\nAlong with promoting discredited conversion therapy, Focus on the Family also opposes adoption by gay couples, according to HRC.\n\nThe organization also believes \"the modern 'transgender' movement is systematically working to dismantle the reality of two sexes,\" which they say will cause \"striking consequences for individuals, marriage, family, children and society at large.\"\n\nBrees has spoken out against bullying in the past. Chris Graythen/Getty Images\n\nFocus on the Family also states that anti-bullying and tolerance programs \"actually turned out to include teaching on things like gay marriage - sometimes against parents' will - and what it means to be 'transgender' for kids in elementary school.\"\n\nIn 2009, the organization also spoke out against the proposed Employment Non-Discrimination Act (ENDA), which would make it illegal for employers to make decisions on hiring, firing, promoting, or paying an employee based on sexual orientation. Focus on the Family called the bill, \"yet another attack on religious liberty in a long string and must be stopped.\" The bill has still not passed.\n\nIn the video, which was hidden from the group's Facebook timeline shortly after it was published, Brees encourages kids to \"live out your faith on 'Bring Your Bible to School Day' and share God's love with friends.\"\n\nBrees has spoken out against bullying in the past. He appeared in a public service announcement on \"The Ellen Show\" in 2010.\n\n\"I want my fans to know that if you are making fun of someone because they're different, then you are no friend of mine,\" Brees said.\n\nRepresentatives for Brees or the Saints did not immediately respond to Business Insider's request for comment.", "description": "Quarterback Drew Brees appeared in a video for anti-LGBTQ organization Focus on the Family to promote \"Bring Your Bible to School Day\" on October 3.", "authors": ["Alexandra Licata"], "top_image": "https://amp.businessinsider.com/images/5d71208f2e22af546c166a35-1536-768.jpg", "published_at": "2019-09-05"}