{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7608257/Couple-spent-45-000-turning-dilapidated-shed-modern-space-yoga-family-time.html", "downloaded_at": "2019-10-24 16:02:44.418316+00:00", "title": "Couple spent £45,000 turning their dilapidated shed into a modern space for yoga and family time", "language": "en", "text": "A couple who complained they didn't have enough space in their three bedroom Victorian house spent £45,000 turning their dilapidated shed into a modern space for yoga and quality family time.\n\nMike and Lisa, from Shewsbury, who have a ten-year-old son George, and appeared on BBC 2's Your Home Made Perfect last night, said they also wanted space for hobbies.\n\nThe old shed in the garden was being used as a garage and for storage, but they wanted to create a space where Lisa cold do her yoga and they could spend time together as a family.\n\nA year later the shed had been knocked down and they had rebuild a light filled space, which took over most of their garden, but provided a place for them to all enjoy.\n\nThe old shed (pictured) in the garden was being used as a garage and for storage, but they wanted to create a space where Lisa cold do her yoga and they could spend time together as a family.\n\nA couple who complained they didn't have enough space in their three bedroom Victorian house spent £45,000 turning their dilapidated shed into a modern space for yoga and hobbies (picturted)\n\nMike and Lisa, from Shewsbury, who have a ten year old son George, who appeared on BBC 2's Your Home Made Perfect, last night said that they wanted space to spend more quality time together as a family\n\nThe couple both agreed that they needed more space, however Lisa wanted the extra space for yoga, while Mike was hoping to use it for time with his son and to practice his drumming.\n\nLisa said: 'The space for me, it needs to be ‘womb like’ – somewhere where you can be on your own, having your own thoughts - I envisaged some quite space where I could just do my yoga and meditate.'\n\nHowever Mike admitted he wanted a something with 'white walls, and a place to put my drum kit'.\n\nLisa, who is a therapist, also wanted space to work from, and her office was currently in a small room off the kitchen.\n\nTheir old shed was cluttered with bikes and bots and bobs and they wanted more space for living\n\nThe new space includes storage for bikes and his drum kit, while they can also use it as a garage\n\nAs always two designers competed to show the couple their version of the transformation, via virtual reality, with Robert suggesting an extraordinary structure -which looked like a Japanese temple.\n\nLaura, meanwhile, attempted to blend the needs of the whole family with a highly adaptable garden room oriented to capture the morning sun.\n\nLisa said: 'It was amazing seeing the ideas come to life and for some of them I thought – \"Wow I would never have thought of that.\"\n\nThe old shed wasn't being used for anything productive and they knew they wanted to knock it down and create something more useful\n\nThe couple both agreed that they needed more space in their three bedroom house (pictured) - however Lisa wanted the extra space for yoga, while Mike was hoping to use it for time with his son and to practice his drumming.\n\nPresenter of the show Angela Scanlon and designer Laura both loved the new 'shed' complimenting the final touches. While the couple admitted the went over budget by £5,000.\n\nHowever they both decided on Laura's light filled design: 'She left nothing out and got all those little details in,’ Mike said.\n\nLisa went on to say: 'I could imagine myself in both of them – they really got inside our heads and tried to express what that was in a building.'\n\nWhile Mike said: 'Laura’s appealed to me straight away – she seemed to understand us as a family and what our requirements were for now and into the future.'\n\nLisa, who is a therapist, also wanted space to work from, and her office was currently in a small room off the kitchen\n\nThe new space is very minimalist and includes a space that Lisa can work from - with the light pouring in\n\nThe new 'shed' included white walls a sofa and a book case which was built into the wall\n\nA year later they went back to see the transformation. From outside their new 'shed' had dark granite look with floor to ceiling windows - while it also had an unusual angle - which would allow light to enter the building in the morning - perfect for Lisa's sun salutations.\n\nThe new space was made up of two rooms - a living room, which can also be used as an office. Its minimalist design included white walls, a red sofa with throws and and a book case which was built into the wall.\n\nWhile next door was a garage and also storage space for bikes and Mikes drum kit.\n\nPresenter of the show Angela Scanlon and designer Laura both loved the new 'shed' - complimenting the final touches. While the couple admitted the went over budget by £5,000.\n\nFans, on Twitter, of the show weren't convinced with the designs as they watched the BBC 2 design show\n\nHowever fans of the show weren't convinced with the designs on last nights show. Talking about Robert's suggestion one said: 'The temple in the garden your home made perfect is just too much . Poor neighbours.\n\nWhile another said: 'Just caught a little bit of a BBC Two program called ‘your home made perfect’, where 2 architects compete using VR plan tech to design a garden room. The planner in me despairs. They do not appear to have considered the neighbours at all.'\n\n\n\nWhile another wasn't convinced with the finished product: 'Watching Your Home Made Perfect. Usually they implement the amazing designs really well but thought this week’s implementation was a bit half-hearted.'", "description": "Mike and Lisa, from Shewsbury, who appeared on BBC 2's Your Home Made Perfect, last night said that they wanted space to spend more quality time together as a family.", "authors": ["Sarah Finley For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/09/20121664-0-image-a-23_1571905840167.jpg", "published_at": "2019-10-24"}