{"pub": "cryptonews", "url": "https://cryptonews.com/news/eos-and-sia-settlements-with-sec-may-end-existential-securit-4780.htm", "downloaded_at": "2019-10-05 13:39:57.054448+00:00", "title": "EOS and Sia Settlements With SEC 'May End Existential Securities Risk'", "language": "en", "text": "Source: iStock/PeopleImages\n\nRecent news about the two settlements reached with the U.S. Securities and Exchange Commission (SEC) might potentially set an important precedent in the Cryptoverse where many are debating which of the digital tokens traded on the U.S. exchanges are securities and might be endangered. So now many have also been wondering what these settlements mean exactly and what it means for the future of crypto, particularly in the U.S. Several lawyers have shared their opinions on these questions.\n\nFor example, Jake Chervinsky, General Counsel at Compound Finance, thinks that these settlements might spell the end of existential securities risk for tokens issued before July 25 of 2017. Furthermore, other lawyers argue that the fee amount might be perfectly appropriate, and that geoblocking will not help projects stay in the SEC’s good graces.\n\nAs a reminder, EOS developer Block.one, has settled with the SEC, agreeing to pay a USD 24 million fee “for conducting an unregistered initial coin offering of digital tokens (ICO) that raised the equivalent of several billion dollars over approximately one year.” It wasn’t the only blockchain project to bring such news to the Cryptoverse, as Nebulous, the company building the Sia decentralized cloud storage network, also said it settled with the SEC and agreed to pay USD 225,000 without admitting or denying liability.\n\nAn important move\n\nThese settlements could potentially prove to have a massive impact on the Cryptoverse, and Chervinsky finds that these enforcement actions could turn out to be SEC’s most important moves since June 2018. Back then William Hinman, the agency's Director of the Division of Corporate Finance, said Ethereum is not a security. Also, in April 2019, a division at the SEC released a framework for analyzing whether a digital asset is offered and sold as an investment contract, and, therefore, is a security.\n\n“Call me crazy, but I think the SEC believes EOS & Siacoins aren't securities either,” says Chervinsky in his Twitter thread. He goes on to explain that, though the SEC settled a number of enforcement actions against token issuers before, “yesterday's actions break new ground: EOS is the first target with a \"top ten\" market cap & Sia is the first from entirely before the DAO Report,” which concluded on July 25 2017 that DAO (decentralized autonomous organization) tokens were securities and therefore subject to the federal securities law.\n\nOf critical importance, he says, is that both actions focused on whether the two tokens were securities at the time of sale, and not as they are now, and Chervinsky thinks “it's reasonable to infer that the SEC believes EOS & Siacoins are not securities as they exist today.” Nowhere has it been said explicitly, but he gives three reasons why he thinks the SEC cleared EOS and Siacoins:\n\nThe agency will rarely go multiple times after the same defendant for violations arising from the same set of facts, so “if the SEC thought EOS or Siacoins were securities, I'd expect to see it in the settlements.” The agency clearly stated they find certain tokens as securities in the settlements with other crypto defendants, such as Paragon, Airfox and Gladius settlements, for example. Chervinsky believes that Nebulous “carefully crafted” their settlement announcement to avoid saying \"the SEC has cleared Siacoins,\" but “if the SEC thought Siacoins were securities, we'd know.”\n\nIf the SEC really does believe EOS and Siacoins aren't securities, “these tokens could represent minimum industry standards for negating the Howey test [a test created for determining whether certain transactions qualify as investment contracts] and avoiding securities regulation,” and if that is true, “then these settlements signal the end of existential securities risk for tokens issued before the DAO Report,” says the lawyer, adding that it’s the market that should decide crypto winners and losers.\n\nApples-to-apples\n\nSecurities lawyer and co-founder of blockchain- and crypto-focused investment adviser, Arca, Philip Liu, joined in on the discussion, saying that Block.one’s USD 24 million fine compared to the USD 4 billion raised “is not an apples-to-apples comparison.” He argues that, the SEC can’t be expected to impose its regulatory regime on non-US jurisdictions, and that of that multiple billion amount raised by Block.one, “the sales to U.S. investors […] was quite small,” in which case the fine amount is appropriate “if, for example, only USD 24m were raised via U.S. persons.”\n\n“Instead of disgorgement (and prejudgment interest) which would have been difficult to disburse to many small investors, the SEC just decided to make them pay an equivalent fine that goes to the U.S. Treasury,” he says.\n\nMeanwhile, Nebulous agreed to pay double the amount they raised in 2014.\n\nBe cooperative\n\nIn her annotations on the Block.one settlement, lawyer and Principal at venture firm Notation Capital, Katherine Wu, among other things said that, if one wants to stay friends with the SEC, geoblocking is simply not enough. Despite the attempt at geoblocking, “some U.S.-based persons purchased ERC-20 tokens,” the settlement says. Still, a huge win for EOS is that the SEC said “there was no fraud or criminal conviction in the sale,” Wu’s annotations explain. “For those of you wondering how EOS “got away” w/ USD 24 million settlement…moral of the story is BE COOPERATIVE,” Wu writes.\n\nIn contrast, the Kin Foundation, developer of the Kin Ecosystem intends to fight the SEC in court over the categorization of their token as a security. In September, they said that their Kik messaging app will be shut down due to regulatory pressure.\n\nOn the question about how the SEC uses the money from these fines, Wu replied that it goes to the US treasury as penalties paid to the government, and that the SEC can't get more money than its annual budget as approved by Congress yearly, adding that “this is one of many, many settlements to come.”\n\nThe ‘Meaningless’ Ratings\n\nSpeaking of securities, as reported, the U.S.'s biggest crypto exchanges joined to launch a project called the Crypto Rating Council (CRC), in order to rate which digital assets are likely securities and can't be traded on their venues - and which likely can. They have so far rated 20 assets, with the scores ranging between 1 (the asset has few or no characteristics of a security) and 5 (there are many characteristics of a security). According to this rating, EOS got 3.75, while Siacoin hasn’t been rated yet.\n\nHowever, the rating should be taken with a grain of salt, as it seems to be just “a compliance tool” for the Council’s members to assess the assets and try to stay out of regulators’ sight by not unknowingly dealing with those that may draw attention. Their FAQ site states that: “We publish the score as a reference and to encourage continued discussion among operators, developers, and regulators about the application of securities laws to crypto assets, but the Council’s understanding of the facts could be wrong and our analysis may not accurately reflect the law. You should not rely on the score for any legal purpose, and should consult with your own legal and other advisors before taking actions with respect to a particular digital asset.”\n\nMeanwhile, in an emailed comment to Cryptonews.com, Florian Glatz, Co-Founder of Fundament, an end-to-end security issuance solution for asset tokenization, said that “From a European perspective the CRC shows just how badly-suited the U.S. securities regulation is for fintech in general and crypto assets in particular,\" adding that \"Without a clear law and clear definitions of things such as \"what is a transferable security\" innovation in the market is ultimately stifled.\"\n\n__________\n\nAt pixel time (13:24 UTC) EOS trades at c. USD 2.97 and is almost unchanged in the past 24 hours, but appreciated 4.5% in the past week. Siacoin changes hands at USD 0.00169, having increased 5% in a day and 12% in the past seven days.", "description": "Recent news about the two settlements reached with the U.S. Securities and Exchange Commission (SEC) might potentially set an important precedent in the Cryptoverse where many are debating which of the digital tokens traded on the U.S. exchanges are securities and might be endangered.", "authors": ["Sead Fadilpašić"], "top_image": "https://cimg.co/w/articles/0/5d9/4a6ce93843.jpg", "published_at": "2019-10-02"}