{"pub": "guardian", "url": "https://theguardian.com/football/2019/sep/23/cctv-company-staff-jailed-over-leaked-emiliano-sala-mortuary-photos", "downloaded_at": "2019-09-23 17:28:50.365658+00:00", "title": "CCTV firm staff jailed over leaked Emiliano Sala mortuary photos", "language": "en", "text": "Sherry Bray and Christopher Ashford receive 14 months and five months in jail respectively\n\nA man and a woman who worked for a CCTV company have been jailed for illegally accessing and watching footage of the footballer Emiliano Sala’s postmortem.\n\nCompany director Sherry Bray, 49, and employee Christopher Ashford, 62, were jailed for 14 months and five months respectively.\n\nAs well as viewing the footage, both showed images of the postmortem to other people and were caught after images ended up circulating on social media.\n\nThe judge, Peter Crabtree, told them: “You were both driven by morbid curiosity. You have abused your positions and the access you had in a quite appalling way, in watching autopsies and in taking the photographs and screenshots you did.”\n\nCrabtree said both defendants used the CCTV system to replay the footage of the footballer’s postmortem examination and took screenshots.\n\nBray sent a screenshot to a relative while Ashford let a friend photograph the screenshot he had taken. The images appeared on Twitter and on other sites.\n\nThe footballer’s sister, Romina Sala, said in a victim impact statement that her family was devastated by the pair’s actions. She said: “I have seen photos of Emiliano’s body leaked on Instagram, and I cannot believe there are people so wicked and evil who could do that.\n\n“I was sad as people were making jokes about it. I’ll never erase the images from my head. My brother and mother can never forget about this. It’s hard for me to live with this image.”\n\nSala, 28, had just signed for Cardiff City when the plane he was travelling in crashed into the sea, north of Guernsey, on 21 January. His body was recovered and a postmortem took place at Bournemouth borough mortuary.\n\nSwindon crown court heard that Bray, a director of Camera Security Services (CCS), watched live footage of the postmortem on the afternoon of 7 February – outside the hours that the company is contracted to monitor the cameras.\n\nBray’s and Ashford’s actions came to light on 14 February when a member of the public flagged up the image to the police.\n\nPolice investigated and found a text message exchange between Bray and Ashford while the postmortem was taking place.\n\nThe first message, from Bray, read: “Nice one on table for you to watch when you are next in”, followed by an emoji of a face being sick. Ashford replied: “Not from the plane that crashed into the sea?”\n\nEmiliano Sala plane fell thousands of feet in seconds – investigators Read more\n\nAfter Bray realised the image was distributed online she told Ashford: “Delete your pics” and the pair discussed deleting CSS’s live feed of the autopsy room cameras.\n\nWhen she was interviewed by the police, Bray admitted watching live footage of Sala’s postmortem on 7 February and re-accessing next day. But she also said: “I don’t sit there watching mortuary footage all day, I’m not sick. Although I am sick, because I’ve just done that.”\n\nAshford, who worked as a night-shift camera operative at CSS for 13 years, admitted he had watched mortuary footage in the past, and had a “morbid obsession” with forensics.\n\nThe court was told that Bray had allowed a “culture” to become embedded at CSS whereby she and other staff would watch postmortems.\n\nForensic pathologist Dr Basil Purdue said he was not aware the security cameras in the mortuary were able to film postmortem examinations and that if he had he known, he would not have allowed it to take place, adding it was a “flagrant breach of medical confidentiality”.\n\nBray, of Corsham, Wiltshire, and Ashford, of Calne, Wiltshire, admitted three counts of computer misuse. Bray also admitted perverting the course of justice by trying to cover up what had happened.\n\nAnthony Johns, of the Crown Prosecution Service, said: “Sherry Bray and Christopher Ashford caused immense suffering to Mr Sala’s family and friends with their deeply offensive actions. It is impossible to imagine why anyone would wish to record or view these sorts of images in such a flagrant breach of confidentiality and human decency.”", "description": "Sherry Bray and Christopher Ashford receive 14 months and five months in jail respectively", "authors": ["Steven Morris"], "top_image": "https://i.guim.co.uk/img/media/429234f6ab5abdeb8084879f608544c612d2c3ed/0_72_5000_3000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=62a7b67bfc72fd4a7c0746964aaab547", "published_at": "2019-09-23"}