{"pub": "businessinsider", "url": "https://businessinsider.com/trump-trolls-democrats-in-speech-during-primary-debate-2019-9", "downloaded_at": "2019-09-13 18:31:46.235358+00:00", "title": "During the Democratic debate, Trump gave a speech mocking his opponents and concluded: 'You have to elect me, you have no choice'", "language": "en", "text": "As Democrats took to the stage for a live televised debate Thursday, US President Donald Trump delivered a speech in Baltimore in which he trolled his rivals for the 2020 presidency.\n\n\"You really have to elect me. Whether you like me or not, it makes no difference, because our country will go to hell if any of these people get in,\" Trump told a conference of Republican House lawmakers.\n\nThe alternative, Trump said, was a Democratic president who would \"take your money and very much hurt your families.\"\n\nRead more: Joe Biden accidentally called Bernie Sanders 'the president' during the Houston Democratic debate\n\nDuring the rambling 68-minute-long speech in which he repeatedly veered off-script to ad-lib, the president rolled out a series of attacks and taunts at leading Democrats contending for the presidential nomination familiar from past speeches.\n\nDemocratic presidential candidate former Vice President Joe Biden answers a question Thursday, Sept. 12, 2019, during a Democratic presidential primary debate hosted by ABC at Texas Southern University in Houston. David J. Phillip/AP\n\nAt one point in the speech he claimed that President Xi Jinping of China would take advantage of \"sleepy\" Joe Biden, the Democratic frontrunner, to help secure China's economic growth at America's cost.\n\n\"Here's Xi ... huh!\" Trump shouted, holding up his fists in imitation of China's leader.\n\n\"And here's Sleepy Joe: 'Wha? Where am I? Where am I?'\" he said, mocking Biden.\n\nTrump said Xi would then say: \"'Just sign here, sleepy Joe.'\"\n\nTrump also ridiculed Democratic contender Pete Buttigieg's name, mockingly pronouncing every syllable in the word, saying: \"Boot-edge-edge.\"\n\n\"I've had him up to here,\" Trump then said while gesturing to his chest in an apparent jibe at Buttigieg's height.\n\nRead more: Business Insider's coverage of Thursday's Democratic debate\n\nElizabeth Warren AP Photo/David J. Phillip\n\nTrump acknowledged Senator Elizabeth Warren's rise in polls, which has seen her overtake Bernie Sanders to become the second most popular candidate behind Biden in some surveys.\n\n\"I hit Pocahontas way too early,\" said Trump, using a derogatory nickname he has adopted for the senator based on a dispute over her Native American heritage.\n\n\"I thought she was gone. She's emerged from the ashes and now it looks like she could beat Sleepy Joe, he's falling asleep. He has no idea what the hell he's doing or saying,\" Trump said.\n\nTrump says his economic record will ensure he is reelected\n\nTrump went on to say that his record on the economy would ensure he is victorious in 2020.\n\n\"I wonder if that will be mentioned tonight during the debate. I don't know. I have feeling … I don't know. What do you think Steve? Kevin, do you think they'll be talking about that? I don't think so,\" Trump said addressing House Minority Whip Steve Scalise and House Minority Leader Kevin McCarthy.\n\n\"That's a good debate point,\" he said. \"As they hit me left and right, I'll say, 'African American unemployment is the lowest it's ever been,' and just leave the stage and say: 'Thank you very much. Good luck.'\"\n\nTrump's speech in Baltimore was the first appearance in the city since he attacked it in June as a \"disgusting rat and rodent infested mess.\"\n\nRead more: A giant rat balloon with features resembling Trump greeted Republicans for the president's visit to Baltimore\n\nIn remarks to reporters hours before launching into insult-laden speech, Trump said he did in fact respect the Democrats running for the presidency.\n\n\"I respect all of them. I respect every one. Let me tell you, it takes a lot of courage to run for office. I respect all of them. See that? I'm getting to be much better as a politician. You never thought you'd hear that answer,\" Trump said.", "description": "President Trump in a speech in Baltimore mocked and insulted the Democrats debating that night in the presidential primary.", "authors": ["Tom Porter"], "top_image": "https://amp.businessinsider.com/images/5d7b7e3c2e22af05d57c7e09-1920-960.jpg", "published_at": "2019-09-13"}