{"pub": "japantoday", "url": "https://japantoday.com/category/world/saturday-drama-brexit-battle-to-be-decided-in-uk-parliament", "downloaded_at": "2019-10-18 01:05:59.081797+00:00", "title": "Saturday drama: Brexit battle to be decided in UK Parliament", "language": "en", "text": "Tourists sheltering underneath a British Union flag umbrella walk across Westminster Bridge in the rain towards the Houses of Parliament in London, Thursday.\n\nBy GREGORY KATZ and MIKE CORDER\n\nBritish Prime Minister Boris Johnson, who has lost every important vote in Parliament since taking office, faces a titanic struggle Saturday when he puts his Brexit deal with the European Union before suspicious legislators.\n\nJohnson is gambling his political fortunes on being able to win a majority in favor of the Brexit deal reached Thursday between the British government and the other 27 European Union nations.\n\nShould lawmakers back the deal, then Britain will be on course to leave the EU on the scheduled Brexit date of Oct 31.\n\nBut that's no easy task for Johnson.\n\nWith 288 members in the House of Commons, his Conservative Party does not have a majority in the 650-member chamber. As a result, Johnson will be reliant on the support of those from other parties and independent lawmakers to get over the line. That's even more difficult now that Johnson's allies in Parliament, the 10 members of Northern Ireland's Democratic Unionist Party, have rejected his deal as bad for the region.\n\nArguably Johnson has a better chance of getting his deal over the line than his predecessor, Theresa May, did, as many pro-Brexit Conservative Party members appear ready to back him.\n\nOne of the main reasons why May saw her own deal with the EU voted down by legislators on three separate occasions earlier this year — by 58 votes the last time — was because members of the so-called European Research Group within the Conservative Party voted against. All but a handful of those ERG members are thought to be ready to give their support to Johnson's deal.\n\nJean-Claude Juncker, the president of the EU's executive Commission, piled more pressure on British lawmakers by suggesting that no further extension needs to be granted now that there is a deal.\n\nThough that power lies in the hands of the 27 EU leaders, his comments appeared designed to cast Saturday's vote as a stark choice for UK legislators — between Johnson's proposal or a risky \"no-deal\" departure on Oct 31. Scrapping Brexit altogether is another — albeit unlikely — option favored by the pro-European Liberal Democrats.\n\nJuncker and Johnson seem to be gambling that widespread concerns about a \"no-deal\" split, which the British government concedes would cause a marked economic slowdown and possible food and medicine shortages, may soften opposition to the new plan.\n\nKallum Pickering, senior economist at Berenberg, said Juncker's comments \"on balance probably raises the chances for Boris Johnson to get a deal through\" by convincing some opposition legislators that backing the plan is the only way to avoid a dangerous \"no-deal\" split.\n\n\"Johnson has a chance but it is going to be tight,\" Pickering said.\n\nUnless Northern Ireland's DUP has a change of heart, the deal's fate could largely rest on members from the main opposition Labour Party, which has 244 members. Around 20 of them, mainly representing pro-Brexit parts of the country, have previously indicated a desire to back a deal in order to honor the June 2016 Brexit referendum result.\n\nMost Labour members will vote against after the party's leader Jeremy Corbyn expressed his disapproval of the deal. The Scottish National Party's 36 members and the 19 Liberal Democrats will vote against too.\n\nLondon School of Economics analyst Tony Travers said Johnson will also need the support of some of the Conservative Party members who had been punished for voting against the government in earlier Brexit votes.\n\n\"It is going to be much, much tighter than any of Theresa May's votes,\" he predicted of Saturday's faceoff. \"It's going to be three, four, five (votes) either way.\"\n\nAnother potential complication in Saturday's vote may come if opposition lawmakers try to amend the proposal so that approval could only come if the public support the deal in a referendum. The EU has previously indicated that it would grant an extension for a so-called \"democratic event.\"\n\nDavid Lammy, a lawmaker with the opposition Labour Party, played down the significance of Juncker's comments.\n\n\"It is not within Jean-Claude Juncker's powers to rule out an extension if we vote down Boris Johnson's deal on Saturday,\" Lammy tweeted. \"It's up to the Council of EU27 leaders who will grant an extension.\"\n\n© Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "British Prime Minister Boris Johnson, who has lost every important vote in Parliament since taking office, faces a titanic struggle Saturday when he puts his Brexit deal with the European Union before suspicious legislators. Johnson is gambling his political fortunes on being able to win a majority in favor of…", "authors": ["Chip Star", "No Business"], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/12/19/1ce7ec2672c86952bf83b646196519cd5bbb/urn:publicid:ap.org:974b4af264e14330a91e080218dad922.jpg", "published_at": "2019-10-17"}