{"pub": "marketwatch", "url": "https://marketwatch.com/story/check-out-the-under-armour-spacesuit-being-worn-by-virgin-galactics-first-space-tourists-2019-10-16", "downloaded_at": "2019-10-16 20:47:05.858428+00:00", "title": "Check out the Under Armour spacesuit being worn by Virgin Galactic’s first space tourists", "language": "en", "text": "Under Armour has boldly gone from dressing athletes to outfitting astronauts.\n\nThe sportswear company was tapped to design the spacesuits for Virgin Galactics’ space tourists, who are set to blast into suborbital space flight next year.\n\nRead more: Virgin Galactic test flight soars 50 miles high, opening space tourism era\n\nThe brands revealed the high-tech “spacewear system” in New York on Wednesday, which consists of a “deep space blue” base layer, a jumpsuit and boots trimmed with light blue elements and pops of gold.\n\nUnder Armour Under Armour revealed its Virgin Galactic spacesuit for the world’s first private astronauts.\n\nUnder Armour UA, -0.54% kept safety, comfort and functionality in mind, it explained in a press release. Designers consulted with astronaut trainers, pilots, doctors and stylists to craft a versatile suit capable of providing cushioning or compression as needed during both the high gravity and zero gravity portions of the flight. It can also regulate body temperature and wick away sweat, and each suit will be custom-made and tailored to each astronaut so that everything fits just right.\n\nDefining the future of spacewear. In partnership with @virgingalactic, we used our most groundbreaking and iconic fabric technology to create a suite of products for Future Astronauts. Learn more 👉 https://t.co/EyAmL6Qgt7 pic.twitter.com/ZcKapZUhu6 — Under Armour (@UnderArmour) October 16, 2019\n\nThe suit also includes personal touches, such as a removable patch unique to each mission, which the explorer can put on his or her souvenir flight jacket once they get back down to Earth. Each suit will also have a patch representing the passenger’s country, a name badge, as well as a clear pocket on the inside of the jacket, above the heart, to keep a photo of a loved one or some other memento during the trip.\n\nUnder Armour Under Armour revealed its Virgin Galactic spacesuit for the world’s first private astronauts.\n\nBeth Moses, the chief astronaut instructor and interiors program manager for Virgin Galactic’s SpaceShipTwo operations, said during the launch event that the suits were built to “enjoy and savor space on your own terms in your own way.”\n\nDancing in weightlessness. The world’s first exclusive spacewear system for private astronauts, designed by @UnderArmour in collaboration with @VirginGalactic. https://t.co/FpH4SIjvO0 pic.twitter.com/msXsBulHUi — Virgin Galactic (@virgingalactic) October 16, 2019\n\nVirgin Galactic’s spacecraft, which may blast off as early as next spring, can carry two pilots and up to six passengers. The ship will be dropped from a jet-powered aircraft at 40,000 feet, where it will fire up its rocket motor to climb through the Earth’s atmosphere at more than three times the speed of sound to reach the edge of space. The spacecraft and its passengers will be weightless for about 10 minutes before gliding back down to Earth. Tickets run about $250,000 per person, and some 600 people have already reserved a seat.\n\nRead more: Virgin Galactic unveils its New Mexico base for space tourism\n\nWhile the spacesuits are only intended for Virgin Galactic’s future astronauts, and will not be for sale to the general public, you can still get a piece of the action. Under Armour revealed limited edition T-shirts for $35 on UA.com on Wednesday, and a rep told MarketWatch that there will be a capsule collection in 2020 that will feature flight jackets, base layer pieces and hoodies.", "description": "Don’t have $250,000 to go to space? You can get a limited edition Under Armour T-shirt for $35.", "authors": ["Nicole Lyn Pesce"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT441_UASpac_ZG_20191016152232.jpg", "published_at": "2019-10-16"}