{"pub": "breitbart", "url": "https://breitbart.com/news/kremlin-ups-pressure-on-navalny-says-opposition-group-foreign-agent", "downloaded_at": "2019-10-09 12:05:08.988380+00:00", "title": "Kremlin ups pressure on Navalny, says opposition group ‘foreign agent’", "language": "en", "text": "Moscow (AFP) – Russia on Wednesday upped the pressure on opposition leader Alexei Navalny, declaring his organisation a “foreign agent” that will be subject to increased state monitoring.\n\nNavalny’s Anti-Corruption Foundation (FBK), which often publishes investigations into state officials, will now have to present itself as a “foreign agent” on official documents.\n\nRussia started a controversial list of foreign agent organisations, which in Russian implies spying for a foreign government, in 2012. This has led to many of the groups closing down.\n\nNavalny called the move “absolutely illegal” and said it was “obviously a direct order from (President Vladimir) Putin.”\n\n“FBK never received a single kopeck of foreign money,” he wrote on Twitter.\n\nHe demanded that the justice ministry publicly prove that the foundation received funds from outside Russia.\n\nFBK, which has often been raided by authorities, said the move was an attempt to curb its activity.\n\nIts director Ivan Zhdanov said it was “another attempt to suffocate” the foundation.\n\nHe said the group, which seeks donations from the public, is funded “exclusively by Russian citizens.”\n\n– ‘Attempt to stop activity’ –\n\nNavalny’s spokeswoman Kira Yarmysh wrote on Twitter that the decision was intended to “put pressure on us and attempt to stop our activity.”\n\nWhile barred from mainstream politics, Navalny has kept trying to expose the lavish wealth of Russia’s elites, broadcasting the findings of his investigations to millions of Russians on social media and YouTube.\n\nThis has helped Navalny, a Yale-educated lawyer, win a young fan base in the country.\n\nIn August, Russian investigators launched a money-laundering probe into FBK, accusing it of taking money that was procured illegally.\n\nLast month, investigators raided dozens of Navalny’s regional offices, as well as the homes of his supporters following mass opposition protests in Moscow this summer.\n\nNavalny blamed the raids on Kremlin “hysteria” sparked by the ruling party’s losses in local elections last month. He said police searched more than 200 addresses in 41 cities across Russia.\n\nThe charismatic anti-corruption campaigner instructed supporters to vote strategically to block pro-Kremlin candidates in Moscow’s recent local election.\n\nAllies of Putin suffered major losses in the Russian capital during the September vote.\n\nNavalny organised the protests after popular opposition politicians were barred from standing in the Moscow parliament election.\n\nThe 43-year-old missed several of the demonstrations while serving a 30-day jail term for organising previous unauthorised rallies.\n\nSince emerging as the Kremlin’s chief critic and a highly effective campaigner and organiser, Navalny has faced repeated legal action apparently aimed at hindering his activities.\n\nHe has often been jailed and physically attacked, but has vowed to press ahead with his campaign to change Russia.\n\nHe was barred from challenging Putin on the ballot box in Russia’s 2018 presidential election.\n\nHe nonetheless toured Russia ahead of the vote in an American-style campaign to rally his supporters, and set up headquarters across the country.\n\nPutin has refused to pronounce Navalny’s name in public.", "description": "Moscow (AFP) – Russia on Wednesday upped the pressure on opposition leader Alexei Navalny, declaring his organisation a “foreign agent”", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/09/55678a_russian-opposition-leader-alexei-navalny-has-faced-repeated-legal-action-640x335.jpg", "published_at": "2019-10-09"}