{"pub": "chinadaily", "url": "https://language.chinadaily.com.cn/a/201910/11/WS5d9fd57ea310cf3e3556fd6f.html", "downloaded_at": "2019-10-11 04:00:00.562326+00:00", "title": "Chinadaily.com.cn", "language": "en", "text": "小测验 — 混合条件句的用法\n\n英语中的混合条件句（mixed conditionals）或错综时间条件句指同一句话中包含两种不同时态的句子，分别用来谈论不同时间所发生的事情。混合条件句可以表达两类情况：第一类用来描述一种与过去相反的情况所导致的现在可能发生的结果；第二类用来描述一种与真实情况相反从而导致的与过去相反的可能结果。\n\n混合条件句通常由表示事与愿违的虚拟条件句（third conditional）和表现在或未来情况的虚拟条件句（second conditional）的相应成分组成。比如：If I hadn't graduated from university, I wouldn't be who I am now. 如果我大学没毕业，就不会成为现在的自己。前半句使用了过去完成时，表示与过去相反的情况；后半句使用 “would (not) + 动词原形” 的结构，表示现在有可能发生的结果。做八道题，看看你能否选出时态正确且句意通顺的混合条件句。\n\n1. Which of the following sentences uses the correct form of the mixed conditional?\n\na) If Annika will tune her guitar, the sound would be so beautiful.\n\nb) If Annika had been tuning her guitar, the sound could be so beautiful.\n\nc) If Annika hadn’t tuned her guitar, the sound wouldn’t be so beautiful.\n\nd) If Annika wasn’t tuning her guitar, the sound would be so beautiful.\n\n2. Which of the following sentences uses the correct form of the mixed conditional?\n\na) If I hadn’t married an American, I wouldn’t be living in America.\n\nb) If I hadn’t married an American, I wouldn’t have been living in America.\n\nc) If I was going to marry an American, I could be living in America.\n\nd) If I didn’t marry an American, I wouldn’t have lived in America.\n\n3. Which of the following sentences uses the correct form of the mixed conditional?\n\na) If I studied history at university, I could have been a history lecturer.\n\nb) If I was studying history at university, I could be a history lecturer.\n\nc) If I had been studying history at university, I could be a history lecturer.\n\nd) If I had studied history at university, I could be a history lecturer.\n\n4. Which of the following sentences uses the correct form of the mixed conditional?\n\na) If his hearing wasn’t being so bad, he would have heard the doorbell.\n\nb) If his hearing was so bad, he would have heard the doorbell.\n\nc) If his hearing wasn’t so bad, he would have been hearing the doorbell.\n\nd) If his hearing hadn’t been so bad, he would hear the doorbell.\n\n5. Which of the following sentences uses the correct form of the mixed conditional?\n\na) If my manager wasn’t such a good leader, he wouldn’t have understood how to motivate everyone on the new project.\n\nb) If my manager hadn’t have been such a good leader, he wouldn’t have understood how to motivate everyone on the new project.\n\nc) If my manager won’t have been such a good leader, he wouldn’t have understood how to motivate everyone on the new project.\n\nd) If my manager wasn’t such a good leader, he wouldn’t have been understanding how to motivate everyone on the new project.\n\n6. Which of the following sentences uses the correct form of the mixed conditional?\n\na) If Chang wasn’t being interested in justice, he wouldn’t have studied law at university.\n\nb) If Chang wasn’t interested in justice, he won’t have studied law at university.\n\nc) If Chang wasn’t interested in justice, he wouldn’t have been studying law at university.\n\nd) If Chang wasn’t interested in justice, he wouldn’t have studied law at university.\n\n7. Which of the following sentences uses the correct form of the mixed conditional?\n\na) If Chu had passed her driving test, she would be buying a car.\n\nb) If Chu had passed her driving test, she would to buying a car.\n\nc) If Chu had been passing her driving test, she would buy a car.\n\nd) If Chu would have passed her driving test, she would buy a car.\n\n8. Which of the following sentences uses the correct form of the mixed conditional?\n\na) If I hadn’t been so angry, I wouldn’t have shouted at him.\n\nb) If I wasn't so angry, I would have shouted at him.\n\nc) If I won't be angry, I could have shouted at him.\n\nd) If I hadn't been so angry, I won't be shouting at him.\n\n答案\n\n1) c, 2) a, 3) d, 4) b, 5) a, 6) d, 7) a, 8) a.", "description": "英语中的混合条件句（mixed conditionals）或错综时间条件句指同一句话中包含两种不同时态的句子，分别用来谈论不同时间所发生的事情。", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/11/5d9fd57ea310cf3e97a0936c.jpeg", "published_at": "2019-10-11"}