{"pub": "yahoo", "url": "https://news.yahoo.com/graham-van-hollen-announce-bipartisan-221058638.html", "downloaded_at": "2019-10-10 18:52:12.782641+00:00", "title": "Graham, Van Hollen Announce Bipartisan Deal on Sanctions against Turkey", "language": "en", "text": "Senator Lindsey Graham (R., S.C.) announced Wednesday afternoon that he had reached bipartisan agreement with Senator Chris Van Hollen (D., Md.) on a package of severe sanctions against Turkey in the wake of the Turkish invasion of northern Syria.\n\n“While the Administration refuses to act against Turkey, I expect strong bipartisan support,” Graham said in unveiling the package on Twitter, a day after he called President Trump’s decision to withdraw troops from Syria the worst mistake of his presidency.\n\nI am pleased to have reached a bipartisan agreement with Senator @ChrisVanHollen on severe sanctions against Turkey for their invasion of Syria. While the Administration refuses to act against Turkey, I expect strong bipartisan support. pic.twitter.com/Ph5fIVt7k3 — Lindsey Graham (@LindseyGrahamSC) October 9, 2019\n\n\n\n\n\nThe sanctions package, which targets the travel visas and U.S.-held assets of Turkish leaders (including President Recep Tayyip Erdogan, who is slated to visit the White House Nov. 13), Turkish military transactions, and the Turkish energy sector, was first revealed to be in the works on Monday, after Trump made clear that the U.S. would not stand in the way of Turkey’s invasion even though it disapproved of what that country is calling Operation Peace Spring.\n\nErdogan announced on Wednesday that Turkey had commenced the operation.\n\n#OperationPeaceSpring will neutralize terror threats against Turkey and lead to the establishment of a safe zone, facilitating the return of Syrian refugees to their homes. We will preserve Syria’s territorial integrity and liberate local communities from terrorists. — Recep Tayyip Erdoğan (@RTErdogan) October 9, 2019\n\n\n\n\n\nIn the face of backlash from both Democrats and Republicans over his handling of the situation, Trump has repeatedly indicated he could sanction Turkey if he feels the operation has gone poorly.\n\n“I think Lindsey [Graham] would like to stay there for the next 200 years and maybe add a couple hundred thousand people every place, but I disagree with Lindsey on that,” Trump told reporters at the White House on Wednesday. “But I will tell you that I do agree on sanctions, but I actually think [we’ll need something] much tougher than sanctions if [Erdogan] doesn’t [conduct the operation] in as humane a way as possible.”\n\nMore from National Review", "description": "Senator Lindsey Graham (R., S.C.) announced Wednesday afternoon that he had reached bipartisan agreement with Senator Chris Van Hollen (D., Md.) on a package of severe sanctions against Turkey in the wake of the Turkish invasion of northern Syria.“While the Administration refuses to act against Turkey", "authors": ["Tobias Hoonhout"], "top_image": "https://s.yimg.com/uu/api/res/1.2/DuvbjsfpiGq9lHx0Kw.7MA--~B/aD01OTc7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/32f92a736345c864d78d20b7cf73f207", "published_at": "2019-10-09"}