{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/sep/14/us-drug-companies-seek-removal-of-judge-set-to-preside-over-opioids-trial", "downloaded_at": "2019-09-15 00:09:30.614489+00:00", "title": "US drug companies seek removal of judge set to preside over opioids trial", "language": "en", "text": "Petition claims Judge Dan Polster’s ‘unusual level of commitment’ to reaching a settlement in the case had affected his decision-making\n\nUS drug companies are seeking the removal of the judge set to preside over a landmark trial in which it will be claimed deceptive marketing and a lack of oversight helped fuel the opioid addiction crisis.\n\nDrug makers conspired to worsen the opioid crisis. They have blood on their hands | Chris McGreal Read more\n\nA 39-page petition filed in the early hours of Saturday claimed that US district judge Dan Polster’s “unusual level of commitment” to reaching a settlement in the case had affected his decision-making, leading him to turn “a blind eye to the law”.\n\nThe request comes after a series of rulings against the drug industry ahead of the trial scheduled to begin in Cleveland, Ohio on 21 October.\n\nThe case joins together more than 2,000 lawsuits brought by towns and communities against some of the largest US drug makers and sellers, including Oxycontin-maker Purdue Pharma and distributors such as Cardinal Health, Walmart, Walgreens, CVS and Rite Aid.\n\n“Defendants do not bring this motion lightly,” the lawyers wrote. “Taken as a whole and viewed objectively, the record clearly demonstrates that recusal is necessary.”\n\nThe filing claims Polster overstepped his authority by urging the two sides to settle, so communities affected by the prescription opioid epidemic, which has killed more than 200,000, can receive money for treatment, overdose prevention and other anti-addiction services.\n\nLast week, Polster gave his approval for the litigants to negotiate with the defendants, which have denied legal wrongdoing. He previously denied attempts by drug companies have the lawsuits dismissed.\n\nIn the filing to the court in Cleveland, where the lawsuit filed by Cuyahoga and Summit counties will be heard, the defendants focused on Polster’s statements to the court.\n\n“My objective is to do something meaningful to abate this crisis,” Polster was quoted as saying, as well as claiming that doing “something meaningful” meant “dramatically reducing the number of opioids that are being disseminated, manufactured and distributed … and (assuring) that we get some amount of money to the government agencies for treatment.”\n\nThe lawyers for the drug industry claimed “the court’s deep involvement in settlement discussions requires its disqualification from any bench trial of equitable remedies. Together, these factors more than raise a reasonable question about the court’s impartiality”.\n\nIn a statement on Saturday, lawyers for the plaintiffs said the motion was “simply a desperate move on the eve of trial by opioid companies that created, fueled and sustained the crisis following rulings by the court concluding that there is sufficient evidence to find that these companies created a public nuisance and conspired together to avoid regulation and sanctions”.\n\nCarl Tobias, a law professor at the University of Richmond, said the whole purpose of joining together thousands of lawsuits was to encourage a settlement.\n\n“Polster is likely to deny the motion,” he predicted, “which will then be appealed, delaying the start of the trial. The defendants are saying Polster pre-judged the outcome through his public statements and in all he’s done. But trying to move it toward settlement is what Congress intended in this kind of situation.”\n\nThe Cleveland trial comes at a crucial time in attempts to hold the drug industry responsible for the opioid crisis.\n\nThe UK-based opioid manufacturer Mallinckrodt has agreed a tentative settlement with Cuyahoga and Summit counties, worth $30m. The company has agreed to pay $24m in cash and to donate $6m in medication to both counties, in exchange for the dismissal of all claims against it.\n\nLast week, a settlement with Purdue Pharma, valued at $10bn-12bn, was accepted by 27 state attorneys general. At least 20 rejected the deal.\n\nConnecticut attorney general William Tong told the Guardian his state rejected the settlement because “the scope and scale of the pain, death and destruction that Purdue and the Sacklers [the family which owns Purdue] have caused far exceeds anything that has been offered thus far”.\n\nAmerica’s opioid catastrophe has lessons for us all, about greed and racial division | Kenan Malik Read more\n\nHe said Connecticut was committed “to holding Purdue and the Sacklers accountable for the crisis they have caused”.\n\nAnti-opioid campaigner and artist Nan Goldin said the company and the family had not done enough to make amends for their alleged role in flooding communities with prescription painkillers. Goldin told the Guardian Purdue’s offer to partially meet the cost of the settlement from future sales of OxyContin was the “height of cynicism”.\n\nA federal government filing in a New York court, meanwhile, revealed that the Sackler family used Swiss bank accounts to conceal the transfer of $1bn from Purdue Pharma to themselves. New York, Massachusetts and others claim the Sacklers have drained more than $4bn from Purdue since 2007, moving much of it offshore.\n\n“It is elementary … that how the Sacklers moved and tried to hide their money will be key evidence of the liability of all of the participants,” a lawyer for the New York attorney general wrote.", "description": "Petition claims Judge Dan Polster’s ‘unusual level of commitment’ to reaching a settlement in the case had affected his decision-making", "authors": ["Edward Helmore"], "top_image": "https://i.guim.co.uk/img/media/fe42dacae735f9648a5b9f307c845afc45a0a18f/0_136_4728_2838/master/4728.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=787a1c53602ce4d66a3714e5c67c0097", "published_at": "2019-09-14"}