{"pub": "politico", "url": "https://politico.com/news/2019/10/20/jewish-attacks-pittsburgh-052868", "downloaded_at": "2019-10-21 02:23:09.253199+00:00", "title": "Synagogue massacre led to string of attack plots, Jewish group says", "language": "en", "text": "The ADL said its Center on Extremism provided “critical intelligence” to law enforcement in at least three of the 12 cases it counted.\n\nLast December, authorities in Monroe, Washington, arrested a white supremacist after the ADL notified law enforcement about suspicions he threatened on Facebook to kill Jews in a synagogue. The ADL said it also helped authorities in Lehighton, Pennsylvania, identify a white supremacist accused of using aliases to post threatening messages, including a digital image of himself pointing an AR-15 rifle at a group of praying Jewish men.\n\nIn August, an FBI-led anti-terrorism task force arrested a Las Vegas man accused of plotting to firebomb a synagogue or other targets, including a bar catering to LGTBQ customers and the ADL’s Las Vegas office. The ADL said it warned law enforcement officials about the man’s online threats.\n\n“We cannot and will not rest easy knowing the threat posed by white supremacists and other extremists against the Jewish community is clear and present,” the group’s CEO, Jonathan Greenblatt, said in a statement.\n\nThe ADL said it counted at least 30 additional incidents in which people with an “unknown ideology” targeted Jewish institutions with acts of arson, vandalism or propaganda distribution that the group deemed to be anti-Semitic or “generally hateful,” but not explicitly white supremacist.\n\n“These incidents include the shooting of an elderly man outside a synagogue in Miami, fires set at multiple Jewish institutions in New York and Massachusetts, Molotov cocktails thrown at synagogue windows in Chicago, damaged menorahs in Georgia and New Jersey, as well as a wide range of anti-Semitic graffiti,” an ADL report said.\n\n", "description": "", "authors": ["-", "Jonathan Greenblatt Of The Anti-Defamation League"], "top_image": "https://static.politico.com/a9/94/a4ecc90f4e73a74608cb319bed6e/20191020-synagogue-memorial-gty-773.jpg", "published_at": "2019-10-20"}