{"pub": "marketwatch", "url": "https://marketwatch.com/story/banks-look-to-put-earnings-recession-in-reverse-but-arent-expected-to-succeed-2019-10-14", "downloaded_at": "2019-10-15 00:03:17.005785+00:00", "title": "Banks look to put earnings recession in reverse, but aren’t expected to succeed", "language": "en", "text": "Amid the first earnings recession in two years, a new round of financial results are about to flood in and determine if the downturn will continue.\n\nEarnings for the S&P 500 index SPX, -0.14% have declined year-over-year in each of the first two quarters of the year, creating the first earnings recession since 2017. The decline is expected to continue and even accelerate with third-quarter results, which largely launch this week.\n\nFor more: Five things to know this earnings season\n\nSo far, fewer than 25 S&P 500 companies have reported earnings this quarter, but more than 50 are expected to report this week, with banks leading the way. JP Morgan Chase & Co. JPM, +0.27% , Goldman Sachs Group Inc. GS, +0.56% , Citigroup Inc. C, +0.20% and Wells Fargo & Co. WFC, +0.12% are all scheduled to release earnings Tuesday morning, while Bank of America Corp. BAC, +0.80% earnings are scheduled for Wednesday and Morgan Stanley MS, +0.76% on Thursday.\n\nBanks have been a positive for earnings through the first half of the year, with earnings for the financials sector growing more than 5% in the second quarter and more than 2% in the first quarter. That trend is expected to reverse, however, with analysts on average projecting a decline of more than 3% when this quarter’s results are all in.\n\nRead also: The good times are coming to an end for bank earnings\n\nThe Federal Reserve made a pair of cuts to the federal funds rate that reduces net interest income for lenders, which is expected to hurt banks’ results. The banks also suffered from a weak IPO market, with Evercore ISI analyst Glenn Schorr pointing out that deal volume dropped 17% in the period while deal counts fell 30%. Underwriting picked up in September a bit, he said, but it probably wasn’t a saving grace for the September quarter.\n\nGoldman and J.P. Morgan are two of seven Dow Jones Industrial Average DJIA, -0.11% components expected to report this week, nearly a quarter of the index. UnitedHealth Group Inc. UNH, -0.67% and Johnson & Johnson JNJ, -0.46% are also expected to report Tuesday, as UnitedHealth deals with concerns about “Medicare for All” proposals endorsed by some Democratic presidential hopefuls and J&J faces legal challenges on numerous fronts. International Business Machines Corp. IBM, -0.50% follows on Wednesday, and Coca-Cola Co. KO, +0.00% and American Express Co. AXP, -0.01% wrap up the week on Friday.\n\nIBM earnings preview: Focus shifts back to legacy revenue as Red Hat settles in\n\nIBM is one of only two prominent tech companies to report this week, but the other name will probably get more attention on Wednesday. Netflix Inc. NFLX, +0.92% faces the ultimate show-me quarter following a rough report three months ago and as the company awaits the launch of new streaming services from Apple Inc. AAPL, -0.14% , Walt Disney Co. DIS, -0.25% and others in the weeks and months to come.\n\nSee: As Netflix earnings near, here comes an onslaught of competition — and content\n\nExpectations aren’t particularly high for Netflix heading into the report. The company projected 6.2 million net new paying subscribers internationally, but analysts surveyed by FactSet project less than 6.1 million. The consensus forecast is about even with the company’s own expectations for 800,000 net additions on the domestic side, which itself would be a welcome reversal from last quarter, when Netflix managed to actually lose subscribers domestically.\n\nJoining Netflix and IBM on Wednesday will be United Airlines Holdings Inc. UAL, -0.21% , which should give an early indication of how airlines performed through the summer. Philip Morris International Inc. PM, +0.10% will follow on Thursday after a potential merger with rival Altria Group Inc. MO, +0.35% fell through.\n\nFor more: These 5 prominent U.S. companies are most at fault for the earnings recession", "description": "Amid the first earnings recession in two years, a new round of financial results are about to flood in and determine if the downturn will continue.", "authors": ["Jeremy C. Owens", "Emily Bary", "Technology Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HH529_jpm041_ZG_20190412124815.jpg", "published_at": "2019-10-14"}