{"pub": "cbs", "url": "https://cbsnews.com/news/julian-castro-2020-castros-campaign-manager-says-fundraising-email-is-not-a-threat-to-quit", "downloaded_at": "2019-09-29 23:31:13.029048+00:00", "title": "Julián Castro's campaign manager says fundraising email not \"a threat to quit\"", "language": "en", "text": "Julián Castro's campaign manager Maya Rupert shot down reports that the former Obama housing chief would end his presidential bid if he's unable to qualify for the fifth Democratic debate.\n\n\"I think that was unfortunately hyperbolic writing in a fundraising email,\" Maya Rupert, who leads Castro's campaign, told CBS News.\n\n\"I don't say this lightly: if I don't make the next debate stage, it will be the end of my campaign,\" Castro had written in an email to supporters last Thursday, sparking a flurry of headlines.\n\nRupert claimed the email had been misinterpreted by some as \"a threat to quit,\" insisting that Castro could \"absolutely\" continue his presidential bid even if he fails to qualify for the November debate, which has a higher polling and donor threshold.\n\n\"The point that we were really making is a point that we make consistently throughout this campaign, which is that for a candidate like Julián that doesn't have the name ID that some of the other candidates have, these debates are a huge opportunity,\" she explained, saying the campaign is confident it can meet the Democratic National Committee's new requirements.\n\nCastro's campaign manager sat down with CBS News following an office opening last week in Reno, during a swing through northern Nevada.\n\nHer first stop in the state was to local non-profit Eddy House, which targets Reno's at-risk children and teenagers. The campaign has long made housing and homelessness a focus in its visits to the state, touring encampments existing underneath Las Vegas and serving meals to the homeless.\n\nRupert frequently cited her experience working with Castro as a top adviser in the U.S. Department of Housing and Urban Development (HUD), while touring Eddy House and meeting a roundtable of homeless Nevadans at the facility.\n\n\"So many people, so many families, are struggling with that as an issue and people aren't talking about it. And so I think that's something that he's uniquely able to, brings a unique perspective to, obviously as having run HUD,\" Rupert said later.\n\nDespite a number of visits to the state, Castro has garnered scant support in recent polls in the \"first in the West\" caucus. Just 11 percent of Nevada Democrats said they were even considering supporting Castro, in a CBS News Battleground Tracker poll earlier this month.\n\nHowever, the candidate has scored a roster of endorsements outstripping some of the larger and better-funded operations in the state (Castro has just four staffers on payroll in the state), especially in rural Nevada.\n\n\"Everyone on the team is looking for who is not at the table, who is being left out of the conversation, what community has not gotten a visit from a presidential candidate before,\" explained Rupert.\n\nIn July, West Wendover Mayor Daniel Corona announced his support for Castro after the candidate became the first to ever campaign in the northern Nevada town.\n\n\"Even up until 2018, we hadn't even had statewide candidates come,\" Corona told CBS News, noting that only Castro and Elizabeth Warren's organizers have visited the town of 4,300.\n\n\"He's part of the reason I got into politics. Following his and Joaquin's journey through politics inspired me,\" Corona said.", "description": "The former Housing and Urban Development secretary will not be shutting down his campaign if he doesn't qualify for the fifth Democratic primary debate, according to Maya Rupert", "authors": ["Alexander Tin"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/29/edbf29d9-c5eb-4ebc-81a8-e7c3fef691ab/thumbnail/1200x630g2/2ed2223b14f33547ccb252672620072f/gettyimages-1145691804.jpg", "published_at": "2019-09-29"}