{"pub": "thestreet", "url": "https://realmoney.thestreet.com/investing/stocks/a-rally-in-mgm-resorts-does-not-look-like-a-roll-of-the-dice-15128305", "downloaded_at": "2019-10-16 13:46:36.016994+00:00", "title": "A Rally in MGM Resorts Does Not Look Like a Roll of the Dice", "language": "en", "text": "MGM Resorts International (MGM) was deemed \"an incredibly well-run company\" by Jim Cramer as he responded to a caller during last Friday's \"Mad Money\" program. Let's check and see if the charts and indicators are also well-run.\n\nIn this daily bar chart of MGM, below, we can see that prices have not made much upside progress in the past 12 months.The slope of the shorter 50-day moving average line is negative or bearish now, but the slope of the slower-to-react 200-day line has turned from down to up over the past year. The On-Balance-Volume (OBV) line has been in an uptrend from December of last year and tells us that despite the sideways price action buyers of MGM have been more aggressive. The trend-following Moving Average Convergence Divergence (MACD) oscillator just turned up, giving us a cover shorts buy signal.\n\nIn this weekly bar chart of MGM, below, we can see the past three years of price action. Prices declined in 2018 but have built a base in 2019, in my opinion. Prices are right on the rising 40-week moving average line. The weekly OBV line has been improving the past six months and signals that buyers of MGM have been more aggressive. Buyers typically get aggressive when they anticipate higher prices ahead. The MACD oscillator is above the zero line in positive territory and further price strength is likely to turn the indicator to the upside and a fresh buy signal.\n\nIn this Point and Figure chart of MGM, below, we can see that the software has projected an upside price target of $31.45. A trade at $31.65 would be an important upside breakout and probably precipitate further gains in the months ahead.\n\nBottom line strategy: The charts of MGM look ready to support a good rally. Aggressive traders could go long at current levels, risking below $26 for now. Add to longs on strength above $32.", "description": "A rally in MGM Resorts International (MGM) does not look like a roll of the dice, as its chart indicate more aggressive buying of the casino operator's shares in recent months....MGM", "authors": ["Bruce Kamich", "A Rally In Mgm Resorts Does Not Look Like A Roll Of The Dice", "The Charts Of The Casino", "Entertainment Giant Look Ready To Support A Good Rally", "With More Aggressive Buying Of Its Shares In Recent Months.", "Stocks Quotes In This Article", "Bret Jensen", "Jim Cramer", "Stephen Guilfoyle", "Bob Lang"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/817c1bd2-ebe2-11e7-8839-259fb9fd7416.png", "published_at": "2019-10-16"}