{"pub": "independent", "url": "https://independent.co.uk/voices/queens-speech-brexit-boris-johnson-election-crime-nhs-environment-a9155006.html", "downloaded_at": "2019-10-14 11:46:57.426707+00:00", "title": "This was a surreal Queen's Speech, pretending Brexit is in the bag just to kick off a Tory election campaign", "language": "en", "text": "The Queen’s Speech is normally an occasion for the government to go on the offensive and dominate the news agenda. Sure enough, today’s list of 26 bills looks meaty enough at first glance, and there was no shortage of confidence in the prime minister's message. Only Boris Johnson could talk about releasing “the talent, creativity, innovation and chutzpah that exists in every corner of our UK”.\n\nBut the backcloth made this speech nothing short of surreal. This is politics through the looking glass. The government is more than 40 short of a majority. There is little prospect of any even mildly controversial legislation being approved by the commons. If MPs are in the mood to make Johnson’s life difficult, they could defeat the entire speech in next week's vote on it.\n\nIn the real world, today's biggest story is the continuing talks in Brussels about a Brexit deal. You wouldn’t know that from hearing the speech. The first measure the Queen mentioned was the European Union (Withdrawal Agreement) Bill which will ensure “the UK leaves the EU with a deal on 31 October,” as the chancellor Sajid Javid repeated today in announcing the Budget will be on 6 November. Only one problem: there isn’t an agreement yet.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nEven if Johnson secures a deal, it might require a special EU summit after this week’s one, meaning there wouldn’t be time to rush the bill through before 31 October. A technical extension to UK membership would be needed. If Johnson doesn’t get a deal, he will be forced to swallow a three-month extension under the Benn Act.\n\nOf course, the speech is really the first draft of the Conservative Party’s general election manifesto. Crime, the NHS, schools, immigration and the cost of living will be the party’s main themes, and they were well represented today.\n\nThe heavy emphasis on law and order – a traditional Tory tune on which Team Boris feels the party is out of key – is seen as a direct line to the working class voters in the north and midlands whom Johnson will target. He didn’t choose a hardline home secretary in Priti Patel by accident. But the approach is one-sided; there's no mention in the seven criminal justice bills of the vital role rehabilitation could play in tackling our high rates of reoffending. It doesn’t fit the election script; longer sentences do.\n\nIn his parallel universe, Johnson might want an early election, whether or not he “gets Brexit done”, but there are growing signs he might have to wait. The likelihood of an extension is one reason. Another is the outbreak of cold feet spreading fast inside the Labour Party, as I wrote last week. So there’s a chance Johnson might struggle to get the two-thirds majority among MPs he needs for an election until next spring.\n\nThere are some good things in today’s package. The Environment Bill, including a new independent regulator, is to be welcomed. But the measures are not without controversy. Plans to require voters to show photographic ID at polling stations will mostly affect people such as younger voters, students and black and ethnic minority groups, all of whom are less likely to support the Tories.\n\nIf the government were serious about tackling the big challenges facing the country, the speech would have included a bill to address the social care crisis. There was a vague promise of “substantial proposals”, but the issue was again kicked into the long grass beyond the election, whenever it comes.\n\nAlthough the Budget rather than the speech is the time for government spending plans, perhaps Johnson should have announced a Finance (Magic Money Tree) Bill. He has already pledged an extra £13.8bn for the NHS, police, schools and social care; the spendometer at the Tory conference clocked up £50bn of promises.\n\nJohnson is desperate to show that the age of austerity is over. But some Tories worry they will lose their reputation for fiscal discipline, and should not “try to out-Corbyn Corbyn” as Labour will always outspend them.\n\nWhile Labour was right to attack the speech as “a pre-election party political broadcast,” it should take the threat from its core messages seriously as it draws up its own election strategy. Team Boris entered office with a plan, and the speech confirms it: get Brexit done, and then turn to the NHS, schools, crime, immigration and the cost of living.\n\nThe Vote Leave veterans who will run the Tory campaign, including Dominic Cummings, are very good at honing simple messages that connect with voters. They might come straight out of focus groups, but if that’s what people are saying in the pub, they will be powerful. Labour isn’t firing on this front. Its conference slogan was “people before privilege”. Try saying that on the doorstep. The Tories’ was “get Brexit done”.\n\nJohnson is still wrestling to make that slogan a reality. But if he does “get it done”, today’s speech shows that the Tories have a ready-made election pitch. I don’t see much evidence of one on the Labour side.", "description": "The Queen’s Speech is normally an occasion for the government to go on the offensive and dominate the news agenda. Sure enough, today’s list of 26 bills looks meaty enough at first glance, and there was no shortage of confidence in the prime minister's message. Only Boris Johnson could talk about releasing “the talent, creativity, innovation and chutzpah that exists in every", "authors": ["Andrew Grice"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/14/12/queen-speech.jpg", "published_at": "2019-10-14"}