{"pub": "yahoo", "url": "https://news.yahoo.com/high-school-sparks-controversy-over-182452414.html", "downloaded_at": "2019-09-20 23:10:01.248977+00:00", "title": "High school sparks controversy over 'ridiculous' lunch: 'It's honestly sad'", "language": "en", "text": "A Minnesota high school is facing criticism for serving a meal that many people have since called \"ridiculous.\"\n\nLast Friday, Maryn Holler, a student at Apollo High School in St. Cloud, shared two photos of a lunch tray filled with baby carrots, a cup of marinara sauce and a hot dog bun filled with melted cheese.\n\n\"Alright so i paid for this to eat at lunch today,\" she wrote on Facebook. \"I thank God everyday that my family has the money where i get to go home and eat actual food. there are kids at this school who this is ALL THEY GET TO EAT, and we were given a hotdog bun with cheese. it’s honestly sad to know that we go to school and pay around 3 dollars for something that cost .50 cents to make.\"\n\nThe post, which has since been shared over 1,000 times, drew more than 900 comments from people who condemned the school for serving something so unappetizing.\n\n\"That is a pathetic excuse for a lunch,\" one person wrote. \"I hope parents are ringing that schools phones off the hook.\"\n\n\"Maryn you're right, this is absolutely ridiculous and I wish you best of luck in hopes of making a positive change in you district!\" another person commented.\n\nThe high school student said she raised the issue with the school's principal, who, in turn, directed her to the school district's nutritionist.\n\n\"I had a meeting with my school principal and was told I get to have a meeting with the districts nutritionist,\" she wrote as a follow-up to her original post. \"Will keep it updated. This is the start of something that could forever change my district.\"\n\nIn response to Holler's post, the St. Cloud Area School District released a statement that day, seemingly joking about the entire situation.\n\n\"Oops! We goofed,\" it said on Facebook. \"Tried a new menu item today at lunch and we hear it was not a winner! Going forward, we will gather input from our students on new menu options. Thanks for the feedback!\"\n\nSeveral commenters, however, were not amused.\n\n\"'Oops we goofed'? You knew what you were doing and the lack of care going into the children's meals,\" one person wrote. \"When I was in school I completely relied on my at school meal to get by, I'm so grateful that was before they started doing things like this. Those poor kids...\"\n\nOthers were a bit more forgiving.\n\n\"Thank you for acknowledging this,\" another replied. \"Not setting a good example to our students on healthy food choices, not to mention what we pay for this meal...as for there being other option, yes that was true for the first few lunches, but once they ran out of alternative choices- this is what there was. My daughter was 'lucky' to get a different option. Please do better.\"\n\nHoller's viral post comes just weeks after a Mississippi high school similarly came under fire for serving a questionable meal to its students. The school, in that case, stood by its lunch.", "description": "A Minnesota high school is facing criticism for serving a meal that many people have since called \"ridiculous.\"", "authors": ["Justin Chan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/W5Dnd3yNZy7sKv_d6xTAsA--~B/aD02NzU7dz0xMDI4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://o.aolcdn.com/images/dims3/GLOB/crop/721x472+0+66/resize/1028x675!/format/jpg/quality/85/https://s.yimg.com/os/creatr-uploaded-images/2019-09/3a14b5a0-dbda-11e9-b6d5-7850965df85b", "published_at": "2019-09-20"}