{"pub": "news24", "url": "https://fin24.com/Companies/board-was-suspicious-of-public-enterprises-dept-ex-saa-ceo-tells-inquiry-20190626", "downloaded_at": "2019-10-07 12:20:21.876980+00:00", "title": "Board was suspicious of public enterprises dept, ex SAA CEO tells inquiry", "language": "en", "text": "Former South African Airways CEO, Sizakele Mzimela, has told the commission of inquiry into state capture of the lead-up to the resignation of nearly the entire board, the appointment of new chair Vuyisile Kona, and her own resignation.\n\nMzimela stepped down late in 2012, following the walk-out of several board members.\n\nThe relationship between the board, management and department of public enterprises had become increasingly strained, Mzimela told the commission.\n\n\"I think this same board started to feel more and more the frustrations between reporting to the previous ministry and reporting to the then ministry at that point in time,\" she said.\n\n\"There was a lot of attention paid to matters [such as the Mumbai route] which were of least priority and all of the other things that required a lot more urgent attention were not getting proper responses.\n\n\"A lot of the board members started to complain, they were quite suspicious… of [the department of public enterprises'] motives in delaying some of these critical decisions that needed to be put into place,\" she explained.\n\nMzimela said she raised concerns with SAA chairperson at the time, Cheryl Carolus, who agreed that \"it was absolutely wrong for some of these things to occur in the manner that they did\".\n\nTheir concerns were not being addressed and the pushback on the ministry was getting harder, Mzimela told the commission.\n\nIn September 2012, several SAA board members decided to resign on the same day. Only three remained.\n\nMyeni's questionable track record\n\n\"When they shared with me their intention to resign my response was, ‘I don’t know why I would be remaining because I equally share the same frustrations that they were articulating in relation to how things were being handled in the organisation’,\" Mzimela told the commission.\n\nMzimela initially chose to stay at the plea of Carolus.\n\nWaiting to hear who the new chair of the board would be, Mzimela said, \"I received a call from Ms. [Dudu] Myeni to say that she was going to appointed as the acting chair. We set up a meeting urgently so that I could bring her up to speed on matters.\"\n\n'Always excused herself'\n\nMzimela, however, said she was surprised by the news, because Myeni \"didn’t have a fantastic attendance record as a director… I was quite surprised that the one who has the worst attendance record is the one who then is going to be the chair of the board.\"\n\nMzimela added: \"I think overall she is also one of those that sometimes did not turn out for the meeting.\n\n\"If she did turn out for the meeting, I don’t know of too many occasions where she stayed for the full time of the board meeting.\n\n\"She was always one of those who found a way to excuse herself prior to the end of the board meeting.\"\n\nHad to rush 'for Number One'\n\nMyeni, said Mzimela, said her main excuse was that \"she had to rush because Number One has called her to a meeting.\"\n\nMzimela said she understood this to be former president Jacob Zuma.\n\nHowever, Mzimela said that on the evening she spoke to Myeni, \"On the news, Mr Vuyisile Kona was then announced as the new chair of the board, and not Ms Myeni.\"\n\nFrustrations of management\n\nOnce he was appointed, Mzimela said he shared with him the frustrations of management. It seemed promising that Kona wanted to work together to make things rights in this regard.\n\nHowever, within days of his appointment, he asked for details of the aircraft procurement process, she told the inquiry.\n\nWhat disturbed Mzimela about this was that Kona also requested the documents and the work that the fleet committee undertook – not the recommendations.\n\nMzimela said, \"I’m comfortable if he’s asking as the CEO to tell him what the recommendation was, what was it based on and to share the type of information that would have been shared with the board in order to reach the decision that was taken by board.\n\n\"But it makes me uncomfortable that he seems to want a little bit more information than what ordinarily a chairperson would request.\"\n\nVarious large tenders\n\nAccording to Mzimela, the information Kona sought regarded various large tenders, including a tender pertaining to the purchase of large aircrafts.\n\nAt this point, Mzimela decided to resign. She did not only hand in a resignation letter but also shared her concerns in a meeting, she said.\n\nBefore she resigned, Mzimela was required to serve a 30 days’ notice period. She asked Kona whether he could lessen this as she would be comfortable leaving earlier.\n\nREAD: Contracted energy group has delivered no fuel to SAA for six months\n\nWhile she got no response, a meeting with one of the three board members who did not resign seemed to reveal that it was common knowledge that Mzimela was resigning with immediate effect.\n\n\"She actually [showed] me a round-robin resolution which had been sent to her… to appoint Mr Kona as the executive chair which they want to remaining board members to approve and the motivation to appoint him as executive chair was because I have resigned with immediate effect according to the resolution,\" said Mzimela.\n\nMzimela said that while this position did not exist before, it would allow him to manage the executive functions of SAA and to \"run the organisation in an executive capacity\".\n\nThis made her want to exit with immediate effect, Mzimela said.", "description": "Former South African Airways CEO, Sizakele Mzimela, has detailed the lead-up to the mass walk-out of board members, her own resignation, and the appointment of new chai Vuyisile Kona.", "authors": ["Azarrah Karrim"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9003/191e9d5b28bb434daedf7862df543e64.jpg", "published_at": "2019-06-26"}