{"pub": "investingcom", "url": "https://investing.com/news/technology-news/australia-regulator-accused-of-harming-competition-in-vodafone-tpg-telco-decision-1974055", "downloaded_at": "2019-09-10 02:20:11.459874+00:00", "title": "Australia regulator accused of harming competition in Vodafone, TPG telco decision", "language": "en", "text": "By Sonali Paul\n\nMELBOURNE (Reuters) - Australia's antitrust regulator has hurt competition, not helped it, by blocking a A$15 billion ($10 billion) merger between the third- and fourth-largest telecoms providers, a lawyer for one of the companies told a court on Tuesday.\n\nThe Australian Competition and Consumer Commission (ACCC) opposed a tie-up between TPG Telecom Ltd and the local joint venture of Britain's Vodafone Group PLC (LON: ) in May on grounds that it would discourage both from competing in each other's markets.\n\nVodafone mainly runs a mobile phone business in a joint venture with Hutchison Telecommunications (Australia) Ltd while TPG has a low-cost internet business.\n\n\"The notion that TPG would, if the merger's blocked, roll out a mobile network is just not of the real commercial world,\" said Vodafone lawyer Peter Brereton in his opening statement at a Federal court hearing.\n\nBrereton said it would be \"commercially crazy\" for TPG to build its own mobile network to rival Vodafone's, and \"that, in particular, is where the ACCC's case descends into speculation and possibilities.\"\n\nThe deal would actually encourage competition but \"the pro-competitive effects of this merger are imperiled by the ACCC's opposition to it\", he said.\n\nTPG abandoned building its mobile telephone network which relied on equipment from Huawei Technologies Co Ltd after the Chinese firm was banned by Australia on security grounds last year.\n\nBut the regulator had said TPG may revisit the plan and that rivalry in the industry depended on it.", "description": "Australia regulator accused of harming competition in Vodafone, TPG telco decision", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXNPEF8902U_L.jpg", "published_at": "2019-09-10"}