{"pub": "townhall", "title": "Since When Does The President Get To Dictate Where Companies Do Business?", "url": "https://finance.townhall.com/columnists/danieljmitchell/2019/08/27/since-when-does-the-president-get-to-dictate-where-companies-do-business-n2552244", "language": "en", "published_at": "2019-08-27", "downloaded_at": "2019-09-02 07:24:29.151849+00:00", "text": "Earlier this year, I identified Trump’s “worst ever tweet.”\n\nI was wrong. That tweet, which displayed an astounding level of economic ignorance, is now old news.\n\nTrump issued a tweet last week that is far worse because it combines bad economic theory with horrifying support for massive economic intervention. Pay special attention to the part circled in red.\n\nHuh?!?\n\nSince when does the President get to dictate where companies can do business?\n\nUnfortunately, whenever he wants to.\n\nCongress has delegated to the President massive “emergency” powers over the economy. Specifically, the International Emergency Economic Powers Act (IEEPA) is a blank check.\n\nHere are some excerpts from a report by the Congressional Research Service.\n\nBy the twentieth century, …Congress created statutory bases permitting the President to declare a state of emergency and make use of extraordinary delegated powers. …The International Emergency Economic Powers Act (IEEPA) is one such example of a twentieth-century delegation of emergency authority. …IEEPA grants the President extensive power to regulate a variety of economic transactions during a state of emergency. …Since 1977, Presidents have invoked IEEPA in 54 declarations of national emergency. On average, these emergencies last nearly a decade. Most emergencies have been geographically specific, targeting a specific country or government. …No President has used IEEPA to place tariffs on imported products from a specific country or on products imported to the United States in general. However, …such an action could happen. In addition, no President has used IEEPA to enact a policy that was primarily domestic in effect. Some scholars argue, however, that the interconnectedness of the global economy means it would probably be permissible to use IEEPA to take an action that was primarily domestic in effect. …Neither the NEA nor IEEPA define what constitutes a “national emergency.” …While IEEPA nominally applies only to foreign transactions, the breadth of the phrase, “any interest of any foreign country or a national thereof” has left a great deal of room for executive discretion.\n\nYou can click here for the actual legislative language of IEEPA.\n\nYou’ll see that the President has the power, for all intents and purposes, to severely disrupt or even block financial transactions between people and/or companies in the United States and people and/or companies in a designated foreign country.\n\nAnd there’s no limit on the definition of “emergency.”\n\nOne could argue that an emergency declaration and a ban on the movement of money wouldn’t necessarily prohibit a company from doing business in a particular jurisdiction, but it surely would have that effect.\n\nThe economic consequences would be profound. In a negative way.\n\nBy the way, the White House Bureau Chief for the Washington Post responded to Trump’s tweet with one of his own.\n\nHe says the President, who criticizes socialism, is acting like a socialist.\n\nTrump spends a lot of time calling Democrats socialist, but a head of state ordering companies to do things is, well, socialism. https://t.co/CkTKXqEDkP — Philip Rucker (@PhilipRucker) August 23, 2019\n\nHe’s actually wrong, at least technically.\n\nSocialism is government ownership and control of the means of production.\n\nWhat Trump is seeking is private ownership and government control. And there’s a different word for that economic policy.\n\nP.S. It’s a good idea for the U.S. government to have powers to respond to a genuine emergency. But it shouldn’t be the decision of one person in our separation-of-powers system. It was a bad idea when Obama was in the White House, and it’s a bad idea with Trump in the White House.\n\nIn peacetime, an emergency should require the approval of Congress. In wartime, it should require approval of the House and Senate leadership from both parties.\n\nP.P.S. Trade laws are another example of Congress delegating too much power to the executive branch.", "description": "Earlier this year, I identified Trump’s “worst ever tweet.”I was .09/02/2019 3:24:29AM EST.", "authors": ["Daniel J. Mitchell", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/233/0d74ddee-c97d-4fda-9e0b-ba8a7b7df3ab.png"}