{"pub": "investing.com", "url": "https://ph.investing.com/news/commodities-news/preciousgold-edges-lower-as-dollar-strengthens-ahead-of-trade-talks-63433", "downloaded_at": "2019-10-08 01:26:23.255373+00:00", "title": "PRECIOUS-Gold edges lower as dollar strengthens ahead of trade talks", "language": "en", "text": "© Reuters. PRECIOUS-Gold edges lower as dollar strengthens ahead of trade talks\n\nOct 8 (Reuters) - Gold prices slipped for a third straight\n\nsession on Tuesday, pressured by a stronger dollar and an uptick\n\nin equities ahead of upcoming U.S.-China trade talks in\n\nWashington.\n\nFUNDAMENTALS\n\n* Spot gold was down 0.2% to $1,489.80 per ounce, as\n\nof 0047 GMT. U.S. gold futures GCcv1 dropped 0.6% to\n\n$1,495.20.\n\n* MSCI's broadest index of Asia-Pacific shares outside Japan\n\ninched up 0.13% and the U.S. dollar\n\nagainst a basket of currencies firmed around 98.98. USD/\n\nMKTS/GLOB\n\n* The dollar strengthened after a Fox Business reporter\n\ntweeted that the Chinese Commerce Ministry said that China is\n\nready to do a deal with the United States on parts of\n\nnegotiations both sides agree upon. * Top-level U.S.-China trade talks are scheduled to resume\n\nlater in the week, when Chinese Vice Premier Liu He meets with\n\nU.S. Trade Representative Robert Lighthizer and Treasury\n\nSecretary Steven Mnuchin in Washington. * The talks are getting underway ahead of a scheduled\n\nincrease in U.S. tariffs on $250 billion worth of Chinese goods,\n\nto 30% from 25% on Oct. 15.\n\n* Spending on retail goods and dining during China's week\n\nlong National Day holidays returned to growth this year,\n\noffering unexpected respite to an economy that has been\n\nexpanding at its weakest pace in almost three decades.\n\n* Investors awaited the U.S. Federal Open Market Committee's\n\nminutes from its September meeting, due on Wednesday, for clues\n\nto whether the Fed will cut rates at its October meeting, in\n\nwhat would be its third interest rate cut for the year.\n\n* Uncertainties on the U.S. political front kept gold\n\nsupported after Congressional Democrats issued subpoenas to the\n\nPentagon and the White House budget office on Monday as part of\n\ntheir impeachment inquiry, seeking documents related to U.S.\n\nPresident Donald Trump's decision to withhold military\n\nassistance from Ukraine. DATA/EVENTS AHEAD (GMT)\n\n0145 China Caixin Services PMI Sept\n\n0600 Germany Industrial Output MM Aug\n\n1750 US Federal Reserve Chairman Jerome Powell speaks\n\non \"A View From the Federal Reserve\"\n\n\n\n", "description": "PRECIOUS-Gold edges lower as dollar strengthens ahead of trade talks", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB730HT_L.jpg", "published_at": "2019-10-08"}