{"pub": "businessinsider", "url": "https://businessinsider.com/watch-aj-mckee-score-an-8-second-ko-2019-9", "downloaded_at": "2019-09-30 10:50:33.240281+00:00", "title": "A 24-year-old American scored an 8-second knockout, backflipped off the Bellator cage, then said he wants a 'mother-f------ belt'", "language": "en", "text": "AJ McKee scored an 8-second knockout, backflipped off the Bellator cage, then said he wants a \"mother-f------ belt.\"\n\nThe 24-year-old American, already regarded as one of Bellator's top prospects, heightened his reputation with a highlight-reel performance at the Bellator 228 show at The Forum in Inglewood, California on Saturday.\n\nMcKee was fighting the jiu jitsu black belt Georgi Karakhanyan in a 16-man Grand Prix, and beat him without taking any damage whatsoever.\n\nAfter McKee and Karakhanyan touched gloves, McKee went to work. He threw a couple of distance-measuring shots, then launched a one-two combination — the second punch in that flurry, an overhand left, dropped Karakhanyan to the floor.\n\nRead more: Take a look inside the new and improved Straight Blast Gym where John Kavanagh trains Conor McGregor and James Gallagher\n\nOnce his opponent had hit the deck, McKee pounced and was separated by the referee after hitting the fallen fighter with unanswerable ground-and-pound.\n\nTo celebrate, McKee backflipped off the Bellator cage, thumped himself on the chest, and threw his gumshield into the crowd.\n\nHe then jumped back on the fence and shouted: \"I want my mother-f------ belt,\" in his post-fight interview.\n\nWatch the knockout and the celebration right here:\n\nIf McKee keeps winning, it will not be long before he gets a title shot, as he is taking part in Bellator's featherweight Grand Prix.\n\nHaving beaten Karakhanyan, McKee advances to the quarterfinal stage where he takes on Derek Campos in December. Should he win again, he will progress into the semifinal stage and could feasibly fight the title holder, which is currently Patricio \"Pitbull\" Freire.\n\nBellator's featherweight division is thriving\n\nIt has been an action-packed weekend for Bellator and its featherweight division as McKee's win at Bellator 228 was one day after the Bellator 227 show in Dublin, which Business Insider attended.\n\nThe main event saw the Irish featherweight James Gallagher submit the former UFC fighter Roman Salazar in just 35 seconds, before celebrating wildly with his Straight Blast Gym teammate Conor McGregor, who was cageside at the time.\n\nRead more: The 22-year-old Irish fighter being compared to Conor McGregor could actually be a better example of 'modern' MMA\n\nGallagher's victory followed another showcase win for the British welterweight Michael \"Venom\" Page, who knocked Richard Kiely out in the opening round because of a flying knee to the face.\n\nPage then pretended to stagger around the cage on drunken legs before standing over his fallen opponent so he could mock him.", "description": "One of Bellator MMA's most promising featherweight fighters battered his opponent and stormed into the semifinal of the fight firm's Grand Prix.", "authors": ["Alan Dawson"], "top_image": "https://amp.businessinsider.com/images/5d91c7532e22af1de370418f-1920-960.jpg", "published_at": "2019-09-30"}