{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/20/smu-takes-3-0-mark-to-no-25-tcu-for-iron-skillet-g", "downloaded_at": "2019-09-20 08:17:19.998876+00:00", "title": "SMU takes 3-0 mark to No. 25 TCU for Iron Skillet game", "language": "en", "text": "FORT WORTH, Texas (AP) - While No. 25 TCU is trying to start a season 3-0 for the 10th time in 17 seasons, SMU has already reached that mark for the first time since 1984.\n\nThe Mustangs (3-0) actually won their first four games 35 years ago, back in the old Southwest Conference days and not long before crippling sanctions led to the NCAA’s so-called death penalty when they didn’t field a team for two seasons.\n\nThat was also the last time - until their 99th meeting coming up on Saturday - that the teams met with both still undefeated after already playing multiple games. The last time before that was 1935, a matchup of 10-0 teams.\n\n“From a coach’s perspective, we’re improved over where we were last year, and we’re playing a better style of football, just playing harder on both sides of the ball,” SMU coach Sonny Dykes said. “I think people are starting to appreciate the fact that we know our guys play hard, and it’s an entertaining brand of football, and we’re having some success.”\n\nTCU (2-0) is coming off a three-touchdown road win against Big Ten team Purdue, which followed an early open date for the Frogs. They have the Big 12’s top defense, allowing 209.5 total yards per game.\n\nSMU, which has been overwhelmed by TCU in recent meetings, comes in with wins over Arkansas State, North Texas and Texas State. The Mustangs had 639 total yards against the FCS Bobcats.\n\n“We’re going to play the best football team we’ve played against,” Dykes said. “It’s pretty obvious when you turn the film on, just in terms of their talent, and the way they performed Saturday against Purdue was really impressive. … I think our guys will be excited to measure ourselves against a very good program.”\n\nDykes is in his second season on the Hilltop following a brief stint as an offensive analyst at TCU. He has 65 players who are first-year Mustangs.\n\n“The transfer portal has really helped … they’ve changed their roster really,” said Gary Patterson, in his 19th full season as TCU’s head coach.\n\nAmong the SMU newcomers is former Texas quarterback Shane Buechele, one of seven graduate transfers and the American Athletic Conference leader with 871 yards passing. He was 0-2 against TCU while with the Longhorns, completing only 37 of 83 passes (45 for 472 yards with a touchdown and two interceptions in those games.\n\n“For them, he’s giving them consistency,” Patterson said, when asked about Buechele at SMU. “He’s a guy that has played in big ball games and he checks into things how he’s supposed to.”\n\nFRESH QB\n\nGraduate transfer Alex Delton started TCU’s first two games, but true freshman Max Duggan entered on the third series both times. Duggan was in for 11 of the Frogs’ 14 possessions against Purdue, including all after halftime. When asked if there could be a change in the way the Frogs use their quarterbacks this week, Patterson responded “maybe.”\n\nLOPSIDED SKILLET\n\nTCU has won by an average margin of four touchdowns while winning the last seven games in the series known as the Battle for the Iron Skillet between two schools 40 miles apart. The Horned Frogs are 15-2 against SMU since 2001, the first season the two teams weren’t in the same conference. The only years they haven’t played since 1925 were 1987 and 1988 after SMU’s penalties, and 2006.\n\nWHAT A RUSH\n\nBoth SMU and TCU had two 100-yard rushers last week. The Mustangs’ 390 yards rushing against Texas State were the most since 1985. True freshman TJ McDaniel, who could still be redshirted, ran eight times for 159 yards and three TDs (10, 39 and 42 yards), while Xavier Jones had 108 yards and matched the national lead with his seventh rushing TD. TCU piled up 346 yards against Purdue, when Darius Anderson had 179 and Sewo Olonilua 106.\n\nLONE VOTE\n\nWhile the Mustangs didn’t get any votes in the AP Top 25 this week, they got a vote from one of the 65 coaches that rank the teams for another poll. Dykes guessed that maybe the vote came from Patterson.\n\n“A little showmanship, you know how that stuff goes,” SMU’s coach said.\n\nWhen asked if it was, Patterson only said, “could’ve been.”\n\n___\n\nMore AP college football: http://apnews.com/tag/Collegefootball and http://www.twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "While No. 25 TCU is trying to start a season 3-0 for the 10th time in 17 seasons, SMU has already reached that mark for the first time since 1984.", "authors": ["The Washington Times Http", "Stephen Hawkins"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/20/tcu_purdue_football_12896_c0-133-3182-1988_s1770x1032.jpg?1664b5568ae85d50eed501c2b7279881ba200e0d", "published_at": "2019-09-20"}