{"pub": "nationalreview", "url": "https://nationalreview.com/news/judge-orders-release-of-redacted-info-from-mueller-report", "downloaded_at": "2019-10-25 21:58:04.277370+00:00", "title": "Mueller Report & Justice Department -- Judge Orders Release of Redacted Info", "language": "en", "text": "Former Special Counsel Robert Mueller stands before the House Judiciary Committee as he prepares to testify in Washington, D.C., July 24, 2019. (Jonathan Ernst/Reuters)\n\nA federal judge on Friday ordered the Justice Department to release certain materials from the Mueller investigation that have until now been redacted.\n\nThe ruling marked a major victory for Democrats pursuing an impeachment investigation of President Trump. The House Judiciary Committee had previously requested to see materials from grand-jury testimonies collected during the Mueller investigation into alleged collusion between Russian officials and the Trump 2016 presidential campaign.\n\nThe Mueller investigation cleared the Trump campaign of collusion, but left open the possibility that campaign officials obstructed the investigation.\n\nJudge Beryl Howell, an Obama appointee, wrote that the committee “has shown that it needs the grand jury material referenced and cited in the Mueller Report to avoid a possible injustice in the impeachment inquiry.”\n\nGrand-jury depositions are generally kept secret, except in cases where the testimonies are relevant to other criminal cases.\n\nLawyers for the Trump administration argued that the House impeachment inquiry was illegitimate because the House did not conduct a full vote to approve the inquiry, and that consequently the Judiciary Committee’s request was void.\n\n“Even in cases of presidential impeachment, a House resolution has never, in fact, been required to begin an impeachment inquiry,” Beryl wrote.\n\nThe Judiciary Committee argued in its request for the Mueller grand-jury materials that they were relevant to the impeachment inquiry into Trump, specifically regarding the Ukrainian contacts of Trump’s former campaign manager Paul Manafort.\n\nTrump is accused of improperly pressuring Ukraine to investigate corruption allegations against former vice president Joe Biden relating to his son Hunter Biden’s business dealings in Ukraine.\n\nManafort pleaded guilty in 2018 to federal conspiracy charges for hiding $15 million from the Internal Revenue Service in offshore accounts. He was sentenced in March to 47 months in prison.", "description": "A federal judge on Friday ordered the Justice Department to release certain materials from the Mueller investigation that have until now been redacted.", "authors": ["Zachary Evans", "Ilya Shapiro", "Mairead Mcardle", "Kevin D. Williamson", "Jack Crowe", "Victor Davis Hanson", "Michael Brendan Dougherty", "Jim Geraghty", "Will Collier", "Read More"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/07/mueller-face.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-25"}