{"pub": "abcnews", "url": "https://abcnews.go.com/Business/facebook-agrees-pay-uk-fine-cambridge-analytica-scandal/story?id=66635145", "downloaded_at": "2019-10-30 23:23:34.220925+00:00", "title": "Facebook agrees to pay UK fine over Cambridge Analytica scandal while admitting no liability", "language": "en", "text": "Facebook will pay a fine of more than $644,000 for its role in the misuse of personal data in the Cambridge Analytica scandal -- though admits to no liability as part of the agreement announced Wednesday.\n\nInterested in Facebook? Add Facebook as an interest to stay up to date on the latest Facebook news, video, and analysis from ABC News. Add Interest\n\nThe UK's Information Commissioner's Office (ICO) slapped the fine, the maximum penalty under the law, on Facebook in October 2018, after conducting an investigation into how allowed third-party developers access to the private data of users.\n\n\"Facebook failed to sufficiently protect the privacy of its users before, during and after the unlawful processing of this data,\" Elizabeth Dunham, the UK's information commissioner, said in a statement at the time. \"A company of its size and expertise should have known better and it should have done better.\"\n\nFacebook appealed the fine in November 2018, and after some back and forth, the ICO announced Wednesday that they had finally struck a deal: Facebook would pay the more than $644,000 but has made no admission of wrongdoing or liability.\n\nBoth sides will also drop their appeals against each other and the agreement allows Facebook to retain documents disclosed by the ICO during the appeal for use in its own investigations into Cambridge Analytica.\n\nValentin Flauraud/Reuters, FILE\n\n“We are pleased to have reached a settlement with the ICO. As we have said before, we wish we had done more to investigate claims about Cambridge Analytica in 2015. We made major changes to our platform back then, significantly restricting the information which app developers could access,\" Harry Kinmonth, the director and associate general counsel at Facebook, said in a statement.\n\nThe statement added that protecting people's privacy and information is one of its top priorities and \"we look forward to continuing to cooperate with the ICO’s wider and ongoing investigation into the use of data analytics for political purposes.”\n\nJames Dipple-Johnstone, the deputy commissioner of the ICO, said it \"welcomes the agreement reached with Facebook\" in a statement.\n\n\"The ICO’s main concern was that UK citizen data was exposed to a serious risk of harm. Protection of personal information and personal privacy is of fundamental importance, not only for the rights of individuals, but also as we now know, for the preservation of a strong democracy,\" Dipple-Johnstone added.\n\nThe Cambridge Analytica scandal revealed that one developer, GSR, harvested private data from up to 87 million Facebook users around the world without their knowledge.\n\nSome of this data was then shared with other organizations including SCL Group, the parent company to data analytics firm Cambridge Analytica, which worked on digital political campaigning in the 2016 election.\n\nIn the U.K., the ICO found that at least 1 million British users were among those whose private data had been compromised.\n\nABC News' Julia Macfarlane contributed to this report.", "description": "Facebook admits to no liability as part of the agreement.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Business/facebook-app-rtr-jc-191021_hpMain_16x9_992.jpg", "published_at": "2019-10-30"}