{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/prince-george-princess-charlotte-obsessed-20722814", "downloaded_at": "2019-10-25 16:34:43.599936+00:00", "title": "Prince George and Princess Charlotte 'obsessed' with tractors and love playing on them", "language": "en", "text": "Get the biggest Royal Family stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nPrince George and Princess Charlotte love playing on tractors, and the older royal tot is completely \"obsessed\" with them, their proud dad has revealed.\n\nThe Duke of Cambridge shared the sweet insight while speaking of the importance of spending time outdoors.\n\nHe spoke about his passion for farming during a two-part documentary about the Duchy of Cornwall, the Royal Family's private estate, which gives a behind-the-scenes insight into Prince Charles's work with the organisation.\n\nThe second episode, which airs on Thursday, shows William meeting farmers as he prepares to take over running the estate when his father accedes to the throne.\n\nDuring a visit to a Duchy farm, William said he should have brought along his eldest child, Prince George.\n\n(Image: PA)\n\n\"He would be absolutely loving this. He's obsessed,\" William said with a laugh.\n\nWilliam speaks to farmers about how vital family is to the estate and how important the outdoors are to his own family.\n\n\"My children are already playing on the tractors and ... it's so important to get outside, and have the children understand nature,\" William said.\n\nCharles's eldest son said he is \"very passionate\" about farming and is learning as much as he can on the Queen's estate at Sandringham.\n\n\"I am very passionate about my farming and I just want to learn more about it,\" he said.\n\n(Image: Matt Porteous/REX/Shutterstock)\n\nAs William prepares for his future role, he asks farmer Mervyn Keeling if there is anything the Duchy could be doing better for its tenants.\n\nMr Keeling explains Brexit is a big rural issue.\n\n\"We had a meeting with your father, he arranged it about Brexit ... but even they couldn't answer the questions for us,\" Mr Keeling said.\n\n\"Because nobody knows, but it was nice, 'cos I spoke to him afterwards, and your dad said he knows, and he was interested ... he wants to make sure it's right for us and for the countryside.\"\n\nIn the documentary, Charles admits he is \"touched\" that William has taken an interest in the Duchy.\n\n\"When I saw it, I couldn't believe it, I was deeply touched and moved by what he said,\" Charles said.\n\n\"It practically reduced me to tears.\n\n\"Because I suddenly thought, well, just hearing that from him, has made the last 50 years worthwhile.\"\n\nThe Duchy estate was established by Edward III to provide a private income for his son and heir to the throne Edward, later known as the Black Prince, and its purpose remains the same today.\n\nCharles took over management of the Duchy when he was 21, after the Queen's accession to the throne.\n\nToday the estate is a private portfolio of land, financial investments and property including the Oval cricket ground in Kennington, south London, and 67,000 acres of Dartmoor.", "description": "Prince William and Kate Middleton believe that spending quality time outdoors is very important when it comes to bringing up their children Prince George, Princess Charlotte and Prince Louis", "authors": ["Zoe Forsey", "Image", "Pa", "Matt Porteous Rex Shutterstock"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20060604.ece/ALTERNATES/s1200/1_Princess-Charlotte-to-begin-school.jpg", "published_at": "2019-10-25"}