{"pub": "huffpost", "url": "https://huffpost.com/entry/why-am-i-always-so-tired_l_5d7656f1e4b0fde50c2a6051", "downloaded_at": "2019-09-10 23:29:34.881311+00:00", "title": "Why Am I Always So Tired?", "language": "en", "text": "Getty Images\n\nSleep is one of those things we all know is good for us, but it’s sometimes hard to actually implement. There’s this persistent cultural idea that getting a full night’s sleep makes you lazy or indulgent, when in fact it makes you healthy and productive.\n\nHere’s what you need to know about why you’re so tired.\n\nReasons you’re so tired\n\nYou aren’t getting enough sleep: Duh — you probably already know this. But it’s easy to overlook and important to remember. “Our society is sleep-deprived,” says Dr. Brian Murray, a neurologist who works in the Sleep Disorder Clinic at Toronto’s Sunnybrook Research Institute. “Most people need seven to nine hours of sleep, and get less.”\n\nYou don’t get enough exercise, and you’re not eating healthy enough: Again, these are the boring answers that you could have seen coming, but they’re true. Study after study has found that progressively increasing physical activity leads to a progressive increase in deep sleep. Similarly, studies have found that diets high in fruits, vegetables, low-fat protein and dairy tend to lead to better sleep. And you also probably knew this, but eating close to bedtime is also associated with bad sleep.\n\nTL;DR: Sorry to disappoint by giving the oldest and most obvious health advice there is, but if you exercise more and eat better, you’ll live a healthier life.\n\nMedications: Drowsiness is a common side effect of many medications — notably many kinds of tricyclic antidepressants, blood pressure medications and allergy meds.\n\nIt’s the middle of the night or it’s mid-afternoon: People have a natural dip in energy between two and four in the morning, and again around two in the afternoon. It’s best not to engage in “demanding attentional situations” during those times, Murray tells HuffPost Canada.\n\nThat people would be tired between 2 and 4 a.m. is fairly intuitive, but many people don’t know about the afternoon lull, Murray adds. Many people blame an afternoon drop in energy on the post-lunch effect, but “it’s not just food that’s doing that,” he says. “It’s a circadian effect. Every cell in your body has a little molecular clock, and it goes through these little rhythms.”\n\nSleep disorders: It’s possible the sleep you get at night isn’t restful because you have a disorder like sleep apnea. If your tiredness gets to a point where you’re falling asleep at inappropriate times — while you’re in the middle of a conversation, or while you’re driving — you could be suffering from narcolepsy. And if you’re tired during the day because you can’t get any sleep at night, you could have insomnia. These are all conditions to bring up with your doctor.\n\nMedical conditions: Don’t worry, people who Google “Is being very tired a sign of cancer?” It’s very unlikely that your fatigue is caused by cancer, but it could potentially be linked to some diseases. Feeling tired all day is sometimes a symptom of depression. Thyroid disease also causes people to feel tired.\n\nAnd because neurodegenerative conditions can cause certain parts of the brain to degenerate, a degeneration in the area that controls sleep and wake could cause sleepiness in someone suffering from a disorder like Parkinson’s disease.\n\nGetty Images\n\nWhat happens when you don’t sleep enough\n\nAgain, you probably already know this, but lack of sleep will negatively impact your body AND your mind. Wild, huh?\n\nBad mood: Much like toddlers, when adults don’t get enough sleep, we’re likely to become cranky, irritable or unhappy.\n\nInattention: Ever zone out during a meeting when you were exhausted? It can be harder to concentrate on specific tasks when you haven’t had enough sleep. This can sometimes be dangerous: a lack of focus can lead to traffic accidents, Murray says.\n\nDisease risk: Murray says people who are sleep-deprived tend to have an increased body weight and are at a higher risk of diabetes and cardiovascular illness. “I think people underestimate the impact of loss of sleep on their general health,” he adds. “We spend a third of our lives in this state, so our bodies have adapted to do this for a very good reason.”\n\nHow to stop feeling tired\n\nSleep more: Come on, you knew this was coming.\n\nMake sure your sleeping area is comfortable: You want a place that’s cool, quiet, dark and comfortable — and preferably, somewhere with minimal electronics. The National Sleep Foundation explains that computers, phones, and other devices suppress your body’s release of melatonin, a hormone that stimulates sleep. So not only does it make you more alert, it also delays your REM sleep.\n\nExercise more: Sorry, but yup.\n\nBalance your diet: See above.\n\nTalk to you doctor about current medications: If you’re on meds that make you drowsy, bring it up with your doctor. They might offer you a non-drowsy version, change your dosage, or consider switching to something else.\n\nDrink coffee: This is helpful — up to a point. “A couple cups of coffee a day can help improve mild impairments in alertness, but it can only go so far,” Murray says. “Caffeine isn’t liquid sleep, and you can’t replace sleep loss entirely.”\n\nStand up more often: Turns out all those standing-desk people were onto something. “Standing is one of the biggest ways to return to alertness,” Murray says. “The postural change has a big impact.”", "description": "Experts explain why you might feel like you have no energy.", "authors": ["Maija Kappler", "Huffpost Canada"], "top_image": "https://img.huffingtonpost.com/asset/5d76581c240000d32677c850.jpeg?cache=dXeXql2GTS&ops=1778_1000", "published_at": "2019-09-09"}