{"pub": "mirror", "url": "https://mirror.co.uk/sport/other-sports/wrestling/john-cena-provides-update-wwe-20536352", "downloaded_at": "2019-10-08 11:39:53.550153+00:00", "title": "John Cena provides update on his WWE wrestling status after lengthy absence", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nWWE legend John Cena insists he is not done with wrestling - but says he is no longer able to handle regular in-ring action.\n\nCena capped off a brief return to the company in January before continuing his acting career, although he did make a fleeting appearance at Wrestlemania 35 in April.\n\nHe has recently been away recording Fast and Furious 9 but opened up on his WWE future.\n\nClaiming he will never turn his back on the company which launched him to stardom, Cena revealed his though process between managing his workload.\n\nThe 42-year-old spoke on NBC's Sunday Today showand said: “I will never walk away from WWE.\n\n(Image: AFP/Getty Images)\n\n\"That's the great thing about WWE, you can perform in any capacity.\n\n\"And, as long as I've made a promise in the in-ring aspect of things, as long as I can keep up with the current product, I can perform.\n\n\"The opportunities that I've been awarded keep me from being in the ring and I actually think that's good because it makes any time that I'm invited back to WWE super, super special. And that's the way it should be.\n\n(Image: WWE)\n\n\"If I didn't have these opportunities, I still would be taking, actively taking, time off. My body just can't handle the schedule anymore,\" he later stated.\n\n\"When I turned 40, I really took a look in the mirror and said, 'Hey, man, I know you really like this, but instead of 250 performances a year, from here on out, just do it 100 times and do it well,\" he continued.\n\n\"And then it became, 'Just do it 50 times and do it well.' And now it's like, 'Hey, you really have to prepare to get ready to perform and then really recover after a performance.'\"", "description": "WWE legend John Cena has revealed his plans for future involvement in WWE as he continues to work on projects outside the ring", "authors": ["Rich Jones", "Image", "Afp Getty Images", "Wwe"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article14276827.ece/ALTERNATES/s1200/0_John-Cena.png", "published_at": "2019-10-08"}