{"pub": "guardian", "url": "https://theguardian.com/australia-news/2019/oct/10/scott-morrison-says-he-has-deep-concerns-turkeys-advance-into-syria-could-help-isis", "downloaded_at": "2019-10-10 03:14:09.875280+00:00", "title": "Scott Morrison says he has 'deep concerns' Turkey's advance into Syria could help Isis", "language": "en", "text": "Comments come day after prime minister stood by Trump decision to withdraw US troops\n\nScott Morrison says he has 'deep concerns' Turkey's advance into Syria could help Isis\n\nLess than 24 hours after standing by Donald Trump’s decision to withdraw US military troops from northern Syria, Scott Morrison says he has “deep concerns” Turkey’s incursion into the area will lead to the resurgence of the terrorist group Islamic State.\n\nOn Wednesday, the Australian prime minister was a minority voice on a decision which has been roundly condemned by the international community and the US president’s own political allies, telling reporters he believed there to be “an element of consistency” in Trump’s actions.\n\nTrump had spoken of his intent to withdraw US troops from the area a year ago, but was reportedly talked out of acting.\n\nTurkish troops advance into Syria as Trump washes his hands of the Kurds Read more\n\nBut with Turkey having taken the US withdrawal as an opportunity to attack north eastern Syria with both an air and land offensive against the Kurdish military – which had been the west’s ally in fighting back and defeating Isis – Morrison said he was “deeply concerned” Da’esh (Isis) could take back territory it had been driven from.\n\n“And that is a concern that has been expressed by Australia and by many others,” Morrison said, adding Australia was conveying its message through “all its diplomatic channels”.\n\n“That is what we have expressed directly to our partners and our allies and certainly to the Turkish government.”\n\nBut Morrison said Australia’s concerns rested with Turkey’s actions, not the United States.\n\n“Let’s be clear – it is the Turkish government that is taking action here to create an unstable situation,” he said.\n\n“They’re the ones who are actually deploying and seeking to walk across the border and to take actions in another nation state.\n\nSign up to receive the top stories from Guardian Australia every morning\n\n“It is the actions of the Turkish government that concerns Australia very seriously.”\n\nIn a joint statement with the foreign minister, Marise Payne, released after his Thursday morning press conference, the prime minister said the government was “deeply troubled by Turkey’s unilateral military operation” into north-eastern Syria.\n\n“Actions of this nature will have grave consequences for regional security and could significantly undermine the gains made by the international coalition in its fight against Da’esh, which remains a serious threat to regional peace and security despite its territorial defeat,” the statement read.\n\n“It will cause additional civilian suffering, lead to greater population displacement, and further inhibit humanitarian access.\n\n“While Turkey has legitimate domestic security concerns, unilateral cross-border military action will not solve these concerns.\n\n“We have expressed this view directly to the Turkish government.”\n\nThe statement also acknowledged the work Kurdish fighters had done in fighting the terrorist group as partners of the international coalition, having “borne a significant share of the sacrifice”, as well as the security support the Syrian Democratic Forces had provided at prisons and displaced peoples camps.\n\nThe Syrian Democratic Forces estimates at least 11,000 of its members were killed in the past five years.\n\nCoordination & Military Ops Center - SDF (@cmoc_sdf) (3)\n\nAny #Turkish attack will result in:\n\n1. Reverse the successful effort to defeat #ISIS, where #SDF sacrificed 11K martyrs of our sons & daughters over 5 years of war, which led to destroy the caliphate & created stability & security for the people of NE #Syria.\n\nMeanwhile, the home affairs minister, Peter Dutton, said Australia would not be moving to extract Australian women and children who fled to the al-Hawl refugee camp, after Isis’s defeat.\n\nThe site is reportedly under threat, after Kurdish soldiers guarding it and its surrounds moved to defend against the Turkish incursion at the border.\n\nThe government has stripped at least three more dual citizens of their Australian citizenship after they travelled to Syria to join with Isis fighters, including Zehra Duman, who left the country as a teenager to marry an Islamic State member. There are concerns her two children had been left stateless by the decision.\n\nMorrison said his advice was the citizenship status of her children were not impacted by her own citizenship cancellation.\n\nDutton says there would be no emergency extraction of Australians trapped in the camp, despite the shifting situation.\n\n'On the edge of a humanitarian catastrophe': Turkish offensive begins Read more\n\n“I don’t think it should come as any surprise to people when we say that we’re not going to send our soldiers or our staff through the foreign affairs department or my department into harm’s way to rescue people of this nature,” he told Sydney radio station 2GB.\n\n“We’re looking at individual cases, and in some cases it may make sense for us to intervene but in the majority of cases I think people realise that if you go into a war zone, and you take your kids into a war zone, that’s a decision you’ve made as a parent.\n\n“The fact that you made a decision to destroy the lives of your children, that’s something you’ll have to live with, but my job is to protect kids back here and make sure that Australians are as safe as possible.”\n\nMorrison and Payne backed Dutton’s stance.\n\n“The full implications of the Turkish military operation on these camps and the people residing in them are difficult to assess at this early stage and will depend, in part, on subsequent actions taken by Turkey and the Kurds,” they said in a statement.\n\n“The government remains concerned for the Australians in these camps but, as we have previously stated, the situation is dangerous and unpredictable, and we will not put Australian officials and the public in danger.”", "description": "Comments come day after prime minister stood by Trump decision to withdraw US troops", "authors": ["Amy Remeikis"], "top_image": "https://i.guim.co.uk/img/media/5e3b77e0714da0566b8abf11cb9f69cc785c9d12/0_168_6048_3630/master/6048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b03b9b72641886713aa0edfc4269eb09", "published_at": "2019-10-10"}