{"pub": "arirang", "url": "https://arirang.com/News/News_View.asp?nseq=245643", "downloaded_at": "2019-10-14 11:46:57.426707+00:00", "title": "News View :: The World On Arirang", "language": "en", "text": "The president's public apology over the resignation of his pick for Justice Minister.\"I am very sorry for having caused a lot of conflict among the people of our country.\"The controversy over Cho and his family had prompted rallies demanding the minister to quit, while counterprotesters criticized his investigation by the prosecution the organization Cho had been tasked with reforming.The President said he had expected to see harmony between the Justice Minister and the Prosecutor General in moving forward with reform but nevertheless, the president promised to complete those reforms despite Cho's resignation.\"Today the prosecution reform plan announced by Justice Minister Cho Kuk is a big step. It is something long pursued but never done by previous governments. The leadership of the prosecution in these efforts will ensure that reform is effective and that it moves forward without halting.\"The president also ordered the Justice Ministry and the government to follow up on those plans and wrap up the necessary administrative processes within this month.He added that the two most important administrative goals are prosecution reform and promoting fairness within society.The president also mentioned the role of the media, a reference to the countless media reports containing allegations, rumors and speculation.But because the administration cannot get involved, he said, the press needs to reflect on itself.\"To repair a country sharply divided in recent weeks, the president called on the nation to come together in support of integration and to direct its energies to the tasks ahead for the economy.Shin Se-min, Arirang News.\"", "description": "한국을 대표하는 글로벌 방송! The World On Arirang!", "authors": ["The Korea International Broadcasting Foundation"], "top_image": "http://www.arirang.com/arirang_blue.png", "published_at": "2019-10-14"}