{"pub": "time", "url": "https://time.com/5691579/hong-kong-teenager-shot-police-charges-tsang-chi-lin", "downloaded_at": "2019-10-03 07:07:15.828157+00:00", "published_at": "2019-10-03", "title": "Hong Kong Teenager Shot by Police to Face Charges", "language": "en", "text": "The Hong Kong teenager shot by police during anti-government protests on Tuesday is to be charged with rioting and assaulting police, local government-funded broadcaster RTHK reports. The news is sure to inflame tensions in the enclave, which is still recovering from its worst day of violence in over 50 years.\n\nTsang Chi-lin, 18, is scheduled to appear in Sha Tin court on Thursday afternoon, a court official told TIME. It was not immediately clear if Tsang, who is recovering in hospital, would be appearing in person or via video link, or be represented by counsel.\n\nBy lunchtime Thursday, hundreds of students began marching through the campus of the Chinese University in support of Tsang, who miraculously survived a police bullet at close range during a street battle on Oct. 1.\n\nStudents chanted the slogan of Hong Kong’s democratic rebellion—“Liberate Hong Kong, revolution of our time!”—and carried posters accusing police of attempted murder. Others called for a student strike.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\nTsang is the first protester to be hit with a live round during four months of unrest. His wounding has given fresh impetus to a movement seeking democratic reform and self-determination for the former British possession, which was retroceded to China in 1997 after 156 years of colonial rule.\n\nOvernight, protesters across Hong Kong vented their fury at the shooting, erecting barricades, setting fires, and smashing the shopfronts of businesses with mainland Chinese connections. Petrol bombs were hurled at a suburban police headquarters. Hundreds of office workers also marched through the city’s financial district yesterday afternoon to decry the shooting.\n\nHong Kong has been roiled by four months of unrest. Early demonstrations against a now withdrawn extradition bill, which would have allowed the rendition of fugitives to mainland China for the first time, have rapidly grown into a democratic rebellion against the unpopular local government and a repudiation of Beijing.\n\n—With reporting by Hillary Leung / Hong Kong\n\nContact us at editors@time.com.", "description": "The news is sure to inflame tensions in the enclave, which is still recovering from its worst day of violence in over 50 years.", "authors": ["Time Staff"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/gettyimages-1178584155.jpg?quality=85&crop=0px%2C868px%2C6043px%2C3163px&resize=1200%2C628&strip"}