{"pub": "thehill", "url": "https://thehill.com/policy/technology/464109-tim-cook-urges-supreme-court-to-protect-daca", "downloaded_at": "2019-10-05 13:03:32.042560+00:00", "title": "Tim Cook urges Supreme Court to protect DACA", "language": "en", "text": "Apple CEO Tim Cook urged the Supreme Court to protect the Deferred Action for Childhood Arrival (DACA) program in a filing submitted under his name with the top court on Wednesday.\n\nCook was joined by Deirdre O’Brien, a senior vice president at Apple, in arguing that the company’s employees enrolled in DACA deserve protection from deportation.\n\n“Apple has filed numerous briefs before this Court, but this is the first time we lend our own names as well,” they wrote. “We do so here to stress that not only does Apple care as a company, but we care as leaders, colleagues, and human beings. This is an issue we feel to our core.”\n\nADVERTISEMENT\n\n“Our interest in this case is simple: We are distressed at the prospect of ripping our DACA colleagues from the fabric of our company,” Cook and O’Brien wrote. “This issue is a moral one: Our country made a deal with a highly vulnerable population interested in a bright future, and we should keep that deal.”\n\nNext month, the Supreme Court will hear arguments from both sides as it decides whether to allow the Trump administration’s rollback of the program, which could leave hundreds of thousands of recipients at risk of deportation.\n\nThe program was created under the Obama administration to provide legal protection to immigrants, often referred to as \"Dreamers,\" who were brought to the U.S. as children and grew up here.\n\nCook and O’Brien wrote that Apple employs 443 Dreamers and that the company sought out and hired them after the DACA was created, “relying on the commitment our government made to them.” In the brief, they described the lives and careers of five of those employees.\n\n“We collectively owe it to the Dreamers to hold up our end of the bargain. It is not just a legal requirement,” they wrote. “It is the moral thing to do.”\n\nThe Supreme Court will hear oral arguments in the case on Nov. 12.\n\n20191002154056089_Apple Amicus Brief by M Mali on Scribd", "description": "Apple CEO Tim Cook urged the Supreme Court to protect the Deferred Action for Childhood Arrival (DACA) program", "authors": [], "top_image": "https://thehill.com/sites/default/files/timcook_donaldtrump_030619getty.jpg", "published_at": "2019-10-02"}