{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-china-economy-poll/trade-pressure-seen-denting-chinas-2019-growth-to-29-year-low-at-6-2-5-9-in-2020-reuters-poll-idUKKBN1WU0LP", "downloaded_at": "2019-10-15 08:06:33.606974+00:00", "title": "Trade pressure seen denting China's 2019 growth to 29-year low at 6.2%, 5.9% in 2020: Reuters poll", "language": "en", "text": "BEIJING (Reuters) - China’s economic growth is expected to slow to a near 30-year low of 6.2% this year and cool further to 5.9% in 2020, a Reuters poll showed, underlining the stiff challenge faced by Beijing even as it steps up stimulus amid a bruising Sino-U.S. trade war.\n\nA worker sorts imported goods on a truck next to containers at a port in Qingdao, Shandong province, China October 14, 2019. REUTERS/Stringer/Files\n\nThe median forecast for 2019 growth is near the lower end of the government’s target range of 6-6.5%, and would be the weakest expansion for the world’s second-biggest economy since 1990.\n\nThe poll of 83 analysts also forecast third-quarter growth at 6.1% year-on-year, unchanged from the last survey done in July, but a touch below the 6.2% pace in the second quarter.\n\nOn the whole, it would mark a further slowdown from growth of 6.6% in 2018 and 6.8% in 2017, highlighting the intensifying global and domestic pressures on the Asian powerhouse.\n\nChina will release its third-quarter gross domestic product (GDP) data on Oct 18.\n\nGrowth in 2020 will likely cool further to 5.9%, the poll showed, below the 6.0% forecast in the previous survey.\n\nA raft of downbeat data in recent months has highlighted weaker demand at home and abroad, fanning market expectations that Beijing will need to unveil more stimulus steps to ward off a sharper slowdown and prevent more job losses.\n\n“Should labor market deteriorate sharply in late 2019 and early 2020, policy support may intensify in March next year,” Tao Wang, China economist at UBS, said in a note.\n\n“As policy measures strengthen and take effect, and as the shock of higher tariffs peaks in Q1 2020, we see China’s GDP growth rebounding from Q2 2020 onwards.”\n\nBeijing has been relying on a combination of fiscal stimulus and monetary easing to weather the current slowdown, but analysts say the room for aggressive policy action has been limited by worries over debt and housing risks.\n\nChinese central bank governor Yi Gang said late in September there was no urgent need to implement large interest rate cuts following Beijing’s reiteration that it would not use “flood-like” stimulus measures.\n\nMORE POLICY SUPPORT EXPECTED\n\nThe outlook is unlikely to change for the better anytime soon even as tensions in the protracted trade war between Beijing and Washington have eased somewhat. U.S. President Donald Trump said on Friday the two sides had reached agreement on the first phase of a deal and suspended a tariff hike, but officials said much work still needed to be done.\n\nAnalysts in the latest Reuters poll expect the People’s Bank of China (PBOC) would ease policy further by cutting banks’ reserve retirement ratios (RRR) and the one-year loan prime rate (LPR), its new benchmark lending rate.\n\nThe PBOC has already cut RRR seven times since early 2018, in addition to two modest reductions in the one-year LPR since August.\n\nAnalysts expect the PBOC to deliver another 50 basis-point RRR cut in the fourth quarter, and two more RRR reductions in the first half of 2020, according to the poll.\n\nThe central bank is also forecast to slash the one-year LPR to 4.00% by the end of 2019, down by 20 basis point from its current level.\n\nHowever, they do not expect it to cut its previous benchmark lending rate, which remains in place but will be replaced by the new benchmark lending rate over time.\n\nEconomists expect the central bank to keep its benchmark rate unchanged at 4.35 percent through at least the end of 2020.\n\nThe poll also predicted annual consumer inflation will pick up to 2.5% in 2019, quickening from 2.3% estimate in the July survey, but below the government target of around 3%.\n\nData earlier in the day showed China’s factory gate prices declined at their fastest pace in more than three years in September, reinforcing the case for Beijing to unveil further stimulus as manufacturing cools on weak demand and U.S. trade pressures.\n\nConsumer inflation accelerated to 3% in September - the highest since October 2013, but analysts attributed this to the supply-side impact of rising food costs, driven by surging pork prices as African swine fever diminishes hog supplies.", "description": "China's economic growth is expected to slow to a near 30-year low of 6.2% this year and cool further to 5.9% in 2020, a Reuters poll showed, underlining the stiff challenge faced by Beijing even as it steps up stimulus amid a bruising Sino-U.S. trade war.", "authors": ["Kevin Yao", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1441001425&w=1200&r=LYNXMPEF9E0B1", "published_at": "2019-10-15"}