{"pub": "yahoo", "url": "https://news.yahoo.com/us-newspaper-sparks-controversy-publishing-details-whistleblower-154640223.html", "downloaded_at": "2019-09-29 00:24:37.477960+00:00", "title": "US newspaper sparks controversy by publishing details on whistleblower", "language": "en", "text": "The New York Times published details about the man whose complaint sparked an impeachment inquiry into President Donald Trump (AFP Photo/Ramin Talaie)\n\nNew York (AFP) - Protecting a potentially vulnerable whistleblower versus the public's need to know: a US newspaper's publication of information on the man whose complaint led to an impeachment inquiry into President Donald Trump has sparked controversy and debate.\n\nAfter the release of a complaint accusing Trump of having solicited \"interference from a foreign country in the 2020 US election,\" The New York Times reported that the whistleblower is a CIA officer once posted to the White House who is an expert on European issues and the political situation in Ukraine.\n\nLawyers for the whistleblower have deemed those revelations to be dangerous for their client, both personally and professionally.\n\nCalls to cancel subscriptions to the Times, circulated under the hashtag #CancelNYT, have proliferated on social media, where some have demanded the resignation of executive editor Dean Baquet.\n\n- 'Tough call' -\n\nBaquet defended the decision, saying that Trump and some of his supporters had attacked the whistleblower's credibility, and that the publication of the information was aimed at allowing readers to \"make their own judgments about whether or not he is credible.\"\n\n\"I think it is a tough call,\" said Jon Marshall, a professor at Northwestern University's journalism school. \"The NYT was caught in a classical ethical dilemma news organizations face with two competing ethical standards to consider.\"\n\nThese are \"to seek the truth and report it,\" and \"to minimize harm, which includes protecting sources and not putting them in jeopardy,\" said Marshall, the author of a book on the legacy of the Watergate scandal and the press.\n\nLike others, Marshall believes there are likely only a handful of people who would fit the description of the whistleblower, and that identifying him \"could put him in harm's way.\"\n\nFor him, describing the whistleblower as an experienced CIA officer would have been enough to establish his credibility.\n\nWhile he also believes that the whistleblower could be in danger, Todd Gitlin, a professor of journalism at Columbia University, said the decision to publish the details was justified.\n\n\"He must have understood there was a certain risk. He must have taken precautions,\" Gitlin said.\n\nMoreover, \"he works for an organization that is devoted to security,\" and if it failed to protect him, \"heads would roll, even in the current political climate.\"\n\n- 'A truth-seeker' -\n\n\n\n\n\nUnlike Edward Snowden or Chelsea Manning, who carried out unauthorized leaks of sensitive information, the whistleblower complied with all the rules on filing complaints and worked in consultation with specialized lawyers, said Kathleen McClellan, Deputy Director for the Whistleblower and Source Protection Program at the ExposeFacts NGO.\n\nBut whistleblowers from the intelligence community are exposed to the risk of reprisal, McClellan said.\n\n\"In the US intelligence community, whistleblowers have no meaningful protection from retaliation,\" she said. \"If the president retaliates against the whistleblower, the whistleblower has no other remedy than to seek redress with the executive branch.\"\n\n\"I think the press should respect a whistleblower's right to remain anonymous,\" McClellan said.\n\nShe said the credibility argument advanced by the Times does not hold water, as \"his credibility has already been established,\" with the inspector general to whom he sent the report.\n\nIn any case, the whistleblower's identity will likely be known soon, especially as Congress wants him to testify, Gitlin said.\n\nAnd if his identity is revealed, \"it'll be one of those names in the history books and around forever, like Daniel Ellsberg,\" who leaked the Pentagon Papers, which revealed that successive US administrations had lied to the public about the Vietnam War, presidential historian Douglas Brinkley said in The Washington Post.\n\n\"He'll be remembered as a truth-seeker,\" Brinkley said.", "description": "Protecting a potentially vulnerable whistleblower versus the public's need to know: a US newspaper's publication of information on the man whose complaint led to an impeachment inquiry into President Donald Trump has sparked controversy and debate.  After the release of a complaint accusing Trump", "authors": ["Catherine Triomphe"], "top_image": "https://s.yimg.com/uu/api/res/1.2/XjUSciqr7ndsDGDbaFCRaw--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/53a4f94bd862eaf6f46d80ae146fcbaf5735c695.jpg", "published_at": "2019-09-28"}