{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/planet-zoos-animals-are-more-civilised-than-sydney-folk", "downloaded_at": "2019-09-04 08:10:00.708773+00:00", "title": "Planet Zoo's Animals Are More Civilised Than Most Sydney Folk", "language": "en", "published_at": "2019-09-04", "text": "Image: YouTube/Planet Zoo\n\nEver been to Sydney's Town Hall station at 5.30pm in summer? The air is dense and moist, filled with the sound of thousands of tired, overworked human bodies slapping against each other as they pile on to a train out of the city. Even if you love Sydney, it's most people's personal hell. Thankfully, you won't find that level of chaos in Planet Zoo because the good boys, according to a gameplay reveal, are very well-behaved.\n\nIn Planet Zoo, You Can Only Get Good By Learning Facts About Animals Planet Zoo is the latest simulator from Frontier Developments, the creators of Roller Coaster Tycoon and the recent Planet Coaster. In this one, you’re building a zoo and making sure all the animals are well cared for, which comes with unexpected challengers for players used to making theme parks. Read more\n\nPlanet Zoo has revealed its gameplay and its shaping up to include all your feature with a 2019 spin. The 18-minute video details a specific campaign with an Indian-themed setting and covers the usual suspects; creating enclosures, buying animals, gifting them new toys and food as well as making sure there's enough staff to keep it all running smoothly.\n\nThe best thing we noticed, however, was how well the animals behave, even as they're trying to break free.\n\nIn one section of the video, a big boi rhino escapes and you'll need to hire a veterinarian to help recapture him and repair his broken enclosure. The rhino, casually walking with the zoo's guests, peacefully complies after he's tranquilised, naturally.\n\nImagine a Sydney where the human beings on public transport are as well-behaved as these animals. I'd happily catch a bus or train with this rhino over some of my fellow commuters.\n\nAside from that, the main difference avid Zoo Tycoon-ers will notice is how many more features the game is packed with. There's a new heat map feature, which will allow you to better tend to your animal children. For example, you can switch on the setting to find out about all your animals' welfare, temperature, enclosure water quality as well as guest happiness.\n\nWhile it's tempting to opt for a fast-paced shooter or medieval death match to relax after a long day, can those games give you the wholesome feeling of nurturing an animal with their favourite feed? I rest my case.\n\nImage: YouTube/Planet Zoo\n\nConsider me very excited for this one when it drops on November 5.", "description": "Ever been to Sydney's Town Hall station at 5.30pm in summer? The air is dense and moist, filled with the sound of thousands of tired, overworked human bodies slapping against each other as they pile on to a train out of the city. Even if you love Sydney, it's most people's personal hell. Thankfully, you won't find...", "authors": ["Mark Serrels", "Riley Macleod"], "top_image": "https://edge.alluremedia.com.au/m/k/2019/09/bigboiontheloose.jpg"}