{"pub": "investing.com", "url": "https://za.investing.com/news/stock-market-news/tech-sector-leads-nikkei-to-10month-high-profittaking-hits-topix-1967707", "downloaded_at": "2019-10-18 08:05:31.966838+00:00", "title": "Tech sector leads Nikkei to 10-month high, profit-taking hits Topix", "language": "en", "text": "© Reuters. Tech sector leads Nikkei to 10-month high, profit-taking hits Topix\n\n* Nikkei up 0.18% but broader Topix shed 0.13%\n\n* NT ratio at highest since 1992\n\n* Semiconductor-related shares jump after TSMC earnings\n\nBy Hideyuki Sano\n\nTOKYO, Oct 18 (Reuters) - Japan's Nikkei hit a 10-month high on Friday after high-tech companies jumped on upbeat earnings from Taiwan's TSMC while the broader market ended lower, succumbing to profit-taking after weaker-than-expected Chinese GDP data.\n\nThe Nikkei share average rose 0.18% to 22,492.68, its highest finish since early December last year, pulling back from rising as much as 0.88% earlier. For the week, the Nikkei was up 3.18%.\n\nThe broader Topix , a gauge of all firms on the main board of the Tokyo Stock Exchange, ended 0.13% lower at 1,621.99.\n\nTheir divergent performances lifted the so-called NT ratio .NTIDX , of the two indexes, to the highest since 1992.\n\nThe Nikkei was buoyed by a rise in heavyweight Fast Retailing as well as a few heavily-weighted tech shares, including Fanuc , Shin-etsu Chemical and Omron .\n\nThe tech sector led gains after Taiwan Semiconductor Manufacturing Co (TSMC) - the world's top contract chipmaker - raised on Thursday its 2019 capital spending plan by up to $5 billion and forecast a nearly 10% rise in fourth-quarter revenue on strong demand for faster mobile chips and new high-end smartphones.\n\nScreen Holdings , a major chip industry supplier, gained 7.9% with trade volume reaching almost three times the average while Sumco rose 4.3%.\n\nTri Chemical Laboratories , maker of high-purity chemicals for semiconductor manufacturing, jumped 6.8%.\n\nAmong bigger firms, Murata Manufacturing gained 1.2%, and Keyence rose 1.0%.\n\nWhile the market got an early boost from relief over Britain and the European Union striking a deal on the UK's departure from the bloc, soft Chinese GDP triggered profit-taking.\n\nChina's third-quarter economic growth slowed more than expected to 6.0%, its weakest pace in almost three decades. overall sentiment remained positive as U.S. corporate earnings have so far mostly beat market expectations. .N\n\nThat also raised some hopes that Japanese companies' earnings outlook could bottom out soon. The Topix's forward earnings per share (EPS) has declined 9% to 122.86 since peaking in November.\n\nAt home, investor sentiment also benefited from a trade deal reached between Japan and the United States which the Japanese government said would likely boost the domestic economy by about 0.8%. the small losses in Topix, advancers slightly outnumbered decliners by a ratio of roughly 21 to 20.\n\nDefensive shares, such as food companies, were among the worst performers as investors moved out of them to more cyclical shares.\n\nNH Foods dropped 2.4%, cosmetic firm Shiseido declined 3.1% and Keisei Electric Railway fell 2.1%. (Editing by Jacqueline Wong)", "description": "Tech sector leads Nikkei to 10-month high, profit-taking hits Topix", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC0Q0MJ_L.jpg", "published_at": "2019-10-18"}