{"pub": "rt", "url": "https://rt.com/news/470268-draconid-meteor-shower-peak", "downloaded_at": "2019-10-05 23:02:03.952684+00:00", "title": "Stargazers set for spectacular OUTBURST Draconid meteor shower", "language": "en", "text": "The Draconid meteor shower is set to peak in the coming days and Earth’s path through space means stargazers are about to witness some spectacular pyrotechnics. Here’s everything you need to know about the stunning phenomenon.\n\nThe dazzling light show will set skies ablaze from Sunday until Thursday, peaking on Tuesday when hundreds of meteors are set to rain from the sky.\n\nThe shower occurs when the Earth flies through the debris field that’s left in the wake of Comet 21P/Giacobini-Zinner. The meteors appear to emerge from a point near the head of the constellation Draco the Dragon.\n\nThe Draconids are sometimes a tame affair, however it’s an outburst year, meaning they could produce 40 to 50 meteors an hour. The outbursts occur when the Earth passes inside the comet's orbit shortly after it has gone by.\n\nStargazers will be hoping for a natural fireworks show similar to 2011 when the shower rained down up to 600 meteors per hour. Amazingly, people in Europe were treated to an incredible 500 Draconids a minute in 1933, and their counterparts on the west coast of the US saw thousands per hour in 1946.\n\nUnfortunately, the almost full moon will likely put a dampener on the proceedings by washing out many meteors. However, outburst showers regularly defy predictions so it’s still worth finding a patch of dark sky and hoping for the best.\n\nThe best time for Draconid hunting is after sundown when the Draco constellation is at its highest point. Set your sights on the constellation’s “radiant”, the point from which the meteors appear to emerge.\n\nIf the Draconids fail to deliver, you can console yourself with the knowledge that the Orionid meteor shower is scheduled to peak around October 21.\n\nAlso on rt.com Comet me, bro! What are your chances of finding a crashed meteorite on Earth?\n\nLike this story? Share it with a friend!", "description": "The Draconid meteor shower is set to peak in the coming days and Earth’s path through space means stargazers are about to witness some spectacular pyrotechnics. Here’s everything you need to know about the stunning phenomenon.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5d98916585f54039c034111f.PNG", "published_at": "2019-10-05"}