{"pub": "arstechnica", "url": "https://arstechnica.com/gadgets/2019/10/the-pixel-4s-face-unlock-works-on-sleeping-unconscious-people", "downloaded_at": "2019-10-19 10:47:36.764905+00:00", "title": "The Pixel 4’s face unlock works on sleeping, unconscious people", "language": "en", "text": "Ron Amadeo\n\nRon Amadeo\n\nRon Amadeo\n\nRon Amadeo\n\nRon Amadeo\n\nRon Amadeo\n\nRon Amadeo\n\nRon Amadeo\n\nRon Amadeo\n\nGoogle's recently announced Pixel 4 has a new biometric feature—well, new for Google, at least—face unlock. Like most new biometric systems, that means we'll probably be writing about security flaws in its implementation, and the first one has already popped up before the phone is even out. You don't need to have your eyes open for the Pixel 4's face unlock to work. The flaw was first publicized by the BBC's technology reporter, Chris Fox, who was able to get face unlock to work on several people with their eyes closed.\n\nThe thing about biometrics versus a password or PIN is that having to enter data via a keyboard is a pretty good indicator of consent. You're conscious, you're recalling this secret information, and you're typing it into the phone. You're at least aware of what's going on. Biometrics, on the other hand, are something other people can do for you, or to you. The easiest example is pointing a phone at a sleeping person to unlock it. You could also lift a person's finger and put it on a fingerprint reader, but at least you have to touch the victim to do that. There's a real lack of consent and awareness when you can just point the phone at an unconscious person.\n\nFox gives a great video example on Twitter:\n\nOther face lock systems, like Apple's Face ID, have an alertness check that looks for open eyes. Even Google's old face unlock system for Android 4.1 required you to blink if your head seemed stationary.\n\nEarly versions of the Pixel 4 face unlock settings had a checkbox to \"Require eyes to be open,\" but that is not present on review units or the shipping version. The BBC confirmed with Google that the current, eyes-closed implementation is what will ship to consumers. Google says it will \"continue to improve Face Unlock over time.\" There is no fingerprint reader on the Pixel 4, so face unlock is the only biometric option.\n\nIf you are worried about having the phone unlocked without your consent, you can either not use face unlock at all, or turn on the \"lockdown\" option in the power menu, which will disable face unlock temporarily. The lockdown button is off by default, but you can enable the button by searching for \"lockdown\" in the system settings.\n\nListing image by Google", "description": "Google's lack of an alertness check raises security concerns.", "authors": ["Ron Amadeo"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/pixel-4-760x380.png", "published_at": "2019-10-18"}