{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7576703/Women-partners-smoke-weed-week-higher-miscarriage-risk.html", "downloaded_at": "2019-10-15 23:12:50.667007+00:00", "title": "Women whose partners smoke weed more than once a week at higher miscarriage risk", "language": "en", "text": "Men may want to take a break from marijuana if they and their partners are trying to get pregnant, a new study suggests.\n\nResearchers at Boston University found that the partners of men who used marijuana more than once a week prior to conception were at twice the risk of miscarrying.\n\nBut as long as the men kept their marijuana use to less than once a week, there seemed to be no added risk to their partners' pregnancies.\n\nScientists are still in the early stages of working out how cannabis affects fertility s well as fetal development, and the new study looked only at an association, not at how marijuana could disrupt pregnancy, but it may be worth considering for couples trying to start a family.\n\nResearch on marijuana's effects on fertility and fetal health has yielded a mixed bag of results, but the latest study suggests a link between miscarriages and men's frequent use\n\nMarijuana is legal in more places in the US than ever, and many Americans are taking advantage of the fact.\n\nIt's now legal for medical use in 33 states, and for recreational use in 11. As of 2017, some 37 million Americans were estimated to use pot.\n\nThat includes pregnant women, twice as many of whom reported using marijuana while carrying a fetus in 2017 as did in 2002 - despite doctors warnings against doing so.\n\nScientists have quite well established that compounds in cannabis can be used to treat certain seizure disorders and, for cancer patients undergoing chemo, reduce nausea and improve appetites.\n\nMany chronic and nerve pain patients also swear by it as an alternative to highly-addictive opioids.\n\nDespite the laundry list of benefits of cannabis extolled by dispensaries and CBD sellers - everything from reducing anxiety to fighting cancer - the reality is that there is much we still don't know for certain about its health effects.\n\nThe drug's legal status is the main reason for our lacking knowledge.\n\nIn fact, scientists still struggle to get their hands on marijuana for research because it remains illegal at the federal level.\n\nSo researchers get approval from that National Institute on Drug Abuse as as well as the Drug Enforcement to run high quality clinical trials on pot.\n\nOtherwise, they're stuck with study designs that simply aren't sufficient to prove, definitively, marijuana's health effects for better or worse.\n\nThe studies that have been done on the effects of marijuana on fertility have come to conclusions that run the gamut from good to bad: Some say that it doesn't lower the chances of women getting pregnant, others say it may improve sperm count, and still others suggest that men who smoke too much weed have poor quality sperm.\n\nFor their latest study, the Boston University team followed 1,413 couples for two months prior to their getting pregnant.\n\nOnly a small proportion of the men - 9.3 percent - said they used marijuana less than once a week, and even fewer - 8.3 percent - said they used it more than once a week.\n\nIn total, 18.3 percent of the pregnancies ended in miscarriages.\n\nThe odds of miscarriage were nearly twice as high if the male half of the couple reported using marijuana more than once a week.\n\nBut using marijuana less than once a week was not linked to any difference in miscarriage risk.\n\nThe study did not document the women's marijuana use.\n\nNotably, the rate of miscarriage before the 20th week of pregnancy in the US is about 20 percent, regardless of the number of people that use marijuana.\n\nThe research was presented at the American Society for Reproductive Medicine and has not yet been reviewed by other scientists.\n\nMoreover, the study points to the suggestions from prior research that marijuana use has been linked to poor sperm quality and the 'mixed' evidence of fertility issues as a result, it doesn't not itself attempt to explain how or why marijuana might contribute to miscarriages.\n\nNonetheless, the American College of Gynecology (ACOG) warns that marijuana may interfere with a baby's brain development, and advises women to stop using marijuana if they are trying to get pregnant.\n\nAnd as men's fertility accounts for 40 percent of a couple's collective fertility, it may be advisable to do the same.", "description": "Doctors advise women to stop using marijuana if they are trying to get pregnant, as it may harm a developing baby. Boston University research suggests men's use may affect pregnancy too.", "authors": ["Natalie Rahhal Deputy Health Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/22/19755280-0-image-a-19_1571173287745.jpg", "published_at": "2019-10-15"}