{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/pick-your-next-vacation-destination-based-on-price-or-weather-using-this-site", "downloaded_at": "2019-10-14 10:15:43.907171+00:00", "title": "Pick Your Next Holiday Destination Based On Price Or Weather Using This Site", "language": "en", "text": "Image: Shutterstock\n\nSometimes a vacation is to a destination you specifically want to visit. Other times, you just want to go somewhere “warm” or “cheap” and are open to options. For those times, Escape is a site that can help you with a little inspiration.\n\nWith it, you enter where you’re travelling from as well as when you’d like to travel. Afterward, the site will give you pricing for different destinations around the world you can travel to during your specified travel dates along with pricing information on how much it will cost for you to get there.\n\nBeyond just pricing, you can also filter results by what kind of visa you’ll need to travel to a destination, how popular or safe it is, what there is to do there, and was the weather is likely to be like during your trip.\n\nFor instance, a trip from Sydney to anywhere over the Christmas and New Year's break showed me that Sydney to Asia would cost from $1126 and Europe from $1291.\n\nImage: Escape\n\nResults are presented on a map that’s initially zoomed out to give you an overview of your options but can be zoomed in on when you want to get more specific. For instance, that $1126 trip to Asia, upon closer inspection, is a flight to Dili, Timor-Leste, specifically. I can also get to Singapore that weekend for $1137 or Sorong, Indonesia for $1219.\n\nIf you’re more interested in what the weather will be like where you’re travelling than the cost, you can set a particular temperature range you’re comfortable with on the site, for instance, 21-32 degrees Celcius. You can also say whether or not you’ll be likely or unlikely to see snow on that trip.\n\nFor vacations where you already know where you’re going, this site obviously isn’t going to be very useful. If you’re still in the early planning stages of your next vacation and are still trying to determine the “where” of where you’re travelling; however, then it can be a great place to start.", "description": "Sometimes a vacation is to a destination you specifically want to visit. Other times, you just want to go somewhere “warm” or “cheap” and are open to options. For those times, Escape is a site that can help you with a little inspiration....", "authors": ["Chris Jager"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/cwyi2kuavlsfdjuto2rr.jpg", "published_at": "2019-10-14"}