{"pub": "businessinsider", "url": "https://businessinsider.com/paul-feig-reacts-to-joker-director-woke-culture-comments-2019-10", "downloaded_at": "2019-10-29 15:11:48.243471+00:00", "title": "'Bridesmaids' director Paul Feig totally disagrees with the 'Joker' director's claim that 'woke culture' is ruining comedy", "language": "en", "text": "Comedy director Paul Feig reacted to \"Joker\" director Todd Phillips saying he stopped making funny movies because of \"woke culture.\"\n\nFeig, who created \"Freaks and Geeks\" and directed \"Bridesmaids,\" said jokes can be made without offending people.\n\nFeig said he likes woke culture because \"we're actually caring about people's feelings.\"\n\nVisit Business Insider's homepage for more stories.\n\n\"Joker\" has become a box-office sensation, and its director Todd Phillips is thankful because, according to him, in today's world comedies don't work anymore.\n\nWhile being interviewed for a Vanity Fair profile on his lead actor in \"Joker,\" Joaquin Phoenix, Phillips explained why he gave up on making comedies like \"Old School\" and \"The Hangover.\"\n\n\"Go try to be funny nowadays with this woke culture,\" Phillips said. \"There were articles written about why comedies don't work anymore — I'll tell you why, because all the f---ing funny guys are like, 'F--k this shit, because I don't want to offend you.' It's hard to argue with 30 million people on Twitter. You just can't do it, right? So you just go, 'I'm out.'\"\n\nPhillips' comments went viral. And one person who read them was director Paul Feig, who is known for comedies like \"Freaks and Geeks,\" \"Bridesmaids,\" and \"Spy.\"\n\n\"I have an issue with this,\" Feig told Business Insider, when asked about it while promoting his new movie \"Last Christmas\" (in theaters November 8).\n\n\"Joker\" director Todd Phillips. Jamie McCarthy/Getty \"I think Todd's a brilliant director, he changed the face of comedy, I just think jokes can be made without offending people,\" he said.\n\nFeig said his movies are filled with jokes that don't shame the audience. And when he does cross that line, he feels bad about it. One example he gave was a joke he did in 2013's \"The Heat,\" starring Melissa McCarthy and Sandra Bullock as undercover cops. In one scene, they run into a cop who is albino, and they make jokes at him that they thought he was a bad guy because albino people are usually villains in movies.\n\n\"I got a letter from this woman whose child was albino and she said this is really bad for him, and I felt awful,\" Feig said. \"I didn't go, 'F--k this, we can't make jokes about anything.'\"\n\nSince then, Feig is more conscious of his material. He said what he believes is fair game are choices people make, but what's off limits are gender, race, or core beliefs.\n\n\"Why would I want to make fun of that?\" he said. \"I can make a million jokes that are going to make people laugh that won't offend them.\"\n\nFeig continued: \"I like woke culture because woke culture means we're advancing and we're actually caring about people's feelings. I know in certain parts of the internet it's like, 'People's feelings, who cares?' Well, all we have are people's feelings because we're humans. So I just don't want to step on that.\"", "description": "Director Paul Feig believes jokes can me made without offending people. In fact, he says he can come up with a million of them.", "authors": ["Jason Guerrasio"], "top_image": "https://image.businessinsider.com/5db79797dee019054a2c4963?width=1200&format=jpeg", "published_at": "2019-10-29"}