{"pub": "washingtontimes", "title": "Neil Cavuto strikes one for freedom", "url": "https://washingtontimes.com/news/2019/aug/30/neil-cavuto-strikes-one-freedom", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:36:36.530156+00:00", "text": "ANALYSIS/OPINION:\n\nNeil Cavuto, Fox News host, sent a scathing message President Donald Trump’s way on national television, telling the White House chief that his cable company didn’t work for him — didn’t work for anybody in the administration, in fact.\n\nIt was a bold stand for the free press. For freedom for all, in fact.\n\nAnd it came in response to Trump’s tweeted criticisms that Fox “isn’t working for us anymore” and suggesting his fans and supporters may “have to start looking for a new News Outlet.”\n\nAnd Trump’s criticisms? Well, those came in response to coverage by Fox of political issues by those who lean left, maybe even far left; those like Juan Williams, Shepard Smith and Donna Brazile.\n\nOn that last, Trump in a tweet called Fox “HOPELESS & CLUELESS” for her hiring.\n\nFox peeps are getting perturbed.\n\n“First of all, Mr. President, we don’t work for you,” Cavuto said, The Hill reported. “I don’t work for you. My job is to cover you, not fawn over you or rip you. Just report on you.”\n\nCavuto then listed areas of coverage he said Trump didn’t like, and statements or views Trump made that he later flipped.\n\nAnd he said: “Fake [news] is when it’s wrong Mr. President, not when it’s unpleasant.”\n\nTrump’s relationship with the media has been rocky from his pre-White House days, when pundits and anchors alike — even on Fox — called out his campaign as a circus act, characterized him as a circus show.\n\n“You’re right to say the media isn’t fair to you,” Cavuto said. “That they’re more inclined to report the bad than anything good about you. So it is no surprise that you’re frustrated that more aren’t in line with you. … [But] hard as it is to fathom, Mr. President, just because you’re the leader of the free world, doesn’t entitle you to a free pass, just a free press.”\n\nGood points.\n\nQuite right.\n\nAs Thomas Jefferson opined: “The people are the only censors of their governors.” And the way they censor is through a free and vibrant press.\n\nAs Jefferson also said: “The only security of all is in a free press.”\n\nExactly.\n\nTrump is great; Trump is probably the best president this country’s seen since Ronald Reagan — and probably the best president this country will see for years to come. The economy is rocking, the world’s governments are respectful of American once again, U.S.-Israeli relations are warmed — and most importantly, the nation, minus the leftists, is feeling a sense of optimism and hope that had gone lacking for eight long years under the previous administration.\n\nTrump, in a word, is great.\n\nBut you know what’s greater?\n\nFreedom. Freedom in all of its glorious, inspiring, messy and uncomfortable forms.\n\n• Cheryl Chumley can be reached at [email protected] or on Twitter, @ckchumley.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Neil Cavuto, Fox News host, sent a scathing message President Donald Trump's way on national television, telling the White House chief that his cable company didn't work for him -- didn't work for anybody in the administration, in fact. It was a bold stand for the free press.", "authors": ["The Washington Times Http", "Cheryl K. Chumley"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2017/11/15/Neil_Cavuto_c16-0-883-506_s1770x1032.jpg?0cdbfc6a7bd6512ae2cb8994264c6d784c9466e0"}