{"pub": "yahoo", "url": "https://sg.news.yahoo.com/silva-hails-apos-magnificent-apos-023102576.html", "downloaded_at": "2019-10-24 23:57:35.986018+00:00", "title": "Silva hails 'magnificent' Mbappe after PSG star breaks Messi record", "language": "en", "text": "Paris Saint-Germain captain Thiago Silva heaped praise on hat-trick hero Kylian Mbappe after his record-breaking Champions League display.\n\nMbappe came off the bench and scored three goals in a devastating performance as PSG routed Club Brugge 5-0 on Tuesday.\n\nThe PSG sensation became the youngest player to score 15 Champions League goals aged 20 years, 306 days, eclipsing Barcelona superstar Lionel Messi – who was 21 years, 288 days.\n\nSilva hailed Mbappe, telling reporters: \"He is well present, he is ready, he has gifts, I can't tell you more because he is an incredible player.\n\n\"I'm very happy for him, for the team, for the way we played today. In the first half it was very difficult, we knew it, but in the second half we were much more effective.\n\n\"We had chances, we scored. Especially Kylian this player is magnificent.\"\n\nPSG were ruthless in Brugge, where the Ligue 1 holders made it three wins from three games in Group A as they closed in on the knockout round.\n\nMauro Icardi opened the scoring in the seventh minute, before Mbappe doubled the lead within nine minutes of his second-half introduction.\n\nMbappe supplied the assists for Icardi's second of the match in the 63rd minute, while the former took centre stage with another two goals to take home the match ball.\n\n\"We won a very tough game,\" PSG head coach Thomas Tuchel said. \"Very complicated. The result is exceptional.\n\n\"It's never easy to win against Brugges in Brugges. In the Champions League outside it's never easy. We scored five goals, it's really exceptional. It's a big step forward for the qualification [for the last 16].\"", "description": "Kylian Mbappe became the youngest player to score 15 Champions League goals, surpassing Lionel Messi.", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/XwGjt7DLjeZ8GuSlbNpQsw--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-GB/homerun/omnisport.uk/3e01dff0e828d3f17f1c98cf70a52906", "published_at": "2019-10-23"}