{"pub": "marketwatch", "url": "https://marketwatch.com/story/oil-prices-rise-after-two-session-skid-2019-10-22", "downloaded_at": "2019-10-22 13:33:40.006417+00:00", "title": "Oil prices rise after two-session skid", "language": "en", "text": "Crude oil futures rose on Tuesday, after a two-day slide, as traders await fresh updates on weekly U.S stockpiles.\n\nWest Texas Intermediate crude for November delivery CLX19, +1.59% gained 45 cents, or 0.8%, at $53.96 a barrel on the New York Mercantile Exchange, after falling 0.9% on Monday. The November contract, expires at Tuesday’s settlement. The December contract CLZ19, +1.51% was up 32 cents, or 0.6%, at $53.86 a barrel.\n\nGlobal benchmark Brent crude for December BRNZ19, +1.34%, meanwhile, added 43 cents, or 0.7%, to $59.39 a barrel on the ICE Futures Europe exchange, following a 0.8% skid on a day ago.\n\nCrude-oil has been under pressure amid worries about global appetite for the commodity as economies inside and outside of the U.S. show signs of a slowdown. However, hope that the U.S. and China may strike a trade agreement has provided a tepid lift for crude prices.\n\n“Oil is down 1 % since Monday morning with concerns about global demand steering the ship as geopolitical risk premium continues to evaporate,” wrote Stephen Innes, an independent market strategist, in a Tuesday research note.\n\nPresident Trump on Monday said Sino-American trade negotiations were progressing well, and his top trade negotiator, Robert Lighthizer, suggested that a draft agreement could be forged at the Nov, 11-17 Asia-Pacific Economic Cooperation meeting in Santiago, Chile.\n\nLater in the session, the American Petroleum Institute will release its weekly inventory update at 4:30 p.m. Eastern Time, ahead of the U.S. Energy Information Administration due at 10:30 a.m. Wednesday.\n\n“Despite all of the doom and gloom talk and the expectations of a big oil supply build, the whisper number on the street may actually give the market a surprise, when the American Petroleum Reports (API) releases its report tonight after the close at 3.30p Central Time,” wrote Phil Flynn, senior market analyst at The Price Futures Group, in a daily research note.\n\n“Despite low refinery runs and an expected build in the Cushing, Oklahoma delivery hub, sources are suggesting that we may get a big surge in U.S. oil exports and a drop in U.S. oil imports and could set the stage for a surprise crude oil draw,” he wrote.", "description": "Crude oil futures rise on Tuesday, after a two-day slide, as traders await fresh updates on weekly U.S stockpiles.", "authors": ["Mark Decambre"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HN831_hormus_ZG_20190722082221.jpg", "published_at": "2019-10-22"}