{"pub": "businessinsider", "url": "https://businessinsider.com/nobody-buys-healthier-kfc-items-uk-2019-9", "downloaded_at": "2019-09-13 11:20:11.538916+00:00", "title": "A senior KFC executive said it gave up trying to do healthy alternatives in one of its biggest markets because nobody was buying them", "language": "en", "text": "KFC says it took several healthier, non-fried products off menus in the UK because nobody was buying them.\n\n\"It didn't go brilliantly well. We tried and we failed to launch a non-fried product,\" Jenny Packwood, KFC UK and Ireland's head of brand engagement, told attendees at Public Health England's 2019 conference on Wednesday.\n\n\"We were unable to sustain sales. They were just not selling.\"\n\n\"It's no good launching a product which looks good nutritionally but then nobody buys.\"\n\nA man walks past a logo of KFC, outside a restaurant in Shanghai Reuters\n\nKFC scrapped the \"Brazer grilled chicken sandwich\" in 2011, the \"Rancher sandwich\" in 2012, and a \"pulled chicken\" meal in 2015 due to lackluster sales, The Times of London reported.\n\nThe UK is KFC's fifth-largest global market, with around 900 franchises in the country.\n\nRead more: I tasted KFC's meatless fried 'chicken' dishes and even though they look like the real thing, they didn't taste like it\n\nPackwood said KFC UK has found that the best way to lure customers toward healthier options is by the \"health by stealth\" technique — where fast-food chains very slowly lower fat, calorie, and salt levels over time.\n\nShe also added that KFC UK once altered its chips to be thicker, so they absorbed less oil, which cut calories by 18% and fat by 12%, but that the move received \"a lot of grief.\"\n\nRead more: KFC rolls out first plant-based fried 'chicken' with Beyond Meat\n\nPublic Health England — the UK's health advisory body run out of the Department of Health — will soon cap the maximum calories in any ready meal to 544 calories, The Telegraph newspaper reported in December 2018, citing the draft proposal.\n\nA large number of popular, medium-sized meals from UK fast food outlets like KFC currently exceed that threshold. For instance, a six-piece \"Bargain Bucket\" meal is 610 calories, according to the KFC UK nutrition index.\n\nThe KFC \"Fillet Box Meal\" — which contains a chicken burger, chicken drumstick, fries, side, and drink— is 1045 calories.", "description": "The healthier Rancher and Brazer chicken sandwiches \"were just not selling,\" KFC UK's Jenny Packwood told a government health conference on Wednesday.", "authors": ["Bill Bostock"], "top_image": "https://amp.businessinsider.com/images/5d7b59192e22af02fc12f0f4-1920-960.jpg", "published_at": "2019-09-13"}