{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/ethereum-futures-the-next-big-derivative-to-hit-the-market", "downloaded_at": "2019-10-18 01:05:20.090974+00:00", "title": "Ethereum Futures: The Next Big Derivative to Hit the Market?", "language": "en", "text": "The United States Commodity Futures Trading Commission (CFTC) hasn’t come to bury Ether, it’s come to regulate it. That was the message drawn from Heath Tarbert’s remarks from the stage at Yahoo Finance’s All Markets Summit in New York City on Oct. 10, which could have important consequences for the crypto and blockchain industry. He went on:\n\n“It is my view as Chairman of the CFTC that Ether is a commodity, and therefore it will be regulated under the CEA. And my guess is that you will see in the near future Ether-related futures contracts and other derivatives potentially traded.”\n\nEther (ETH) — the native cryptocurrency of the Ethereum ecosystem — is a public, open-source blockchain-based platform that features smart contracts. As a commodity, Ether would be regulated in the U.S. by the CFTC; if it were found to be an investment, by contrast, it would be regulated by the Securities and Exchange Commission (SEC).\n\nHence the importance of a definition, whereby Bitcoin (BTC) is also a commodity in the view of U.S. regulators, its futures contracts have been traded since December 2017. Perianne Boring, CEO of the Chamber of Digital Commerce, told Cointelegraph that the chairman’s pronouncement was “incredibly important,” adding:\n\n“The hint from Chairman Tarbert that ETH derivatives may be introduced soon are a sign of market maturity, and an encouraging step forward in recognizing the benefits of digital assets in this country.”\n\nIt may be too early to gauge when the first Ether futures product will go to market. “At this time, CME Group has no plans to introduce additional cryptocurrency futures,” including Ether futures, a spokesperson for the owner of the Chicago Mercantile Exchange (CME) — the largest player in the Bitcoin futures market — told Cointelegraph, adding:\n\n“Right now, we are focused on bringing options on CME bitcoin futures to market in Q1 2020.”\n\nMore institutional investors?\n\nMore futures trading tools could help the crypto industry attract institutional investors like mutual funds and hedge funds. Funds typically have investment constraints that allow them to only invest in specific assets for their portfolio, and this has inhibited them from investing in digital assets. But when a crypto futures contract is settled, investors are paid in U.S. dollars, not in BTC or ETH, which could make a difference.\n\nRelated: Are Trading Vehicles Dragging Crypto Into Maturity?\n\nMainstream investors, too, have avoided Bitcoin and Ether because of storage problems. If investors lose their private key, they lose their Bitcoin. Furthermore, custodians and brokers are now available that can take care of investing and storing, but fees for such services are often high. By investing in futures contracts, participants can bet for or against the price of the cryptocurrency without having to actually own or store it.\n\n“There is still not a lot of institutional interest in crypto,” Lanre Sarumi, CEO of crypto asset derivative exchange Level Trading Field, told Cointelegraph. The exchanges believed if they built a Bitcoin futures product, the institutions would come, he said, but the response has been underwhelming. In March, for example, the Chicago Board Options Exchange (CBOE), the first U.S. exchange to introduce Bitcoin futures, announced that it would stop listing the product. Sarumi added:\n\n“Institutional investors appear to have found more attractive investment alternatives elsewhere, and Ether futures aren’t likely to fare any better. We are talking about Ether, the cryptocurrency, not Ethereum, the blockchain platform — which continues to attract interest from institutions.”\n\nMeanwhile, Bitcoin futures contracts at CME averaged 5,534 contracts traded per day in the third quarter of 2019, up 10% from the same quarter in 2018, but down from the second quarter of 2019, the company told Cointelegraph, noting that institutional interest was building in the third quarter. Recently, CME has also notified the CFTC that it was raising the spot contract limit from 1,000 to 2,000.\n\nMeanwhile, an offering form the Intercontinental Exchange’s Bakkt platform had a record day on Oct. 9, with 224 Bitcoin future contracts with volume of $1.92 million. However, most days over the past two weeks (Sept. 24–Oct. 15) have had a daily volume less than $1 million.\n\nStabilizing the market\n\nFutures are simply contracts to buy or sell a designated quantity of an asset at a specified price and date, and they are particularly useful when the underlying asset is volatile, which is the case with Bitcoin — and to a lesser degree with Ether, as David L. Yermack, professor at NYU Stern, noted to Cointelegraph. These regulated futures contracts can help to stabilize the crypto market, he said:\n\n\"I don’t see many differences in the economic rationales for Ether futures compared to Bitcoin. Ether has a lot less speculative trading volume, however, so it remains to be seen how much demand exists for Ether futures.\"\n\nQuestions remain, however: Will futures trading lead to financial manipulation or the cornering of the market? Some worry that the government is relying on profit-seeking exchanges (e.g., CME and CBOE) — rather than the CFTC, a government regulator — to self-certify new futures products, Indiana University professor Margaret Ryznar wrote.\n\nSelf-certification requires the exchange to prove that the new contract is not readily susceptible to manipulation, with Ryznar adding, “Futures generally contribute to systemic risk, but distinctive features of Bitcoin futures heighten concerns.”\n\nEven though the SEC and CFTC seem to accept that both Bitcoin and Ether are commodities — and not securities — such clarity is not assured for the future. It seems to depend on the degree of decentralization at hand (i.e., the extent to which a cryptocurrency is controlled by a third party).\n\n“You can have a situation where something in an initial coin offering is a security, but over time, it gets more decentralized, and there's a tangible value there, so you can have things that change back and forth,” Tarbert said. This may not be ideal, especially for institutional investors desiring regulatory predictability.\n\nSpencer Bogart, head of research for Blockchain Capital, noted that shorting Bitcoin is \"extremely risky\" because there is no natural point, like price–earnings ratios, where people can tell if the cryptocurrency is over-valued. The same could presumably be said for Ether.\n\nIndeed, the Futures Industry Association (FIA) has opined that Ether, more technically complex than Bitcoin because of its smart contract overlay, may be more difficult to risk manage. The FIA urged the CFTC to thoroughly vet any Ether derivative contract.\n\nOptions trading in Q1 2020?\n\nAs noted, CME intends to launch a Bitcoin options product in the first quarter of 2020, pending regulatory review. While both futures and options are derivatives, they work differently. Futures commit a buyer to selling or buying the underlying asset at the previously agreed upon strike price.\n\nOptions, by comparison, are not obligatory; the option may never be exercised. Options are expected to be popular among Asian traders and miners, CME’s Tim McCourt said. Asked about the significance of Tarbert’s recent remarks, Sarumi said:\n\n“They are very significant. Any firm that was hesitating before now has a statement they can fall back on. But will it encourage institutional investors? I don’t think so.”\n\nIn his first public appearance as CFTC chairman, Tarbert also stressed the importance of blockchain and digital assets to the U.S., sweet music to digital evangelists like the Chamber of Digital Commerce. The U.S. has been falling behind in blockchain innovation, receiving little support from U.S. policymakers and regulators, Boring said, but here the chairman of the CFTC was saying, “I want the United States to lead because whoever leads in this technology is going to end up writing the rules of the game.”\n\nOverall, it is fair to say that it has been a struggle for regulators and the exchanges to develop Bitcoin derivatives that are both safe and attractive to investors, especially institutions. Doing the same for technically complex Ether derivatives could be even more of a challenge.", "description": "As exchanges expand Bitcoin derivatives, the CFTC clears the way for Ether futures. But will investors be interested in such a tool?", "authors": ["Andrew Singer"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvZGU0ZmQzNGQ1OTk2MWQ5M2Y0NWNkMzEyOGVjNjIwYTcuanBn.jpg", "published_at": "2019-10-17"}