{"pub": "yahoo", "url": "https://news.yahoo.com/sanofi-recalls-popular-heartburn-drug-155741760.html", "downloaded_at": "2019-10-20 12:34:05.679574+00:00", "title": "Sanofi recalls popular heartburn drug Zantac as FDA investigates probable carcinogen", "language": "en", "text": "Sanofi said Friday it will recall the widely-used heartburn drug Zantac from stores in the United States and Canada as the drugmaker and Food and Drug Administration investigate a probable carcinogen detected in the drug.\n\nThe FDA last month said it discovered a probable carcinogen called NDMA, or nitrosodimethylamine, in the drug Zantac and its generic versions. The FDA, Canadian and European drug regulators are evaluating possible risk to millions of people who take ranitidine, the active ingredient in Zantac and its generic versions.\n\n\"Due to inconsistencies in preliminary test results of the active ingredient used in the U.S. and Canadian products, Sanofi has made the decision to conduct the voluntary recall in the U.S. and Canada as the investigation continues,\" the company said in a statement.\n\nThe FDA said preliminary tests detected levels of NDMA that equal or slightly exceed the amounts found in foods such as cured and grilled meats.\n\nThe FDA has not recommend people stop taking the drug. However, the agency said people who want to discontinue prescriptions should talk to their doctor or pharmacist. Consumers who buy non-prescription versions can switch to other over-the-counter drugs; there are multiple drugs available for the same or similar uses, the FDA said.\n\nThe FDA began evaluating ranitidine after New Haven, Connecticut-based Valisure, an online pharmacy, notified the agency that its testing found Zantac and generic versions contained NDMA levels significantly higher than the FDA's recommended daily limits. That prompted the FDA to conduct its own tests of the drugs. It did not find the same levels of the probable carcinogen that Valisure did, but the levels were high enough to warrant followup testing.\n\nSince then, pharmaceutical companies have recalled generic versions of the drug sold at Walgreens, Walmart and Rite Aid over concerns the medications contain NDMA.\n\nDrug manufacturer Apotex said it's recalling 75 mg and 150 mg ranitidine tablets sold over the counter at the three chain pharmacies because the drugs might contain low levels of the cancer-causing impurity NDMA.\n\nThis article originally appeared on USA TODAY: Sanofi recalls the heartburn drug Zantac to investigate carcinogen", "description": "Sanofi said it will voluntarily recall Zantac as the drugmaker and FDA investigate the source of NDMA, a probable carcinogen.", "authors": ["Ken Alltucker", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/PVsVktUFZJF6i8edxsdgZA--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/1009217/7853c24b-3e63-4f01-8820-b3bdc8e4c358/1c0b2a0d-15e5-595a-a272-d1661c25b57d/data_3_0.jpg?s=14f6196a220e31e07a7c955ca2a5b1cc&c=ee98080e2ed5ffc8ca880595daff5414&a=tripleplay4us&mr=0", "published_at": "2019-10-18"}