{"pub": "theverge", "url": "https://theverge.com/2019/10/8/20904270/microsoft-airband-international-internet-access-colombia-ghana-latin-america-sub-saharan-africa", "downloaded_at": "2019-10-08 10:25:50.234882+00:00", "title": "Microsoft wants to connect another 40 million global internet users", "language": "en", "text": "Microsoft’s Airband initiative is going international, with a newly formalized goal to get 40 million more people connected to the internet by July 2022. The program, which launched in 2017 with the goal of improving rural internet access across the US, is expanding to offer better internet access across Latin America and Sub-Saharan Africa.\n\nIn America, Microsoft is relying on unused TV white space (TVWS) operating in the 600 MHz spectrum to offer broadband access to 3 million Americans. Internationally, however, Microsoft’s efforts will rely both on TVWS as well as other “innovative technologies.” The company aims to partner with local organizations to understand the specific needs of each area; working with governments to remove regulatory obstacles to the technology, and with ISPs to deliver internet access to end-users.\n\nMuch of the efforts focus on using TV white space technology\n\nMicrosoft boasts that its international efforts have already had some success. In Colombia, for example, it has completed a small project to get two schools and five farms connected to the internet using TVWS technology, and it’s also co-invested with local ISPs to extend internet access to 6 million rural Colombians. In Ghana, it’s worked to deregulate TVWS technology in a move that will allow one broadband provider to offer its services to as many as 800,000 people.\n\nMicrosoft is not the only company putting a big focus on connecting areas of the developing world up to the internet. Google’s “Next Billion Users” initiative aims to make its services available to more people globally, while Facebook has explored everything from internet drones to satellites in its quest to allow more people to get connected to the internet. The motivation is simple; for all three companies, every new internet user is another potential customer.", "description": "Microsoft’s Airband initiative is going international, with a goal to get 40 million more people on to the internet by 2022. The program will now aim to offer better internet access across Latin America and Sub-Saharan Africa.", "authors": ["Jon Porter", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/RXS94PShNVGWkMjqIAJ8dNp4jcA=/0x94:4800x2607/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19269180/BLUETOWN_Ghana8.jpg", "published_at": "2019-10-08"}