{"pub": "cnbc", "url": "https://cnbc.com/2019/10/25/americas-sex-recession-could-lead-to-an-economic-depression.html", "downloaded_at": "2019-10-30 00:00:58.174699+00:00", "title": "America's sex recession could lead to an economic depression", "language": "en", "text": "Some experts focus on the fact that Millennials are dealing with growing student loan debts, making their economic reality much worse than when previous generations were their age. But it also turns out that student loan debt isn't the top source of debt for Americans aged 23 to 38; it's credit card debt .\n\nBut the economy has been steadily growing for more than 10 years now, which encompasses most of the adult lives for Americans under 30. The enduring reports of lower sex rates despite the overall economic recovery have led to diverging explanations.\n\nBased on that data, it makes sense that the millions of Americans who entered adulthood during the Great Recession a decade ago are more skittish about marriage and sex. The Great Depression era saw the U.S. birth rate hit an all-time low in 1936 . Since birth control was much less available back then, it's fair to assume sex in America fell sharply during that time as well.\n\nA 2018 Census Bureau report would suggest the latter, noting that economic security is a high priority for Millennials when they seek marriage or serious committed relationships.\n\nTo that end, there's a bit of a \"chicken or the egg\" question to ask here: is America facing economic challenges because younger Americans are having less sex? Or are younger Americans having less sex because of their unique economic challenges?\n\nBefore getting into why the falling sex rates, especially for younger Americans, threatens our GDP, it's important to address why the trend is happening in the first place.\n\nForget the trade wars, automation, and even the skills gap. The real threat to the U.S. economy may be that fewer Americans are in the mood for love.\n\nThe drop in sex rates and marriage rates are clearly related. Fewer people making adult connections simply leads to a decline in both, and you don't need to be an economic genius to know that fewer marriages and children weaken economic demand overall.\n\nThat fact shifts us to pinpoint the differences in millennial lifestyles, and that brings us back to some common sense wisdom about life, relationships, and sex.\n\nSex has always been a part of the human courtship ritual, but the widespread availability of birth control in America made it a more regular aspect of dating. Yes, there's plenty of casual \"no strings\" sex available on Tinder and Grinder. But the drop in sex rates and marriage rates are clearly related.\n\nFewer people making adult connections simply leads to a decline in both, and you don't need to be an economic genius to know that fewer marriages and children weaken economic demand overall.\n\nA number of studies have recently blamed the fall in sex and marriage rates on technology and the new opportunities it gives young adults to withdraw from in-person human relationships. Everything from online porn to sophisticated video games, to social media is being used by many as a substitute for real human contact, especially for men.\n\nThe male tendency to seek these substitutes may be the biggest single reason why sex and marriage rates are dropping. A new Cornell University study shows that women are still likely to be more attracted to and want to marry men with stronger economic prospects.\n\nIn other words, despite decades of positive strides for women in the workplace and beyond, women still find a wealthier man more attractive. So men still have to work harder to attract women. But now they have porn, video games, and other technology to provide them with much easier to obtain substitutes for that gratification. Avoiding the pressure to earn more to get more is likely also behind the multibillion-dollar race to create a realistic sex robot industry.\n\nOf course, there's an economic positive to this trend when we focus on teenagers. Teenage sex and pregnancy are also continuing to fall, bringing relief to the economic and cultural devastation they often cause. Less teen sex is an example of increased national responsibility.\n\nBut for men in their 20s and beyond, the sex recession appears to be a symptom of a delayed entrance into the world of fully responsible adulthood. Beating the \"failure to launch\" trend isn't just about moving out of your parents' house, but it's also about pursuing adult relationships and starting your own family.\n\nNo one is saying people should have sexual relationships if they have no real connection to another person. But declining sex rates are a sign of a corresponding decline in the adult relationships that stoke acceptance for the costs of dating to the costs of the trappings of domestic family life.\n\nThe sex recession seems like an even more menacing sign that technology, especially A.I. technology, is seriously weakening the primordial human desire to mate with other humans and do the work necessary to make that happen. That \"work\" has been an essential economic component since civilization began.\n\nWe've heard of the threats tech poses to job creation, but the drop in sex rates may be the clearest sign yet that tech's challenges to modern love might be the biggest economic threat of all.\n\nJake Novak is a political and economic analyst at Jake Novak News and former CNBC TV producer. You can follow him on Twitter @jakejakeny.", "description": "Enduring reports of America's sexual recession are a sign of a serious problem for a wide ranging list of sectors from real estate, to apparel, to condoms.", "authors": ["Jake Novak"], "top_image": "https://image.cnbcfm.com/api/v1/image/106204067-1572015356064gettyimages-968442708.jpeg?v=1572015405", "published_at": "2019-10-25"}