{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7622421/Russia-launches-missile-laden-combat-icebreaker-warship-cut-5ft-ice.html", "downloaded_at": "2019-10-28 23:41:46.280305+00:00", "title": "Russia launches first missile-laden 'combat icebreaker' warship which can cut through 5ft thick ice", "language": "en", "text": "Russia has launched its first 'combat icebreaker' to boost its military presence in the Arctic.\n\nThe Ivan Papanin can cut through almost five-foot thick ice and is heavily armed with Kalibr cruise missiles and a 76.2mm gun.\n\nIt will act as the base to a Ka-27 anti-submarine helicopter and two Raptor-class speedboats.\n\nThe Ivan Papanin, Russia's first 'combat icebreaker', can cut through almost five-foot thick ice and is heavily armed with Kalibr cruise missiles and a 76.2mm gun\n\nThe 8,500-tonne vessel, launched in St Petersburg, is the lead vessel of a new class of ice-countering warships in the Russian navy.\n\nThe icebreaker will enhance Russia's interests in the Arctic where the country is exploiting vast offshore oil and gas reserves.\n\nWork on the 375-foot vessel began in 2017 and it will be ready for service in 2022 or 2023.\n\nThe 8,500-ton vessel, launched in St Petersburg, is the lead vessel of a new class of ice-countering warships in the Russian navy\n\nThe ship will have a crew of 60.\n\nThe vessel will be capable of two-month-long missions with a range of 6,000 nautical miles.\n\nRT - a state-owned Russian media network - reported: 'Intercepted violators can be towed to port for detention with no external help.\n\n'The Ivan Papanin may also serve as a transport ship for sensitive military cargos or as a support ship in a battle group.\n\nWork on the 375-foot vessel began in 2017 and it will be ready for service in 2022 or 2023\n\nThe Russian Navy already has an icebreaker called the Ilya Muromets, which is unarmed.\n\nRecent years have seen Moscow increasing its military patrols and bases in its huge Arctic region.\n\nWestern estimates suggest there are vast untapped energy resources in the Arctic comprising 90 billion barrels of oil, 1.7trillion cubic feet of natural gas and 44 billion barrels of natural gas liquids.\n\nMoscow is seeking UN approval for its claim that underwater ridges mean its continental shelf should be expanded, increasing its right to exploit the untapped reserves.", "description": "Russia's new combat icebreaker, the Ivan Papanin, can cut through almost five-foot thick ice and is heavily armed. Work began on the 375-foot vessel in 2017 and it will be ready in 2023.", "authors": ["Will Stewart For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/16/20286426-0-image-a-48_1572278558469.jpg", "published_at": "2019-10-28"}