{"pub": "guardian", "url": "https://theguardian.com/business/2019/oct/15/neil-woodford-equity-income-fund-wound-up", "downloaded_at": "2019-10-15 08:03:09.648340+00:00", "title": "Neil Woodford’s £3.5bn equity income fund to be wound up", "language": "en", "text": "Thousands of investors to get some of their money back after being blocked for four months\n\nNeil Woodford’s £3.5bn flagship investment fund will be wound up and the cash returned to investors, more than four months after it was suspended.\n\nThe former star fund manager had planned to reopen the Woodford Equity Income Fund, but the administrator, Link Fund Solutions (LFS), said it had concluded that it was in the best interests of investors for it to be wound up.\n\nWoodford, who has been scrambling to rescue the fund, said he opposed the move. “This was Link’s decision and one I cannot accept, nor believe is in the long-term interests of LF Woodford Equity Income Fund investors.” He has been removed as investment manager of the fund with immediate effect.\n\nLFS wrote to investors to tell them that cash will be returned to them “at the earliest opportunity”. It will begin winding up the fund on 17 January, after giving investors three months’ notice as required. Woodford ceases to be the investment manager of the fund with immediate effect.\n\nThe fund was suspended on 3 June after investors clamoured to withdraw their money following a series of bad stock market bets.\n\nWoodford continued to charge the fund fees of about £65,000 a day, angering locked-out investors. The fund manager argued that the fees were needed to pay wages and other costs while he shifted investments away from smaller, illiquid assets into larger publicly quoted companies. Many of his investments have done badly, including the estate agent Purplebricks, finance firm Burford and doorstep lender Provident Financial.\n\nIn the letter to investors, LFS said: “Whilst progress has been made in relation to repositioning the fund’s portfolio, this has unfortunately not been sufficient to allow reasonable certainty as to when the repositioning would be fully achieved and the fund could be reopened.\n\nSign up to the daily Business Today email or follow Guardian Business on Twitter at @BusinessDesk\n\n“We have therefore concluded that it is now in the best interests of all investors for the fund to be wound up by way of an orderly realisation of the fund’s assets. This orderly realisation will allow the return of money through interim payments to investors more quickly than if the fund had remained suspended for a longer period of time.”\n\nBlackrock Advisers and PJT Partners have been appointed to assist with the winding-up of the fund.\n\nThe size of Woodford’s fund has crashed to about a third of its peak of more than £10bn due to withdrawals and poor performance.", "description": "Thousands of investors to get some of their money back after being blocked for four months", "authors": ["Julia Kollewe", "Nils Pratley"], "top_image": "https://i.guim.co.uk/img/media/7ab66e8f13672a752da584d07212cac61222f69b/0_0_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7a39131050bbcb1aff6d0a14d6cf3237", "published_at": "2019-10-15"}