{"pub": "yahoo", "url": "https://ph.news.yahoo.com/philippines-frontline-u-competition-china-160000648.html", "downloaded_at": "2019-09-20 08:17:55.338245+00:00", "title": "The Philippines Is the Frontline in the U.S. Competition with China", "language": "en", "text": "Philippines president Rodrigo Duterte was in China at the end of last month for his fifth trip there as president. He faces increasing domestic pressure for his conciliatory approach to China, so all eyes were on whether he would keep his promise to raise the 2016 UN tribunal ruling in the Philippines case against China, which had largely found in the Philippines’ favor. He did, but Chinese president Xi Jinping reiterated that Beijing did not recognize the award. This was a repeat of their interaction in April when Duterte broached the South China Sea while attending the Belt and Road Forum. Manila was then expecting more than $18 billion worth of deals to be signed. In both cases Duterte did not press the issue.\n\nThe Philippines is on the frontline of U.S.-China competition. This has, in some respects, benefited the country. Washington is paying increased attention to the Philippines: in March, Washington clarified that the reference to “Pacific” in the U.S.-Philippines mutual defense treaty included the South China Sea. Beijing lavishes promises of Belt and Road Initiative deals, though little has materialized. Top officials I spoke to on a visit to Manila in July take the view that Beijing looks ready to agree to a deal to cooperate on oil and gas development that would implicitly accept that the Philippines enjoys sole sovereign rights in its exclusive economic zone (EEZ). If so, Beijing did not show it cards at the recent bilateral: Xi merely called for the inter-governmental committee created to look into the possibility of joint exploration to prepare a “substantive program.”\n\nTroubled Waters\n\nRead the original article.", "description": "What should the Philippines foreign policy be in an era of great-power competition?", "authors": ["Lynn Kuok"], "top_image": "https://s.yimg.com/uu/api/res/1.2/GFR41eFCA6nxz2ej4IScZQ--~B/aD05NjA7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/881b0477c2183458cc7a1489b44dbb91", "published_at": "2019-09-19"}