{"pub": "breitbart", "url": "https://breitbart.com/news/georgia-police-officer-found-not-guilty-of-manslaughter-for-fatal-shooting-during-traffic-stop", "downloaded_at": "2019-10-07 00:16:28.149997+00:00", "title": "Georgia police officer found not guilty of manslaughter for fatal shooting during traffic stop", "language": "en", "text": "Oct. 6 (UPI) — A former police officer was found not guilty of manslaughter charges after shooting and killing an unarmed black man during a traffic stop in 2018.\n\nKingsland police officer Zechariah Presley was found not guilty of both voluntary and involuntary manslaughter charges for fatally shooting 33-year-old Tony Green, but was found guilty of violation of oath of a public officer.\n\nPresley faces one to five years in prison and will remain in custody until his sentencing hearing on Oct. 18.\n\nHis defense attorneys said they plan to appeal the guilty charge based on “legal precedent.”\n\nPresley fided eight shots while pursuing Green on June 20, 2018, saying he was in fear for his life after rolling on the ground in an altercation with Green, who was unarmed.\n\nProtesters outside the courthouse chanted “no justice, no peace” after the not guilty verdict was delivered and Green’s father, Wayne Anderson, said his family plans to file a civil suit against the City of Kingsland.\n\n“My son was murdered and the man that murdered my son gets to go home to his sons and can only possibly serve one to five for murder,” Anderson said. “This ought to serve notice to a lot of our young black men — and black men, period — that you can run up and down the football field, you can run up and down the courts, you can hit baseballs but at the end of the day when they see you, they see a black man.”", "description": "Oct. 6 (UPI) — A former police officer was found not guilty of manslaughter charges after shooting and killing an unarmed black man during a traffic", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-06"}