{"pub": "theverge", "url": "https://theverge.com/2019/10/22/20919575/microsoft-windows-7-parties-10th-anniversary-os-party", "downloaded_at": "2019-10-22 20:37:43.623103+00:00", "title": "Apparently, I attended a Windows 7 party 10 years ago", "language": "en", "text": "On this day in 2009 — 10 years ago — Microsoft released its new Windows 7 operating system to the public. Less than three years after its unfavorable predecessor, Windows Vista, was released, it added support for touchscreen computers and brought new features like snapping windows, a new Superbar, and an updated file management system to PCs.\n\nI don’t particularly remember a huge difference in user experience. In fact, I don’t think I actually upgraded my family’s Windows XP desktop. I also started using a Mac in 2008 when I went to college.\n\nBut one thing I do remember is the Windows 7 party my friend Matt held at his house.\n\nAround the time Windows 7 was released, Microsoft developed an ingenious marketing campaign: it would encourage households to throw parties for its new operating system. The company gave out “party packs” containing a copy of the software along with goodies like Windows 7-themed napkins, balloons, and tote bags to users who were willing to participate and promote Windows 7 to their near and dear ones.\n\nA Microsoft-commissioned party tutorial video (above) suggests that hosts “throw a party with Windows 7 as an honored guest,” and it encourages non-honorary guests to use the host’s computer to play around with features like Snap, Web Slices, or Windows.com/help.\n\nThe party I attended was not so effortlessly glamorous, but it was probably just as boring as those four adults described their parties to be. We were a bunch of teenagers hanging out at Matt’s parents’ house, and none of us were old enough to drink.\n\n“I remember he threw it though...maybe?”\n\nI don’t remember actually using Windows 7 at the party, and I don’t think I would have cared to. Matt always kept his desktop in the basement, anyhow, and apparently, we were all upstairs in his dining room. I do remember really liking the design of the tote bag, though, and I used it for many years after.\n\nI don’t have any other memories of the party, which may speak to its boringness. I asked my friend Tom — who may or may not have attended — if he remembers going to the party. “I don’t think so. I remember he threw it though...maybe?”\n\nDid this party even happen? While I’m reading about the Mandela effect, Tom texts me a link to the original album of photos on Matt’s Facebook page. Under the picture of the box of swag, Matt’s mother had commented: “Looks like a good time...but where are the people?”\n\nGrid View\n\n\n\n\n\n\n\n\n\nThere is a photo of a completed 72-piece Windows 7 puzzle. So that’s one thing we did. Another photo depicts my friends John and Danica and Matt’s brother Richard attending. But when I ask everyone in those pictures about the party, no one really remembers anything that happened.\n\nSo I asked my friend Matt to share what he remembers about the event he hosted.\n\nHow did you hear about the Windows 7 party campaign?\n\nAlmost certainly from a tech news podcast at the time. This Week in Tech, Buzz Out Loud, or Windows Weekly (if it was running at the time).\n\nWhat did the party pack include?\n\nA license for Windows 7, some Windows-colored balloons and streamers, a small puzzle, some tote bags, napkins, a deck of cards, possibly more.\n\nWho went to the party?\n\nA bunch of friends from high school. I was 20 at the time. Andrew, John, Danica, maybe Jon, maybe Dan?\n\nDid you have anyone play games on your computer?\n\nAt that event? I don’t think so. Their idea was that you would demonstrate the Windows 7 install and features, but I don’t remember what we did. I doubt we used it more than me saying “here it is.”\n\nDid you convince anyone to get Windows 7?\n\nI doubt it. They were all probably going to be customers anyway. There was a lot of pain in using Vista at the time, and XP was getting old.\n\nDid you use Windows 7?\n\nYeah, for many years. I used that license on a self-built desktop for years, and later after moving to OS X, I used that license with VMware for a few Windows applications I needed. I think I stopped using it when I made a new desktop in late 2016.\n\nWas the party a success?\n\nI guess so? People came over, and we shared some food and did some of the Microsoft activities like solving the puzzle. I think redoing it as an adult with alcohol or actual food and planning a better theme would make a better party.\n\nWould you throw another operating system party?\n\nAbsolutely.\n\nIn hindsight, this seems like such an absurd thing for any tech company to do, especially where they gave away a license to their flagship product. I love it, and I wish someone would do such an event again.", "description": "On this day in 2009 — 10 years ago — Microsoft released its new Windows 7 operating system to the public and my friend Matt had a party.", "authors": ["Andrew Marino", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/o5LF8P6QWfNYjuVcraqp2HsdVF0=/0x232:2048x1304/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19309470/4045145538_009513fd95_o__1_.jpg", "published_at": "2019-10-22"}