{"pub": "businessinsider", "url": "https://businessinsider.com/using-credit-cards-freelance-small-business-cash-flow", "downloaded_at": "2019-10-18 01:11:58.382415+00:00", "title": "I struggled to manage my cash flow as a freelancer until I embraced an obvious tool: credit cards", "language": "en", "text": "As a small business owner in the creative industries, cash flow is often a problem.\n\nCredit cards allow me to better control my outgoing expenses, and manage the highs and lows of self-employment.\n\nI also earn travel points on my spending, which is an added bonus.\n\nRead more personal finance coverage.\n\nI'm one of those rare and lucky people who has a job that she thoroughly loves. I'm a freelance writer and have a solid business delivering content marketing, journalism, and other writing services. I've been at it for five years and have grown a successful business.\n\nIt's even better now that I've started using credit cards to manage one of my biggest pain points in my career: cash flow.\n\nUsing credit cards responsibly to pay my bills has helped me even out the highs and lows of self employment. This eliminated one of the biggest stressors associated with my job. Here's the system that works for me:\n\nWhat I earn and what I'm paid don't always match up\n\nIn most fields, you do your work, then collect a paycheck on a date that you know well in advance. Two weeks later, you're getting paid again. I don't have that predictability. I invoice as I submit my work. Depending on the client, payment is due 30, 60, or even 90 days after a project is complete. Other clients pay me after a project is published, which could be months after I finish the work. This is made worse by clients paying late, which is sadly typical in the industry.\n\nThis leads to a lot of uncertainly in my cash flow. I can control how much I work and the amount I invoice in a certain month, but I can't control when clients pay me. On a recent month, for example, I invoiced for more than $10,000, but was paid for less than $8,000. Having 20% of your income caught up in billing can make managing your money difficult.\n\nI use credit to build predictability\n\nFor years I would transfer money to savings, or pay a large amount on estimated taxes because I was expecting to receive more checks before my bills were due. However, this often came back to bite me when clients paid late. I would then scramble to withdraw from savings to pay bills.\n\nI realized that I could use credit to have more control over when I paid bills. I began paying my mortgage and student loans at the beginning of the month with cash (since those cannot be paid with credit). Then, I put almost all my remaining bills and spending on my credit card. After that, I could breathe easy: Even if clients paid late, I knew all my bills were paid on time.\n\nWhen checks came in for the rest of the month, I immediately paid those funds to the credit card, until my monthly expenses were covered. Even if I came up short because of a late client payment, I was paying minimal interest to keep a few hundred dollars on the card until I received a check. I decided the expense was worth the peace of mind my new system gave me.\n\nI got an unexpected benefit in travel rewards\n\nWhen I started this process, I had a few credit cards from past banks and my current credit union. However, they had relatively low limits, and no rewards. If I was going to use credit this much, I wanted to make it work for me.\n\nAfter researching my options for rewards cards, I opened a Capital One Venture Rewards card. With this card, I earn travel miles from purchases that I would be making anyway. When I started using a credit card to better control my cash flow I was looking to minimize stress, but it turns out that I was also able to utilize this unexpected benefit as well.\n\nWith the sign-up bonus of 50,000 miles (which is subject to change), I was able to book about $700 in free travel during the first quarter of using my system. These were trips I would have been taking anyway, so using credit card points gave me a huge savings.\n\nCredit cards are an individual solution to a bigger problem\n\nAs the self-employed owner of a small business, I expect to encounter cash flow issues. I know what times of year are busy for me, and save money for the slower seasons. However, in addition to this there's the added challenge of coping with clients who pay months late, a widespread issue for creative freelancers. Hopefully, this changes as people give more respect to creatives and people working in the gig economy.\n\nIn the meantime, I'm glad to have found a solution that works for me.", "description": "Credit cards allow me to better control my outgoing expenses, and manage the highs and lows of self-employment.", "authors": ["Kelly Burch"], "top_image": "https://image.businessinsider.com/5da8e610cc4a0a7e5147cdeb?width=1200&format=jpeg", "published_at": "2019-10-17"}