{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/how-to-get-android-10-on-your-samsung-galaxy-s10-right-now", "downloaded_at": "2019-10-16 00:26:51.143001+00:00", "title": "How To Get Android 10 On Your Samsung Galaxy S10", "language": "en", "text": "One of the bummers of buying a non-Pixel Android smartphone is that you are beholden to your manufacturer for Android updates. In other words, Google devices typically get giant upgrades like Android 10 first, and you have to sit and be envious until you get your shot—possibly months after the fact — if you splurged for a Samsung or Huawei device, to name a few.\n\nOwners of Samsung’s Galaxy S10, S10+, and S10e smartphones now have a shot to try out “Android 10.” I put that in quotes, as you’re really getting a chance to sign up for the beta for One UI 2.0 — Samsung’s customised UI that it built on the back of stock Android.\n\nTo get started, pull up the Samsung Members app. Once you’re in, look around to see if there’s any kind of notification or other alert that indicates you’re eligible to join the beta. If so, great! If not, you’re either unlucky or you’re on an ineligible carrier.\n\nOnce you’re in, make sure you run a software update on your device to actually download and install the beta. Before you do so, however, make sure you’ve backed up your device and saved anything critical that isn’t already stored in the cloud somewhere. If you’re lucky enough to make it into the beta, the usual warnings apply—you’ll be testing out prerelease software, which may or may not cause issues for your device at some point. That’s the price you pay for early access to that which few others have. (Otherwise, you’ll probably be waiting until December for the full release of One Ui 2.0 / Android 10.)\n\nTo leave the beta, just pull up the Settings portion of the Samsung Members app, under the triple-dot icon in the upper-right corner, and follow the easy-to-find option to deregister from the beta. If you do, your phone will reset—removing all the data—and you’ll be able to restore from your most recent pre-beta backup, if applicable.\n\nNote that this update is being rolled out to different markets in staggered intervals, with the US, South Korea and Germany apparently first in line. If you can't see the option Down Under yet, keep checking back! With a little luck, the wait won't be much longer.", "description": "One of the bummers of buying a non-Pixel Android smartphone is that you are beholden to your manufacturer for Android updates. In other words, Google devices typically get giant upgrades like Android 10 first, and you have to sit and be envious until you get your shot—possibly months after the fact — if you...", "authors": ["Alan Henry", "Chris Jager"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/bvstauqz4ujhfbqznsyb.jpg", "published_at": "2019-10-16"}