{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/optiv-security-named-a-leader-in-idc-marketscape-u-s-emerging-managed-security-services", "downloaded_at": "2019-10-15 16:24:50.959670+00:00", "title": "Optiv Security Named a Leader in IDC MarketScape: U.S. Emerging Managed Security Services", "language": "en", "text": "— Security solutions integrator recognized for client-focused outcomes and global delivery capabilities —\n\nDENVER — Optiv Security, a security solutions integrator delivering end-to-end cybersecurity solutions across the globe, today announced that it has been recognized as a Leader in managed security services (MSS), according to the IDC MarketScape: U.S. Emerging Managed Security Services 2019 Vendor Assessment. The report evaluates managed security service providers and their ability to provide comprehensive, 24-7 support to organizations amidst a global talent shortage and a growingly complex security landscape. Optiv’s recognition in this report reaffirms the company’s innovative and integrated approach to how cybersecurity services are consumed and delivered. Optiv continues to aggressively invest in a risk-centric, outcome-based model that addresses the market’s necessary shift to move from reactive protection and detection toward remediation customized for each organization’s specific needs, according to the report.\n\nOptiv’s growing roster of security operations centers (SOCs) was specifically highlighted, including a brand-new Advanced Fusion Center (AFC) located in Frisco, TX that uses advanced analytics, automation, and intelligence capabilities to bring cybersecurity to pace with the rapid transformation of business needs.\n\n“Optiv is known as a supportive cybersecurity services provider that resolves issues quickly,” said Martha Vazquez, senior research analyst, International Data Corporation (IDC). “The firm’s proactive approach and shift to business-focused results makes it a valuable cybersecurity partner for both mid-size and large enterprises to consider.”\n\nThe IDC MarketScape¹ specifically notes Optiv’s comprehensive managed security services, advanced detection and techniques, and efficient expansion in providing organizations with its MSS capabilities as a positive in the company’s path toward becoming a ‘one-stop shop’ for organizations seeking an integrated cybersecurity approach.\n\n“Globally, our Managed Security teams tailor solutions to each client’s specific needs and risk profile so they can shift their security strategy to be more business-aligned,” said Anthony Diaz, division vice president and general manager, global emerging services, Optiv. “By making business outcomes a cybersecurity driver, our clients are able to reduce risk and realize ROI with the optimization of people, processes, and technology.”\n\nAbout IDC MarketScape: IDC MarketScape vendor assessment model is designed to provide an overview of the competitive fitness of ICT (information and communications technology) suppliers in a given market. The research methodology utilizes a rigorous scoring methodology based on both qualitative and quantitative criteria that results in a single graphical illustration of each vendor’s position within a given market. IDC MarketScape provides a clear framework in which the product and service offerings, capabilities and strategies, and current and future market success factors of IT and telecommunications vendors can be meaningfully compared. The framework also provides technology buyers with a 360-degree assessment of the strengths and weaknesses of current and prospective vendors.\n\n¹Doc #US42814718, August 2019\n\nFollow Optiv\n\nTwitter: www.twitter.com/optiv\n\nLinkedIn: www.linkedin.com/company/optiv-inc\n\nFacebook: www.facebook.com/optivinc\n\nYouTube: https://www.youtube.com/c/OptivInc\n\nBlog: https://www.optiv.com/explore-optiv-insights/blog\n\nOptiv Security: Who Secures Your Insecurity?TM\n\nOptiv is a security solutions integrator – a global, “one-stop” trusted partner with a singular focus on cybersecurity. Our end-to-end cybersecurity capabilities span risk management and transformation, cyber digital transformation, threat management, cyber operations, identity and data management, and integration and innovation, helping organizations realize stronger, simpler and more cost-efficient cybersecurity programs that support business requirements and outcomes. At Optiv, we are modernizing cybersecurity to enable clients to innovate their consumption models, integrate infrastructure and technology to maximize value, achieve measurable outcomes, and realize complete solutions and business alignment. For more information about Optiv, please visit us at www.optiv.com.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191015005196/en/\n\nContacts\n\nBrett Ater\n\n(913) 304-7683\n\nbrett.ater@optiv.com\n\nor\n\nJason Cook\n\n(816) 701-3374\n\njason.cook@optiv.com", "description": "— Security solutions integrator recognized for client-focused outcomes and global delivery capabilities —DENVER — Optiv Security, a security solutions integrator delivering end-to-end cybersecurity solutions across the globe, today announced that it has been recognized as a Leader in mana...", "authors": [], "top_image": "https://mms.businesswire.com/media/20191015005196/en/672087/3/OPTIV_rgb.jpg", "published_at": "2019-10-15"}