{"pub": "atlantic", "url": "https://theatlantic.com/magazine/archive/2019/10/she-doesnt-believe-all-women/596632", "downloaded_at": "2019-09-10 23:31:20.659556+00:00", "title": "She Doesn’t Believe All Women", "language": "en", "text": "outside of Trump’s base, the name Juanita Broaddrick may stir only muddled memories—wasn’t she one of the women not named Monica Lewinsky who accused Bill Clinton of something? Paula Jones, Kathleen Willey, Gennifer Flowers—their stories can blur, but each of these women has a distinct set of allegations, and Broaddrick’s are the most serious. She says Clinton raped her in 1978, when he was the attorney general of Arkansas and she was a volunteer for his gubernatorial campaign. She did not report the alleged crime to the police; in fact, Broaddrick’s name wasn’t made public until two decades later, via a 1998 court filing in the Paula Jones case. (Clinton denied the allegations.) Even though Broaddrick did some press—once she’d been outed, she wanted the chance to share her perspective—the story didn’t stick to the Clinton legacy the way Lewinsky’s has. At the time, her claims were mostly ignored, and when acknowledged they were often disparaged; the fact that she’d recanted in an affidavit after being subpoenaed by Jones’s lawyers was a favorite data point of critics. (Broaddrick says she denied that anything had happened with Clinton because she didn’t want to get involved in a big legal circus with Jones.)\n\nRead: Bill Clinton: a reckoning\n\nBut the worst part of the aftermath had already happened by then, Broaddrick told me. Clinton had been the leader of the free world for five long years. “Just seeing him on TV, it was constant. I don’t know who got to be the quickest, my husband or me, switching the channel,” she said. She even ended up going to an earlier church service, because at her usual one the priest had taken to asking congregants to pray for the president. “I had to sit in church, down on my knees, and be told that I am to pray for Bill Clinton.”\n\nBy the early aughts, she’d faded into relative obscurity and basically moved on with her life. Then Hillary Clinton ran for president, and her pronounced pro-woman agenda stirred up decades-old resentment. “I kept thinking, Why can’t you see this huge elephant in the room?” Broaddrick recalled. “Why can’t you see this woman for what she really is?” One day, Broaddrick decided she had to weigh in. Though she’d tweeted only three times before the 2016 election cycle, she sent out a statement that went viral: “I was 35 years old when Bill Clinton, Ark. Attorney General raped me. I am now 73 … it never goes away.” Nine months later, the Trump campaign issued what would be a fateful invitation: Would she sit in the audience during the candidate’s second debate with Hillary Clinton?\n\nSince that October evening, Broaddrick has popped up semi-regularly on Fox News and become something of a MAGA thought leader, with 133,000 followers on Twitter, where her commentary ranges from insults (like calling Representative Schiff “Schiff for Brains”) to borderline hate speech (retweeting a picture of the short-haired soccer star Megan Rapinoe and Representative Alexandria Ocasio-Cortez captioned “Boy Meets Girl”). She travels the country speaking to conservative groups and signing copies of her self-published memoir, You’d Better Put Some Ice on That (so named for the last thing Broaddrick says Clinton uttered before leaving the scene of the alleged assault, in which he bit her lip so violently that he drew blood).", "description": "Juanita Broaddrick, who alleges that Bill Clinton raped her in 1978, has found new life as a Trump defender.", "authors": ["Amanda Fitzsimons"], "top_image": "https://cdn.theatlantic.com/assets/media/img/2019/08/DIS_Sketch_Fitzsimons_Broderick_crops/facebook.jpg?1566932163", "published_at": "2019-09-10"}