{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7616337/Iraqis-gather-protests-violence-kills-40.html", "downloaded_at": "2019-10-26 11:18:32.793152+00:00", "title": "Iraqis gather for more protests after violence kills 40", "language": "en", "text": "BAGHDAD, Oct 26 (Reuters) - Several hundred demonstrators gathered in central Baghdad on Saturday, brandishing Iraqi flags and calling Prime Minister Adel Abdul Mahdi a \"worm\", after a day of violent protests in which at least 40 people were killed.\n\nSome 200 of the protesters had camped out overnight in the capital's central Tahrir Square, and were cleaning up the area. Others read verses from the Koran to mourn those killed.\n\nEight protesters were killed in Baghdad on Friday, most of them after being struck by tear gas canisters launched by security forces trying to control the crowds.\n\nAcross the country, at least 40 protesters died, as demonstrators vented their frustration at political elites who they say have failed to improve their lives after years of conflict and economic hardship.\n\nParliament was set to meet on Saturday in an emergency session to discuss protesters' demands.\n\n\"The government has been stealing from us for 15 years. Saddam went and 1,000 Saddams have been hiding in the Green Zone,\" a young protester, who declined to be named, said on Friday, referring to the former Iraqi dictator.\n\nThe Green Zone is the central government zone of Baghdad that was closed to the Iraqi public for many years.\n\nThe Interior Ministry praised what it called the restraint shown by security forces on Friday.\n\n\"The security forces secured the protection of demonstrations and protesters responsibly and with high restraint, by refraining from using firearms or excessive force against demonstrators,\" the ministry said in a statement on Saturday.\n\nIn Iraq's mainly Shi'ite southern provinces, which saw violence overnight as protesters clashed with Iranian-backed Shi'ite militias, the situation was calmer on Saturday, with a curfew still in place across most urban areas.\n\nThe latest bloodshed was the second major bout of violence this month. A series of clashes two weeks ago between protesters and security forces left 157 people dead and over 6,000 wounded.\n\nMore than 2,000 people were injured nationwide in those protests, according to medical sources and the Iraqi High Commission on Human Rights (IHCHR). (Reporting by Reuters Baghdad newsroom Writing by Raya Jalabi Editing by James Drummond and Frances Kerry)", "description": "BAGHDAD, Oct 26 (Reuters) - Several hundred demonstrators  gathered in central Baghdad on Saturday, brandishing Iraqi flags  and calling Prime Minister Adel...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-26"}