{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7583055/Jenna-Dewan-Channing-Tatum-officially-file-legally-single-despite-ongoing-divorce-case.html", "downloaded_at": "2019-10-17 10:35:00.136852+00:00", "title": "Jenna Dewan and Channing Tatum officially file to become legally single despite ongoing divorce case", "language": "en", "text": "Jenna Dewan and Channing Tatum have filed to become legally single despite their ongoing divorce case.\n\nThe actress, 38, and actor, 39 - who announced their split in October 2018 - are bifurcating the status of their divorce so that they are free to marry someone else, according to legal documents obtained by The Blast.\n\nDays after fuelling engagement rumours by wearing a ring on her engagement finger, pregnant Jenna is now free to marry new beau Steve Kazee if she wishes, while the Magic Mike star can legally take the next step with girlfriend Jessie J.\n\nFree to move on: Jenna Dewan, 38, and Channing Tatum, 39, have filed to become legally single despite their ongoing divorce case (Pictured together 2015)\n\nAfter Jenna filed for divorce in October of last year, citing irreconcilable differences, she is now free to marry again thanks to the legal process of burification.\n\nAs well as asking for joint legal and physical custody, Jenna also requested child support for their daughter Everly, 6, in addition to spousal support while Channing also asked for joint custody.\n\nThey are still set to negotiate their finances, as well as custody of Everly during the rest of their divorce case.\n\nMailOnline has contacted representatives for Jenna and Channing for further comment.\n\nNext step? Days after fuelling engagement rumours by wearing a ring on her engagement finger, pregnant Jenna is now free to marry new beau Steve Kazee if she wishes\n\nAccording to legal documents: The actress and actor - who announced their split in October 2018 - are bifurcating the status of their divorce so that they are free to marry someone else\n\nIt is no doubt a delightful time for Jenna, as she recently revealed she's expecting a child with her new boyfriend Steve Kazee, 43.\n\nSpeaking to People, Jenna gushed: 'It was excitement all around. Everywhere excitement,' she said during her interview. '[Everly] said she's waited her whole life for a sibling. \"I've waited my whole life for this, Mom.\" It is so cute.'\n\nJenna even revealed that Everly is so thrilled, she tells strangers that she is going to be a big sister.\n\nShe is going around lifting up my shirt to literally anyone, and goes, \"I'm going to be a big sister! Did you know there's a baby in my mommy's belly? Do you want to touch it?\" She will just lift up my shirt. She kisses [my belly].'\n\nExciting: It is no doubt a delightful time for Jenna, as she recently revealed she's expecting a child with her new boyfriend Steve Kazee, 43\n\nProving to be very much the friendly exes, Channing is reportedly 'happy and very supportive' upon learning his ex's pregnancy news.\n\nA source said E! News: 'Jenna told Channing that she was pregnant and wanted to make sure he knew before she announced it. He is happy for her and was very supportive.'\n\nMeanwhile, Channing is now smitten with British songstress Jessie J, 31 - who he began dating soon after his split from Jenna.\n\nThe hunk has moved to the UK to be with the Price Tag hitmaker. The couple is renting a mansion together in the Bury St Edmunds area.\n\nLove is in the air: Channing is now smitten with British songstress Jessie J, 31 - who he began dating soon after his split from Jenna\n\n\n\n", "description": "Jenna Dewan, 38, and Channing Tatum, 39, have filed to become legally single despite their ongoing divorce case.", "authors": ["Jabeen Waheed For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/10/19828716-0-image-a-60_1571303691010.jpg", "published_at": "2019-10-17"}