{"pub": "thestreet", "url": "https://realmoney.thestreet.com/investing/amazon-com-is-set-to-gap-lower-friday-here-s-our-strategy-15140663", "downloaded_at": "2019-10-25 16:07:12.118330+00:00", "title": "Amazon Is Set to Gap Lower Friday: Here's Our Strategy", "language": "en", "text": "Amazon.com (AMZN) reported its Q3 earnings last night and the stock in trading lower in early morning activity. AMZN was down even more Thursday evening as their earnings topped high-end estimates with its net sales but they guided to the low side for Q4, and missed on Q3 profits. Technical analysis is all about what investors think about a stock going forward.\n\nIn this daily bar chart of AMZN, below, we can see that the price of AMZN has been under selling pressure the past four months. AMZN was recently trading below the rising 200-day moving average line and just slightly above the 50 day moving average line. Prices are anticipated to gap below the October low on the opening but perhaps stop short of the early June nadir.\n\nThe On-Balance-Volume (OBV) line has been in an uneven decline from the middle of July suggesting that sellers of AMZN have been more aggressive. The line moved up from early October suggesting that traders were more aggressive buyers in recent days. This may have been short covering ahead of the earning's report.\n\nThe Moving Average Convergence Divergence (MACD) oscillator had moved up to the underside of the zero line and poised for a crossover buy signal. Today's weakness is likely to turn the MACD oscillator lower again.\n\nDespite what the charts suggest, I would anticipate that a number of fundamentally oriented analysts may suggest that investors buy the dip today. I want my strategy to be dictated by the price action.\n\nIn this weekly bar chart of AMZN, below, we can see a mixed picture. Prices are below the rising 40-week moving average line.\n\nThe weekly OBV line has been pretty steady since its December low. From here the OBV line could move down but I will wait and see.\n\nThe MACD oscillator has been narrowing for a few weeks ahead of yesterday's report. A buy signal is likely to be delayed or negated.\n\nIn this Point and Figure chart of AMZN, below, we can use our imagination to determine what might happen. A gap will not be shown but we can anticipate a decline to the $1672 area. A decline to $1660.41 would be a new low for the move down. The software is projecting $1518 as a potential downside price target.\n\nBottom line strategy: It would be nice to have a time machine to know where AMZN will close today but that does not exist. My gut tells me that AMZN will close off its low for today. I am not suggesting nor recommending that traders buy the dip in AMZN as that is definitely not my style, but the key level on the weekly chart is $1600 as a close below that could precipitate further declines.", "description": "Let's check the charts and indicators for some guidance....AMZN", "authors": ["Bruce Kamich", "Amazon Is Set To Gap Lower Friday", "Here'S Our Strategy", "Let'S Check The Charts", "Indicators For Some Guidance.", "Stocks Quotes In This Article", "Stephen Guilfoyle", "Bob Ciura", "Guy Ortmann", "Gary Berman"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/2e23bbfa-2625-11e9-8537-ad278f79c786.png", "published_at": "2019-10-25"}