{"pub": "reuters", "url": "https://reuters.com/article/us-saudi-aramco-attacks-nasser/saudi-aramco-has-emerged-from-attacks-stronger-than-ever-ceo-idUSKBN1W603Q", "downloaded_at": "2019-09-21 10:13:14.012685+00:00", "title": "Saudi Aramco has emerged from attacks 'stronger than ever': CEO", "language": "en", "text": "RIYADH (Reuters) - Saudi Aramco has emerged from attacks on its oil facilities “stronger than ever”, Chief Executive Amin Nasser told employees in a message, adding that full oil production would resume by the end of this month.\n\nFILE PHOTO: Amin H. Nasser, president and CEO of Saudi Arabian Oil Company, Saudi Aramco, speaks during a news conference in Jeddah, Saudi Arabia September 17, 2019. REUTERS/Waleed Ali/File Photo\n\nThe Sept. 14 attacks on the Abqaiq and Khurais plants, some of the kingdom’s biggest, caused raging fires and significant damage that halved the crude output of the world’s top oil exporter, by shutting down 5.7 million barrels per day of production.\n\n“The fires that were intended to destroy Saudi Aramco had an unintended consequence: they galvanized 70,000 of us around a mission to rebound quickly and confidently, and Saudi Aramco has come out of this incident stronger than ever,” Nasser said in the internal message, on the occasion of the Saudi national day, to be celebrated on Sept. 23.\n\n“Every second counts in moments like these, and had we not acted quickly to contain the fires and undertake rapid restoration efforts, the impact on the oil market and the global economy would have been far more devastating.”\n\nSix days after the assault, which hit at the heart of the Saudi energy industry and intensified a decades-long struggle with arch-rival Iran, the state oil giant Aramco invited reporters on Friday to observe the damage and the repair efforts.\n\nThousands of employees and contractors have been pulled from other projects to work around the clock to bring production back. Aramco is shipping equipment from the United States and Europe to rebuild the damaged facilities, Aramco officials told reporters. [nL5N26B59G]\n\nAramco already brought back part of the lost production and will return to pre-attacks level end of September, Nasser said.\n\n“Not a single shipment to our international customers has been missed or canceled as a result of the attacks, and we will continue to fulfill our mission of providing the energy the world needs,” he said in the message, seen by Reuters.\n\nEnergy Minister Prince Abdulaziz bin Salman said on Tuesday that Saudi Arabia had used its reserves to maintain oil supply flows to customers abroad and inside the kingdom.\n\nYemen’s Houthi group claimed responsibility for the attacks but a U.S. official said they originated from southwestern Iran. Tehran, which support the Houthis, has denied any involvement in the attacks.\n\nSaudi Arabia says 18 drones and three missiles were fired at Abqaiq, the world’s largest oil processing facility, while the Khurais facility was hit by four missiles.\n\nNo casualties were reported at either site even though thousands of workers and contractors work and live in the area.", "description": "Saudi Aramco has emerged from attacks on its oil facilities \"stronger than ever\", Chief Executive Amin Nasser told employees in a message, adding that full oil production would resume by the end of this month.", "authors": ["Rania El Gamal", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190921&t=2&i=1432274599&w=1200&r=LYNXMPEF8K063", "published_at": "2019-09-21"}