{"pub": "yahoo", "url": "https://finance.yahoo.com/news/natural-gas-price-forecast-natural-155504350.html", "downloaded_at": "2019-10-04 09:19:50.181823+00:00", "title": "Natural Gas Price Forecast – Natural gas markets continue to reach towards support", "language": "en", "text": "The natural gas markets continue to show a lot of negativity, but quite frankly I think part of this is probably due to colder temperatures taking their time to get to North America. That being the case, it’s only a matter time before this happens and of course the demand spikes. Recently though, we have not seen signs of that quite yet so it makes sense that we would need to wait for a daily close as I have been saying for the last several videos for our signal. This is because if we do get a bullish daily close or a hammer or something to that effect, you should have plenty of time to put the position on and simply hang onto it. This would be a longer-term trade firing off, not some type of short-term scalp.\n\nNATGAS Video 03.10.19\n\nThat being said, the market looks as if it has massive support at the $2.20 level as well, and if we were to break down below there I suspect there would be a huge “reset” down to the $2.00 level. Even though this has been basically a complete round-trip from the initial breakout, I would be rather surprised to see that. I do believe that we will eventually get our signal, but patience will be crucial to trade this potential pop higher. The cyclical pop higher in this market is a huge moneymaker, so waiting a few days makes quite a bit of sense.\n\nPlease let us know what you think in the comments below\n\nThis article was originally posted on FX Empire\n\nMore From FXEMPIRE:", "description": "Natural gas markets have drifted a bit lower during the trading session on Wednesday as we continue to drift down towards major support. I currently see that support as roughly $2.25, and with the inventory figures coming out, we could get the catalyst for a bigger move, or possibly not.", "authors": ["Christopher Lewis"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-02"}