{"pub": "npr", "title": "Ahead Of 2020 Summer Olympics, A Building Boom In Kyoto Is Yielding Ancient Artifacts", "url": "https://npr.org/2019/02/06/689931917/ahead-of-2020-summer-olympics-a-building-boom-in-kyoto-is-yielding-ancient-artif", "language": "en", "published_at": "2019-02-06", "downloaded_at": "2019-09-02 07:04:55.868696+00:00", "text": "Ahead Of 2020 Summer Olympics, A Building Boom In Kyoto Is Yielding Ancient Artifacts\n\nEnlarge this image toggle caption Anthony Kuhn/NPR Anthony Kuhn/NPR\n\nDeep in the urban center of Kyoto, Japan, behind a department store, archaeologist Koji Iesaki digs down through successive layers of earth, each about 8 inches thick, taking him back in time to the Heian period, which began over 1,000 years ago.\n\nHe has found images of mythical beasts carved on roof tiles, remains of a moat that surrounded the temple during the Warring States period some 500 years ago and ritual vessels that held placentas, which were buried after childbirth in the belief that they would ensure a child's good health and fortune.\n\n\"Anywhere you dig in Kyoto, you find a lot of stuff,\" Iesaki says in a prefab hut on the excavation site. \"The city has been continuously inhabited for 1,000 or 1,200 years. So it's like a treasure mountain. There are a lot of things used in people's daily lives.\"\n\nIesaki is digging on the site of the Jyokyo-ji temple, which belongs to the Pure Land sect of Buddhism. It was first built in 1449 and moved in 1591. The temple was demolished last summer to make room for a hotel that's due to open next June, just in time for the Olympics.\n\nBefore the hotel developers, part of the Mitsui Group conglomerate, began construction, they gave Iesaki about four months to excavate and salvage anything he found of historical value. Japanese law doesn't require developers to permit archaeological excavations before construction, but many do.\n\nIesaki says if the Jyokyo-ji temple hadn't been torn down, he wouldn't have had the chance to dig there. He and his team of a dozen people had to work fast, from September to January.\n\nEnlarge this image toggle caption Anthony Kuhn/NPR Anthony Kuhn/NPR\n\nEnlarge this image toggle caption Anthony Kuhn/NPR Anthony Kuhn/NPR\n\n\"If I find something of value and more digging is needed, I might have to wait another 30 or 40 years, until there's a new construction project,\" he says.\n\nAcross Kyoto, archaeologists are rushing to uncover, document and preserve relics of the city's heritage as a pre-Olympic building boom sweeps the ancient former capital of Japan, changing its distinctive appearance and feel.\n\nThe number of visitors to Japan has nearly tripled in the past five years, to about 30 million last year. The largest contingent comes from mainland China. The city's infrastructure groans under the influx of tourists, and some residents chafe at the crowds. But with Japan rapidly aging and depopulating, it needs the tourists' money.\n\nTo accommodate tourism and business demands, some of the city's majestic temples and traditional wooden machiya town houses are coming down, and hotels and office buildings are springing up.\n\nNear City Hall, Tomomitu Umase is coordinating efforts to salvage cultural relics. A former archaeologist, Umase runs a city government department in charge of \"buried cultural treasures.\"\n\n\"Postwar Japan has made great advances in finding written historical records, as well as digging up ancient remains,\" he says. \"Development has allowed the excavation of relics. Then again, 99 percent of the artifacts have been destroyed because of development.\"\n\nEnlarge this image toggle caption Anthony Kuhn/NPR Anthony Kuhn/NPR\n\nOn the whole, Umase is gloomy about his city's building boom. Less development would mean more cultural artifacts could remain preserved underground for future generations to dig up, he says.\n\nOthers are more sanguine, including Koki Mitsuyama, a pragmatic 48-year-old Buddhist priest and former investment banker — and the owner of the demolished Jyokyo-ji temple. When we meet, he's dressed in a Japanese-style robe made of denim over a shirt and dark jeans.\n\nMitsuyama has been working with the developer to build a nine-story hotel, with the first floor divided between a lobby on one side and a new Jyokyo-ji temple on the other. Hotel profits will help fund the temple, and the hotel will even include a display area for the artifacts dug up by Iesaki and his team at the site.\n\nOwnership of temples in Japan is generally hereditary, and Mitsuyama was born into a temple family in Tokyo. His grandmother was raised in the Jyokyo-ji temple, and Mitsuyama was chosen to inherit it.\n\nBut the congregation of aging danka, or Buddhist parishioners, can no longer support the temple. The trend is mirrored across Japan, where by one estimate in 2015, more than 20,000 of the country's roughly 77,000 Buddhist temples no longer had priests.\n\nAt the same time, says Mitsuyama, people's relationships to temples are changing, as are their spiritual needs.\n\n\"Modern people care about getting benefits in this life, not the next,\" he observes. \"They want good things to happen to them today, tomorrow or next year, at the latest. They come to our temple to seeking inner peace and solace from problems of finances, family and mere survival.\"\n\nThe Pure Land sect makes spirituality simple, Mitsuyama says. Just by chanting the Buddha's name, he says, even sinners can make it to heaven — the Pure Land.\n\nBy linking it with the new hotel, Mitsuyama is confident he's putting the temple on a firm financial footing for the future. He hopes his solution will serve as an example and precedent for struggling Buddhist temples elsewhere in Japan.\n\n\"Changing people's ideas and coming up with new ways is part of the Pure Land sect's tradition of being original,\" he says. \"This is what I must do for the sect to help it prepare for the next century. And this is the right time to do it, so I have no hesitation.\"\n\nChie Kobayashi contributed to this story from Kyoto.", "description": "Archaeologists are rushing to uncover, document and preserve centuries-old objects as new hotels and office buildings go up in the ancient former capital of Japan.", "authors": ["Anthony Kuhn"], "top_image": "https://media.npr.org/assets/img/2019/02/05/2874108-kuhn-500-21_wide-e950d92580c0fd04eeb9147a2d5d36f122b33023.jpg?s=1400"}