{"pub": "thehill", "url": "https://thehill.com/homenews/campaign/465157-gabbard-says-she-may-boycott-next-weeks-debate", "downloaded_at": "2019-10-10 15:13:41.161581+00:00", "title": "Gabbard says she may boycott next week's debate", "language": "en", "text": "Rep. Tulsi Gabbard Tulsi GabbardSanders, Castro, Gabbard to appear in town hall hosted by Latino civil rights organization Saagar Enjeti: 'Ride is likely over for Kamala Harris' Fifth DNC debate to be held Nov. 20 in Georgia MORE (D-Hawaii) says she may boycott the Democratic presidential debate next week, accusing the Democratic National Committee (DNC) and media of “rigging” the primary contest against outsider candidates such as herself.\n\nGabbard pointed to what she described as “arbitrary” and nontransparent qualification requirements as evidence party leaders “are trying to hijack the entire election process.”\n\nADVERTISEMENT\n\nThe Hawaii Democrat, who has hit the qualification thresholds for Tuesday’s debate in Ohio, said she’d decide in the coming days whether to participate.\n\n“The 2016 Democratic Primary election was rigged by the DNC and their partners in the corporate media against Bernie Sanders Bernie SandersOvernight Health Care — Presented by Coalition Against Surprise Medical Billing — Planned Parenthood plans M campaign for 2020 | Dem candidates embrace aggressive step on drug prices | Officials propose changes to encourage 'value-based' care Sanders denies campaign was not transparent about heart attack: 'That's nonsense' Sanders, Castro, Gabbard to appear in town hall hosted by Latino civil rights organization MORE,” Gabbard said in a statement.\n\n“In this 2020 election, the DNC and corporate media are rigging the election again, but this time against the American people in the early voting states of Iowa, New Hampshire, South Carolina, and Nevada.”\n\nGabbard didn't qualify for the party's debate in September and would miss out on a televised chance to reach millions of voters by skipping the debate. But the threat to boycott the debate also promises to win attention for her campaign.\n\nTwelve candidates have qualified for next week’s debate, but the DNC has repeatedly raised the thresholds to qualify, keeping four candidates who are still in the race on the sidelines.\n\nTo qualify for the October debate, candidates had to collect contributions from 130,000 unique donors and register at least 2 percent in four approval polls.\n\nTo qualify for the November debate, candidates must reach 165,000 unique donors and reach 3 percent in four approved polls, potentially shrinking the size of the debate stage further. Only eight candidates have qualified under those thresholds, and Gabbard is not among them.\n\n“They are attempting to replace the roles of voters in the early states, using polling and other arbitrary methods which are not transparent or democratic, and holding so-called debates which are not debates at all but rather commercialized reality television meant to entertain, not inform or enlighten,” Gabbard said. “In short, the DNC and corporate media are trying to hijack the entire election process.”\n\nMarianne Williamson Marianne WilliamsonThe Hill's Campaign Report: Warren, Sanders overtake Biden in third-quarter fundraising The Hill's Morning Report — Trump broadens call for Biden probes Biden raises .2 million in third quarter, trailing Sanders and Buttigieg MORE, a fellow Democratic White House hopeful, tweeted that she has \"great respect for Tulsi for saying such an inconvenient truth.\"\n\n\"She is absolutely correct.\"\n\nI have great respect for Tulsi for saying such inconvenient truth. She is absolutely correct. https://t.co/HDRV5avPMO — Marianne Williamson (@marwilliamson) October 10, 2019\n\nUpdated at 10:08 a.m.", "description": "Rep.", "authors": [], "top_image": "https://thehill.com/sites/default/files/gabbardtulsi_073118upi_lead.jpg", "published_at": "2019-10-10"}