{"pub": "theverge", "url": "https://theverge.com/2019/10/28/20936202/att-hbo-max-netflix-disney-streaming-services-q3-earnings", "downloaded_at": "2019-10-29 00:16:26.738372+00:00", "title": "AT&T boss calls out Netflix and Disney ahead of HBO Max launch", "language": "en", "text": "AT&T is set to announce the launch date, price, and first offerings for its upcoming HBO Max streaming service on October 29th, and AT&T CEO Randall Stephenson has a message for investors: it’s not like those other services.\n\nStephenson addressed investors’ concerns about HBO Max, one of the largest entertainment undertakings AT&T has ever conducted, making its entry into a heavily saturated streaming space during an earnings call on Monday morning. Stephenson defended AT&T’s place in the market, adding that where the company “intends to play, it is not that crowded.” He added that emphasizing the HBO name brand already distinguishes the service from its competitors, putting it in a league of its own.\n\n“This is a product that’s going to be very different from anything else that you’ve seen in the market so far,” Stephenson said. “This is not Netflix. This is not Disney. This is HBO Max. We feel very comfortable at these investment levels that we can do something very, very significant in the market and drive some significant subscriber gains. This is going to be a meaningful business to us over the next four or five years. So we’re talking a 50 million subscriber business.”\n\n“This is not Netflix. This is not Disney. This is HBO Max.”\n\nStephenson’s comments are reminiscent of what Netflix CEO Reed Hastings and Disney CEO Bob Iger have previously said about their own projects. Iger recently told CNBC that Disney+ is “very, very different than the other services out there,” adding that “while we view the others as competition, we’re not fixated on the competitive side of things here.” Hastings wrote in his recent third quarter earnings letter to shareholders that although “new competitors have some great titles (especially catalog titles), none have the variety, diversity and quality of new original programming that we are producing around the world.”\n\nDespite the content offerings being different — AT&T is selling the idea of prestige content that people associate with the HBO name, while Disney is courting subscribers through nostalgia plays — these companies are selling similar products. They want to bring subscribers into their ecosystems, beating out time spent on other platforms. AT&T, whether Stephenson wants to admit it or not, is competing with Netflix and Disney. HBO Max is also competing with YouTube, Twitch, Fortnite, and live sports matches. Pretending that an oversaturated market doesn’t play a major factor in today’s streaming landscape doesn’t take away from the fact that it’s a busy playing field.\n\n“Every service has something to offer” is essentially the message that subscribers are walking away with. But everything comes down to a few key aspects: price and content slate. AT&T hasn’t announced a price tag or launch date for its service, but it’s poised to do so on October 29th during a special investors day event for HBO Max.", "description": "AT&T is set to announce the launch date, price, and first offerings for its upcoming HBO Max streaming service, and CEO Randall Stephenson has a message for investors: it’s not Disney, Netflix, or any of those other services.", "authors": ["Julia Alexander", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/IWcDqpykxPiO7gJ05rzLku_Rick=/0x214:5472x3079/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19324891/1175540118.jpg.jpg", "published_at": "2019-10-28"}