{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7631065/Terrifying-moment-student-17-Catholic-school-Argentina-points-replica-gun-teacher.html", "downloaded_at": "2019-10-30 23:20:03.829752+00:00", "title": "Terrifying moment a student, 17, at a Catholic school in Argentina points a replica gun at a teacher", "language": "en", "text": "A Catholic high school student in Argentina was filmed aiming a replica gun at a teacher's head while his back was turned.\n\nThe disturbing incident took place in July at Emaús school in El Palomar, Buenos Aires, before the students were let out for winter recesses.\n\nThe video recently went viral after it was shared on social media.\n\nThe 17-year-old student, whose name has been withheld, was seen in the video pointing the plastic revolver at Eduardo Seco while the teacher explained a lesson to two other pupils.\n\nA student in Argentina sparked controversy this week after a video of him pointing a gun at a school teacher went viral\n\nThe student (left), who aimed the weapon at his teacher, posed for a photo with a classmate moments after the ill-advised prank\n\nAnother boy stood behind the student with the toy gun and laughed.\n\nA student then posed for a picture alongside the student and his fake weapon.\n\nAdministrators held an internal investigation with the pupils and their parents this week and reprimanded them both for their actions.\n\nThe student who brought the replica weapon to the school was cleared of any wrongdoing because he did not participate in the incident, according to Gemignani.\n\nEmaús announced Tuesday that the fifth-year prep student, who pointed the gun, and his three other classmates who participated in the prank, will be allowed to finish out the current school year, but they have been banned from attending the school in 2020.", "description": "A Catholic high school student in Argentina was filmed aiming a replica gun at a teacher's head while his back was turned during a class.", "authors": ["Adry Torres For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/16/20383782-0-image-a-12_1572452038454.jpg", "published_at": "2019-10-30"}