{"pub": "npr", "url": "https://npr.org/2019/10/30/774434200/cashing-in-on-the-white-house-connection-its-not-just-hunter-biden", "downloaded_at": "2019-10-30 15:59:12.901067+00:00", "title": "Cashing In On The White House Connection: It's Not Just Hunter Biden", "language": "en", "text": "Cashing In On The White House Connection: It's Not Just Hunter Biden\n\nEnlarge this image toggle caption AP AP\n\nBilly Carter appeared to relish his role as the president's colorful kid brother, raking in money through personal appearances, guest shots on TV's Hee Haw and even his own eponymous brand of beer.\n\nWhen it came out that he'd also accepted money for lobbying from the Libyan government, his financial dealings no longer seemed quite so funny.\n\nBeing related to a high-ranking politician can be lucrative, as former Vice President Joe Biden's son Hunter has discovered.\n\nHunter Biden accepted a $50,000-a-month seat on the board of the Ukrainian gas company Burisma Holdings, despite no experience in the energy business.\n\nBut the younger Biden is hardly the first relative of a high-ranking politician to try to cash in on his or her famous relative's position.\n\n\"There have always been special interests looking for a shortcut to get access to power, and they're betting that the benefit that they get from hiring that relative will get them access and influence,\" says Meredith McGehee, executive director of Issue One, a nonpartisan group that seeks to reduce the role of money in politics.\n\nPresidential relatives have been a source of scandal throughout history — in both Republican and Democratic administrations, she says.\n\nWhen Richard Nixon first ran for president in 1960, he had to answer questions about a loan billionaire Howard Hughes had given his brother Donald. President Nixon later said the scandal had contributed to his narrow defeat to John F. Kennedy.\n\nAs President George H.W. Bush tried to deal with the fallout from the savings and loan crisis, he was also contending with an uncomfortable fact: His own son Neil had served on the board of Denver-based Silverado Savings and Loan, which went bankrupt, costing taxpayers more than $1 billion.\n\nLike Billy Carter before him, Neil Bush insisted he had done nothing wrong, and no evidence emerged that he had received preferential treatment from the government.\n\nBut his role at the bank caused major political problems for his father.\n\nYouTube\n\nLikewise, Billy Carter's ties to Libya led to a congressional investigation and caused a major scandal for his brother, who had come to office promising to run an honest administration after Watergate.\n\nThe fact that Billy Carter was never charged with any crime almost didn't matter, says presidential historian Julian Zelizer of Princeton University.\n\n\"Very often there's nothing wrong. Nothing is actually done that's illegal. Nothing is done that's formally unethical, and rarely has it affected public policy. But that's different than, 'Does it become a scandal?' It looks bad,\" Zelizer says.\n\nNow, it's former Vice President Biden's turn to contend with a relative's questionable business dealings.\n\nPresident Trump has vigorously sought to raise questions about Hunter Biden's activities. In fact, Trump's attempts to pressure Ukraine to investigate the younger Biden are at the center of the current impeachment inquiry against him.\n\nBut Trump has relatives making business deals too. Trump has never really separated himself from his family's business, the Trump Organization, which is run by his sons Eric and Donald Junior, and the family has frequently been accused of seeking to profit off the presidency.\n\nThe Trumps' business dealings are even more questionable, Zelizer says, because Trump's daughter Ivanka and son-in-law, Jared Kushner, actually work in the White House.\n\n\"Billy Carter was not in the White House. He was not making decisions with the president, and that was the case with Neil Bush too. So what we're talking about now is fundamentally different,\" Zelizer says.", "description": "Relatives of presidents and vice presidents have lots of opportunities to cash in on their famous relative's name, and more than a few have done so.", "authors": ["Jim Zarroli"], "top_image": "https://media.npr.org/assets/img/2019/10/29/ap_800821064_wide-7a3d800415dfdfd5453cbb1ce3b3b0bb680400f4.jpg?s=1400", "published_at": "2019-10-30"}