{"pub": "vice", "url": "https://vice.com/en_us/article/gyzkk9/23andme-wants-everyone-to-get-used-to-sharing-their-genetic-data", "downloaded_at": "2019-10-21 13:10:47.901418+00:00", "title": "23andMe Wants Everyone to Get Used to Sharing Their Genetic Data", "language": "en", "text": "What Anne Wojcicki, co-founder and CEO of 23andMe, would like you to consider is this: Once upon a time, people were kinda freaked out by the idea of typing their credit card info into a website. Now this is done basically all the time. Your phone is a digital wallet; your web browsers will memorize your card numbers for you. Might your bank information get cribbed or hacked? Has it already been? Yeah, probably so, but this is How We Live Now. It’s weird to think it was ever not normal.\n\nThis little historic tale is how Wojcicki addresses the current hesitance a majority of people feel to submitting their genetic material to a database by spitting into a tube and mailing that tube off to a company’s lab. In a brief discussion at the TIME 100 Health Summit in New York City on Thursday, Wojcicki explained that she’s actually grateful for the 20–30 percent of the population that’s down to spit (according to a Twitter poll TIME ran ahead of Wojcicki’s talk). At-home DNA kits like 23andMe are still a relatively new technology. People simply need to grow accustomed to the ideas of genetic testing and sharing genomic data with public databases, so that researchers can observe patterns across the population, and ultimately make people healthier, she said.\n\nIt’s essentially an argument for sharing DNA data as good for public health, like a new-age equivalent of getting vaccinated. To drive the point home further, Eric Lander, a geneticist and director of the Broad Institute of MIT (and someone who once sat around a table with Jeffrey Epstein), mentioned a potential breakthrough in treating angiosarcoma, a rare, highly fatal cancer by using using DNAthat, Lander argued, may never have happened if it weren’t for people’s willingness to fork over health and genetic information.\n\nIt’s hard to find a sensible, non-demonic argument against something that could lead to expedited breakthroughs in cancer treatment. But what has to be kept in mind is that 23andMe is a private company. These anecdotes—virtuous as they may sound—are marketing techniques. Wojcicki rightfully believes that no singular institution will be able to harvest the amount of DNA that her company has. According to 23andMe’s About page, more than 10 million people have spit into its tubes and thereby handed their genetic information over. Of those 10 million, 80 percent have opted in to participate in research, via that spit data. For context: The National Institute of Health is currently in the midst of enrolling its largest DNA-related study to date (“All Of Us”), which will reach full enrollment at one million participants. About a year into their recruiting efforts, they’re about a quarter of the way there, according to what NIH Director Francis Collins said in a separate panel at Thursday’s TIME 100 Health Summit.\n\nWojcicki emphasized that only those who opt in for ancestry information have their data entered into public databases, which are subject to subpoena (the likes of which helped identify the Golden State Killer). She further emphasized that, because DNA is highly similar among family members, submitting your spit implicates your relative’s genetic information. (23andMe consents around this.) That’s a hell of a lot of data that’s sitting around for seemingly forever, and since 23andMe is, once again, a private company, there’s no telling what happens to this info if/when the company goes under, or if they decide to change their policies.\n\nWhat 23andMe is sitting on now is perhaps the most valuable pool of genetic data in the world. Earlier this year, the company partnered with TrialSpark, an NYC-based research company, in order to use its large database of data to fit its opted-in consumers to studies. Mind you, Wojcicki used to work on Wall Street. She is, at her core, a businessperson. Charging customers to have their data, and then partnering with another company with an interest in that data, sounds lucrative as fuck; a hell of a business deal.\n\nWojcicki and Lander concluded their talk on Thursday with a heartwarming sentiment: The virtue of something like 23andMe is that consumers (or participants, however you’d prefer to look at it) have access to their genetic data, rather than submitting it to a study and never getting feedback. Wojcicki refers to this as “empowering;” it’s empowering to know what’s going on in the little strands that make you the person you are. It also sounds very empowering, monetarily speaking, for those in the game, marketing spit kits and trading (totally consented for!!) genetic data.", "description": "It's increasingly complicated to untangle the potential for public health advances from a moralistic marketing scheme.", "authors": [], "top_image": "https://video-images.vice.com/articles/5daa3973fbf646000a381699/lede/1571437044338-GettyImages-1060811532.jpeg?crop=1xw:0.8429xh;0xw,0.0311xh&resize=1200:*", "published_at": "2019-10-18"}