{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7571063/Three-orangutans-released-wild-rescued-huge-forest-fires-Indonesia.html", "downloaded_at": "2019-10-14 23:34:24.349910+00:00", "title": "Three orangutans released back into wild after being rescued from huge forest fires in Indonesia", "language": "en", "text": "Three orangutans caught up in devastating forest fires in Indonesia have been returned to the wild.\n\nA mother and baby, nicknamed Mama Sifa and Sifa, were among the trio released back to their natural habitat in the forest of Ketapang, West Kalimantan.\n\nThe animals had to be rescued from the recent massive forest fires in Indonesia that caused a toxic haze to spread as far as Singapore and the Malaysian peninsular, seriously affecting endangered orangutans and their habitat.\n\nThey were found wandering around the plantations around Tempurukan Village.\n\nOrangutan nicknamed Mama Sifa (right) and her cub Sifa being released into the forest in Ketapang, West Kalimantan, on Friday\n\nSifa being released into the forest in Ketapang. The pair were among three orangutans released after huge forest fires devastated their natural habitat\n\nThe estimated 20-year-old and eight-month-old primates were looking for food after their home in the forest was destroyed.\n\nA team from Gunung Palung National Park, the Natural Resources Conservation Agency of West Kalimantan and International Animal Rescue released them in the area of Batu Barat Village, North Kayong Regency, in the National Park last Friday.\n\nWhen the orangutans were rescued, they were found in an extremely serious condition.\n\nAs well as being very thin, a lack of food had made them severely dehydrated, animal welfare workers said.\n\nThe three orangutans were relocated as their forest home had been burned down.\n\nThese injuries showed that in addition to being threatened by the forest fires which scorched their homes, orangutans are also vulnerable to being attacked by humans when they are forced to search for food and shelter outside their natural habitat, International Animal Rescue said.\n\nMama Sifa being released in Ketapang. She was released after wandering the forest and walking into plantations looking for food\n\nMama Sifa (right) and her cub Sifa being released into the forest in Ketapang, West Kalimantan\n\nDr Joost Philippa, Indonesia medical team advisor, said: 'The orangutans are now healthy and ready to be returned to their habitat.'\n\nSince fires hit the forest areas in Ketapang in July six orangutans have been rescued, including Mama Sifa and her baby.\n\nAmong the others saved were three named Arang, Bara and Jerit, that were also returned to the wild last week.\n\nAs well as malnutrition, Jerit had a festering wound on his leg from a snare and vets found two bullets in Arang's eyes.\n\nAlthough rescued in different places and at different times, the threats they faced forest fires and human conflict were the same, according to rescuers.\n\nSince fires hit the forest areas in Ketapang in July six orangutans have been rescued, including Mama Sifa (pictured) and her baby\n\nSifa and her mother Mama Sifa were rescued from the recent massive forest fires in Indonesia\n\nThe overland journey took four hours and was continued by boat across the river for one hour and followed by a journey on foot for half an hour to the release site in Batu Barat.\n\nThe West Batu area which is in the Gunung Palung National Park was chosen as the release site based on the results of a pre-release survey to check the suitability of the area.\n\nAlan Knight OBE, IAR chief executive, said: 'Our goal is always to release rescued orangutans back into their natural habitat and in that sense this translocation operation has been a huge success.\n\n'However, the underlying problem of habitat destruction still remains and, until that is addressed at the highest level, our team will continue to be called on to rescue orangutans in desperate need of food and shelter.'\n\nThese orangutans, who are part of similar populations but in different areas, were pushed to the edge of their habitat by fires and human conflicts, animal charities said.", "description": "A mother and daughter, nicknamed Mama Sifa and Sifa, were among the trio of orangutans released back to their natural habitat in the forest of Ketapang, West Kalimantan.", "authors": ["Chris Dyer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/12/19690002-0-image-a-70_1571052631663.jpg", "published_at": "2019-10-14"}