{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/2019/09/10/trumps-housing-finance-plan-will-make-mortgages-more-expensive-especially-black-borrowers-say-housing-groups", "downloaded_at": "2019-09-10 23:31:14.508355+00:00", "title": "Trump’s housing finance plan will make mortgages more expensive, especially for black borrowers, housing groups say", "language": "en", "text": "\n\nFor-sale signs beckon buyers to homes along Park Avenue in Richmond, Va. (Steve Helber/AP)\n\nThe Trump administration’s plan to overhaul the country’s housing finance system would make mortgages more expensive for minority borrowers and aspiring homeowners in the South, the Midwest and rural communities, according to fair housing and lending groups.\n\nThe plans, unveiled last week by the Treasury and Housing and Urban Development departments, would end government control of Fannie Mae and Freddie Mac, which purchase mortgage loans and package them into securities that they guarantee. The proposal also recommends eliminating the mortgage backers’ affordable housing goals and introducing competition that experts say could further reduce access to credit for low-income communities.\n\n“This plan would interject new entities that would cream the market by seeking to serve the most lucrative regions and borrowers,” such as New York and San Francisco, where home values have skyrocketed, said Nikitra Bailey, executive vice president of the Center for Responsible Lending. “The very communities that need greater access to mortgage credit — communities of color, specifically — would have great difficulty securing credit.”\n\nTreasury Secretary Steven Mnuchin, HUD Secretary Ben Carson, and Federal Housing Finance Agency Director Mark Calabria defended the housing proposals before the Senate Banking, Housing and Urban Affairs Committee on Tuesday.\n\nTrump has been briefed on the reports and accepted them, Mnuchin said.\n\n[HUD raises the bar for bringing discrimination claims]\n\nThe centerpiece of the administration’s plans call for releasing Fannie Mae and Freddie Mac from government control 11 years after they were bailed out by taxpayers. They have continued to play a critical role in sustaining the U.S. housing market but don’t have enough capital to operate as private companies again.\n\nFannie Mae and Freddie Mac currently have a combined $6 billion in capital but should have about $100 billion, Mnuchin told the Senate panel. “We think they need a lot of capital,” he said. The companies “could not operate today if not for the Treasury lines.\"\n\nUnder the administration’s plan, Fannie Mae and Freddie Mac would pay a fee in exchange for a government guarantee backing their businesses. The plan is a potential windfall for hedge funds that have invested heavily in the companies’ stocks. Those investors have argued for years that the companies should be released from government control, allowing their stock prices to rise.\n\nCongress is unlikely to pass sweeping housing legislation before the 2020 presidential election. But some senators said it should be a priority. “This whole thing is a car wreck. It’s a dumpster fire,” Sen. John Neely Kennedy (R-La.) said of the current system.\n\nMnuchin said last week that the administration is “committed to promoting much needed reforms to the housing finance system that will protect taxpayers and help Americans who want to buy a home.”\n\nFannie Mae and Freddie Mac, which back half of the nation’s mortgages, have a mandate to ensure access to affordable loans and are responsible for the broad availability of the 30-year fixed-rate mortgage.\n\nThe enterprises have had an obligation to make roughly a quarter of the mortgages they back to low-income borrowers, under affordable housing goals introduced in the 1990s and carried forward after entering into government conservatorship during the 2008 housing crash.\n\nBut the Trump administration has proposed replacing the affordable housing goals with a more “efficient, transparent and accountable mechanism,” such as a new fee that would be transferred to HUD to promote affordable housing activities. Many consumer and civil rights groups argue that the plan would not directly increase homeownership among low-income families.\n\n“Essentially they are trying to shrink the government footprint in the market and introduce private guarantors that won’t have the same obligations as Fannie Mae and Freddie Mac,” said Jesse Van Tol, chief executive of the National Community Reinvestment Coalition.\n\nIn addition, housing advocates say, the administration’s plan would lead to a bifurcated market that would block first-time home buyers and low-income borrowers, many of whom are people of color, from lower-cost conventional loans. Borrowers who cannot afford 20 percent down payments and have less-than-pristine credit scores would be channeled into more-expensive loans insured by the Federal Housing Administration, whose insurance premiums last for the life of the loan.\n\n“The magnitude of the impact is huge,” Bailey said. “This continues the system where wealthier and mostly white families have access to affordable mortgage credit while keeping creditworthy families of color from accessing the mortgages they deserve.”\n\nCarson on Tuesday blamed the lack of affordable housing on local restrictions related to zoning and rent control as well as neighborhood opposition. He disputed accusations from Democratic lawmakers that the Trump administration does not care about housing discrimination or housing for low-income and working-class families, citing a HUD investigation into San Francisco’s policies on affordable housing.\n\n[Ben Carson’s HUD dials back investigations into housing discrimination]\n\nThe housing finance proposals, much of which need congressional approval, come at a time when black homeownership hovers just above 40 percent — slightly lower than when the Fair Housing Act was passed in 1968. In comparison, white homeownership has increased in the past five decades to 73 percent.\n\n“Rather than create a system that addresses the needs of working families, the Trump administration has put out half-baked proposals that will make mortgages more expensive and harder to get,\" said Sen. Sherrod Brown (D-Ohio), ranking Democratic member of the Banking Committee.\n\nBlack families were the hardest hit of any Americans during the 2008 housing crisis. African Americans, including those in upper-income black communities such as Prince George’s County, were disproportionately targeted by predatory lenders during the housing boom and faced foreclosure at greater rates. Many of those borrowers qualified for less expensive credit on safer terms.\n\nAfter the recession, stricter credit restrictions made it harder for black families to qualify for mortgages.\n\n“In the middle of a housing affordability crisis, when the gap between the black and white homeownership rates is as big as it was when housing discrimination was legal, the Trump administration wants to make it harder for creditworthy working families — especially families of color — to buy a home and build wealth,” Sen. Elizabeth Warren (D-Mass.) said. “That’s shameful.”", "description": "The Trump administration’s plan to overhaul the housing finance system would make mortgages more expensive for minority borrowers and aspiring homeowners in the South, the Midwest and rural communities, according to fair housing and lending groups.", "authors": ["Tracy Jan", "Reporter Covering The Intersection Of Race", "The Economy", "Renae Merle", "Reporter Covering White-Collar Crime", "Wall Street", "September At Pm", "Tracy Jan Covers The Intersection Of Race", "The Economy For The Washington Post. She Previously Was A National Political Reporter At The Boston Globe.", "Renae Merle Covers White-Collar Crime"], "top_image": "https://www.washingtonpost.com/resizer/Ds1e6Pwh6gnlB__2PBtIcNp9Zys=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EAQKR4WKKUI6TFQVR4NDFFROAQ.jpg", "published_at": "2019-09-10"}