{"pub": "yahoo", "url": "https://news.yahoo.com/under-armour-stock-jumps-as-kevin-plank-hands-reins-to-coo-frisk-143129953.html", "downloaded_at": "2019-10-22 15:15:48.165529+00:00", "title": "Under Armour's stock jumps as Kevin Plank hands reins to COO Frisk", "language": "en", "text": "Shares of Under Armour (UAA) jumped on Tuesday, as investors cheered news that the performance apparel and footwear company will promote its current COO and president Patrik Frisk to CEO at the start of the new year.\n\nFounder Kevin Plank, who has served as its CEO since 1996, will step down from his role effective January 1. Plank’s new titles will be executive chairman and brand chief, the company said.\n\nThe leadership transition comes at an important time for Under Armour, which is undergoing a turnaround as it tries to jumpstart sluggish domestic sales. Judging by the stock’s reaction, it appeared that Wall Street viewed the incoming CEO as a positive for the brand. Shares of Under Armour were last trading up about 2.5% near $20.53.\n\nFrisk, a retail veteran with 30 years experience in apparel and footwear, joined Under Armour halfway through 2017 after serving as CEO of footwear giant The ALDO Group, and previously held leadership positions at VF Corporation.\n\n“As my partner during the most transformative chapter in our history, [Frisk] has been exceptional in his ability to translate our brand’s vision into world-class execution by focusing on our long-term strategy and re-engineering our ecosystem through a strategic, operational and cultural transformation,” Plank said in a statement.\n\n‘An important evolution’\n\nFILE - In this March 31, 2011, file photo, Kevin Plank, founder and CEO of Under Armour, appears on the \"America's Nightly Scoreboard\" program on the Fox Business Network, in New York. Plank will step down as CEO in the new year to become the company’s executive chairman and brand chief. Patrik Frisk, president and chief operating officer, will become only the second CEO of Under Armour since the athletic gear company was founded in 1996. (AP Photo/Richard Drew, File) More\n\nShares of Under Armour are up about 14% year-to-date, but well off the levels reached in July above $27 — which was the highest since January 2017. Under Armour will report its third-quarter earnings results on Nov. 4.\n\nAnalysts at Baird called the CEO transition “an important evolution” for the company, allowing for Frisk to take the “full day-to-day reign” and Plank to have “greater strategic freedom.” Baird, which maintains an outperform rating on the stock, added that the move is also a “dual-vote of confidence” in both the board and Frisk.\n\n“We expect the move to elevate Frisk to the CEO role to be viewed favorably internally as well as externally with investors, given his proven track record spanning nearly 30 years across footwear/ apparel brands plus vital role in the brand's ongoing transformation over the past ~2 years,” analyst Jonathan Komp wrote in a note to clients.\n\n“As CEO, Frisk formally will have the ‘wheel to steer the ship’ in regard to ongoing execution of UAA's transformation, while Plank should have greater freedom/flexibility to help provide vision/leadership for Frisk and to pursue other bigger-picture opportunities for the brand,” Komp added.\n\nPiperJaffray noted that founder transitions “can be challenging,” but they’re “favorable” on this announcement, with the bank also citing Plank’s newfound freedom as a bonus.\n\nNow, the founder can “continue to focus on the product aspects of the brand he founded while allowing Patrik Frisk to further expand his leadership & operational roles as CEO,” analyst Erinn Murphy wrote. “Mr. Frisk, from our view, has been one of the key architects behind the brand's current turnaround and we'd expect his leadership to usher in stability within the ranks.”\n\nYet analysts at Oppenheimer maintained a “rather subdued stance” on the company’s prospects. They noted that “sales growth at the brand is apt to languish, against now much stronger competition within the broader athleisure category.”\n\nOppenheimer added that “we interpret today’s news from Under Armour as a potential signal that the company continues to struggle at least somewhat in its repositioning efforts.”\n\nAt the investor day in December 2018, Plank outlined how “instrumental” Frisk has been in transforming the company’s operations and strategy, and how he helped Under Armour “supercharge our ability to get stronger, faster and smarter.” Frisk then emphasized that the company’s target customer is the “focus performer” despite the criticism the company has faced around missing the athleisure trend.\n\nThe founder even pulled up a photo of the executive pair unknowingly showing up at an event in New York wearing the same Under Armour outfit from head-to-toe.\n\n“So if you have any questions, we're certainly in sync, I'd say. There you have it,” he added.\n\n\n\nJulia La Roche is a finance reporter at Yahoo Finance. Follow her on Twitter.", "description": "Wall Street views incoming Under Armour CEO Patrik Frisk, a 30-year retail veteran, favorably.", "authors": ["Julia La Roche"], "top_image": "https://s.yimg.com/uu/api/res/1.2/gFOL7yaLGIetb3fCdbwlkA--~B/aD0yNTkyO3c9Mzg4ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/442ada90-f4c3-11e9-8eb7-8f51e8263a3a", "published_at": "2019-10-22"}