{"pub": "theverge", "url": "https://theverge.com/2019/10/1/20891868/3d-printing-rockets-relativity-space-stargate-terran-1-rocket-funding-launch", "downloaded_at": "2019-10-05 14:20:32.465221+00:00", "title": "Startup that aims to 3D-print rockets says it’s fully funded for its first commercial missions", "language": "en", "text": "Aerospace startup Relativity Space — the company that aims to launch the first fully 3D-printed rocket to orbit — says it has raised all of the money it needs to launch its first mission and then enter commercial operations as early as 2021. After raising $140 million in its latest funding round, Relativity says its total funding now equals $185 million, which is enough money to carry the company through its first flights over the next couple of years.\n\nStarted by former engineers at Blue Origin and SpaceX, Relativity has grand ambitions to create all of its vehicles — from the engines to the fuselage — using 3D printing almost exclusively. The goal is to overhaul how rockets have been built for the last 50 years by taking people out of the manufacturing process and automating almost everything. By building rockets this way, Relativity claims it can drastically cut down costs by requiring fewer parts per rocket. Eventually, the company hopes to replicate this 3D-printing process on another world, like Mars, creating a rocket that can take off from the planet and return to Earth.\n\nRelativity says its total funding now equals $185 million\n\n“The hope would be we are one of the largest customers of Starship or New Glenn, and that we are actually more building the factory that those [rockets] launch and land on Mars,” Relativity Space CEO Tim Ellis tells The Verge.\n\nRight now, the company is focusing on its first rocket, the Terran 1, a small- to medium-sized vehicle being built with Relativity’s specialized Stargate 3D printers in Los Angeles. Relativity says these updated printers could eventually create a Terran 1 rocket in less than 60 days from raw material. “Those are actually twice the print size of the prior version, and we have several of those already up and operational,” says Ellis of the updated printers.\n\nDesigned to stand about 100 feet tall, the Terran 1 rocket will be able to carry up to 2,755 pounds (1,250 kilograms) of payload, which is just 6 percent of the capacity of SpaceX’s Falcon 9 rocket. However, the company says it has increased the size of the vehicle’s nose cone, or payload fairing, making it able to hold twice the volume as originally planned.\n\nThe rocket has not made its debut yet, but Relativity has hit several important milestones on the road to launch. Namely, the company has completed more than 200 hot fire engine tests out of test stands at NASA’s Stennis Space Center in Mississippi, and it has secured a launch site. The Air Force awarded Relativity a 20-year lease at a launch site at Cape Canaveral Air Force Station in Florida, called LC-16. It’s from this location that Relativity plans to fly the first Terran 1 rocket.\n\nEllis says all of this new funding is going toward refurbishing that launchpad as well as expanding Relativity’s facilities in Los Angeles. The company also has plans to build an automated factory at Stennis. In the meantime, the company is still testing various systems on the rocket. The next big milestone will come when Relativity tests the rocket once it’s been pieced together, followed by the biggest test — its actual launch. Relativity has already signed up a lot of customers, including Telesat, Momentus, and Spaceflight, which are ready to fly on the company’s rocket.\n\n“Soon we’ll be able to launch what is the world’s first fully 3D printed rocket with customers,” says Ellis. “Not only will it be a big milestone for customers in the space and launch industry, but I also think it’s a huge testament to the 3D printing technology and Stargate factory that we’re building as well.”", "description": "Aerospace startup Relativity Space — the company that aims to launch the first fully 3D-printed rocket to orbit — says it has raised all of the money it needs to launch its first mission and then enter commercial operations as early as 2021.", "authors": ["Loren Grush", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/m2wlxwy8dFO9Ab3AqTVXykMr4wk=/0x227:2000x1274/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19248958/New_Stargate_2.png", "published_at": "2019-10-01"}