{"pub": "yahoo", "url": "https://news.yahoo.com/escaped-murder-suspect-added-15-most-wanted-list-145700989--abc-news-topstories.html", "downloaded_at": "2019-09-11 07:29:22.376218+00:00", "title": "Escaped murder suspect added to 15 Most Wanted list 'could be anywhere in the US'", "language": "en", "text": "Escaped murder suspect added to 15 Most Wanted list 'could be anywhere in the US'\n\nEscaped murder suspect added to 15 Most Wanted list 'could be anywhere in the US' originally appeared on abcnews.go.com\n\nA murder suspect who escaped custody with his wife by overpowering a transport team has been added to the Unites States Marshals' 15 Most Wanted List.\n\nThe move to include suspect Blane Barksdale on the 15 Most Wanted List provides more resources to develop leads as investigators push to find Barksdale and his wife, who have been on the run for over two weeks, Timothy Hughes, deputy chief of U.S. Marshal for the District of Arizona, said Monday.\n\nThe reward for Blane Barksdale -- a \"career criminal\" -- has increased to $25,000 with his addition to the 15 Most Wanted List, authorities said, while Susan Barksdale has been elevated to a major case with reward of up to $10,000.\n\nPHOTO: Blane, 56, and Susan Barksdale, 59, are wanted on murder and arson charges, police in Tucson said, Aug. 27, 2019. (Tuscon Police Department via Facebook) More\n\n\"They could be anywhere in the U.S.,\" David Gonzales, U.S. Marshal for the District of Arizona, said at a news conference Monday,\n\nBlane and Susan Barksdale, both suspects in the April murder of 72-year-old man in Tucson, were being transported from upstate New York to Pima County, Arizona, when they escaped on Aug. 26, authorities said.\n\n(MORE: New images released of married murder suspects who allegedly escaped from transport van)\n\nThe Barksdales were in a transport van in Utah when they overpowered the two security guards, kidnapping them as well a third inmate who was in the van, said Gonzales.\n\nThe Barksdales drove the van to Vernon, Arizona, where they obtained a pickup truck from an acquaintance, Gonzales said. The couple then ditched the van and drove off in the pickup truck and have not been seen since, Gonzales said.\n\nPHOTO: Authorities are looking for Blane Barksdale, 56, and Susan Barksdale, 59, fugitives wanted in the killing an Arizona man. (U.S. Marshals Service via AP) More\n\n\"We believe based on tips, calls into the Marshals Service from informants, from interviews, that the Barksdales were possibly east\" of the Snowflake, Arizona, area, Gonzales said, where some people live \"off the grid\" and can easily \"hide out.\"\n\n“We spent almost two weeks ... working this case around the clock since their escape,\" Gonzales said. \"We have not had any solid leads where they might be.\"\n\n(MORE: Police searching for couple wanted on murder charges who escaped custody)\n\nAuthorities are now changing the direction of the investigation from a \"rapid manpower search to an intense fugitive search,\" Gonzales said.\n\n\"Instead of having 40, 50 police officers, agents on the ground, we're going to pull back a little bit, reset our investigation, go over other leads,\" Gonzales said.\n\nThe Barksdales are believed to be armed and dangerous and anyone with any information is urged to call the Marshal Service, Gonzales said.\n\nSusan Barksdale was not added to 15 Most Wanted List because her husband is the primary focus of the murder case, Gonzales said.\n\nThe pickup truck is described as a red GMC Sierra with Arizona license plate number 127XTY. A $5,000 reward is also available for the pickup truck, Gonzales said.", "description": "A murder suspect who escaped custody with his wife by overpowering a transport team has been added to the Unites States Marshals' 15 Most Wanted List.  The move to include suspect Blane Barksdale on the 15 Most Wanted List provides more resources to develop leads as investigators push to find Barksdale", "authors": ["Emily Shapiro"], "top_image": "https://s.yimg.com/uu/api/res/1.2/uS6BE5EKjeTq.z.rKTgaDw--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.go.com/blane-barksdale-flt-rt-ps-190910_hpMain_16x9_992.jpg", "published_at": "2019-09-10"}