{"pub": "americanconservative", "url": "https://theamericanconservative.com/urbs/the-enduring-city-is-more-than-retail-and-coffee-shops", "downloaded_at": "2019-10-05 13:19:54.372995+00:00", "title": "The Enduring City Is More Than Retail and Coffee Shops", "language": "en", "text": "[Editor’s Note: Please join author Duncan Stroik (with Rod Dreher and Michael Brendan Dougherty) in New York City on September 17 for a discussion of “Till We Have Rebuilt Notre Dame: A Conversation on the Future of Architecture, Faith, and Civilization in the West.“]\n\nWhen you go to a great European city, you find beautiful spacious piazze, outdoor cafes, charming shops, fountains to sit near, and people to watch. For many today, that symbolizes the good city.\n\nAs bricks-and-mortar retail decreases, our cities become more about experiences we can’t get online. Most of us like active places with nightlife, theatres for movies and plays, concert halls, museums, parks for bike riding, and sidewalks for walking our dogs. Fresh food, old bookshops, coffee bars, and micro-breweries satisfy our passions. Those make a public realm worth visiting.\n\nAdding a church to the mix doesn’t really help. Or does it? Is the European plaza so great merely because of commerce and culture? Does it need something else? Does it need the temple? Our temples serve people’s most fundamental needs: forgiveness, hope, and meaning. Their presence on the piazza says that commerce is not enough, that not even culture is enough.\n\nBut who visits churches? They need to be something out of the ordinary like Saint Patrick’s Cathedral in New York, preferably with masterpieces of art inside. We are a secular country with Protestant origins and our church buildings are not normally open, and in any case rarely worth visiting for their architecture or their art. (Interestingly, a recent study in the U.K. found that church architecture had a greater impact on conversions than even youth groups. If left open, people will visit beautiful churches and have the opportunity for conversion.)\n\nThere are certainly many great cities with churches where the urban realm is not so lively. There neither commerce nor culture nor the temple flourish. In Naples, I have witnessed many closed churches with desolate piazze. Of course, a closed church can still be a beautiful ornament on the square, not unlike a Roman ruin, but it will not be able to fulfill its ultimate purpose. This is because the role of church architecture, like retail, is to draw us inside, but for a different purpose: to bring us in contact with the divine.\n\nA city is more than just commerce and culture. The good city needs a civic realm marked out by a proper architecture of the civic realm. City Halls are there to promote good government, schools to promote education, courts to promote justice, museums to promote art and concert halls to promote the performing arts. Some of these civic structures we visit once a year or on special occasions, others every week or daily. Others we prefer not to visit, like the courthouse. These are the foci of our cities, and we have invested our best efforts to erect them.\n\nThe answer to good cities is not to put retail everywhere to activate the public realm with commerce, nor to add cultural pleasures like parks and micro-breweries. It’s first to have a public realm that is worth visiting. That public realm must include our temples. And it must be architecturally expressed in a certain way. If churches and other civic buildings are invested with monumental architecture, they will become the focus of our streets and city squares. Adding a church to the mix does help. It helps create and sustain a vital public realm by serving people’s most fundamental needs for forgiveness, hope, and meaning in a way no other civic institution can do. And ironically, perhaps, temples will draw parishioners and tourists alike, resulting in vibrant commerce as well.", "description": "", "authors": ["New Urbs"], "top_image": "https://www.theamericanconservative.com/wp-content/uploads/2019/08/aldwinns-2Q-qi1_-R7A-unsplash@2x-e1565284105147.jpg", "published_at": "2019-08-08"}