{"pub": "nationalreview", "url": "https://nationalreview.com/bench-memos/mystifying-amicus-brief-for-some-former-sgs-in-title-vii-sogi-cases", "downloaded_at": "2019-10-05 06:27:07.058591+00:00", "title": "Mystifying Amicus Brief for Some Former SGs in Title VII SOGI Cases", "language": "en", "text": "As you’d expect, the briefs and amicus briefs on behalf of the employees in the Title VII SOGI cases in the Supreme Court are replete with pseudo-textualist claims that Title VII’s ban on employment practices that “discriminate … because of … sex” prohibits discrimination on the basis of sexual orientation or gender identity. The Department of Justice’s briefs comprehensively answer these claims. But I hope to find time to address some of the amicus briefs directly.\n\nAdvertisement\n\nAdvertisement\n\nLet’s start with the amicus brief filed by Laurence Tribe and Joshua Matz on behalf of two former Solicitors General (Theodore B. Olson and Seth Waxman) and two former acting Solicitor Generals (Walter Dellinger and Neal Katyal).*\n\n1. The brief’s core claim that “an employer who discriminates based on transgender status necessarily accounts for sex at every single step of his or her reasoning” rests on the assumption that any employment practice that can be applied only by identifying an employee’s sex amounts to discrimination on the basis of sex under Title VII. But that assumption is contradicted by the longstanding acceptance of sex-specific restrooms, sex-specific locker rooms and shower facilities, and dress codes (which all require taking account of an employee’s sex).\n\nAmazingly, the brief does not even acknowledge this contradiction, much less try to explain it away.\n\nAdvertisement\n\n2. Relatedly, while the brief undertakes to parse the meaning of the terms “because of,” “such individual’s,” and “sex” in Title VII, it never examines what the critical word “discriminate” means in conjunction with those other terms. It instead simply assumes, wrongly, that any distinction on the basis of sex amounts to unlawful discrimination on the basis of sex. So much for serious textualist analysis.\n\nAdvertisement\n\n3. The brief wrongly asserts that the Court in Oncale v. Sundowner Offshore Services (1998) “held that Title VII forbids ‘male-on-male sexual harassment in the workplace.’” In fact, the Court held only that there is no “categorical rule excluding same-sex harassment claims from the coverage of Title VII.” In other words, male-on-male sexual harassment in the workplace does not always violate Title VII; it does so only if it also “meets the statutory requirements.”\n\nAs to what those “statutory requirements” are, the Court explained:\n\nWe have never held that workplace harassment, even harassment between men and women, is automatically discrimination because of sex merely because the words used have sexual content or connotations. “The critical issue, Title VII’s text indicates, is whether members of one sex are exposed to disadvantageous terms or conditions of employment to which members of the other sex are not exposed.” [Quoting concurring opinion of Justice Ginsburg in Harris v. Forklift Systems (1993) (underlining added).]\n\nDiscrimination on the basis of sexual orientation or gender identity does not expose “members of one sex … to disadvantageous terms or conditions of employment to which members of the other sex are not exposed.” Oncale’s reading of Title VII thus defeats, rather than supports, the brief’s claim.\n\n* I initially messed up on the listing of former SGs and acting SGs. For some reason, the brief is also submitted on behalf of a former associate White House counsel, Karen Dunn.", "description": "Let’s start with the amicus brief filed by Laurence Tribe and Joshua Matz on behalf of three former Solicitors General (Walter Dellinger, Theodore B. Olson, and Seth Waxman) and one former acting Solicitor General (Neal Katyal).", "authors": ["Ed Whelan", "Andrew C. Mccarthy", "Alexandra Desanctis", "Kevin D. Williamson", "Jim Geraghty", "John Yoo", "Kyle Smith", "David French", "Mairead Mcardle", "Read More"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2016/02/obama-lawless-battle-transgender-students-b-1.jpg?resize=300%2C300&ssl=1", "published_at": "2019-09-10"}