{"pub": "marketwatch", "url": "https://marketwatch.com/story/a-recession-is-coming-how-to-protect-your-retirement-2019-09-25", "downloaded_at": "2019-09-25 13:46:45.380726+00:00", "title": "A recession is coming: How to protect your retirement", "language": "en", "text": "With slowing global growth, trade wars, and inverted yield curves, it seems everywhere you look someone is talking about a recession. Will we have one? When? Will it be mild or severe?\n\nThe only question anyone can accurately answer is the first one. Yes, we will have a recession. Recessions are part of normal economic cycles. When? No one knows for sure. Mild or severe? No one knows for sure.\n\nBut most financial professionals want to sound like they know. They study data and post charts and graphs to illustrate their view on why there will or won’t be a recession and how severe it will or won’t be. What does that data do for the average retiree? Not much.\n\nRead: Money expert Jean Chatzky on how Americans should save for retirement\n\nMaybe you subscribe to Charlie Chart’s point of view and go to cash to protect your money. Or maybe you follow Gail Graph’s newsletter and you decide to go all-in on a market dip, feeling confident there won’t be a severe recession. Some of you will be right and some of you won’t. But all of you are guessing.\n\nIs there a better way? Yes. It’s called having a plan. Businesses have them to manage their cash flow, inventory, expenses and such, and they use them to help navigate the constantly changing economic environments. Retirees and near-retirees need a plan, too. A plan keeps you from making quick and all-too-often misguided emotional decisions that may derail your retirement.\n\nThe type of plan you need isn’t one that tries to predict recessions. That’s akin to roulette. It either works, or it doesn’t. Instead, the type of plan you need is one that acknowledges that recessions will come along during your retirement years. Rather than the constant guessing game of trying to avoid them, you make an action plan, so you know how to power right through.\n\nThis sensible type of plan models out your income and expenses over varying market conditions and provides indicators on when you may need to reduce spending or adjust investments. You know ahead of time the specific actions you will take if your financial plan metrics fall below predefined threshold amounts.\n\nRead: She worked as a nurse her entire career — but found an even greater calling in retirement\n\nWith a recession-proof plan, it doesn’t mean the recession won’t affect you. It means you know what to do when it comes along. Let’s look at an example.\n\nSuppose you’re three years out from retirement and you’re 62 years old. You plan to retire at 65. You need $80,000 a year to be comfortable. You plan on delaying your Social Security to age 70 at which time you’ll get about $37,000 a year. From age 65 to 70, you’ll need to withdraw $80,000 a year from savings and investments. After age 70, only $43,000 a year. You want to plan for a 30-year withdrawal time horizon.\n\nYou could look at the 4% rule and determine that you’ll need $2 million to support your $80,000 a year in your first few years. But you’ll need less after that. So, is the 4% rule the best way to go? Not really.\n\nInstead, you take the present value of the 30 years’ worth of withdrawals. If you assume your investments earn the inflation rate of 3%, you can calculate that by age 65 you’ll need $1,012,268 to support $80,000 for the first five years, then $43,000 for the next twenty-five. Let’s assume you have the needed amount today\n\nNext, you add up your first seven to eight years’ worth of withdrawals, which equals $486,000 and $529,000 respectively. You turn that portion of your investments into a bond ladder, or use other types of safe investments, with the amounts maturing each year matched up to what you need to withdraw that year. You invest the rest in stock index funds. Your allocation will be about 48% to 52% in bonds.\n\nIf you are conservative, you might lean toward the 52% in bonds, which covers eight years of withdrawals. You know that if a prolonged recession comes along, you will forego the inflation raises that you built into your plan. The good news is that during a prolonged recession, inflation is usually low. So, the net impact on your lifestyle is likely to be minor.\n\nIf you are more comfortable with a long-term outlook for investing, you might lean toward 48% or even less in safer investments. Maybe you want to cover only the first five years of withdrawals, which covers the gap to get you to maximum Social Security benefits. That would be about $400,000 allocated to safe choices, or about 40% of your portfolio.\n\nNow, if a recession or bear market comes along, depending on the number of years you want covered, you have five to eight years of safe investments in place, giving you time for an economic cycle to play out. With this type of plan in place, there is no need to let the latest headlines drive an emotional reaction.\n\nThis is a simplified example. It doesn’t take taxes, home equity, account types, or any other sources of income into account. But it does illustrate how a financial plan can be used to align your investments up with the job they need to do for you. And how to structure your investments in a way that gives you time to ride out the normal cycles of expansion and contraction.\n\nAnd, if you don’t like the idea of a plan, there are always plenty of headlines and pundits you can follow instead.", "description": "Recessions are a certainty — just make a plan", "authors": ["Dana Anspach"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GE326_roulet_ZG_20180224102556.jpg", "published_at": "2019-09-25"}