{"pub": "metro", "url": "https://metro.co.uk/2019/10/23/mum-creates-genius-meal-planning-board-using-lollipop-sticks-make-dinner-decisions-easier-10970407", "downloaded_at": "2019-10-23 16:01:32.606246+00:00", "title": "Mum creates lolly stick meal planner to make dinner decisions easier", "language": "en", "text": "The box of sticks and the homemade board (Picture: Lou Kirsty Yeoman)\n\nNot sure what to have for dinner? This mum has a genius solution to take the hassle out of meal planning.\n\nLou Kirsty Yeoman created a board and wrote a selection of all her favourite meals on lollipop sticks.\n\nEach week she picks out seven sticks at random and clips them onto the board.\n\nThe rule is that whatever the sticks says goes and she can go out and buy all the ingredients.\n\nOptions include chicken orzo, crispy chilli beef, fajita, pasta bake, rogan josh, nachos, spag bol and campfire stew.\n\nThe mum-of-two runs a business printing vinyl stickers so she was able to print out the days of the week in gold lettering, but you can pick up similar stickers online.\n\nShe filled the box with all her family’s favourite dishes (Picture: Lou Kirsty Yeoman)\n\nShe stuck them to a board painted black, added some screws and string to hang the board and stuck clicks beside each day using pins.\n\nAdvertisement\n\nAdvertisement\n\nShe then gathered up the sticks and wrote all the meals she knows the family likes on them in pen.\n\nAfter spotting the idea on a Slimming World group, she decided to use it to create a plan for all the family dinners.\n\nShe made the board herself (Picture: Lou Kirsty Yeoman)\n\nShe posted the board on the Organise my UK home ltd Facebook group and said: ‘This has made life so much easier. No thinking what to make every day pick a stick and that’s what we are having.’\n\nPeople commented on the post to say they loved the meal planning board.\n\nOne said: ‘That’s a great idea.’\n\nAnother added: ‘I’m planning to do something like this for jobs around the house for the kids. Never thought of doing one for meals too.’\n\nShe’s not the only one doing a little DIY – earlier this week, we brought the story of the mum who created an incredible play house under the stairs for her daughter for under £100.\n\nMORE: Primark is selling an amazing wooden Harry Potter Hogwarts Express train advent calendar for £15\n\nMORE: How to keep your fitness routine going when the clocks go back\n\nAdvertisement Advertisement", "description": "Lou Kirsty Yeoman made a board with sticks and clips and chooses lollipop sticks with meals written on them at random.", "authors": ["Laura Abernethy"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/mum-creates-meal-board-to-take-the-stress-out-of-deciding-what-to-have-for-dinner_1571845906.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-23"}