{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7578655/PC-world-gone-mad-Lizzie-Cundy-slams-Victorias-Secrets-decision-hire-plus-sized-model.html", "downloaded_at": "2019-10-16 14:23:10.986288+00:00", "title": "'PC world gone mad': Lizzie Cundy slams Victoria's Secret's decision to hire plus-sized model", "language": "en", "text": "Lizzie Cundy has slammed Victoria's Secret's decision to hire size-16 model Ali Tate Cutler insisting it was solely down to 'pressure' from the 'PC police'.\n\nThe 49-year-old presenter appeared on Good Morning Britain alongside American model Ali and Baroness Michelle Mone, 48, to discuss the lingerie retailer's decision to work with a plus-sized model for the first time in the brand's history.\n\nAli, who appears in the Victoria's Secret collaboration with the lingerie brand Bluebella, described herself on the show as a UK 16, argued that every woman should be able to feel 'sexy' regardless of their size.\n\nBut Lizzie said that it's a 'shame' the brand is becoming more inclusive because the 'Amazonian women' they usually hire 'work so hard for their bodies'.\n\nViewers were shocked that Ali was considered a plus-size at a 16, with many insisting the model 'isn't even big' and should be considered a 'normal' size.\n\nAli Tate Cutler has become the first size 14 (UK 16) model to be featured in a Victoria's Secret campaign\n\nLizzie said: ' I think there's pressure, I think its a shame.\n\n'Victoria secret is a winning brand. These women are like athletes and it's such a shame. I feel like your're under pressure, the PC world gone mad.\n\n'I just think its a shame because it's known for the supermodels and the Amazonian women who work so hard for their bodies.'\n\nAppearing via video link, New York-based Ali opened up about being considered plus-size, and admitted that despite growing up with the message that 'it was only beautiful to be thin' she believes that all women should be able to 'feel sexy' in lingerie.\n\nShe said: 'Plus sized is a term that is pretty undefined, but from my understanding it means anything over a US 8 (UK 12).\n\nViewers were shocked that Ali was considered a plus-size at a 16, with many insisting the model 'isn't even big' and should be considered a 'normal' size\n\nI'm a UK 16 and I have been that size for six years and I played soccer for 20-years and I was still that size.\n\n'I think the average size of women in America is a US 14 (UK 18) and just because women come in all different shapes and sizes doesn't mean that don't want to feel sexy.\n\n'I believe they can be sexy and a lot of people I've looked up to I've looked up to have been curvy women who are drop dead gorgeous.\n\n'The programming I grew up with made me think it was only beautiful to be thin.'\n\nAli appeared on GMB via video link where she insisted that every woman should be able to feel 'sexy' regardless of their size\n\nBaroness Michelle, 48, (left) who founded underwear brand Ultimo then weighed in, insisting it's 'body positivisty that sells'\n\nFans were baffled that the model was considered plus-sized, with one viewer questioning: 'Is she a plus sized model? Or is she just normal?'\n\nAnother commented: 'Plus size for Victoria's Secret isn't even big! It's a UK 10-12-14!'\n\nA third asked: 'What size is the plus size model? A size 12.'\n\nBaroness Michelle, who founded underwear brand Ultimo then weighed in, insisting it's 'body positivisty that sells.'\n\nCutler is working with Victoria's Secret as part of its new partnership with London-based lingerie brand Bluebella\n\nShe said: 'I say thank goodness they have changed.\n\n'When I used to own Ultimo we started all of this 15-years ago, so we used all the celebrities and then we mixed it up and we used real women.\n\n'So I believe that skinny doesn't sell anymore it's body positivisty that sells.'\n\nMore viewers questioned what is considered a plus size, with one saying: 'Plus size should be 16/18 plus Not size 12+ fsfsfsfs I'm a size 8 but a 12 is definitely not plus size wtf.'\n\nMore viewers questioned what is considered a plus size with one arguing the brand 'isn't where it is anymore'\n\nAnother said: 'Anything over a size 12 is plus size??'\n\nA third fumed: 'Amazonian women??? they are a fantasy, not real.'\n\nThe businesswoman went on to argue that although the women are presented as athletic, she doesn't feel it's 'normal' to have such a perfect body, and believes that curvier women are 'the new sexy'.\n\nShe said: 'I don't agree with that these models [are healthy]you say they go to the gym do they sit there and eat as much as we all eat.\n\n'It's not normal and it leads to lots of issues eating disorders mental health issues body dysmorphia bigger curvier women are the new sexy'.", "description": "Lizzie Cundy,49, slammed Victoria's Secret's decision to hire US model Ali Tate Cutler - who is a UK size 16 - claiming that the brand's usual 'Amazonian' models work 'so hard' for their bodies.", "authors": ["Monica Greep For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/08/19776604-0-image-a-2_1571211936739.jpg", "published_at": "2019-10-16"}