{"pub": "thehill", "url": "https://thehill.com/hilltv/rising/466329-nationwide-teachers-strikes-wake-up-call-for-democratic-party", "downloaded_at": "2019-10-18 01:05:01.407853+00:00", "title": "Former public school teacher: Strikes 'wake-up call' for Democratic Party", "language": "en", "text": "A former public teacher based in Chicago said Thursday that the recent rise of teacher strikes across the country has been a “wake-up call” for the Democratic Party, which he argued has been on the wrong side of the issue for years.\n\n“There’s definitely been a shift in the narrative,” Eric Blanc told Hill.TV on Thursday during an appearance on \"Rising.\"\n\nBlanc pointed to Democratic presidential candidate Cory Booker Cory Anthony Booker2020 Democrats recognize Pronouns Day Third-quarter fundraising sets Sanders, Warren, Buttigieg apart The Hill's 12:30 Report: Trump seeks distance from Syria crisis MORE (D-N.J.) as an example. Booker has said he would prioritize public schools as president, despite his past record of supporting charter schools when he served as the mayor of Newark, New Jersey.\n\nBlanc said he remains skeptical about Democratic support of the public school system as a whole.\n\n“The question is now whether the Democrats can be forced to do the right thing in practice,” he told Hill.TV.\n\nBlanc’s remarks come as thousands of Chicago public school teachers take to the streets to protest over a number of issues, ranging from pay and benefits to class sizes and learning conditions for students.\n\nNegotiations between the Chicago Teachers Union and Mayor Lori Lightfoot (D) remain stalled.\n\nLightfoot claimed that the union rejected her deal, which included a 16 percent pay raise over the course of five years and an increase in health care contributions.\n\nUnion leaders, meanwhile, have disputed the amount in the offer made by the city and said that the proposal fails to address other key demands, including the need to have a nurse in every school.\n\n—Tess Bonn", "description": "A former public teacher based in Chicago said Thursday that the recent rise of teacher strikes across the country has been a “wake-up call” for the Democratic Party, which he argued has been on the wrong side of the issue for years.", "authors": [], "top_image": "https://thehill.com/sites/default/files/blogs/chicago_teachers.jpg", "published_at": "2019-10-17"}