{"pub": "yahoo", "url": "https://news.yahoo.com/syria-army-reaches-border-area-deploys-around-turkish-130423038.html", "downloaded_at": "2019-10-27 12:58:57.392911+00:00", "title": "15 dead in Syria clashes between pro-Turkish forces, Kurds: monitor", "language": "en", "text": "A Syrian army convoy on a road between the cities of Tal Tamr and Ras al-Ain in Hassakeh province of northeast Syria on the border with Turkey (AFP Photo/-)\n\nBeirut (AFP) - Clashes in northeast Syria between pro-Ankara fighters backed by the Turkish air force and a Damascus-backed force led by Syrian Kurds left 15 dead on Saturday, a monitor said.\n\nRami Abdel Rahman, head of the Syrian Observatory for Human Rights, told AFP that nine pro-Turkish fighters and six members of the Kurdish-led Syrian Democratic Forces (SDF) were killed in a zone between the towns of Tal Tamr and Ras al-Ain.\n\nState news agency SANA said earlier Syrian government forces had entered the provincial borders of Ras al-Ain near Turkey's border on Saturday, an area that was taken by Turkish forces in the latter's weeks-long offensive against Syria's Kurds.\n\nThe Observatory said the Syrian government's deployment there was its largest in years.\n\nSyrian government troops had also deployed along a road stretching some 30 kilometres (18 miles) south of the frontier, SANA said.\n\nTurkey and its Syrian proxies on October 9 launched a cross-border attack against Kurdish-held areas, grabbing a 120-kilometre-long (70-mile) swathe of Syrian land along the frontier.\n\nThe incursion left hundreds dead and caused 300,000 people to flee their homes, in the latest humanitarian crisis in Syria's brutal eight-year war.\n\nTurkey and Russia this week struck a deal in Sochi for more Kurdish forces to withdraw from the frontier on both sides of that Turkish-held area under the supervision of Russian and Syrian forces.\n\nOn Saturday, the Britain-based Observatory said some 2,000 Syrian troops and hundreds of military vehicles were deploying around what Turkey calls its \"safe zone\".\n\nGovernment forces were being accompanied by Russian military police, the Observatory said.\n\nMoscow has said 300 Russian military police had arrived in Syria to help ensure Kurdish forces withdraw to a line 30 kilometres (18 miles) from the border in keeping with Tuesday's agreement.\n\nUnder the Sochi deal, Kurdish forces have until late Tuesday to withdraw from border areas at either end of the Turkish-held area, before joint Turkish-Russian patrols start in a 10-kilometre (six-mile) strip there.\n\nAnkara eventually wants to set up a buffer zone on Syrian soil along the entire length of its 440-kilometre-long border, including to resettle some of the 3.6 million Syrian refugees currently in Turkey.\n\nThe SDF has objected to some provisions of the Sochi agreement and it has so far maintained several border posts.\n\nTurkish President Recep Tayyip Erdogan warned Saturday that Ankara would \"clear terrorists\" on its border if the Kurdish forces, which his country view as an offshoot of its own banned insurgency, did not withdraw by the deadline.", "description": "Clashes in northeast Syria between pro-Ankara fighters backed by the Turkish air force and a Damascus-backed force led by Syrian Kurds left 15 dead on Saturday, a monitor said.  Rami Abdel Rahman, head of the Syrian Observatory for Human Rights, told AFP that nine pro-Turkish fighters and six members", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/6pkFH_2GODa1DKMd38IOcw--~B/aD00Njc7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/4d0bf6407dc832b1a2b2735c0dc3789c530ede77.jpg", "published_at": "2019-10-26"}