{"pub": "fox", "url": "https://foxnews.com/opinion/sissy-goff-child-doesnt-want-to-go-to-school-refusal-sissy-goff", "downloaded_at": "2019-09-10 23:32:42.609119+00:00", "title": "Sissy Goff: What can you do when your child doesn't want to go to school? -- How to handle 'school refusal'", "language": "en", "text": "How's your child doing with school at this point?\n\nWe’re a few days or even weeks in. Labor Day is over. The \"new\" has worn off. They’ve seen the friends they missed over the summer. Now, the stomach aches have begun on Sunday nights. The morning tears. The frequent visits to the school nurse. The calls or texts to come get her. The headaches that seem to disappear as soon as you make the decision to let him stay home and miss.\n\nIt’s about the time in my counseling office that I start to see an influx of girls and boys who have what is referred to as \"school refusal.\" In fact, The Anxiety and Depression Association of America states that between 2 to 5 percent of school age children suffer from school refusal.\n\nFRAZZLED GIRL'S ADORABLE BACK-TO-SCHOOL PHOTO GOES VIRAL\n\nSchool refusal typically takes place when a child is transitioning between school settings, such as beginning middle or high school. And it most commonly affects children between the ages of five and six, or 10 and 11.\n\nIf you have a child who is school-aged, introverted or has a touch of anxiety, you’ve likely encountered some degree of school refusal. I’m about to say something that you might not love—and your school refusing child certainly won’t. To work through any fear, we all have to do the scary thing. Your child included.\n\nYou see, I’ve been counseling children and families for 27 years. I have a new book out on anxiety called \"Raising Worry-Free Girls,\" and one for elementary-aged girls coming out in December called \"Braver, Stronger, Smarter.\" (Yes, after the quote from Pooh.) To do the research for those books, I read 23 books on anxiety. The research agrees that your child has to learn to do the scary thing. And one of the other most important things I learned and have experienced counseling children with anxiety (as well as anxious parents) is that anxiety is about anxiety. It’s not about whatever the given subject is at the time.\n\nAll children long to be independent. To feel brave and confident. In fact, research says that the more courage needed for the task, the more confidence they derive from that task.\n\nLet’s start with why certain children are anxious. What I tell kids in my office is that is the smartest, kindest, most conscientious, try-hard kinds of children (and adults, I’d add) who struggle with worry. It’s because things matter so much — that sometimes it’s hard to turn the volume on that matter down. And so, they worry.\n\nWhat happens with worry and development is that it follows a pattern. I tell kids that it's a lot like the one loop roller coaster at the fair. So, whatever your child is fearful about at the time, is what loops and loops around in their thoughts. That loop — or anxiety topic — will change with their development.\n\nFor example, most young children will worry about either being separated or something bad happening to one of their parents. I have seen a multitude of 3rd and 4th graders over the years who have \"looping\" thoughts around throwing up.\n\nMost 7th and 8th graders \"loop\" about something that involves being embarrassed in front of their peers or failing in school or in athletics. Basically, whatever is the worst thing they can imagine at a particular age is what their looping thoughts center on. It’s the same reason your looping thoughts often center around something bad happening to your child.\n\nThe fact that their worries shift with their development is also often why anxiety often goes undetected. In fact, statistics say that children often go two years before a child receives treatment for anxiety.\n\nThe problem with that is anxiety left untreated only gets worse. In addition, the two most common strategies parents use when faced with anxiety in their child are escape and avoidance.\n\nWe just said that to work through anxiety a child has to do the scary thing. So, in essence, we’re unwittingly making the problem worse. I believe it’s one of the primary reasons why we’re looking at one in four children now battling anxiety, with girls twice as likely to suffer from it as boys. In fact, we’re seeing more anxiety among children than either during the Great Depression or World War II.\n\nCLICK HERE TO GET OUR OPINION NEWSLETTER\n\nWe have got to do something to change the statistics.\n\nSo, let’s go back to school. Or, school refusal, in particular. Several of the children I’ve seen in the past year with school refusal have wise parents who have armed them with coping strategies to keep themselves or get themselves back into school. And, typically by October, their children are doing much better. I’ve also seen very well-meaning families who are now homeschooling their children.\n\nNow, there are times when the anxiety takes such a turn that a child is not physically or emotionally able to attend school. They are literally vomiting every morning. I’ve counseled those children before. The problem is that a child who stays home long-term has reinforcements on several levels, as you can imagine.\n\nThe child who is afraid to be away from their parents has that much more time with their primary caregiver.\n\nThe child who is afraid to interact with peers is removed from those peers, although likely still interacts with peers — but ones they know and feel comfortable around already.\n\nThe child who is fearful about the academic pressure of school is removed from the pressure from teachers and administrators and taught by someone with whom they likely already feel comfortable.\n\nNone of those children are learning to do the scary thing.\n\nEscape and avoidance. Neither help. We’ve got to do something different. For more on practical help, see next week's article on how to help your child work through an anxious school day. But, for now, at least make steps toward school.\n\nIf your child physically can’t go, make sure to have them do the work at home that he would be doing in school. Give her the same hours and structure she would find there. Set a goal for when he can go back, and then start small. Have her go a few hours per day, with a plan for what to do when she gets anxious.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nYour child can do it, with support. In fact, no matter how much he pushes against you, he really longs to do the scary thing. All children long to be independent. To feel brave and confident. In fact, research says that the more courage needed for the task, the more confidence they derive from that task. Let’s help kids find their way to more of both confidence and courage.\n\nLet’s stop rescuing them and inadvertently communicating to them that rescuing is what they need. They are braver and stronger and smarter than they have any idea. And you are the primary person in their life to help them not only learn but experience that truth.", "description": "How’s your child doing with school at this point?", "authors": ["Sissy Goff"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/istock_classroom.jpg", "published_at": "2019-09-08"}