{"pub": "abcnews", "url": "https://abcnews.go.com/US/police-release-video-indiana-hit-run-killed-young/story?id=66599116", "downloaded_at": "2019-10-29 08:03:46.182536+00:00", "title": "Police release video in Indiana hit-and-run that killed young Notre Dame grad", "language": "en", "text": "Police in Indiana have released surveillance video in an effort to identify those responsible for a fatal hit-and-run crash that claimed the life of a 27-year-old woman.\n\nHannah Turgeon was visiting from Denver with her father on Oct. 13 when she was fatally stuck by a large SUV in South Bend, Indiana, just a few miles away from the University of Notre Dame where she attended a few years earlier, prosecutors told ABC News on Monday.\n\nOfficials with the St. Joseph County Prosecutor’s office said they obtained video showing the actual crash, which occurred as Turgeon crossed the street after leaving a nightclub, but decided against releasing it out of respect for Turgeon's family.\n\nThey did, however, release footage from the scene, showing the moments leading up to the crash. The office also identified a white SUV as a vehicle of interest. The vehicle has a distinct light bar along the rear bumper, according to the video.\n\nThe prosecutor's office said it has footage from as many as nine cameras surrounding the area.\n\nSTOCK PHOTO/Getty Images\n\nSt. Joseph County Prosecutor Ken Cotter said he believes as many as a dozen people were close by when the crash happened and asked for members of the public to come forward.\n\n\"We need your help,\" Cotter told reporters earlier this month, according to The Observer. \"So, if you know what had happened, if you were there -- frankly, if you’re the person who was involved, we’re asking you to come forward.\"\n\nTurgeon's family is offering a reward of up to $10,000 for information leading to prosecution.\n\nSTOCK PHOTO/Getty Images\n\nThe family said the young woman was in town for the Notre Dame vs. USC football game that weekend. It also created a memorial website called Forever Missed in her honor.\n\n\"A kind and loving individual, Hannah was loved by all who knew her. Hers was a young, happy life that was filled with friends and family, and with a bright future,\" the website said. \"Hannah always kept her family closest to her heart, always in touch. She connected with them frequently, whether flying home for family gatherings in southern California or joining in on family trips. Notre Dame football games were top of list, right up there with Hawaii.\"\n\nInvestigators said anyone with information should contact Michiana Crime Stoppers at 574-288-STOP or 800-342-STOP.", "description": "Officials with the St. Joseph County Prosecutor’s office said they also obtained video showing the actual crash.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/police-gty-er-191009_hpMain_16x9_992.jpg", "published_at": "2019-10-28"}