{"pub": "washingtonpost", "url": "https://washingtonpost.com/transportation/2019/09/24/father-jumped-front-train-holding-his-year-old-watch-commuters-pull-her-out-alive", "downloaded_at": "2019-09-24 13:42:44.991302+00:00", "title": "A father jumped in front of a train holding his 5-year-old. Commuters pulled her out alive.", "language": "en", "text": "All Pamela Ivy could think to do in the few seconds before the subway train hit was scream.\n\nA man had jumped onto the tracks of a New York City subway station. And he was holding a girl.\n\nIf the 5-year-old cried out in those moments before impact, Ivy says she did not hear it. The child was drowned out again as she crawled from under the train — hair a bit bloodied, knees a bit bruised, according to police, wearing a blue vest and pink backpack — amid the cries of a rush-hour crowd of commuters reeling at a father’s suicide and stunned by his daughter’s survival.\n\n“Oh, my God,” one woman says, her voice breaking, in a moment caught on video.\n\n“Little by little, my love, little by little,” she yells out.\n\nA man who jumped down onto the tracks hoists the girl up onto the platform. That’s when someone took the child away, Ivy said. They didn’t want her to see her father’s body.\n\nThe man, a 45-year-old Bronx resident named Fernando Balbuena-Flores, died on the scene Monday morning, according to New York police. But the girl, who has not been named, went to a Bronx medical center with only minor injuries and was released to her mother in stable condition.\n\nThat evening, Ivy was still wondering at the miracle that emerged from tragedy. Ivy felt sure that both father and daughter were dead. She’d seen the wheels of the southbound No. 4 train — already slowing to a stop, she said — roll over Balbuena-Flores’s head. People beside Ivy wailed and covered their faces.\n\nBut the girl apparently fit beneath the wheels, she said.\n\nIvy was also wondering at the moments that led up to the death. She told The Washington Post that she heard Balbuena-Flores speak on the phone just before he jumped, having what sounded like a normal conversation between husband and wife. He said he was taking his daughter to school, she recalled. She remembers a mention of other children and the words, “I love you.”\n\nPolice said it’s not yet clear why the man jumped. New York police Sgt. Lee Jones confirmed that Balbuena-Flores made a phone call shortly before his death but said the details of the call are not yet clear.\n\nAn assistant superintendent of the Bronx building Balbuena-Flores lived in, Anthony Woods, remembered a father who took his daughter to the park three times a day. “Wherever he goes, she goes,” he told the New York Times.\n\nThe operator of the train is being treated for trauma, the Times reported, citing transit union representatives.\n\nIt was a “traumatic event for everyone involved,” Metropolitan Transportation Authority spokesman Shams Tarek said in a statement.\n\nAs the horror unfolded at about 8 a.m., some sprang into action.\n\nAntonio Love, 32, told the Times he ran to help when he heard screaming. Video shows Love crouching down on the tracks with another man to grab the girl as she emerges from under the train.\n\nLove told the Times that the girl, crying, said only, “Papa, my papa.” Speaking later at St. Barnabas Hospital in the Bronx — where the two good Samaritans went with minor injuries, according to the New York Fire Department — Love questioned many onlookers’ decisions that morning to whip out cellphones rather than pitch in.\n\n“It was just panicking,” he said. “Like, regular New Yorkers, pulling out their phones. Really?”\n\nSomeone stole his bag as he helped the girl to safety, he said.\n\nIt wasn’t the first time a parent has jumped onto the New York subway tracks with a child — nor the first time someone has emerged relatively unscathed. Last June, a mother and her 2-month-old son survived the woman’s leap in front of a train at another Bronx station.\n\nA witness of that incident told the New York Post that the pair survived because the train, already slowing, rolled entirely above them.\n\n“She was lying in the middle of the track bed clutching the baby in her arms,” a transit worker told the New York Post. “You knew they were alive because you could hear the baby crying. There was nothing to clean up. No blood, nothing.”\n\nTrain collisions with people on subway tracks or platforms have been increasing in recent years, according to data from the MTA. They went up from 168 in 2016 to 189 last year. There were more than 100 collisions this year as of mid-July.\n\nDeaths from the incidents have risen, too, from 48 three years ago to 68 in 2018. Thirty-two people died after contact with a train in 2019 as of July 22, the MTA says.\n\nRead more:\n\nThis back-to-school PSA from Sandy Hook Promise is a punch in the gut\n\nShe left a can of dry shampoo in her car. It blasted a hole through the roof.\n\nMetro Red Line crash was pivotal event for agency and other U.S. subway systems", "description": "The man, a 45-year-old Bronx resident, died on the scene Monday morning, according to police. But the girl went to a Bronx medical center with only minor injuries.", "authors": ["Hannah Knowles", "General Assignment Reporter", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/bkgXxkRloKAnRDTN2HB_jwtmEPg=/1484x0/d1i4t8bqe7zgj6.cloudfront.net/09-23-2019/t_e6ddf1df06bc4b62b4b2154f3fa365d5_name_bronxsubwayrescuegrab.jpg", "published_at": "2019-09-24"}