{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7626953/Teens-family-says-complained-bullying-death.html", "downloaded_at": "2019-10-30 00:14:17.346824+00:00", "title": "Teen's family says he complained of bullying before death", "language": "en", "text": "A 13-year-old boy who was killed by a single punch at school told administrators he was being bullied just days before his death, his family has claimed.\n\nJuana and Felipe Salcedo, the aunt and uncle of Diego Stolz, who raised the boy after his parents died, filed a legal claim against the Moreno Valley Unified School District Tuesday, the Los Angeles Times reports.\n\nThe claim, which lists damages of $100million, said Stolz and an adult cousin met with a Landmark Middle School assistant principal in September after he was targeted by bullies and punched at the school, 65 miles east of Los Angeles.\n\nTwo teenage boys have been charged in relation to the death of a Landmark Middle School student named Diego Stolz (pictured). The 13-year-old was sucker-punched during the attack on September 16. He died in hospital on Thursday\n\nCellphone video of the harrowing fight at Landmark Middle School was published on the internet, and shows two students - believed to be those who have been charged- viciously attacking Diego\n\nAssistant principal, Kamilah O’Connor, assured him that the bullies would be suspended for three days, starting Monday, the Los Angeles Times said.\n\nBut when Stolz returned to school after the weekend, the alleged tormentors confronted and punched him, knocking him to the ground, according to the claim.\n\nStolz was placed on life support but tragically died nine days later.\n\nA middle school brawl in September that led to the death of a 13-year-old boy from California and the boy's aunt and uncle is holding the school responsible\n\nLandmark Middle School in Moreno Valley, California where a boy was killed after getting bullied. The aunt and uncle of the 13-year-old who was killed in the brutal assault seek $100million in damages\n\n'They're devastated,' said David Ring, the couple's attorney. 'It was totally preventable, and they're really having a difficult time coming to grasp that.'\n\nRing said the bullying began when Stolz was in seventh grade. He said that classmates stole his shoes and other articles of clothing, the Los Angeles Times reported.\n\nThe bullying resumed at the start of this school year, the lawsuit claims it fell on deaf ears of the administrators.\n\n'Essentially, the assistant principal, she blew it off,' Ring told the Los Angeles Times. 'She made a promise she didn’t keep, and it cost this kid his life.'\n\nAnahi Velasco, a Moreno Valley Unified spokeswoman, said the district doesn't believe it is liable for Stolz's death. She declined to comment on the pending litigation or release details about the case.\n\n'To be clear, there is no place for bullying in our schools and acts of violence will not be tolerated,' she said.\n\nTwo boys have been charged with manslaughter in connection with Stolz's death. They have denied the allegations and are due to appear in juvenile court on Friday.\n\nCellphone video of the harrowing fight at Landmark Middle School was published on the internet, and shows two students - believed to be those who have been charged - viciously attacking Diego.\n\nThe school administrators said the two students arrested were honors students, where behavioral problems like bullying are not permitted.\n\nEarlier this month, two girls were arrested at another school in the district after allegedly assaulting another student during lunch.\n\nStolz's family plans to donate his organs 'to transform this tragedy into the gift of life for another child.'", "description": "Diego Stolz, 13, died after being hit with a single punch at Landmark Middle School in Moreno Valley, California. Two boys have been charged with manslaughter in connection with his death.", "authors": ["Associated Press", "Jerry Barmash For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/20/20345214-0-image-a-13_1572381171359.jpg", "published_at": "2019-10-29"}