{"pub": "cbc", "url": "https://cbc.ca/news/new-canadian-cardinal-seen-as-key-to-pope-francis-s-reform-vision-1.5307743", "downloaded_at": "2019-10-04 09:17:41.585395+00:00", "title": "New Canadian cardinal seen as key to Pope Francis's reform 'vision' | CBC News", "language": "en", "text": "Among the 13 Catholic cardinals Pope Francis will create this Saturday at St. Peter's Square is a Canadian few expected would become a \"prince of the church.\"\n\nYet his elevation to the high-ranking all-male group is also a resounding confirmation of the direction the pope is steering the Catholic Church in.\n\nMichael Czerny, a rare Jesuit nomination to the role of cardinal, said he was as surprised as anyone when he got word one morning last month from an Indian Jesuit friend who called him during a trip to Brazil.\n\n\"He told me the news,\" said the 73-year-old Czerny, \"and told me to keep calm.\"\n\nKeeping calm, say friends, is a defining trait for Czerny, whose reputation for hard work has earned him the nickname \"the Beaver\" among his fellow Jesuits.\n\n\"Michael is thoughtful, hospitable, has a great sense of humour, is intense and very, very committed,\" said Canadian Jesuit priest Peter Bisson.\n\nA Czech-born, Montreal-raised social justice advocate, Czerny is the only soon-to-be-cardinal who was a simple priest and not already a bishop.\n\n\"Those of us who work in social justice are not supposed to be on the track to become cardinals,\" said Peter Hanson, a Canadian Redemptorist priest and longtime friend who was shocked and delighted that Czerny will become Canada's fourth cardinal.\n\n\"We work, as Francis would say, on the margins. We have the smell of the sheep on us. We're the field hospital. And those kinds of positions don't usually have cardinals.\"\n\nPromoting justice\n\nAs founder of the Jesuit Centre for Social Faith and Justice in Toronto in 1979, Czerny was influenced by Liberation Theology, leading a wide network of Canadian church groups and social activists in promoting justice for the poor and marginalized and refugees during the revolutions in Central America.\n\nIn 1989, when the Salvadoran army murdered six Jesuits, a housekeeper and her daughter at the José Simeón Cañas Central American University, Czerny left Canada and moved to El Salvador despite the risk.\n\nThe Jesuits had been trying to broker a peace treaty between the warring government and guerrillas, and considered the priests to be subversives for their support of people most affected by the conflict.\n\nWhile in El Salvador, Czerny directed the university's Human Rights Institute and prepared the case against those who carried out the massacre, while also supporting negotiations that led to the 1991 peace agreement.\n\nCzerny has long had an interest in the plight of refugees. (Submitted by Michael Czerny)\n\n\"I felt that somehow, mysteriously, the Jesuits who died achieved in their death what they didn't achieve in their lifetime,\" Czerny said of that period.\n\nCzerny went on to head the Jesuit response to the HIV and AIDS crisis in Africa, publicly toeing the church line that condoms should not be part of the prevention of the disease's spread in Africa.\n\nHelped write encyclical\n\nMore recently, he's worked alongside Ghanaian Cardinal Peter Turkson, advising the pope on the environment and, say Vatican insiders, taking a lead in writing Laudato Si, the pope's major 2015 encyclical calling for an urgent global response to climate change.\n\nDespite the document's hard-hitting political analysis and focus on global inequality, Czerny said he's a firm believer that small, everyday initiatives will save the planet.\n\n\"We're not going to solve the environmental and climate crisis on the large scale. We're going to solve it over and over again where ordinary people live and work,\" he said. \"So I'm not at all discouraged when I hear about small steps. That's what gives me hope. I recognize that large-scale efforts seem to be frustrated, but I don't think that's the main story.\"\n\nFor the past several years, Czerny has headed the Vatican section of refugees and immigrants, a group he identifies with.\n\n\"One of the happy consequences of being a migrant and growing up in Canada is that you grow up in a multilingual, multicultural family [and] you learn a kind of flexibility and sympathy,\" he said.\n\nFriends say that in his role as an advocate for migrants, Czerny has become increasingly close to the pope.\n\n\"When Francis took a special interest in refugees and immigrants, he made Michael his goal person,\" said Hanson.\n\nFrancis's mission\n\nHanson said that in the early years of his priesthood, Czerny, who has a PhD in interdisciplinary studies at the University of Chicago, was weak on theology. But Hanson said he has since articulated a theological approach to respond to people's needs, rather than impose doctrine from above.\n\nOne of Czerny's friends said that \"the choice of Michael Czerny as cardinal is more about Pope Francis than Czerny.\" (Fabio Frustaci/EPA-EFE)\n\n\"If you want to know who Mike Czerny is right now, he's Pope Francis,\" said Hanson. \"Pope Francis hasn't changed a thing about dogma [Catholic rules]. But he's changed everything pastorally [spiritual guidance]. Mike is not an ideologue, but someone who has built his approach to social justice by listening to the poor.\"\n\nJesuit Peter Bisson describes Czerny as a theologically grounded progressive who is open to discussion about controversial issues such as ordaining women and LGBT inclusion in the church, but who will not stray from the church's official stance on issues.\n\nWhen asked whether he supports female ordination, Czerny at first bristled at the question. Later, he said he would not be comfortable articulating the goal now, but is open to \"getting the listening started. [The question] shouldn't be off the table.\"\n\nThat openness to at least listening in a church that for years shut down frank discussion and dissent in its synods (or bishop gatherings) is a key component in the profound shift occurring in the Catholic Church under Francis, observers say.\n\nThe shift away from enforcing doctrine is the reason for ongoing attacks from traditionalist factions within the church, who are gathering in Rome this weekend for protests against the latest synod on the Amazon rainforest. Czerny will write the final paper, which may discuss the possibility of ordaining married men.\n\n\"When a pope makes cardinals, especially in this pontificat, he's looking for men who will embrace his vision for reform and missionary impulse, reaching outwards,\" said Vatican expert Robert Mickens. \"In selecting Michael Czerny and the others, it's his way of ensuring this vision.\"\n\nAs cardinal, Czerny has now been officially enlisted in Francis's mission.\n\nAs Hanson put it, \"The choice of Michael Czerny as cardinal is more about Pope Francis than Czerny.\"", "description": "On Saturday, Pope Francis will name Montreal native Michael Czerny as a new cardinal. Czerny's friends say he is socially progressive and can help Francis institute his reform agenda.", "authors": ["Rome Correspondent", "Rome Correspondent Megan Williams Has Covered Everything Italian Politics", "Migration To The Vatican", "The Venice Biennale For Almost Two Decades. Her Award-Winning Documentaries Can Be Heard On Ideas", "The Current", "Other Cbc Shows. Megan Is A Regular Guest Host Of As It Happens", "The Current."], "top_image": "https://i.cbc.ca/1.5307946.1570135145!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/michael-czerny.jpg", "published_at": "2019-10-04"}