{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7631045/Bikini-clad-Stacey-Solomon-goes-swimming-SHARKS-idyllic-Maldives-getaway.html", "downloaded_at": "2019-10-30 23:28:48.285116+00:00", "title": "Bikini-clad Stacey Solomon goes swimming with SHARKS during idyllic Maldives getaway", "language": "en", "text": "She won praise for her candid social media post one day before.\n\nAnd Stacey Solomon, 30, is continuing to give insight into her luxury getaway to the Maldives with her children Zachary, 11, Leighton, seven, and Rex, five months, as she once again took to Instagram to share snaps from the trip.\n\nAfter sharing a candid snap of her 'real body', she took to the photosharing site again to reveal where she was lucky enough to go swimming with the sharks where they came in incredibly close proximity and also chill out with her boys.\n\nHappy days: Stacey Solomon, 30, is continuing to enjoy her luxury getaway to the Maldives with her children Zachary, 11, Leighton, 7, and Rex, 5 months\n\nStacey appeared to be having the time of her life as she cosied up to her boys - starting the day by chilling with her youngest before heading to see the sharks.\n\nShe donned a stylish bikini throughout the day and wore her hair in bunches for maximum practicality for the fun in the sun.\n\nPosting a snap of herself with her youngest son Rex as she reclined on the beach, Stacey was praised by her followers for being 'so real' and a good role model.\n\nOne user wrote: 'Amazing. You look so beautiful and so real' while another said: 'Beautiful and inspirational'.\n\nFeeling fishy: After sharing a candid snap of her 'real body', she took to Instagram again to give a dazzling insight into the stunning trip - where she was lucky enough to go swimming with the sharks\n\nHaving a laugh: She cuddled Leighton later in the day while they gave details of the trip\n\nAnother follower wrote: 'You seriously are an amazing example to young mums or any mums for that matter. Beautiful girl with a beautiful life.'\n\nAlongside the photo, Stacey wrote: 'I’m determined to get a picture of all of us while we are here but for now it’s just me, Rexy and Leighton's butt. The boys are having far too much fun for pictures.\n\n'Feeling so lucky to spend precious time in, what I can only describe as paradise, with them making memories.'\n\nHoliday: Posting a snap of herself with her youngest son Rex as she reclined on the beach, Stacey was praised by her followers for being 'so real' and a good role model\n\nAbroad: Another follower wrote: 'You seriously are an amazing example to young mums or any mums for that matter. Beautiful girl with a beautiful life'\n\nThe Loose Women star revealed her partner Joe Swash would be joining them on the trip soon, writing: 'Hurry up and get here Joe Joe we miss you.'\n\nAs the group arrived on the Asian island, the mother-of-three kissed her son Rex - who she shares with Joe - as she revealed he slept through the night.\n\nThe media personality penned alongside the picture: 'He slept all night. I honestly pooped myself when I tapped my phone and it said 8am! I don't mind if it's a fluke because of jet lag, I'll take it... so b****y grateful right now'.\n\nReaction: Posting a snap of herself with her youngest son Rex as she reclined on the beach, Stacey was praised by her followers for being 'so real' and a good role model\n\nStacey's getaway comes after she admitted her parents were left 'disappointed' when they found out she was pregnant at 17.\n\nThe TV star delved into her past struggles on Loose Women earlier this month, where she revealed her 'upset' parents gave her no input on whether she should keep the baby or not.\n\nConfessing she felt sick upon learning she was pregnant with her son Zachary, the musician explained she was left in 'absolute turmoil' because all she wanted was for her 'mum and dad to tell her what to do.'\n\nStacey wrote: 'Feeling so lucky to spend precious time in, what I can only describe as paradise, with them making memories'\n\nFun in the sun: Stacey has been having the time of her life on the trip with her children\n\nHoliday: The Loose Women star revealed her partner Joe Swash would be joining them on the trip soon, writing: 'Hurry up and get here Joe Joe we miss you'\n\nStacey - who recalled her pregnancy struggle during a segment called Life Before Loose - revealed she found out she was pregnant while she was still in college.\n\nThe presenter explained: 'I remember being in a cafe and sitting with my dad and my step mum and I was literally gagging.\n\n'I didn't think anything of it, I just thought someone must have had extra strong onions somewhere.\n\n'When we got home that night my step mum took me upstairs and handed me a pregnancy test. The thought that my parents knew I'd had sex made me die!\n\nMemories: Stacey said it has been difficult to take many photos on the trip as 'the boys are having far too much fun for pictures'\n\n'I always remember my parents wouldn't give me any input whatsoever. Even though they were really upset with me, and hurt and disappointed, they never told me whether I should go ahead and have the baby or not have the baby.\n\n'Which at the time was absolute turmoil because all I wanted was for my mum and dad to tell me what to do.\n\n'I just felt like I couldn't make such a big decision on my own, I really needed them. But looking back, in hindsight, it was the best thing they could have ever done because I made that decision on my own and I took responsibility for it.'", "description": "After sharing a candid snap of her 'real body', she took to Instagram again to give a dazzling insight into the stunning trip", "authors": ["Ciara Farmer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/15/20383592-0-image-a-86_1572450467166.jpg", "published_at": "2019-10-30"}