{"pub": "metro", "url": "https://metro.co.uk/2019/10/18/jurgen-klopp-provides-mohamed-salah-alisson-injury-updates-ahead-man-utd-v-liverpool-10942068", "downloaded_at": "2019-10-19 11:19:34.181308+00:00", "title": "Jurgen Klopp provides Mo Salah and Alisson injury updates ahead of Man Utd v Liverpool", "language": "en", "text": "Mohamed Salah is expected to start for Liverpool against Manchester United (Picture: Getty)\n\nJurgen Klopp says Mohamed Salah and Alisson are ‘looking better’ as they race to regain their fitness ahead of Liverpool’s trip to Manchester United.\n\nThe Reds travel to Old Trafford on Sunday afternoon hoping to maintain their eight-point gap at the top of the Premier League and inflict more misery on struggling United.\n\nSalah hobbled off during Liverpool’s victory over Leicester City prior to the international break following a heavy tackle from Hamza Choudhury.\n\nAlisson is also in line for a start at Old Trafford (Picture: Getty)\n\nFirst-choice goalkeeper Alisson, meanwhile, has been out of action for over two months after injuring himself on the opening day of the season.\n\nBut both could still feature against Manchester United on Sunday, with Liverpool also boosted by the news Joel Matip has fully recovered from injury.\n\n‘Ali, Joel and Mo are looking better,’ Klopp said on Friday. ‘How good? We will have to see.\n\nAdvertisement\n\nAdvertisement\n\n‘There’s two more sessions to come, then we have to make decisions. Nothing is fixed yet.’\n\nLiverpool have won eight successive Premier League matches this season and will equal the record for the most consecutive league games won if they beat Manchester United.\n\nBut Klopp insists his team can still improve, adding: ‘Can we play better? Yes, of course.\n\nJurgen Klopp’s Liverpool travel to Old Trafford on Sunday (Picture: Getty)\n\n‘But first of all you have to play as well as you can in the moment. We haven’t relied on winning a game without performing as the boys have performed so far.\n\n‘It’s about making the next steps and you can’t do that during the summer when the boys aren’t there.\n\n‘We have to do it in the season, that’s what we are doing at the moment. The next challenge is a really good opponent in a really difficult situation.’", "description": "Jurgen Klopp says Mohamed Salah and Alisson are 'looking better' as they race to regain their fitness ahead of Liverpool's trip to Manchester United. The Reds travel to Old Trafford...", "authors": ["Metro Sport Reporter"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1175998779_1571400324.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-18"}