{"pub": "yahoo", "url": "https://sg.finance.yahoo.com/news/south-korea-start-samsung-heir-070027680.html", "downloaded_at": "2019-10-24 07:52:31.632707+00:00", "title": "South Korea to start Samsung heir Lee's bribery trial on Friday", "language": "en", "text": "By Heekyong Yang and Ju-min Park\n\nSEOUL (Reuters) - A bribery trial involving the heir of South Korea's Samsung Group will start on Friday after the country's top court ruled earlier this year that the case should be reviewed by a lower court, raising the possibility of a tougher sentence.\n\nThe Supreme Court overturned in August part of an appeals court bribery conviction against Samsung's de facto chief Jay Y. Lee, who had been given a two-and-a-half-year suspended sentence for seeking favor from South Korea's former president Park Geun-hye.\n\nThe court said the interpretation by the Seoul High Court on what constituted bribes by Samsung to Park was too narrow.\n\n\"The Seoul High Court is unlikely to make a decision within this year, because prosecutors and his lawyers are fighting harder in this round,\" said Jun Ji-hyun, a lawyer who is not involved in the case.\n\nLee, 51, is expected to attend Friday's hearing, which is required by law for defendants in criminal cases, according to legal experts.\n\nThe case against Lee centered on whether three horses donated by Samsung Group [SAGR.UL] should be considered bribes aimed at winning Park's favor in the conglomerate's succession planning. The horses were given to the daughter of Park's confidante, Choi Seo-won, a professional equestrian.\n\nThe Supreme Court said the appeals court erred in not recognizing the horses as bribes given by Samsung to win favors, raising the possibility of Lee returning to jail.\n\nLee, vice chairman of the group's crown jewel Samsung Electronics Co <005930.KS>, has already served one year of detention but walked free last year after the appellate court halved a lower court's five-year jail sentence and suspended it for three years.\n\nSamsung declined to comment officially.\n\n\"We hope to see the end of this uncertainty as soon as possible,\" said a company source who requested anonymity, referring to the legal procedures.\n\nThe trial comes as South Korea's President Moon Jae-in seeks help from big business leaders to resuscitate a fragile economy, which data showed on Thursday slowed more than expected in the third quarter.\n\nMoon thanked Lee for Samsung's commitment at a ceremony this month unveiling an $11 billion investment in display technologies.\n\nThe Supreme Court last week closed a separate bribery case involving Lotte Group Chairman Shin Dong-bin, allowing him to stay out of jail with a suspended jail sentence.\n\n\n\n\n\n(Reporting by Heekyong Yang and Ju-min Park; Editing by Miyoung Kim and Paul Tait)", "description": "A bribery trial involving the heir of South Korea's Samsung Group will start on Friday after the country's top court ruled earlier this year that the case should be reviewed by a lower court, raising the possibility of a tougher sentence.  The Supreme Court overturned in August part of an appeals", "authors": ["Heekyong Yang", "Ju-Min Park"], "top_image": "https://s.yimg.com/uu/api/res/1.2/TeMYKnYWaaXOO_VywoAQjg--~B/aD00ODU7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/e315d091ca4c4de9c38684b21ceea04b", "published_at": "2019-10-24"}