{"pub": "independent", "url": "https://independent.co.uk/life-style/gadgets-and-tech/news/iphone-11-pro-apple-release-date-a9099841.html", "downloaded_at": "2019-09-10 23:34:37.610121+00:00", "title": "iPhone 11 Pro: Release date, price and details released about new premium Apple handset", "language": "en", "text": "Apple has unveiled the iPhone 11 Pro, its first ever \"pro\" iPhone.\n\nThe new handset is the premium version of the iPhone 11, which Apple revealed just before. Just as with the cheaper model, the company focused primarily on the camera in its announcement.\n\nThe company said that its improved screen as well as new colours justify the \"pro\" moniker, which has only ever been used on bigger devices.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n\"This is the first phone that we've called pro,\" said Apple's Phil Schiller, as he unveiled the phone.\n\n\"For us that means it's the first device that pros can count on to get work done. But it's also a device for all of us who want the best product made, even if we're not a pro.\"\n\nThe iPhone 11 Pro costs $999 or $1,099 for the bigger \"Max\" version, the same price as the XS and XS Max they replace. Pre-orders will begin on Friday – at the slightly later hour of 5am pacific daylight time – and will all start shipping on 20 September.\n\nThe new phone comes in a number of colours, including a brand new green. And those finish are also matte, rather than the shiny gloss in previous versions.\n\nIt also includes three different lenses in the camera. As well as the normal one, and the zoom that arrived in recent iPhones, it also has an \"ultra-wide camera\" that can allow for images that take in twice as much as the previous phone.\n\nThe iPhone can take photos with all of those different cameras at once, Apple said, letting people choose either to zoom in or to use the new wider lens to take in the full detail. The three cameras are able to talk to each other, so that they are aligned ready for switching between the different lenses.\n\nIt also includes a feature called \"Deep Fusion\" which can use machine learning to take a variety of different photos at once and combine them into the best version of any photo. \"It is computational photography mad science,\" said Mr Schiller, \"it is way cool\".\n\nIt also includes new video recording features, as well as updated editing tools to allow them to be adjusted after the fact. The phone has the ability to record through two of the cameras at once, and switch between the two even as video is being recorded.\n\nInside the phone is Apple's brand new A13 Bionic chip. The company said that will be vastly quicker than all of the chips it has made before, but that it can also work less hard to preserve battery life.\n\nThe iPhone 11 Pro can last four hours longer than the iPhone XS that it replaces; the bigger Max version can last five hours longer than the XS Max, Apple said. It will also come with a new more powerful charger to allow it power up more quickly.\n\nApple said there was also a variety of new features it did not have time to discuss, including upgraded material that gives it the strongest glass in a smartphone.\n\nFollow the latest from the iPhone event below:\n\nPlease allow a moment for the live blog to load.", "description": "Apple has unveiled the iPhone 11 Pro, its first ever \"pro\" iPhone. The new handset is the premium version of the iPhone 11, which Apple revealed just before. Just as with the cheaper model, the company focused primarily on the camera in its announcement.", "authors": ["Andrew Griffin"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/10/19/iphone.jpg", "published_at": "2019-09-10"}