{"pub": "guardian", "url": "https://theguardian.com/stage/2019/sep/30/performance-artist-gisele-vienne-western-society-leaves-no-space-for-ecstasy-interview", "downloaded_at": "2019-09-30 06:36:43.229900+00:00", "title": "'Western society has little space for ecstasy': back to Berlin's 90s club scene", "language": "en", "text": "When Gisèle Vienne was growing up in Grenoble, France, her artist mother used to say, “paintings are cheaper than wallpaper”. So that’s exactly what they had, all over their walls. Vienne’s mum is Dorli Vienne-Pollak (a former student of Oskar Kokoschka), who made “pretty crazy, transgressive works” inspired by everything from 80s punks and strip clubs to fantasy battle scenes. It must have been quite an eyeful for a child.\n\nToday, Vienne’s Paris home is completely white. It’s a small rebellion against her upbringing, which, balanced with the influence of her “overeducated French intellectual” father, makes complete sense of the artist Vienne has become. Her works in puppetry, theatre and dance (including Jerk, Kindertotenlieder, The Ventriloquists Convention) make headlines for their macabre obsessions: sex, violence, fantasy, serial killers and freaky dolls. Bubbling under all that is a vibrant intellect. Vienne’s conversation down the phone from France bounces fizzily from early 20th-century sociology to transcendental meditation.\n\nVienne is not seeking darkness, she says, but stimulation. “I like to go to the edges, to question what the limits are and what we can accept. There’s something very exciting in going there. I often make this comparison to extreme sports – I think there is something ecstatic in going to the limits.” That sounds like thrill-seeking, but really it’s about unpicking complex questions of human behaviour.\n\nHer work is regularly performed in Europe and the US (she collaborates with the American novelist Dennis Cooper), but little seen in the UK, so it’s with some anticipation that her piece Crowd opens London’s Dance Umbrella festival this year. Crowd brings brightness, abandon, tenderness, humour and sensuality, along with hints of darkness and violence, and is based on Vienne’s own experiences of clubbing in Berlin in the early 90s.\n\nAs a teenager, she went to squat parties in often spectacular abandoned houses and buildings in east Berlin (where she was living) or to Tresor, the legendary club in the underground vault of a bombed-out department store. “They were really extraordinary places, and the people going there were very inspiring,” she says. “The whole scene was mesmerising, all this Detroit music culture that came in had a big impact on me.”\n\nShe was brought back to memories of those days when researching the iconic ballet The Rite of Spring, thinking about techno culture as a modern equivalent. “It’s very much like pagan celebrations,” she says. “It’s about ecstasy and losing control.”\n\nVienne brings up British philosopher Jules Evans’s book The Art of Losing Control, in which he talks of the necessity of ecstatic experience. “I would say liberal capitalist western societies don’t have so much space any more for ecstatic experience, which other societies in the world do, and always have,” she says. Violence, of the type that sometimes appears in Vienne’s work, “can also be part of this ecstatic experience”, she says. “Darkness and violence are not necessarily negative. It can be very invigorating, joyful and pleasurable expressing primal energies in a context that is respectful of each other and doesn’t disturb the balance of the community.” Like a boxing match, or a pumped-up dance floor.\n\nFacebook Twitter Pinterest Invigorating darkness ... Crowd. Photograph: Estelle Hanania\n\nIn Crowd, we watch the increasing messiness of a wild night out to a soundtrack of Jeff Mills, DJ Rolando and Global Communication. But more than just an expression of primal energies, the performance plays with the perception of time. It seems to compress and distort – something clubbers might recognise from their own nights out – thanks to cinematic choreographic effects: freeze frames, looping repeats and brilliantly realised slow motion.\n\n“If you see Crowd live, audiences have said they feel a little bit different afterwards than before they came into the theatre, a slightly altered way of being,” says Vienne. “I think there is this double feeling of being very sharp – because it has slowed down you can see detail in a sharper way than usual – and then a little bit of this stoned feeling.”\n\nIn history, much ecstatic experience was linked to religion; Vienne points out that art, too, was mostly bound to religion. Its position in modern secular society is often confused with entertainment, she thinks. “I think both are totally necessary,” she says. “Entertainment is crucial and art is crucial, but I just think the contract with the audience is different, you are looking for a different experience.”\n\nSo what does she want to provide with her own art? “I think it’s more on the level of spiritual experience,” says Vienne. “It’s questioning, it’s self-reflecting, it’s human-reflecting. It’s an experience of philosophy in a physical way,” she says. “Yes, I would put it that way: it’s physical philosophy.”", "description": "Feted for her macabre and freaky stage shows, Gisèle Vienne has created a time-bending piece of ‘physical philosophy’ inspired by her clubbing days", "authors": ["Lyndsey Winship"], "top_image": "https://i.guim.co.uk/img/media/d6bad73a9f09ca48e28940020da8c471dd24be2c/0_150_3215_1930/master/3215.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=defe08671fa2023ca5f95847bac72ab2", "published_at": "2019-09-30"}