{"pub": "metro", "url": "https://metro.co.uk/2019/10/14/harry-styles-left-scared-home-homeless-man-found-guilty-stalking-10917810", "downloaded_at": "2019-10-14 23:22:50.030773+00:00", "title": "Harry Styles 'scared in his own home' as stalker is found guilty", "language": "en", "text": "The situation turned more violent in May (Picture: Getty/Backgrid)\n\nA homeless man was found guilty of stalking Harry Styles and leaving him terrified in his own home.\n\nThe singer bought the man some food because he ‘felt sorry for him’, a court heard today, but the man then proceeded to stalk Harry for three months.\n\nPablo Tarazaga-Orero, 26, refused any money from the Lights Up singer when approached at the bus stop outside Harry’s £3 million home in London due to religious reasons.\n\nHarry opted for buying food from a vegan cafe – including sandwiches and salads – nearby but his simple good deed turned into a three-month torturous ordeal.\n\nThe former One Direction singer told the court: ‘He told me that he couldn’t accept the money for religious reasons.\n\n‘I asked him if he needed any food, he asked for some edamame beans. I stopped at a vegan cafe, I bought two sandwiches, two salads, two muffins all heated then took them to Pablo.\n\nAdvertisement\n\nAdvertisement\n\n‘I passed him the bag of food through the car window at which point he asked me if I wanted to go to a restaurant to eat with him. I told him I was on my way to work. I found it a little odd. His facial expression made me feel a little uneasy. It was like a smirk.\n\n‘Until that point, I never felt unsafe or uneasy in my own home.’\n\nThe singer even locked his bedroom door (Picture: Karwai Tang/Getty Images)\n\nThe Spanish-national ended up posting notes and money through his letterbox before following the singer on his runs and visits to the his local pub, The Spaniard’s Inn.\n\nPablo was found guilty of stalking and Harry was even complimented by the judge for stopping ‘out of the goodness of his heart’ and trying to help a man ‘down on his luck’.\n\nIt was said the defendant had camped at the bus stop outside Harry’s home because ‘he know that Mr Styles lived close by’ and at that point, Harry begun seeing the stalker every single day.\n\nThe situation didn’t escalate until May, when the homeless man lunged at Harry and attempted to grab him while he was jogging through Regent’s Park.\n\nThe Dunkirk actor went to the police in June after the defendant’s ‘frightening behaviour’ left him scared in his own house.\n\nWhat made the situation even more scary was the fact the star saw Pablo around five days a week and the man even believed he was ‘the soulmate of Harry Styles’ and was ‘spiritually protecting him’.\n\nPablo waited close to Harry’s home on purpose (Picture: Backgrid)\n\nHe even claimed that the star offered him money to have ‘fun’ in a hotel on their first meeting, which Harry denied happening.\n\nAdvertisement\n\nAdvertisement\n\nHarry continued: ‘I never really encountered this kind of behaviour before. I’ve employed a night guard. I continue to lock my bedroom door at night.’\n\nThe singer, who frequently saw Pablo in his pub, also added: ‘He would sit in my eye line. He tried to speak to me on the second occasion as I was leaving. He would just kind of watch and look over and wait for me to leave. I was very confused very very uncomfortable, very confused, I didn’t really understand it.’\n\nDistrict Judge Nigel Dean said: ‘It would be fair for me to say at this stage that I found Mr Styles to be a reliable and credible witness,’ and praised Harry for helping with the case as much as possible.\n\n‘Mr Styles felt sorry for a young man who he saw to be living without a home during the winter when it was cold and raining very heavily and having first noticed him he then out of goodness of his heart stopped and offered to fund the defendant’s hotel accommodation that evening.\n\nHe couldn’t even leave his house without seeing traces of Pablo (Picture: Lester Cohen/Getty Images for NARAS)\n\n‘These were honest, well intended, good intentions from somebody who was trying to help another for whom he felt sorry and who he thought was down on his luck.\n\nThe judge ended it with: ‘He knew perfectly well that what he was doing at that stage amounted to harassment of Mr Styles.\n\nAdvertisement\n\n‘I’m quite satisfied that this behaviour had the effect of harassing Mr Styles.’\n\nThe sentencing was adjourned at Hendon Magistrates court for reports and Pablo was released on conditional bail.\n\nMetro.co.uk have contacted reps for comment.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Harry Styles’ age and net worth as he returns with new Lights Up song and video\n\nMORE: Harry Styles reaches out to fan on World Mental Health day with supportive therapy message", "description": "Harry Styles bought food for a homeless man which resulted in him being stalked outside his own home in London for several months.", "authors": ["Zara Woodcock"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89872542_1571080558.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-14"}