{"pub": "rt", "url": "https://rt.com/news/470925-saudi-arabia-russia-anthem", "downloaded_at": "2019-10-14 23:29:54.507416+00:00", "title": "Sounds grate! Saudi military orchestra welcomes Putin with Russia’s anthem... or at least it tries to (VIDEOS)", "language": "en", "text": "President Vladimir Putin has been greeted in Saudi Arabia by a dodgy rendition of the Russian national anthem. The performance was far from stellar – but still merely mediocre, compared to some of the worst-ever anthem fails.\n\nThe unexpected ear-shattering performance of the country’s anthem awaited Russia’s president at the Saudi royal palace as he met King Salman on Monday. An entire military orchestra, accompanied by a sizeable honor guard detachment, performed for the two leaders right inside the palace – and their rendition of the Russian anthem turned out to be a bit off – to put it mildly.\n\nTo be fair, the anthem was somewhat recognizable – in the beginning, at least. It seems the Saudi royal orchestra has learned something from the utterly shameful version of the US national anthem it performed back in 2017 to greet US President Donald Trump.\n\nThat performance of the US anthem was arguably on a par with the notoriously disastrous renditions of national anthems repeatedly produced by an Egyptian military orchestra. Back in 2015, they slaughtered the Russian anthem, ‘spicing up’ Putin’s visit.\n\nAnd, in 2016, they ripped apart the Marseillaise, subjecting then-president of France Francois Hollande to a round of aural torture.\n\nEgyptian orchestra FAILS on French anthem,\n\n\n\nit’s literally a disaster#Egypt#Francehttps://t.co/ddBgSCwNQN — In the NOW (@IntheNow_tweet) April 19, 2016\n\nto RT newsletter to get stories the mainstream media won’t tell you.", "description": "President Vladimir Putin has been greeted in Saudi Arabia by a dodgy rendition of the Russian national anthem. The performance was far from stellar – but still merely mediocre, compared to some of the worst-ever anthem fails.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5da4bd6385f540320057c342.png", "published_at": "2019-10-14"}