{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/17/glazers-legacy-manchester-united-liverpool", "downloaded_at": "2019-10-18 01:10:47.586554+00:00", "title": "Debt £511m but dividends galore: the Glazers’ legacy at Manchester United | David Conn", "language": "en", "text": "John Henry’s FSG has put in a net £100m at Liverpool in nine years but at Manchester United the financial backdrop to their on-field struggles is very different\n\nThrough the long years when Sir Alex Ferguson’s Manchester United were amassing trophies and cash, and Liverpool were stagnating in a derelict neighbourhood, Anfield could only dream of today’s reversal of fortunes. Liverpool, rebuilt and rebooted since 2010 under their US investor owners, arrive on Sunday as European champions and Premier League leaders at an Old Trafford groaning under United’s US owners, who have plundered the club and bungled the Ferguson succession.\n\nLiverpool’s owners, John Henry’s Fenway Sports Group, did not fully understand what they were taking on when they bought a club so steeped in history and emotion, but they learned from their early missteps and gradually refurbished Anfield with expertise. United’s owners, the six siblings of the Glazer family, bought the club in their debt‑loading raid in 2005, enjoyed the fruits of Ferguson’s genius but are now on their fourth manager since his 2013 retirement with their former banker Ed Woodward in charge of the club.\n\nThe big difference between Manchester United and Liverpool? Leadership | Eni Aluko Read more\n\nThe contrasts are stark: a new main stand at Liverpool and Anfield Road redevelopment in the planning, while Old Trafford has leaked and lost its lustre. Liverpool made key changes in 2012 after the early £35m signing of Andy Carroll undermined the “moneyball” hype, and have since justified it with the analytics-informed recruitment of Jürgen Klopp, Mohamed Salah, Virgil van Dijk and the rest of a Champions League-winning squad.\n\nUnited say they have put together a modern football scouting and decision-making structure which informed the £145m in summer signings of Harry Maguire, Aaron Wan-Bissaka and Daniel James, although they do not have a head of recruitment like Liverpool’s Michael Edwards or a director of football, as Manchester City have in Txiki Begiristain. Liverpool carefully identified Klopp as their ideal manager, City waited four years for Pep Guardiola, while United – after the miseries of David Moyes, Louis van Gaal and late José Mourinho – look to have gambled on Ole Gunnar Solskjær being able to vault several steps on a managerial CV.\n\nFSG does not buy sports clubs as a philanthropist; it works to increase their financial value. But it has taken no money out of Liverpool in nine years, except a modest £10m repayment of £110m loaned for the building of the main stand. The Glazers’ takeover, designed by Woodward to load £540m borrowings on a debt-free club, has since cost more than £1bn in interest, fees, refinancing penalties and other dead money.\n\nThe Glazers have relocated Manchester United’s company registration from Sir Matt Busby Way in Old Trafford to the Cayman Islands tax haven, and floated on the New York Stock Exchange in 2012, and the club has paid a dividend, most of it to the Glazers, for the last four years. The latest, declared in the United 2018-19 accounts filed last month, was £23m, of which the five Glazer brothers and their sister Darcie Glazer Kassewitz shared approximately £18m.\n\nHenry and his FSG co-investors Tom Werner and Mike Gordon – who is credited with steering the revival since he took personal responsibility for Liverpool in 2012 – have never taken a salary from the club. All six Glazers are directors, and on the payroll. At United, the struggles to replace Ferguson and modernise the operations contrast with the clinical thought and detail applied to the Glazers’ financial engineering.\n\nWoodward, who worked on the United acquisition for the Glazers and their late father Malcolm while at the bank JP Morgan, came up with the £275m “payment in kind” hedge fund loans at an initial 14.25% interest, to bridge the gap with a £265m bank loan and £270m the family itself put in. When the debts were refinanced a year later, the hedge fund debts had escalated by £79.1m, which included a £13.2m charge for “early redemption”.\n\nDocuments in 2010 setting out another refinancing of debt, which had swollen to £700m, revealed the Glazers had, since 2006, been paid £10m in “management and administration fees” and Kassewitz and each of her five brothers had borrowed £1.66m, £10m in total, from the club.\n\nFacebook Twitter Pinterest Ed Woodward worked on the United acquisition for the Glazers and their late father Malcolm while at the bank JP Morgan. Photograph: Kieran McManus/BPI/Shutterstock\n\nWhen the Glazers decided to register United in the Cayman Islands and float them in 2012, they split the club into two sets of shares, A and B. They hold all the B shares, which are not listed on the stock exchange but do accrue dividend payments and have 10 times the voting rights of the A shares. Ultimately the Glazers’ route to a fabulously profitable sale is to convert the B shares into A, which are publicly traded and bought by investors such as the banks whose executives hold those awkward public investor calls with Woodward every quarter.\n\nUnited’s annual report notes that a company registered overseas does not have to follow the standard corporate governance standards of the New York stock exchange.\n\n“Accordingly, we follow certain corporate governance practices of our home country, the Cayman Islands,” the report states. “Specifically, we do not have a board of directors composed of a majority of independent directors, or a remuneration committee … composed entirely of independent directors.”\n\nThe purpose of independent, or non-executive, directors is to apply objective scrutiny of how a company is being run and hold its executives to account. United’s board includes Woodward, Richard Arnold, the well-regarded group managing director, the chief financial officer Cliff Baty, three independents, Kassewitz and all five of her brothers. Joel and Avi are acknowledged to be the only two of the Glazers involved in the day‑to‑day running of the club. They, with one of the independents, Robert Leitão of the bankers Rothschild, sit on the remuneration committee which decides the pay of the directors. The total paid to the board and executive management in 2018-19 was £10.7m, which the accounts do not break down individually. Woodward is paid by a subsidiary company, Manchester United Football Club Ltd; his salary in 2017-18, the most recently published, was £4.152m.\n\nThe Glazers have made more than £200m selling slices of their shareholdings to investors, and one day, surely, the persistent speculation about a sale will culminate in them cashing out, perhaps as suddenly as they bought United, largely unwelcomed, in 2005.\n\nThe Fiver: sign up and get our daily football email.\n\nDefenders of the ownership point to the reality that the debts and payments to the Glazers are not a looming burden any more, as they were in the early years when Ferguson’s fire carried them through. Under the Glazers and Woodward, United are a commercial behemoth, their latest multi‑sponsor record revenues £627m, although that will drop this season because of their absence from the Champions League. The debt remains vast, £511m, and costs £25m in interest, but United can wave that away, and the £23m dividends, without really feeling it. The club points to an average annual net spend on players of more than £100m over the past seven years, more than any other club except their Abu Dhabi-funded noisy neighbours.\n\nYet City’s Barcelona-modelled structures mean they have spent their money rather more effectively and, like Liverpool, have comprehensively eclipsed United. The signing of so many players for so little reward at United prompts questions rather than answers, about the culture at the club whose owners have taken such fortunes out since their hostile takeover 14 years ago.", "description": "John Henry’s FSG has put in a net £100m at Liverpool in nine years but at Manchester United the financial backdrop to their on-field struggles is very different", "authors": ["David Conn"], "top_image": "https://i.guim.co.uk/img/media/be666fa4a6ea26a3f5630c986796ba0859b56a9e/0_211_4500_2700/master/4500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0ebb0641524cbcc33f19a5a49842d12d", "published_at": "2019-10-17"}