{"pub": "americanconservative", "url": "https://theamericanconservative.com/articles/brexit-stirs-the-spirit-of-americas-revolutionary-war", "downloaded_at": "2019-10-08 02:15:48.314624+00:00", "title": "Brexit Stirs the Spirit of America’s Revolutionary War", "language": "en", "text": "While Brits aren’t yet storming Dover’s docks to push crates of French wine into the English Channel, I’m struck by how the Brexit melee has increasingly exhibited characteristics of America’s Revolutionary War.\n\nYou’ve got the pushback against an out-of-touch authority and elite, with George III replaced by Jean-Claude Juncker and the EU Parliament; a similarly great fissure between rebellious patriots and those remaining loyal to the ruling institution at the heart of the disagreement; and a quixotic bid to regain sovereignty at any cost, along with the cry of “no taxation without representation.”\n\nThere are also the economic ramifications. The pronouncements of Project Fear during the lead-up to the referendum, which threatened economic armageddon for the UK if it left Europe, are still coming thick and fast. There are warnings of medicines running out and of fresh fruit and vegetable delays (can we really not make do for a while with less rambunctious food salads and fewer Spanish tomatoes?). At the macro level, meanwhile, long faces are being pulled about the potential impact on GDP, with the Office for Budget Responsibility warning that a no deal Brexit would plunge the UK into a “full blown” recession.\n\nThe Revolution crushed America’s economy by sending all its working men to war and severing trade with Britain. Inflation soared as the value of the Continental dollar plummeted. Yet—and here’s another parallel with Brexit—people still supported it because they felt that independence and sovereignty were worth fighting for. So many of those arguing vociferously for Remain and spitting about economic fallout can’t seem to understand that the same applies now. GDP isn’t, and shouldn’t be, a winning hand—there is so much more to life than fiscal judiciousness. Hence it isn’t for a significant number of Brits who are fed up with how, in the mercantile climate of the age, we are all increasingly made to feel like our only value to society comes from our economic utility.\n\nAdvertisement\n\nMy take on GDP was influenced by living and working in Ethiopia between 2013 and 2017. During that time, Ethiopia was in the midst of a decade of annual GDP growth of around 10 percent, enough to make an economist’s toes curl, and making it one of the world’s fastest growing economies. But that 10 percent meant little if anything to millions of Ethiopians barely eking out an existence. Ask a taxi driver—ever the arbiter of a reality check on spin—in Addis Ababa what he thinks about Ethiopia’s economic numbers and how much he and his family have benefited from the country’s economic miracle. See what he says, I dare you, especially if he’s chewing khat leaves for their narcotic effect and hence a little wired and impassioned.\n\nYes, GDP is an important indicator of the general well-being and performance of an economy, which in turn has trickle-down fiscal consequences for all. But just as those distant American rebels were motivated by values that transcended what might have appeared sensible in the short term, ordinary people today are similarly stimulated. One crucial thing that I think many Remainers are missing is the fact that if there is one vital and noble characteristic that dominates the British psyche, amid all its flaws, it is fairness. Denying or delaying Brexit and the result of the referendum flies in the face of this principle. It’s why I’ve heard endless voices, ranging from ticked-off-sounding grandmothers interviewed on BBC Radio 4 to the nice smiley lady working the fish and chip truck near where I live, arguing that Brexit needs to happen now, whether there is a deal or not.\n\nBrits will take many things on the chin without complaint—and do so more readily than Americans, who are far quicker to speak out. But if you mess with the concept of fairness, you’ll be sure to hear about it, as happened when those living in the 13 colonies had finally had enough of a similar lack of accountability on the other side of the Atlantic.\n\nFairness as it relates to Brexit has been mentioned but only with some interesting interpretations applied. Some argue that the referendum result shouldn’t hold when so many people didn’t vote, or that it’s unfair to those who were too young to vote at the time but whose futures will be so affected by the consequences. Those are pertinent points, but they don’t factor into the question of fairness, nor should they change anything about the result. This is how democracies function: the decision is based on the votes of those who turn out on the day.\n\nI was one of those who didn’t vote, though I passionately backed Remain at the time. I was on a reporting trip to Somaliland, which resulted in a kerfuffle over switching my postal vote to a proxy vote, and so I missed the most important election of my lifetime. I was gutted—both with the result and with my not voting. I believe in voting, big time. I’ve fought in countries where people are dying, literally, to be given the vote. This might well be one reason why the Leave vote skewed toward older Brits, those who can remember when Britain actually had to fight and shed blood in World War II to keep its freedom. While Britain observes Remembrance Sunday each year to commemorate those who died in our wars, we don’t have anything like the Independence Day celebrations that keep Americans tethered to where their freedoms came from.\n\nThe above compounds, I would argue, the duty to vote that those of us lucky to live in places that enshrine such a privilege have. But I didn’t vote in Brexit, like many others, and it didn’t go the way I, and others, wanted it to—and that’s all there is to it. We must respect the result; we’d be sure to want it respected if it had gone our way. The contrast between how Britain—or one side of it—is reacting to the Brexit result and how it reacted to losing the Revolutionary War couldn’t be starker. It swiftly accepted the latter and remained relatively dignified in defeat and thereby able to work on forging meaningful ties with America—and here we are now, with the “special relationship,” a little bruised and battered, though still not down for the count, I’d say.\n\nAfter three years of continued debate, comprising the ultimate Monday morning quarterback review, I find myself more at ease with what transpired on the fateful day of the referendum—admittedly, I may have read a bit too much Roger Scruton and come under his spell—and siding with these latter-day patriots in the Brexit tussle. I don’t think I am alone in making such a shift. Increasing numbers of Brits, regardless of how they voted, are now saying that time is up and Brexit must happen, if for no other reason than that the basic democratic principle that underpins, well, everything, must be upheld.\n\nI think almost all Brits agree that Brexit will be hard, and will cause us short-term pain that could very well develop into something far more acute. But they are willing to tolerate that for a greater good—and that makes me rather proud of my fellow Brexiting Brits. I should add that I am not conversely ashamed of those who want to Remain: some of my best friends are Remainers. I understand the logic behind their arguments: I’ve held many of the same views over these past three years, and still do, really. We just happen to now differ over what we think needs to happen—and thank goodness we can disagree. It’s what needs to happen in a genuinely liberal society with that great gift of free speech. So let’s please keep on disagreeing, while talking about it sensibly: that’s how society should work, and it keeps things interesting and supple. (Though let’s also hope that in the Brexit aftermath, whichever side comes out on top doesn’t turn on the vanquished, as happened when the Patriots punished the Loyalists after the Revolutionary War was won.)\n\nThe upshot of all this is that, while an earlier visit in June to the UK left me feeling deflated about the state of my home country, this time I came away feeling rather impressed by the pluck and resolve of many I spoke with, and invigorated by the stand being made.\n\nIf the UK leaves the EU on October 31—probably unlikely given all the headwinds, but you never know—I might just need to drink a Samuel Adams beer. And I might also bring to mind a verse from Liberty’s Call, a popular song of the American Revolution, to mark the auspicious occasion: “Bear on your minds the noble deeds / Your ancestors achieved; / How many worthy Britons bled, / To have their children freed!”\n\nJames Jeffrey is a freelance journalist who splits his time between the Horn of Africa, the U.S., and the UK, and writes for various international media. Follow him on Twitter @jrfjeffrey.", "description": "", "authors": [], "top_image": "https://www.theamericanconservative.com/wp-content/uploads/2019/10/brexit-pro.jpg", "published_at": "2019-10-08"}