{"pub": "npr", "url": "https://npr.org/2019/09/06/757227933/you-get-swept-up-a-story-of-love-passion-and-vacuum-cleaners", "downloaded_at": "2019-09-06 12:09:40.967086+00:00", "title": "'You Get Swept Up': A Story Of Love, Passion — And Vacuum Cleaners", "language": "en", "text": "'You Get Swept Up': A Story Of Love, Passion — And Vacuum Cleaners\n\nEnlarge this image toggle caption Dupe Oyebolu/StoryCorps Dupe Oyebolu/StoryCorps\n\nTom Gasko loves vacuum cleaners. He not only repairs them, he has a collection of hundreds of vintage and modern models, which are on display in a museum and repair shop in Rolla, Mo.\n\nHis fascination with vacuums began young. As a toddler, with his mother's Rainbow cleaner. At 6, he began repairing his neighbors' broken vacuums.\n\n\"I learned to read from my mother's vacuum cleaner instruction book. That was the book I wanted her to read to me,\" Gasko tells his husband, Donnie Pedrola, at StoryCorps.\n\nWhen they first got together in 2013, Pedrola was a vacuum novice. But that part of Gasko has rubbed off on him, and now Pedrola takes pride in knowing Electroluxes and Hoovers from Dirt Devils and Kirbys on the tours he gives at the museum.\n\n\"The night you came over for our very first date, I think we probably talked for four or five hours about the different designs of vacuums,\" Gasko says. \"I would eventually start showing you the old ones that were in the garage. That's when you thought I was crazy.\"\n\n\"Definitely. I had never heard of anybody collecting vacuums before,\" Pedrola says. \"And a collection, to me, is 50-60, not 600-700.\"\n\nPedrola recognizes that Gasko's passion makes him special.\n\n\"My life is totally different now. I see things differently, I view people differently,\" Pedrola says. \"You get so excited about the simplest things.\"\n\n\"And you get swept up into it,\" Gasko says.\n\n\"The day that I pass, you know, after you cremate me, I want you to take my favorite vacuum — the Airway — and I want you to vacuum my ashes up into it,\" he tells Pedrola. \"I want to spend eternity in that Airway vacuum cleaner.\"\n\n\"OK,\" Pedrola says. \"Cause you know I love you.\"\n\n\"Well, and you never met anybody in your life like me,\" Gasko says.\n\nAudio produced for Morning Edition by Kelly Moffitt.\n\nStoryCorps is a national nonprofit that gives people the chance to interview friends and loved ones about their lives. These conversations are archived at the American Folklife Center at the Library of Congress, allowing participants to leave a legacy for future generations. Learn more, including how to interview someone in your life, at StoryCorps.org.", "description": "On their first date, Tom Gasko and his husband Donnie Pedrola talked for hours about vacuum designs. \"Most people aren't that passionate about something,\" Pedrola tells Gasko at StoryCorps.", "authors": ["Heidi Glenn", "Kelly Moffitt"], "top_image": "https://media.npr.org/assets/img/2019/09/04/gaskonpr_wide-900b5edad3eab9c02aa2ef92f59b95759c1690f3.jpg?s=1400", "published_at": "2019-09-06"}