{"pub": "businessinsider", "url": "https://businessinsider.com/woman-fundraising-page-money-spent-on-date-called-her-fat-2019-9", "downloaded_at": "2019-09-12 11:42:43.895446+00:00", "title": "A woman who was called 'fat' on a Tinder date has raised $1,100 through a GoFundMe page she set up to earn back the money she spent", "language": "en", "text": "A woman set up a fundraising page to earn back the £93 ($115) she spent on a date after the man in question called her \"fat.\"\n\nJade Savage, 28, travelled 41 miles from her home in Syston, Leicestershire, UK, to Peterborough, UK to meet the man, 27, but he told her she'd \"put on a bit of weight\" almost as soon as he saw her, The Daily Mail reports.\n\nIt wasn't the first date, and the pair had first met on Tinder, but mum-of-one Savage said it had only been about four weeks since they'd last seen each other.\n\nNeedless to say, the date lasted all of five minutes, and Savage called it the \"worst date\" of her life, according to the Mail.\n\nIn a bid to make light of the situation, Savage set up a GoFundMe page to earn back her travel costs. Donations have flooded in, and she's now raised £891 ($1,098) thanks to supportive strangers.\n\nJade Savage's fundraising page. GoFundMe\n\n\"Date called me fat and got offended when I told him he was rude and acting like a prick,\" Savage wrote in the description.\n\n\"So took me back to the train station 5 minutes later.\n\n\"He then offered to give me the £90 travel money back and blocked me when I said yeah.\n\n\"Just want to make my £90 travel money back so I can buy wine and sticks of lard.\"\n\nThe costs had added up after she missed the coach she'd intended to get from Leicester to Peterborough and had to get the train instead, The Sun reports.\n\nSavage spent:\n\n£15 on a taxi to Leicester\n\n£12 on the coach she missed\n\n£23 on a train to Peterborough\n\n£5 on a glass of wine while she waited for a train home\n\n£23 on a train back to Leicester\n\n£15 on a taxi home.\n\n\"I was chatting to him on the phone when I got to the train station, waiting for him to pick me up,\" care support worker Savage told The Sun.\n\n\"That's when he said, 'F--- me, you have put some weight on haven't you?' I was like, 'No, you can't say that.'\n\n\"It was clear he wanted to call the whole thing off but I still hoped we could have a nice time so we went to his car.\n\n\"But he said, 'I can say it, it's a fact. You have put weight on, so therefore I can joke about it.'\n\n\"I called him a prick but he then went berserk and said, 'You what, you think I'm a prick?' He drove me back to the station and told me I had put him in a bad mood and that I had to go home.\"\n\nRead more: A French Instagrammer says she was uninvited from a press trip because she posted a picture with a 'curvy' friend in lingerie\n\nIt was then that she said she set up the GoFundMe page over a glass of wine while waiting for her train home, The Sun reports.\n\n\"My mates were laughing with me, saying, 'You've paid £90 to go to Peterborough, be called fat, and then get sent home.' It was the worst and shortest date I've been on,\" she told the publication.\n\n\"I see the funny side and that's why I did the GoFundMe.\"\n\nBut Savage didn't imagine she'd receive quite so much support from the public.\n\n\"I can't believe how well it has been received. I'm overwhelmed,\" she told the Mail.\n\n\"I think my story has resonated with a lot of women. I've had loads of messages from women on the page saying 'I love it, this is brilliant.' I think it's the right attitude to have.\"\n\nMost comments on the page have been supportive.\n\n\"Urgh. Men are utter trash. You're beautiful!! Go spend this on wine!!!!!!\" wrote Bekki Guy.\n\n\"Somebody shouldn't be made to feel like that bloody shame on them take the money my love and get a nice date and a new dress,\" added Cameron Stracey.\n\n\"There are too many arseholes out there! Have a glass of wine on me and onwards and upwards!! You look lovely btw,\" said Ken McCulloch.\n\nRead more: A man resigned from his job by giving his boss a 'sorry for your loss' card, and people are loving it\n\nSavage won't name the man from the date, and says she has nothing to say to him, according to the Mail, but he has apparently apologized for the way he acted.\n\n\"I'm not going to drag anyone's name through the mud. It's fine now. I don't want people to think that I'm that person,\" she said.\n\nThe singleton is still deciding what she'll do with all the extra money she's raised, \"but rest assured the money will be put to good use,\" Savage said.\n\nInsider has reached out to Jade Savage for comment.\n\nRead more:\n\nA California teen didn't have a date for prom, so her grandfather stepped in — and their matching outfits have gone viral\n\nA comedian with 1.3 million followers posted her own nude photo to Twitter after blackmailers allegedly tried to extort her\n\nCouples are hiring this wedding photographer to capture the gritty, real, and unglamorous side of their special day", "description": "\"F--- me, you have put some weight on, haven't you?\" the man allegedly said to Jade Savage. It had only been four weeks since their previous date.", "authors": ["Rachel Hosie"], "top_image": "https://amp.businessinsider.com/images/5d7a24e8f4fc2437546a7a0f-1136-568.jpg", "published_at": "2019-09-12"}