{"pub": "yahoo", "url": "https://news.yahoo.com/pope-ending-synod-says-launch-175233045.html", "downloaded_at": "2019-10-27 04:47:54.553424+00:00", "title": "Pope, ending synod, says will re-launch study of women deacons", "language": "en", "text": "By Philip Pullella\n\nVATICAN CITY, Oct 26 (Reuters) - Pope Francis said on Saturday he would reconvene a commission to study the history of women deacons in the early centuries of the Catholic Church, responding to calls by women that they be allowed to take up the role today.\n\nFrancis made the announcement at the end of a three-week assembly of bishops from the Amazon, known as a synod, that discussed issues facing the vast region, such as the shortage of priests, environmental protection and an expanded role for women.\n\nOne of the topics discussed was the possibility of ordaining older married \"proven\" men to serve as priests in limited cases, but he did not mention that in his impromptu closing remarks.\n\nThat was expected to be part of a final document that was scheduled to be released later on Saturday.\n\nDeacons, like priests, are ordained ministers, and as in the priesthood, must be men in today's Church. They may not celebrate Mass, but they may preach, teach in the name of the Church, baptise and conduct wedding, wake and funeral services and even run a parish with the permission of a bishop.\n\nMany deacons in the Church today are married men.\n\n\"We still have not grasped the significance of women in the Church. Their role must go well beyond questions of function,\" Francis said.\n\nConservatives in the 1.3 billion-member Church are opposed to women deacons, saying the deaconate is linked with the priesthood, which is restricted to men.\n\nScholars have debated the precise role of women deacons in the early Church.\n\nSome say they ministered only to other women, such as at immersion rites at baptism and to inspect the bodies of women in cases where Christian men were accused of domestic violence and brought before Church tribunals.\n\nOthers scholars believe women deacons in the early Church were fully ordained and on a par with the male deacons at the time.\n\nA commission that handed its report to the pope this year was inconclusive.\n\nFrancis gave no details on when the new commission would start its work.\n\nThe Church did away with female deacons altogether in later centuries.\n\nFrancis and his predecessors have ruled out allowing women to become priests.\n\nBut advocates of women priests say a ruling that women in the early Church were ordained ministers might eventually make it easier for a future pope to study the possibility of women priests. (Reporting By Philip Pullella)", "description": "Pope Francis said on Saturday he would reconvene a commission  to study the history of women deacons in the early centuries of the Catholic Church, responding to calls by women that they be allowed to take up the role today.  Francis made the announcement at the end of a three-week assembly of bishops", "authors": ["Philip Pullella"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-26"}