{"pub": "fox", "url": "https://foxnews.com/science/california-earthquake-movement-garlock-fault-ridgecrest-sequence", "downloaded_at": "2019-10-18 08:03:29.440559+00:00", "title": "Major Southern California fault line eyed after study shows unprecedented movement", "language": "en", "text": "A major southern California fault capable of producing a magnitude 8 temblor started to move for the first time in 500 years following a series of earthquakes in the Mojave Desert over the summer, according to a new study published Thursday in the journal Science.\n\nCALIFORNIA LAUNCHES AMERICA'S FIRST STATEWIDE EARTHQUAKE EARLY WARNING SYSTEM\n\nThe study by geophysicists from the California Institute of Technology and NASA's Jet Propulsion Laboratory found that the Garlock Fault—which runs east to west for 185 miles from the San Andreas Fault to Death Valley—has slipped .8 inches since July. This is the first movement documented on the fault in the modern historical record.\n\n“This is surprising, because we’ve never seen the Garlock fault do anything. Here, all of a sudden, it changed its behavior,” Zachary Ross, assistant professor of geophysics at Caltech and lead author of the paper, told the Los Angeles Time. “We don’t know what it means.”\n\nSatellite images show the process called fault creep began after Southern California experienced its largest earthquake sequence in two decades beginning on July 4. A magnitude 6.4 foreshock rocked the Mojave Desert about 120 miles north of Los Angeles before a magnitude 7.1 mainshock hit the next day in addition to more than 100,000 aftershocks.\n\nThe earthquakes that hammered the desert town of Ridgecrest sent ruptures on a web of interconnected faults throughout the region, putting added strain on the Garlock Fault. Ross said about 20 previously unknown crisscrossing faults were involved, which adds evidence that major earthquakes can be caused by a more complex process, not solely by a rupture on a single major fault line.\n\nRoss developed automated computer analysis of seismometer data to detect the huge number of aftershocks with precise location information, Caltech and JPL said in a press release. Ross said the 6.4 quake simultaneously broke faults at right angles to each other, which he characterized as surprising.\n\n\"It's going to force people to think hard about how we quantify seismic hazard and whether our approach to defining faults needs to change,\" Ross said. \"We can't just assume that the largest faults dominate the seismic hazard if many smaller faults can link up to create these major quakes.\"\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nThe study’s findings were published the same day Gov. Gavin Newsom announced the launch of the nation’s first statewide Earthquake Early Warning System that will use ground sensors from across the state to detect earthquakes before humans can feel them.\n\nA ShakeAlert system has been under development by the U.S. Geological Survey and science institutions for years will now push alerts to cellphones through an app developed by the University of California, Berkeley, and the Wire Emergency Alert system.\n\nShakeAlert uses hundreds of seismic sensor stations to detect the start of an earthquake, calculate its location and strength and generate alerts that the app and WEA system send to phones in areas that are expected to have significant shaking. The intent is to provide seconds or tens of seconds in which people can protect themselves before shaking arrives at their location.\n\nThe Associated Press contributed to this report.", "description": "A major southern California fault capable of producing a magnitude 8 temblor started to move for the first time in 500 years following a series of earthquakes in the Mojave Desert over the summer, according to a new study published Thursday in the journal Science.", "authors": ["Danielle Wallace"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/AP19290766197373.jpg", "published_at": "2019-10-18"}