{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/2019/10/07/analysis-nfls-biggest-trend-in-2019-is-setting-trends/40276185", "downloaded_at": "2019-10-07 06:54:44.007111+00:00", "title": "Analysis: NFL's biggest trend in 2019 is setting trends", "language": "en", "text": "CLOSE\n\nThe NFL's biggest trend so far in 2019 is, well, setting trends.\n\nIn its 100th season, highlighted by all sorts of celebrations and honor what has become the nation's most popular sport, those trends tend to skew toward the negative side.\n\nBecause this is supposed to be an uplifting season, it's worthwhile to take note of some of the more pleasant developments before examining those that have marred the first five weeks of the schedule.\n\nFor example, the success of road teams is positive. Consider that the Packers, Seahawks, Ravens and Eagles have fallen at home. The Broncos are 0-2 with a Mile High migraine in Denver. Those are difficult places to play, yet away teams are 42-32-1, not counting Sunday's game in London, allegedly a home match for the Raiders.\n\nThe Chiefs, Patriots and Bills already are 3-0 as road teams.\n\nAs Bill Parcells frequently said while still coaching, \"If you go .500 on the road, you should make the playoffs.\"\n\nThis trend actually might have begun last January when both conference title games were won, albeit laden with controversy, by the visitors, the Rams at New Orleans, the Patriots at Kansas City.\n\nWatching some high-profile clubs and their stars soar early on is an upbeat trend. So are the comebacks into the spotlight of Teddy Bridgewater, J.J. Watt and Robert Quinn.\n\nBut it's far too easy to get inundated by the bad vibes created by damaging or unconstructive occurrences.\n\nIt can be argued that still the most mentioned name in pro football is someone out of the NFL, Antonio Brown. Not only did the star wide receiver embarrass himself in three cities by forcing his way out of Pittsburgh and Oakland, then getting cut by New England — a franchise that takes a chance on virtually everyone. Brown also joined the parade of standout players set in motion by Odell Beckham Jr., of players poisoning their relationships with a team to force a trade elsewhere. Jadeveon Clowney got his transfer out of Houston, Jalen Ramsey is playing that disturbing game now with the Jaguars.\n\nAlso disturbing is seeing so many empty seats in places such as Washington, Cincinnati and all three Florida NFL stadiums. It's only early October, and using weather as an excuse is lame and inaccurate. Try mediocre of worse teams, including one in Miami that might not beat the nearby Hurricanes, as the cause.\n\nMaybe one of the things turning off those fans — and this is valid — is the proliferation of yellow flags. So few games have any flow because of all the penalties, and it's a dangerous development.\n\nAn emphasis on penalizing holding early in September so disrupted games that it made baseball seem fast-paced in comparison. That emphasis appears to have dissipated, though there still are plenty of officials' flags flying for that violation.\n\nBlaming the lack of on-field work for regulars in the preseason was acceptable for a few weeks, but no longer.\n\nAnd what about the perception that on-field officials and the officiating office in New York won't overturn an interference call on replay review when a coach makes a challenge, as he is now allowed to do under a trial rule adjustment resulting from the egregious non-call in the NFC title game? Does the league — or, at the least those officials with whistles — actually despise the rule so much that, because interference is a judgment call, they simply won't allow a challenge to succeed?\n\nPerhaps the most worrisome trend in 2019 has been the epidemic of injuries to starting quarterbacks. While some previous No. 1 QBs have been benched for poor performances, consider that Drew Brees and Ben Roethlisberger — likely Hall of Famers — are on the sideline. So are Nick Foles, Cam Newton, Case Keenum, Mitchell Trubisky, and Sam Darnold, who should return from mononucleosis sometime this month.\n\nOn Sunday, Roethlisberger's backup, Mason Rudolph, took a terrifying hit that knocked him out cold and caused a concussion. The Jets also are down to their third-stringer after Trevor Siemian went down in Week 2 with a severe ankle injury.\n\nNot to leave a bad taste in fans' mouths about the NFL — whose ratings are up, amount of money gambled remains stratospheric, and whose fantasy football attractiveness is through the roof — consider that there's a tremendous battle for the No. 1 overall pick in next April's draft. Folks of the Bengals, Dolphins, Jets and Redskins are considering any win in that race tantamount to elimination from it.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Analysis: The NFL's biggest trend so far in 2019 is setting trends", "authors": ["Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/2634ed1ef03659f6154cf24732b421a26bdb8c1f/c=0-938-1998-2062/local/-/media/2019/10/07/USATODAY/usatsports/c93db2a6343648cba87499cde1afa725.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-07"}