{"pub": "thehill", "url": "https://thehill.com/polls/240917-hill-poll-voters-obama-romney-neck-and-neck-on-issues-of-character", "downloaded_at": "2019-10-05 13:41:13.471766+00:00", "title": "The Hill Poll: Voters say Romney, Obama equal on issues of character", "language": "en", "text": "Mitt Romney holds thin advantages over President Obama on leadership, personal values and honesty, according to a new poll for The Hill.\n\nThe poll, conducted for The Hill by Pulse Opinion Research, suggests voters see little difference between the candidates on character issues that Democrats have cited as key to Obama’s appeal.\n\nADVERTISEMENT\n\nIt found 48 percent of voters consider Romney the stronger leader, compared to 44 percent who favored Obama.\n\nSimilarly, 47 percent of likely voters also said Romney most shares their values while 44 percent picked Obama.\n\nWhen asked which candidate voters considered more honest and trustworthy, 46 percent said Romney and 44 percent said Obama — a result within the poll’s 3 percentage point margin of error.\n\nThe results may prompt new questions about the effectiveness of the Obama campaign’s effort to characterize Romney as a calculating former corporate executive who has little in common with ordinary voters.\n\nMore from The Hill:\n\n♦ Reid rejects GOP call for health repeal vote on cybersecurity bill\n\n♦ Reid: Nuclear official is a ‘first-class rat’\n\n♦ Livestock industry petitions EPA to waive ethanol mandate\n\n♦ Dems applaud as mandate on birth control begins\n\n♦ GOP senators declare 'Meat Monday' in slap to USDA\n\n♦ Romney says press focusing on overseas stumbles to aid Obama\n\n♦ McConnell: Obama hiding defense job cuts to aid reelection\n\n♦ Obama donates to his own campaign\n\n\n\nThe findings could also raise a red flag for Obama, who analysts say needs to maintain a strong personal connection with voters to balance off his chief political weakness — the economy.\n\n“I think in a very close election — which this one promises to be — those intangibles do make a difference and it could be a decisive difference for some people,” Cal Jillson, a political scientist at Southern Methodist University, told The Hill.\n\n“Even before Romney was the [de facto Republican] nominee, Obama’s character and personality always polled better than his policies and better than his performance,” Jillson said. “If he were being evaluated purely on performance, he would be in great difficulty.”\n\nThe poll found 93 percent of voters consider “policies and competence” more important than “likability” when choosing who to support for president.\n\nJillson said the result shows voters “care about” the candidates’ policies, but he believes “those personal characteristics actually [count] for far more than 3 percent in voter decision making.”\n\nObama has generally fared better than Romney throughout the campaign in polls assessing the candidates’ personal qualities.\n\nIn June, a USA Today/Gallup poll found 60 percent of voters considered Obama honest and trustworthy, compared to 50 percent for Romney. The Gallup survey also showed more people believed Obama shared their values (53 percent) than Romney (45 percent).\n\nObama’s biggest personal strength has been likability. Obama led Romney 81 percent to 64 percent in the Gallup survey.\n\nThe Hill poll’s questions and methodology were different than Gallup’s and can’t be compared directly. But Obama can ill afford to lose any lead he’s had over Romney on personal qualities and perceived leadership skills, Jillson said.\n\n“I think of this as a race where Obama has very small advantages that he will have to struggle to maintain,” he said.\n\n“If [Romney] were able to tighten up that personal connection [with voters] it would certainly do him good. I think a challenger for president needs to be seen as competent, as right on some policies, and a guy I want in my living room for the next four years.”\n\nWhile The Hill Poll found Romney matches Obama overall, it showed centrist voters — who may well decide the election — still favor the Democratic incumbent.\n\nForty-eight percent of centrist voters believe Obama is more honest and trustworthy, compared to 42 percent who cited Romney.\n\nFifty percent of centrists said Obama most shares their values while 36 percent said Romney. The poll also found 48 percent of centrists consider Obama the stronger leader, compared to 43 percent for Romney.\n\nThe Hill poll was conducted July 26 among 1,000 likely voters and has a 3 percentage point margin of error.\n\nClick here to view data from The Hill Poll.", "description": "Romney holds thin advantages over Obama on leadership, personal values and honesty, according to a new poll for The Hill.", "authors": [], "top_image": "https://thehill.com/sites/default/files/thehill_logo_200.jpg", "published_at": "2012-07-30"}