{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/tennis/serena-williams-faces-some-hard-truths-after-falling-short-again-in-a-grand-slam/2019/09/07/cbc22a4a-d1ae-11e9-87fa-8501a456c003_story.html", "downloaded_at": "2019-09-08 11:49:00.024587+00:00", "title": "Serena Williams faces some hard truths after falling short again in a Grand Slam", "language": "en", "text": "Serena Williams fought back from 5-1 down in the second set but still fell to Canadian Bianca Andreescu in Saturday’s U.S. Open final. (Adam Hunger/Associated Press)\n\nColumnist\n\nHer career was older, at 20 years, than the age of the opponent across the net. That wasn’t an excuse, it was just a fact, and possibly an explanation for why Serena Williams one more time fell a match short in a Grand Slam. She was just a little dull in the U.S. Open final, missing a vital something against the flatiron strokes of the fearless new ascendant, 19-year-old Bianca Andreescu.\n\nFor these past two decades, the most dominant shot in tennis has been the first serve of Williams, a 110-mph jolt that shortened matches and disheartened all comers. Sometimes she used it as a bludgeon and sometimes a crutch in winning 23 major titles. But it was not the biggest shot on the court Saturday at Arthur Ashe Stadium — that was the chain-flail forehand of Andreescu in a 6-3, 7-5 victory. Williams’s serve, disconcertingly, was not a weapon; it was a liability, an exasperating, net-slapping illustration that her 37-year-old body would not cooperate.\n\n“I believe I could have just been more Serena today,” Williams said. “I honestly don’t think Serena showed up.”\n\n[A Grand Slam win after childbirth could be mother of all accomplishments]\n\nWhat became apparent, even as Williams fought with guttural screams not to go down by 6-1 in the second set, was that her comeback after a difficult childbirth over the past two years has been harder and more complicated than anyone realized, including her. In four Grand Slam finals now, Williams has gone down in eight straight sets against a variety of elastic-limbed younger opponents, unable to summon a crucial measure of voltage. Take nothing away from Andreescu, who is 8-0 against the top 10 this season, but the final was patently Williams’s worst performance of the tournament. “I can play better. That’s the only solace I can take,” Williams said.\n\nA Grand Slam demands seven peak-condition matches over two weeks — and the U.S. Open demands something more. It requires dealing with flashing stage lights in a succession of late-night matches, and fending off the whine of jets, the jabber of baby moguls drinking their Grey Goose in the loges, and jeering of sirens, the constant ambient noise that leaches into the stadium and can wear out the nervous system.\n\nMaybe it was all just a little too draining. For whatever reason, Williams made just 44 percent of her first serves — an incurable deficit against an opponent with strokes of such magnitude. Every time Williams missed a first serve, she had a two-thirds chance of losing the point against Andreescu’s lacerating returns. It was baffling — Williams had barely dropped her serve all tournament — but Saturday every service game was a siege. Furthermore, she made 33 unforced errors. “It’s inexcusable for me to play at that level,” she said.\n\nWith a 2-year-old on her hip, tweaky knees, a spasming back, and a 38th birthday coming up in a matter of weeks, Williams must now examine what she has to do to be better physically in a Grand Slam final. If there was something encouraging to take from this Open, it was that before the final she had looked her sharpest in nearly two years. She has been frank about her struggle to manage training, traveling and chasing records while raising her toddler Olympia, the invisible undertow of mental and physical exhaustions of motherhood, and the split heart that all mothers have who love their work.\n\n“Being on the court is almost a little bit more relaxing than hanging out with a 2-year-old that’s dragging you everywhere,” she said this week.\n\nOther mothers have won Grand Slams, of course: Margaret Court, Evonne Goolagong, and Kim Clijsters. But none of them did it just weeks shy of their 38th birthday. All were age 31 or younger.\n\nAccording to Christopher Minson, professor of human physiology at the University of Oregon, and a noted researcher on athletes and aging, just some of the physical issues Williams has been dealing with would include: a decrease in her maximal ability to use oxygen, meaning her ability to perform at extreme heart rates, and a deterioration in strength and muscle function.\n\n“Around the age of 40 we start seeing real reductions in strength,” he says. “Fast twitch fibers tend to decrease in number and function, and that will affect things such as speed, getting to the ball, explosive power, and the quick stops and turns you have to make in tennis.”\n\nBut perhaps the biggest telltale slippage in an older athlete — and this would seem to be huge in winning a two-week Grand Slam — is their need for longer recovery periods to get back to full strength and full speed. Minson says, “In these large tourneys the longer each game goes the more she will be broken down and her ability to recover will suffer.” Over the multiple days and multiple matches of the last two weeks, he observed, “She has been really digging herself into a hole.”\n\nThe biggest factor in recovery for an athlete? The one thing a mother doesn’t have as much of anymore. “Sleep,” says Minson. “If you’re not sleeping well then you’re not going to recover. It’ll be a hurdle for everybody, but for an older athlete it’s all these little things that make it harder.”\n\nThe fact that Williams is still viable in Grand Slams is a marvel in and of itself. But that’s hardly satisfying for a player who is on the cusp of Court’s record of 24 Grand Slam titles, but who can’t seem to get her best self to show up in a final. “I’m like, so close, so close, so close,” she said, “yet so far away.”", "description": "At 37, the mother of a 2-year-old faces biological factors — in addition to young stars on the rise hungry for some of what she has already achieved.", "authors": ["Sally Jenkins", "Sports Columnist", "September At Pm", "Sally Jenkins Is A Sports Columnist For The Washington Post. She Began Her Second Stint At The Washington Post In After Spending The Previous Decade Working As A Book Author", "As A Magazine Writer."], "top_image": "https://www.washingtonpost.com/resizer/pgzNuBcym-sCJexjabWcHlnKjWY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2CFOJJGR2EI6TDA4PSHOPBNYKU.jpg", "published_at": "2019-09-07"}