{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-morrisons-results/britains-morrisons-sees-better-second-half-after-first-dip-in-sales-since-2016-idUKKCN1VX0HD", "downloaded_at": "2019-09-12 11:44:16.393494+00:00", "title": "Britain's Morrisons sees better second half after first dip in sales since 2016", "language": "en", "text": "LONDON (Reuters) - Morrisons (MRW.L), the smallest of Britain’s big four supermarket groups, forecast improved sales in the second half of the year despite the threat of a no-deal Brexit, after quarterly sales fell for the first time since 2016.\n\nShares in Morrisons, which trails market leader Tesco (TSCO.L), Sainsbury’s (SBRY.L) and Walmart’s (WMT.N) Asda in annual sales, were up 3.3% on the positive outlook. Its shares have fallen 25% over the past year.\n\nChief Executive David Potts told reporters Morrisons was well prepared for all Brexit scenarios and said recent talk of the firm as a takeover target was “pure speculation”.\n\nSome analysts have suggested Morrisons could be a candidate for a takeover by an overseas private equity firm, given the fall in its share price and the weakness of the pound making deals cheaper.\n\nThe company also said it is extending its partnership in Britain with online giant Amazon (AMZN.O) by signing a multi-year agreement rather than the current rolling contract.\n\n“We’ve agreed to work together across longer range important opportunities,” said Potts, without giving details.\n\nFor the six months to Aug. 4, the Bradford-based company reported a 5.3% rise in pretax profit before one-off items to 198 million pounds - ahead of analysts’ average forecast of 192 million pounds. Revenue rose 0.4% to 8.83 billion pounds.\n\nGroup like-for-like sales, excluding fuel and VAT sales tax, fell 1.9% in its second quarter, having increased 2.3% in the first quarter. Analysts had on average forecast a 2% fall.\n\nSecond quarter results faced a tough comparison with a year earlier, when sales were boosted by hot weather, a royal wedding and the soccer World Cup. The sales fall followed 14 straight quarters of growth.\n\nBATTERED CONSUMER CONFIDENCE\n\nWith just 49 days to go until Britain is due to leave the European Union, the country has yet to agree a withdrawal arrangement, raising the risk of a disorderly “no-deal” Brexit.\n\nUK consumer confidence continued to be weak but Morrisons’ data had not indicated consumers were stockpiling ahead of Brexit, said Potts.\n\n“The overhang of Brexit is still there where consumers are quite careful and quite savvy just now and their confidence in the economy and their own finances has taken a bit of a battering,” he said.\n\nThe British government’s plans in the event of a no-deal Brexit warn of severe disruption to cross-channel routes, affecting the supply of certain fresh foods.\n\nMorrisons has stockpiled ambient goods and packaging materials, shifted some supplies away from the main Calais-Dover route, and obtained Authorised Economic Operator status, which it hopes will speed-up border checks in the event of hold-ups.\n\nPotts said the group would also be able to leverage its British credentials - two thirds of what it sells is British, it is Britain’s No.2 producer of food, and is British farming’s biggest single supermarket customer.\n\nMorrisons will pay a special dividend of 2 pence a share, taking its total interim payout to 3.93 pence a share.", "description": "Morrisons , the smallest of Britain's big four supermarket groups, forecast improved sales in the second half of the year despite the threat of a no-deal Brexit, after quarterly sales fell for the first time since 2016.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-12"}