{"pub": "usatoday", "url": "https://usatoday.com/story/sports/ncaaf/2019/10/22/heisman-trophy-watch-joe-burrow-lsu-passes-jalen-hurts-oklahoma/4056048002", "downloaded_at": "2019-10-22 13:39:30.772243+00:00", "title": "Heisman Watch: LSU's Joe Burrow takes over lead from Oklahoma's Jalen Hurts", "language": "en", "text": "CLOSE USA TODAY Sports' Paul Myerberg breaks down the latest Amway Coaches Poll. USA TODAY\n\nThe college football season is half over, and the race for the sport’s top individual honor is far from decided.\n\nThere is a new leader this week in the USA TODAY Network Heisman survey as LSU quarterback Joe Burrow edged ahead of Oklahoma signal caller Jalen Hurts by a single point. Those two are quite close on the stat sheet as well, but there are enough huge games ahead in November for another challenger to gather momentum.\n\nIn our weekly survey of 21 official Heisman electors who work for USA TODAY Network properties, Burrow received 48 total points with nine first-place mentions. Hurts actually had one more No. 1 vote but three fewer seconds.\n\nLSU quarterback Joe Burrow prepares to throw a pass during the first half against Mississippi State. (Photo: Rogelio V. Solis, AP)\n\nHurts concluded the weekend in second place nationally in total offense, with an average of 397 yards a game, augmented by his 705 rushing yards. Burrow ranks just behind in third place nationally, putting up 368.3 yards a game. Burrow has 29 touchdown passes with two more on the ground, while Hurts has accounted for 20 scores by air and 10 more by land.\n\nJOB SECURITY: Does Malzahn’s huge buyout make him untouchable?\n\nRE-RANK: Ohio State stays No. 1, but Big Ten rivals tumble after losses\n\nWINNERS AND LOSERS: Highs and lows from Week 8 in college football\n\nAlabama quarterback Tua Tagovailoa has slipped to third place for now, and he’ll be sidelined for a game as he rehabilitates an ankle injury that cut short his most recent outing against Tennessee. But he was still listed first by two voters, and he could be back on top in a heartbeat if he’s able to return and perform well against LSU on Nov. 9.\n\nMeanwhile, Ohio State quarterback Justin Fields is starting to get more notice. He was named on five ballots this week and is now alone in fourth place. He has accounted for 30 touchdowns himself, eight of them via the run. His Ohio State teammate, defensive end Chase Young, again picked up a point this week as did Wisconsin running back Jonathan Taylor.", "description": "There's a new leader in the USA TODAY Network Heisman Trophy watch. Jalen Hurts of Oklahoma had been first since September. Joe Burrow of LSU now leads.", "authors": ["Eddie Timanus", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/21/USAT/77cb6c90-c99e-41cf-8ed0-273e395a0c88-AP_LSU_Mississippi_St_Football.JPG?crop=3225,1814,x0,y58&width=3200&height=1680&fit=bounds", "published_at": "2019-10-22"}