{"pub": "npr", "title": "Northern Ireland Police Arrest 2 Men In Shooting Death Of Journalist", "url": "https://npr.org/2019/04/20/715457050/northern-ireland-police-arrest-2-men-in-shooting-death-of-journalist", "language": "en", "published_at": "2019-04-20", "downloaded_at": "2019-09-02 07:20:08.492867+00:00", "text": "Northern Ireland Police Arrest 2 Men In Shooting Death Of Journalist\n\nEnlarge this image toggle caption Brian Lawless/AP Brian Lawless/AP\n\nPolice in Northern Ireland have arrested two men in connection with the shooting death of a 29-year-old journalist in Londonderry on Thursday night.\n\nAuthorities say they arrested an 18- and 19-year-old under the U.K.'s controversial Terrorism Act and took them to the Musgrave Serious Crime Suite, a police station in Belfast.\n\nCellphone video released by police shows journalist Lyra McKee taking photos with her phone shortly before she was shot, probably by a stray bullet, according to police. The shooting occurred during rioting in Derry's Creggan neighborhood, a stronghold for dissident groups such as the New Irish Republican Army and Saoradh, which aim to bring about a united Ireland. Police were in the neighborhood searching for weapons they suspected would be used in an attack over Easter weekend.\n\nSaoradh said in a statement on Friday that McKee's death was accidental and that the gunmen were defending their community against state-sponsored violence. It also suggested U.K. government-backed forces entered the neighborhood to grab headlines during U.S. House Speaker Nancy Pelosi's visit to the island, Joe Zefran reports for the NPR Newscast unit.\n\n\"A republican volunteer attempted to defend people from the PSNI/RUC,\" the group said, citing the acronyms of Northern Ireland's current and former police forces. \"Tragically a young journalist, Lyra McKee, was killed accidentally.\"\n\nAuthorities say the violence intensified when a gunman aimed at police who were searching the area. Assistant Chief Constable Mark Hamilton called the shooting \"a terrorist act,\" which was \"carried out by violent dissident republicans.\"\n\n\"The New IRA is a small group who reject the 1998 Good Friday Agreement that marked the Irish Republican Army's embrace of a political solution to the long-running violence known as 'The Troubles' that claimed more than 3,700 lives,\" according to The Associated Press.\n\nA leader for one of Northern Ireland's largest political parties, Sinn Féin, called McKee's death \"a human tragedy for her family.\"\n\n\"Those people who carried out this attack have attacked all of us,\" deputy leader Michelle O'Neill said. \"They've attacked the community. They've attacked the people of Derry. They've attacked the peace process, and they've attacked the Good Friday Agreement.\"\n\nMcKee was named Sky News' young journalist of the year in 2006, and Forbes magazine identified her as one of their 30 under 30 in media in Europe in 2016, the Washington Post reported. She is perhaps most remembered for her blog post, \"Letter to My 14-Year-Old Self,\" which chronicled her struggle growing up gay in Northern Ireland and the later acceptance she received from her family.", "description": "Authorities say they arrested an 18- and 19-year-old under the U.K.'s controversial Terrorism Act and took them to the Musgrave Serious Crime Suite, a police station in Belfast.", "authors": ["Samantha Raphelson"], "top_image": "https://media.npr.org/assets/img/2019/04/20/ap_19110415544119_wide-1d5af3d0a739f09c8fa6d686d504b90ff00f23de.jpg?s=1400"}