{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7576107/Jennifer-Lawrence-shares-passionate-kiss-fiance-Cooke-Maroney-head-separate-ways.html", "downloaded_at": "2019-10-15 16:33:33.531597+00:00", "title": "Jennifer Lawrence shares a passionate kiss with fiance Cooke Maroney as they count down to wedding", "language": "en", "text": "Jennifer Lawrence's wedding to Cooke Maroney is right around the corner.\n\nAnd the couple looked more in love than ever while out and about in NYC Monday.\n\nAfter spending the afternoon together, the actress and art collector couldn't bear to part, seen sharing a passionate kiss before going their separate ways.\n\nMiss you already: Jennifer Lawrence and Cooke Maroney shared a passionate kiss before parting ways in New York City on Monday\n\nCasual chic: J. Law was effortlessly chic in a chic crop top worn with a boxy blazer, high waisted jeans and textured boots which came up just passed her knees\n\nJ. Law was effortlessly chic in a chic crop top worn with a boxy blazer, high waisted jeans and textured boots which came up just passed her knees.\n\nShe slung a flowy camel colored coat over her arm in case of a chill while carrying her things in a Dior bag.\n\nContinuing her fuss-free look, she knotted her hair into a messy bun and topped everything off with a pair of sunglasses.\n\nCooke, meanwhile, was classic in a white tee shirt and black jeans combo.\n\nIn the bag: She slung a flowy camel colored coat over her arm in case of a chill while carrying her things in a Dior bag\n\nEasy-going guy: Cooke, meanwhile, was classic in a white tee shirt and black jeans combo\n\nIt seems their wedding could be any day now.\n\nAccording to Us Weekly the pair will be celebrating their nuptials this month.\n\nThey were previously spotted at the NYC marriage bureau in September.\n\n'Jennifer and Cooke were at the weddings bureau together on the morning of September 16,' an insider told the magazine. 'They had a female friend and a photographer with them the entire time. They sat in the couches to the left and were trying to remain unseen.'\n\nPartners: The couple looked like they were in their element together\n\nWedding bells: According to Us Weekly the couple are set to get married this month\n\nLawrence is understandably getting very excited to tie the knot with her art gallerist beau.\n\n'He's just the best person I've ever met in my whole life,' Lawrence said during an interview with Entertainment Tonight.\n\n'It was a very, very easy decision,' she said of their decision to wed.\n\nTaxi! After bidding her soon-to-be hubby goodbye, she hopped into a cab\n\nBack at the end of September, she shared her Amazon wedding registry with fans with a list of all things perfect for hosting, cooking, travel and more.\n\n'Planning a wedding is so exciting, but it can be overwhelming. For anyone else needing a little inspiration, I thought it would be fun to collaborate with Amazon to share a few of my favorite registry wish-list items. It's so easy, and you can find everything you need all in one place,' she said about her registry.\n\nThe two lovebirds got engaged at just under a year of dating after being introduced by mutual friends.\n\nThey are constantly spotted hand-in-hand while out on dates or strolling through the city.\n\nPrior to their relationship, the Joy star split from her ex Darren Aronofsky.\n\nDarren was the director of her movie mother! and they grew close while filming it, but later parted ways back in November 2017.", "description": "Jennifer Lawrence's wedding to Cooke Maroney is right around the corner.", "authors": ["Dailymail.Com Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/16/19749112-0-image-a-44_1571155167783.jpg", "published_at": "2019-10-15"}