{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7608733/Shailene-Woodley-shows-kooky-style-rocks-clashing-prints-Louis-Vuitton-event.html", "downloaded_at": "2019-10-24 16:12:47.044365+00:00", "title": "Shailene Woodley shows off her kooky style as she rocks clashing prints at Louis Vuitton event", "language": "en", "text": "She was recently pictured shooting a scene by the sea in Mallorca for her latest movie The Last Letter From Your Lover, based on the novel by Jojo Moyes.\n\nAnd following filming, Shailene Woodley jetted from the Balearic Islands to London to attend the Louis Vuitton reopening party at Annabel's on Wednesday night.\n\nThe actress, 27, looked typically stylish as she opted for clashing prints including a leopard print jumper and a leather yellow and black chequerboard skirt.\n\nStylish: Shailene Woodley jetted from the Balearic Islands to London to attend the Louis Vuitton reopening party at Annabel's on Wednesday night\n\nShailene's jumper was white and boasted a polo neck and a large leopard print panel with frill detailing and huge puff sleeves.\n\nThe Big Little Lies star teamed the jumper with a thigh-skimming mini skirt in bright yellow and black, which flaunted her honed pins perfectly.\n\nShailene complemented her outfit with a matching chequerboard bag and completed the look with a pair of black platform shoes and a pair of silver glasses.\n\nLeggy: The actress, 27, looked typically stylish as she opted for clashing prints including a leopard print jumper and a leather yellow and black chequerboard skirt\n\nThe Last Letter From Your Lover is about a love affair that lasts over 40 years and the cast also includes Felicity Jones, 35, and Nabhaan Rizwan, 21.\n\nThe story will follow Jones' character who plays a young journalist in London who discovers a series of love letters that tell the beautiful story of a love affair back in the 1960s between Woodley and Turner's characters.\n\nShe becomes so wrapped up in the story that she begins to uncover their identities while trying to figure out how the love story ends.\n\nThe movie is set to take place in Mallorca for a couple of weeks before moving to the United Kingdom for the remainder of the film, which is potentially why Shailene was in the city.\n\nShailene has made a name for herself by snagging the leading roles in movies such as Divergent and The Fault in Our Stars as well as the HBO series, Big Little Lies.\n\nBut when she's not acting, she's a major activist for the planet speaking out about single-use plastics and politics.\n\nCurrently, she is partnered with Parley for the Oceans and American Express to help clear the beaches around the world of plastics.", "description": "The actress, 27, looked typically stylish as she opted for clashing prints including a leopard print jumper and a leather yellow and black chequerboard skirt.", "authors": ["Charlotte Dean For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/11/20125776-0-image-a-103_1571911954884.jpg", "published_at": "2019-10-24"}