{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-border-wall-unlawful-national-emergency-texas-judge-ruling-a9155556.html", "downloaded_at": "2019-10-14 23:16:15.191947+00:00", "title": "Trump unlawfully declared national emergency to fund border wall, court rules", "language": "en", "text": "Donald Trump violated US law when he declared a national emergency over the country’s southern border and funnelled taxpayer money towards his campaign promise of building a sprawling wall throughout the region, a federal judge has ruled.\n\nFederal district court judge David Briones described the president’s proclamation as “unlawful” in his ruling, saying the move violated a budget law approved by Congress.\n\nThe budget law specifically states “none of the funds made available in this or any other appropriation may be used to increase” federal funding to support Mr Trump’s campaign vow.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMr Trump declared a national emergency over the US-Mexico border in February, prompting swift backlash from local politicians and Democrats on Capitol Hill.\n\nEl Paso County, Texas and the Border Network for Human Rights filed the lawsuit in the US district court for the western district of Texas, demanding a judge block the president from using military construction funds to build his wall.\n\nShape Created with Sketch. 'Dangerous' overcrowding of migrants in US border facilities Show all 6 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. 'Dangerous' overcrowding of migrants in US border facilities 1/6 Photos of detained migrants crowded into cells at the US border - with one holding up a sign reading simply \"help\" - have been released as part of a new report warning of \"dangerous\" overcrowding. The memo was sent to the Department of Homeland Security by its Inspector General, containing photos taken at border facilities in the Rio Grande Valley over a week in June DHS/OIG 2/6 Eighty-eight adult males held in a cell with a maximum capacity of 41, some signalling prolonged detention to OIG Staff on June 12 DHS/OIG 3/6 Overcrowding of families observed by OIG on June 11, at a border patrol facility in Weslaco, Texas DHS/OIG 4/6 Migrant families overcrowding a border patrol facility on June 11 in McAllen, Texas DHS/OIG 5/6 Fifty-one adult females held in a cell designated for male juveniles with a capacity for 40 at Border Patrol’s Fort Brown Station DHS/OIG 6/6 Migrant families overcrowding a border patrol facility on June 11 in McAllen, Texas DHS/OIG 1/6 Photos of detained migrants crowded into cells at the US border - with one holding up a sign reading simply \"help\" - have been released as part of a new report warning of \"dangerous\" overcrowding. The memo was sent to the Department of Homeland Security by its Inspector General, containing photos taken at border facilities in the Rio Grande Valley over a week in June DHS/OIG 2/6 Eighty-eight adult males held in a cell with a maximum capacity of 41, some signalling prolonged detention to OIG Staff on June 12 DHS/OIG 3/6 Overcrowding of families observed by OIG on June 11, at a border patrol facility in Weslaco, Texas DHS/OIG 4/6 Migrant families overcrowding a border patrol facility on June 11 in McAllen, Texas DHS/OIG 5/6 Fifty-one adult females held in a cell designated for male juveniles with a capacity for 40 at Border Patrol’s Fort Brown Station DHS/OIG 6/6 Migrant families overcrowding a border patrol facility on June 11 in McAllen, Texas DHS/OIG\n\nThe judge provided 10 days for local officials to propose an injunction that would block those military funds from going towards the project in his ruling last Friday.\n\nHe said El Paso County “has shown an injury to its reputation and has had to take affirmative steps to avoid harm”.\n\nWhile the Democrat-led Congress had already approved $1.375bn (£1.09bn) to go towards building the wall, the president imposed a national emergency to effectively pull money from military construction projects and other initiatives, including counter drug and Treasury Foreiture Funds, CNN reported.\n\nThe latest ruling applied specifically to a reported $20m (£15.9m) in military construction funds and not the counter drug and treasury forfeiture funds, as Judge Briones wrote.\n\nKristy Parker, an attorney representing the challengers in the lawsuit, hailed the ruling and told NBC News it “confirms that the president is not a king, and that he cannot override Congress’s power to decide how to appropriate funds”.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nMr Trump’s administration was expected to appeal the decision.\n\nThe US Supreme Court has already stayed a previous ruling that blocked federal funding towards expanding the president’s wall construction in Arizona and California.\n\nIt was not immediately clear when — or even if — the latest ruling would take effect.", "description": "Donald Trump violated US law when he declared a national emergency over the country’s southern border and funnelled taxpayer money towards his campaign promise of building a sprawling wall throughout the region, a federal judge has ruled. Federal district court judge David Briones described the president’s proclamation as “unlawful” in his ruling, saying the move violated a", "authors": ["Chris Riotta"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/06/19/11/donald-trump-border-separations.jpg", "published_at": "2019-10-14"}