{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7579419/The-Bachelorette-Angie-Kent-hits-Mitch-giving-ultimatum.html", "downloaded_at": "2019-10-16 21:30:15.462593+00:00", "title": "The Bachelorette Angie Kent hits back at Mitch for giving her an ultimatum", "language": "en", "text": "He refused to go on a group date with Angie Kent because he rolled his ankle.\n\nBut that didn't stop Mitch Gould delivering a jaw-dropping ultimatum on Wednesday night's episode of The Bachelorette.\n\n'All I’m gonna say is, if you can’t see me being there at the end of this. I don’t want you to give me a rose tonight,' said Mitch, just before the dreaded rose ceremony.\n\n'Hang on. We've spent, like, 10 minutes together, and you're asking me to make that type of decision? What the hell is going on?' said Angie, 29.\n\n'You’re giving me an ultimatum but you haven’t given me the time to get to know you either. And I can’t have that,' she added bluntly.\n\n'I’ve been single for a long time and I’m happy with who I am and I need someone who really wants to be here for me.'\n\nTrue colours: The Bachelorette's Angie Kent, 29, blasted contestant Mitch Gould for giving her an ultimatum on Wednesday night's episode- before unceremoniously dumping him at the rose ceremony\n\nIt was the moment that signed Mitch's fate - and he was sent packing by the time the credits rolled.\n\nEarlier in the evening, Angie looked like she formed quite the connection with former army rifleman Ciarran Stott after he revealed he used to dance in a gay bar.\n\n'It was carnage, but it was so much fun!' he mused.\n\nSay what? 'Hang on. We've spent, like, 10 minutes together, and you're asking me to make that type of decision? What the hell is going on?' said Angie\n\nTry harder: Mitch was happy to complain about not getting enough one on one time with Angie, but he couldn't muster going on a group date after he rolled his ankle\n\n'What other little secret things do you do?' she probed.\n\n'I had a nose job last year,' he responded. 'I was proper self-conscious about it.'\n\n'Well, it's a nice-looking nose now,' replied the bubbly blonde.\n\nStraight up: 'I’ve been single for a long time and I’m happy with who I am and I need someone who really wants to be here for me,' confessed Angie\n\n'It should be for the money that I paid for it,' he laughed.\n\nAngie was clearly enamored by the lovable larrikin.\n\n'I think you're lovely. So I wanted to know, Ciarran, if you would accept this rose?'\n\nThe Bachelorette continues Wednesday at 7:30pm on Channel Ten\n\nToo cute: Earlier in the evening, Angie looked like she formed quite the connection with former army rifleman Ciarran Stott after he revealed he used to dance in a gay bar", "description": "He refused to go on a group date with Angie Kent because he rolled his ankle.", "authors": ["Shannon Shipley For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/13/19786928-0-image-a-25_1571229370978.jpg", "published_at": "2019-10-16"}