{"pub": "guardian", "url": "https://theguardian.com/uk-news/2019/oct/25/essex-lorry-deaths-investigation-gathers-pace-with-more-arrests", "downloaded_at": "2019-10-25 22:13:44.341364+00:00", "title": "Essex lorry deaths investigation gathers pace with fourth arrest", "language": "en", "text": "Detectives investigating the deaths of 39 people found inside a lorry in Essex have made a fourth arrest.\n\nA 48-year-old man from Northern Ireland was arrested at Stansted airport on Friday on suspicion of conspiracy to traffic people and on suspicion of manslaughter after the bodies of 31 men and eight women were discovered in a refrigerated trailer in Grays early on Wednesday morning, Essex police said.\n\nEarlier in the day, a man and a woman, both 38 and from Warrington, were arrested on suspicion of conspiracy to traffic people and on suspicion of manslaughter in connection with the 39 deaths, following morning raids at addresses in Cheshire.\n\nThe 25-year-old driver of the lorry, Mo Robinson, from Northern Ireland, who was arrested in the early hours of Wednesday following the discovery, remains in custody.\n\nAs police began moving bodies from the port of Tilbury to the mortuary at Broomfield hospital in Chelmsford for postmortem examinations, Vietnamese families expressed concern for relatives they feared were among the dead.\n\nFacebook Twitter Pinterest Funeral home vehicles arrive at Tilbury port where the bodies were being held by authorities. Photograph: Peter Nicholls/Reuters\n\nEssex police said on Thursday they believed the 31 men and eight women were Chinese nationals, but on Friday they cautioned that “as our investigations continue, the picture may change regarding identification”.\n\nPippa Mills, the deputy chief constable, said the force would not comment further on the nationalities of the victims.\n\n“We gave an initial steer on Thursday on nationality, however this is now a developing picture,” she said. “As such I will not be drawn on any further detail until formal identification processes approved by Her Majesty’s coroner have taken place.”\n\nShe said those processes would take place alongside the examinations to establish the causes of death.\n\n“This process is likely to be a lengthy one, but it is crucial, and we’re working with Her Majesty’s coroner to ensure the dignity of the victims and the respect for their loved ones is at the forefront of our investigation.”\n\nMills urged anyone who thought their friends or relatives may have been in the trailer to contact the force, as well as individuals who may be “living illegally in this country”.\n\n“Please come forward and speak to us without fear,” she said. “I can assure you that your information will be received in strictest confidence and no criminal action will be taken against you.”\n\nThe man and woman arrested in Warrington are thought to be Joanna and Thomas Maher, who told reporters they had previously owned the cab driven by Robinson but sold it 13 months ago to a company in County Monaghan.\n\nDetectives from Cheshire police were searching a house in the Woolston area of Warrington on Friday where the couple and their three children have lived for the past two years.\n\nPolice cars and vans came and went from the detached property throughout the morning and plainclothes officers were seen entering the house carrying boxes.\n\nTwo grey Range Rover Discovery vehicles with matching personalised number plates and a white Chevrolet sports car were parked on the drive.\n\nThe Mahers told reporters on Thursday night they had sold the cab and felt disgust and shock at the fate of the migrants.\n\nThe couple, who have not been seen since, were described by neighbours as “just another normal family”..\n\nOne neighbour who did not want to be named said: “We have a friendly, neighbourly relationship. Both Thomas and Joanne are very approachable. I am very shocked but we don’t know the truth of it all yet. I know that Joanne has said that she sold the cab, so who knows?”\n\nThe couple are believed to own at least two businesses in the Warrington area and previously lived in a more modest house about two miles away.\n\nThe route taken by the lorry trailer will be one of the key priorities of the cross-border investigation.\n\nPolice confirmed the trailer was picked up at Purfleet at 12.30am on Wednesday, just over an hour before they were alerted to the discovery of the bodies and attended the scene at an industrial park in Grays.\n\nPlay Video 1:49 Essex police bow heads as lorry containing 39 dead people is moved – video\n\nThe trailer, which had arrived from Zeebrugge in Belgium, was leased from one Irish company, the Monaghan-based Global Trailer Rental Europe, on 15 October to another business on the Irish border. It was the first time the second business had made such a leasing arrangement.\n\nGPS data from the refrigerated unit shows that it left Monaghan on 15 October and crossed into Northern Ireland and then back south into Ireland, sources have said.\n\nIt then travelled from Dublin port to the UK overnight on 16 October, and crossed to mainland Europe that evening.\n\nThe trailer travelled to Dunkirk and Lille in France, and Bruges in Belgium. Dunkirk is a 40-minute drive from Calais and is a known site for people smugglers preying on migrants seeking to cross the Channel to the UK.\n\nThe data from the tracking device, which has been passed to Essex police investigating the deaths, also shows the trailer made a journey between the UK and mainland Europe on 22 October.\n\nThe Vietnamese embassy in London confirmed it has contacted police in regard to a missing woman feared to be one of the 39 victims.\n\nA spokesman for the embassy said they had been contacted by a family in Vietnam who claimed their daughter had been missing “since the lorry was found”.\n\nThe spokesman said: “We have contacted Essex police and we are waiting for an answer.”", "description": "Second man from Northern Ireland detained at Stansted airport over 39 deaths", "authors": ["Jamie Grierson"], "top_image": "https://i.guim.co.uk/img/media/1596ef6db692e5f77e3fade4e588a7813c3349da/0_543_2768_1660/master/2768.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a0e27e43c5f914260e6ce12e97f19b4b", "published_at": "2019-10-25"}