{"pub": "marketwatch", "url": "https://marketwatch.com/story/dow-futures-edge-lower-after-downbeat-eurozone-data-2019-09-23", "downloaded_at": "2019-09-23 11:54:49.975282+00:00", "title": "Dow futures edge lower start after downbeat eurozone data", "language": "en", "text": "Stock-index futures pointed to a mixed start for Wall Street Monday after a round of downbeat data on eurozone manufacturing activity that underlined worries over global growth.\n\nBut losses were limited as Chinese officials played down the significance of the cancellation of visits to U.S. farm states by officials — a move that dampened sentiment in Friday’s session.\n\nHow are markets performing?\n\nFutures on the Dow Jones Industrial Average YMZ19, -0.06% were off 12 points, or less than 0.1%, at 26,882, while S&P 500 futures ESZ19, +0.03% rose 1.50 points at 2,991. Nasdaq-100 futures NQZ19, +0.15% were up 14 points, or 0.2%, at 7,844.50.\n\nNeed to Know: The S&P 500’s ‘weakest week of the year’ is here, but this is why one strategist isn’t worried\n\nMajor indexes posted moderate losses on Friday but booked gains for the week, with the Dow DJIA, -0.59% logging a 1.1% weekly advance. The S&P 500 SPX, -0.49% rose 0.5% last week, while the Nasdaq Composite COMP, -0.80% rose 0.7%.\n\nStocks remain within striking distance of all-time highs, with the S&P 500 ending Friday 1.1% below its all-time closing high of 3,025.86 set on July 26. The Dow is off 1.6% from its record close of 27,359.16 set on July 15, while the Nasdaq remains 2.6% away from its all-time settlement high at 8,330.21 from July 26.\n\nWhat’s driving the market?\n\nThe mixed performance in futures follows data that indicated manufacturing activity in the eurozone contracted more sharply in September, posting its worst reading in nearly seven years. The flash eurozone manufacturing purchasing managers index fell to an 83-month low of 45.6 in September, down from 47 in August. Economists polled by FactSet had forecast a 47.3 reading — a figure of less than 50 indicates activity declined.\n\n“U.S. equities are poised for a slightly lower open following nervousness on the trade front, disastrous European PMI data, and fading optimism that the path to fresh record highs with U.S. stocks will be a lot harder to reach,” said Edward Moya, senior market analyst at Oanda, in a note.\n\nRead: How the Fed’s funding struggles highlight the fragility of Wall Street confidence\n\nThe cancellation of the visits to farms in Montana and Nebraska rattled stocks on Friday, along with remarks by President Donald Trump, who said he wanted a fully-fledged deal with China rather than a limited agreement that addresses particular grievances. But officials said talks would continue, as planned, in October, helping to soothe worries, analysts said.\n\nInvestors will get a look at Markit’s take on U.S. activity, with the release of the September purchasing managers index readings for manufacturing and services at 9:45 a.m. Eastern. Ahead of that, the Chicago Fed’s national activity index is set for release at 8:30 a.m. Eastern.\n\nWhich stocks are in focus?\n\nIn company news, Caesars Entertainment Corp. CZR, +0.08% said it reached an agreement to sell the Rio All-Suite Hotel & Casino to a company controlled by a principal of Imperial Companies for $516.3 million. Shares of Caesars were up 1.3% in premarket action.\n\nCalifornia utility PG&E Corp. PCG, -4.84% said it reached an agreement to resolve claims with entities representing 85% of the insurance claims from the 2017 Northern California wildfires and the 2018 Camp Fire.", "description": "Stock-index futures point to a slightly lower start for Wall Street Monday after a round of downbeat data on eurozone manufacturing activity that underlined...", "authors": ["William Watts", "Deputy Markets Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HB141_dark_w_ZG_20190102124710.jpg", "published_at": "2019-09-23"}