{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/09/sen-graham-threatens-to-call-volker-to-testify-if-house-dems-fail-to-release-depositions-transcripts", "downloaded_at": "2019-10-10 00:08:29.332886+00:00", "title": "Graham Will Call Volker to Testify If House Dems Keep Transcripts Secret", "language": "en", "text": "Sen. Lindsey Graham (R-SC) on Wednesday demanded that House Democrat leaders release the full transcript of the testimony provided by the impeachment inquiry’s first witness, former U.S. special envoy to Ukraine Kurt Volker.\n\nGraham, the chairman of the Senate Judiciary Committee, threatened to call Volker to testify before his panel if Democrats did not meet his demand.\n\nVolker is at the center of the impeachment investigation. He resigned as the special envoy to Ukraine at the end of last month as the inquiry began to heat up.\n\nSen. Graham described the House Democrats’ refusal to make the full transcript of Volker’s deposition last Thursday public as “an abuse of power.”\n\nRep. Jim Jordan (R-OH) and other Republican congressmen who witnessed Volker’s testimony have called on Democrats to release the transcript.\n\nJordan is the top Republican of the House Committee on Oversight and Reform. The Democrat-led House Committees on Oversight and Reform, Intelligence, and Foreign Affairs are pursuing the impeachment inquiry.\n\nRep. Lee Zeldin (R-NY) said the full transcript of Volker’s testimony “obliterated” the “whistleblower’s” claim fueling the impeachment inquiry into President Donald Trump.\n\nThe comments from Zeldin, a member of the House Foreign Affairs Committee who also witnessed Volker’s testimony, came while he was briefing reporters alongside Jordan.\n\nCiting a Fox News story highlighting the Democrats’ refusal to releae the transcript, Sen. Graham wrote on Twitter Wednesday, “If this continues, I will call Volker before the Senate Judiciary Committee to testify publicly to ensure the full story is told.”\n\nIf this continues, I will call Volker before the Senate Judiciary Committee to testify publicly to ensure the full story is told.https://t.co/jNi3KQ3wRB — Lindsey Graham (@LindseyGrahamSC) October 9, 2019\n\n“If House [Democrats] refuse to release full transcript of Volker testimony as requested by Congressman Jordan, it will be an abuse of power,” he added in a separate tweet.\n\nIf House D’s refuse to release full transcript of Volker testimony as requested by Congressman Jordan, it will be an abuse of power. — Lindsey Graham (@LindseyGrahamSC) October 9, 2019\n\nAn intelligence community “whistleblower” alleged that Trump attempted to coerce Ukraine into investigating White House Democrat hopeful Joe Biden and his son, Hunter.\n\nDuring a July 25 phone call with Ukrainian President Volodymyr Zelensky, Trump threatened to withhold aid if Ukraine failed to play ball, the “whistleblower” claimed.\n\nTrump and Zelensky have denied the allegation.\n\nRep. Mark Meadows (R-NC), a member of the House Committee on Oversight and Reform, told reporters Wednesday the release of the transcript would have already “exonerated” Trump of any wrongdoing.\n\nMeadows was also present during the former envoy’s deposition.\n\nRep. Zeldin added on Twitter last Friday:\n\nHouse [Democrats] should immediately release [Amb.] Volker’s several hours long transcribed interview so all can read it. He candidly [and] professionally obliterated the bogus charge POTUS made a quid pro quo offer to Zelensky connecting aid to Ukraine with an investigation into Bidens.\n\nBreitbart News corroborated Republican assertions that House Democrats cherry-picked and mischaracterized evidence provided by Volker to fuel their impeachment agenda.\n\nVolker also stepped down as the executive director of the McCain Institute this week.", "description": "Graham demanded House Democrats release the full transcript of the testimony former U.S. special envoy to Ukraine Kurt Volker.", "authors": ["Edwin Mora"], "top_image": "https://media.breitbart.com/media/2018/11/lindsey-graham-fingers-ap.jpg", "published_at": "2019-10-09"}