{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7566915/Boy-eight-snares-whopping-314kg-tiger-shark-massive-sea-beast-stalked-boat.html", "downloaded_at": "2019-10-13 03:58:31.314940+00:00", "title": "Boy, eight, snares whopping 314kg tiger shark after massive sea beast stalked his boat", "language": "en", "text": "An eight-year-old boy who caught a 314kg shark may have broken a world record.\n\nJayden Millauro was fishing with his dad Jonathan and boat captain Ibby Dardas off the coast of south Sydney last weekend when he reeled in the beast.\n\nThe fishermen threw out a line of bait and the whopping shark followed them just like Jaws in the iconic Spielberg film.\n\nThe giant creature swam up to the back of their 7.3 metre boat, called The Undertaker, when Jayden managed to hook it.\n\nJayden Millauro (pictured) was fishing last weekend with his dad when he caught the 314kg beast (pictured)\n\nJayden told The Daily Telegraph he was 'nervous' as the shark was dragged on to the boat.\n\n'I was thinking that I hope the crew can (get) the shark (on the boat) because I don't want to lose it. I was really excited when they got it.'\n\nWhen the trio arrived back at Sylvania Marina they realised the shark was two kilograms heavier than the previous junior record held by Ian Hissey.\n\nHissey caught a 312kg tiger shark in April 1997 and held the International Game Fish Association's 'small fry' record for 22 years.\n\nWhile the boy's father Jonathan Millauro wouldn't reveal the exact location of the catch, he did say it was near Brown Mountains, off the continental shelf.\n\n'It was rainy and the seas were rough. We were berleying up and at 11.15 we spotted the shark as it came up to the back of the boat.'\n\nWhen the trio weighed the shark they realised the shark was two kilograms heavier than the previous junior record (pictured: Jayden Millauro and his dad Jonathan Millauro, left)\n\nThe proud dad said the shark was lured in after they threw bait off the back of the boat.\n\nJayden, who has been fishing since the age of two, said the catch was a big achievement.", "description": "Jayden Millauro was fishing with his dad Jonathan and boat captain Ibby Dardas off the coast of south Sydney last weekend when he reeled in the beast.", "authors": ["Charlotte Karp For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/00/19639644-0-image-a-14_1570923348174.jpg", "published_at": "2019-10-12"}