{"pub": "guardian", "url": "https://theguardian.com/books/2019/oct/05/aching-truths-why-we-love-books-about-heartbreak", "downloaded_at": "2019-10-05 12:24:42.115513+00:00", "title": "Burning down the house: the bittersweet appeal of break-up literature", "language": "en", "text": "When I was 22, I tried to write a story about a breakup. I’d just been broken-up with. And yes, I was embarrassed to be writing about it. But my heart ached, and I wanted to believe that its ache could yield something profound.\n\nWriting about heartbreak came easily, but I struggled with the part of the story about the love itself: the happiness before the fall. When I asked my writing teacher if he could recommend any literary texts that evoked the bliss of love, he suggested Scott Spencer’s novel Endless Love. There I found – instead of bliss – a house on fire. Literally: post breakup, a boy has set his ex-girlfriend’s house on fire.\n\nMy teacher was right, as it turned out: the novel did include ecstatic depictions of early courtship and its glorious surrender, but it seemed telling that even the quest for an account of love’s joy would inevitably lead me to an account of its painful aftermath. Perhaps any story of love is always a story about its ending, or at least a story shadowed and electrified by the possibility of that ending. Breakups summon and sustain narrative more readily than long-lasting love for plenty of obvious reasons; rupture is narrative, after all. Narrative finds no traction without trouble. One could rephrase Tolstoy’s favorite maxim to say – ”Happy relationships are all alike; every unhappy relationship is unhappy in its own way” – and it would be truthful and limited in the same ways: happiness can be as distinctly textured as its opposite, and broken love affairs can hew pretty closely to some familiar formulas: the affair on business trips, The simmering estrangement over silent dinners, the sleepless siege of having small children, the self-transformation that leaves the other partner behind.\n\nBut there is something singularly urgent about the appeal of a breakup story: it becomes an attempt to transcribe intimacy in the midst of disappearance, like taking a photograph of a wave before it rushes back to sea. It’s an archiving impulse born of the desire to preserve something that would otherwise be lost. “Why is it better to last than to burn?” Roland Barthes asks in A Lover’s Discourse, and creating art about (or even from) the charred corpse of love is a way to grant the burning its own lasting, its own eloquent immortality.\n\nMy personal breakup canon includes classics such as Leo Tolstoy’s Anna Karenina, Graham Greene’s The End of the Affair, Jean Rhys’s Voyage in the Dark (though really any of her novels could count) and certainly Wide Sargasso Sea – which is perhaps less a breakup narrative than the story of a woman so forcibly imprisoned in her heartbreak that she will burn the whole house down (a theme emerges) to articulate her rage and demand her freedom. In Alice Munro’s short story “Simon’s Luck”, a woman who gets stood up by a man after several weeks of dating starts checking obituaries for his name – unable to believe he has fallen out of infatuation so quickly – and her thought process captures something both absurd and true about the depths of indignation and histrionic grief that even a casual separation can inspire.\n\nFacebook Twitter Pinterest Keira Knightley in Anna Karenina, the 2012 film based on Tolstoy’s novel. Photograph: Allstar/Universal Pictures/Sportsphoto Ltd\n\nRichard Yates’s 1961 novel Revolutionary Road charts the disintegrating marriage of Frank and April Wheeler, who live in a soul-crushing Connecticut suburb while they dream of moving to Paris. Though the novel is grim in its vision of suburban conformity and marital estrangement, it excavates from the widening distance between two people a set of aching, nuanced truths about the distances between all of us. James Salter’s Light Years (1975) presents a time-lapse portrait of a marriage and its dissolution over the course of 20 years, following Nedra and Viri through pleasure and estrangement. The novel explores the fundamental opacity of other people, describing the consciousness of another person as “mysterious, it is like a forest” – something you can comprehend from a distance, but that splinters up-close into bewildering light and shadow. It’s a painful novel, but has beautiful moments: apples and wood-handled knives on a picnic, fretted by sun-dappled shade. It’s an image of pleasure from before the marriage sours, insisting that this happiness remains a truth embedded in the story, even if it ultimately gives way to loss. In life, we tell the stories of our breakups not only because these stories hurt, but because we want to say: “This love was. Some part of it remains.”\n\nThe urge to think or talk or write about broken relationships is constantly shadowed by shame: the shame of dwelling, the shame of lingering, the shame of solipsism – the fear that it is somehow weak or useless to spend too much time in the past, that it narrows or forecloses the world. In Edna St Vincent Millay’s poem “Only Until This Cigarette Is Ended”, the speaker grants herself a single cigarette-length span of nostalgia – “I will permit my memory to recall / The vision of you” – as if she needs to ration her access to some guilty pleasure. In her poem “The Glass Essay”, Anne Carson finds language not just for the devastation of heartbreak but for the shame of being too devastated by it. It’s a poem anchored by the end of a five-year relationship: “Not enough spin on it, / he said of our five years of love. / Inside my chest I felt my heart snap into two pieces / which floated apart … ” In the aftermath, the speaker’s mother becomes a mouthpiece for the idea that one can dwell too long: “You remember too much, / my mother said to me recently. / Why hold onto that? And I said, / Where can I put it down?”\n\nIn literature, can we take meaning from what hurts? And when does that attempt become self-serving delusion?\n\nLiterary accounts of broken relationships not only try to “hold onto that” by transcribing or inventing stories of lost or soured love, they also try to answer the question of why it’s worth holding on in the first place. It’s one of the great reckonings at the heart of literature itself: can we extract meaning from what hurts? And when does that attempt verge into self-serving delusion or come up against its own limits? Randall Jarrell famously outlined the sceptical take in his poem “90 North”: “Pain comes from the darkness / And we call it wisdom. It is pain.”\n\nNevertheless, we keep seeking that wisdom. In his poem “Eurydice”, Ocean Vuong describes this painful illumination as “gravity breaking / our kneecaps just to show us the sky”. Nowhere do we seek the sky as pointedly or hopelessly as we do in stories of lost love. In “The Glass Essay”, Carson doesn’t dramatise the process of recovering from heartbreak so much as she documents the anguished mess of making meaning from it – or rather, struggling with the proposition that it holds any meaning at all. Perhaps her kneecaps have been broken, but she is no longer sure what sky she lives under: “In the days and months after Law left / I felt as if the sky was torn off my life.”\n\nYet Carson suggests that heartbreak can sharpen and even broaden your gaze, rather than narrowing it, overturning the presumption that a broken heart will inevitably make you self-consumed and self-obsessed. The speaker observes that while her mother always closes her bedroom curtains, “I open mine as wide as possible. / I like to see everything.”\n\nA resonant quality of expansive attention is one of the defining features of Maggie Nelson’s Bluets, a cult classic that is at once a “breakup story” and a text that resists both parts of that phrase. It’s neither a traditionally structured story – instead the book is composed as an arrangement of numbered, ruminative fragments called “propositions” – nor is it exclusively about a breakup. The form is making an argument about the nature of heartbreak: life is never just one thing at once. Whenever our hearts are broken, a thousand other things are happening at the same time, within our lives and beyond them.\n\nMore than anything, Bluets is an obsessive exploration of the colour blue: it weaves together a discussion of various theories of sight (some ancients “thought that our eyes emitted some kind of substance that illuminated, or ‘felt’, what we saw”); the blue paintings of Yves Klein (“feeling their blue radiate out so hotly that it seemed to be touching, perhaps even hurting, my eyeballs”);and the blue-spangled bowers of satin bowerbirds (“When I see photos of these blue bowers, I feel so much desire that I wonder if I might have been born into the wrong species”). The narrator often returns to her longing for the “prince of blue”, to their tryst at the Chelsea Hotel, to his blue eyes, to his pale blue shirt, but though she is creating a beautiful blue bower from her longing, she does not wish to reside in it for ever: “I don’t want to yearn for blue things,” she says. “Above all, I want to stop missing you.” In that sense, and others, the book’s excursions are not distractions; they are the point. By turning their gaze in so many directions at once, these propositions simultaneously evoke a sense of monomania (everything is blue!) and multiplicity (so much else is out there!). The bedroom curtains are open.\n\nFacebook Twitter Pinterest Ralph Fiennes and Julianne Moore in the 1999 film adaptation of The End of the Affair. Photograph: Allstar/Columbia\n\nThis formal evocation of simultaneity inverts the tragic quality of Bruegel’s painting of Icarus: a young boy falling from the sky while everyone else keeps going to market. Perhaps there is something hopeful about this simultaneity, about the fact that the world keeps happening all around your heartbreak – perhaps you can see all these happenings differently because of your heartbreak. The narrator acknowledges the times when her emotion starts to feel like indulgence: “I wept until I aged myself,” she says, “I recognized this as a rite of decadence, but I did not know how to stop it”. Breakup literature simultaneously recognises that some pain is impossible to put down, and becomes a kind of ledge on which the pain itself can rest – not only for the characters, or even their author, but for the readers who come to these stories and find in them some echo of their own aches.\n\nTop 10 failed romances in fiction Read more\n\nIt’s a cousin to the sense of solace that visitors find at the Museum of Broken Relationships, a museum in Zagreb, Croatia, full of donated objects that testify to lost loves: a toaster, an axe, a child’s pedal car, a handmade modem. The museum has gathered this archive of artefacts into a concrete embodiment of our hunger for breakup stories – our desire to immortalise our own heartbreak and to encounter the heartbreak of others, to feel, perhaps, less alone in our heartbreak through that act of encounter. (The museum’s security guards often end up consoling weepy visitors.) The solace found in shared experience is the flip side of the shame that can arise from triteness. The speaker in “The Glass Essay” exclaims: “It hurt so much I thought I would die,” and then undercuts herself wryly: “This feeling is not uncommon.” The “commonness” of feeling can be embarrassing, but it can also be consoling. It can feel good to hear about someone else’s terrible breakup when you’re in the midst of your own; not necessarily from a sense of schadenfreude but because it grants permission to inhabit the feeling.\n\nKim Addonizio opens her poem “To the Woman Crying Uncontrollably in the Next Stall” by addressing herself to a stranger: “If you ever woke in your dress at 4am ever / closed your legs to a man you loved opened / them for one you didn’t”, and ends it by promising that there is another side: “if you think nothing & / no one can / listen I love you joy is coming.” Perhaps this is one way we can think of breakup literature and what it does for us: it’s a way of speaking across bathroom stalls, to strangers we may never meet •\n\n• Make It Scream, Make It Burn by Leslie Jamison is published by Granta (£14.99). To order a copy go to guardianbookshop.com. Free UK p&p on all online orders over £15.", "description": "From Richard Yates and Maggie Nelson to Ocean Vuong and Alice Munro, many of the great love stories are really about its aftermath. What can we learn from the literature of heartbreak?", "authors": ["Leslie Jamison"], "top_image": "https://i.guim.co.uk/img/media/8eaacb0ad77db0abed88ab8acf12a877d92f8d09/1550_189_1943_1166/master/1943.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=67e5102e2ba654cbefd7081bb093a011", "published_at": "2019-10-05"}