{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/hong-kong-metro-legislature-open-protests-planned-191011020412621.html", "downloaded_at": "2019-10-11 05:10:28.215032+00:00", "title": "Hong Kong's metro, legislature open but more protests planned", "language": "en", "text": "Hong Kong's metro operator opened all its stations on Friday for the first time in a week, before another round of anti-government protests at the weekend, as the city's legislature began its first session since protesters stormed the building in July.\n\nPro-establishment and pro-democracy legislators shouted at each other before the start of the session, heightening tensions that have spiralled following four months of sometimes violent pro-democracy protests in the territory.\n\nSome legislators wore black masks as they sat in the chamber, with others carried placards reading: \"Police brutality still exists, how can we have a meeting?\"\n\nThe wearing of face masks was banned under colonial-era emergency powers invoked by embattled Hong Kong leader Carrie Lam a week ago.\n\nThe protests have plunged the city into its worst crisis since the British returned Hong Kong to China in 1997 and also pose the biggest popular challenge to Chinese President Xi Jinping since he came to power in 2012.\n\nThe protests began in opposition to a now-withdrawn extradition bill but have since evolved into a pro-democracy movement fanned by fears that China is encroaching on the freedoms Hong Kong was guaranteed under the \"one country, two systems\" formula put in place with the 1997 handover.\n\nChina denies such claims and blames foreign countries, including Britain and the United States, for fomenting unrest.\n\nMasked anti-government protesters at a demonstration in Tsim Sha Tsui district last weekend. [Susana Vera/Reuters]\n\nClosing early\n\nMetro operator MTR, whose network carries about five million passengers a day, said all lines would shut at 10pm (1400 GMT) on Friday, more than two hours earlier than usual so more repairs could be carried out after protesters vandalised stations across the city.\n\nMany stores and businesses have had to shut early due to metro closures, further hampering the city's faltering economy as it faces its first recession in 10 years.\n\nProtesters have targeted the MTR because it has been blamed for closing stations on the government's behalf to contain demonstrations.\n\nThe normally efficient system shut down completely last Friday after a series of arson attacks and has operated only partially since.\n\nLam introduced the emergency laws, including the ban on face masks, last Friday in an effort to quell unrest. However, the move sparked some of the worst violence since protests started.\n\nThe government has said it will not take any further measures to counter violent protests, rejecting rumours that mainland Chinese security forces were involved.\n\nSeveral demonstrations are planned in districts across the territory on Friday and throughout the weekend, protesting against issues that include perceived police brutality.", "description": "Legislators start sitting by shouting at each other, in first session since protesters ransacked the building in July.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/11/007d214de6b348c7928bcd6db1283dcb_18.jpg", "published_at": "2019-10-11"}