{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/german-synagogue-shooting-was-livestreamed-on-twitch", "downloaded_at": "2019-10-10 00:44:06.396081+00:00", "title": "German Synagogue Shooting Was Livestreamed On Twitch", "language": "en", "text": "Police near the scene of the shooting in Halle, Germany (Photo: Getty)\n\nA shooting at a synagogue in Halle, Germany, on Wednesday during Yom Kippur was livestreamed on Twitch.\n\nTwitch confirmed to CNBC that the attack, in which two people were killed, was streamed on its platform. The Amazon-owned company is primarily used by gamers who livestream their gameplay and communicate with viewers.\n\n“We are shocked and saddened by the tragedy that took place in Germany today, and our deepest condolences go out to all those affected,” a Twitch spokesperson told Gizmodo, in a statement. “Twitch has a zero-tolerance policy against hateful conduct, and any act of violence is taken extremely seriously. We worked with urgency to remove this content and will permanently suspend any accounts found to be posting or reposting content of this abhorrent act.”\n\nWhen asked how many people viewed the original stream of the shooting and how long it was up before Twitch took action, the spokesperson told Gizmodo Twitch was investigating the matter and did not have any more information to share.\n\nAccording to NBC, minutes after today’s synagogue shooting was streamed on Twitch, it had spread to at least 10 white supremacy channels on Telegram, an instant-messaging app.\n\nNBC reports that during the 35-minute livestreamed video, the man attempted to enter a synagogue, but couldn’t get in. He then shot a woman on the road and later shot a man in a kebab shop. At one point, the apparent shooter looked into the camera and recited an antisemitic screed in which he denied the Holocaust occurred. He also reportedly introduced himself as “Anon,” which NBC points out is potentially a reference to the anonymous message board 4Chan.\n\nThis shooting comes seven months after a white supremacist allegedly targeted two mosques and killed 51 people. The incident was livestreamed on Facebook. In August, a six-page letter, written by the alleged shooter from jail, was posted on 4Chan.", "description": "A shooting at a synagogue in Halle, Germany, on Wednesday during Yom Kippur was livestreamed on Twitch....", "authors": [], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/bqexlmawawivehilqbo3.jpg", "published_at": "2019-10-10"}