{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7540243/Employee-branded-spoiled-f-ing-brat-Robert-Niro-fires-Taxi-Driver-star.html", "downloaded_at": "2019-10-05 12:32:09.646676+00:00", "title": "Employee branded a 'spoiled f***ing brat' by Robert De Niro fires back at the Taxi Driver star", "language": "en", "text": "A former employee of Robert De Niro is hitting back at the iconic actor after he called the lawsuit she has filed against him 'completely absurd'.\n\nGraham Chase Robinson - who is seeking $12 million in damages from the Taxi Driver star alleging harassment and gender discrimination - spoke through her attorney Alexandra Harwin in an interview with Fox Business on Friday.\n\n'What was going on was abusive and demeaning,' Harwin stated, referring to Robinson's work environment at Canal Productions.\n\nRobinson became De Niro's personal assistant at the company back in 2008, before she rose up the ranks to eventually become vice president of production and finance.\n\nBut Robinson alleges working with De Niro became so bad that she had no choice but to quit the company earlier this year.\n\nIn a 2012 voicemail - which was leaked on Thursday - De Niro can be heard shouting at Robinson, calling her a 'spoiled brat,' saying 'how dare you f***ing disrespect me,' and threatening her, saying 'you're f***ing history'.\n\nGraham Chase Robinson (left) - who is seeking $12 million in damages from Robert De Niro (right) alleging harassment and gender discrimination - spoke through her attorney Alexandra Harwin in an interview with Fox Business on Friday\n\nShe claims such behavior wasn't unusual for the iconic actor, who is alleged to have abused his employee on multiple occasions.\n\n'It was a routine occurrence for Mr. De Niro, when intoxicated, to call Ms. Robinson -- to call her names, to berate her, to curse at her,' Harwin told Fox Business.\n\nElsewhere in the interview, Harwin alleges that Robinson 'was asked to do things that her male colleagues were never asked to do, like scratch Mr. De Niro's back, button his buttons, tie his ties.'\n\n'The whole work environment was unacceptable, she added.\n\nIt comes after De Niro's reps told Fox News on Thursday night that 'the allegations made by Robinson are beyond absurd'.\n\n'What was going on was abusive and demeaning,' Alexandra Harwin stated, referring to Robinson's work environment at Canal Productions\n\nDe Niro himself has already launched legal action against Robinson for allegedly spending four full days ordering delivery and watching 55 episodes of Friends while she was employed at Canal Productions.\n\nHe claims that Robinson also raided company coffers and even stole his flyer miles while also binge-watching 'astounding hours' of Netflix.\n\nDe Niro's production company announced they were suing former executive Robinson for $3 million, according to the suit filed in the Manhattan Supreme Court in August.\n\nRobinson abruptly quit working at Canal Productions on April 6 when 'suspicions arose' about her 'honesty, integrity, work ethic and motivation,' Page Six had reported after seeing the papers.\n\nRobinson has launched a counter lawsuit against the actor, who first filed legal papers against his former employee in August\n\nDE NIRO'S RANT TO HIS EMPLOYEE IN FULL Lawyers for Robinson say De Niro was 'verbally abusive' and 'would frequently bully, berate, and curse at her'. One example was captured in the November 2012 voicemail, transcribed below: De Niro: 'Chase, you are living in Spain and you’re f***ing upset with me cause now you tell me how nice you have it your life over there and you f***ing don’t answer my call? 'How dare you. You are absolutely fired, you’re f***ing history. 'How dare you with all the good things you do this is bulls*** after Christmas. 'F*** this, how dare you f***ing disrespect me how much you did. You want a f***ing another position? You want another position. Then change and go off somewhere. 'Don’t f***ing get angry with me cause I’m p***ed off cause I didn’t get a simple thing I need more than right now here out in California when I am here for less than 24 hours. 'You got to be f***ing kidding me you spoiled brat, f*** you! So quit whenever you want, god damn ya how can you f***ing so you don’t answer you’re upset cause you’re living in Spain you spoiled f***ing brat.'\n\nBut Robinson's newly filed complaint argues: 'De Niro was enraged at the prospect of Ms. Robinson bringing a lawsuit challenging his behavior. So, he retaliated and struck first.'\n\nHer new suit states: 'Robert De Niro is someone who has clung to old mores. He does not accept the idea that men should treat women as equals.\n\n'He does not care that gender discrimination in the workplace violates the law. Ms. Robinson is a casualty of this attitude.'\n\nDe Niro's production company said a review of the books after she left found Robinson allegedly used the company's American Express card to spend tens of thousands of dollars on lavish trips, floral arrangements, iPhones, Uber rides, a Louis Vuitton handbag, dogsitters and pricey dinners.\n\nShe also allegedly used three million of De Niro's frequent flyer miles for personal trips and vacations while transferring five million to her personal account — estimated to be valued at $125,000 in total.\n\nBecause of her senior role within the company, Robinson was able to approve her own expenses, including an alleged bogus three-day LA business trip in March 2018 that allegedly turned out to be for a friend's birthday — racking up a $5,000 bill, according to De Niro's suit.\n\nIn one voicemail De Niro can be heard shouting at Robinson, calling her a 'spoiled brat,' saying 'how dare you f***ing disrespect me,' and threatening her, saying 'you're f***ing history'\n\n\n\n", "description": "Graham Chase Robinson - who is seeking $12 million in damages from De Niro - spoke through her attorney in an interview with Fox Business on Friday.", "authors": ["Andrew Court", "Lauren Fruen For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/16/19260658-0-image-a-36_1570117070146.jpg", "published_at": "2019-10-05"}