{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7630687/Dame-Helen-Mirren-joins-star-Sir-Ian-McKellen-Good-Liar-photocall.html", "downloaded_at": "2019-10-30 16:12:12.770590+00:00", "title": "Dame Helen Mirren joins co-star Sir Ian McKellen at The Good Liar photocall", "language": "en", "text": "They are starring together in a film for the first time in their stellar careers.\n\nAnd Dame Helen Mirren and Sir Ian McKellen looked delighted as they continued promoting their new film, The Good Liar, in London on Wednesday.\n\nOscar-winner Helen, 74, showcased her trim midriff and enviable figure in a scarlet long-sleeved fitted dress which cinched in at her waist.\n\nIcons: Dame Helen Mirren and Sir Ian McKellen looked delighted as they continued promoting their new film, The Good Liar, in London on Wednesday\n\nThe Queen (of style): Oscar-winner Helen, 74, showcased her trim midriff and enviable figure in a scarlet long-sleeved fitted dress which cinched in at her waist\n\nThe star paired this with monochrome snakeskin heels and a small Poppy badge,\n\nHer locks were styled in a sleek sidepart while her age-defying features were enhanced with fluttery lashes and red lipstick.\n\nTwo-time Oscar nominee Ian, 80, cut a casually cool figure in a green t-shirt, patterned scarf, and woolen jacket.\n\nHe completed his ensemble with skinny jeans and chestnut loafers.\n\nChemistry: The co-stars were in good spirits as they embraced and posed for the cameras before chatting between shots\n\nPose: Her locks were styled in a sleek sidepart while her age-defying features were enhanced with fluttery lashes and red lipstick\n\nChat: The co-stars and friends were seen chatting before taking more photos\n\nThe co-stars were in good spirits as they embraced and posed for the cameras before chatting between shots.\n\nIn the drama, directed by Bill Condon, Sir Ian plays a con artist trying to outwit well-to-do widow Betty McLeish (Helen) who is looking for love, however things take an unexpected turn as the pair play a dangerous game of cat and mouse.\n\nThe film marks the first time Helen and Ian have worked together on the big screen, while it is the fourth time Ian and director Bill have collaborated with one another, including his Oscar-nominated turn in Gods And Monsters.\n\nThe Good Liar will be released in cinemas across the UK on 8 November, and in the USA on 15 November.\n\nCo-stars: Helen and Ian were in great spirits as they promoted the film\n\nEnsemble: The dynamic duo were joined by director Bill Condon at London's Corinthia Hotel", "description": "Dame Helen Mirren and Sir Ian McKellen looked delighted as they continued promoting their new film, The Good Liar, in London on Wednesday.", "authors": ["Eve Buckland For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/13/20377870-0-image-a-28_1572443444340.jpg", "published_at": "2019-10-30"}