{"pub": "cbs", "url": "https://cbsnews.com/news/wework-ipo-pulled-company-withdraws-its-ipo-filing", "downloaded_at": "2019-10-01 00:11:45.145042+00:00", "title": "WeWork withdraws its IPO filing a week after replacing founder as CEO", "language": "en", "text": "WeWork parent the We Company on Monday withdrew its plan to take the office space leasing company public less than a week after ousting its CEO.\n\nWeWork's new co-chief executive officers, Artie Minson and Sebastian Gunningham, said in a statement that \"We have decided to postpone our IPO to focus on our core business, the fundamentals of which remain strong,\" according to The Associated Press.\n\nWeWork is the biggest tenant in New York City, and has made its name leasing, renovating and subleasing office space in cities nationwide. It was once privately valued as high as $47 billion. Since filing regulatory documents to go public on August 14, however, it has faced questions about its large financial losses, funding and corporate governance. Before pulling out, WeWork was considering an IPO well below $20 billion, according to the AP.\n\nWeWork founder Adam Neumann stepped down as CEO last week. The company has been cutting costs as it seeks to shore up its balance sheet.\n\nThe We Company also has an eclectic portfolio of side businesses meant to cater to the well-being of its members — a community-building vision set forth by Neumann, a magnetic Israeli immigrant who partly grew up on a kibbutz, and his wife Rebekah Neumann, a certified yoga instructor who studied both business and Buddhism at Cornell University.\n\nThose ventures include a fitness company called \"Rise by We,\" a school for children called \"WeGrow,\" and a co-living rental company \"WeLive.\" An acquisition spree included the social media network Meetup.\n\nFor now, WeWork has cash. It was sitting on $2.5 billion at the end of June. But it continues to burn more money than it brings in. Its yearly loss amounts to nearly $5,200 per customer. The company is on track to burn $2.7 billion this year.\n\nSome $1.5 billion will arrive next year from its biggest investor, the Japanese firm SoftBank. But even with that infusion, uncertainty remains about whether WeWork can raise enough cash to support its aggressive growth. Last week, S&P Global Ratings cut WeWork's credit rating to \"junk\" status.", "description": "A week after ousting its founder as CEO, the money-losing office-sharing company yanks plan to go public", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/08/14/d7efd460-576f-4445-bc96-e853dc75429d/thumbnail/1200x630/f0ec70d47db3ab27e7e7b95cae0b087b/wework-gettyimages-1168053887.jpg", "published_at": "2019-09-30"}