{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/novation-launchpad-x-review-instrument-of-the-future-lets-anyone-make-electronic-music-10921018", "downloaded_at": "2019-10-15 16:23:38.701094+00:00", "title": "LaunchPad X review: Is Novation's new gadget worth the price?", "language": "en", "text": "The Novation Launchpad X (Image: Novation)\n\nIf composers like Mozart or Beethoven managed to travel forward in time to the present day, they would probably recognise most of our modern musical instruments.\n\nBut show them a device like the Novation Launchpad X and they’d probably think it was some haunted glowing hell box.\n\nUnbox the Launchpad and it’s just a slim, black slab of plastic with loads of grey squares on its front\n\nWhen you plug it into a computer, the device suddenly springs to life and lights up dramatically, the grey squares suddenly glowing with all the colours of the rainbow.\n\nWhich looks nice, for sure. But what on earth does this attractive little box actually do?\n\nTo answer that you need to jump back to 2001 when a Germany company called Ableton launched a piece of software named Live which went on to change the world of music production forever.\n\nAdvertisement\n\nAdvertisement\n\nLive lets you load up clips of audio, drum kits or virtual instruments and then arrange musical phrases in a grid. These tuneful chunks can then be played alongside each other and blended to produce individual pieces of electronic music or much longer DJ sets.\n\nThis is where the Launchpad comes in. A British company called Novation first launched the device in 2009 and it immediately became hugely popular because it turned Ableton Live into a musical instrument.\n\nEach of the glowing squares corresponded to a clip of music in Live’s grid and let users choose which clips they wanted to play at any given time. The Launchpad also doubled as a musical interface, allowing players to bash out drum patterns or play instruments such as synthesizers on its grid of notes. You can see an older LaunchPad in action in the video below, in which a performer is using it to play drums and synths, as well as a video included later in this article.\n\nNow, 10 years on, the music tech giant Novation has released Launchpad X, which I’m reviewing today, as well as a smaller, cheaper Launchpad Mini.\n\nAnd I’m pleased to say the tenth-anniversary Launchpad is a brilliant device I’d recommend to anyone looking to start out making music as well as people, like me, who’ve spent years making tunes on Ableton Live.\n\nThe first thing to note is that for £179.99 you get the Launchpad X and a suite of software including a basic version of Live and a number of musical instruments, meaning you can just plug the device into a computer and get started.\n\nAdvertisement\n\nAdvertisement\n\nYou can also use the gadget to control iPhone apps including Launchpad, which is designed to mix and blend loops of audio, but it’s primary use is definitely as a Live controller.\n\nI’ve been using Live for some time and found Launchpad incredibly intuitive. The primary function is to launch clips in the ‘session view’ of Ableton, which is a grid of audio and midi clips (which are used to tell synths and other instruments which notes to play).\n\nThe idea of Live is to seamlessly build up tracks without stopping and Launchpad makes it easy to build arrangements or remixes by playing clips or stopping them in time.\n\nOn the left is the Launchpad X and the smaller model is the Launchpad Mini (Image: Novation)\n\nBut Launchpad doesn’t stop there. You can press one of its buttons and the device will let you control the volume sliders of each track, allowing you to blend them as you play clips, or various other functions such as ‘sends’ – which let you route audio to effects using a technique made famous by dub producers of the 1970s and still widely used today.\n\nThis is a pretty clever system which surprised me with its effectiveness because I found it hard to imagine how a row of squares would let you simulate the action of moving a knob up and down – the technique generally used to control parameters on a computer screen by producers who want more control than a simple mouse offers.\n\nAdvertisement\n\nWhen you press the Mixer button, each line of squares shows levels of whatever control it’s, erm, controlling. Tap gently and the value will move up slowly, which is useful for gently fading audio in or out, whilst a firm tap will make it jump to a new value immediately.\n\nAs an ex-guitarist, The function I was really excited about was the note input function. When you select this mode, the 64 pads are arranged into a grid of musical notes which are tuned like the strings of a guitar so the first note of each line of squares is five semitones apart.\n\nThis is great if you learned to play guitar rather than piano, because it opens up electronic music production immediately and lets you use familiar scales and chord shapes rather than trying to grapple with a keyboard.\n\nThere’s also a clever scale mode which lets you lock the grid so every square plays only the notes of that scale, making it incredibly easy to bash out tunes with zero musical knowledge.\n\nThe pads of LaunchPad X are very sensitive and great for playing instruments. They pick up ‘velocity’ – which is how hard to press a pad – as well as ‘aftertouch’ so you can apply pressure to the pad and affect the parameters of a synthesizer, for instance, for a more expressive sound.\n\nNovation says the new pads are the most sensitive it’s ever made and it’s easy to believe this claim, because they really do let you achieve\n\nAdvertisement\n\nThere are already devices on the market which let you perform in a similar way, most notably Ableton’s own Push 2 which costs well over £500 but offers is vastly more complex and offers various advanced tricks which you can’t pull off with the Launchpad.\n\nI’ve owned a Push and sold it because I’m not convinced of the wisdom of spending that much cash on a device that simply controls software and is therefore at risk of becoming totally obsolete.\n\nAt £179, I wouldn’t have the same fear about the Launchpad, which offers access to all the best bits of Live at a very affordable price.\n\nIt turns a piece of software into a real instrument and I found it easy to build up entire songs without touching the keyboard, using Launchpad to switch between synths or drums, record clips and then play them in time to produce a seamless mix.\n\nThe Launchpad X also looks good too, with bright, colourful pads which change colour to reflect the on-screen action, and is both light and sturdy.\n\nNovation’s clever design also makes it incredibly easy to use for Ableton newbies and power-users, so even if you are a little bewildered by this pretty little box of lights, you won’t be for long.\n\nIt’s a sleeker, thinner and more expressive version of a device that’s already been a huge hit, so is also a worthwhile upgrade.\n\nLaunchpad X comes highly recommended for anyone interested in making electronic music on a computer.", "description": "We try out the beguiling box of lights that will turn your computer into a highly expressive musical production machine.", "authors": ["Jasper Hamill"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/Screenshot-2019-10-15-at-12.20.30-0d31_1571138989.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-15"}