{"pub": "nymag", "url": "https://vulture.com/2019/10/does-space-drive-you-insane-we-ask-an-astronaut.html", "downloaded_at": "2019-10-09 18:27:18.481964+00:00", "title": "Can Outer Space Drive a Person Insane? Let’s Ask an Astronaut.", "language": "en", "text": "Natalie, losing it. Photo: Fox Searchlight Pictures/YouTube\n\nSpoilers for Lucy in the Sky below.\n\nHere is an incomplete list of things that Natalie Portman’s character, Lucy Cola, does in the movie Lucy in the Sky to indicate that she is totally losing it upon returning from her first two-week trip to space: dilates her pupils to unnerving effect; calmly allows her space helmet to fill up with water during a training session; rips wallpaper off her walls during a funeral; says things like, “My life looked so small from space”; hitches herself to some kind of dolly and wobbles at high speed from her house to a hospital to the sounds of “Lucy in the Sky With Diamonds”’; chants an astronaut-training checklist under her breath at inappropriate times; wears dozens of flimsy sleeveless dresses belted in the wrong spot; fucks Jon Hamm in a pickup truck; runs a lot; buys a drugstore wig that looks better than her actual hair; sprays Jon Hamm in the face with bug spray; talks to Zazie Beetz way too closely in a parking garage; and becomes a beekeeper, seemingly because it requires a suit similar to an astronaut’s.\n\nPortman’s character is very loosely based on the real-life story of Lisa Nowak, the astronaut who infamously drove cross-country in a diaper to kidnap her astronaut ex-lover’s new lover. But director Noah Hawley takes a lot of liberties with that origin story in Lucy in the Sky, rendering it nearly unrecognizable (no diapers!) by turning it into a melodramatic, hallucinatory soap opera that is, rather accidentally, laugh-out-loud funny. Critics have called the film “fascinatingly messy,” “banal,” and noted that it “flails interestingly,” but what stuck with me after the fact was its absolutely batshit depiction of an astronaut gone mad.\n\nWhen handled well onscreen, stories about mental health involve a certain sensitivity and ethos; Hawley’s film has neither, and instead is rife with kooky psychological metaphors and bizarre moments (many of which are reflected in the above list) that almost achieve camp, but fall just short. This is often the case in movies of its genre: One of Hollywood’s absolute favorite tropes is “rational person goes to space and gets fucked up,” and rarely do they get fucked up in a way that isn’t played for laughs and/or used as a shortcut for engendering profound existential horror. (In fact, retired astronaut Marsha Ivins criticized the trope — and Lucy in the Sky — back in 2018). Steve Buscemi waved a machine gun around on an asteroid in Armageddon and his fellow astronauts strapped him down and diagnosed him with “space dementia.” After years of chilling in space alone, Matt Damon tried to suffocate Matthew McConaughey on an icy planet in Interstellar, all so he could see a human face again. Tommy Lee Jones killed all of his crew members in Ad Astra and defaced several issues of National Geographic, all in the name of human progress. In this year’s Aniara, basically everyone on the spaceship goes insane, as indicated by a series of sex cults and suicides. And almost every cinematic astronaut has casually hallucinated a dead family member while floating around in zero G (George Clooney in Solaris, Sandra Bullock in Gravity, and the whole crew of Event Horizon, to name a few).\n\nWatching an unhinged Natalie Portman calmly compare having sex with Jon Hamm to being in space, I couldn’t help but wonder: How realistic is the notion that astronauts go crazy in space, or just after leaving it? Is it as common as Hollywood would have us believe, or is it merely a lazy plot device? To get a little closer to finding out, I reached out to Greg Harbaugh, a former NASA astronaut who went to space a lot and is also my friend’s dad. Yes, we did talk about diapers.\n\nFirst, tell me a bit about your career as an astronaut. What cool stuff have you done?\n\nI was a mission operations/mission control guy, an engineer, for nine years after graduating from Purdue. In ’86 I was selected to be in the astronaut class of ’87; there were over 2,000 applicants and I was one of 15 selected, and I was incredibly grateful. I was assigned fairly shortly after astronaut training, and flew my first mission in 1991, and then flew four missions in pretty rapid succession: ’91, ’93, ’95, and ’97.\n\nMy first was an eight-day mission, and I lost ten pounds. I probably averaged three hours of sleep. When I got back, I fell asleep in the shower. My second mission was my first space walk, and my third was the first rendezvous and docking with the Russian space station, Mir. We carried two Russians up with us, and they were very persnickety about how they wanted us to come in and dock. We found out later that they were still upset with what they felt was a ham-fisted docking 20 years earlier; they rammed ’em pretty good. And my last mission was the second servicing of the Hubble telescope. In total, I’ve done three space walks, four shuttle missions, and 34 days in space. And then I retired from NASA to go into the development business.\n\nIs it unusual to go that many times? A key plot point in Lucy in the Sky is that she’s desperate to go back to space, but it’s very difficult to.\n\nIt was above average, but it’s not the record. The record was seven times. I probably flew about as fast as anybody in terms of turnaround; from takeoff to touchdown, first to last mission, was around six years. I loved that. I loved going up and being up and coming back down. I did not love all the training. All the hours and hours in test chambers, underwater, upside down in your space suit, practicing for spacewalks.\n\nSo do you watch and like space movies?\n\nOh, sure. I really enjoy the good ones and I’m pretty hard on the bad ones. So an example of a good one, phenomenally good, was Christopher Nolan’s Interstellar. Deeply researched, beautifully executed. Matthew McConaughey wanting to get back home was very real. Every time I took off, my first thought was, “How is my family doing? How are my girls doing?” As much as you’re thrilled with the experience, there’s a part of you that’s looking forward to being back home. Anyway, I even wrote Christopher Nolan a note thanking him and I got a very nice note back from him. He got it. The physics was pretty legit all the way through, as out there as it was.\n\nOn the other end of the spectrum, the very bottom of the barrel, is Ad Astra.\n\nReally? Why?\n\nTerrible. I’m guessing that this movie was intended for those who think Brad Pitt is just the greatest thing since sliced bread. It’s all close-ups of Brad Pitt. But the technical aspects, the plot twists, the physics of it — it just made no sense. It was technically so far off and so stupidly done. I love to suspend disbelief with the best of them; I love Star Trek. I know there’s no such thing as the warp drive and all that. But this was ostensibly in the near future and he hopped, skipped, and jumped from Earth to the moon to Mars to Neptune, lickety-split. It was just awful.\n\nThere’s some of the “going crazy” trope in there, too. His dad goes totally crazy and kills the whole crew. Have you ever known or heard of an astronaut who’s lost it like that from being in space for so long?\n\nLet me put it this way: I have secondhand impressions of people that did not handle long-duration space flights very well … I’ve heard rumors over the years, but nothing that I can point to, and I certainly wouldn’t want that to be held for attribution by me or any of my colleagues. To my knowledge there’s not been an instance of anybody going nuts. But if I were on orbit for six or eight or ten or 12 months, I might have been the first. [Laughs.]\n\nPeople like me, short-duration people, I do well for six or eight or 10 days. I would not want to be up there for six months or a year. But there are other people who are very placid and comfortable and content with being up there for long periods of time. There’s one guy, one of the Kelly twins [Scott], who stayed up for 340 days, which NASA defined as as year — which baffles me, by the way. I always thought a year was 365 days. But anyway, we don’t know the full extent, publicly anyway, of the implications of really long duration on crew members. The idea of being in this set of tubes for months and months and months is going to have a psychological impact; underestimate that at your own peril. It’s something that NASA and other people need to pay careful attention to when we’re talking about sending people to Mars, which is baseline six months each way.\n\nIn both Ad Astra and Lucy in the Sky, there are psychological resources available to the astronauts. What sorts of resources did you have?\n\nWe didn’t have self-diagnosis [like in Ad Astra], which I thought was hokey — you can say anything to a computer. But we did spend plenty of time with our flight doctors, our flight surgeons, who became like family. They took good care of us.\n\nIn the Shuttle Era, though, psych evaluations were sort of a non-thing. I don’t think in the selection process, or anything else, there was much concern or consideration for, “Is this somebody who can work as part of a team for an extended, extended period of time?” Being a team player was important, of course, but you can pretty much work with anybody for two weeks. [Psychology] has become more prominent with longer durations. It’s become a pretty big deal now.\n\nWhat’s the general mood of astronauts toward these sort of movies, where the human psyche crumbles in space?\n\nI hesitate to speak for my colleagues, but I’ll speak for myself. Maybe it can be generalized: We pride ourselves on being very professional, so the things that come out in movies … Remember Gravity, where George Clooney zippin’ around out there in his jet pack, whizzing from here to there, like he has an infinite amount of gas in his gas tank, just being a moron? That’s the kind of thing that, to me — I know they want to make the movies interesting, but I think there’s a way to do it, as Christopher Nolan did, that’s accurate and consistent with the way things are done.\n\nNo space dementia, but there’s something we used to call ‘space stupid.’\n\nI think it’s fair to say my colleagues are pretty critical of the technical elements, and anything that reflects poorly on astronauts themselves. Over the years, going back to the Original 7 and Neil [Armstrong] carrying himself with such profound dignity after walking on the moon — there’s a standard and an expectation that you’re gonna carry yourself in a certain way and be a role model. I think everybody who’s had the good fortune of being able to go to space, we care very much about that. We don’t want it to be bastardized.\n\nBut I don’t want to imply we have sticks up our butts. We like to laugh and have fun. I had a lot of fun with Space Cowboys.\n\nThere are some specifics in Lucy in the Sky that I wanted to ask you about, to see if they ring true. After Lucy sees Earth from space, she can’t get over this idea that her real life is “too small” and she can’t get back into it. Do you relate to that?\n\nI had the exact opposite reaction. Being on orbit and being able to stand separate and apart from all that I love and care about, gave me a tremendous sense of humility and a profound gratitude that I was able to return home. At the end of my last space walk in my last mission, I remember facing the Earth, as the shuttle orbited the Earth, tail-first. In the span of my arms, I could encompass America coast to coast. It was such a profound sense of deep crystal clarity, combined with a profound sense of validation.\n\nI’ve heard people say they’d go to Mars even if it was a one-way trip. I think that’s insane. I’m so much more appreciative of how amazing our home planet and my life here is. I don’t know how to say this without sounding hokey, but music sounds better. I appreciate art more. I love being outside, mowing the grass, and being in the environment I’ve created for myself and my little plot of land. I don’t feel small at all.\n\nWhen Lucy comes back from space, her fellow astronauts talk about how their tongues feel weird for a while when they return.\n\nHow their … what?\n\nTheir tongues feel weird.\n\nTheir tongues?\n\nYeah.\n\nWhaaaaat? I have no idea where they got that from.\n\nAt one point, Lucy jealously tells her romantic rival that she’s “not allowed to fraternize” with other astronauts. Is that true?\n\nNo! No. Astronauts fraternize. They get married; Steve Hawley and Sally Ride got married, and I know others who were dating and got married.\n\nLucy gets grounded because her boss tells her she’s “too emotional.” Have you ever heard anything like that used as an excuse for grounding someone?\n\nI don’t think that’d be the right terminology, but they do go through periodic physical exams, and if there’s evidence of some instability, I think people can be grounded. I don’t know if they’d be even told to their face, “Here’s why you’re not flying.” More likely they just wouldn’t get the next assignment they’re expecting.\n\nI will say: One of the things that’s extremely important on orbit is predictability. If somebody shows signs of being unpredictable; like they might get a bright idea and go do something on their own — that’s not what you want.\n\nRelated to that line, there’s also a through line of sexism in the film; Lucy feels she’s unfairly treated as a woman in the space program. Did you ever notice anything like that?\n\nI would say 100 percent no. I’ve never seen any behavior that would indicate sexist activity at all. The female colleagues I worked with were some of the most impressive, talented, and capable, even intimidating human beings I’ve ever known. I loved working and flying with the women I had the chance to fly with. The people brought into this program are so spectacular.\n\nNow, you’re asking a white male — what do I know? Apparently I’m not qualified to talk about this sort of stuff … I’d say that was the consensus view among the women in my era, but I don’t know what somebody else’s experience is.\n\nDid you wear diapers in space?\n\nNot on orbit, no. Just for launch and entry. The reason for that is, you get up in the morning, you have a couple cups of coffee, breakfast, whatever, then you suit up and you’re in your launch and entry suit for several hours before you launch. They found with Alan Shepherd — he wasn’t wearing a diaper and he had to go. So he went!\n\nOn orbit, you have a potty; if you have to go, you use the potty. It’d be dumb to walk around in a diaper. That might be a reason to ground a guy. [Laughs.]\n\nIn Armageddon, Steve Buscemi goes crazy and gets “space dementia.” Have you ever heard that terminology?\n\nNo space dementia, but there’s something we used to call “space stupid.” It’s just when you first get used to being on orbit, it feels like your brain slows down a little bit. You can’t think as quickly and as clearly; it’s part of the adaptation process. Your brain needs to wire itself a little differently.\n\nAnother trope you see a lot of is people hallucinating their dead family members while in space. Any experiences with that?\n\nUh, I’m not aware of anybody doing that.\n\nWhile I have you here: What do you think about aliens?\n\nI’m really curious about all of the stuff that seems to be coming out now. My problem with it, frankly, is the laws of physics. What Einstein said about not being able to travel faster than the speed of light. It would take hundreds of thousands of years — how are these aliens getting here so expeditiously? I can’t figure out how that would even be possible. I’m not saying it isn’t.\n\nPart of me also says that it’s gotta be egotistical to think that we’re the only beings in the universe. But it could very well be the case! Maybe we are totally alone. I tend to be skeptical, but I’m optimistic. I just hope when the day comes that we do have a close encounter, that they’re kind and friendly. If they’ve mastered interplanetary travel, chances are good that they could wipe us out in short order.\n\nThis interview has been condensed and edited for clarity.", "description": "In Lucy in the Sky, Natalie Portman totally loses her mind, in the tradition of several movie astronauts before her. We ask a real astronaut to weigh in.", "authors": ["Rachel Handler"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/03/03-lucy-in-the-sky-natalie-portman.w1200.h630.jpg", "published_at": "2019-10-09"}