{"pub": "businessinsider", "url": "https://businessinsider.com/bombings-at-afghan-mosque-kill-dozens-during-friday-prayers-2019-10", "downloaded_at": "2019-10-19 11:38:56.006632+00:00", "title": "Multiple bombs at Afghanistan mosque during Friday prayers kill 62, injure at least 100", "language": "en", "text": "Explosions at a mosque in Afghanistan's Nargarhar province killed 62 and injured at least 100 during Friday prayers.\n\nNo group has taken responsibility for the attack yet, but the Afghan government has blamed Taliban insurgents. The Taliban denied responsibility.\n\nBoth the Taliban and ISIS-Khorasan province (ISIS-K) are active in Nargarhar province, near the border with Pakistan.\n\nVisit Business Insider's home page for more stories.\n\nKABUL (Reuters) - Multiple explosions at a mosque in eastern Afghanistan collapsed the roof on worshippers during Friday prayers, killing at least 62 and wounding more than 100, officials said.\n\nAttaullah Khogyani, spokesman for Nangarhar province's governor, said bombs had been placed inside the mosque in the Jawdara area of Haska Mena district.\n\n\"People using an excavator are still working to bring out the bodies and injured from under the roof,\" said Sohrab Qaderi, a member of the provincial council in Nangarhar, adding that the death toll was likely to rise.\n\nMalik Mohammadi Gul Shinwari, a tribal elder from the area, said that the mosque had been destroyed.\n\n\"It was a heartbreaking scene I witnessed,\" Shinwari said.\n\nNo group immediately claimed responsibility but the government accused Taliban insurgents, who are fighting to reimpose strict Islamic law after their 2001 ouster by US-led forces.\n\nSediq Sediqqi, spokesman for the presidential palace, condemned what he said was a suicide bomb attack.\n\n\"The Taliban and their partners' heinous crimes continue to target civilians at the time of worship,\" Sediqqi added.\n\nSuhail Shaheen, a spokesman for the Taliban, denied responsibility.\n\n\"All witnesses say it was a mortar attack by Kabul Adm.(Administration) forces,\" he said in a tweet.\n\nThe Taliban and Islamic State fighters are actively operating in parts of Nangarhar which shares a border with Pakistan in the east.\n\nIn western Herat province, six civilians were killed and five wounded when their vehicle was hit by roadside bomb, Jailani Farhad, spokesman for the provincial governor, said. Women and children are among the victims, Farhad added.\n\nA UN report recorded 4,313 civilians killed and wounded in Afghanistan in the past three months.\n\n(Reporting by Abdul Qadir Sediqi in Kabul, Ahmad Sultan and Rafiq Sherzad in Nangarhar; Editing by Nick Macfie)", "description": "Officials have said that they are still pulling bodies from the mosque and the death toll is likely to rise.", "authors": [], "top_image": "https://image.businessinsider.com/5da9e57f4af90947cf66ebb9?width=1200&format=jpeg", "published_at": "2019-10-18"}