{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/chile-protests-sebastian-pinera-cabinet-resign-santiago-inequality-latest-a9173066.html", "downloaded_at": "2019-10-28 00:33:16.759344+00:00", "title": "Chile protests: President to sack entire cabinet after more than one million people take to streets", "language": "en", "text": "Chile's president Sebastian Pinera has asked all his cabinet members to resign and promised reforms as he attempts to restore control after a wave of mass protests.\n\nThe conservative leader has struggled to manage widespread unrest that has gripped his country this week amid anger over inequality.\n\nAt least 20 people have been killed since rioting broke out in response to a four per cent cent rise in subway fares earlier this month.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAfter 1.2 million people marched peacefully against the government in the capital Santiago yesterday, Mr Pinera said: “We have all heard the message. We have all changed.”\n\nProtesters have been calling for improved pay, pensions, schools, housing and medical care, among other demands, with many arguing Chile's wealthy have grown richer while poorer people struggle.\n\nShape Created with Sketch. Subway suspended as riots grow in Chile's capital Show all 12 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Subway suspended as riots grow in Chile's capital 1/12 Demonstrators clash with riot police during a protest AFP/Getty 2/12 A demonstrator is arrested by Chilean riot police during a protest in downtown Santiago AFP/Getty 3/12 Demonstrators clash with riot police during a protest in downtown Santiago AFP/Getty 4/12 Subway services in Santiago were suspended after activists jumped turnstiles, dodged fares and vandalised stations AFP/Getty 5/12 Police who had been trying to break up the protests with tear gas withdrew from some subway stations AFP/Getty 6/12 Demonstrators run away from tear gas during clashes with riot police at the Bellas Artes metro station AFP/Getty 7/12 School and university students joined a mass fare-dodging protest in Santiago's metro AFP/Getty 8/12 A riot police throws a tear gas canister to demonstrators during clashes AFP/Getty 9/12 Riot police stand next to a burning barricade following a mass fare-dodging protest in downtown Santiago AFP/Getty 10/12 Chile's President Sebastian Pinera declared a state of emergency early on Saturday AFP/Getty 11/12 A protester kicks back a tear gas canister during clashes with riot polic AFP/Getty 12/12 Demonstrators clash with riot police following a mass fare-dodging protest AFP/Getty 1/12 Demonstrators clash with riot police during a protest AFP/Getty 2/12 A demonstrator is arrested by Chilean riot police during a protest in downtown Santiago AFP/Getty 3/12 Demonstrators clash with riot police during a protest in downtown Santiago AFP/Getty 4/12 Subway services in Santiago were suspended after activists jumped turnstiles, dodged fares and vandalised stations AFP/Getty 5/12 Police who had been trying to break up the protests with tear gas withdrew from some subway stations AFP/Getty 6/12 Demonstrators run away from tear gas during clashes with riot police at the Bellas Artes metro station AFP/Getty 7/12 School and university students joined a mass fare-dodging protest in Santiago's metro AFP/Getty 8/12 A riot police throws a tear gas canister to demonstrators during clashes AFP/Getty 9/12 Riot police stand next to a burning barricade following a mass fare-dodging protest in downtown Santiago AFP/Getty 10/12 Chile's President Sebastian Pinera declared a state of emergency early on Saturday AFP/Getty 11/12 A protester kicks back a tear gas canister during clashes with riot polic AFP/Getty 12/12 Demonstrators clash with riot police following a mass fare-dodging protest AFP/Getty\n\nMr Pinera said he had put all his ministers \"on notice\" ahead of a cabinet reshuffle to \"confront these new demands and take charge of the new times.” He did not say when he would appoint new ministers.\n\nThe president as also responded to the protests by raising pensions and the minimum wage, as well as revoking the subway fare hike.\n\nA state of emergency that has covered much of the country for the past nine days could soon also be lifted.\n\nAlthough protests have largely been peaceful, some demonstrations have erupted into rioting and looting and police have been accused of violently cracking down on demonstrators.\n\nEarlier this week, the UN High Commissioner for Human Rights said a team would be sent to Chile to investigate allegations of human rights abuses against protesters.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nMichelle Bachelet, a former president of Chile, said “parliamentarians and the government have both expressed a desire for a UN Human Rights mission.”\n\nThe independent National Human Rights Institute has said that since the state of emergency went into effect, 3,162 people have been detained and 997 injured.\n\nPoliticians from both the ruling party and opposition have called for ministerial change to re-establish the government’s credibility.\n\nAndres Chadwick, the interior minister who has overseen the police response to the protests, is among the most controversial cabinet members.\n\nIn Santiago, one protester, Pablo Rodriquez, described Mr Pinera’s steps so far as “a good start” but insufficient.\n\nAnother Chilean, supermarket employee Yolanda Jerez, told the Associated Press that she supported the moves announced.\n\n“The president's announcements are great because we are expecting changes and they have to start with something,” she said.\n\nChile is one of the richest countries in Latin America but also the most unequal in the OECD group of high-income developed countries.\n\nAdditional reporting by AP", "description": "Chile's president Sebastian Pinera has asked all his cabinet members to resign and promised reforms as he attempts to restore control after a wave of mass protests. The conservative leader has struggled to manage widespread unrest that has gripped his country this week amid anger over inequality. At least 20 people have been killed since rioting broke out in response to a four", "authors": ["Conrad Duncan"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/27/12/chile-protests.jpg", "published_at": "2019-10-27"}