{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7557817/Hong-Kong-shares-end-firmer-reports-fuel-trade-deal-hopes.html", "downloaded_at": "2019-10-10 08:34:09.729178+00:00", "title": "Hong Kong shares end firmer as reports fuel trade-deal...", "language": "en", "text": "HONG KONG, Oct 10 (Reuters) - The Hong Kong stock market closed higher on Thursday on hopes that Beijing and Washington could reach a partial deal, but gains were limited after a media report cited that this week's high-level trade negotiations could cut short.\n\n** At the close of trade, the Hang Seng index was up 0.1% at 25,707.93 points, while the Hang Seng China Enterprises index closed 0.5% higher. ** The sub-index of the Hang Seng tracking energy shares ended up 0.2%, the IT sector climbed 0.8%, the financial sector dipped 0.2% lower and the property sector lost 0.7%. ** The White House is weighing a currency pact with China as part of a partial deal that could see a planned tariff hike next week being suspended and part of what it regards as a first-phase agreement with Beijing, Bloomberg cited people familiar with the talks as saying on Wednesday. ** U.S. President Donald Trump said on Wednesday there was a very good chance that the United States and China will reach a trade agreement, but added that \"in my opinion China wants to make a deal more than I do\". ** The United States and China made no progress in deputy-level trade talks held on Monday and Tuesday in Washington, the South China Morning Post (SCMP) said, citing unnamed sources with knowledge of the meetings. ** The report also stated that the Chinese delegation, headed by Vice Premier Liu He, is planning to leave Washington on Thursday after just one day of minister-level meetings. ** Hong Kong protesters prepared for demonstrations around the city on Thursday as shopping malls said they would close early to avoid becoming targets and the city's metro, which has borne the brunt of the violent unrest, will close three hours early. ** About 1.43 billion Hang Seng index shares were traded. The volume traded in the previous trading session was 1.59 billion. ** At close, China's A-shares were trading at a premium of 30.48% over Hong Kong-listed H-shares. (Reporting by Noah Sin, Editing by Sherry Jacob-Phillips)", "description": "HONG KONG, Oct 10 (Reuters) - The Hong Kong stock market  closed higher on Thursday on hopes that Beijing and Washington  could reach a partial deal, but...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-10"}