{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7581753/Jennifer-Aniston-shares-Ross-Rachel-break.html", "downloaded_at": "2019-10-16 23:44:54.302538+00:00", "title": "Jennifer Aniston shares that Ross and Rachel are 'on a break'", "language": "en", "text": "Jennifer Aniston is setting the record straight.\n\nAfter she broke the Internet with an Instagram selfie with her Friends cast-mates, former Bachelorette Kaitlyn Bristowe asked a burning fan question.\n\n'ARE YOU AND ROSS STILL TOGETHER!!!???' commented Kaitlyn, 34, prompting Jennifer, 50, to respond: 'well we're on a break.'\n\n'well we're on a break': After Jennifer Aniston broke the Internet with an Instagram selfie with her Friends cast-mates, she answered a burning fan question from Kaitlyn Bristowe\n\nJennifer joined Instagram on Tuesday with a selfie of the Friends cast at dinner - her, David Schwimmer, Courteney Cox, Lisa Kudrow, Matthew Perry and Matt LeBlanc.\n\nDavid and Jennifer won viewers' hearts on Friends as the on-off couple Ross and Rachel, who eventually have a baby daughter called Emma.\n\nTheir heartrending season three split comes after Rachel suggests they take a 'break' - which Ross misinterprets as permission to sleep with another woman.\n\nWhenever the incident comes up, even years later, Ross pulls out the excuse: 'We were on a break!' which has now become something of a catchphrase.\n\nThe One The Morning After: Their heartrending season three split comes after Rachel suggests they take a 'break' - which Ross misinterprets as permission to sleep with another woman\n\nThe show ended in 2004 after 10 seasons on the air at NBC, and in the series finale, Ross and Rachel finally mend fences and get back together.\n\nWhen Jennifer joined Instagram she became the fastest person ever to get a million followers, passing up the Duke and Duchess of Sussex' joint account.\n\nJennifer took only five hours and 16 minutes, the Guinness Book Of World Records announced in a press release this Wednesday.\n\nSo many millions of fans liked Jennifer's Friends selfie, and so many people tried to follow her at once, that her page broke.\n\nReunion: The show ended in 2004 after 10 seasons on the air at NBC, and in the series finale, Ross and Rachel finally mend fences and get back together\n\nShe poked fun at the situation on Wednesday by posting a clip of herself in character as news anchor Alex Levy on her upcoming Apple+ drama The Morning Show.\n\nIn the clip, Alex sits in her hair and makeup chair and fiddles about with her phone, before getting exasperated, slamming it on the table and tossing it aside.\n\n'I swear I didn’t mean to break it... Thank you guys for the kind, glitchy welcome,' wrote Jennifer with a heart emoji in her caption.\n\nBreaking the Internet: She poked fun at her glitching page on Wednesday by posting a clip of herself in character as news anchor Alex Levy on her upcoming show The Morning Show\n\nJennifer swung by The Howard Stern Show last week and shared that she had 'just had dinner' with her Friends co-star - possibly the occasion she put on Instagram.\n\nShe shared that they dined at Courteney's house, saying: 'Oh my God, we laughed so hard,' and that their onscreen team-up was 'lightning in a bottle.'\n\nJennifer, who has followed her second ex-husband Justin Theroux on Instagram, also said of their working experience on Friends: 'We all miss it everyday.'", "description": "Jennifer Aniston is setting the record straight.", "authors": ["Sameer Suri For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/00/19812712-0-image-a-15_1571267651277.jpg", "published_at": "2019-10-16"}