{"pub": "mirror", "url": "https://mirror.co.uk/money/london-stock-exchange-stay-british-20534605", "downloaded_at": "2019-10-08 09:36:57.959784+00:00", "title": "London Stock Exchange to stay British as takeover bid from Hong Kong dropped", "language": "en", "text": "Get the biggest money stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHong Kong Exchanges and Clearing has dropped its £32 billion takeover approach for the London Stock Exchange Group (LSE).\n\nHKEX's cash-and-shares proposal would have seen it pay around £8.36 a share for LSE - which values it at around £29.6 billion or £31.6 billion including debt.\n\nLSE's board has unanimously rejected the offer to merge the two firms.\n\n\"The Board has fundamental concerns about the key aspects,\" LSE said in a statement last month.\n\n\"Accordingly, the Board unanimously rejects the Conditional Proposal and, given its fundamental flaws, sees no merit in further engagement.\"\n\nHKEX said it would not be making a firm offer for the LSE after being left \"disappointed\" that it had not been able to enter talks with LSE management.\n\n(Image: REUTERS)\n\nHKEX said: \"The board of HKEX continues to believe that a combination of LSE and HKEX is strategically compelling and would create a world-leading market infrastructure group.\n\n\"Despite engagement with a broad set of regulators and extensive shareholder engagement, the board of HKEX is disappointed that it has been unable to engage with the management of LSE in realising this vision, and as a consequence has decided it is not in the best interests of HKEX shareholders to pursue this proposal.\"\n\nHKEX's said the move to merge the two companies would create a \"global market infrastructure leader\".\n\nIt's not the first time HKEX has cast its eyes to London, having bought the London Metal Exchange in 2012.", "description": "After resistance from the board, a mega-bid from Hong Kong to take over London Stock Exchange has been dropped", "authors": ["James Andrews", "Image", "Getty", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article11982387.ece/ALTERNATES/s1200/London-Stock-Exchange-headquarters-in-London.jpg", "published_at": "2019-10-08"}