{"pub": "cbs", "url": "https://cbsnews.com/news/corporations-and-guns-how-companies-are-reshaping-the-gun-control-debate", "downloaded_at": "2019-10-07 00:13:08.924755+00:00", "title": "Corporations and guns: How companies are reshaping the gun control debate", "language": "en", "text": "Overseeing more than 720 stores in 47 states, Ed Stack, the CEO of Dick's Sporting Goods, has a multi-billion-dollar empire to run. But Stack is now balancing running a business with his new role as one of the corporate faces of America's gun control debate.\n\n\"I don't understand how somebody, with everything that's gone on, could actually sit there and say, 'I don't think we need to do a background check on people who buy guns.' It's just, it's ridiculous,\" he said.\n\nIt's a pretty controversial stand from a company that's been in the gun business a long, long time. His father, Richard Stack, started Dick's Bait and Tackle in Binghamton, New York in 1948. He used a $300 loan from his grandmother's cookie jar to do it. He was just 18. These days he'd probably hardly recognize the place – it's grown from that one tiny location into a nationwide chain, with some stores that are big enough to house the Space Shuttle.\n\nAs Dick's grew, it became one of the biggest sellers of firearms. Until, that is, 2012, when a gunman opened fire at Sandy Hook Elementary School in Newtown, Connecticut.\n\nEd Stack, CEO of Dick's Sporting Goods. CBS News\n\n\"All we were going to do was just take it off the shelf and not say anything,\" said Stack.\n\nThe \"it\" he's talking about is the AR-15, a lightweight semi-automatic modern sporting rifle similar to the one used in the Sandy Hook massacre. He ordered all of them be removed from every Dick's Sporting Goods store across the country.\n\n\"We probably get a little bit of a backlash, but we didn't expect to get what we got,\" he said. \"All this about, you know, how we were anti-Second Amendment, you know, 'we don't believe in the Constitution,' and none of that could be further from the truth. We just didn't want to sell the assault-style weapons that could inflict that kind of damage.\"\n\nWhat Dick's did, didn't stop mass shootings; they were uncomfortably numerous after Sandy Hook. But when a shooting happened at Marjory Stoneman Douglas High School in Parkland, Florida in 2018, it hit closer to Stack than it ever had.\n\n\"We found out that we sold this kid a shotgun,\" Stack said. \"That's when I said, 'We're done.'\"\n\n\"Even though that wasn't the gun he used?\" asked Cowan.\n\n\"Even though it wasn't the gun he used. It could have been.\"\n\nEver since Parkland, he and his wife, Donna, have been weighing the moral implications of continuing to sell firearms at all. They even took a trip to Florida to meet with Parkland survivors.\n\nDonna recalled, \"You're speechless for a second, because you can't even imagine the pain and the suffering that they're going through. You like just walk in, and I just wanted to hug all of them. It was hard.\"\n\nThe experience moved Stack's stand again guns one step further. He announced he would no longer sell any firearm to anyone under the age of 21 – a move many inside the company warned would surely drive off sales. And it did.\n\nCowan asked, \"How much did you think you were going to lose?\"\n\n\"A quarter of a billion dollars,\" Stack replied.\n\n\"And how much did you actually lose?\"\n\n\"About a quarter of a billion! Pretty close.\"\n\nOn top of that, the assault-style rifles he still had in stock – about $5 million worth of inventory – he turned into scrap metal.\n\n\"I said, 'You know what? If we really think these things should be off the street, we need to destroy them,'\" he said.\n\nDianna Muller served in the Tulsa Police Department for 22 years, and is now an award-winning professional shooter. When \"Sunday Morning\" caught up with her she was competing at the Rock Castle Shooting Center in Park City, Kentucky. It was ladies only, a shooting league called A Girl and a Gun.\n\nOf the move by Dick's Sporting Goods she said, \"If they don't want guns, that's their right. It feels really anti-American to start creating public policy through corporate policy.\"\n\nGun rights advocate Dianna Muller. CBS News\n\nMuller has become a high-profile spokesperson for the gun rights movement. She's testified on Capitol Hill about carrying a firearm, specifically an AR-15.\n\nThat's the very rifle that Dick's is no longer selling.\n\nCowan asked, \"Is it a fair question to ask why you need a gun like that?\"\n\n\"No,\" Muller replied.\n\n\"Because?\n\n\"This rifle, and any other rifle, kills fewer people than hammers and blunt objects every year, according to FBI statistics,\" she said, \"so it doesn't make any sense to me that this is going to solve the problem that we are having.\"\n\nHer worry is the same that the National Rifle Association has voiced for a long time: if one gun like the AR-15 is demonized, then all guns may soon follow.\n\n\"It leads me to believe that there's going to be another tragedy with a different gun, that they're going to come after the next gun,\" she said.\n\n\"This is the slippery slope?\" Cowan asked.\n\n\"Until it's all gone.\"\n\nDick's and others insist they're not coming for everyone's guns – but they so want common-sense gun reform – and last month chief executives from nearly 150 companies took the unprecedented stop of signing a very public letter to Senate leaders urging them to do just that.\n\nFormer New York City Mayor Mike Bloomberg, who invested millions of his own money to form the non-profit Everytown for Gun Safety, is well aware of the pushback coming from the NRA and others.\n\n\"We evolve, and a lot of things we do today, we wouldn't have done before,\" he said.\n\nBut he sees what corporate America is doing as aligning itself with the public polling on guns.\n\nCowan asked, \"There are some critics, though, who say corporate American shouldn't be sitting in for the government. That these aren't people that are elected.\"\n\nFormer New York City Mayor Michael Bloomberg. CBS News\n\n\"Couldn't agree more,\" Bloomberg said. \"But I think the people that say corporate America shouldn't be setting the social policies for the country are right, but corporate America should certainly do some input. They have rights as well.\"\n\nFour years ago, Walmart announced it would stop selling assault-style rifles, and after a mass shooting in one of its own stores in El Paso this past August, stopped the sale of that kind of ammunition, too.\n\nCVS, Kroger and Walgreens, among other major retailers, joined Walmart in asking their customers not to openly carry guns into their stores, even in states where that's legal.\n\nSome in the financial sector got involved, too, including Bank of America that said it would stop lending money to certain gun makers.\n\nCowan asked Bloomberg, \"Do you sense, now with impeachment in the air, and everything else, that anything is going to get done on gun control anytime soon?\"\n\n\"You know, a crisis is too important to waste,\" he replied. \"And maybe during this time, they will do some things that they would have never have done before just because they want to divert attention.\"\n\nStranger things have happened, but he's not holding his breath.\n\nLast February, the House passed legislation that would broaden federal background checks for firearms purchases. But President Trump has wavered on just what he would actually sign into law. The bill is on Senator Mitch McConnell's desk.\n\nWhich suits Dianna Muller just fine. She said, \"Just because Congress isn't doing anything, they're standing up for me, and making legislation based on what I sent them to Washington D.C. for – not what feels good, or what the masses may want.\"\n\nNevertheless, Stack isn't waiting. In fact, he may go even further. He's already removed all guns from more than 100 of his stores, and is considering expanding that ban chain-wide. \"We've got the whole category under strategic review to see what we're going to do with this category,\" he said.\n\n\"So, there's a chance you may stop selling firearms completely?\" asked Cowan.\n\n\"The whole category is under strategic review.\"\n\n\"That sounds like a maybe?\"\n\n\"The whole category is under strategic review,\" Stack laughed.\n\nHe's not going to show all his cards. What he does know is that Dick's Sporting Goods is changing – and he's counting on the culture changing right along with it.\n\n\"So many people say to me, you know, 'If we do what you want to do, it's not going to stop these mass shootings,'\" said Stack. \"And my response is, 'You're probably right, it won't. But if we do these things and it saves one life, don't you think it's worth it?'\"\n\n\n\nFor more info:\n\n\n\nStory produced by Michelle Kessel.", "description": "While Congress and the White House have resisted increasing restrictions on gun purchases, companies like Dick's Sporting Goods and Walmart are now taking the lead in curtailing sales of firearms or ammunition", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/10/06/7978c38f-1e5e-413d-8151-349ed04c01ab/thumbnail/1200x630/fe9f2a2e5ed625f99ea7d711e3d89805/gun-sales-promo.jpg", "published_at": "2019-10-06"}