{"pub": "arirang", "url": "https://arirang.com/News/News_View.asp?nseq=245238", "downloaded_at": "2019-10-05 13:16:46.122640+00:00", "title": "News View :: The World On Arirang", "language": "en", "text": "From Saturday, protesters in Hong Kong will be prohibited from covering their faces in any way at both unauthorized rallies and those approved by the police.Those who refuse to remove a face cover for identification are punishable by up to six months in jail.This is part of the Emergency Regulations Ordinance that Hong Kong's leader Carrie Lam announced on Friday, a law that she claims will stop the escalation of violence and help restore calm and order.\"We believe that the new law will create a deterrent effect against masked, violent protesters and rioters and will assist the police in its law enforcement.\"In response to this emergency power, invoked for the first time in more than 50 years, thousands of pro-democracy protesters gathered in the city center on Friday to voice their opposition.Protesters marched while wearing masks, carrying umbrellas and shouting \"Hong Kong people, resist.\"\"It won't cease or slow down the protest. Because the more laws or bills that doesn't make sense that they have to put forward you see what happened three months ago. More and more people will be coming out and step out to fight for their freedom and freedom of speech.\"The ban followed a violent rally in the city on China's National Day which resulted in a teenager being shot by a police officer.Pro-democracy lawmakers in Hong Kong condemned Lam's decision to call upon the use of emergency powers, calling it a \"totalitarian tactic\".They warned that enforcing the law would only fuel the public's anger.Hong Yoo, Arirang News.", "description": "한국을 대표하는 글로벌 방송! The World On Arirang!", "authors": ["The Korea International Broadcasting Foundation"], "top_image": "http://www.arirang.com/arirang_blue.png", "published_at": "2019-10-05"}