{"pub": "townhall", "url": "https://townhall.com/tipsheet/juliorosas/2019/10/08/asylum-seekers-escorted-by-julián-castro-across-the-border-told-to-stay-mexico-n2554343", "downloaded_at": "2019-10-08 15:49:32.591445+00:00", "title": "Asylum Seekers Escorted By Julián Castro Across the Border Were Returned to Mexico", "language": "en", "text": "The asylum seekers who were escorted across the southern border by presidential candidate Julián Castro were told by U.S. officials they had to stay in Mexico as their claims are being processed.\n\nThe group of asylum seekers were made up of eight gay and lesbian immigrants from Cuba, Guatemala, and Honduras, and one deaf woman from El Salvador with her three relatives, according to the Los Angeles Times.\n\nThe group crossed a bridge and were stopped by Customs and Border Protection officials. They were able to cross into the United States to speak with a supervisor. It was later revealed they had been sent back to wait for their cases to be processed.\n\nPresident Trump's administration implemented the \"Remain in Mexico\" policy at the beginning of 2019. Initially, officials said individuals who were at extreme risk of being harmed would be exempt from the policy and would be allowed into the United States.\n\nUPDATE: hours after we were told LGBT and disabled asylum seekers would have their cases heard, they have been returned to Mexico.\n\n\n\nBy law, these migrants are supposed to be exempt from the Remain in Mexico policy—but @CBP had decided to ignore their due process. Outrageous. https://t.co/bLaThZMNFJ — Julián Castro (@JulianCastro) October 7, 2019\n\nThe group's lawyers issued a statement on their clients' return to Mexico, calling the incident a \"brutal blow to due process.\"\n\nThe 12 asylum seekers our attorneys, advocates, and Secretary Julian Castro escorted to the Gateway International Bridge of Matamoros and Brownsville this morning have been sent back into Mexico. — Texas Civil Rights Project (@TXCivilRights) October 7, 2019\n\n\"Their claims to exemptions to the 'Remain in Mexico' policy have been rejected by Brownsville CBP, who have broad discretion over the matter. This is a brutal blow to due process. These 12 people have been in CBP custody for 3 hours, which means that each person had less than 15 minutes for their non-refoulement interviews,\" the Texas Civil Rights Project said.\n\n\"As soon as the reporters left to file their stories, CBP released the asylum seekers back into Mexico, where they face persecution in an open-air encampment where thousands from countries the U.S. has destabilized are forced to survive indefinitely,\" they continued. \"We will be sure to respond to CBP’s complete lack of disregard to due process by demanding transparency and answers on what it will take for CBP to follow its own policy.\"", "description": ".10/08/2019 11:47:30AM EST.", "authors": ["Julio Rosas", "Cortney O'Brien", "Guy Benson", "Timothy Meads"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/248/556c5a09-22ff-47ad-a406-ea1c43e0aae4.png", "published_at": "2019-10-08"}