{"pub": "investingcom", "url": "https://ng.investing.com/news/forex-news/forexcautious-trade-optimism-offers-some-support-for-dollar-54905", "downloaded_at": "2019-09-23 01:35:22.873681+00:00", "title": "FOREX-Cautious trade optimism offers some support for dollar", "language": "en", "text": "© Reuters. FOREX-Cautious trade optimism offers some support for dollar\n\n* U.S., Chinese negotiations describe talks in positive\n\nterms\n\n* Yen sold, Aussie and kiwi rally\n\n* Moves slight as caution abounds\n\nBy Tom Westbrook\n\nSINGAPORE, Sept 23 (Reuters) - The dollar was supported on\n\nMonday, with the market's risk appetite delicately balanced\n\nafter talks in Washington between U.S. and Chinese trade\n\ndeputies were described as \"productive\".\n\nThe greenback gained against the safe-haven yen, but edged\n\nlower versus trade-exposed currencies, such as the Australian\n\nand New Zealand dollars, which rallied on the cautious risk-on\n\nmood.\n\nMoves were relatively slight, however, with volumes dampened\n\nby a public holiday in Japan and by the anticipation that\n\ncentral banks on both sides of the Tasman Sea will sound dovish\n\nin scheduled remarks this week.\n\n\"I think there's still a lot of nervousness around,\" said\n\nShane Oliver, chief economist at AMP Capital in Sydney, citing\n\nMiddle East tensions and the whipsawing fortunes of the\n\nU.S-China trade dispute as key drivers.\n\n\"These things have a habit of escalating and de-escalating\n\nand then escalating again...it is a bit finely balanced at the\n\nmoment,\" he said.\n\nThe dollar rose a touch over 0.1% to buy 107.70 Japanese yen\n\n. It gave up the roughly same amount of ground to the\n\nAustralian and New Zealand dollars, trading at $0.6768 on the\n\nAussie AUD=D3 and $0.6268 to the kiwi NZD=D3 .\n\nAgainst a basket of currencies the dollar was mostly\n\nflat at 98.500 and it held steady at $1.1017 per euro .\n\nThe British pound held at $1.2476 after dropping from\n\na two-month high on Friday when Ireland's foreign minister said\n\nBritain and the European Union were not yet close to a Brexit\n\ndeal.\n\nA U.S.-China trade breakthrough had seemed unlikely after\n\nPresident Donald Trump told reporters on Friday he was \"not\n\nlooking\" for a partial deal, and Chinese officials then\n\ncancelled goodwill visits to U.S. farmers. But both sides later published positive statements, with the\n\nU.S. Trade Representative's office describing the talks as\n\n\"productive\" and China's Commerce Ministry calling them\n\n\"constructive.\" October's high-level talks remain on track.\n\nChina's yuan CNH= strengthened 0.2% to 7.1025 per dollar\n\nin offshore trade, though few are expecting much of a rally or\n\nfor the mood to hold should any signs of doubt emerge over a\n\nbreakthrough in U.S.-China trade negotiations.\n\n\"At some point the fundamentals will take over,\" said Mathan\n\nSomasundaram, a strategist at brokerage Blue Ocean Equities in\n\nSydney. \"(The talks) are bringing back a bit of risk-on...but I\n\nthink we will be in a bit of a holding pattern waiting to see.\"\n\nSeptember manufacturers' surveys in Europe and the United\n\nStates due later on Monday are also likely to provide the latest\n\ninsight into the state of a world economy hit by slowing global\n\ndemand and the trade war.\n\nThe Chicago Fed National Activity Index is also due, while\n\nNew York Fed President John Williams makes a scheduled speech\n\nafter the central bank on Friday said it plans more intervention\n\nin the U.S. funding market to bolster dollar liquidity.\n\n(Editing by Jacqueline Wong)", "description": "FOREX-Cautious trade optimism offers some support for dollar", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC0O0HA_L.jpg", "published_at": "2019-09-23"}