{"pub": "washingtonpost", "url": "https://washingtonpost.com/science/2019/10/02/woman-posted-videos-herself-hopping-fence-approach-zoo-lion-police-want-word", "downloaded_at": "2019-10-02 12:48:50.484214+00:00", "published_at": "2019-10-02", "title": "A woman posted videos of herself hopping a fence to approach a zoo lion. Police want a word.", "language": "en", "text": "“I REALLY HAVE NO FEAR OF NOTHING BREATHING‼️” a caption on one of the woman’s videos declares.\n\nAD\n\nCommenters chimed in with disapproval and derision.\n\n“Please don’t cross barriers for videos,” one wrote. “I’m so glad your CARELESS actions didn’t harm this animal,” said another.\n\nAD\n\nThe Bronx Zoo seemed equally aghast. It says it received a report on Saturday that someone had climbed over a “visitor safety barrier” at its African lion exhibit.\n\n“This action was a serious violation and unlawful trespass that could have resulted in serious injury or death,” the zoo said in a statement, adding that it has a “zero tolerance policy” for such behavior.\n\nNew York police are investigating. As of Tuesday night no arrest had been made, according to a department statement.\n\nAD\n\nThe Washington Post could not reach the unidentified woman in the videos for comment, and zoo spokesman Max Pulsinelli declined to provide more information on the incident Tuesday.\n\nHow the woman ended up leaving the lion exhibit is unclear. Videos suggest her fence-hop elicited alarm but little immediate action from bystanders.\n\nAD\n\n“Can you tell her to get back?” an onlooker asks well after the woman began gesturing toward the lion, which stands mostly still after taking a couple of steps in her direction.\n\n“It’s probably not safe,” another adds.\n\n“I told her; she don’t listen to me,” a man responds.\n\nPeople visiting the New York zoo later this week were similarly concerned by the rogue woman’s actions. Some worried that her misconduct could have repercussions for future guests.\n\nAD\n\n“At this exhibit, there’s low walls, so you want to get close enough to see what’s going on, but you don’t want to have these high fences in front of all the exhibits,” one man, John Rubbo, told CBS New York. “It takes the fun out of the zoo.”\n\nStories abound of overeager visitors whose quests to get closer to zoo animals have landed them in trouble.\n\nJust last week, a North Dakota woman pleaded guilty to trespassing after jumping a rail to touch an ape and take a selfie; she received a $300 fine and about a year of probation. The Bronx Zoo, too, has seen other incidents of guest trespass — sometimes with dire consequences.\n\nAD\n\nBack in 2012, a 25-year-old was mauled after leaping from a monorail train into the den of a Siberian tiger, according to NBC New York. Staff rescued the man after distracting the animal with fire extinguishers — but not before the visitor suffered wounds to his arms, legs and back in addition to broken bones seemingly suffered from his jump.\n\nAD\n\nMore recent incidents at the Bronx Zoo have been less grisly. In 2016, police detained two people over two days for venturing into off-limits areas, CBS New York reported. One man climbed a railing toward a snow leopard enclosure, while a woman blew past signs to the back of an exhibit to take photos, police told the news station.\n\nThe woman received a court summons for trespass, according to police. The man did not face charges — though he did lose his season pass.\n\nRead more:\n\nSome of America’s top zoos still use bullhooks on elephants. That’s about to change.\n\nViolent hailstorm kills rare African vulture brought to the U.S. to help save the species\n\nThe trouble with tigers in America\n\nAD", "description": "“I REALLY HAVE NO FEAR OF NOTHING BREATHING‼️” a caption accompanying one video declares.", "authors": ["Hannah Knowles", "General Assignment Reporter"], "top_image": "https://www.washingtonpost.com/resizer/H9x9cOacus-mxNCpZBl0BURwDOo=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BJQ34VLC4BHEPAJPSGXFRDVVGE.png"}