{"pub": "cbs", "url": "https://cbsnews.com/news/whistleblower-case-4-top-takeaways-from-the-whistleblower-complaint-and-the-testimony-of-dni-joseph-maguire", "downloaded_at": "2019-09-26 23:48:08.125120+00:00", "title": "4 top takeaways from the whistleblower complaint and the intel chief's testimony", "language": "en", "text": "The evolving story of an anonymous whistleblower and President Trump's call with the Ukrainian president saw two major developments on Thursday: the release of the whistleblower's complaint at the center of the House impeachment inquiry, and the public testimony of the acting director of national intelligence, who delayed providing it to Congress.\n\nHere are four of the major takeaways of the day:\n\nWhite House officials acted to \"lock down\" records of the call, whistleblower says\n\nIn the days after Mr. Trump's call with Ukrainian President Volodymyr Zelensky on July 25, the White House moved to restrict access to records of the call, according to the anonymous whistleblower complaint.\n\n\"[S]enior White House officials had intervened to 'lock down' all records of the phone call, especially the official word-for-word transcript of the call that was produced — as is customary — by the White House Situation Room,\" the whistleblower wrote.\n\nThe whistleblower concluded from these actions \"that White House officials understood the gravity of what had transpired in the call.\" And then, White House lawyers \"'directed'\" officials \"to remove the electronic transcript from the computer system in which such transcripts are typically stored for coordination, finalization, and distribution to Cabinet-level officials.\"\n\nInstead, the transcript \"was loaded into a separate electronic system.\" This was a system used for the storage of classified information \"of an especially sensitive nature.\"\n\nTrump takes aim at officials who spoke to whistleblower\n\nIt is not clear whether that transcript is the same as the summary that was released publicly Wednesday. The whistleblower referred to it as the \"official word-for-word transcript,\" whereas the summary was not a verbatim transcript. A footnote in the release characterized it as a memorandum, the record of the notes and recollections of the officers and National Security Council policy staff \"assigned to listen and memorialize the conversation in written form.\"\n\nCBS News has asked the White House about the transcript system described in the complaint.\n\nAt first, the whistleblower said, the call was expected to be \"routine,\" but afterward, there was a sense from some in the White House that the president had abused his power. White House officials who gave the whistleblower information said they \"were deeply disturbed by what had transpired in the phone call.\"\n\n\"They told me that there was already a 'discussion ongoing' with White House lawyers about how to treat the call because of the likelihood, in the officials' retelling, that they had witnessed the President abuse his office for personal gain,\" the complainant wrote.\n\nInternally, some officials saw this as an \"abuse of the system\" and felt it was \"not consistent with the responsibilities of the Directorate for Intelligence Programs,\" the complaint said.\n\nWhite House officials also, according to the complaint, told the whistleblower it wasn't the first time during the Trump administration \"that a Presidential transcript was placed into this codeword-level system solely for the purpose of protecting politically sensitive rather than national security-sensitive information.\"\n\nRudy Giuliani \"is a central figure\"\n\nThe president's' personal attorney \"is a central figure\" in the effort to pressure Ukraine to investigate Joe Biden, the whistleblower wrote, adding that \"Attorney General Barr appears to be involved, as well.\"\n\nThe whistleblower, who did not hear the call directly, correctly ascertained that Giuliani and Barr were both brought up \"multiple times in tandem\" by Mr. Trump in his call with Zelensky, and as the public saw in the call summary released Wednesday, Mr. Trump asked Zelensky to find hacked servers used by the Democratic National Committee in 2016 and investigate Biden and his son, Hunter Biden, who sat on the board of a Ukrainian natural gas company.\n\nHow the Ukraine story led to an impeachment inquiry\n\nIt was Giuliani who took up the pursuit of this investigative thread. \"Multiple\" U.S. officials told the whistleblower that Giuliani traveled to Madrid to meet with one of Zelensky's advisers, Andriy Yermak, as a \"direct follow-up\" to Mr. Trump's Zelensky call.\n\nU.S. officials also said Giuliani had reportedly reached out to other Zelensky advisers, including his chief of staff, though the whistleblower did not know whether Giuliani succeeded in speaking with them. The whistleblower pointed out what had publicly been reported about Giuliani's efforts, that he had spoken to Ukrainian Prosecutor General Yuriy Lutsenko, who, along with his colleagues had alleged that Biden had pressured the former Ukrainian president to fire then-Prosecutor General Viktor Shokin to \"quash a purported criminal probe into Burisma Holdings,\" the company that had put Hunter Biden on its board.\n\nLutsenko has since backed away from that claim. He said of Hunter Biden in an interview with The Washington Post Thursday that \"from the perspective of Ukrainian legislation, he did not violate anything.\"\n\nThe White House counsel and Justice Department's role in withholding the complaint from Congress\n\nIn his testimony Thursday, Acting Director of National Intelligence Joseph Maguire answered a number of questions about why he would not initially turn over the whistleblower complaint.\n\nHe acknowledged he had sought the opinion of the White House counsel before going to the Department of Justice's Office of Legal Counsel to determine whether the whistleblower complaint was subject to executive privilege. Maguire repeatedly said that it was \"prudent\" as a member of the executive branch to consult with the White House counsel on the question of whether the matter was covered by executive privilege.\n\nActing DNI Joseph Maguire says whistleblower complaint was \"not ignored\"\n\nHe also said the Office of Legal Counsel told him he wasn't required to release the complaint to Congress. The matter was referred to the FBI for investigation, Maguire said, but he felt he couldn't release it without the matter of executive privilege first being addressed.\n\nMaguire noted the White House ultimately decided not to assert executive privilege, and once the Trump administration released the transcript of the phone call, Maguire said he was then free to submit and release the whistleblower complaint.\n\nMaguire also said that his office consulted with the Department of Justice, and included the inspector general in those discussions, to determine whether the complaint was an \"urgent concern.\" The Justice Department Office of Legal Counsel found the complaint did not amount to an urgent concern, because \"the president is not a member of the intelligence community.\" This meant, Maguire said, he was not legally obligated to pass on the complaint to the congressional intelligence committees.\n\nMaguire does not know the whistleblower's identity\n\nJoseph Maguire says whistleblower \"did the right thing\"\n\nDuring his long testimony before the House Intelligence Committee, Maguire was asked about the identity of the whistleblower. \"I don't know who the whistleblower is, to be honest with you. I've done my utmost to make sure I protect his identity,\" Maguire answered, when asked if he believed the whistleblower is a \"political hack.\"\n\nMaguire also denied that anyone from the White House or Justice Department had asked him to find the whistleblower's identity.\n\nMaguire initially withheld the complaint from the committee because the Office of Legal Counsel found that the complaint did not qualify as an \"urgent concern\" that had to be sent to the committee.\n\nHe said he thought the whistleblower \"did the right thing\" and \"followed the law every step of the way.\"\n\nGrace Segers, Kathryn Watson, Stefan Becket and Emily Tillett contributed to this report.", "description": "Here's what we learned from the testimony of the acting intel chief and the whistleblower complaint at the center of the House impeachment inquiry", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/26/70683d17-2859-41a9-90f2-c3b0a42971fc/thumbnail/1200x630g2/a319710aadb2d0db52f88c149317962f/gettyimages-1171375691.jpg", "published_at": "2019-09-26"}