{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7615917/Urgent-warning-dozens-highly-venomous-snakes-mysteriously-wash-Australian-beaches.html", "downloaded_at": "2019-10-26 06:46:57.441793+00:00", "title": "Urgent warning as dozens of highly venomous snakes mysteriously wash up on Australian beaches", "language": "en", "text": "An urgent warning has been issued after dozens of highly venomous sea snakes washed up on Australian beaches.\n\nPoisonous sea snakes have been sighted at several locations around Toogoom, three hours north of Brisbane, and experts are struggling to understand why.\n\nThe snakes have been spotted on Dundowran Beach, Toogoom Beach and increasingly nine were found at Hervey Bay.\n\nVenomous sea snakes have been spotted on Dundowran Beach, Toogoom beach and increasingly nine were found at Hervey Bay\n\nJaimi Raveneau is a snake catcher for Wildlife Rescue Fraser Coast and warned people to stay away from the animals.\n\n'First and foremost absolutely do not touch it, yes these snakes will be injured or incapacitated but they are still be venomous,' she told the Daily Mail Australia..\n\nMs Raveneau said that the snakes poses large fangs with highly potent venom and although bites are rare, they can still be dangerous to humans.\n\n'I see a lot of community posts of people trying to do what they think is the right thing and trying to flick them back in the ocean with sticks, but they washed up for a reason,' she said.\n\nSnake catcher Jaimi Raveneau warned people to stay away as they can be very dangerous\n\n'Sea Snakes have no need to come ashore, so when one becomes stranded, there is most likely an underlying illness or injury,' she said.\n\nWhen sea snakes beach themselves on the shore they are completely exhausted and are attempting to rest, but often quickly die in the hot sun.\n\nAlthough the snakes are known for washing up around this time of year she said the sheer number of them doing so was worrying.\n\n'The numbers we are seeing at the abnormal, we have never seen this many wash ashore,' she said.\n\nExperts have yet to determine why the snakes are washing up in such large numbers but reasons could be anything from local trawlers to water quality\n\nThey are currently unable to determine why exactly the snakes of various different species as they need to run tests on a fresh sample.\n\nShe said the injuries or illness could come from local trawlers, fishing line, poor water quality or diseases in the area but they can't know for sure without testing them.\n\nMs Raveneau said if people in the area see a sea snake either dead or alive to contact Wildlife Rescue Fraser Coast on (07) 4121 3146.", "description": "Poisonous sea snakes have been sighted at several locations around Toogoom, three hours north of Brisbane, and experts are struggling to understand why.", "authors": ["Tom Place For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/06/20207566-0-image-a-12_1572067311228.jpg", "published_at": "2019-10-26"}