{"pub": "mirror", "url": "https://mirror.co.uk/sport/boxing/ksi-explains-link-former-heavyweight-20757192", "downloaded_at": "2019-10-30 14:28:10.814267+00:00", "title": "KSI explains link with former heavyweight world champion Anthony Joshua", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nKSI has revealed he and Anthony Joshua share the same orthodontist.\n\nThe YouTube superstar is preparing to take on Logan Paul in their eagerly-anticipated rematch in Los Angeles on Saturday week.\n\nThe Londoner has become one of the biggest stars in social media and shares a Nigerian heritage with former heavyweight world champion Joshua.\n\nAnd KSI told Sky Sports: \"I never met him [growing up] but he went to the same orthodontist.\n\n\"Between us we were becoming more and more famous so the same orthodontist who was doing our teeth would be so confused by the number of kids outside!\"\n\n(Image: Getty Images)\n\nKSI and Paul fought to a draw last year in Manchester and have turned professional for the sequel.\n\nThe pair clashed at a press conference in London last month and KSI - real name Olajide William Olatunji - insists the beef is real.\n\n\"I'm pretty sure he doesn't like me and I don't really care for him,\" he added. \"It's more the ego thing, he thinks he's better than me and I think I'm better than him.\n\n\"We have big fan bases who are constantly battling against each other.\n\n(Image: Getty Images)\n\n\"I feel like I've done more for the YouTube scene than him, and he doesn't think the same - this is one of the ways we can settle our differences.\n\n\"A lot of people think we're friends but we're really not. I used to have his number but every time I would just text him insults.\n\n\"We took a photo, years ago at the Super Bowl; I didn't know of him we just took a photo and after that we didn't talk.\n\n\"He did his own thing and I did my own thing; now we're in a situation where our egos are so big.\"", "description": "KSI takes on fellow YouTube star Logan Paul in their rematch in Los Angeles on November 9", "authors": ["Martin Domin", "Image", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20736211.ece/ALTERNATES/s1200/0_KSI-VS-Logan-Paul-2-Launch-Press-Conference.jpg", "published_at": "2019-10-30"}