{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/anne-marie-corbett-looks-glum-20537015", "downloaded_at": "2019-10-08 12:54:14.572804+00:00", "title": "Anne-Marie Corbett looks glum on dog walk ahead of Ant McPartlin's I'm A Celebrity return", "language": "en", "text": "Get the biggest I'm a Celebrity stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAnne-Marie Corbett was snapped on a dog walk with a mate in Wimbledon, and she looked a bit down in the dumps.\n\nThe 42 year-old was taking a stroll with her and boyfriend Ant McPartlin's two maltipoos - her pal brought along her dog as well.\n\nSporting a raincoat, ripped jeans and trainers, Anne-Marie pulled off a simple but classic ensemble.\n\nShe wore her blond locks held back by a hairband, her waves tumbling off the side of her head to frame her face.\n\nThe snap was taken ahead of Ant's return to presenting duties on I'm A Celebrity: Get Me Out Of Here - he missed out on last year as he wanted to focus on his rehabilitation after that drunken car crash.\n\n(Image: GoffPhotos.com)\n\n(Image: GoffPhotos.com)\n\nHe was in rehab for alcohol and prescription medication abuse, but will return alongside partner Dec for this year's series.\n\nThis Morning's Holly Willoughby filled in for him and was a hit with I'm A Celeb fans.\n\nWhile no date has been confirmed, the show's expected to make a return next month.\n\nAnt and Dec sent fans into meltdown recently as they told the Britain's Got Talent audience that they'd see them again soon.\n\n(Image: GoffPhotos.com)\n\nAnne-Marie was initially Ant's personal assistant, but the pair started dating following Ant's split from ex-wife Lisa Armstrong.\n\nAfter his drink driving arrest early last year, a source told The Sun Online : \"He's had a tough time of it, but Anne-Marie has put a smile back on his face again. She has been his rock.\"\n\nAnne-Marie's been through heartache herself, as she split from ex-husband Scott in late 2017.\n\n(Image: Tim Merry/Daily Star)\n\nThey have two daughters together, and it is thought they live with their mum and Ant in a new £6million home.\n\nA source told The Sun : \"The property is perfect for them.\n\n\"It has everything they want and marks and important milestone in their relationship together.\n\n\"It's close to parks and open spaces to walk Labrador Hurley and is in a lovely area for the children.\n\n\"It's not been easy to get here but they both view this house as a new start.\"", "description": "Anne-Marie stepped out with a pal and three pooches ahead of boyfriend Ant McPartlin's return to the Aussie jungle", "authors": ["Will Twigger", "Image", "Goffphotos.Com", "Tim Merry Daily Star"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20537287.ece/ALTERNATES/s1200/2_PAY-Excl-Anne-Marie-Corbett.jpg", "published_at": "2019-10-08"}