{"pub": "investing.com", "url": "https://coindesk.com/casa-is-helping-bitcoin-investors-pass-on-their-holdings-when-they-die", "downloaded_at": "2019-10-22 13:41:36.246894+00:00", "title": "Casa Is Helping Bitcoin Investors Pass on Their Holdings When They Die", "language": "en", "text": "If you passed away tomorrow, would your loved ones be able to access your bitcoin holdings?\n\nThat’s a concern addressed by a new service from crypto custody provider Casa that helps holders of the cryptocurrency ensure their assets are passed on after their death.\n\nCalled Casa Covenant, the service combines multisignature authorization with a security protocol to assign bitcoin holdings for later inheritance.\n\nWith the launch, Casa aims to tackle the quandary for bitcoin users who may pass away while holding bitcoin. Casa said their choices are currently: do nothing and potentially leave the bitcoin inaccessible forever; share account details with a trusted individual, but risk theft; or use a third-party custodian who may not have a process for inheritance and may also pose a security risk.\n\nCasa’s “first-of-a-kind” service provides a fourth option, according to a blog post on Monday. It allows users to securely pass on their bitcoin to designated heirs after death, while “minimizing the risk” that the funds can be stolen in the time before.\n\nUsers will need a Keymaster account with the firm and are recommended to work with an estate lawyer to ensure the correct process is carried out after they pass. The lawyer would “protect a single client key in your multisig setup in the form of a hardware wallet,” Casa said.\n\nThe company will work with the lawyer to educate them on the management of private keys and provide tools to assist that process. It will also help with setting up the Covenant account and with technical aspects of the service, according to the post.\n\nOn the tech side, the service adds an optional sixth multisig key to users’ 3-of-5 Key Shield, resulting in a 3-of-6 setup – that is, it would require a transaction to be signed by three of the six key holders to be valid.\n\nThe extra key will be activated during the process of setting up the Covenant service and would be held by the client’s estate lawyer, said Casa. If the client should pass away, the estate lawyer key, the Casa recovery key and the safety deposit box key would be used to recover the funds.\n\nWill deed image via Shutterstock", "description": "", "authors": [], "top_image": "https://static.coindesk.com/wp-content/uploads/2019/10/Last-will-and-testament.jpg", "published_at": "2019-10-22"}