{"pub": "npr", "title": "Congressional Panels Chastise NHTSA Over GM Ignition Problems", "url": "https://npr.org/2014/09/17/349192697/congressional-panels-chastise-nhtsa-over-gm-ignition-problems", "language": "en", "published_at": "2014-09-17", "downloaded_at": "2019-09-02 07:25:15.501130+00:00", "text": "Congressional Panels Chastise NHTSA Over GM Ignition Problems\n\nCommittees are looking at the National Highway Traffic Safety Administration after questions arose about how it handles recalls, including General Motors' recall over faulty ignition switches.\n\nAUDIE CORNISH, HOST:\n\nThe National Highway Traffic Safety Administration, also known as NHTSA, is coming under fire from Congress. A House panel really overlooked or failed to understand early warnings of ignition problems in some GM cars. The automaker began recalling the cars earlier this year. A Senate panel meanwhile grilled the acting head of the agency, saying that it's grown too close to the automakers it's supposed to be regulating. NPR's Brian Naylor reports.\n\nBRIAN NAYLOR, BYLINE: The report was released by Republicans on the House Energy and Commerce Committee. They say the safety agency ignored reports in a 2006 crash that killed two teenagers in Wisconsin. A state trooper investigating the crash found that the car's airbags failed to deploy because the car's ignition switch was in the accessory position. But NHTSA overlooked the flaw, according to the report. Nineteen deaths have been linked to the ignition switch problem. On the other side of the Capitol, Democratic Senator Claire McCaskill of Missouri said NHTSA was too cozy with the industry.\n\nSENATOR CLAIRE MCCASKILL: That reflects obviously on an agency that is perhaps more interested in singing \"Kumbaya\" with the manufacturers than being a cop on the beat.\n\nNAYLOR: Lawmakers were critical that the agency made it optional for auto companies to answer a basic question about what may have caused fatal crashes and that no changes have been made at the agency since the recalls began in February. David Friedman is NHTSA's deputy administrator. He said it's not the safety agency but GM that bears the blame for the ignition problem.\n\nDAVID FRIEDMAN: It wasn't simply incompetence on their part. They had policies in place to not mention the word defect in order to shield information from NHTSA. They were actively trying to hide the ball. NHTSA was working hard to find the ball and was missing critical information.\n\nNAYLOR: But Democratic Senator Ed Markey of Massachusetts wasn't buying that explanation.\n\nSENATOR ED MARKEY: I'm gravely disappointed in the Transportation Department's failure to accept even a shred of responsibility.\n\nNAYLOR: Friedman says the agency needs more money to do its work and that it has gotten tougher on automakers, imposing $140 million in fines over the last five years. And he said he's ended the practice, dating back to the Bush administration, of making answers to questions about what caused a fatal accident optional.\n\nFRIEDMAN: I've personally met individually with 12 major auto manufacturers with a very clear message. There is zero tolerance for failure to quickly notify the agency of a safety defect.\n\nNAYLOR: Lawmakers say the Obama administration also needs to nominate a permanent administrator for the agency. Friedman has been acting as head of NHTSA since December. Brian Naylor, NPR News, Washington.\n\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.", "description": "Committees are looking at the National Highway Traffic Safety Administration after questions arose about how it handles recalls, including General Motors' recall over faulty ignition switches.", "authors": ["Brian Naylor"], "top_image": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400"}