{"pub": "businessinsider", "url": "https://businesstimes.com.sg/energy-commodities/new-digital-exchange-allows-airlines-to-trade-carbon-credits", "downloaded_at": "2019-10-30 08:42:12.839760+00:00", "title": "New digital exchange allows airlines to trade carbon credits", "language": "en", "text": "Senior Minister of State Koh Poh Koon (second from right) minted the exchange's first AirCarbon digital token at its launch.\n\nA GLOBAL blockchain-based carbon exchange was launched on Wednesday, offering a marketplace for stakeholders in the transportation industry to trade securitised carbon emissions.\n\nThe new AirCarbon Exchange, by Singapore-based AirCarbon Pte Ltd, will provide a ready supply of credits, also called EEUs (eligible emission units), for airlines and other corporate buyers to acquire carbon dioxide (CO2) offsets for compliance and voluntary purposes.\n\nThese credits are eligible under the International Civil Aviation Organization’s (ICAO) Carbon Offsetting and Reduction Scheme for International Aviation (CORSIA) regime.\n\nThe carbon credits will be securitised into tokens using blockchain technology, making them highly liquid, fungible and tradable, said AirCarbon on Wednesday.\n\nsentifi.com Market voices on:\n\nEach tradable token is backed by one equivalent tonne of CORSIA-compliant carbon credits.\n\nStay updated with\n\nBT newsletters Terms & conditions Sign up\n\nAirCarbon is applying for the recognised market operator (RMO) licence from the Monetary Authority of Singapore, and aims for the exchange to be fully operational in 2020.\n\nThe company also has a fund, the AirCarbon Registration Facility, which provides grants to finance the registration, consulting, issuance and audit fees of CO2-mitigating projects. In exchange for receiving these grants, project developers must commit to list and transact their resulting credits on the AirCarbon Exchange.\n\nThe new exchange is a collaboration venture with the Sustainable Energy Association of Singapore (SEAS), and supported by Enterprise Singapore.\n\nEdwin Khew, SEAS chairman as well as AirCarbon’s chairman and co-founder, said: “We aim to make the AirCarbon token the easiest and most streamlined instrument for the trading of CORSIA EEUs globally.”\n\nThis will be the world’s first global blockchain-enabled, multi-stakeholder carbon trading hub, representing carbon trades worth more than US$100 billion, said Mr Khew.\n\nIn setting up the exchange, there had been partnerships and discussions with industry stakeholders which include airlines, green project developers, sustainable technology providers, multilateral institutions, impact investors and regulators, Mr Khew added.\n\nSatvinder Singh, assistant chief executive officer of Enterprise Singapore, noted that international regulations and the increased focus on sustainability will lead to greater demand for carbon offsetting activities globally.\n\n“Enterprise Singapore stands ready to support solutions providers like AirCarbon to grow in Singapore and address the needs of corporates to offset their carbon emissions, starting from the aviation industry,” Mr Singh said.\n\nThe CORSIA regime is a market-based mechanism set up to offset commercial aviation’s growing carbon footprint. The industry accounts for over 2.5 per cent of total CO2 emissions, AirCarbon said.\n\nUK-based First Derivatives designed the front-end trading solution to power the exchange.\n\nAirCarbon also operates the AirCarbon Fund, an investment fund which invests in carbon-mitigating projects such as reforestation, methane capture and carbon emissions reduction. Through these projects, the fund also generates CORSIA-compliant tradable carbon offsets, which are then listed on the exchange.\n\nFintech and financial services group RHT Holdings is an investor in AirCarbon, an RHT spokesman told The Business Times. Jayaprakash Jagateesan, chief executive of RHT Holdings, is an AirCarbon board director. He wrote earlier this month that Singapore businesses need to get creative in reducing their carbon footprint and helping to mitigate climate change.\n\nSenior Minister of State, Ministry of Trade and Industry, Koh Poh Koon, minted the new exchange’s first AirCarbon digital token at its launch during the Asia Clean Energy Summit 2019, which is part of the Singapore International Energy Week 2019 held at Marina Bay Sands.", "description": ": THE BUSINESS TIMES Energy & Commodities - A GLOBAL blockchain-based carbon exchange was launched on Wednesday, offering a marketplace for stakeholders in the transportation industry to trade securitised carbon emissions. . Read more at The Business Times.", "authors": ["Fiona Lam"], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/30/AirCarbon2.JPG?itok=ENRnzwie", "published_at": "2019-10-30"}