{"pub": "metro", "url": "https://metro.co.uk/2019/10/06/ben-foden-says-cheating-ex-wife-una-healy-biggest-mistake-10869101", "downloaded_at": "2019-10-06 05:32:45.620714+00:00", "title": "Ben Foden says cheating on ex wife Una Healy is his 'biggest mistake'", "language": "en", "text": "Ben Foden says cheating on ex-wife Una was his ‘biggest mistake’ (Picture: Ash Knotek/REX/Shutterstock)\n\nBen Foden addressed cheating on his former wife Una Healy and has said it was the ‘biggest mistake’.\n\nThe rugby player’s marriage to Una came to an end in 2018, when he admitted to sleeping with another woman behind her back.\n\nThe pair had been married for six years and share two children together, daughter Aoife Belle, seven, and son Tadgh, four.\n\nBen had ‘fessed up to his infidelity in the wake of their split and has since re-married, following a whirlwind romance with new wife Jackie Belanoff Smith.\n\nNow, he’s opened up about his first marriage ending in an interview with The Sun on Saturday and admitted cheating on Una was the ‘biggest and most stupid mistake’ he could have made.\n\nBen married new wife Jackie after just two weeks of dating (Picture: Instagram)\n\nHe said: ‘I hope Una will forgive me. I made the biggest mistake and the most stupid mistake you can make in a relationship.\n\nAdvertisement\n\nAdvertisement\n\n‘We seemed like a perfect match but people never know what happens behind closed doors. I think it’s safe to say that Una and I were struggling for a number of years.’\n\nMetro.co.uk have reached out to Una’s rep.\n\nAt the time of their split, Una admitted the break up had ‘turned her life upside down’, but she has since gone on to find love with boyfriend and Irish hurler, David Breen.\n\nUna and Ben were married for six years and they share two kids (Picture: Instagram)\n\nIt was reported that she was ‘shocked’ to hear Ben had tied the knot again, after dating Jackie for just two weeks, but he claimed on announcing his marriage that Una had given the nuptials her blessing.\n\nBen reportedly met new wife Jackie on Tinder and came under criticism that he had only married her to ‘secure himself a green card’ so he can stay in the US – he is now living in America after signing with Rugby United New York.\n\nHowever, Ben seems to insist their relationship is the real deal.\n\nWhile confirming they had wed, he told fans via Instagram: ‘People will say we are mad or crazy or even fools, as @snackyjax and I had only been dating seriously for a little over 2 weeks before deciding to get married.\n\nAdvertisement\n\nAdvertisement\n\n‘But when someone like her comes into your life, why would I wait?\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Millie Bobby Brown blocks all toxic people out of her life and we could learn a thing or two\n\nMORE: Jeffree Star is left heartbroken as dog Daddy dies: ‘I can’t put into words how much this hurts’", "description": "Ben Foden and Una Healy announced their split in 2018, after he confessed to being unfaithful.", "authors": ["Katie Storey"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/04/SEI_60913917-e1554720157292_1570333220.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-06"}