{"pub": "abcnews", "url": "https://abcnews.go.com/International/amnesty-international-accuses-hong-kong-police-beating-torturing/story?id=65748491", "downloaded_at": "2019-09-20 22:49:58.174262+00:00", "title": "Hong Kong police accused of beating, torturing protesters", "language": "en", "text": "Amnesty International has documented \"reckless and indiscriminate tactics\" used by the Hong Kong police in responding to 15 weeks of anti-government protests.\n\nInterested in China? Add China as an interest to stay up to date on the latest China news, video, and analysis from ABC News. Add Interest\n\nThe London-based human rights group claims detained protesters have been tortured, too.\n\n“The Hong Kong police’s heavy-handed crowd-control response on the streets has been live-streamed for the world to see. Much less visible is the plethora of police abuses against protesters that take place out of sight,” Amnesty's East Asia Director Nicholas Bequelin said in a report.\n\nIvan Abreu/SOPA Images/REX\n\n“The evidence leaves little room for doubt – in an apparent thirst for retaliation, Hong Kong’s security forces have engaged in a disturbing pattern of reckless and unlawful tactics against people during the protests,\" the report read. \"This has included arbitrary arrests and retaliatory violence against arrested persons in custody, some of which has amounted to torture.”\n\nAmnesty International is calling for an independent investigation after interviewing nearly two dozen people who were arrested, along with lawyers, health workers and others.\n\nMost of the detainees who spoke came forward requested anonymity because they \"fear reprisals from the authorities amid a climate of impunity,\" the group said.\n\nIn a statement to the Reuters news agency, responding to the report, police said they have respected the “privacy, dignity and rights” of those in custody and allowed those detained to be in contact with lawyers and their families.\n\n“The force to be used by police shall be the minimum force necessary for achieving a lawful purpose,” police said, according to Reuters.\n\nThe protests began June 9, when hundreds of thousands of mostly young people marched against a proposed extradition bill that would have allowed individuals to be sent from semi-autonomous Hong Kong to mainland China for trial. Hong Kong executive leader Carrie Lam has since pulled the bill from consideration, but the movement has continued and protesters' demands have expanded to include a call for an investigation into police brutality and universal suffrage.\n\nAmnesty said that more than 1,300 people have been arrested since the protests began.\n\nThe group said it had documented cases of people being beaten in custody. One man who was detained at a police station following a protest in August told Amnesty he was severely beaten and told that if he tried to protect himself, police would break his hands, according to the report.\n\nSunny Mok/EYEPRESS/Newscom\n\n\"I felt my legs hit with something really hard,\" Amnesty quoted him as saying. \"Then one [officer] flipped me over and put his knees on my chest. I felt the pain in my bones and couldn’t breathe. I tried to shout but I couldn’t breathe and couldn’t talk.\"\n\nThe group said he was then hospitalized for several days with a bone fracture and internal bleeding.\n\nAmnesty also highlighted the case of another protester who said she was being clubbed with a police baton as she ran from officers. She accused police of continuing to beat her even after she was put in restraints, according to the group.\n\n“Time and again, police officers meted out violence prior to and during arrests, even when the individual had been restrained or detained. The use of force was therefore clearly excessive, violating international human rights law,” Bequelin said.\n\n“Given the pervasiveness of the abuses we found, it is clear that the Hong Kong Police Force is no longer in a position to investigate itself and remedy the widespread unlawful suppression of protesters. Amnesty International is urgently calling for an independent, impartial investigation aimed at delivering prosecutions, justice and reparation, as there is little trust in existing internal mechanisms such as the Independent Police Complaints Commission (IPCC),” he added.\n\nOn Tuesday, three pro-democracy activists from Hong Kong will address the U.S. Congress, as it weighs two pieces of legislation to boost the protest movement.\n\nBoth bills have bipartisan support in both the House and Senate.\n\nThe PROTECT Hong Kong Act would prohibit U.S. exports of police equipment there, including tear gas, rubber bullets, pepper spray, and more. The second bill, called the Hong Kong Human Rights and Democracy Act, requires the administration to produce reports on the status of human rights and rule of law and of export controls in Hong Kong, requests that the State Department not deny visas to Hong Kongers for being arrested for protesting, and requires sanctions on those \"responsible for the erosion of Hong Kong's autonomy and serious abuses of human rights.\"\n\nJoshua Wong, one of the 2014 Umbrella Movement leaders who was recently arrested for his role in the current protests, will testify before the Congressional-Executive Commission on China, along with pro-democracy activist Denise Ho and student group spokesperson Sunny Cheung. Wong will urge lawmakers to pass the legislation, arguing it has \"broad support\" in Hong Kong, according to prepared remarks obtained by ABC News.\n\nThe legislation would be the most significant show of external support the demonstrators have received, but one that China has blasted and warned the U.S. not to take.\n\n(ABC News' Conor Finnegan contributed to this report.)", "description": "Amnesty International accuses Hong Kong police of beating and torturing protesters. The protest movement began in June.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/hong-kong-rex-190920_hpMain_16x9_992.jpg", "published_at": "2019-09-20"}