{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/avengers-paul-rudd-no-time-scorseses-marvel-comments-ahead-new-netflix-series-10923618", "downloaded_at": "2019-10-15 16:28:53.516155+00:00", "title": "Avengers' Paul Rudd has no time for Scorsese's Marvel comments", "language": "en", "text": "If you think Marvel is killing movies, make better movies (Picture: Netflix)\n\nMarvel’s position in cinema has been up for unlikely debate over the past couple of weeks thanks to Martin Scorsese – but Paul Rudd just doesn’t have time for it.\n\nThe Ant-Man star is about to make the leap to his first leading TV role in new Netflix series Living With Yourself – playing both troubled middle-man Miles and the clone he accidentally gets replaced with in a wellness treatment gone wrong.\n\nBit of a mile away from the billion-dollar Avengers films that director Scorsese dubbed ‘theme parks, not cinema’ despite their high grossing.\n\nAs a result, Paul’s got a unique perspective on both the TV world and the film series that Jennifer Aniston claimed was ‘ruining cinema’.\n\nSpeaking to Metro.co.uk, the actor said: ‘At the end of the day, I think any actor just wants to work on something that they like, and the material is good, and the writing is good, and the character is interesting.\n\nAdvertisement\n\nAdvertisement\n\n‘The separation of film and TV is a blurrier line now than more than it’s ever been in our country (the US) I think it’s probably much more accepted over here (in the UK) or in other places. I never consciously thought about it like “Oh, now I want to do a TV show”.\n\n‘It wasn’t that at all. It, honestly, I just, they sent me the script, I’ve read other shows, other scripts, but all eight of these were written and it was [right].’\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nTalking about Living With Yourself as well as the future of cinema, he said: ‘We all had a project where we’re just telling a story, and yes it would be on TV, but people watch their movies on TV now.\n\n‘People watch movies on phones now. So this idea that we can tell a four-and-a-half hour movie, if you want to think about it in those terms is fine.\n\n‘This is an interesting character, the themes in this is really unique, I like the material, so I wanted to do it, and I’m not thinking of it anywhere beyond that really. That’s it.’\n\nAdvertisement\n\nAdvertisement\n\nStarring alongside Aisling Bea as his wife Kate, Living With Yourself will see Paul return to the oddball comedy that he’s become known for, as he struggles to live a double life with a twin.\n\nPaul and Aisling play a married couple in a rocky place in the new series (Picture: Netflix)\n\nAisling Bea, who stars as Miles’ wife Kate in the series, was in agreement, but added that if people had an issue with the way cinema was going, then it’s up to them to fix it.\n\n‘I think when people moan like that, it’s like…you have creativity to hand. If you want to change something, use your creativity,’ she told us.\n\n‘If you feel like cinema’s getting ruined, then make something people want to come and see by using your creativity. If you don’t like that there’s no space for your voice, then find a space where there is, or create something.’\n\n‘I think sometimes we can, everyone is sort of like “we had it better in our day”,’ she continued. ‘Every generation has that, I’m sure when films first came in they were like “this is ruining theatre” but plays still exist.\n\nMore: Netflix Power star teases how *that* shock character death will impact rest of season 6 finale Breaking Bad movie El Camino almost had a very different ending for Jesse Pinkman Netflix’s When They See Us hit with lawsuit over interrogation technique\n\n‘“Streaming is ruining live TV”. There’ll still be shows that capture attention and it’s up to us as creatives to work out what will make people tick, what will make people come out of their house into a dark room rather than sit on their couch and watch something.’\n\nAdvertisement\n\n‘That’s kind of our job to make that,’ she concluded. ‘There’ll be a bumpy period but…I ain’t too worried.’\n\nLiving With Yourself launches this Friday on Netflix.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Who Avengers’ Chris Hemsworth wants his brothers to play in Marvel Cinematic Universe\n\nMORE: Brie Larson confirms female MCU stars have asked for an all-women Marvel movie", "description": "After Martin Scorsese dismissed Marvel as 'not cinema', Ant-Man star Paul Rudd gives his thoughts on why creators shouldn't be scared of TV.", "authors": ["Tilly Pearce"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90011200_1571155334.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}