{"pub": "reuters", "url": "https://in.reuters.com/article/afghanistan-election-women/afghan-women-fear-mandatory-poll-photos-could-stop-them-from-voting-idINKBN1WA21J", "downloaded_at": "2019-09-25 23:36:48.164065+00:00", "title": "Afghan women fear mandatory poll photos could stop them from voting", "language": "en", "text": "KABUL/HERAT, Afghanistan (Reuters) - Afghan women’s rights activists have demanded the authorities lift a requirement that all voters be photographed at polling stations in Saturday’s presidential election, arguing that it could prevent hundreds of thousands of women from voting.\n\nSupporters of Afghanistan's presidential candidate Abdullah Abdullah attend the presidential election campaign in Herat, Afghanistan September 24, 2019. REUTERS/Jalil Ahmad\n\nAfghanistan’s electoral authorities have decided to photograph all voters using facial recognition software as an anti-fraud measure, after elections in 2009 and 2014 ended in disputes over rampant ballot stuffing.\n\nBut the photo requirement could be particularly difficult for women, especially in conservative areas, where most adult women and older girls cover their faces outside the home and do not show themselves to men who are not their relatives.\n\nThe election commission says that women voters can have their pictures taken by female election staff. But it acknowledges that at least 1,450 of the nearly 30,000 polling stations employ no women.\n\nEighteen women’s rights groups have separately written to the Independent Election Commission (IEC) to call for the photo requirement to be scrapped. The letters, shown to Reuters by a senior IEC official, said women in rural areas wanted to vote but believed it was against Islam or culturally inappropriate to allow themselves to be photographed by men.\n\nRights groups criticized the election officials for not explaining earlier how the biometric system will work, or finding a way to reassure women that it will not breach their privacy.\n\n“The decision to make photographs along with fingerprints as a mandatory requirement is a brand new rule,” said Tamima Rasheed, an activist working in southern Kandahar province. “It is being imposed without any consultation with women’s rights organisations.”\n\nIn northern Herat province, around 50 women activists shouted slogans outside the Human Rights Commission office against the requirement for voter photos.\n\nHalima Salimi, head of the Afghan Women’s Network in Herat, said the new rule will suppress the turnout of female voters.\n\n“Women have a right to vote but they should not feel nervous while exercising this right,” she said.\n\nWomen are already underrepresented in Afghanistan’s democracy, accounting for only a third of the more than 9.6 million registered voters.\n\nMany have a particular fear of the return of the Taliban, the militant movement which banned women from working and girls from going to school, and which now controls more territory than at any time since it was driven from power in 2001.\n\nThe Taliban have called for civilians to boycott the elections and have threatened to carry out attacks to disrupt the polls.\n\nElection official said they sympathise with the concerns of the women’s rights groups, but defended the use of photographs as necessary to protect the integrity of the vote.\n\n“A photograph of every voter is mandatory for transparency and to prevent of fraud,” said Hawa Alam Nuristani, the chairwoman of the IEC.\n\nAfghanistan used a biometric voter-identification system that recorded voters’ fingerprints in its last national election, a parliamentary vote in October last year. Thousands of the devices were reported lost or stolen.", "description": "Afghan women's rights activists have demanded the authorities lift a requirement that all voters be photographed at polling stations in Saturday's presidential election, arguing that it could prevent hundreds of thousands of women from voting.", "authors": ["Abdul Qadir Sediqi", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190925&t=2&i=1433799496&w=1200&r=LYNXMPEF8O1GA", "published_at": "2019-09-25"}