{"pub": "cbs", "url": "https://cbsnews.com/news/chicago-police-raided-these-childrens-homes-but-they-had-the-wrong-address-2019-10-29", "downloaded_at": "2019-10-29 23:56:33.918959+00:00", "title": "Chicago police raided these children's homes — but they had the wrong address", "language": "en", "text": "When heavily armed officers raided a home in one of Chicago's poorest neighborhoods, instead of finding an accused drug dealer, they found 9-year-old Peter Mendez and his family.\n\n\"It was like my life just flashed before my eyes,\" Peter said of the 2017 incident.\n\nThe officers, yelling \"get on the ground,\" pointed their assault weapons at Peter and this family and handcuffed his father before realizing they were at the wrong apartment.\n\n\"They live upstairs,\" Peter's mom can be heard saying on police body camera footage after she grabbed the search warrant from the officers. \"That's the couple upstairs.\"\n\nPolice said they were acting on a tip from an informant. In body camera footage, officers were heard whispering that they were in the wrong apartment, but that didn't stop them from searching the home and Peter's school backpack.\n\nAn image taken from police body camera footage shows officers inside the wrong home. Chicago police\n\nPeter is one of 23 children CBS Chicago talked to for a year-long investigation — all their homes were wrongly raided by Chicago police. The investigation found that cops get drug or gun tips from informants, but fail to verify the addresses before busting in.\n\n\"The John Doe was very persistent on the address and we went off what he was saying,\" said Officer Joseph Cappello, who got the warrant for the raid at the Mendez home. He admitted during a deposition that he failed to independently verify the tip.\n\nThe CBS Chicago investigation found over 11,000 search warrants were approved by the state attorney's office since 2016. But police are not keeping track of how many times their department gets it wrong.\n\n\"If we have small children in those situations, their safety is paramount,\" said Chicago Police Superintendent Eddie Johnson. \"We don't try to traumatize them.\"\n\nChildren interviewed by CBS said they were scared for their lives.\n\n\"I thought they was going to shoot me and my brother and everybody else,\" said 7-year-old Samari Boswell, who was celebrating her 4-year-old brother TJ's birthday when 17 plainclothes officers stormed into her family's home.\n\nCBS Chicago spoke to children whose homes were wrongly raided by police. Peter Mendez, center, said he once wanted to become a police officer before they came into his home. CBS News\n\nThe suspect police were looking for hadn't lived in the building for five years.\n\nResponding to CBS' investigation, Chicago Mayor Lori Lightfoot said wrong raids and mistreatment of children has to stop.\n\n\"What we need to do is actually get it right,\" she said. \"We shouldn't be going into the wrong house — period.\"\n\nIn 2017, the same year as the raid at the Mendez house, the Justice Department found Chicago Police had engaged in a pattern of excessive force and failed to properly investigate officers accused of misconduct. The department is under a federal consent decree to make reforms.\n\nThe Peter Mendez Act, a bill to protect children like Peter from unreasonable police force, was signed by the Illinois governor following the investigation.\n\nThe CBS Chicago investigation \"[un]warranted\" dives into the impact of raids conducted on the wrong homes. Children shared their stories of officers pointing guns at them, even handcuffing one 8-year-old child. Watch the CBS Chicago documentary about those raids below:", "description": "An investigation by CBS Chicago found homes were wrongly raided after officers failed to verify the address before busting in", "authors": ["Dave Savini", "Michele Youngerman", "Samah Assad"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/29/33df890e-5f65-4a1e-b394-24f73facff34/thumbnail/1200x630/2cc1a695f495180d0d3773e887377842/1029-en-chiwrongraids-savini-2.jpg", "published_at": "2019-10-29"}