{"pub": "cbs", "title": "Debra Messing demands attendee list for Beverly Hills Trump fundraiser, president hits back", "url": "https://cbsnews.com/news/trum-fundraiser-debra-messing-demands-attendee-list-for-beverly-hills-event-during-emmys-week-president-hollywood", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:04:40.637171+00:00", "text": "Two events will converge on Hollywood during the same week in September: the Emmys and a fundraiser for Donald Trump, according to The Hollywood Reporter. When actress Debra Messing publicly asked the outlet to release a list of fundraiser attendees, she inadvertently started a feud with the president.\n\n\"Please print a list of all attendees please. The public has a right to know,\" the \"Will and Grace\" star tweeted Saturday, sharing the article. Messing's \"Will and Grace\" costar Eric McCormack also tweeted to THR to release the attendee list.\n\nMessing's call for the list gained widespread attention line and was met with both support and criticism. One of her main critics was President Trump himself, who tweeted about Messing the next day.\n\nPlease print a list of all attendees please. The public has a right to know. https://t.co/YV4UoxrPHI — Debra Messing (@DebraMessing) August 31, 2019\n\n\"I have not forgotten that when it was announced that I was going to do The Apprentice, and when it then became a big hit, helping NBC's failed lineup greatly, @DebraMessing came up to me at an Upfront & profusely thanked me, even calling me 'Sir.' How times have changed!\" Mr. Trump tweeted.\n\nI have not forgotten that when it was announced that I was going to do The Apprentice, and when it then became a big hit, helping NBC’s failed lineup greatly, @DebraMessing came up to me at an Upfront & profusely thanked me, even calling me “Sir.” How times have changed! — Donald J. Trump (@realDonaldTrump) September 1, 2019\n\nAfter Mr. Trump called out Messing by name, the actress and vocal critic of the president decided to turn her attention to a mass shooting that had taken place in Odessa, Texas, during which eight people — including the gunman — were killed.\n\n\"Now that I know I have your attention @realDonaldTrump, please read this thread— a PARTIAL list of souls lost to preventable, devastating gun violence. America wants universal background checks. The majority of Americans want assault weapons ban. Take Action and I'll call you Sir,\" she wrote, sharing gun violence statistics.\n\nMessing also tweeted about Hurricane Dorian, which at the time was a Category 5 storm. Meanwhile, the president was tweeting about the same two tragedies.\n\nThe actress then turned back to tweeting about the original issue: Her demand to see the attendee list for a Trump 2020 fundraiser. \"I am proud to be a donor when I contribute to a campaign,\" Messing tweeted. \"I am happy to be listed when I attend a fundraiser. I am assuming anyone who donates to Trump's fundraiser would feel the same. Why wouldn't they?\"\n\nI am proud to be a donor when I contribute to a campaign. I am happy to be listed when I attend a fundraiser. I am assuming anyone who donates to Trump’s fundraiser would feel the same. Why wouldn’t they? — Debra Messing (@DebraMessing) September 1, 2019\n\nMessing later revealed she had donated to Amy McGrath's Kentucky Senate race against Senator Mitch McConnell, Candace Valenzuela, who is running for Congress in Texas, as well as several Democratic groups. In her tweet, Messing urged others to share their donor list.\n\nShe then retweeted several people who shared their lists using the hashtag #DonorList.\n\nThe Hollywood Reporter shared several additional details about Mr. Trump's California fundraiser, reporting that the president will stop in both San Francisco and then Los Angeles.\n\nOn September 17, he will attend an even event in Beverly Hills, hosted by Republican National Committee chairwoman Ronna McDaniel, RNC co-chairman Tommy Hicks Jr., campaign manager Brad Parscale and Trump Victory finance chairman Todd Ricketts, according THR. The location has yet to be revealed and fundraiser tickets will cost between $1,000 and $100,000. The $100,000 ticket includes a photo opportunity with the president and VIP reception.\n\nA few days after Mr. Trump mingles with supporters, television's biggest stars will gather for the Emmys, which take place September 22. If the awards ceremony is anything like those in the past, the Hollywood stars and media executives whom Mr. Trump often criticizes will likely take a few jabs at him.", "description": "The \"Will and Grace\" star urged others to share who they've donated to, then posted her own donor list", "authors": ["Caitlin O'Kane"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/02/9637bbde-5b2e-4d84-8417-9a171e47599d/thumbnail/1200x630/dd258d7153d3bb459bc6eafd04df7a73/untitled-collage-13.jpg"}