{"pub": "foxnews", "url": "https://foxnews.com/us/california-dive-boat-fire-apple-employees", "downloaded_at": "2019-09-05 00:08:27.383084+00:00", "title": "Two Apple employees among 34 dead in California boat fire", "language": "en", "published_at": "2019-09-04", "text": "Two Apple employees, one of whom was celebrating his daughter's 17th birthday, were among the victims of this weekend's Southern California scuba diving boat fire which killed 34 people, the company announced.\n\nApple employee Steve Salika had been celebrating his daughter Tia's 17th birthday along with his wife, Diana Adamic, according to a statement from Apple's senior vice president Deirdre O'Brien. The fire killed all three family members. Apple employee Dan Garcia was also a victim of the fire, the cause of which was not yet known.\n\nSalika had worked at Apple for 30 years and met his wife there. O'Brien praised his \"energy and enthusiasm,\" and said Garcia died doing what he loved -- he \"was as passionate about his job at Apple as he was about his love of diving.\"\n\nInvestigators said Wednesday the bodies of 33 of the 34 presumed dead had been recovered and one remained missing. The only survivors of the 3 a.m. inferno were five crew members, including the captain of the ship, who jumped overboard and paddled a dinghy to a nearby boat. The victims were said to have been sleeping below deck and could not escape as the fire had blocked both exits.\n\nCALIFORNIA BOAT COMPANY CANCELS UPCOMING DIVING TRIPS AS 33 OF THE 34 BODIES PULLED FROM WATER\n\nMany details of the tragedy remain unknown. It was unclear whether the victims tried to escape or died in their sleep, U.S. Coast Guard Capt. Monica Rochester told NBC News. The National Transportation Safety Board (NTSB) was investigating the cause of the fire.\n\nFlames engulfed the Conception, a ship with Santa Barbara-based Truth Aquatics, near Santa Cruz Island during a Labor Day weekend scuba diving excursion.\n\nCALIFORNIA DIVE COMPANY OWNER ON DEADLY BOAT FIRE: THIS HAD 'NEVER, EVER HAPPENED BEFORE'\n\nFlames spread so rapidly that the exits were blocked in an instant, giving those below deck almost no chance of escaping, Santa Barbara County Sheriff Bill Brown said. But, according to Marjorie Murtagh Cooke, former director of the NTSB's Office of Marine Safety, the exit routes might be a key component of the investigation. She told the Los Angeles Times the boats are required to have two exits in sleeping quarters. However, Dr. Aaron Roland, who said he's dived with Truth Aquatics, told the Times he did not recall crew members ever pointing out a second exit on the boat.\n\nSailor James, who took a diving trip aboard the Conception in January 2018, recalled \"being shocked that there was no accessible hatch to the deck, that I knew about anyway,\" the Modesto Bee reported.\n\nThe victims ranged in age from teenagers to those in their mid-60s. A family of five was killed in the fire -- a father, stepmother, and three daughters. Also on board were students from Pacific Collegiate School in Santa Cruz, a public charter school for grades 7 through 12.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nDNA tests still needed to be conducted to confirm the identities of the victims, but it was believed 14 of the 34 were from the San Francisco area, KSN reported.\n\nThe Associated Press contributed to this report.", "description": "Two Apple employees, one of whom was celebrating his daughter's 17th birthday, were among the victims of this weekend's Southern California scuba diving boat fire which killed 34 people, the company announced.", "authors": ["Morgan Phillips"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Boat-Fire-1.jpg"}