{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7590247/Gigi-Hadid-changes-multicolor-coat-lunch-New-York-City-statement-making-sweatshit.html", "downloaded_at": "2019-10-19 12:06:54.435966+00:00", "title": "Gigi Hadid changes into multicolor coat for lunch in New York City after statement-making sweatshit", "language": "en", "text": "She let her clothes do the talking on Thursday in a teal sweatshirt that had the words 'boys lie' emblazoned across the front.\n\nBut on Friday, Gigi Hadid swapped the statement-making ensemble for a more colorful one, donning a multicolor coat for lunch in New York City.\n\nThe 24-year-old model wore her hair in a slicked-back ponytail for the outing.\n\nChange up: Gigi Hadid, 24, changed into a multicolor coat to have lunch in New York City on Friday\n\nHadid paired the look with black athletic shorts and a black t-shirt with the word 'hôtel' on it.\n\nThe Vogue model wore a pair of rocker-chic black platform boots on her feet with some retro shield sunglasses over her eyes.\n\nShe accessorized with a simple gold necklace as she carried her phone in her hand.\n\nThe day prior, Hadid was seen in a statement-making teal sweatsuit.\n\nSleek locks: The Vogue model wore her hair in a slicked-back ponytail for the outing\n\nBlack on bottom: Hadid paired the look with black athletic shorts and a black t-shirt with the word 'hôtel' on it\n\nSending a message: Hadid made quite a statement with her 'boys lie' clothing when she was spotted out and about in New York City on Thursday\n\nRocking a classic off-duty-model look, Gigi pulled her blonde locks back in a sleek low bun and wore a trendy pair of wire rimmed sunglasses.\n\nHer matching sweatsuit was a muted teal tone and featured baggy pants and a crew neck oversized sweatshirt with an angel on the front and the words 'boys lie, goodbye.'\n\nThe $165 ensemble is made by female empowerment label, Boys Lie, which was created by two women who'd both gotten over recent breakups.\n\n'Just smile and wave as you are saying goodbye to the boy who made you cry,' the outfit's description reads on their website. 'Trust us, you’re better off without him.'\n\nSpeak up: Her matching sweatsuit was a muted teal tone and featured baggy pants and a crew neck oversized sweatshirt with an angel on the front and the words 'boys lie, goodbye'\n\nHadid might be sending a less-than-subtle message to 26-year-old Bachelor star Tyler Cameron, with whom she recently called it quits.\n\nThe short-lived couple were first spotted together in early August.\n\nThey seemed inseparable to begin with. He even accompanied Hadid to her grandmother's funeral in the Netherlands in early September.\n\nBut earlier this month, sources revealed that the pair's romance had quickly fizzled out and they were no longer together.\n\nShort lived: After being seemingly inseparable at the beginning, Cameron, 26, and Hadid split after just two months (Pictured together in August)\n\nCameron was a standout on Hannah Brown's season of The Bachelorette, where he finished in second place.\n\nBut Hadid doesn't seem to be letting the breakup slow her down as she has been busy working on the catwalks at Paris fashion week.\n\nShe recently returned home to the U.S. and enjoyed a girls night out with her sister Bella at a Kacey Musgraves concert at Radio City Music Hall.", "description": "She let her clothes do the talking on Thursday in a teal sweatshirt that read 'boys lie.' But on Friday, Gigi Hadid swapped the statement-making ensemble for a more colorful one.", "authors": ["Cailley Chella For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/01/19908374-0-image-a-66_1571444131495.jpg", "published_at": "2019-10-19"}