{"pub": "yahoo", "url": "https://sports.yahoo.com/enable-frankie-dettori-step-arc-160940385.html", "downloaded_at": "2019-09-27 02:16:09.580940+00:00", "title": "Enable and Frankie Dettori step up Arc preparation with first gallop on Newmarket's Rowley Mile", "language": "en", "text": "Enable could achieve an unprecedented third Arc at Longchamp - Getty Images Europe\n\nEnable continued her preparation for what would be a unique third win in the Prix de L’Arc de Triomphe on Sunday week with a racecourse gallop under Frankie Dettori on the Rowley Mile on Wednesday.\n\nAlthough she boasts an almost unblemished record of 13 wins from 14 starts, it was her first time on either of Newmarket’s racecourses. But with minimal rain in the area over the past two months the turf gallops are still too firm.\n\nScroll to continue with content Ad\n\nHowever 7mm of rain on the racecourse, which has been regularly watered, provided the perfect surface for Khalid Abdullah’s homebred mare who galloped over a mile with Crossed Baton, a good work horse who never quite reproduces it on the racecourse. Pushed out by Dettori, she finished with her head just in front.\n\nAfterwards Gosden explained that the gallop was just what they had wanted. “I was very pleased with the work, which was built up nicely, but I just wanted her to stay with her lead horse as we’re not here to go eight lengths clear,” he said. “She had a good healthy blow and it went to plan, which doesn’t always happen with work mornings.”\n\nLord Grimthorpe, her owner’s racing manager, was one of a large number of spectators. “She’s never spectacular in her work,” he said. “But she picked up well. I think it will be just fine tuning from now on. But she will need to bring her A game to the Arc – there’s plenty of quality in it and plenty of horses who’d think they’d have a decent chance.”\n\nEnable on the Newmarket gallops Credit: Getty Images\n\nDettori needs no reminding that he missed the winning ride on Treve in the 2013 Arc when he broke his ankle while he was going to the start for an inconsequential race at Nottingham earlier in the week.\n\nStory continues\n\nHe is clearly eating and sleeping the race and Enable’s shot at racing history, indeed it was almost the first thing he mentioned after winning the St Leger on Logician.\n\nAs a result he has been picking and choosing his mounts and he has just one ride, Travel On, in the Weatherbys TBA Handicap at Newmarket today when the racecourse launches its “gold season” – four consecutive weekends of high-class racing.", "description": "Enable continued her preparation for what would be a unique third win in the Prix de L’Arc de Triomphe on Sunday week with a racecourse gallop under Frankie Dettori on the Rowley Mile on Wednesday.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/2KQY5fsv2V9J04vJIb1nag--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/H3eYsqD7dOiJBqYsT529pg--~B/aD0xNTYzO3c9MjUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_818/f43f867eec3afff6dae0d2c1d7086d19", "published_at": "2019-09-25"}