{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/10/30/can-anyone-get-be-president-not-really-things-are-improving", "downloaded_at": "2019-10-30 23:24:32.967213+00:00", "title": "Can anyone get to be president? Not really. But things are improving.", "language": "en", "text": "There’s a variation of this story, in which the candidate, though usually not someone who climbed from modest circumstances themselves, tells a powerful tale about how someone related to them rose from modest circumstances.\n\nMy favorite example was how Mitt Romney, the son of a governor and worth a couple of hundred million dollars, waxed poetic in 2012 about his father. “Only in America could a man like my dad become governor of the state in which he once sold paint from the trunk of his car,” Romney said. Imagine: The son of a chairman of a car company who was also a onetime paint-seller possibly becoming president! So inspiring.\n\nAD\n\nAD\n\nBut can anyone really grow up to be president? Not really.\n\nAnyone can try, however. The state of New Hampshire just officially opened registration for 2020 presidential candidates, and all you need to join the likes of Bernie Sanders and Elizabeth Warren is $1,000 and a dream.\n\nIndeed, in 2016 there were 29 Republican candidates in New Hampshire and 28 Democrats running. Had Sanders or Hillary Clinton not floated your boat, you could have selected Henry Hewes, Lloyd Kelso or the inimitable Vermin Supreme. (Supreme wound up in a respectable fourth place with 268 votes, only 399 behind Martin O’Malley.)\n\nInterestingly enough, among those 57 candidates there were only two women, Clinton and Carly Fiorina. It seems that not only are qualified men more likely than qualified women to offer themselves up for the most important job in the world, even among the unqualified the only ones brazen enough to run are men.\n\nAD\n\nAD\n\nThere is, however, some hope for gender equality in this year’s Democratic field. We had four female senators running (one, Kirsten Gillibrand, is already gone), and there’s another woman in the race, Rep. Tulsi Gabbard. Then there’s Marianne Williamson, who achieved support roughly in line with her status as a minor celebrity. Had a really famous person such as Oprah Winfrey run, she would be in the top tier.\n\nWhich is, of course, a reminder that our current president had lots of celebrity but no relevant knowledge or experience, yet managed to get elected. Trump’s election was made possible by a series of coincidences, but it represented the failure of a system meant to ensure that anyone can’t actually become president; there are gatekeepers in the parties and the media who are supposed to keep the rabble from taking over.\n\nThe system may not have been built to stop a unique figure such as Trump, but most of the time it does its job of restricting the choices voters will consider to a narrow band of politicians who have occupied a small number of previous offices: vice president, senator, governor, Cabinet official, maybe a general here or there. Every once in a while, someone such as Pete Buttigieg (the mayor of a city of 100,000) comes along and performs better than most expected for a while, but almost inevitably falls short.\n\nAD\n\nAD\n\nThe system as it exists today is certainly more open than it was when party bigwigs chose their nominees in the proverbial smoke-filled rooms, but that doesn’t mean it’s completely fair. Any means that are employed to limit the voters’ choices, whether it’s the party limiting the number who can participate in debates or the media simply ignoring some of the candidates, will be seen as deeply unfair by those shut out.\n\nIf you’re Steve Bullock or Joe Sestak, you probably think the whole game is rigged to make it impossible for you to win, and you wouldn’t be completely wrong. But the primaries are still more open than they ever have been, not only to candidates who aren’t white men but also to those such as Sanders who have little support from the party and push against its ideological boundaries. Sanders may never get to be president, but he has shown that it’s possible to build a contending campaign outside the structures that usually validate candidates for voters.\n\nFor all its weaknesses, no one has come up with a plausible alternative to what we have in place now: a system that has a built-in preference for elites and candidates who look and sound like the presidents who have come before, but leaves at least some room for those who are different. It may not be what we want, but little by little, it’s getting better.\n\nRead more:\n\nAD", "description": "If you care to join the 50 or 60 people who will run in 2020, go right ahead.", "authors": ["Paul Waldman", "Opinion Writer Covering Politics", "Opinion Writer"], "top_image": "https://www.washingtonpost.com/resizer/9uydhVoPrBq41M7BWkt8BWpHvZ4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/A6WMD7X3JII6THQCDVC4WPP2R4.jpg", "published_at": "2019-10-30"}