{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKCN1VV04P-OCASP", "downloaded_at": "2019-09-10 07:45:13.159775+00:00", "title": "College football notebook: Swann resigns as USC AD", "language": "en", "text": "Lynn Swann resigned as athletic director at Southern California, the university announced Monday after reports began to surface within the Los Angeles media.\n\nFILE PHOTO: Sep 7, 2019; Los Angeles, CA, USA; Southern California Trojans athletic director Lynn Swann watches from the sidelines during the game against the Stanford Cardinal at Los Angeles Memorial Coliseum. Mandatory Credit: Kirby Lee-USA TODAY Sports\n\nIn a story posted to the USC website, university president Carol Folt said through a statement that Dave Roberts, her special adviser, will handle Swann’s duties as the interim AD before a permanent replacement is hired.\n\n“Lynn has been a leader on and off the field at USC for nearly five decades, and he will forever be a valued member of the Trojan family,” Folt said in a letter to the USC community.\n\nWhile the school won five national titles among all sports under Swann’s watch, USC was implicated in the national college-admissions cheating, bribery and recruitment scandal that also included the athletics department and involved several other high-profile universities.\n\n—When the Alabama Crimson Tide get hot and bothered, they want others to start feeling the heat. Such was the case with the administration after the SEC announced that the Tide are scheduled to play their Sept. 21 football game at home against Southern Mississippi at 11 a.m. local time.\n\nAfter the heat index for Alabama’s kickoff against New Mexico State at Bryant-Denny Stadium in Tuscaloosa on Saturday reached around 105 degrees, school president Stuart R. Bell and athletic director Greg Byrne weren’t ready to cool down.\n\nIn a joint statement, they said, “We are disappointed that our game against Southern Miss has been selected as a daytime kickoff at home. We realize we’ve played more non-conference day games at home in September than any other SEC team since 2014. There have been a number of conversations with our conference office, and they also recognize the challenges these kick times present for our student-athletes and fans.”\n\n—The No. 9 Florida Gators won’t be at full strength when they begin their SEC season Saturday at Kentucky.\n\nWide receiver Kadarius Toney (shoulder) will miss “a couple” of weeks and potential first-round cornerback CJ Henderson (ankle) is doubtful because of injuries, Gators coach Dan Mullen said.\n\nHenderson has a sprained left ankle and would play only if he is “100 percent healthy,” Mullen said. The Gators (2-0) are already limited in the secondary after Brian Edwards and John Huggins departed this offseason, and safety Brad Stewart was suspended before the season began.\n\n—Mississippi junior linebacker MoMo Sanogo is expected to be sidelined “roughly 10 weeks” after sustaining an ankle injury against Arkansas on Saturday, coach Matt Luke said.\n\nSanogo, who will undergo surgery Tuesday, recorded four tackles in the Rebels’ first two games after collecting 112 last season.\n\n—Texas sophomore cornerback B.J. Foster could be sidelined several weeks with a “pretty significant hamstring injury,” coach Tom Herman announced.\n\nFoster sustained the injury in the late stages of Saturday’s 45-38 loss to LSU.\n\nHerman said sophomore DeMarvion Overshown would likely fill Foster’s shoes. Overshown had a sack in the season opener against Louisiana Tech and played nine games as a freshman in 2018.\n\n—Texas A&M has lost starting running back Jashaun Corbin for the rest of the season because of a hamstring injury, coach Jimbo Fisher said.\n\nCorbin was injured in Saturday’s 24-10 loss at top-ranked Clemson when he was pulled down from behind in the third quarter.\n\nThe sophomore recorded his first career 100-yard game with 103 in the season-opening victory over Texas State. He had 34 yards on 13 carries against Clemson.\n\n—Purdue’s Elijah Sindelar, the nation’s leading passer after two games, suffered a concussion late in Saturday’s contest, putting his status for this week’s home game against TCU in doubt.\n\nSindelar, a senior, is averaging 466 passing yards through two games, including a 509-yard performance in last weekend’s 42-24 victory over visiting Vanderbilt.\n\nSindelar was sent to the medical tent on the sideline during the Boilermakers’ final series on Saturday after he rushed for 7 yards. His backup is redshirt freshman Jack Plummer, who has yet to appear in a game.\n\n—North Carolina senior cornerback Patrice Rene will miss the remainder of the season after sustaining a torn ACL, coach Mack Brown said.\n\nRene, who started every game last season, sustained the injury during the Tar Heels’ 28-25 win against Miami on Saturday. Brown told reporters that he hopes next season is in the cards for Rene, who has a redshirt year available.\n\nRene recorded 31 tackles, two interceptions and a fumble recovery last season. Junior Greg Ross is expected to replace Rene for North Carolina (2-0) when it visits Wake Forest on Friday.\n\n—Grambling safety Danquarian Fields underwent emergency surgery to avoid losing his right leg and will miss the rest of his senior season.\n\nHe was injured making a tackle in the first quarter of Saturday night’s 20-14 road loss to Louisiana Tech in Ruston, La. Fields was airlifted to a hospital in Shreveport for surgery.\n\nTigers head coach Broderick Fobbs told the Monroe (La.) News-Star on Sunday that Fields was in stable condition and is expected to make a full recovery.\n\n—Field Level Media", "description": "Lynn Swann resigned as athletic director at Southern California, the university announced Monday after reports began to surface within the Los Angeles media.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190910&t=2&i=1428154145&w=1200&r=LYNXNPEF8903E-OCASP", "published_at": "2019-09-10"}