{"pub": "cbc", "url": "https://cbc.ca/radio/q/sylvia-tyson-revisits-her-songwriting-roots-and-the-early-days-of-ian-sylvia-1.5270420", "downloaded_at": "2019-09-06 12:13:07.863297+00:00", "title": "CBC Radio", "language": "en", "text": "Sylvia Tyson is one half of the singing and songwriting duo Ian & Sylvia. They were the two trailblazers in the North American folk scene through the '60s and '70s. The duo performed everywhere from Toronto's coffeehouses to the folk bars that covered Greenwich Village. They covered traditional songs and become even more popular once they started to record songs of their own.\n\nNow, Sylvia Tyson has uncovered some lost recordings from their early work together. She's sharing the tracks in their new music collection called Ian & Sylvia: The Lost Tapes.\n\nIan & Sylvia pictured together in the 1970s (Dennis Hall )\n\nIn a conversation with q host Tom Power, Sylvia Tyson looks back at their early career, through some of the 'lost' recordings dating back to the early '70s.\n\nIan Tyson and Sylvia Tyson are each being inducted into the Canadian Songwriters Hall of Fame in Calgary on September 5. The two are being recognized separately, for their large collections of solo work that have stretched beyond the time they spent performing together.\n\nThe album cover for Ian & Sylvia: The Lost Tapes. (Pak Shot )\n\nThe collection Ian & Sylvia: The Lost Tapes is out Friday, September 6.\n\n— Produced by ​Emma Godmere\n\n*Click 'Listen' near the top of the page to hear the full conversation.", "description": "Sylvia Tyson will be among the newest inductees in the Canadian Songwriters Hall of Fame on September 5. She and former partner Ian Tyson are each being inducted on the eve of a release of a brand-new music collection, called Ian and Sylvia: The Lost Tapes.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5271242.1567688594!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/sylvia-tyson.jpg", "published_at": "2019-09-05"}