{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/fraud-trial-barclays-bankers-lied-qatari-fees-191008155817722.html", "downloaded_at": "2019-10-09 00:51:28.404856+00:00", "title": "Former Barclays bankers lied about Qatari fees, jury hears", "language": "en", "text": "Three former Barclays executives lied to the market by hiding 322 million pounds ($393 million) in extra fees that the bank paid Qatar in return for vital funding during the global credit crisis, a prosecutor told a London court on Tuesday.\n\nThe case, one of the most high-profile brought by the United Kingdom's Serious Fraud Office (SFO), revolves around undisclosed payments to Qatar as Barclays raised more than 11 billion pounds ($13bn) from investors in 2008 to avert a state bailout.\n\nQatar, a major investor in Britain, has not been accused of wrongdoing.\n\nOpening the case for the prosecution, lawyer Edward Brown alleged that Roger Jenkins, Tom Kalaris and Richard Boath pretended commissions paid to Qatar in 2008 were fees for separate, commercially valuable advisory services agreements.\n\n\"Telling lies in this way, say the prosecution, is a criminal offence,\" Brown told the jury at London's Old Bailey criminal court in a trial scheduled to last up to five months.\n\n\"It is committing fraud by false representations. They acted dishonestly, say the prosecution, in order to preserve the future of the bank and to preserve their own positions.\"\n\nThe men, aged between 60 and 64, deny wrongdoing.\n\nThe case hinges on what Barclays told the market in public documents, such as the prospectuses and subscription agreements that outlined the fees and commissions that the bank paid to investors, including former Qatari Prime Minister Sheikh Hamad bin Jassim bin Jaber Al Thani.\n\nHigh stakes\n\nBrown alleged that Barclays swept aside established banking practices of telling the truth in public documents about the terms on which investors were backing the bank as the credit crunch roiled markets, in order to secure around four billion pounds ($4.9bn) of investment from Qatar over 2008.\n\nHe alleged that the defendants used a \"carefully contrived mechanism\" to hide the additional fees with two advisory service agreements that were not genuine, but a dishonest way of paying the Qataris extra and hiding the fees from the wider world.\n\nThe men sat impassively in the narrow, raised glass-surrounded dock.\n\nThe seven-year case is a rare example of a criminal prosecution of senior bankers at a global bank over conduct during the credit crunch more than a decade ago - and a high-stakes trial for the SFO.\n\nJenkins is the former chairman of investment banking in the Middle East and North Africa, Kalaris headed the bank's wealth division at the time and Richard Boath was the investment bank division's head of corporate finance in Europe, the Middle East and Africa.\n\nJenkins, 64, Kalaris, 63, and 60-year-old Boath are each charged with substantive fraud and conspiracy to commit fraud by false representation.\n\nThe three men each face both charges over the June capital raising, which include an allegation that they conspired with former Barclays finance director Chris Lucas to make dishonest representations in public documents for profit or to expose others to loss.\n\nJenkins also faces both charges over the second fundraising four months later.\n\nLucas has not been charged because he is too ill to stand trial, the jury was told.", "description": "Former senior Barclays executives deny wrongdoing in trial surrounding actions taken during 2008 financial crisis.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/8/4a8be45393b44c8985b1bbae1d3ed7ac_18.jpg", "published_at": "2019-10-08"}