{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/sep/28/donald-trump-impeachment-lindsey-graham-republicans-jared-kushner-ivanka", "downloaded_at": "2019-09-28 21:34:58.736611+00:00", "title": "Graham prepares Trump defence as impeachment fury intensifies", "language": "en", "text": "Senator Lindsey Graham, once among Donald Trump’s harshest critics, is set to lead the charge to defend him in the court of public opinion as Democrats make the case for impeachment.\n\nTrump's Ukraine call sparks new questions over intelligence chief's firing Read more\n\nThe Republican senator from South Carolina has rejected the allegation that Trump betrayed America’s national security interests by pressing the Ukrainian president, Volodymyr Zelenskiy, to investigate political rival Joe Biden days after freezing some military aid to the country.\n\nGraham and other allies of the president have sought to fight back by arguing that a whistleblower who raised the alarm was not on the call between Trump and Zelenskiy but based his complaint on officials’ recollections of it.\n\n“In America you can’t even get a parking ticket based on hearsay testimony,” Graham tweeted on Saturday. “But you can impeach a president? I certainly hope not.”\n\nThe senator played golf with Trump, as well as professionals Gary Player and Annika Sörenstam, at the president’s club in Sterling, Virginia on Saturday morning, according to a White House pool report. It seemed likely Trump and Graham had plenty of time to strategise how to reclaim the political narrative.\n\nQ&A How do you impeach the US president? Show Hide Article 1 of the United States constitution gives the House of Representatives the sole power to initiate impeachment and the Senate the sole power to try impeachments of the president. A president can be impeached if they are judged to have committed \"treason, bribery, or other high crimes and misdemeanors\" – although the constitution does not specify what “high crimes and misdemeanors” are. The process starts with the House of Representatives passing articles of impeachment. A simple majority of members need to vote in favour of impeachment for it to pass to the next stage. Democrats currently control the house, with 235 representatives. The chief justice of the US supreme court then presides over the proceedings in the Senate, where the president is tried, with senators acting as the jury. For the president to be found guilty two-thirds of senators must vote to convict. Republicans currently control the Senate, with 53 of the 100 senators. Two presidents have previously been impeached, Bill Clinton in 1998, and Andrew Johnson in 1868, though neither was removed from office as a result. Richard Nixon resigned in 1974 before there was a formal vote to impeach him. Martin Belam\n\nGraham has changed his tune on impeachment. In 1998-99, as a member of the House of Representatives, he helped manage the impeachment of Democratic president Bill Clinton, insisting the process was “about restoring honor and integrity to the office”.\n\nBut Graham distinguished himself in Trump’s eyes a year ago with his furious defence of Brett Kavanaugh, whose nomination to the supreme court was almost derailed by allegations of sexual assault.\n\nOn Friday the senator sent a fundraising email to supporters that said: “I can still remember the exact moment it started, one year ago today … I spoke from the heart against the false and uncorroborated accusations leveled against Brett Kavanaugh for political purposes.”\n\nGraham added: “My remarks on the Democrats’ despicable treatment of Justice Kavanaugh had struck a powerful chord with folks who enthusiastically supported President Trump’s pick to our nation’s highest court.”\n\nYou can’t even get a parking ticket based on hearsay testimony. But you can impeach a president? I certainly hope not Lindsey Graham\n\nThe email contained a photo of a smiling Graham with a distressed protester in the background, and the caption: “Stand with me against the left’s angry mobs!”\n\nGraham, who chairs the Senate judiciary committee, will appear on CBS’s Face the Nation on Sunday, along with Trump lawyer Rudy Giuliani, a key figure in the impeachment inquiry given his attempts to pressure Ukraine.\n\nThe New York Post’s PageSix reported that Graham was overheard on a flight coordinating talking points with the White House.\n\n“We’re told that the South Carolina pol was on a JetBlue flight from Washington DC, to Charleston and was chatting loudly with ‘Jared’ – presumably White House adviser Jared Kushner – before takeoff,” it said.\n\n“It was a ‘full-blown, loud conversation’ according to an airborne spy. ‘His phone rang and he answered, “Hey, Jared!” He was … saying he’s going to be on Face the Nation on Sunday. He said, “Listen – this is what I’m going to lay out,”’ we’re told.”\n\nQ&A What is the Trump-Ukraine whistleblower scandal? Show Hide On 25 July, US president Donald Trump called Ukraine's president Volodymyr Zelenskiy. During the course of the call he reportedly asked the Ukrainian leader eight times to investigate former US vice-president Joe Biden and Biden’s son Hunter. It is additionally reported that Trump ordered his staff to withhold nearly $400m in aid to Ukraine days before the call took place. Biden is one of the frontrunners to win the Democratic nomination and take on Trump in the 2020 presidential election. Trump confirmed he discussed the Bidens with Zelenskiy, and accused the pair – without offering any evidence – of corruption. A US intelligence community whistleblower filed a report after becoming alarmed at Trump’s behaviour in the matter. The White House refused to release the substance of the whistleblower complaint, setting up a confrontation with Congress over the release of information. Complaints of this nature are usually reported to Congress within seven days. Trump’s personal lawyer, former New York mayor Rudy Giuliani, has admitted asking the Ukrainians to investigate the Bidens. It is illegal for a political campaign to accept a “thing of value” from a foreign government. Democrats say an investigation into a political opponent – for which Trump appears to have been pushing – would amount to a thing of value.\n\nThe report added that Graham was overheard saying: “This is Kavanaugh on steroids! This is hearsay – and this person has bias.”\n\nGraham and others might find the Ukraine case tougher than Kavanaugh or the Mueller report, which summed up special counsel Robert Mueller’s investigation of Russian election interference, links between Trump and Moscow and possible obstruction of justice by the president.\n\nDavid Brock, a political activist and founder of the progressive watchdog Media Matters for America, told the Guardian: “Their playbook is very predictable. It’s one we’ve seen before. We’re seeing it play out now. But I do think that they’re dealing with a weaker hand this time and at least so far they’re struggling to find a counter-narrative they would like to tell.\n\nThey’re struggling to find a counter-narrative … they’re throwing a lot at the wall to see what sticks David Brock\n\n“I don’t think they have it yet and so it feels like they’re throwing a lot at the wall to see what sticks but there’s not as much of a coordinated counter-offensive as there has been in the past.\n\n“And that’s because they’re overwhelmed with the reality of what this complaint says and it’s very hard to spin your way out of it. They’re certainly trying but I wonder about the effectiveness of it.”\n\nTrump continued to punch back on Saturday, branding Democrats “savages”. He tweeted: “Can you imagine if these Do Nothing Democrat Savages … had a Republican party who would have done to Obama what the Do Nothings are doing to me. Oh well, maybe next time!”\n\nFacebook Twitter Pinterest Lindsey Graham speaks to the media on Capitol Hill. Photograph: Jim Lo Scalzo/EPA\n\nGraham may find it difficult to target Biden, an old friend. And his bellicose defence of Trump represents a striking u-turn. In May 2016 the former Republican primary candidate and close friend of late senator John McCain wrote on Twitter: “If we nominate Trump, we will get destroyed … and we will deserve it.”\n\nHouse Democrats are determined to move fast. On Friday they issued subpoenas demanding documents from secretary of state Mike Pompeo and scheduling legal depositions for other state officials.\n\nTrump's 'spy' comments are not far off from real US whistleblower policy Read more\n\nOn Saturday, Chuck Schumer, the Senate minority leader, expressed concern over a Washington Post report that the White House restricted access to the transcript of a 2017 Oval Office meeting in which Trump told two senior Russian officials he was unconcerned about interference in the 2016 election because the US did the same in other countries.\n\nIf true, Schumer said, the reports “are extremely harmful to both our national security and the integrity of our elections. It’s one of the most disturbing things we’ve learned yet.”\n\nHe added: “The White House should immediately provide the congressional intelligence committees with all the records of that meeting so we can get to the bottom of it.”\n\nTrump tried to defend himself by sharing an old report in which his then national security adviser, HR McMaster, described conversation as “wholly appropriate”.\n\nThe president wrote: “Thank you to General McMaster. Just more Fake News!”", "description": "Senator who played role in Clinton impeachment reportedly overheard on plane discussing strategy with ‘Jared’", "authors": ["David Smith"], "top_image": "https://i.guim.co.uk/img/media/d0decd88649cf5250182c5bdcc0e08b41321e5a0/0_69_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=66d933c86c4f1f2d355a4b10f9296563", "published_at": "2019-09-28"}