{"pub": "politico", "url": "https://politico.eu/article/uk-parliament-votes-against-general-election", "downloaded_at": "2019-09-05 00:07:09.950571+00:00", "published_at": "2019-09-04", "title": "UK parliament votes against general election", "language": "en", "text": "British Prime Minister Boris Johnson | Leon Neal/Getty Images UK parliament votes against general election The motion put down by Prime Minister Boris Johnson did not receive the two thirds majority required.\n\nLONDON — MPs have voted against throwing the United Kingdom into a general election.\n\nAlthough the motion was backed by 298 MPs with just 56 against, because many opposition MPs abstained, it did not receive the two thirds majority required to trigger national ballot.\n\nEarlier, MPs backed a bill to delay Brexit after member opposed to no deal took control of the parliamentary agenda from the government. Prime Minister Boris Johnson had insisted he would not request a Brexit extension from Brussels and argued the only way to break the impasse would be to go to the country.\n\nBut the opposition Labour party refused to back him, saying it could not countenance a general election until a no deal on October 31 had been ruled out.\n\nAfter the result, the prime minister mocked his opposite number, Labour Leader Jeremy Corbyn for not backing the vote: \"Forty-eight hours ago he [Corbyn] was leading the chants of ‘stop the coup, let the people vote.’ Now he is saying stop the election and stop the people from voting.\"\n\n\"I think he has become the first leader of the opposition in the democratic history of our country to refuse the invitation of an election. I can only speculate as to the reasons behind his hesitation, but the obvious conclusion is that he does not think he will win,\" he added\n\nCorbyn was not in the chamber when the result was announced, but ahead of the vote he said: \"The offer of an election today is a bit like the offer of an apple to snow white from the Wicked queen. What he is offering is not an apple of the election but the poison of a no-deal.\n\n\"Let this bill pass, and gain royal assent, then we will back an election so we do not crash out with a no-deal exit from the European Union.\"\n\nIt is unclear what the prime minister will do now. His aides refused to spell out how the government would respond to the loss earlier in the day.\n\nA spokesman for Downing Street told journalists earlier in the day: “If parliament is unwilling to put Brexit through, an election is the only way to do it … [but if he loses] we will find a way to deliver on what the British people want, which is to deliver Brexit by October 31.”\n\nThe rebel bill passed its third reading earlier this evening and will be debated in the House of Lords from Thursday.\n\nJohnson said, following the vote on the bill: \"I think it’s very sad that MPs have voted like this. I think it’s a great dereliction of their democratic duty.\"\n\nHe had added: \"I don’t want an election, the public don’t want an election, the country doesn’t want an election but this house has left no other option for letting the public decide who they want as prime minister.\"\n\nUK NATIONAL PARLIAMENT ELECTION POLL OF POLLS\n\nFor more polling data from across Europe visit POLITICO Poll of Polls.", "description": "The motion put down by Prime Minister Boris Johnson did not receive the two thirds majority required.", "authors": ["Emilio Casalicchio", "Charlie Cooper", "Annabelle Dickson"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/GettyImages-1165930078-1200x628.jpg"}