{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/09/11/trump-third-term-tweets-credit-north-carolina-win/?tid=pm_pop", "downloaded_at": "2019-09-11 13:58:19.723330+00:00", "title": "Trump takes credit for GOP’s North Carolina win, tweets photo suggesting a third term for himself", "language": "en", "text": "\n\nPresident Trump addresses reporters as he departs the White House on Sept. 9 before a political rally in North Carolina. (Jahi Chikwendiu/The Washington Post)\n\nAfter hosting a rally in North Carolina with Vice President Pence earlier this week and then blasting out endorsements for two GOP candidates running in special elections there, President Trump closely tracked the returns on Tuesday night. When it became clear that both men vying for open House seats had won, the president took to Twitter in triumph.\n\nIn a flurry of tweets sent well into early Wednesday morning, Trump celebrated the “TWO BIG VICTORIES” and boasted about his influence on the results — while also taking time to bash the “Fake News” and share a photo suggesting a third term for himself.\n\n“BIG NIGHT FOR THE REPUBLICAN PARTY,” he tweeted in all-caps. “CONGRATULATIONS TO ALL!”\n\n[Republican Bishop pulls out narrow win in N.C. House race]\n\nThe wins came as Trump has faced downturns in national polling and amid new White House turmoil as he ousted national security adviser John Bolton. A Washington Post-ABC News poll released Tuesday found that 56 percent of voting-age Americans say they disapprove of Trump’s performance in office, and his approval rating among that demographic stands at 38 percent.\n\nTuesday’s results gave Trump a chance to celebrate instead. As the votes poured in, Trump’s tweets rolled out, the first post appearing around 8:50 p.m.\n\n“One down, one to go,” Trump tweeted, referencing Republican Greg Murphy’s race in North Carolina’s heavily conservative 3rd Congressional District. Murphy eventually beat Democrat Allen Thomas by 24 points.\n\nOne down, one to go – Greg Murphy is projected to win in the Great State of North Carolina! #NC03 — Donald J. Trump (@realDonaldTrump) September 11, 2019\n\nThe president then turned his attention to Republican Dan Bishop, who had been locked in a close race against Democratic challenger Dan McCready in North Carolina’s 9th Congressional District. Citing an unnamed poll that had Bishop “down 17 points 3 weeks ago,” Trump took credit for turning the candidate’s campaign around. It is unclear what poll Trump was citing. An Inside Elections poll published Aug. 30 had McCready up by four points, still within the margin of error.\n\n“He then asked me for help, we changed his strategy together, and he ran a great race,” Trump tweeted about Bishop. “Big Rally last night. Now it looks like he is going to win.”\n\nTrump added: “@CNN & @MSNBC are moving their big studio equipment and talent out. Stay tuned!”\n\nDan Bishop was down 17 points 3 weeks ago. He then asked me for help, we changed his strategy together, and he ran a great race. Big Rally last night. Now it looks like he is going to win. @CNN & @MSNBC are moving their big studio equipment and talent out. Stay tuned! — Donald J. Trump (@realDonaldTrump) September 11, 2019\n\nIn the lead-up to the special election, Trump was a major presence in the 9th district race as he and Republicans threw their weight behind Bishop. Beyond repeatedly urging his 64 million Twitter followers to vote for Bishop, Trump and Pence traveled to the district on Monday, boosting support for the candidate at a “Keep America Great” rally in Fayetteville, N.C. Footage of the president praising Bishop and slamming McCready was also used in a closing TV ad.\n\nBy around 11:20 p.m. on Tuesday, Bishop had officially eked out a victory over McCready by more than two percentage points in a race that has been described as “a bellwether for the president’s political fortunes in 2020.”\n\nOn Twitter, Trump was jubilant, alternating between congratulating Bishop and Murphy and criticizing media outlets for their coverage.\n\n“@CNN & @MSNBC were all set to have a BIG victory, until Dan Bishop won North Carolina 09,” he tweeted. “Now you will hear them barely talk about, or cover, the race. Fake News never wins!”\n\nFollowing the election, other conservatives also credited the president with propelling Bishop over the finish line. “Trump pushed him over the top, absolutely,” Rep. Richard Hudson (R-N.C.), who represents the 8th District, told The Post. “Turnout is everything when you have a close race.”\n\nAfter retweeting House Minority Leader Kevin McCarthy (R-Calif.) thanking him “for once again leading us to victory,” Trump shared a photo of a “Trump 2024” campaign sign — marking the second time in two days he has suggested pursuing a third term. At Monday’s rally, Trump joked that he would stay in office through 2026, so he could be president when the United States co-hosts the World Cup, The Post reported.\n\nTrump also apparently stayed up to watch coverage of the elections after they were called. Though he had chastised CNN earlier in the night, Trump had kind words for one of the network’s political commentators, Alice Stewart, who joined host Don Lemon to discuss North Carolina.\n\n“You’d be great on a network with much higher ratings,” he tweeted around 12:30 a.m. “Keep up the good work!”\n\nAlice @alicetweet Stewart: Thank you for the nice words while on @CNN concerning the TWO big Republican Congressional victories. You’d be great on a network with much higher ratings. Keep up the good work! — Donald J. Trump (@realDonaldTrump) September 11, 2019\n\nBut his praise ended there. In another tweet shared shortly after 1 a.m., Trump accused the media of “barely” reporting on Murphy’s race.\n\n“The win was far bigger than anticipated — there was just nothing the Fakers could say to diminish or demean the scope of this victory,” he wrote. “So we had TWO BIG VICTORIES tonight, Greg & Dan!”", "description": "In a flurry of tweets sent well into early Wednesday morning, Trump celebrated the “TWO BIG VICTORIES” — while also taking time to bash the “Fake News.”", "authors": ["Allyson Chiu", "Reporter With The Morning Mix Team", "September At Am", "Allyson Chiu Is A Reporter With The Washington Post'S Morning Mix Team. She Has Previously Contributed To The South China Morning Post", "The Pacific Daily News."], "top_image": "https://www.washingtonpost.com/resizer/7NqIo2S1d_poL-RBrNJ9STh9v2A=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/G25DD5WTIEI6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-11"}