{"pub": "politico", "url": "https://politico.com/news/2019/10/13/american-troops-syria-turkey-045701", "downloaded_at": "2019-10-13 18:31:33.965932+00:00", "title": "Amid chaos, U.S. to pull last troops out of northern Syria", "language": "en", "text": "The statement from the Pentagon chief came amid continued condemnation from Democratic and Republican members of Congress over Trump’s decision to clear out of the way for Turkey's offensive, as well as indications that the opening stages of the assault have allowed Islamic State prisoners to escape.\n\nLawmakers had widely rebuked the administration's dramatic foreign policy shift as an abandonment of the Syrian Kurdish militias that helped U.S. forces stamp out the remnants of the ISIS threat in the region. The Turks regard the Kurds as an enemy because of Kurdish hopes of forming their own country in territory that includes parts of Turkey.\n\n“It's a very terrible situation over there,” Esper said. “A situation caused by the Turks by President [Recep Tayyip] Erdoğan. Despite our opposition, they decided to make this incursion into Syria. And at this point in time, in the last 24 hours, we learned that they likely intend to expand their attack further south than originally planned, and to the west.“\n\nEsper also expressed outrage over reported Turkish atrocities against Kurdish civilians. “It's terrible. It's a terrible situation. We condemn it. We have condemned it,” he said.\n\nSpeaking on ABC’s “This Week,” Treasury Secretary Steven Mnuchin asserted that the U.S. did not have an obligation to protect the Kurdish fighters, but said the Trump administration would punish Turkey if necessary.\n\n“Our role in Syria was not to defend the Kurds,“ Mnuchin said. “You have a long-standing conflict between people helping us with ISIS and Turkey, which is a NATO ally. We've put them on warning. The president has authorized me to shut down the Turkey economy, and we can do that at a moment's notice on his command.“\n\nAlthough the president's choice to leave Kurdish forces exposed has drawn a sustained torrent of denunciations on Capitol Hill, even from Trump allies such as Sen. Lindsey Graham, Mnuchin downplayed those criticisms of the White House on Sunday.\n\n“I like Lindsey Graham a lot. Lindsey Graham and the president are close. This is an area they don't agree on,\" he said. \"These are complicated issues. I assure you the president and the national security staff are on top of the situation. Our No. 1 issue is making sure that ISIS is defeated.\"\n\nTrump mentioned Graham in a tweet Sunday, writing online that he was dealing with the South Carolina Republican and \"many members of Congress, including Democrats, about imposing powerful Sanctions on Turkey. Treasury is ready to go, additional legislation may be sought. There is great consensus on this. Turkey has asked that it not be done. Stay tuned!“\n\nSen. Chris Van Hollen (D-Md.), who released a bill with Graham on Wednesday that threatens a series of economic sanctions against Turkey, blasted the president's response to the ongoing military conflict. He argued Sunday that Trump's move Friday granting the Treasury Department \"very significant new sanctions authorities\" to target Ankara was insufficient.\n\n“For God's sakes, what are they waiting for, right? People are being killed right now,” he told host Chris Wallace on “Fox News Sunday.\"\n\nSen. Kevin Cramer (R-N.D.) expressed some regret about the White House’s Syria maneuver, but said he wasn’t sure Trump had many options in responding to what he described as an unavoidable confrontation.\n\n“I wish it had been different, I can tell you that, but I'm not sure the president had a lot of choices,“ he told host Jake Tapper on CNN’s “State of the Union,” adding: “Clearly, the Turks are not the type of ally that the Kurds are, but they are a NATO country, as you have pointed out, and it's not — it's never quite as simple as just a binary choice.”", "description": "", "authors": [], "top_image": "https://static.politico.com/99/b9/b680e39241b4a52f0aa1b8858e45/20191013-syria-turkey-border-ap-773.jpg", "published_at": "2019-10-13"}