{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7577111/Jackie-O-Henderson-PROOF-Im-not-Roxy-Jacenkos-poo-jogger.html", "downloaded_at": "2019-10-15 23:06:25.301125+00:00", "title": "Jackie 'O' Henderson: PROOF I'm not Roxy Jacenko's poo jogger", "language": "en", "text": "Jackie 'O' Henderson has denied bizarre rumours that she is the 'Paddington Pooper' who has been targeting Roxy Jacenko's office in Sydney.\n\nOn Monday, the 44-year-old radio personality shared a photo of herself looking anxious on set of The Masked Singer and asked her followers to 'caption this'.\n\nHer fans offered amusing suggestions - including, 'Waiting for mate', and, 'Hurry up I need a durry' - but one person made a crude reference to the poo jogger saga.\n\n'It's not true!' Jackie 'O' Henderson has furiously responded to rumours she is Roxy Jacenko's poo jogger - and has evidence that PROVES she isn't the woman in the infamous CCTV footage\n\nThe fan's caption read, 'Roxy knows I'm the poo lady', which prompted Jackie to write the comment, 'NOT TRUE!!!'\n\nThe KIIS FM star was dragged into the 'Paddington Pooper' scandal earlier this week when celebrity publicist Roxy revealed that some of her Instagram followers were convinced Jackie was the culprit.\n\nDuring an appearance on The Kyle and Jackie O Show on Tuesday, Roxy explained that she deleted CCTV footage of the defecating incident from Instagram because her followers were spreading rumours about the identity of the woman in the video.\n\nDenial: On Monday, the 44-year-old radio star said that claims she is the 'poo lady' are 'not true'\n\nShe was outraged that Jackie, who is a longtime friend, was being implicated in the matter and so removed the video in order to delete the defamatory comments.\n\nRoxy said: 'The only reason I took the videos down is because everyone kept saying it's Jackie O and I thought, \"Oh, good grief, I better take it down for her\".'\n\nJackie laughed off the false conspiracy theory at the time, saying that she isn't as 'skinny' as the woman in the CCTV footage.\n\nJoke: The KIIS FM star was dragged into the Paddington Pooper scandal earlier this week when Roxy revealed that some of her Instagram followers were convinced Jackie was the culprit\n\nRoxy also referenced Jackie as a possible 'suspect' on The Project on Tuesday night, saying: 'I took it down because I don't want to put the person in a position where people are throwing around names on social media... one of them was Jackie O!'\n\nOn Wednesday morning, Jackie set the record straight during a segment on The Kyle and Jackie O Show.\n\nShe clarified once and for all that she is not the mystery poo jogger, adding that even her own mother was concerned about the headlines.\n\nHaving a laugh: Roxy also referenced Jackie as a possible 'suspect' on The Project on Tuesday night, saying: 'I took it down because I don't want to put the person in a position where people are throwing around names on social media... one of them was Jackie O!'\n\n'I am no the poo jogger, okay? It's not me, it's some other girl! She's way skinnier than me, by the way,' Jackie said.\n\n'I'm not going for a jog in the morning because I have this radio show... How could it be me?' she added, referring to her early weekday starts at KIIS FM.\n\nOne of the CCTV videos of the poo jogger incident was time-stamped at 6:33am on Thursday. Around this time, Jackie was at work 18km away in North Ryde.\n\nThe 'Paddington pooper' saga began on Monday night, when Roxy shared shocking CCTV footage to Instagram of a female jogger defecating outside her Sweaty Betty PR office on Watson Street.\n\nCaught in the act: The 'Paddington pooper' saga began on Monday night, when Roxy shared shocking CCTV footage to Instagram (above) of a female jogger defecating outside her Sweaty Betty PR office on Watson Street\n\n'How could it be me?' One of the CCTV videos of the poo jogger incident was time-stamped at 6:33am on Thursday. Around this time, Jackie was at work 18km away in North Ryde\n\nShe uploaded videos of the woman running behind a car, pulling down her pants and relieving herself on two separate occasions.\n\n'It's disgusting, it's a lovely street lined with heritage terraces, kids playing and riding their bikes,' Roxy later told Daily Mail Australia.\n\n'Human faeces shouldn't be on any street. Something needs to be done.'\n\nOn Tuesday, Roxy confirmed that police were investigating the matter, saying: 'We have been sent info which will be passed to the police.'", "description": "Jackie 'O' Henderson has denied bizarre rumours that she is the 'Paddington Pooper' who has been targeting Roxy Jacenko's office in Sydney.", "authors": ["Jo Scrimshire For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/22/19760396-0-image-a-30_1571174453090.jpg", "published_at": "2019-10-15"}