{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7581571/Australias-poppy-farms-produce-half-worlds-legal-narcotics.html", "downloaded_at": "2019-10-17 01:52:06.311818+00:00", "title": "Australia's poppy farms produce more than half of the world's legal narcotics", "language": "en", "text": "Fields of opium poppies are in full bloom across Australia, which now sustains a $40 billion industry meeting more than half the world's demand for painkillers.\n\nOwned by Palla Pharma, the only Australian-owned poppy processing company, the crops will soon be harvested to produce legal narcotics.\n\nUp until three years ago, Tasmania had a monopoly on producing the papaver somniferum plants but that had now spread into Victoria and New South Wales.\n\nThe location of the farms is not made public, as the poppies can also be used to produce illegal drugs.\n\nThe whopping $40billion poppy industry is in full bloom in NSW, Victoria and Tasmania\n\nPapaver somniferum is the plant species from which opium and poppy seeds come from\n\nPapaver somniferum is the poppy species from which legal painkillers such as morpheine and codeine is produced, as well as illicit products such as heroin.\n\nRichard Sargood, who already farms sheep and cattle, decided to start growing the poppies to diversify his property.\n\nSigning up to grow his own poppy farm, tucked away in the Riverina district of NSW, Mr Sargood is excited to begin harvesting.\n\n'It's quite exciting and, hopefully, if we can keep it flowering for another couple of weeks it'll build the opioid content and there'll be a reasonable yield at the other end of it,' he told Nine News.\n\nOnce the flower falls, the capsule is opened to reveal white poppy seeds that will soon turn black and be harvested\n\nOnce the flower falls, the capsule is opened to reveal white poppy seeds that turn black and can be harvested.\n\nThe capsule membrane contains the opium, which is the pain killer used to produce the powerful drugs.\n\nPalla Pharma's director of agriculture Michael Long told the publication that this is the third year they've had 'excellent crops'.\n\n'We've got excellent climatic conditions that suit the poppy and we've seen for three seasons now we've had some excellent crops,' he said.\n\n'We believe there's a significant growth opportunity, particularly for morphine and codeine.'", "description": "The whopping $40billion poppy industry is in full bloom in NSW, Victoria and Tasmania.", "authors": ["Sahar Mourad For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/00/19810236-0-image-a-2_1571268210150.jpg", "published_at": "2019-10-16"}