{"pub": "npr", "url": "https://npr.org/2019/09/20/762430305/it-gets-to-you-extremism-researchers-confront-the-unseen-toll-of-their-work", "downloaded_at": "2019-09-20 12:57:14.351013+00:00", "title": "'It Gets To You.' Extremism Researchers Confront The Unseen Toll Of Their Work", "language": "en", "text": "'It Gets To You.' Extremism Researchers Confront The Unseen Toll Of Their Work\n\nEnlarge this image toggle caption Stuart Kinlough/Ikon Images/Getty Images Stuart Kinlough/Ikon Images/Getty Images\n\nCharlie Winter, a London-based terrorism researcher, was dining with friends one recent evening when the conversation turned to whether it is ethical to eat meat.\n\nSomeone brought up slaughterhouse conditions, Winter said, and he instantly grew uneasy. He stayed for a while longer, squirming, and then finally left the room. That word — \"slaughterhouse\" — had conjured images of one of the most gruesome ISIS videos he'd come across. The militants had filmed a mass execution in a slaughterhouse, casting their prisoners as the animals.\n\n\"There are moments, I find, where my everyday life is invaded by these scenes,\" said Winter, a senior fellow at the International Centre for the Study of Radicalisation.\n\nBecause of his work, Winter has dozens of such images lodged in his brain, and there's no telling what might activate a memory. ISIS atrocities interrupt dinner parties, casual conversations, peaceful moments with his daughter. Winter searched for information about how to process the graphic pictures swirling in his head, but he found almost nothing about potential trauma in his field.\n\n\"If you're asking someone to look closely at materials like that, then they need to be fully aware of what it is that they're about to do,\" he said.\n\nIn May, Winter wrote publicly about the mental toll of extremism study. Tucked into a broader essay about studying jihadi propaganda, Winter included a section called \"Recognizing and Addressing Trauma.\" The piece swiftly made the rounds among burned-out researchers, including several who had switched from tracking jihadis to white supremacists without a break.\n\nISIS attacks abroad and a series of deadly right-wing attacks in the U.S. have fueled a demand for more information on extremist networks. Understanding them is the first step in fighting them. But there has been little discussion about potential harm to the researchers tasked with looking deep inside the world's most dangerous movements.\n\n\"There was a lot of talk about how grim this stuff was to look at,\" Winter said, \"but it's only really recently that there have been the beginnings of more serious conversation about what working with this stuff could mean or could do.\"\n\nISIS at the dinner table\n\nSeamus Hughes is a star researcher at George Washington University's Program on Extremism. He's known for digging through court filings for revealing details in terrorism investigations.\n\nWhat's less known about Hughes is why he began focusing on the document side of his field: He was sick of watching ISIS videos.\n\n\"Yeah, it was actually the main reason why,\" Hughes said. \"It was really just to clear my mind.\"\n\nAfter years of studying violent jihadis, Hughes said, his brain was crammed with their slogans and pictures. One that haunts him is of a child sniper from ISIS. Hughes is a father of two, with another on the way. That photo of the boy, he said, wrecked him.\n\nNational Authorities Have Few Tools To Fight Far-Right Extremism Online Authorities Have Few Tools To Fight Far-Right Extremism Online Listen · 3:44 3:44\n\n\"It's the type of thing that nobody really talks about in the field. Or they do talk about it, in whispers after a few drinks at a conference,\" he said. \"You look at violent imagery all day, and it gets to you. And you want to tell yourself it doesn't, but it does.\"\n\nThe risks that have always accompanied this line of work came into sharp relief with ISIS. Before the Islamic State, academics had to dig for a glimpse inside shadowy terrorist groups. ISIS posted operations online, pushing extremism into the social media age. The group also launched a magazine and filmed highly choreographed execution videos designed to shock viewers.\n\n\"All of their fighters were on Twitter and Facebook and Instagram, and they were putting out videos nonstop. So all of a sudden we went from waiting for scraps of paper from the mountains of Tora Bora from al-Qaida to all of a sudden having an abundance of data,\" said Amarnath Amarasingam, a terrorism researcher and assistant professor at Queen's University in Canada.\n\nISIS made for a field day for researchers, and Amarasingam says many plunged into the material without stopping to process it. He said it was hard to set boundaries and keep work at work when so much of the content popped up on his smartphone, often at unwelcome times.\n\n\"I would be at a dinner table with my wife and kids, and I would be talking to ISIS fighters about sex slavery,\" he said. \"So, yeah, it kind of starts to permeate your life in a weird way.\"\n\nAmarasingam said he could use the assistance of a grad student, but he can't bring himself to expose a young person to the kind of materials he sees. He has tried to restrict his own interactions with the imagery — he now has automated data scrapers to collect information in bulk, allowing him to search for what he needs without seeing the whole collection.\n\nWith a resurgence of right-wing violence, Amarasingam said, terrorism researchers who once focused on jihadis now have another canon of stomach-turning propaganda to investigate. The hate speech in mass-shooter manifestoes. Livestream footage of racist killing sprees. Dehumanizing memes. Threats to mosques and synagogues.\n\n\"There's no actual training for what might happen to you,\" Amarasingam said. \"What you might go through by constantly being exposed to this kind of content over a long period of time.\"\n\n\"The worst of humanity\"\n\nExtremism researchers list several reasons for the culture of silence around the mental stress of their jobs. There's guilt about complaining from an ivory tower. There's detachment as harmful content is reduced to \"data.\" And then there's the pace.\n\n\"In the past few years, the sector has grown so quickly and the problem has evolved so fast that maybe there's not been a kind of pause point for people to sit back and think, 'Oh, wow, we've been doing this for a few years now without considering the effect on our mental health,' \" said Chloe Colliver, who leads digital research at the Institute for Strategic Dialogue, a security think tank in London.\n\nThe Institute for Strategic Dialogue is among a few institutions now taking steps to raise awareness about the mental health of their personnel. Some places are making counselors available; others are restricting the amount of time researchers — especially graduate students — spend with extremist materials.\n\nColliver said the field is only at the beginning of acknowledging the problem. She'd like to see the discussion brought up at professional conferences and in trade publications. Others have called for agreed-upon research protocols and better mental health resources.\n\n\"I look at my colleagues and myself, and I see slightly angrier, more cynical people than I saw a year ago or two years ago, and that makes me sad,\" Colliver said. \"And I think a lot of that is to do with having to, day in and day out, face up to the worst of humanity.\"\n\nElana Newman, a University of Tulsa psychology professor who studies the effects of trauma, said interest is growing in what's known as \"vicarious trauma\" — violence experienced secondhand by law enforcement personnel, journalists, academics. Many of those affected say they're ashamed to admit they're struggling — after all, the violence didn't happen to them.\n\nNewman said it's healthy for researchers to acknowledge that they are witnesses with the fortune of being able to walk away. Still, she said, studies have shown that seeing violent scenes can cause nightmares, anxiety, fear. That's not weakness, she said — it's biology.\n\nNational El Paso Mass Shooting Meant To Galvanize Other White Nationalists El Paso Mass Shooting Meant To Galvanize Other White Nationalists Listen · 3:54 3:54\n\n\"When you see a dangerous thing happening — it doesn't matter if you're part of it or not — your body is experiencing the danger, and that's evolutionarily important,\" Newman said. \"It's like, 'Oh, there's danger out there — I gotta respond to it.' \"\n\n\"It's really important to not feel ashamed or stigmatized because you're having a natural response to seeing awful things,\" she said.\n\nExtremism researchers swap best practices, sometimes gleaning tips from social media content moderators, journalists and other professionals who are also exposed to violence. The Dart Center for Journalism and Trauma has compiled a list of suggestions for watching violent imagery, including turning the sound or color off, splitting the video into still frames and taking deep breaths.\n\n\"Don't underestimate the value of being open with colleagues about the intense nature of material you are dealing with,\" the Dart Center advises. \"It may also encourage others to be more proactive in taking care of themselves.\"\n\nAlex DiBranco, a Ph.D. candidate at Yale University whose research topics include the misogynistic incel movement, said she was forced to come up with her own coping mechanisms because mental health resources for students are scarce or hard to access. For example, she addressed the isolation of her work by moving to California, where she's part of a cohort of researchers looking at similar ideologies.\n\nAnd, she said, she tries to limit her time in front of screeds that refer to women as subhuman.\n\n\"I just can't sit for an eight-hour workday and read misogynist rhetoric nonstop,\" DiBranco said. \"So I have a little bit of a system for giving myself a break after each really appalling thing that I read.\"\n\nHer system: regular breaks to go fight some bad guys in a video game. DiBranco said it's about escapism, a pick-me-up in a field that's relentlessly bleak.\n\n\"You're the good guys,\" she said. \"You feel accomplished — you finish quests, you're defeating evil.\"", "description": "Day after day, researchers are immersed in the propaganda of ISIS and neo-Nazi factions. But there's almost no discussion of the mental toll of examining the world's most dangerous extremists.", "authors": ["Hannah Allam"], "top_image": "https://media.npr.org/assets/img/2019/09/19/gettyimages-1055621250-edit_wide-0f6f02296ff910cc8975e1343cd0aeb2c3689784.jpg?s=1400", "published_at": "2019-09-20"}