{"pub": "fox", "url": "https://foxnews.com/us/michael-avenatti-suing-stormy-daniels-for-2-million-allegedly-owed-in-legal-fees", "downloaded_at": "2019-10-04 01:22:27.225998+00:00", "published_at": "2019-10-03", "title": "Michael Avenatti files claim against Stormy Daniels for over $2M allegedly owed in legal fees", "language": "en", "text": "Attorney Michael Avenatti filed a lien claim Thursday against his former client, adult film actress Stormy Daniels, seeking more than $2 million \"for legal services rendered and costs and expenses advanced.\"\n\nThe hot-headed lawyer known for direct messaging his critics on Twitter then promptly blocking them filed the lien in Columbus, Ohio federal court six days after Daniels reached a $450,000 settlement with the city over her arrest at a strip club where she was performing last year. Daniels had claimed that officers conspired to retaliate against her over her claims that she had sex with Donald Trump in 2006, long before he became president. She was arrested on suspicion of inappropriately touching an undercover officer following a performance at Sirens in July 2018, but the city attorney's office dropped charges within hours.\n\nThe filing argues that Avenatti should get first crack at the Columbus settlement money, saying: \"no net settlement proceeds or fees are to be distributed to Ms. Daniels or any of her attorneys without the express, written agreement of Mr. Avenatti and/or a full adjudication of this lien pursuant to California law.\"\n\nAvenatti also claims that Daniels, whose real name is Stephanie Clifford, had not paid him any money for his services to her apart from what the lien notice described as \"a $100.00 [not a typo] up-front payment.\"\n\nMICHAEL AVENATTI CUTS TIES WITH STORMY DANIELS\n\n\"Despite repeated demands that Ms. Daniels fulfill her contractual obligations and pay for the millions of dollars in legal fees and costs she has enjoyed for her benefit over the last approximate 19 months ... she has refused,\" the lien continues. \"Instead, Ms. Daniels maintains that because she is a 'celebrity,' she is entitled to free legal services and costs, and when confronted with her repeated failure to pay, she believes that she is entitled to manufacture and fabricate facts designed to impugn the reputation of her counsel and falsely accuse him of a multitude of acts.\n\n“But the law does not work that way Ms. Daniels wishes,” the lien notice read.\n\nDaniels' new attorney, Clark Brewster, said he believes Avenatti filed the lien \"out of the blue to create some kind of narrative.\"\n\n\"He never had a fee agreement... you can't obtain a fee without a written agreement,\" said Brewster. He said the professional arrangement between Daniels and Avenatti made it clear he would be paid in the form of a defense fund and a defense fund only, from which Avenatti received around half a million dollars. Brewster said that Avenatti has never even sent Daniels a bill, and he did not say he was owed money when they terminated their attorney-client relationship earlier this year.\n\n\"Simple question, could you send us the bills you sent Stormy?\" Brewster asked, directed at Avenatti. \"In truth in fact he did almost no legal work, all PR stuff. Legal representation, not much, filed a couple of lawsuits, that’s it.\"\n\nThe notice filed Thursday claims that Avenatti terminated his professional relationship with Daniels in mid-February 2019, saying she had become “increasingly difficult, uncooperative, erratic and unpredictable.” The notice also alleged that Daniels began falsely accusing many closely aligned with her of theft, which \"in some instances were targeted at friends of 20 years and her private security detail.\"\n\nAVENATTI INDICTED ON CHARGES OF DEFRAUDING STORMY DANIELS, IDENTITY THEFT\n\nDaniels and Avenatti became household names in March of 2018 after she retained his services to sue Trump to nullify a hush-money deal in which his then-personal attorney Michael Cohen paid Daniels $130,000 days before the 2016 election to keep quiet about the alleged affair.\n\nCohen pleaded guilty in August of that year to committing campaign finance violations by arranging the payment, saying he did so at Trump’s direction. Cohen is serving three years in federal prison. Trump has denied any wrongdoing.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nAvenatti was indicted in May on charges that he cheated Daniels of $300,000 that was owed to her through a Manhattan-based book deal. He also is charged by federal prosecutors in New York with trying to extort up to $25 million from shoe giant Nike by threatening to reveal allegations that Nike facilitated payments to the families of college basketball players to steer NBA-bound talent toward Nike-sponsored schools.\n\nIn California, Avenatti faces various charges, including allegations that he embezzled millions of dollars from clients, failed to pay taxes and concealed assets from bankruptcy court.\n\nHe has pleaded not guilty to all charges.\n\nThe Associated Press contributed to this report.", "description": "Attorney Michael Avenatti filed a lien claim Thursday against his former client, adult film actress Stormy Daniels, seeking more than $2 million \"for legal services rendered and costs and expenses advanced\"  in connection with the pair's lawsuit against President Trump and other matters.", "authors": ["Morgan Phillips"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/02/ContentBroker_contentid-64d8cbcff5d54c93b65ed4248ee00a83.png"}