{"pub": "theverge", "url": "https://theverge.com/2019/9/10/20858834/amazon-fire-brazil-forest-harm-recovery-century", "downloaded_at": "2019-10-05 15:04:23.430134+00:00", "title": "Burned areas of the Amazon could take centuries to fully recover", "language": "en", "text": "The Brazilian Amazon continues to burn. As international leaders call for action and the Brazilian military attempts to battle the flames, researchers have started to warn that if the spate of fires continues to spread into the forest, the flames could bring a massive transformation to the region. The process could turn once-moist jungles into dry wastelands, killing ancient trees, making them more vulnerable to future fires and releasing millennia of trapped carbon into the air.\n\nIt’s still unclear how much harm the tens of thousands of recent blazes, most of which have been linked to a spike in slash-and-burn deforestation, will end up causing. However, decades of research provides a picture of what may happen next. When the Amazon burns, the consequences are often devastating because the ecosystem evolved for millions of years without fire. Amazonian trees simply lack the necessary adaptations to survive the heat, says Ane Alencar, a geographer at the Amazon Environmental Research Institute in Brasília.\n\nPast studies conducted near the city of Manaus, in the heart of the Amazon, have demonstrated that when some areas are chopped down but not burned, then fast-growing trees with large leaves that branch out like a candelabrum start appearing, providing shade and cooling the air. Over time, some of the plants that originally occupied the land can regrow from surviving sprouts or seeds buried in the soil or brought by visiting birds and other animals.\n\nThe resulting environment is dark and humid. “It looks and feels a little more like a forest,” says Emilio Bruna, a tropical biologist and director of the Florida-Brazil Linkage Institute at the University of Florida.\n\nScorched forests do not recover so easily. A few years after a fire burns through an area of the Amazon, the lush vegetation is often replaced with a dense patch of scrawny trees that take up most of the space. The flames can also kill the seeds of other species, and scientists have observed that many birds tend to stay away. “You walk into a burned area and you notice it’s brighter, it’s hotter, and it just feels drier,” says Jos Barlow, an ecologist at Lancaster University in Lancashire, England. Barlow started working in the Brazilian Amazon in 1998, a time when the smoke and flames of forest fires shut down airports, increased hospitalizations, caused blackouts, and cost the country $5 billion in damages.\n\nthe smoke and flames of forest fires shut down airports, increased hospitalizations, caused blackouts, and cost Brazil $5 billion\n\nEarlier this year, an international team looked at 56 sites spread across 10 countries in the Americas to study how these tropical forests, both burned and unburned, regrow over time. The results of the study suggest that they can recover about 80 percent of the tree species they lost within 20 years. “The thing is that [50] years later you still don’t have a regenerated Amazonian forest,” explains Bruna. Though after half a century, the number of tree species is the same as before, the study concludes, centuries will need to pass until the abundance of those species goes back to normal.\n\nEven beyond regrowth, the effects of fires can be long-lasting.\n\nIn the years after a fire in the Amazon, the larger trees — some of which can be a 1,000 years old — start to die. The causes are varied, according to Barlow. Some of the roots and trunks that normally hold the trees in place might have been damaged, making them more vulnerable to be thrown by the wind. The flames might also open them up to diseases, allowing pathogens and termites to move in.\n\n“You’re not going to have an equivalent rainforest for hundreds of years. And that’s hundreds of years we don’t have.”\n\n“You’ve taken thousands and thousands of years of carbon accumulation, you’ve vaporized it and you’ve put it into the atmosphere,” explains Bruna. “You’re not going to have an equivalent rainforest for hundreds of years. And that’s hundreds of years we don’t have.”\n\nIn 2018, for example, a group of Brazilian scientists discovered that once-burned forests across the Amazon hold 25 percent less carbon than those that were not set ablaze, even after 31 years of regrowth.\n\nThe record-breaking fires at the Amazon have caused great concern among Brazil’s scientific community. “I’m really afraid that we go back to the 90s. Those were very difficult years,” says Alencar, who witnessed the consequences of the blazes at the time. “Brazil lost a lot during that period.”\n\nUltimately, what happens next depends on how the Brazilian government chooses to respond.\n\nIn an attempt to douse the fires, President Jair Bolsonaro’s administration signed a 60-day national decree on August 28th, prohibiting people to light up the forest. But some feel skeptical about whether this measure will provide much-needed relief.\n\n“The peak of the dry season will still be hitting the Amazon in 60-days’ time, when that moratorium is lifted,” says Barlow. With no environment agency on the ground enforcing it, Bolsonaro’s decree might be ineffective, he adds.\n\n“I’m alarmed and concerned.”\n\n“I’m alarmed and concerned,” Barlow tells The Verge. “I’m frustrated because I know that actions could be taken to actually make the lives of local Amazonians better” and protect the remaining rainforest. It’s been done before. Between 2005 and 2012, deforestation and forest fires in Brazil declined significantly. The country also expanded its protected areas and promoted nationwide campaigns to educate people on how to prevent accidental fires.\n\nTo date, about 80 percent of the Brazilian Amazon remains standing. The areas that have been torched in the past few months will suffer changes, but the most drastic ones could still be avoided. Once a patch of forest burns, Barlow explains, it’s more likely to go up in flames again with renewed force, which is why preventing the fires from spreading and from occurring in the future should be a top priority.\n\nLuckily, the past shows that this is possible with increased education and protection. These measures don’t need “to be high-tech or particularly difficult,” says Barlow. “They just require will.”", "description": "The Brazilian Amazon continues to burn. As international leaders call for action and the Brazillian military attempts to battle the flames, researchers have started to warn that if the spate of fires continues to spread into the forest, the flames could bring a massive transformation to the region.", "authors": ["Emiliano Rodríguez Mega", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/K-Rov6M7UoIniYDFbnbh3HcvoCo=/0x302:4288x2547/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19184784/DSC_0180__1_.jpg", "published_at": "2019-09-10"}