{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7630071/Vintage-Halloween-pictures-homemade-costumes-brought-chills.html", "downloaded_at": "2019-10-30 12:32:41.534632+00:00", "title": "Vintage Halloween pictures show the homemade costumes that brought out the chills", "language": "en", "text": "Advertisement\n\nThese haunting pictures show vintage Halloween costumes from as early as the 19th Century - and they're quite different to what we're used to today.\n\nThe sinister snaps, from the late 1800s and early 1900s, show home-made outfits that appear utterly bizarre to the modern viewer.\n\nThe fascinating collection was mostly collated by English artist Ossian Brown for his book Haunted Air, revealing a time when revellers could not simply pick up an outfit from the local supermarket.\n\nThose celebrating Halloween would go to great lengths to get into the festive spirit by hand-making their own costumes.\n\nThe spooky snaps, from the late 1800s and early 1900s, show home-made outfits that appear utterly sinister to the modern viewer. Pictured is two little girls posing in their sinister Halloween masks circa 1940 in the US\n\nThe fascinating collection was mostly collated by English artist Ossian Brown for his book Haunted Air, revealing a time when revellers could not simply pick up an outfit from the local supermarket. Pictured: A child poses with a frightful clown mask\n\nOne image shows a man in a pig mask, which some have speculated is a real pig’s head, standing outside of a door that seems to say ‘women only'\n\nAnother photo shows a man in a woman’s outfit wearing a bizarre mask with a head scarf wrapped around it, as the subject reclines on the arm of an arm-chair\n\nOne image shows a slim man wearing a skeleton costume in Atlantic City, New Jersey in the early 20th Century. The spooky images taken in the late 19th and early 20th centuries, show home-made outfits that appear simply terrifying to modern eyes\n\nOne image shows an unidentified person with pigtails and a hockey mask, clutching a doll and a teddy bear - a truly chilling sight\n\nThe anonymous images are taken from 1875 to 1950 and are generally believed to be taken in America. Pictured left: A home-made costume from circa 1890. Right: A skeleton outfit thought to be from the 1950s\n\nOne image shows a slim man wearing a skeleton costume in Atlantic City, New Jersey in the 1930s.\n\nOther images are far more unnerving such as a man in a pig mask, which some have speculated is a real pig’s head, standing outside of a door that seems to say ‘women only.’\n\nAnother photo shows a man in a woman’s outfit wearing a bizarre mask with a head scarf wrapped around it, as the subject reclines on the arm of an arm-chair.\n\nOne image shows an unidentified person with pigtails and a hockey mask, clutching a doll and a teddy bear - a truly chilling sight.\n\nThe anonymous images are taken from 1875 to 1950 and are generally believed to be taken in America.\n\nHaunting: These two children wear what seem to be hand-painted masks with bold features and thick eyebrows, circa 1940\n\nFrightening: Three young children in their home-made Halloween costumes, circa 1940, in the US. A smiling Jack-o'-lantern is seen atop the table in the bottom right\n\nA cat... or maybe a dog? This sleek animal-inspired costume comes with a leash around the wearer's neck, held by a couple in the background who are wearing more traditional attire\n\nA very home-made ghost outfit, USA, circa 1930s, seemingly made from a simple sheet and holes poked through for eyes\n\nThe spooky snaps from the late 1800s and early 1900s show home-made outfits that appear utterly bizarre to the modern viewer. Pictured: Three mask-wearing revellers in the US, circa 1930", "description": "The fascinating collection of 18th and 19th Century costumes, largely from the United States, was mostly collated by English artist Ossian Brown for his book Haunted Air.", "authors": ["Henry Martin For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/12/20373570-0-image-a-127_1572437656630.jpg", "published_at": "2019-10-30"}