{"pub": "nymag", "url": "https://vulture.com/2019/09/bachelor-in-paradise-recap-season-6-episode-10-week-five.html", "downloaded_at": "2019-09-04 23:48:16.258217+00:00", "published_at": "2019-09-04", "title": "Bachelor in Paradise Recap: New Romantics", "language": "en", "text": "Bachelor in Paradise Week Five, Part Two Season 6 Episode 10 Editor’s Rating 3 stars * * * * * « Previous Next » Photo: Bravo\n\n“Kristina, I’ve been doing a lot of thinking, and the thing is, I’m all in with you.”\n\n“What?”\n\n“I’m all in with you.”\n\n“How do you expect me to respond to this?”\n\n“How about, you’re all in, too?”\n\n“How about ‘I’m going to continue to have a bizarre psychosexual entitlement to your time and your rose while still pursuing other men half-heartedly?’”\n\n“Doesn’t what I said mean anything to you?”\n\n“I’m sorry, Blake. I know it’s week five of Paradise. I know you’re feeling lonely. But you can’t just show up in this palapa, tell me you’ve decided you have no other options, and expect that to make everything right. It doesn’t work this way.”\n\n“Well, how does it work?\n\n“I don’t know, because it seems like neither of us are capable of the introspection required to have a successful relationship.”\n\n“How about this way: I’m all in for the way you’ve roasted me on all social media platforms. I’m all in for the fact that it takes you a half hour to order a margarita because Wells and Demi are busy giving us bad relationship advice. I’m all in for that look on your face when I’m being a privileged asshole. I’m all in for the way I can still see your highlighter on my chest after we hug awkwardly. I’m all in for the fact that you’re the last person I want to talk to before I go to sleep at night because you’re the only human woman willing to talk to me. And it is because I’m lonely. And it is because it’s week five. I came here to this daybed because when you realize you’re about to be eliminated from a reality TV show, you want to stop that from happening as soon as possible.”\n\nIn the wake of Derek’s untimely departure, Blake is ruminating on the idea that maybe he should do the same thing, but instead of coming to a mature conclusion to remove yourself from a situation that’s bad for you, Blake decides that he’s obviously meant to be with Kristina.\n\nWait. What? This is what we’re doing? My God. This shit is bleak. Also, you can tell that Blake really comes alive when he has to convince a woman to be with him. He loves nothing more than wearing a woman down.\n\nAlso, Derek’s absence means that John Paul Jones … won? And that Tayshia has to be with him now? John Paul Jones sits down with Tayshia to let her know that he doesn’t want to put any pressure on her, which would mean a lot if it weren’t coming from someone who ruined a stranger’s wedding just to defend her honor. Tayshia tells him that he can’t put an ultimatum on her and that he has to trust that she’s able to make her own decisions and that she’s smart. Listen, Tayshia definitely could have very real feelings for JPJ. Unfortunately, the strongest way she’s able to express those feelings is, “Well, he’s so sure about me and he’s a romantic who is willing to do anything for me.” If this were a Lifetime movie, that’s exactly how the protagonist, Perstephanie, would describe her future murderer in Tinder in the First Degree.\n\nWhen you buy into so many myths and stories about “romance” and “soul mates,” it’s really easy to confuse someone’s unhealthy infatuation with you as an actual romantic interest. JPJ is obsessed with Tayshia because he’s decided at 24 that he’s tired of searching for a wife and he’ll never meet another woman like Tayshia. They spent, like, a full week not talking while Tayshia was pursuing Derek and JPJ was blowing his nose into a crab’s little hole in the sand. What is this relationship based on? You’re not allowed to say “chemistry.” “Chemistry” just means “we want to bang each other,” and you can scratch that itch real easy. Instead, Tayshia is looking at a man who runs into the ocean with his chinos on and catches a fish with his bare hands and is thinking, Maybe we have potential.\n\nMeanwhile, Clay is moping because he doesn’t like that he has to see his ex dating his friends in Paradise. Everyone around him seems completely incapable of reconciling that someone wouldn’t want to get back together with their ex but also doesn’t want to see them prospering. There are exes who I would happily let my mom run over with her car, and she’s offered, but that doesn’t mean that I would want to sit on a balcony and watch them go on a date with whatever boring-ass bitch they date after me.\n\nWhat is more telling than the fact that Clay is able to support having more than two feelings inside his body at a time is that he’s unable to keep these feelings separate from how he feels about Nicole. Instead of Nicole freaking out that Angela has some master plan that she’s just waiting to enact, she should be asking her boyfriend a question, not being his counterweight during a beach workout.\n\nAngela and Clay sit down during the cocktail party to chat about their issues, and it seems like part of Clay’s problem with the relationship was that Angela didn’t want to spend almost four hours at the gym with him. Bitch, I get it. It also seems like Clay decided that Angela was looking for someone to support her in her pursuit to be a wife and mother and he … didn’t want to do that. Angela is mostly confused and frustrated by Clay’s rewriting of their relationship, and she reminds him that she’s not a drama person. Apparently, that’s good enough for both of them and they’re off to date Chase and Nicole. Nicole still thinks that Angela has a sneaky li’l plan and makes fun of her behind her back. Girl Power!\n\nIt’s time for the rose ceremony and THIS IS BULLSHIT. Sure, sure, sure. There was a whole thing where Old Matt Donald won’t kiss Sydney because his mom will freak out that her adult son is semi-passionately kissing another adult. BUT THE REAL TRAGEDY is that we have to say good-bye to Mike Johnson. If the rumors are true, we won’t be getting more Mike on our television as our next Bachelor. The fact that we won’t be seeing the radiant smile of Mike Johnson on our screens every week is a nightmare. The idea that almost any woman on earth wouldn’t be interested in MIKE is laughable. How can I fix this? What can I do? Can I offer my body as tribute?\n\nBut we gotta talk about the fact that when Matt and Sydney finally do kiss, the show suddenly turns into a nature documentary; there’s footage of crabs waving their claws in the air and turtles singing songs of triumph. This show cannot turn into a self-referential meta romp and be an earnest exploration of love at the same time.\n\nIt’s time for the roses to be handed out. Nicole gives hers to Clay. Angela gives hers to Chase. Kristian gives hers to Demi. Okay — can I pitch something here? Demi should have been a bartender on this season, and when it was time for the final proposals, the show should have flown Kristian in like they did with Jared and Ashley I. That way the show gets its LGBTQ moment and we’re saved a series of baffling rose ceremonies.\n\nHannah gives her rose to Dylan. Katie gives her rose to Chris. Haley gives hers to Luke? I guess? Caelynn gives hers to Connor. Sydney gives her rose to Matt. Tayshia gives hers to JPJ, and Kristina gives her to Blake, proving again that a man’s assurances that he’s a good person are more important than a woman’s intuition.\n\nThe next day in Paradise, everyone is pretty coupled up — but there’s a new arrival! It’s Bri. Blake tells Kristina that although Bri is beautiful, she’s stunning, she looks like Linda Evangelista, and Blake is totally fine to spend the day with Kristina. Even though he told the producers that he was really interested in meeting Bri and he hoped she would be joining them in Paradise. Even though Bri really wants to take him on the date. He’s gonna stick with the woman he’s already slept with. Emotional maturity!\n\nFinally, as the sun crests over Paradise, there’s one more new arrival. After we were forced to watch him shave his mustache, Dean has returned to Paradise. He has spent a lot of time doing some introspection and self-reflection (in the four days since his last rose ceremony) and has decided that he will never be a perfect person, so why let his flaws and deep character deficiencies keep him from having a relationship! That’s for Caelynn to figure out! You’re probably saying that “self-reflection without meaningful action is just a road trip to the Grand Canyon while you listen to sad music!” and you’d be right! And why come back now instead of waiting to approach her in the real world? Because she might be “developing feelings for someone else” and Dean can’t stand for that! Long Michael Cera watches on with fear in his eyes and hate in his heart. Meanwhile, all the women talk about how much love Caelynn has in her heart for Dean and how her entire relationship with Connor is a projection of her feelings for Dean onto him.\n\nDean has a proposition for her: Leave Paradise with him and be his emotional nanny while he takes absolutely no responsibility for his actions.\n\nTo be continued …", "description": "Blake really comes alive when he has to convince a woman to be with him. He loves nothing more than wearing a woman down. A recap of “Week 5, Part Two” of “Bachelor in Paradise,” season six, episode ten.", "authors": ["Ali Barthwell"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/03/recaps/03-bachelor-in-paradise-recap-1.w1200.h630.jpg"}