{"pub": "guardian", "url": "https://theguardian.com/fashion/2019/oct/05/mens-fashion-long-scarves-doctor-who-sylvester-mccoy-tim-dowling", "downloaded_at": "2019-10-05 12:22:29.882116+00:00", "title": "Extermiknit! Extermiknit! Doctor Who scarves tested by a Time Lord", "language": "en", "text": "The long scarf is going large this season – so who better to model it than the seventh Doctor, Sylvester McCoy?\n\nSylvester McCoy, the seventh Doctor in the long lineage of Time Lords, admits he did not know the extremely long scarf was one of this season’s catwalk trends.\n\n“Really, they’ve got the wrong Doctor for this,” he says. “I just brought it back as an homage to Tom Baker.” Baker, the fourth Doctor, sported a signature brightly coloured scarf that was easily 12 feet long. For his tenure, McCoy chose a more modest paisley affair.\n\nStill, McCoy reckons his lifelong predilection for scarves may have helped him get the role. “People always said to me: ‘You’d make a good Doctor!’” he says. “And I thought: ‘I might try this.’” He put himself forward when Peter Davison left in 1984, but the part had already gone to Colin Baker. Two years later, when Baker was pushed out, McCoy got his chance.\n\n“I didn’t know anything about the show,” he says. “I hadn’t seen it for years, because I was always working in the theatre.”\n\nOne of the things he’d missed was the acrimony surrounding his predecessor’s departure. Baker declined to shoot the traditional regeneration scene for the new season, leaving McCoy to play both sides of the transformation. “They put me in his costume,” he says, “and they lost me for three days, ’cos he’s a big fella.”\n\nUnder the hot lights of today’s photoshoot, it becomes clear that McCoy was born to model scarves. Each one becomes a prop for another hastily adopted role: pilot, priest, matador. He is a man of obscure dexterities - he can, for example, move the brim of his hat up and down with his eyebrows, using his ears as a fulcrum. He seems to favour the longest and the brightest (he can do more with these) although the scarf he turned up in today is short and sober, black with white polka dots. He seems perplexed by a wide scarf with a hole for your head (from A Cold Wall), and decides to wear it as a priestly vestment, staring heavenward while the photographer snaps.\n\nMcCoy was born Percy James Patrick Kent-Smith in Dunoon, Scotland in 1943. As a young man he moved to London and spent five unhappy years working in the City. “I was terrible at it!” he says. “I mean, really bad.” He was working in a theatre box office when he was discovered by the writer and performer Ken Campbell.\n\n“He said: ‘’Ere, d’you want a job in my show?’” (The impersonation is eerily like the late Campbell.) “I said yes. I always say yes, and then work out how to get out of it, but this time I couldn’t. So I ended up becoming an actor.”\n\nThe Ken Campbell Roadshow was a rowdy mix of sketches, songs, jokes and gleeful vulgarity. Joining a cast that included a young Bob Hoskins, McCoy played a stuntman called “Sylveste McCoy, the Human Bomb”, who put ferrets down his trousers and hammered nails up his nose. With the addition of an R, his stage name was born.\n\nIn 1972, after touring the working men’s clubs of Britain, the roadshow received an invitation to perform in Israel, where they alarmed and bewildered audiences for a week. “They thought they’d booked the Glen Campbell Roadshow,” says McCoy. “They eventually forgave us.”\n\nMcCoy spent a dozen years working in children’s TV (Vision On, Jigsaw, Tiswas) and theatre before he got the call-up to star in Doctor Who in 1987 (Campbell was also up for the role, but deemed too scary). In his early outings, he was a clownish Doctor – he played the spoons and did magic tricks – but over time McCoy and the writers decided to access something ambivalent in the character. “It went darker and more mysterious,” he says.\n\nHe was saddled with one unfortunate bit of wardrobe as the Doctor: a multicoloured pullover with question marks all over it. “I thought it was overstated,” he says, “but the producer wanted it. I think his granny knitted them.” The novelty jumper certainly undermined a lot of his darker scenes. “If we’d done a fourth season I would have got rid of it, because by then I had the muscle.”\n\nIt was not to be: for a long period McCoy seemed destined to be best known as the final Doctor. “I was the one that killed it off, yeah,” he says. Yet after the successful resurrection of the franchise, McCoy’s three-dimensional Doctor is now seen as something of a prototype for the 21st-century incarnations. These days he is as busy as ever, working in film, TV and theatre; he even lives on as the Doctor in a popular audio series.\n\nFor the final shot of the day, McCoy drapes himself in every available scarf – a dozen or more. “Go on, pile them on,” he says, standing patiently while wrapped to the eyeballs, until he softly confesses that one of his knees is beginning to go. The scarves are removed. He is released.\n\nFacebook Twitter Pinterest Scarves as before, plus red tartan, £17.99, hm.com. Orange, £66, gestuz.com. Blanket, £390, beggandcompany.com. Check, £45, marksandspencer.com. Beige (on floor), £110, acnestudios.com. All other clothes, Sylvester’s own. Photographer’s assistant: Melinda Davies. Grooming: Nandi Kai at S Management using Bumble and bumble and Nars\n\nFour flights of stairs later, down in the street, McCoy waits for his ride home, looking impeccable in his own clothes – scarf, suit, braces, tie, cane – and not unlike his old incarnation.\n\n“Someone once asked me what advice I would give a new Doctor,” he says, “and I said: ‘Don’t wear what you really like to wear.’ For years, I couldn’t go out in a hat.”\n\nA car stops at the lights, and a dog sitting in the passenger seat looks him up and down.\n\n“Hello!” shouts McCoy, waving. The dog stares.\n\nThis article contains affiliate links, which means we may earn a small commission if a reader clicks through and makes a purchase. All our journalism is independent and is in no way influenced by any advertiser or commercial initiative. By clicking on an affiliate link, you accept that third-party cookies will be set. More information.", "description": "The long scarf is going large this season – so who better to model it than the seventh Doctor, Sylvester McCoy?", "authors": ["Tim Dowling", "Helen Seamons", "David Newby", "Words"], "top_image": "https://i.guim.co.uk/img/media/eef0daf9be2ee1fd26b8eb6dc8659e4e61932e0b/317_497_5678_3407/master/5678.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0e935aa845c42a73be09a7265e0f4536", "published_at": "2019-10-05"}