{"pub": "huffpost", "url": "https://huffpost.com/entry/robert-emmons-challenge-democrat-bobby-rush-illinois_n_5da4f71be4b08f36548f91cf", "downloaded_at": "2019-10-17 10:31:57.940689+00:00", "title": "This Young Progressive Candidate Wants To End Everyday Gun Violence In Chicago", "language": "en", "text": "Gun violence activist Robert Emmons Jr. is 27 years old and running for Congress in Illinois’ 1st District, seeking to unseat Democratic Rep. Bobby Rush, who’s been in office for most of Emmons’ life.\n\n“We know what causes gun violence in our district,” Emmons said in his campaign video. “It’s not lack of morals... it’s systemic poverty, it’s educational inequity.”\n\nHe sees the solutions to gun violence in his district and beyond not as more law enforcement or even stricter gun laws ― Illinois already has some of the strictest gun laws in the country ― but rather as providing a living wage, making health care affordable, eliminating student debt and more.\n\n“That’s why I’m running: To make this the very last generation to be faced by everyday gun violence by addressing it by its root causes,” Emmons told HuffPost. “It’s looking at what causes everyday gun violence: systemic poverty, a racist criminal justice system, our young people not having access to upward mobility.”\n\nHe hopes to challenge the myths people perpetuate about communities like his that suffer from everyday gun violence ― and what the solutions are to address it.\n\n“I hear a lot of mumbo jumbo saying young people in my community that look like me lack values or morals or it lies on the parents ― it’s none of those,” Emmons said, noting the city has under-resourced schools and lead in its drinking water. Last year, Chicago schools serving low-income Black students were twice as likely as others to have a yearlong teacher vacancy, according to NPR.\n\n“It’s not a lack of morals or values ― our parents are doing the best they can in a system that isn’t designed for them to be successful, to fully be in the household, because they’re working two to three jobs,” Emmons added.\n\nBut Emmons, who is Black, faces long odds against Rush, who is also Black and is known for his years of fighting for civil rights in the 1960s. Rush, who co-founded the Black Panther Party in Chicago in 1967 and was first elected to Congress in 1992, won the largely Democratic district last year with more than 73% of the vote.\n\nIn our community, we march for our lives every single day. We ought to live in a world in which we don’t have to.\n\n\n\nJoin our pursuit of peace and be a part of the solution.https://t.co/FqSF7OI7Iwhttps://t.co/7k7jAMKy0I pic.twitter.com/YtjfWyUJ4r — Robert Emmons Jr. for US Congress (@remmons2020) August 15, 2019\n\nEmmons, born in the small town of Mays Landing, New Jersey, says he “became the man I am today” on Chicago’s South Side, where he and his sister moved to live with their grandparents when he was about 13. He says that’s the first time he saw everyday gun violence “up close and personal.” Every couple of months, his teachers would pull him and his classmates into their school auditorium to tell them someone had died in a shooting.\n\nAfter graduating from the University of Illinois at Urbana-Champaign in 2017, he juggled different roles in what he calls “social innovation,” including as a program manager with One Goal, a group that helps students in underserved communities get into college, which helped him as a high schooler. He also consulted with the Obama Foundation as a youth community leader.\n\nWhen asked about his opponent, Emmons started off by saying how much he respects Rush’s years of activism in decades past. Rush, who was a member of the Student Nonviolent Coordinating Committee in the 1960s, lost his son to gun violence on the South Side in 1999.\n\nBut Emmons noted Rush’s support for the 1994 crime bill, which many have since criticized as leading to the over-incarceration of people of color, notably through so-called “three strikes” laws that mandate harsh sentences. (In 2016, Rush said he felt “ashamed” of voting for the bill.)\n\nHe also criticized Rush’s acceptance of corporate PAC money to his campaign. Rush, who is chairman of the House subcommittee on energy, has accepted $9,000 so far this cycle from the oil and gas industry, according to Center for Responsive Politics data. (Emmons, like many recent progressive candidates, doesn’t take money from corporate PACs in his campaign.)\n\nRush’s campaign team didn’t respond to a request for comment.\n\nEmmons faces a tough path to victory in the 1st Congressional District, where former President Barack Obama, then an Illinois state senator, lost his challenge to Rush in 2000. Emmons has raised only $24,000, according to the latest campaign fundraising numbers, compared with Rush’s $83,000.\n\nOther contenders in the Democratic race include Sarah Gad, a University of Chicago law student running on tackling opioid issues, fueled by her own experience with addiction; and Darnell Leatherwood, a doctoral candidate at the same school, who founded the nonprofit Black Boys Shine. Because the district is heavily Democratic, the March primary will almost certainly determine the winner of the seat.\n\nEmmons has scored endorsements from progressive groups People for Bernie and Brand New Congress. Brand New Congress had backed Rep. Alexandria Ocasio-Cortez (D-N.Y.) in her 2018 race, in which she successfully unseated a 10-term Democratic incumbent in Queens.\n\n“I don’t want my kids having to fight for the same things we have to fight for,” Emmons said, who is married but does not yet have children. “As I’m marching in the streets shutting down highways screaming ‘Black lives matter,’ that’s so my kids don’t have to.”\n\n“We can’t wait our turn,” he added. “Our time is right now if we’re going to truly change the trajectory of our future.”", "description": "Robert Emmons Jr. is running for Congress in Illinois, challenging stereotypes about shootings in his hometown and seeking to unseat Democrat Bobby Rush.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5da4f9c0200000c70c500c60.jpeg?cache=pbzlihgjpn&ops=1778_1000", "published_at": "2019-10-17"}