{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/why-fed-repos-capital-injections-might-not-calm-liquidity-fears-2019-10-1028643549", "downloaded_at": "2019-10-30 12:32:04.065553+00:00", "title": "The Fed has been injecting hundreds of billions into markets since September's rate crisis. Here's why it might not be enough to calm lending conditions.", "language": "en", "text": "REUTERS/Kevin Lamarque The Federal Reserve has been boosting liquidity since mid-September when a spike in the overnight lending rate shocked the financial system.\n\nThe central bank is using market repurchase agreements - or repos - and Treasury bill purchases to inject capital into money markets. But many find the actions are ineffective in normalizing the key rate.\n\nHere's why the Fed's actions may not solve lending pressures, and how they may point to additional problems to come.\n\nVisit the Business Insider homepage for more stories. The Federal Reserve has been injecting capital into the financial system for weeks to calm money markets. But the actions are prompting worry among analysts, portfolio managers, and even Democratic primary candidates. The central bank is looking to boosting liquidity after the short-term funding rate spiked to 10% from 2% overnight in mid-September. The rate dictates how expensive it is for banks to access quick capital, and the unexpected jump symbolizes volatility in the usually-stable lending market. The spike prompted the Fed to start injecting capital through overnight market repurchase agreement operations - also known as \"repos\" - on September 17. The Fed also began monthly purchases of $60 billion in Treasury bills on October 15 to keep its key interest rate within an intended range. Here's why the Fed's actions may not be enough to solve lending pressures, and how they may point to additional problems down the road.\n\nWho receives Fed aid? Carolyn Kaster/AP The Fed's injections cater to primary dealers - or high-credit banks approved to purchase directly from the central bank. While the large banks make up a significant portion of the lending market, non-primary dealers are left with little assistance from the Fed's injections. The smaller banks \"are the most acute source of stress in repo markets\" and are set to take on a greater burden as larger firms' reserves grow, JPMorgan Chase analysts wrote in an October 18 note. Regulatory hurdles make it harder for cash to reach non-primary dealers, and a lack of reserves at the smaller firms creates a weak spot in the lending market. Analysts at UBS echoed the warning, claiming the central bank doesn't know \"if there is a level of reserves that will 'solve'\" the recent rate pressures. \"The primary dealers are only a subset of the demand for cash in the market, so the pressure in markets we have seen in the past week suggests that simply financing the primary dealers may be insufficient,\" the analysts wrote. \"The Fed is hoping that the money those dealers don't take from the market will be available to other borrowers.\"\n\nA bank-government disconnect Reuters/Kevin Lamarque Primary dealers are supposed to hold a certain amount of cash as a cushion for liquidity shortages, but the September crisis pointed to a disconnect between banks and regulators. Senator Elizabeth Warren penned a letter to Treasury Secretary Steven Mnuchin on October 18 warning him not to ease bank regulations following the liquidity scare. She questioned why banks are relying on Fed aid despite pulling in record earnings. \"Banks are reporting profits at record levels, and it would be painfully ironic if unexplained chaos in a small corner of the banking market became an excuse to further loosen rules that protect the economy from these kinds of risks,\" Warren wrote. Mnuchin countered Warren's letter just days after, telling Bloomberg on Tuesday he's open to relaxing the financial crisis-era liquidity laws. \"It's a reasonable question: Have we gone too far in the other direction in requiring the banks to maintain this excess liquidity for intra-day operations,\" Mnuchin said. JPMorgan CEO Jamie Dimon expressed a similarly opposing view earlier in October, saying that the bank would've eased the September spike if liquidity laws were less strict. Whether the federal government eases bank regulations or banks release more of their reserves, both sides have pushed the other to give in.", "description": "The Federal Reserve has been boosting liquidity since    mid-September when a spike in the overnight lending rate    shocked the financial system.The centra...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://markets.businessinsider.com/apple-touch-icon.png", "published_at": "2019-10-10"}