{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7633053/John-Bercow-stand-Commons-Speaker-rising-Parliament.html", "downloaded_at": "2019-10-31 00:08:39.609435+00:00", "title": "John Bercow to stand down as Commons Speaker with...", "language": "en", "text": "John Bercow is standing down as Commons Speaker after 10 years in the chair.\n\nA replacement for Mr Bercow will be elected in due course – with favourites including his deputy Sir Lindsay Hoyle and former deputy prime minister Harriet Harman.\n\nHe will also resign as MP for Buckingham – a seat he has held for 22 years – which will be hotly contested in the general election this December.\n\nMr Bercow announced his intention to stand down from the influential position in September, saying the timing was the “least disruptive and most democratic course of action”.\n\nHe would have relinquished the role sooner if MPs had supported Boris Johnson’s initial attempt for an early general election in September.\n\nThe 56-year-old entered Parliament in 1997 and held several shadow ministerial positions before taking the Speaker’s chair on June 22 2009, promising to serve “no more than nine years in total”.\n\nSpeaker of the House of Commons, John Bercow (Yui Mok/PA)\n\nHe abandoned that commitment ahead of the 2017 snap election, but allegations of bullying by former members of his staff, denied by the Speaker, led to fresh calls for him to quit.\n\nIn recent months he has also come under fire for a series of controversial rulings in the chamber which were widely considered to favour Remain supporters.\n\nThe contest to replace Mr Bercow will take place via a secret ballot, with a result announced on the same day as voting.", "description": "He will also resign as MP for Buckingham - a seat he has held for 22 years.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/31/00/wire-20403048-1572480276-860_636x382.jpg", "published_at": "2019-10-31"}