{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/30/kerevi-disappointed-to-cost-team-points-for-legit-", "downloaded_at": "2019-09-30 05:29:58.023756+00:00", "title": "Kerevi disappointed to cost team points for legit charge", "language": "en", "text": "TOKYO (AP) - Samu Kerevi was more disappointed to cost Australia three points against Wales in the Rugby World Cup than being penalized for a legitimate charge.\n\nIn one of the flashpoints of a dramatic pool match on Sunday in Tokyo, Kerevi was whistled for charging high at Wales flyhalf Rhys Patchell and hitting his neck.\n\nIn the past week, four players, including Australia’s Reece Hodge, have been issued three-match bans for dangerous tackles at the Rugby World Cup, and Wallabies coach Michael Cheika believes the referees have become “spooked.”\n\nIn this case, Patchell was the tackler and tackled upright, and Kerevi’s forearm slid from Patchell’s chest up to his neck as Patchell was knocked back and Kerevi surged on.\n\nWallabies captain Michael Hooper argued with referee Romain Poite that it was Patchell’s fault for tackling too high.\n\nBut Kerevi was penalized for high contact, apologized to Patchell who slotted the penalty for 16-8, and Wales hung on to win 29-25.\n\n“I’m just disappointed in myself because I cost the team three points,” Kerevi said on Monday.\n\n“It’s three points we could have gone without and you saw how close the game was last night, how it came to the wire. That’s what I’m really disappointed about. I’m not disappointed in what the referee’s ruling was, I’m not disappointed in how Rhys was tackling, I’m disappointed in myself that I cost the team those points.”\n\nHe added that he respected Poite’s decision.\n\n“I understand the call but it’s a tough one. I have been running like that for my entire career,” Kerevi said.\n\n“Especially when you slow it down (on video), it gives a different picture rather than seeing it in normal pace. I’m just getting back into my stride as I’m going for the bump, I’m just continuing my run. I’m not trying to go towards his neck or anything. It’s a tough one but I understand the ref’s call and I understand what (pressure) they’re under.\n\n“I’m just trying to do what’s best for the team and obviously trying to get over the ad line (gainline) and I don’t think it’s me changing the way I run. I have to get a clearer ruling on how we are meant to run. That’s what players want, is the consistency.”\n\nKerevi said he was kidding about thinking of switching to rugby league, but at the same time, “I just don’t want our sport to be soft. I understand it’s all about safety. I understand that. But it’s a collision sport.”\n\nWhen the collision was reviewed, Kerevi and the Wallabies thought it was about Patchell tackling too high.\n\n“When I realized they were looking at me it kind of shocked me, the first time I am getting looked at for running the ball,” Kerevi said.\n\n“Hoops (Hooper) was kind of asking questions as to how I was meant to run next. He (Poite) said I can lead with the arms but I can’t go for his neck. But if you slow it down (on video) it looks like that but the way I felt was as I was trying to bump him off and he was going backwards I just continued my stride, so I was just moving forward. That’s why I guess it makes you look bad.\n\n“There’s no way I would lead with my arms straight to his face. I know the rules. I don’t like to think of myself as a grub (dirty player) or anything like that.”\n\nAustralia plays Uruguay on Saturday in Oita.\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Samu Kerevi was more disappointed to cost Australia three points against Wales in the Rugby World Cup than being penalized for a legitimate charge.", "authors": ["The Washington Times Http", "Foster Niumata"], "top_image": "", "published_at": "2019-09-30"}