{"pub": "fox", "url": "https://foxbusiness.com/money/td-ameritrade-charles-schwab-free-trading", "downloaded_at": "2019-10-02 00:36:49.489689+00:00", "title": "TD Ameritrade matches Schwab's stock deal in Wall St. free-for-all", "language": "en", "text": "TD Ameritrade on Tuesday followed competitor Charles Schwab in eliminating commissions for online trades, as pressure mounts on Wall Street to lower trading fees and increase user access.\n\nContinue Reading Below\n\nStarting Thursday, TD Ameritrade’s U.S. brokerage firm will charge $0 commissions for online stock and ETF trades – though clients trading options will pay $0.65 per contract.\n\n“We’ve been taking market share with a premium price point, and with a $0 price point and a level playing field, we are even more confident in our competitive position, and the value we offer our clients,” Tim Hockey, president and chief executive officer of TD Ameritrade, said in a statement.\n\nTD Ameritrade estimates the revenue impact of the move to be between $220 million and $240 million per quarter.\n\nAs previously reported by FOX Business, Charles Schwab announced earlier in the day on Tuesday that – beginning on Oct. 7 – individuals will be able to trade stocks and ETFs on its platform for free. The company also said it would drop a $4.95 charge for options transactions, though users would still be charged a fee of $0.65 per contract.\n\nThe move is expected to cost the company up to $100 million in quarterly revenue.\n\nJPMorgan announced last August that it would offer at least 100 free trades to customers.\n\nFidelity broke ground last year when it launched two no-fee funds, giving more investors access to both domestic and global markets.\n\nRobinhood Markets launched a free-trading app in 2013, aimed at attracting millennial investors.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE", "description": "The move will cost the firm as much as $240 million in quarterly revenue.", "authors": ["Brittany De Lea"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/12/0/0/nyse-trader140418-b.jpg?ve=1&tl=1", "published_at": "2019-10-01"}