{"pub": "euronews", "url": "https://euronews.com/2019/10/10/humanitarian-concerns-grow-thousands-flee-syria-after-turkish-offensive-n1064621", "downloaded_at": "2019-10-10 15:46:53.789312+00:00", "title": "Thousands flee north-east Syria after Turkish offensive", "language": "en", "text": "LONDON — Tens of thousands of people are fleeing fighting in northeast Syria, according to the United Nations refugee agency, as world leaders warned that Turkey's invasion could spark a new humanitarian crisis.\n\n\"Hundreds of thousands of civilians in northern Syria are now in harm's way. Civilians and civilian infrastructure must not be a target,\" the UN High Commissioner for Refugees Filippo Grandi said in a statement Thursday.\n\nPictures and videos circulating across social media Thursday showed lines of cars streaming out of towns along the Turkey-Syria border. Footage appeared to show families crammed into vehicles with children in the arms of parents next to suitcases and other portable possessions.\n\nThe Syrian Observatory of Human Rights said it had documented the death of eight civiliansdue to Turkish ground shelling. NBC News could not independently verify this claim.\n\nThe Turkish Defense Ministry maintains it is only targeting PKK, YPG and ISIS terrorists as well as their shelters, weapons and equipment.\n\nTurkey's invasion of northeastern Syriabegan on Wednesday after U.S. troops pulled back from the area to clear the way for Turkish forces.\n\n\"People are fleeing when they can in cars, if not in the back of trucks, if not on foot, with what they can carry, old people, families, the sick,\" said Thomas McClure from the Rojava Information Center, a pro-SDF research group based in the Kurdish-held areas.\n\nMcClure who spoke to NBC News via WhatsApp said most people were fleeing south to other areas under the Kurdish Autonomous Administration, while a smaller number were trying to leave the country.\n\n\"There's no way out they're not being able to cross into Turkey nor by the Iraqi government,\" he said. NBC News could not confirm the group's claims.\n\nIn a joint-statement Thursday, 14 aid agencies warned that some 450,000 people live within 3 miles of the Syria-Turkey border, some 90,000 of them are already internally displaced meaning they have already had to leave their homes during Syria's unrelenting war.\n\nIn a separate statement, Save the Children said thousands of children were fleeing hostilities along with their families overnight and confirmed that it would scale up its relief operations. The United Nations warned that those fleeing the fighting were more at risk because temperatures were falling as colder weather sets in.", "description": "\"People are fleeing when they can in cars, if not in the back of trucks, if not on foot, with what they can carry, old people, families, the sick.\"", "authors": [], "top_image": "https://static.euronews.com/articles/4222710/1000x563_nbc-191010-syria-civilians-flee-cs-1015a_e9d4c1b2ddfe7d27feb2495861c5d226.jpg", "published_at": "2019-10-10"}