{"pub": "reuters", "url": "https://ca.reuters.com/article/businessNews/idCAKBN1X91VM", "downloaded_at": "2019-10-30 16:08:22.932866+00:00", "title": "Canada's Maple Leaf Foods plunges as China pork ban eats into profit", "language": "en", "text": "(Reuters) - Shares of Canada’s Maple Leaf Foods Inc (MFI.TO) tumbled 13% on Wednesday as the packaged meat producer missed estimates for quarterly profit, hurt by a temporary ban on Canadian pork exports to China and heavy investments in plant-based meat products.\n\nCanada's lucrative pork trade has taken a hit after China earlier this year asked the Canadian government to temporarily stop shipping meat to the country after bogus pork export certificates were discovered. (reut.rs/33bY24Q)\n\nHog prices have been volatile this year due to U.S-China trade tensions and an outbreak of African swine fever, a deadly pig disease that has killed millions of animals in China, the world’s biggest consumer of pork.\n\nMaple Leaf said the ban hurt its gross profit in its meat protein business.\n\n“Meat protein faced an unexpectedly erratic market condition in the quarter connected with global trade, and we expect that to reverse in short order,” said Chief Executive Officer Michael McCain in a statement.\n\nThe Toronto-based pork processor’s profit was also hit by increased investments in meat alternatives, which are becoming increasingly popular with health-conscious consumers.\n\nNet income almost halved to C$13.4 million ($10.19 million) in three months ended Sept.30.\n\nExcluding items, the company earned 3 Canadian cents per share, missing the average analyst estimate of 31 Canadian cents, according to IBES data from Refinitiv.\n\n($1 = 1.3152 Canadian dollars)", "description": "Shares of Canada's Maple Leaf Foods Inc tumbled 13% on Wednesday as the packaged meat producer missed estimates for quarterly profit, hurt by a temporary ban on Canadian pork exports to China and heavy investments in plant-based meat products.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-30"}