{"pub": "independent", "url": "https://independent.co.uk/independentpremium/roast-red-cabbage-apricots-pistachios-cooking-instructions-a9167886.html", "downloaded_at": "2019-10-25 23:46:23.255858+00:00", "title": "How to make roast red cabbage with apricots and pistachios", "language": "en", "text": "Cabbage is too often underrated and overcooked.\n\nA member of the Brassica family along with kale, broccoli and sprouts, cabbage is a nutritional powerhouse.\n\nIt contains anthocyanin – an antioxidant that has been linked with brain health, the reduction of inflammation, and protection against heart disease and cancer.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt’s also as cheap – well, almost – as chips. At around 80p per kilo it’s a good value.\n\nAnd a kilo of cabbage goes a long way. For cabbage companions, you’re spoiled for choice.\n\nCrushed juniper berries and a lick of cream, caraway and vinegar for a quick slaw; or dried fruit and a blast of balsamic for something sweet and sour.\n\nJust avoid overcooking cabbage – that’s when it loses its colour (and looks).\n\nA quick stir-fry or steam is the answer or a short stint in a roasting tin to bring out its natural sweetness.\n\nRoast red cabbage with apricots and pistachios\n\nServes 4 as a side dish\n\n500g red cabbage\n\n2 tbsp olive oil\n\n1 star anise (optional)\n\n60g dried apricots (about 5 or 6) sliced\n\n1½ tbsp balsamic vinegar\n\n25g pistachios, toasted and coarsely chopped\n\nSea salt and pepper\n\nPreheat oven to 220C.\n\nRemove the core from the cabbage and chop into strips. Place the cabbage in a roasting tin, add the star anise, the olive oil and season generously with salt and pepper. After 10 minutes, add the apricots and balsamic vinegar – give it a stir and place back in the oven for another 10 minutes.\n\nTake out of the oven, remove the star anise (if using) and taste, adding more salt and pepper and an extra splash of balsamic vinegar, if needed. Stir in most of the chopped pistachios, using the rest as a garnish. Serve hot or at room temperature.\n\n@juliapleonard", "description": "Cabbage is too often underrated and overcooked.  A member of the Brassica family along with kale, broccoli and sprouts, cabbage is a nutritional powerhouse.  It contains anthocyanin – an antioxidant that has been linked with brain health, the reduction of inflammation, and protection against heart disease and cancer.  It’s also as cheap – well, almost – as chips. At around 80p", "authors": ["Julia Platt Leonard"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/23/14/red-cabbage-recipe-1.jpg", "published_at": "2019-10-25"}