{"pub": "theverge", "url": "https://theverge.com/2019/9/13/20864659/cnn-juul-ad-ecigarette-vaping-advertising-ban", "downloaded_at": "2019-10-05 13:25:36.127616+00:00", "title": "CNN will stop running Juul and other e-cigarette ads after vaping deaths", "language": "en", "text": "CNN will no longer run ads for Juul or other e-cigarettes, following reports of a deadly lung illness linked to them. The Daily Beast reports that CNN Worldwide president Jeff Zucker announced the news at an employee meeting; the network also confirmed it in a statement to the outlet. However, it says the policy may change in the future as health agencies continue to investigate the disease.\n\n“Given the recent news reports of serious illnesses and deaths linked to the product category and the subsequent warnings ... CNN has revised its policies regarding e-cigarette advertising, and will not air ads in this category effective immediately,” a spokesperson told The Daily Beast. The ban might be lifted if “new facts come to light” during the investigations.\n\nCigarette ads have been illegal for almost 50 years\n\nJuul and other e-cigarettes have been successfully marketed through social media. But Juul launched a multimillion-dollar campaign with TV, print, and radio ads this year. The Food and Drug Administration recently warned Juul that its claims — which present vaping as a less harmful or even “totally safe” alternative to smoking — were not legally approved.\n\nSix people have reportedly died from a lung disease linked to vaping, and the Centers for Disease Control and Prevention (CDC) reported that 380 “confirmed and probable” cases have been identified across 36 states and the US Virgin Islands. More than 450 possible cases have been investigated. The exact cause of the disease is unclear — some reports have blamed illegally modified cannabis vapes, but health officials haven’t ruled out a threat from legal nicotine e-cigarettes either. The CDC and American Medical Association have urged people to refrain from vaping altogether.\n\nSo far, e-cigarettes have often fallen outside the purview of existing tobacco laws. Regulation may be on its way, though. President Donald Trump suggested a ban of all non-tobacco-flavored e-cigarettes, and some states and cities have already made them illegal.\n\nOverall, research on e-cigarettes’ health effects is still highly incomplete. Some evidence suggests that they’re less harmful than traditional cigarettes, but that’s very different from being “safe.” And e-cigarettes, particularly ones from the dominant brand Juul, have become popular with teens who may later take up smoking at increased rates.\n\nCigarette ads have been banned from TV since 1970.", "description": "CNN will no longer run ads for e-cigarettes like Juul as investigators look into six deaths and hundreds of illnesses linked to vaping, and health agencies recommend avoiding the product.", "authors": ["Adi Robertson", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/RZwfgdfWHVjNNcejfafLAOaO6zQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11960209/acastro_180702_2708_juul_0003.jpg", "published_at": "2019-09-13"}