{"pub": "businessinsider", "url": "https://businessinsider.com/biogen-plans-to-file-alzheimers-drug-aducanumab-for-approval-2019-10", "downloaded_at": "2019-10-22 14:03:39.492580+00:00", "title": "We're on the brink of the first new treatment for Alzheimer's in almost two decades. Here's what you need to know.", "language": "en", "text": "An experimental treatment for Alzheimer's disease that was declared a failure in March has been brought back to life.\n\nBiotech giant Biogen and its partner Eisai plan to seek approval for the Alzheimer's treatment, aducanumab, from the US Food and Drug Administration in 2020.\n\nIn March, the drugmakers had stopped most of its research efforts into aducanumab after findings from two trials showed that the drug wasn't showing signs that it was working.\n\nOn Tuesday, Biogen said a new analysis of a larger dataset showed that the drug was \"pharmacologically and clinically active\" in trial participants who have Alzheimer's.\n\nWatch Biogen trade in real time.\n\nThe search for an Alzheimer's disease treatment has been unsuccessful for the past 16 years.\n\nThat could start to change as soon as next year, after a shocking resurrection of a drug once deemed a failure.\n\nIn March, drugmakers Biogen and Eisai said they had stopped most of their research efforts into the experimental drug aducanumab after findings from two trials showed that the drug wasn't working.\n\nBut on Tuesday, Biogen said a new analysis of a larger dataset showed that the drug was \"pharmacologically and clinically active\" in trial participants who have Alzheimer's. The companies worked with the Food and Drug Administration to take a look at the larger dataset after the earlier failure.\n\nThe news sent Biogen's stock skyrocketing. The shares gained 37% to $305.37 in trading on Tuesday morning.\n\nThe new analysis found that the drug was able to reduce clinical decline in patients with early Alzheimer's disease. That is, it kept patients from experiencing cognitive decline as fast as they might had they not been on the drug.\n\nAfter calling the trials off, the researchers went back to the dataset and found the drug appears to work, at least in one of the two studies that came with a higher dose of the medication.\n\n\"Biogen believes that the difference between the results of the new analysis of the larger dataset and the outcome predicted by the futility analysis was largely due to patients' greater exposure to high dose aducanumab,\" Biogen said in a release Tuesday.\n\nBiogen and Eisai are planning to file the drug with the FDA in early 2020. If approved, it'd be the first new Alzheimer's treatment in nearly two decades.\n\nAlzheimer's affects more than 5 million Americans, a number that's expected to balloon to 14 million by 2060. There are only four drugs that have been approved to treat the symptoms of the disease, and the most recent drug approval happened in 2003. There are no drugs currently available that reverse the disease.\n\nGoing back to the amyloid hypothesis\n\nIn recent years a number of key Alzheimer's trials have failed, including the one Biogen reported in March. The setbacks in the field has seen in recent years had people coming back to a theory: We might be trying to treat the neurodegenerative disease at the wrong time, when it's too late.\n\nResearch has determined that years — even decades — before a person might start showing symptoms, amyloid beta deposits in the brain that are characteristic of Alzheimer's disease can start to accumulate.\n\nStarting earlier could benefit treatments that are targeting beta amyloid deposits in the brain, with the hope that clearing them out could help slow down the rate of cognitive decline. This idea of targeting beta amyloid deposits in the brain to clear them out is known as the \"amyloid hypothesis.\"\n\nBut there's one major drawback to the amyloid-beta approach: In people who have Alzheimer's, these deposits build up in certain parts of the brain, but it's still not known whether the plaques cause the disease, or if they're just a byproduct. What does seem to be well established is that in people with the genetic version of the disease, there is a strong relationship between those mutations and amyloid plaques.\n\nThe hypothesis has already been put to the test and seen a few failures, which is why the reversal from Biogen comes as a surprise. For one, Merck's now-failed BACE inhibitor was also acting on the amyloid hypothesis to prevent the protein from forming and keep the disease from progressing. Solanezumab, a drug developed by Eli Lilly that also acts on the amyloid hypothesis, failed some key clinical trials, though the company is still testing it in the pre-clinical stages of the disease.\n\nAnalysts, for their part, have their doubts about the surprise reversal. Brian Skorney, an analyst at Baird, said he was skeptical of the new results for Biogen's Alzheimer's drug.\n\n\"We expect Biogen will have an uphill climb as they look to convince regulators results from the EMERGE trial were nothing more than random chance,\" Skorney said in a research note.\n\nRBC Capital Markets analyst Brian Abrahams noted that it's hard to forget the earlier failure of ENGAGE, one of the two late-stage trials Biogen and Eisai were running alongside the EMERGE trial.\n\n\"Though FDA apparently provided some endorsement for the idea of filing, which could maintain some probability of approvability, we believe the new details suggest the data may be more mixed than initially perceived, and we believe the ENGAGE failure will be a point of controversy as investors debate aducanumab's prospects,\" Abrahams wrote.\n\nElsewhere, groups like the Alzheimer's Association said Tuesday that they were encouraged by the reversal.\n\n\"At the Alzheimer's Association, we have never been as optimistic as we are today,\" the organization said in a release.", "description": "An experimental treatment for Alzheimer's Disease declared a failure in March has been brought back to life.", "authors": ["Lydia Ramsey"], "top_image": "https://image.businessinsider.com/5b2cb7e91ae6621f008b5740?width=1200&format=jpeg", "published_at": "2019-10-22"}