{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/12/editorial-iran-resumes-its-nuclear-menace", "downloaded_at": "2019-09-13 00:02:30.423679+00:00", "title": "Iran, another name for stubborn", "language": "en", "text": "ANALYSIS/OPINION:\n\nThe world turns, but Iran won’t budge. Stuck on stubborn, the Islamic republic remains unmoved amid the currents of human affairs, affixed upon a singular goal: acquiring nuclear weapons. Now that the regime is hastening its deadly day of triumph, there is only one rational response: Resist until the moment when that terror-wielding nation desists.\n\nIran’s rulers have removed any doubt about their intentions. During a Tehran news conference on Saturday, the head of the Atomic Energy Organization of Iran proudly exhibited a set of advanced uranium centrifuges that he said have the capacity for boosting its store of nuclear material. “Our stockpile is quickly increasing,” Behrouz Kamalvandi said. Iran has activated 40 of the new machines, he said, half capable of enriching uranium five times faster than earlier models, the rest able to enrich at 10 times the rate.\n\nTehran is confronting European nations with an ultimatum: Begin purchasing Iranian oil in violation of economic sanctions imposed by the United States, or face the peril of a nuclear Iran. “We hope they will come to their senses,” said Iran’s nuclear chief. The implied threat is thinly disguised nuclear blackmail.\n\nThe announcement followed a report from the International Atomic Energy Agency that the regime has broken through the terms of the 2015 Iran nuclear deal, boosting the enrichment level of its stockpile from a 3.67 percent restriction to 4.5 percent. Using its advanced centrifuges to further refine the nuclear material, Iran is reportedly capable now of achieving 20 percent enrichment, and then jumping quickly to weapons-grade uranium at 90 percent.\n\nThe recent escalation of Iranian aggression should surprise no one. Four decades after its violent transformation from an incipient democracy to and Islamic mullahcracy, Iran is as comfortable as ever raising a middle-finger salute to a worried community of nations, and to the United States in particular. America is viewed as the “great Satan” for its involvement in the Middle East, the corner of the world that Allah bequeathed to Muslims.\n\nMost of all, Iran’s leaders despise Donald Trump, who has seen through their hegemonic schemes. A business whiz who knows a scam when he sees it, Mr. Trump promptly tore up the 2015 agreement that Iran craftily negotiated with Barack Obama and his fellow globalists. The deal handed the regime billions of dollars for holding off on developing its nuclear arsenal for 10 years, or at least for not building it in plain sight. By the Trump calculus, a nation that routinely vows to wipe its neighbors from the face of the Earth has no business playing with weapons of mass destruction.\n\nThe president launched “maximum pressure” sanctions meant to stifle Iran’s economy by preventing it from selling its oil abroad. With crude production falling more than 35 percent thus far in 2019 and its overall economy projected to contract by 6 percent this year, the regime is desperate to pressure European nations into joining forces to defeat the Trump strategy.\n\nEurope is caught in the middle, torn between the necessity of doing business with the world’s largest economic power and a reluctance to write off Iran’s 80 million-person market. Attempting to placate the mullahs, France’s President Emmanuel Macron offered them a $15 billion line of credit to ease their budget woes. Their response: No.\n\nIn Paris for weekend talks with his French counterpart, U.S. Defense Secretary Mark Esper viewed the Iranian centrifuge display with indifference. “The Iranians are going to pursue what the Iranians have always intended to pursue,” he said.\n\nPerfidy is Page One of the Persian playbook. An oil tanker was detained in Gibraltar recently on suspicion of smuggling Iranian oil in violation of sanctions. It was released on its promise not to has deliver its cargo to Iranian proxy Syria. Days later it was sighted in Syrian waters. Iran plays by its own rules — dodge economic sanctions, build nuclear bombs — irrespective of international opprobrium.\n\nMr. Trump has offered to settle his differences with Iranian President Hassan Rouhani face to face, with “no preconditions.” Mr. Rouhani’s response is blunt: No, unless the United States first drops its economic sanctions and rejoins the original nuclear deal.\n\nThe Obama strategy rewarded the mullahs for slow-walking their bomb. Stubborn and threatening behavior deserves no reward. Forcing the regime to choose between its nuclear program and economic collapse is the only rational course.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The world turns, but Iran won't budge. Stuck on stubborn, the Islamic republic remains unmoved amid the currents of human affairs, affixed upon a singular goal: acquiring nuclear weapons. Now that the regime is hastening its deadly day of triumph, there is only one rational response: Resist until the moment when that terror-wielding nation desists.", "authors": ["The Washington Times Http", "The Washington Times"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/07/27/us_iran_24071_c0-242-5637-3528_s1770x1032.jpg?9769716cd3688170cce19f0013d8533334fbfe0a", "published_at": "2019-09-12"}