{"pub": "foxnews", "url": "https://foxnews.com/auto/martin-truex-jr-wins-nascar-richmond-race-teammate-erik-jones-disqualified", "downloaded_at": "2019-09-23 17:30:52.803649+00:00", "title": "Martin Truex Jr. wins NASCAR Richmond race, teammate Erik Jones disqualified", "language": "en", "text": "Martin Truex Jr. seemed to have a \"pinch me\" moment as he climbed from his car in victory lane.\n\nNudged off the lead with 87 laps to go, Truex rallied Saturday night, ultimately passing Joe Gibbs Racing teammate Kyle Busch with 25 laps to go and winning his second consecutive NASCAR Cup Series race. That it came in the series' playoffs, it seemed, made it all the more surreal.\n\n\"To spin and win is pretty incredible. I've never done anything like that in my life,\" Truex said. \"When things are rolling, they just are.\"\n\nThe victory completed a redemptive finish for Truex, the championship leader coming into the race. The bump from Ricky Stenhouse Jr., who was running on fresher tires, seemed inadvertent and came in Turn 4, but Truex was still running third when the caution flew.\n\nHe gradually reeled in his teammate, got a nudge from Busch as he passed and pulled away.\n\n\"I think any time you're winning at this level, there's a little bit of a pinch-me feeling,\" Truex said. \"Look, this is really, really difficult. These races are hard to win. ... You've got to have some things go your ways sometimes and we've certainly had that the last two weeks.\"\n\nCLICK HERE FOR THE FOX NEWS APP\n\nThe victory was his series-high sixth of the season and the 15th in 28 races for the Gibbs cars. The team initially finished in the top four spots, a first for JGR, with Busch hanging on for second, followed by teammates Denny Hamlin and Erik Jones. Jones, however, was later disqualified when his Toyota failed post-race inspection for a rear wheel alignment issue, dropping him to 38th place and severely damaging his chances of advancing to the second playoff stage.\n\nBusch was not surprised that Truex caught him.\n\n\"We led a lot of laps. We were up front a lot. But when I was out front, he could keep the closest distance to me,\" Busch said. \"That kind of worried me for a finish like that in the long run.\"\n\nPole sitter Brad Keselowski moved up to fourth with Jones' disqualification, and every driver that finished behind him moved up one spot on the final grid, and in the two in-race stages, where Jones had been ninth in the first stage and fourth in the second.\n\n\"We just weren't quite as fast as the Gibbs cars,\" especially on long green-flag runs, Keselowski said.\n\nTruex swept the season at Richmond, where his victory in April was his first in 81 career starts on a short track.\n\nKevin Harvick and Busch, meanwhile, assured themselves of spots in the second stage of the playoffs, which begins after next week.\n\nHamlin said he was not at all surprised by his team's domination.\n\n\"I think I knew that's who we were going to be racing when it was all said and done,\" he said. \"The 19 just had such a strong car here on the long run over the last few years, we knew that was going to be the one to beat. ... Great team day overall. Great points day for us.\"\n\nWHO'S HOT, WHO'S NOT\n\nHot: Truex, the rest of JGR and Ryan Newman, who squeaked into the playoffs and finished sixth.\n\nAlso, while still running up front, Kyle Busch has now gone 14 races since his last victory on June 2 at Pocono.\n\nNot: Hendrick Motorsports teammates William Byron and Alex Bowman.\n\nByron started the night ninth in points but finished 25th. Bowman started the night 11th in points and finished 24th.\n\nThe four drivers most in danger of missing Stage 2 of the playoffs are Bowman, Clint Bowyer, Kurt Busch and Jones, who stand 13-16 in points.\n\nBETTER COACH OR OWNER?\n\nJoe Gibbs won three Super Bowls as coach of the Washington Redskins, and his NASCAR teams have won four driver championships.\n\nHe is not inclined to say which career has been more successful.\n\n\"Let me say this: Over here, I don't do anything,\" he said, laughing. \"In football, at least I could scream at people and everything.\"\n\nUP NEXT\n\nThe series moves to perhaps the trickiest race of the playoffs at the roval at Charlotte.", "description": "Led Gibbs 1,2,3 sweep.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/truex.jpg", "published_at": "2019-09-23"}