{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7625065/Record-176-people-stung-STINGRAYS-just-one-day-California-beach.html", "downloaded_at": "2019-10-29 14:25:20.028224+00:00", "title": "Record 176 people are stung by STINGRAYS on just one day at California beach", "language": "en", "text": "A record number of 176 swimmers were stung by stingrays on just one day as crowds flocked to a California beach over the weekend.\n\nOfficials at Huntington Beach said a record number, for this time of year, were injured by the sea creatures after swimming too far out at low tide on Saturday\n\nThey said the warm temperatures on the first day of the weekend tempted more people to come out for a swim and therefore contributed to the relatively higher number of those being stung.\n\nThe area has been described as being a natural habitat for stingrays. Lifeguard Josh Raymond told ABC7 last month that the creatures were attracted to rising water temperatures.\n\nStingrays can be difficult to spot in the water as they often spend a lot of time partially buried in the sand, moving with the sway of the tide\n\nStock image shows people enjoying the waters of Huntington Beach. This weekend a higher than usual number of people for the time of year were seen at the beach. This led to record numbers of swimmers being stung by a Stingray\n\nCooler weather conditions by Sunday saw fewer reports of stingray-related injuries.\n\nIn an effort to warn people of the stingray risk the Huntington Beach Fire Department issued warnings, Lt Eric Dieterman of the Marine Safety Division told local media outlets.\n\n'We get out a pretty aggressive public safety campaign... advising folks to stay out of water if possible,' he said.\n\nSchools of rays are usually found in the shallow coastal waters of more temperate seas.\n\nThey can be difficult to spot as the rays tend to spend a lot of time partially buried in the sand and move along with the sway of the tide.\n\nMore than 500 people were wounded by stingrays on California beaches over Labor Day weekend in a separate spate of injuries last month.\n\nAt the time, Raymond, a California State Parks lifeguard, said this was the stingrays' natural habitat.\n\nThe pain of being stung by a stingray is described as 'intense' and 'searing' by those who have experienced it\n\nHe said: 'Its a safe zone for these stingrays and its a breeding ground. We have the natural preserve back behind us.\n\n'The warm water brings stingrays in, but ultimately the more people you have, the more possibility and more actual stings that you will have.'\n\nLifeguards at the beach have been treating injured swimmers by soaking the deep puncture wounds on their feet to relieve the pain.\n\nLee Perkins, a Huntington Beach resident, was stung just two weeks ago. He described the pain as 'pretty intense'.\n\n'It's definitely a searing nerve pain,' he said.\n\nThe sting became severely infected.\n\nPerkins told the Daily Pilot he was relieved his 10-year-old son who was swimming with him that day was not stung by the sea creature.\n\nOne man shared his experience with the stinging sea creatures in a Facebook post\n\nAnother man on Facebook, Aaron Newman, said he had gone out to cool off after a day of playing flag football on the beach.\n\n'The tide was super low and I was shuffling my feet but still got tagged,' he said.\n\n'It felt like something bit through the top of my foot. I ran out of the water to the lifeguard stand and got a bag of warm water to soak my foot in.'\n\nHe said after going home he continued to soak his injured foot until the pain subsided.\n\n'Now I know why they’re called STINGrays and getting stung is no joke,' he said.", "description": "A record number of swimmers were stung by stingrays at a California beach on Saturday, as the warmer weather drew more people out for a swim at Huntington Beach.", "authors": ["Corazon Miller For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/08/20316398-0-image-a-20_1572339020013.jpg", "published_at": "2019-10-29"}