{"pub": "businessinsider", "url": "https://businessinsider.sg/tsk-tsk-cpf-ad-on-retirement-planning-slammed-for-portraying-seniors-as-grumpy-irritable-commuters", "downloaded_at": "2019-09-20 08:19:11.265777+00:00", "title": "Tsk, tsk: CPF ad on retirement planning slammed for portraying seniors as grumpy, irritable commuters", "language": "en", "text": "The CPF video was accompanied by the caption: “Old age has a way of pulling up out of nowhere. Maybe it’s time to start planning for your retirement.” Facebook screengrab\n\nAn online video by Singapore’s Central Provident Fund Board (CPF) is being tsk-ed for portraying senior citizens as grumpy and irritable bus commuters.\n\nIn the 30-second video uploaded to Facebook about on August 6, a young man is seen boarding a bus and unintentionally annoying elderly commuters by commenting loudly on a game he is playing on his mobile phone.\n\nOne woman notices that the seniors are making “tsk, tsk” sounds as they give the oblivious young man looks of disapproval.\n\nAmused, she smirks to herself.\n\nHowever, when it was time for her to exit the bus, she found herself feeling annoyed by the young man, who had walked in front of her. And just as she gave a loud “tsk”, she realised she was reacting just like the seniors she laughed at earlier.\n\nThe video, which is tiled “Tsk”, then displays a message saying that one in two Singaporeans have a life expectancy of 85 years. “You might be one and ‘tsk’ others too,” it added.\n\nA caption accompanying the video read: “Old age has a way of pulling up out of nowhere. Maybe it’s time to start planning for your retirement.”\n\nThe message, however, did not go down well with netizens who watch the video.\n\nOne Facebook user, Mohamad Syahid Bin Arif, appealed for CPF to remove the video entirely. “CPF, better take down tis ad…. It doesnt reflect well on the seniors and future seniors,” he wrote.\n\nAnother netizen, Wendy Sim, wrote: “This is not the way to promote retirement planning. I find it distastefully done. The tsk thing portrays seniors in a bad light.\n\nSome people also said that the meaning of the message was completely lost on them.\n\nAccording to The Straits Times (ST), the board has acknowledged it is aware of the negative feedback on the video, and said it would “strive to improve how we convey our messages in future”.\n\nIn its report, ST quoted CPF as saying that it had done message testing with a range of Singaporeans before releasing the video, and the feedback then was that the ad was relatable.\n\n“Since the launch, while some viewers may not have received the commercial positively, others felt that the commercial was memorable and made them realise the importance of planning for their retirement,” it was quoted as saying.\n\nBusiness Insider has reached out to CPF for comment.\n\nYou can watch the video here:\n\nRead also:", "description": "Business Insider - Aiyoh! Tsk, tsk.... Read more at businessinsider.sg", "authors": ["Jessica Lin"], "top_image": "https://static.businessinsider.sg/sites/2/2019/09/cpfvidmain.jpg", "published_at": "2019-09-20"}