{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7590315/Rihanna-shines-bright-like-diamond-applies-new-Fenty-body-sparkle-chest-bikini.html", "downloaded_at": "2019-10-19 12:02:54.397516+00:00", "title": "Rihanna shines bright like a diamond as she applies new Fenty body sparkle to her chest in a bikini", "language": "en", "text": "Never was there more literal a demonstration of a hit pop song title than this moment, brought to social media fans thanks to the incredible Rihanna.\n\nThe Barbadian singer and fashion maven posted another sizzling slo-mo video to her Instagram on Friday, this time showing off a new cosmetic product from her Fenty Beauty line which truly made her 'shine bright like a diamond'.\n\nIn the clip, the Diamonds singer is seen applying the glittering product in a plush setting filled with greenery, in a rosy pink string bikini that barely contains her breasts.\n\nLiterally shining bright: Rihanna posted another sizzling slo-mo video to her Instagram on Friday, this time showing off a new cosmetic product from her Fenty Beauty line\n\nRiri, 31, has her hair pulled back and wears her current favorite rectangular shades, and she's seen holding a Fenty compact, from which she slowly applies product to her chest.\n\nThe Bajan beauty, whose only other accessory is a sparkly pink necklace and shiny gold manicure, lets the diamond dust body shiner leave traces all over her collarbone and chest, which duly sparkle in the bright sunshine.\n\nRihanna captioned the scintillating clip with, 'I’m just saying, #DIAMONDBOMB2 is sexy af @fentybeauty' tagging her company.\n\nThe Fenty Beauty account also shared the stunning clip of their CEO demo'ing the new glam sparkle, adding to the caption 'y’all heard @badgalriri! Get ya shine right, get ya mind right in that 3D holographic body sparkle ✨'\n\nStunning and sparkling: In the clip, the Diamonds singer is seen applying the product in a plush setting filled with greenery, in a rosy pink string bikini that barely contains her breasts\n\nApply and repeat: Rihanna is seen holding a Fenty compact, from which she slowly applies product to her chest\n\nLater on Friday, Rihanna again took to Instagram to post a slow motion video of herself as she walks towards the camera in a tie dye cover up.\n\nThe song Best On Earth by Russ and Bia plays over the video.\n\n'thank you @bia and @russ for my new fav song #BestOnEarth (sic),' the singer writes.\n\nSlow motion for me: Later on Friday, Rihanna again took to Instagram to post a slow motion video of herself as she walks towards the camera in a tie dye cover up\n\nBackground music: The song Best On Earth by Russ and Bia plays over the video\n\nCaption this: 'thank you @bia and @russ for my new fav song #BestOnEarth (sic),' the singer writes\n\nThe SOS songstress has been hitting the record button on her Instagram hard, just the day prior posting a sexy video to her Stories section rocking Daisy Dukes and a sheer orange top.\n\nThat selfie vid concluded with the pop princess touching her body seductively right at the end.\n\nAnd on Wednesday, Rihanna posted yet another sultry slow motion clip from paradise, showing herself walking into frame wearing a beautiful (surely Fenty issue) black bikini and sheer cover-up.\n\nStrut for the camera: The SOS songstress has been hitting the record button on her Instagram hard, just the day prior posting a sexy video rocking Daisy Dukes and a sheer orange top\n\nWoah: The selfie vid concluded with the pop princess touching her body seductively\n\nRiri milks the shot when she spins in the clip, allowing her long black tresses to twirl along with her flowing robe.\n\nThe Fenty fashion mogul and designer has been monumentally busy of late, veritably taking over New York Fashion Week with her Savage X Fenty show last month and subsequently broadcasting it on Amazon Prime.\n\nRihanna has also made several appearances in London and Paris (the latter for Paris Fashion Week), before returning to New York this past week for a swank release party at the Guggenheim Museum for her visual autobiographical book, Rihanna by Rihanna.\n\nAnd as if that weren't enough, Wednesday marked the Umbrella singer's SIXTH time covering American Vogue — this time in her own clothes, by Fenty.\n\nWorking it: On Wednesday, Rihanna posted yet another sultry slow motion clip, showing herself walking into frame wearing a beautiful black bikini and sheer cover-up\n\nAnd then some: Riri milks the shot when she spins in the clip, allowing her long black tresses to twirl along with her flowing robe", "description": "Never was there more literal a demonstration of a hit pop song title than this moment, brought to social media fans thanks to the incredible Rihanna.", "authors": ["Dan Heching For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/02/19909326-0-image-a-67_1571448203919.jpg", "published_at": "2019-10-19"}