{"pub": "bbc", "url": "https://bbc.com/future/story/20190913-why-some-children-become-merciless-bullies", "downloaded_at": "2019-09-16 02:16:55.920629+00:00", "title": "Why some children become merciless bullies", "language": "en", "text": "When RubySam Youngz was singled out by a bully at the age of 10 in her last year of primary school, she felt isolated and confused. She’d just moved with her family from England to Wales and the bully honed in on her accent. They then started mocking her appearance. “Nothing really made sense to me,” she says. “I’m in a new place, I don’t really know anyone, no one likes me, and I really do not know why.”\n\nYoungz says the relentless bullying, which continued through secondary school, had a knock-on effect in all areas of her life, and she took up smoking and drinking in an attempt to cope. Now aged 46, it is only in the past year that she has come to terms with the effect that the bullying had on her.\n\n“I felt like ‘no one else likes me, so I don’t like me’,” she says.\n\nHer experience underlines a painful truth. Children, for all their innocence and inexperience of the world, can be some of the most vicious bullies. Their actions, perhaps less hindered by the social norms we learn in later life, can be merciless, violent and shocking. And they can have life-long implications for the victims.\n\nYou might also like:\n\n• Can this technology put an end to bullying\n\n• The transformational power of how you talk about your life\n\n• What is the best way to stop internet trolls\n\nBut what makes a child become a bully?\n\n“For the longest time, in the research literature, we thought there was just one type of bully: a highly aggressive kid that had self-esteem issues that may come from a violent home or neglectful home,” says Dorothy Espelage, a professor of education at the University of North Carolina at Chapel Hill. That picture is now changing.\n\nThe definition of bullying that academic researchers have adopted states that it’s a form of aggression between individuals or groups that have different levels of power. It perhaps fails to capture the terrible toll it can have on victims or the complex reasons why people become bullies in the first place. But one key element is the difference in power.\n\nResearchers’ picture of the typical school bully has become more nuanced in recent years\n\n“It could be that you’re bullying me, and you’re popular, and I’m not popular, and that power differential makes it difficult for me to defend myself,” says Espelage. While domestic violence and sibling aggression are still risk factors for children becoming bullies, they’re not the only reason, she adds. Children who grow up in violent homes but go to a school with an anti-bullying programme and a supportive atmosphere won’t necessarily become bullies.\n\nResearchers’ picture of the typical school bully has become more nuanced in recent years. Aside from the blunt and open aggressor, another more Machiavellian kind of bullying has come to be recognised. Children who fall into this category tend to have better social skills, are often charismatic and liked by teachers – far from the “oafish” stereotype of bullies. Crucially, these children can turn on and off their bullying to suit their needs.\n\n“Socially dominant bullies want to be the leader of the crowd,” says Espelage. “And the way that they do that is to push kids down the hierarchy.”\n\nOther research backs up this idea that bullying is often more about the bully themselves, rather than their victims. In a study of school children in Italy and Spain, pupils took part in an exercise that entailed thinking about a bullying situation from the point of view of the bully. The researchers also gave the children a questionnaire about their peers to categorise each child as either a bully, a victim or an outsider.\n\nThose who were categorised as bullies by their peers were more likely to respond to the hypothetical bullying incident with statements that focused on how the incident affected the bully themselves (saying things like “I would feel great because I got the attention of other children!”) or statements that showed a lack of empathy (such as “I don’t feel guilty because I don’t think about it” and “I would feel indifferent because the victim doesn’t suffer”).\n\nBullying has also taken on new forms in recent years. One common characteristic of bullying as previously defined by academics is that the aggression towards the victim is repeated. But the online world is blurring this due to the potential impact that just one instance of cyberbullying can have.\n\n“Does it have to happen more than once, when you’ve posted something that’s gone to a million people?” asks Espelage. “Probably not.”\n\nIn fact, there’s such a big crossover between school bullying and cyberbullying that some researchers argue they are becoming one and the same – especially now that children often have their phones with them in class. “In my research it was found that many times school bullies continue the harassment online,” says Calli Tzani-Pepelasi, an investigative psychology lecturer at the University of Huddersfield. “They may be sitting next to each other but prefer to bully each other through social media, as that way their actions can be viewed by more and they feel a false sense of fame.”\n\nSo what should you do if you think your child may be bullying other children?\n\nGetting to the bottom of their motivations is a good first step. “If somebody called me and said your child is engaging in these behaviours, I would want to say [to the child], ‘OK, what are you getting from that? Why are you doing this?’,” says Espelage. “It may be that your child... is in a school where that’s what they’re expected to do.”\n\nIt’s worth considering whether your own actions may be influencing your child’s\n\nIt’s also worth considering whether your own actions may be influencing your child’s. “For some parents, their interpersonal style may be may be modelling that behaviour,” she says.\n\nOne way to address school bullying could be a buddy system designed to foster peer support, where younger students are assigned an older mentee to show them the ropes when they start school.\n\n“The fact that younger students have the opportunity to model the right behaviour from the older students” is one advantage of such a system, says Tzani-Pepelasi. But having a supportive school environment in general is also important when it comes to tackling bullying. “It takes a lot of persistence, and consistency from the teachers and the school staff in general, as without them the system cannot function,” she says.\n\nEspelage agrees that strong relationships between teachers and among peers are key. “What we know from our research is those schools where they pay attention to the issues of connectedness, making sure every kid feels like they belong in that school, there’s less bullying,” she says.\n\nOften, though, that support isn’t there. In 2014, Espelage and her colleagues published a five-year study showing a worrying link between bullying and sexual harassment in schools. It revealed that bullying among younger children often involves homophobic insults, which then escalates to sexual harassment in later school years.\n\nChildren involved in sexual harassment – both the perpetrators and the victims – often didn’t seem to understand how serious the incidents were\n\nBut the children involved in sexual harassment – both the perpetrators and the victims – often didn’t seem to understand how serious the incidents were, perhaps because teachers may not be stepping in to prevent them.\n\n“That continuum of aggression from bullying, to homophobic name-calling, to sexual violence, to teen dating violence is real,” says Espelage.\n\nAs for whether kids grow out of bullying once they leave school, Espelage says some may do so – or find a different outlet for their aggression – but not all. “I would argue, based on my experience, that some [school bullies] go into professions in which that type of behaviour works for them, whether that's a police officer, a professor at a university, a lawyer.”\n\nPerhaps saddest of all, however, is that the impact of bullying on victims can last for decades, leading to poorer physical and psychological health. Youngz, who was bullied throughout secondary school, has now trained as a grief recovery specialist, and hopes to be able to help others who have been through similar kinds of loss.\n\nThe bullying was loss of feeling normal, loss of trust, loss of safety and security – RubySam Youngz\n\n“The bullying has been part of that because it was loss of feeling normal, loss of trust, loss of safety and security,” she says.\n\nHer main bully contacted her via Facebook earlier this year to apologise. When she received the message, Youngz felt angry. “It did nothing for me at all personally to relieve any pain that she put me through,” she says. “It might have helped her, I don’t know.”\n\nBut when it comes down to it, she thinks the apology – just like the bullying that had such a negative impact on her life – was really more about the bully than about Youngz herself.\n\n“I have compassion towards her because I can understand maybe why she did what she did, because she may have been having troubles at home as well,” she says. “But I’m not agreeing with what she did.”\n\n--\n\nJoin one million Future fans by liking us on Facebook, or follow us on Twitter or Instagram.\n\nIf you liked this story, sign up for the weekly bbc.com features newsletter, called “The Essential List”. A handpicked selection of stories from BBC Future, Culture, Worklife, and Travel, delivered to your inbox every Friday.", "description": "Bullying behaviour often emerges in childhood, and the consequences for victims can last a lifetime. What makes a child become a bully?", "authors": ["Kelly Oakes"], "top_image": "https://ichef.bbci.co.uk/wwfeatures/live/624_351/images/live/p0/7n/8p/p07n8plm.jpg", "published_at": "2019-09-13"}