{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/policing/2019/07/16/south-carolina-officer-newborn-traffic-stop-breathing/1735688001", "downloaded_at": "2019-10-06 13:13:02.515086+00:00", "title": "Cop helps save 12-day-old baby during traffic stop", "language": "en", "text": "CLOSE A sheriff’s deputy in Summerville, South Carolina, was credited with saving the life of a 12-day-old baby on June 11 during a routine traffic stop. Storyful\n\nDeputy William Kimbro administered CPR and was awarded the Life-Saving Medal from the Berkeley County Sheriff's Department\n\nA South Carolina police officer became a hero last month when he pulled a car over for speeding and found in it a mother rushing her newborn daughter to the hospital. The mother said that her child, a 12-day-old baby named Riley, had stopped breathing after being fed.\n\nDeputy William Kimbro of Berkeley County didn't hesitate to begin first aid.\n\nIn the video, recorded by the officer's body camera, Kimbro can seen tapping the baby's chest in order to get her heart beating. He can also be heard saying \"come on baby, cry for me, cry for me,\" and mentioning that he was concerned because the baby's lips were turning blue. Riley's breathing was intermittent, and Kimbro continued to perform CPR until Riley's chest started to move — a sign that she was breathing on her own. He stayed with the baby until medical services arrived.\n\nSouth Carolina officer helped save a baby's life. (Photo: MCCAIG, Getty Images)\n\nThe sheriff's office wrote on Facebook that \"because of Deputy Kimbro's steadfast, professional and heroic response, the 12-day-old baby was able to live.\" Kimbro was awarded a Life-Saving Medal from the Berkeley County sheriff.\n\nYou can read diverse opinions from our Board of Contributors and other writers on the Opinion front page, on Twitter @usatodayopinion and in our daily Opinion newsletter. To respond to a column, submit a comment to letters@usatoday.com.\n\nRead or Share this story: https://www.usatoday.com/story/opinion/policing/2019/07/16/south-carolina-officer-newborn-traffic-stop-breathing/1735688001/", "description": "Deputy William Kimbro administered CPR and was awarded the Life-Saving Medal from the Berkeley County Sheriff's Department", "authors": ["Jacob Bruggeman", "Published P.M. Et July"], "top_image": "https://www.gannett-cdn.com/presto/2019/07/16/USAT/12ffaa73-e042-44e2-9c23-c7d14b785c82-Cop_car.jpg?crop=2999,1687,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-07-16"}