{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stocks/ibm-stock-looks-ready-to-rally-15125564", "downloaded_at": "2019-10-14 23:23:34.385414+00:00", "title": "IBM Stock Looks Primed for a Big Blue Rally", "language": "en", "text": "IBM (IBM) is due to report its quarterly figures on Wednesday -- one of the companies that Jim Cramer noted on his Mad Money program is a key stock to watch this week. Let's see what the charts are showing us ahead of IBM's report.\n\nIn this daily bar chart, we can see that prices have trended sideways for much of this year, with dips to the $125-$130 area bought. Prices have been in a tighter trading range the since early September, but IBM's technicals have strengthened. The stock is above its flat-to-rising 50-day moving average (the blue line below) and its bullish 200-day moving average (the yellow line):\n\nIBM's On-Balance-Volume line (OBV) has also been rising since last November, which tells us that buyers have been more aggressive. The OBV line also looks like it's leading the price action, as the line has made a new high before prices have. Meanwhile, IBM's Moving Average Convergence Divergence (MACD) is just above the zero line and looks poised to turn higher along with a rising stock price.\n\nIn IBM's weekly bar chart we can see that prices are above a rising 40-week moving average line (the yellow line below). The weekly OBV line is also steady, while the MACD oscillator is above the zero line. Price strength will give us a new buy signal:\n\nLastly, this point-and-figure chart shows IBM projecting a possible downside price target of around $132. But if prices rally and trade at $152.44, we'll have a major upside breakout in my opinion:\n\nThe Bottom Line\n\nIBM's charts and indicators are shaping up for a strong fourth-quarter rally. Traders and investors could go long on strength above $145 and $150. Risk a close below $135.", "description": "The technicals for IBM (IBM) are pointing upward....IBM", "authors": ["Bruce Kamich", "Ibm Stock Looks Primed For A Big Blue Rally", "The Stock'S Technicals Are Pointing Upward.", "Stocks Quotes In This Article", "James", "Rev Shark", "Timothy Collins", "Carolyn Boroden", "Bob Lang", "Doug Kass"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/efd72475-db79-11e8-b161-471186ad2e72.jpg", "published_at": "2019-10-14"}