{"pub": "yahoo", "url": "https://finance.yahoo.com/news/3-strong-buy-stocks-needham-134626103.html", "downloaded_at": "2019-10-17 14:42:22.376082+00:00", "title": "3 ‘Strong Buy’ Stocks Needham Analysts Are Raving About", "language": "en", "text": "International investment banker Needham & Company is home to a suite of Wall Street’s best analysts. They monitor the markets, giving Needham’s clients the benefit of their experience and insight. In the past week, three of Needham’s analysts have issued reports on a series of exciting high-upside tech stocks.\n\nWe’ve looked up all three in TipRanks’ Stock Screener, and found out just what put these stocks on Needham’s radar. The end results can be summed up simply: all three stocks show tremendous potential for near- to mid-term growth. Let’s take a close look at them, and see exactly why they are compelling opportunities.\n\nUber Technologies (UBER)\n\nWe’ll start with Uber, the headline-grabbing ride-share app that is turning the taxi industry upside down. Based in San Francisco, home to many of the tech world’s innovators, Uber boasts operations in more than 780 cities world-wide. The app has more than 110 million active users, and has taken a 69% market share in the individual passenger transport niche in the United States. The ride share app quick to take advantage of new roles – in addition to its hefty transport market share, Uber commands 25% market share in the food delivery niche. The company’s rapid growth – it has achieved all of this in just 10 years – has been a magnet for investors and pushed the market cap past $54 billion.\n\nNeedham’s Brad Eriskson has reviewed UBER, and reiterated his buy rating on the stock along with a $50 price target, indicating his confidence in over 50% upside. (To watch Eriskson's track record, click here)\n\nEriskson is forthright about recent problems the company has faced, saying simply, “We acknowledge further bookings deceleration will make near-term stock appreciation challenging…” He goes on to say that he believes these headwinds are starting to fade and that the stock will begin accelerating again in the mi-term outlook.\n\nGetting to details, Erickson writes, “We view UBER as one of the best mega-cap value-creation opportunities in our universe given transportation's massive $5 trillion end market… We believe consumers have only just begun to use shared mobility to buy back time during their busy lives. In the U.S. and Europe alone, we estimate that the annual value of commuting is $829 billion and $1,627 billion, respectively, a rising portion of which we believe shared mobility can capture… our analysis of the value of people's time in the two regions based on stratified income levels suggests Uber is a compelling option for large portions of the population, which makes growth appear more sustainable than investors expect.”\n\nIn line with Eriskson's bullish stance, UBER stock holds a Strong Buy from the analyst consensus, based on 19 \"buy\" and 4 \"hold\" ratings assigned in the past three months. Importantly, the average price target of $52.14 implies over 60% upside from the current share price of $31.87. (See Uber stock analysis on TipRanks)\n\nUber price target More\n\nMedallia (MDLA)\n\nOur second hot tech stock from Needham is Medallia. Based in San Francisco, like Uber above, Medallia has offices in major global hubs such as London, Buenos Aires, New York, and Tel Aviv. The company inhabits the Software-as-a-Service (SaaS) space of the cloud universe, offering business customers an advanced capability in monitoring social, mobile, contact center, and Web feedback. Medallia’s software monitors such contacts in real-time, and provides analysis to customer satisfaction and loyalty teams, allowing management to fine-tune goals and targets.\n\nStory continues", "description": "International investment banker Needham & Company is home to a suite of Wall Street’s best analysts. They monitor the markets, giving Needham’s clients the benefit of their experience and insight. In the past week, three of Needham’s analysts have issued reports on a series of exciting high-upside tech", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/keKGPr2cK9B4KfQ8E_lVpA--~B/aD01MTM7dz0xMjAxO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/50aef2969a8871ad1c209dfa5dbd09fa", "published_at": "2019-10-17"}