{"pub": "thehill", "url": "https://thehill.com/opinion/immigration/464596-trumps-latest-misdiagnosis-is-bitter-pill-for-immigrants", "downloaded_at": "2019-10-09 18:37:00.255629+00:00", "title": "Trump's latest misdiagnosis is bitter pill for immigrants", "language": "en", "text": "President Trump Donald John TrumpPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Trump directed Perry, State Dept. officials to talk to Giuliani on Ukraine: report Murkowski warns against rushing to conclusions on Trump impeachment MORE’s Oct. 4 proclamation is a misdiagnosis of the policies and problems that shape whether people in the United States have adequate health insurance coverage. The president would have us believe that legal immigrants are a causal factor in uncompensated health care: “While our health care system grapples with the challenges caused by uncompensated care, the United States government is making the problem worse by admitting thousands of aliens who have not demonstrated any ability to pay for their healthcare costs.” Only refugees, asylees, noncitizen children of U.S. citizens and a few other rare categories of immigrants are exempt from this new policy.\n\nA cursory look at data on health insurance coverage would lend some credence to this interpretation. The Kaiser Family Foundation reports that: “Among the nonelderly population, 23 percent of lawfully present immigrants and more than four in 10 (45 percent) undocumented immigrants are uninsured, compared to less than one in 10 (8 percent) citizens.”\n\nThe flawed logic, however, is thinking that legal immigrants are uninsured in the United States because they “have not demonstrated any ability to pay for their health care costs.” The barriers to obtaining health insurance are not because of any inherent or detectable deficiency in prospective legal immigrants, but in the sectors of the economy that typically employ them.\n\nADVERTISEMENT\n\nImmigrants are less likely to have health insurance because they are more likely to work in sectors that do not have employer-sponsored coverage. Ten years ago, Dr. Alison Siskin (then at the Congressional Research Service) conducted an extensive analysis of noncitizen access to health care coverage. She found: “Noncitizens with private employers are much less likely than native-born and naturalized citizens to have private health insurance, while members of each group employed by the federal, state or local governments have similar and high rates of private insurance that are statistically different. Similarly, in private and self-employment, noncitizens are more likely than citizens to be uninsured.”\n\nThe Kaiser Family Foundation published more recent research in 2019 that again found that the higher uninsured rates among noncitizens is in part because of limited access to employer-sponsored coverage. Kaiser reports that immigrants “have lower incomes because they are often employed in low-wage jobs and industries that are less likely to offer employer-sponsored coverage. Further, given their lower incomes, noncitizens face increased challenges affording employer-sponsored coverage when it is available or through the individual market.”\n\nA finer cut of the economic and demographic data sheds light on the labor market factors affecting immigrant access to health insurance. In detailed data comparing the occupations of foreign-born and native-born residents of the United States, the Pew Research Center documented that foreign-born people are much more likely to work in job categories of “construction, farm, forestry and fishing,” “food preparation and serving,” “personal care and service,” and “building and grounds maintenance.”\n\nIn 2018, Winifred L. Boal, Jia Li, and Aaron Sussell published research revealing: “More than 25 percent of workers in four occupational groups reported having no health insurance: construction and extraction (29.1 percent); farming, fishing, and forestry (34.6 percent); food preparation and serving related (35.5 percent); and building and grounds cleaning and maintenance (37.0 percent).” In other words, employers who are less likely to provide health insurance to workers in particular jobs also are more likely to hire immigrants to fill those jobs.\n\nBecause many of these occupations are low-wage, legal immigrants employed in these sectors often are eligible for health care subsidies. Kaiser points out that “immigrant families face a range of enrollment barriers, including fear, confusion about eligibility policies, difficulty navigating the enrollment process, and language and literacy challenges.” These obstacles keep many legal immigrants from accessing health insurance when it is within their reach.\n\nADVERTISEMENT\n\nThe president’s policy proclamation is a particularly bitter pill for immigrants because it does not allow health insurance that is subsidized to meet the requirement. Even though many legal immigrants are eligible for health insurance subsidies, the subsidized insurance would not count. Spouses of hard-working immigrants across many sectors of the labor force would be barred under this proclamation. The upward mobility and prosperity of a two-income household would elude these immigrant families whose spousal petitions would be denied. This policy would diminish the economic potential of the family and — in a perverse twist — increase the likelihood that they might receive uncompensated care if a medical emergency occurred.\n\nThe Migration Policy Institute estimates that two-thirds of future immigrants would be blocked by this policy. Thirty-four percent of recent immigrants lack health insurance and another 31 percent have publicly-funded or subsidized health insurance.\n\nIf we want to tackle issues of uncompensated health care and low-wage employment, we should set our sights on health care financing and labor policies. Since the early days of the republic, the United States has had laws excluding foreign nationals who are likely to become public charges, i.e., indigent. These laws are more than sufficient to ensure that immigrants thrive, prosper, fuel our economy and contribute to the social fiber and civic life of America.\n\nRuth Ellen Wasem is a professor of policy practice at the Lyndon B. Johnson School of Public Affairs, the University of Texas in Austin. She has testified before Congress about asylum policy, legal immigration trends, human rights and the push-pull forces on unauthorized migration. Follow her on Twitter @rewasem.", "description": "The higher uninsured rates among noncitizens in America is in part because of limited access to employer-sponsored coverage.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_10062019_1.jpg", "published_at": "2019-10-09"}