{"pub": "news24", "url": "https://news24.com/World/News/carters-advice-for-trump-tweet-less-20191009", "downloaded_at": "2019-10-09 10:53:49.675716+00:00", "title": "Carter's advice for Trump? Tweet less", "language": "en", "text": "Former US president Jimmy Carter has two simple pieces of advice for Donald Trump as he faces the threat of impeachment: tell the truth - and tweet less.\n\nAsked by MSNBC about the stance of his present-day successor, who has rejected the congressional probe into his dealings with Ukraine as a \"kangaroo court,\" the Democrat, who just turned 95, had strong words for Trump.\n\n\"I think that's a departure... from what American people expect,\" Carter said, after the White House blocked a top US diplomat from testifying before the House of Representatives.\n\n\"So I think that that in itself is going to be another evidence - another item of evidence that can be used against him if he continues to stonewall and prevent the evidence to be put forward to the House of Representatives and the Senate to consider,\" he said.\n\nAs for advice, as Trump navigates this particularly delicate moment in his presidency?\n\n\"My advice to him would be to tell the truth... and also to cut back on his Twitter feeds,\" said Carter, who served as head of state from 1977 to 1981.\n\nHours after Carter's comments, the White House slammed the door on any cooperation with the Democrats' impeachment probe, calling it \"constitutionally invalid\" in a letter to Congress.\n\nCarter, who last week became the first American president to reach the age of 95, fell and injured his head on Sunday at his home in the southern state of Georgia.\n\nBut he appeared the very next day at a volunteer site for the nonprofit Habitat for Humanity, with a black eye and a bandage covering 14 stitches.", "description": "Former US president Jimmy Carter has two simple pieces of advice for Donald Trump as he faces the threat of impeachment: tell the truth - and tweet less.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9451/a08200321d434e868c04ba86c3862ea4.jpg", "published_at": "2019-10-09"}