{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7625521/UK-course-December-general-election-Corbyn-backs-poll.html", "downloaded_at": "2019-10-29 14:31:53.153654+00:00", "title": "UK on course for December general election as Jeremy...", "language": "en", "text": "The UK is on course for a December general election after Jeremy Corbyn announced that Labour’s conditions to back the move had been met.\n\nMr Corbyn told his shadow cabinet the party would launch the “most ambitious and radical campaign for real change our country has ever seen” now a no-deal Brexit was “off the table”.\n\nHis announcement came after Boris Johnson formally accepted a Brexit extension, definitively breaking his “do or die” commitment to leave the EU by October 31.\n\nThe Prime Minister will on Tuesday attempt to convince MPs to back an early general election for the fourth time when he calls on MPs to vote for a December 12 poll.\n\nMr Corbyn told his top team on Tuesday morning: “I have consistently said that we are ready for an election and our support is subject to a no-deal Brexit being off the table.\n\n“We have now heard from the EU that the extension of Article 50 to January 31 has been confirmed, so for the next three months, our condition of taking no-deal off the table has now been met.\n\n“We will now launch the most ambitious and radical campaign for real change our country has ever seen.”\n\nThe PM will attempt to convince the Commons to vote for a December 12 election using a short Bill which sets aside the Fixed-Term Parliaments Act (FTPA).\n\nCrucially, the success of this move requires the backing of only a simple majority of MPs rather than the two-thirds “super majority” which he failed three times to win under the FTPA.\n\nNo Deal is now off the table so tonight Labour will back a General Election.\n\n\n\nWe're launching the most ambitious and radical campaign for real change our country has ever seen.\n\n\n\nThis is a once in a generation chance to build a country for the many, not the few.\n\n\n\nIt's time. — Jeremy Corbyn (@jeremycorbyn) October 29, 2019\n\nHowever, shadow Commons leader Valerie Vaz appeared to contradict Mr Corbyn by suggesting no-deal was still possible and raised doubts that Labour will back the election plans.\n\nShe told MPs that the hasty “programme motion” setting the timetable to get the legislation approved by MPs in a single day was “unacceptable” and “deliberately designed to avoid scrutiny” of the Government.\n\n“I think this is another way of crashing out of the EU without a deal,” she said.\n\nThe Liberal Democrats and the SNP are reluctant to accept his date – fearing it allows time to bring the Withdrawal Agreement Bill to implement the PM’s new Brexit deal before MPs ahead of the start of the campaign.\n\nThey have previously signalled support for a poll on December 9, but could put forward a proposal for an election on December 11 – which the Government is likely to accept.\n\nThe PM’s official spokesman said a December 9 vote would not be “logistically possible” but said other proposed compromise dates would be considered by the Government.\n\nMr Corbyn’s move does not mean a December election is certain, with Labour expected to support amendments to the Bill.\n\nAn alteration to the polling date and other amendments reflecting their policy, such as votes for 16 and 17-year-olds, are being considered.\n\nDowning Street said votes for EU nationals could cause “administrative chaos” while allowing 16 and 17-year-olds to take part would be “administratively impossible” to deliver.\n\n“There are long-standing conventions that election laws should only be changed after appropriate consultation,” the Prime Minister’s spokesman said.\n\n“The Electoral Commission warns against changing electoral laws less than six months before an election.”\n\n(PA Graphics)\n\nFlanked by members of his shadow cabinet, an energised Mr Corbyn did not rule out backing any changes, telling reporters outside Labour’s London HQ: “There will be a parliamentary process this afternoon.”\n\nBut he added: “We are going out there to fight an election campaign and I can’t wait to get out there on the streets.”\n\nHowever some of his MPs have ruled out backing a general election on Tuesday, including Anna Turley and Kevan Jones, while Barry Sheerman said it was “sheer madness” to hold a December poll.\n\nEarlier on Tuesday, Lib Dem MP Chuka Umunna said his party is against holding a general election on Mr Johnson’s preferred polling date of December 12, telling BBC Radio 4’s Today programme: “It cannot be the 12th.”\n\nHowever, Mr Umunna signalled the Lib Dems could be flexible over their own preferred election date of December 9.\n\nHe said: “We will see what else they come forward with. We have got to break the gridlock.”\n\nThe one-page Bill, titled the Early Parliamentary General Election Act 2019, sets the date of the proposed general election as December 12.", "description": "However, the Labour leader´s move does not mean a December election is certain.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/14/wire-20328968-1572358158-887_636x382.jpg", "published_at": "2019-10-29"}