{"pub": "zdnet", "url": "https://www.zdnet.com/article/why-dont-drones-use-small-versions-of-commercial-aircraft-engines", "downloaded_at": "2019-09-24 15:20:23.887499+00:00", "title": "Why don't drones use small versions of commercial aircraft engines?", "language": "en", "text": "Ever wonder why drones don't use the turbine engines you see under the wings of commercial airplanes? Soon they will.\n\nThere's a race underway to bring tiny turbine engines to market to satisfy the next frontier in the drone sector: long-range, high-speed UAV that can actually carry a decent amount of cargo. With a successful test flight of its Monarch 5 microturbine propulsion system, a company called UAV Turbines is claiming to be the first to power a medium-sized drone with a turbine engine.\n\nBut UAV Turbines isn't the only company developing in this space. Kratos Turbine Technologies, for example, is working on small turbojets and turbofans for UAV in the defense sector. Because the technology offers some significant advantages over all-electric propulsion, there's been interest from various corners of the drone industry, including for cargo delivery and military applications.\n\n\"Kratos is getting its cues from a US Air Force (USAF) vision of developing a fleet of low-cost missiles and attritable UAVs that can overwhelm, evade or outdistance sophisticated and far-reaching Chinese and Russian air defence systems,\" writes Garrett Reim in Flight Global, an industry trade publication, earlier this year.\n\nThe problem these companies are seeking to solve is that the electric propulsion systems currently in use on many fixed wing drones are simply too heavy for long-range flights, particularly with heavy payloads. Pound for pound, liquid fuel carries about 50 times more energy than batteries.\n\nIt's an increasingly urgent issue as we reach the outer limits of what electric propulsion can offer with current battery technology. According to the FAA, the commercial UAV market is expected to triple in size by 2023, driven by use cases such as medical support, cargo delivery, search and rescue, and transportation. However, current engines do not offer the reliability and safety required to perform these tasks.\n\nTurbo-electric hybrids are a near term solution, and the race is underway to get these engines in the air ahead of evolving FAA rule making. UAV Turbines' Monarch 5 engine, for example, provides upwards of a 2,000 hour increase in operation time between overhauls when compared to available Class 3 engines and can run efficiently on all types of heavy fuels, including jet fuel. The engine also generates two to three times more useful on-board electrical power over conventional gas engines.\n\nTurbofan like the Monarch 5 and turbojets could provide regulators and drone makers with engines that overcome the safety and reliability challenges that are part of the puzzle to getting drone delivery and commercial drone use up and running the U.S.\n\nInterestingly, the company also sees its new engine being useful in disaster relief, where it will help drones fly longer and more reliably over disaster-stricken areas. One fascinating possibility is that the engine itself, once a drone equipped with a Monarch 5 lands, could be used to bring power to neighborhoods where electricity has been knocked out.", "description": "Faster, lighter, and better range. Why microturbines are the future of unmanned flight.", "authors": ["Greg Nichols"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/09/23/f7a5a0a7-e06a-4fa7-92da-f45c6bf0dc15/thumbnail/770x578/b883f5aba3dafb2943d2eaec68e3e8e3/turbine.jpg", "published_at": "2019-09-24"}