{"pub": "independent", "url": "https://independent.co.uk/independentpremium/trump-iran-us-saudi-arabia-oil-attack-houthis-a9111921.html", "downloaded_at": "2019-09-22 01:59:43.918526+00:00", "title": "Is the US on a military collision course with Iran?", "language": "en", "text": "Saudi Arabia has increased pressure on Donald Trump to take action against Iran, by presenting what it claims to be strong evidence of Iran’s alleged involvement in the attack on two strategic oil facilities in the country. A Saudi defence spokesperson confirmed at a press conference in Riyadh that 25 drones and cruise missiles were used in the attack on the Aramco facilities last Saturday. He said that drones and missiles came from the north, not from Yemen, and that it was “unquestionably sponsored by Iran”.\n\nThe Houthi rebels in Yemen responded by holding their own conference and again claimed responsibility for the attack. US secretary of state Mike Pompeo and the Saudi crown prince Mohammed bin Salman discussed a possible coordinated response. “We are working to build a coalition to develop a plan to deter them. This is what needs to happen. This is an attack on a scale that we’ve just not seen before,” Pompeo said.\n\nThe attack, which Pompeo described as an “act of war”, prompted major speculation on Trump’s possible reaction, and whether the escalation could quickly develop into all-out war. The US announced on Friday it would send additional troops to Saudi Arabia and the United Arab Emirates in response to the attack. The Pentagon said the deployment would involve a moderate number of troops and would be primarily defensive in nature.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWhat is at stake for the US of a military option?\n\nTrump is under tremendous pressure from hardliners to use military force against Iran. Instead he is set to impose more economic sanctions. “Sanctions so far haven’t worked and I doubt they ever will. So I think an appropriate military response is in order,“ Republican senator Lindsey Graham told reporters on Wednesday afternoon. Although the US and Saudi Arabia are pushing the line that Iran sponsored the attack, the Trump administration hasn’t provided any credible evidence to back up its claims. However, experts insist that the attack’s sophistication is way beyond the Houthis’ military capabilities.\n\nBut any military action against Iran could contradict Trump’s campaign vow to avoid a new Middle East predicament. Another military action in the region would alienate most of Trump’s base voters, who are in favour of his isolationist behaviour on foreign policy. In the absence of strong evidence from the UN experts currently investigating the attack, it would indicate for many that the president is willing to outsource the US military power to a foreign state. A possible strike would cause a bigger spike in oil prices, beyond the immediate 20 per cent jump after attacks.\n\nIran is likely to retaliate too. “Iran will immediately respond” to any threat, with a response which “will not be limited to the origin of threat”, Iran reportedly said last week in a letter, according to Iranian state TV. Speaking to CNN in an interview broadcast on Thursday, Iran’s foreign minister Javad Zarif warned of “all-out war” in the event of US or Saudi military strikes against his country, and questioned whether Saudi Arabia was prepared to fight “to the last American soldier”.\n\nThere is also a possibility that Iran will withdraw from the nuclear deal signed with world powers in 2015, from which Trump announced US withdrawal last year. This means that Iran would resume its nuclear programme in full. An American strike would push more US allies to think twice before joining a US-led maritime force to guarantee the freedom of navigation in the Gulf, after a number of attacks on oil tankers there. Iran has denied allegations it was involved in the drone attack or the attacks in the Strait of Hormuz.\n\nWhat are the potential benefits of the military option?\n\nTrump is widely seen by his allies as having always stopped himself from fully committing to military action. He said he decided in June to pull back a military strike against Iran at the last moment after the downing of a US drone over the Gulf of Oman by the Islamic republic. This month, Trump fired his national security adviser John Bolton for maintaining his hardline position on Iran and opposing the president’s policy. Trump also appears eager to hold talks with Iranian president Hassan Rouhani over a new deal, in his bid to score victories abroad before the 2020 presidential election\n\n“How did going into Iraq work out?” Trump asked, then added: “There’s plenty of time to do some dastardly things. It is very easy to start. And we’ll see what happens.”\n\nBut if the attack was the work of Iran this will mean that Iran has concluded that the president’s unwillingness to back up his policies with military force shows that Washington is unlikely to respond to any provocation. Military action may lead to US allies in the Middle East retaining their trust in the US as a reliable ally, after doubts have surfaced that Trump is playing regional rivals and allies off against one another for more investments and arms deals.\n\nIs US military action against Iran likely?\n\nAll cards are still on the table. However, last week’s attack on the Saudi oil facilities had little impact on the US economy. Thanks to shale oil, the US has become the biggest oil producer in the world, with a daily production of 12.4 million barrels. This reduces the US strategic commitment towards the Gulf region and the Middle East as a whole. There is increasing speculation among US Arab allies that Washington is taking a step back from the region, despite the rising tensions. After tweeting last Sunday that “there is reason to believe that we know the culprit, are locked and loaded depending on verification”, Trump watered down the possibility of any American intervention.\n\nAnalysts say Trump used the attack to pressure Saudi Arabia and the UAE to join the maritime force, which Pompeo is yet struggling to win wide support for. Both countries announced joining the force this week. The presidential campaign will be the main obstacle in the faces of Trump’s aides who seek to convince him to take military action. But despite the recent departure of Iran hawk John Bolton from the White House, there is always the risk of a dangerous escalation given both sides are happy to trade escalating barbs.", "description": "Saudi Arabia has increased pressure on Donald Trump to take action against Iran, by presenting what it claims to be strong evidence of Iran’s alleged involvement in the attack on two strategic oil facilities in the country. A Saudi defence spokesperson confirmed at a press conference in Riyadh that 25 drones and cruise missiles were used in the attack on the Aramco facilities", "authors": ["Ahmed Aboudouh"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/19/15/drones.jpg", "published_at": "2019-09-21"}