{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/pete-buttigieg-on-the-offensive-in-fourth-democratic-debate.html", "downloaded_at": "2019-10-16 05:53:12.033343+00:00", "title": "Pete Buttigieg on the Offensive in Fourth Democratic Debate", "language": "en", "text": "Photo: Win McNamee/Getty Images\n\nIt was obvious to anyone who’d been paying attention heading into Tuesday night’s debate that Elizabeth Warren — now the front-runner in Democrats’ presidential nominating contest — would get her share of heat from her competitors. But in the final moments before gametime, as CNN’s panelists discussed their expectations, David Axelrod made a narrower prediction. It would be a problem, he said, for Pete Buttigieg if the South Bend mayor didn’t target Warren, after all the work he’d been doing to preview that attack — most prominently debuting a new ad on Tuesday — in recent days.\n\nThe viewers who were watching Buttigieg closely knew exactly what Axelrod was talking about. Three hours later, the rest of the country has now also seen a punchier Buttigieg than ever before, as he makes a risky wager — a bet on a largely new campaign tack — that could define the trajectory of his candidacy.\n\nOver the course of the debate in suburban Columbus, Buttigieg clashed with Warren over the details of her Medicare for All support and her plan to pay for it. But he did not reserve his fire exclusively for Warren. He also disagreed vehemently with Tulsi Gabbard over Middle East policy, and ripped into Beto O’Rourke over his position on an assault weapon buyback plan — perhaps the tensest exchange of the night (“I don’t need lessons from you on courage, political or otherwise,” the mayor said).\n\nIt was a break from the more mild-mannered Buttigieg voters had gotten to know over the first four debates, and over his first 10 months in the national eye. This candidate, eager to look like a truth teller and get in the mix as the bigger-name contenders wage ideological war, has sharper elbows than the version who’s quietly been building up his Iowa operation in recent months. It’s all part of a bet he’s making that drawing these kinds of stark contrasts now — just as more voters tune into the race, and just as Warren surges — can position him to be an alternative to Joe Biden for moderate voters, or that it can at least vault him from the floor of the race’s top tier, alongside Kamala Harris, to somewhere in the vicinity of Bernie Sanders’s third place status.\n\nBut his gambit is far from straightforward.\n\nBy turning a fight with Warren into one of his centerpiece moments in the national eye, Buttigieg is also gambling that undecided voters now actually want to see this kind of disagreement, even after the last three candidates to try and make such striking attacks on stage — Harris, Cory Booker, and Julián Castro, all on Biden — saw no long-term polling gain. He’s hoping that it doesn’t tank his support among the slice of progressives that has been willing to give him a look. And it’s based on an expectation that voters who have gotten to like Buttigieg’s brand of low-key moderation and calls for generational change won’t rebel against these kinds of explicit critiques of his rivals.\n\nButtigieg and Democrats around him have been most eager to pick the health-care fight, according to multiple people in his orbit. Though he’d found himself clashing with Warren supporters in the last week for labeling grassroots donations “pocket change” in a recent interview while making a point about general election fundraising strategy, and though he’d engaged in a back-and-forth with O’Rourke — who trails him in most polling — over gun policy, he has been trying to put himself more forcefully in the middle of the health-care fight with ads in early-voting Iowa touting his own alternative to Medicare for All. It’s a strategy he’s following more successfully than others who’ve tried a version of it, like Steve Bullock, Michael Bennet, John Hickenlooper, and John Delaney.\n\nThose close to Buttigieg are fond of pointing to a late September Des Moines Register poll demonstrating fear among some Democratic caucus goers that Medicare for All could cost the party in the general election, and on Tuesday Buttigieg released a digital ad criticizing Sanders and Warren by name while touting his own plan. It was the first candidate ad of the cycle directly going after named opponents, and Buttigieg on stage accused Warren of being evasive over her plan’s funding, a reflection, he said, of “why people here in the Midwest are so frustrated with Washington in general and Capitol Hill in particular.”\n\nButtigieg isn’t the only candidate whose path ahead relies on Biden faltering. But in order to truly take Biden’s place at some point, he’d need to massively expand his support among both African-American voters and Democrats who aren’t yet fully engaged in the primary — two groups that have been Biden’s core supporters, but with whom Buttigieg has struggled. He’s now committed himself to a future firmly within that lane, with little wiggle room after he said onstage that Warren’s and Sanders’s health-care proposals would “unnecessarily divide this country” in a post-Trump world. Some of the fury that has long come Biden’s way from progressives fed up with his centrism is now certainly headed Buttigieg’s way.\n\nTo hear his allies tell it, Buttigieg’s new strategy makes sense because voters are now demanding clarity on what divides the candidates, and they’ll appreciate his new assertiveness. That may make the difference between his position in the top five and a place in the top three. It will, at the very least, determine whether the hopeful candidate who’s tried to spur a generational revolution can now credibly convince people to think of him as the moderate hope.", "description": "At the fourth Democratic primary debate held in Ohio, South Bend mayor Pete Buttigieg was more aggressive than he has been throughout the race, as part of his effort to  position himself as the alternative to Joe Biden for moderate voters.", "authors": ["Gabriel Debenedetti"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/14/pete_buttigieg.w1200.h630.jpg", "published_at": "2019-10-16"}