{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/manchester-united-sweating-paul-pogba-fitness-ahead-liverpool-clash-10896649", "downloaded_at": "2019-10-10 15:14:05.266812+00:00", "title": "Manchester United sweating on Paul Pogba fitness ahead of Liverpool clash", "language": "en", "text": "Paul Pogba is struggling with a toe injury (Picture: Getty Images)\n\nPaul Pogba is likely to be out of Manchester United’s Premier League clash with Liverpool due to a cracked toe, according to reports in France.\n\nThe midfielder has not played since United’s draw with Arsenal on 30 September, which French publication L’Equipe put down to a small crack in a toe.\n\nThe injury was actually picked up in the League Cup meeting with Rochdale on 25 September, but he was risked against the Gunners and the injury was aggravated.\n\nL’Equipe believe that the injury should be treated with seven days of rest followed by two to three weeks of recovery – if this time frame is being followed from the Arsenal match, then he would be out of Liverpool’s trip to Old Trafford on 20 September.\n\nAdvertisement\n\nAdvertisement\n\nSurgery is an option to take care of the injury, but neither Manchester United nor the player want to go down that route, preferring to allow the problem to heal naturally.\n\nIn Pogba’s absence, United have failed to score in two games, drawing 0-0 with AZ Alkmaar in the Europa League and slumping to a 1-0 defeat against Newcastle in the Premier League.\n\nOle Gunnar Solskjaer will be hoping to get the World Cup winner back in time for the game against the Reds, along with a number of other players struggling with injury.\n\nAnthony Martial (thigh), Aaron Wan-Bissaka (illness), Jesse Lingard (thigh), Victor Lindelof (back) and Mason Greenwood (back) are all fighting to be available for the match against United’s fierce rivals.\n\nHowever, Eric Bailly (knee) and Diogo Dalot (groin) will remain out.\n\nMORE: Why Zinedine Zidane is confident Real Madrid will sign Paul Pogba from Manchester United\n\nMORE: Juventus prepared to offer Mario Mandzukic and Emre Can to Manchester United in new Paul Pogba bid", "description": "Paul Pogba is likely to be out of Manchester United's Premier League clash with Liverpool due to a cracked toe, according to reports in France. The midfielder has not played...", "authors": ["Metro Sport Reporter"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-11781973902_1570718161.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-10"}