{"pub": "investing.com", "url": "https://investing.com/analysis/gbp-vol-here-to-stay-as-brexit-plot-thickens-200474297", "downloaded_at": "2019-10-17 09:19:41.218978+00:00", "title": "GBP Vol Here To Stay As Brexit Plot Thickens", "language": "en", "text": "The groovy mood around a potential Brexit deal keeps underpinning the and the as UK government officials burn the midnight oil trying to get enough support from MPs to seal a deal with the EU even if the arithmetic suggests it will be a tall order to get an agreement through the Parliament. Overdone or not, the market likes what's been achieves so far.\n\nQuick Take\n\nWe are probably at the most crucial week in this whole Brexit mess ever since the saga first kicked-off more than 3 years ago. It's therefore no wonder to see an excess of volatility in the sterling as the market keeps re-adjusting to the positive expectations of a deal, which so far has resulted in a tsunami of buy-side pressure as momentum, algo traders pile into longs while at a more macro level, corporate and commercial hedges are unwound and market makers remove tight interval offers amid rising imp vols.\n\nIt's going to come down to the wire whether or not the UK can pull enough strings to make this new proposed deal happen. There are still a lot of unknowns and the arithmetic for the UK PM to garner enough support from MPs, let alone to get the final blessing from the EU, is certainly a tall order. The next 2 days in the pound won't be for the fainthearted type, that's a given.\n\nElsewhere, the remains under pressure as optimism that a Brexit can finally happen builds up. The and the were notable underperformers too, as the RBNZ deputy governor Geoff Bascand threw a curveball by noting reasonable prospect for the cash rate going lower. The , which has been on a downward trend since early October, kept that directional bias intact as US retail sales disappointed (first decline in seven months). The euro, on Brexit groovy vibes, alongside the , boosted by a , were the outperformers, joining the King of Forex this week (GBP).\n\nFX Chart\n\n* The Information is gathered after scanning top publications including the FT, WSJ, Reuters, Bloomberg, ForexLive, Institutional Bank Research reports.\n\nThe groovy mood around a potential Brexit deal keeps underpinning the pound and to a lesser extend the euro as the UK government burns the midnight oil trying to gather enough support from MPs even if the arithmetic suggests it will be a tall order to get an agreement through.\n\nEU officials have reiterated that for the Commission to evaluate a new Brexit proposal that satisfies all the predetermined requirement as it relates to the Irish border, it would have to be submitted by tonight UK time, but there are no signs of that happening yet. The BBC cited a government source noting that there will be “no deal tonight”.\n\nDuring Wednesday, the top European Union negotiator on Brexit, Mr. Barnier, said to have told EU commissioners that he is optimistic of getting a deal done today, according to RTE political editor, Tony Connelly, while highlighting that outstanding issues were to be resolved.\n\nIn today’s speech in the 1933 committee, UK PM Johnson told backbench MPs that 'we are almost there', repeating that the UK will leave the EU on October 31, no matter what. Varies MPs, including ERG leader Steve Baker who said a 'deal sounds like it could be tolerable', appear to see enough merit on the progress made so far to lean towards an endorsement of the deal, although one unshakable condition must be that there is a legal text that backs it up.\n\nAs a reminder to readers, there will be an extraordinary vote on the new proposed Brexit deal on Saturday, which is very unlikely to meet the above required steps of making a legal text available, but instead we may end up with just a political declaration of intent. What this means, which is something Germany has already warned, an extension may be inevitable beyond Oct 31st, even if it’s just a formality to finalize the drafting of the legal text.\n\nA report by RTE confirmed, according to as many as 4 different European sources, that the DUP has agreed on the major sticking points to a deal, which was a comment immediately denied by the DUP leader Arlene Foster, who replied that chatter was 'talking nonsense' as talks continue, adding that “needs to be a sensible deal which unionists and nationalists can support.”\n\nFrench President Macron was reportedly saying that “a Brexit agreement is being finalized” even if at this point the chances of a deal depends on getting the support from the DUP and perhaps also a few Tory MPs who may disagree should the agreement no longer represent the political will for a commitment that includes continuing tariff free trade between the UK and The EU. Meanwhile, Germany’s Chancellor Merkel said 'we are in the last meters in negotiations'.\n\nStaying with Germany, there has been reports that German Chancellor Angela Merkel’s CDU party may be more flexible to accept fiscal stimulus should the economic recession deepens. Any news that may reinforce the notion of Germany’s balanced budget is a EUR positive driver.\n\nWhile the Brexit news have totally eclipsed the US-China trade negotiations, be mindful that the ironing out of the Phase One details continue, with further deputy-level trade talks eyed this week. According to Fox Business reporter Edward Lawrence, “Deputy Level Chinese trade meetings will happen this week. We expect one more call between the heads of the US & Chinese trade teams. Then possible meetings in mid-November. The Administration pushing to have a final \"Phase One\" deal on paper by Mid-November.\"\n\nThe Fed's Beige Book, which tends to be a barometer of where the Fed sees the overall economic activity, saw a downgrade by noting that the economy expanded at slight-to-modest pace. Businesses see expansion continuing, but many have cut outlook. Districts in south and west were more upbeat that midwest and great plains. Some districts suggested persistent trade tensions and slower global growth weighed on activity. Most expect economic expansion to continue; however many lowered their outlooks for growth in the coming 6-12 months. Wages rose moderately in most districts, with upwards pressure noted for lower-skill workers.\n\nNZ Q3 CPI stood at 0.7% q/q vs 0.6% exp and 1.5% y/y vs 1.4%. While the logic is that the RBNZ won't be as compelled to ease on higher inflation, Reserve Bank of New Zealand deputy governor Geoff Bascand threw a curve ball to the optimism, noting that NZ remains vulnerable to external shocks, hence lower rate may still be needed to achieve objectives. He added that \"sees lower rates being here for some time\", with reasonable prospect the cash rate going lower.\"\n\nThe Canadian Sept CPI came at +1.9% y/y vs +2.1% expected, while the CPI m/m stood at -0.4% vs -0.2% expected, putting downward pressure on the Canadian dollar. The headline number was clearly underwhelming but the core numbers were borderline in respecting the BOC inflationary mandate, which makes the initial negative reaction slightly overdone as it may not alter the neutral policy stance by the BOC, especially on the back of last week’s blockbuster jobs report out of Canada. The major drag was a 10.0% y/y fall in gasoline prices.\n\nThe US September advance retail sales came much worse-than-expected at -0.3% vs +0.3% expected, which represents the first drop in seven months. The USD was taken to the woodshed after the poor reading as odds of a Fed rate cut in Oct 31st now increase.\n\nRecent Economic Indicators & Events Ahead\n\nSource: Forexfactory\n\nA Dive Into The FX Indices Charts\n\nThe EUR index has found a new base above its prior resistance, with dips so far bought as larger pools of liquidity become now available above the most recent bracket. The structure of the market is clearly bullish in the hourly, with leeway until the next level of daily resistance, even if much of today’s price action will depend on the Brexit negotiations.\n\nEuro Index Chart\n\nThe GBP index continues to charge higher in a constructive bullish stepping formation where recent levels of support drew a lot of attention to join the bid, to the extent that the index has broken above a key level of daily demand. Technically, the market remains a buy on dips, but any wrong Brexit-related headline could see a sudden change of flows.\n\nGBP Index Chart\n\nThe USD index is breaking below a level of daily support where rich liquidity to buy the USD may be found even if the market structure suggests the pressure may continue to the downside. There is certainly room for the USD to keep depreciating until faced with the next level of horizontal support, which is found around 0.3% below the current price.\n\nUSD Index Chart\n\nThe CAD index has pulled back all the way to a critical level of support in the hourly chart, where a rich pool of liquidity in various CAD pairs may be available. Since the departure of the tested swing low did achieve a full extension to visit the opposing high, one would think that structurally wise enough merit has been achieved for demand to return around these levels.\n\nCAD Index Chart\n\nNZD Index Chart\n\nThe NZD index broke a key level of daily demand, which was a riskier proposition to consider as we were trading against the dominant long term trend. The decisive breakout of support went for a deep extension lower before a sharp retracement to test a pool of offers as represented by the hourly resistance line in green. From here, sellers are aiming to retake control.\n\nThe AUD index has seen a ferocious rebound as liquidity was withdrawn from the market on a better-than-expected AUD jobs report, leading to a retest of a supply pocket in the hourly, perfectly aligned with the intersection of the baseline, hence creating a confluence for sellers to exploit. So far, the price has stopped on its tracks around this level of resistance.\n\nAUD Index Chart\n\nThe JPY index is on a clear bearish trend, with the consumption of a daily demand level now setting the stage for a fresh cycle low with plenty of downside room as per the void available. Any rebound should be seen as a sell-side opportunity all else equal. The flows could see a sudden change on any upset coming from China trade negotiations but most importantly this week, on whether or not a new Brexit deal is achieved.\n\nJPY Index Chart\n\nThe CHF index is trading back and forth without a particular direction in the last few days, even if the underlying trend remains down, so we should interpret the current seesawing price action as acceptance at lower levels. This means that the risk is still skewed towards the downside, with the latest rebound earlier in the week sold in earnest before the current consolidation.\n\nCHF Index Chart\n\nImportant Footnotes", "description": "Forex Analysis by Ivan Delgado covering: EUR/USD, GBP/USD, USD/JPY, AUD/USD. Read Ivan Delgado's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-17"}