{"pub": "cryptocoin", "url": "https://cryptocoin.news/token-news/october-30-2019-paxos-standard-pax-up-0-11-31674", "downloaded_at": "2019-10-30 11:07:29.121014+00:00", "title": "October 30, 2019: Paxos Standard (PAX): Up 0.11%; Price Crosses 20 Day Average; 3rd Consecutive Up Day", "language": "en", "text": "Paxos Standard: What’s the Latest Regarding its Price?\n\nPaxos Standard is up by approximately 0.11% from the previous day, with its price currently hovering around $1.001 USD. Paxos Standard is currently in a unclear , and it should be noted that this is now the the 3rd day in a row that price has been up. Moreover, Paxos Standard is now 0% above its 20 day moving average. In terms of an expected trading range, the Bollinger bands on Paxos Standard suggest price may bounce between $0.998177 and $1.003773 based on its momentum and volatility over the past 14 days. Given its boundaries, rangebound traders may find it compelling to entertain shorting, as we are nearer to the top of the range.\n\nTrade Paxos Standard (PAX) and over 500 other cryptos across ten different exchanges — all from one app. Try Quadency.\n\nThe market capitalization of Paxos Standard, or the amount of US dollars it would take to buy up all the circulating coins, is currently estimated to be $255 million.\n\nDaily Engagement Metrics Update\n\nYesterday we did not see any transfers amongst holders of Paxos Standard. As for the number of holders, yesterday saw the number of wallets holding Paxos Standard decline by 131. To provide context, we’d rank this token as 6 out of the 34 Ethereum tokens in our index based on percentage growth in engagement over the past 7 days.\n\nHow are the Strong Holders of Paxos Standard Faring?\n\nThe top 1,000 Paxos Standard wallets hold over 96.64% of the token’s total money supply. As for the Paxos Standard’s smart contract itself, that owns 0.05% of the total money supply, an amount unchanged from the week prior.\n\nTechnical Development Status\n\nIn terms of how active the software development team working on Paxos Standard is, it may be worth observing that the last time any work pertaining to code was done on their GitHub code repository was on October 24, 2019, or approximately 6 days before. Over the past 30 days, we’ve seen open issues across Paxos Standard’s GitHub repositories grow by -0.03 per day on average, while the number of watchers has grown by 0.07.\n\nThe Latest on Paxos Standard and Social Media\n\nIn terms of social media presence, Paxos Standard saw its Twitter followers go up by 19 over the past 24 hours. If you are interested in following Paxos Standard on social media, Twitter, where it has 2,205 following it, may be a good place to start. You can follow Paxos Standard on Twitter here.\n\nWhere to Buy\n\nYou can trade Paxos Standard, listed under the symbol PAX, through the following exchanges: Gate, Yobit, Binance, DDEX, Ethfinex.\n\nArticle by SixJupiter", "description": "", "authors": [], "top_image": "https://cryptocoin.news/wp-content/uploads/2019/04/paxos-standard-1.jpg", "published_at": "2019-10-30"}