{"pub": "yahoo", "url": "https://yahoo.com/entertainment/shepard-smith-exiting-fox-news-ready-to-begin-a-new-chapter-204827494.html", "downloaded_at": "2019-10-12 00:20:14.111907+00:00", "title": "Shepard Smith exiting Fox News in surprise move, ready to 'begin a new chapter'", "language": "en", "text": "Shepard \"Shep\" Smith announced he's leaving Fox News on Friday, a move that has stunned his colleagues and viewers. Smith, who had been at Fox News since its inception — and who had become one of the few voices on the network to disagree with Fox’s pro-Donald Trump commentators — had been serving the network's chief news anchor, managing editor of the network's breaking news unit and anchor of Shepard Smith Reporting.\n\n\"Recently I asked the company to allow me to leave Fox News and begin a new chapter,\" Smith said in a statement on Friday afternoon. \"After requesting that I stay, they graciously obliged. The opportunities afforded this guy from small town Mississippi have been many. It’s been an honor and a privilege to report the news each day to our loyal audience in context and with perspective, without fear or favor. I’ve worked with the most talented, dedicated and focused professionals I know and I’m proud to have anchored their work each day — I will deeply miss them.\"\n\nNEW YORK, NEW YORK - SEPTEMBER 17: (EXCLUSIVE COVERAGE) Jane Skinner visits \"Shepard Smith Reporting\" at Fox News Channel Studios on September 17, 2019 in New York City. (Photo by Steven Ferdman/Getty Images) More\n\nJay Wallace, the president and executive editor of Fox News Media, addressed Shepard's decision.\n\n\"Shep is one of the premier newscasters of his generation and his extraordinary body of work is among the finest journalism in the industry,\" Wallace said in a press release. \"His integrity and outstanding reporting from the field helped put Fox News on the map and there is simply no better breaking news anchor who has the ability to transport a viewer to a place of conflict, tragedy, despair or elation through his masterful delivery. We are proud of the signature reporting and anchoring style he honed at Fox News, along with everything he accomplished here during his monumental 23-year tenure. While this day is especially difficult as his former producer, we respect his decision and are deeply grateful for his immense contributions to the entire network.\"\n\nSmith was one of the original team hired by Fox News in 1996. He began hosting his daytime show Shepard Smith Reporting in 2002.\n\nFriday's episode of Shepard Smith Reporting was Smith’s final show at the network. Fox News announced a series of rotating anchors will host the 3 p.m. ET time slot until a new dayside news program is announced.\n\nFNC’s business anchor Neil Cavuto reacted to the news in real time. \"Whoa,\" he said at the top of his show. \"I'm Neil Cavuto and, like you, I'm a little stunned and a little heartbroken. I don't know what to say.\"\n\n\"A decent human being ... a better newsman you probably cannot find,\" Cavuto continued. \"A bigger, more emotionally connected to human kind you cannot find. So Shepard, I don’t know what the heck you’re planning to do or where you go, but I just know you’ll be great at doing it, and you deserve the best that life has to offer. So, I'm sorry if I'm a little shellshocked here, but I'm going to miss my buddy.\"\n\nFox News Channel’s chief White House correspondent John Roberts added on Cavuto's program, \"I’m just trying to compile my thoughts too, Neil. I walked out here to do the hit and suddenly got hit by a subway train. Holy mackerel.\"\n\nBrett Baier, the network’s chief political anchor, tweeted his shock, adding, \"I wish him well in whatever lies ahead.\"\n\nToday brought about a little shock for us here at #FoxNews as our colleague Shepard Smith announced it would be his last broadcast. We wish him nothing but the best-- View his goodbye below: pic.twitter.com/LB9DFZetBb — Bret Baier (@BretBaier) October 11, 2019\n\nI first worked with Shep on my first assignment at @FoxNews almost 23 years ago. It was a total shock today to find out he’s leaving. He anchored breaking news -fast-moving events —better than anyone. I wish him well in whatever lies ahead — Bret Baier (@BretBaier) October 11, 2019\n\nSmith won't be heading to a rival network anytime soon. During his on-air announcement Friday he referenced a non-compete clause he agreed to with FNC.", "description": "Friday's episode of \"Shepard Smith Reporting\" will be its last. He was one of FNC's few public critics of Donald Trump.", "authors": ["Taryn Ryder"], "top_image": "https://s.yimg.com/uu/api/res/1.2/a9FVwrUZXJEHG0Gwpax1vg--~B/aD0yMzk2O3c9MzYwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/0ae63270-e073-11e9-bf7d-dc64b30a5eb5", "published_at": "2019-10-11"}