{"pub": "yahoo", "url": "https://sports.yahoo.com/colin-kaepernick-agent-increasingly-frustrated-035632960.html", "downloaded_at": "2019-10-11 19:57:19.071376+00:00", "title": "Colin Kaepernick Agent, Increasingly Frustrated At NFL’s Snub, Sends Out Press Release", "language": "en", "text": "Click here to read the full article.\n\nColin Kaepernick is obviously growing more and more frustrated that the National Football League is ignoring him.\n\nScroll to continue with content Ad\n\nKapernick’s agent, Jeff Nailey, and PR director Jasmine Windham sent out a Q&A press release on Thursday titled “Facts to Address The False Narratives Regarding Colin Kaepernick.” The release was apparently issued in frustration that the Pittsburgh Steelers are choosing to start an undrafted rookie, Devin Hodges from tiny Samford College, rather than enlist the former 49ers starter.\n\nMore from Deadline\n\nHodges will make his debut this weekend. He is just the latest second and third-stringer to get a shot at playing in the NFL while the former 49er sits and stews.\n\nKaepernick, the first NFL player to take a knee during the National Anthem, has now been out of the league for three years. During that time, he won a collusion case against the NFL for keeping him out of the league, spawned a protest by musicians over appearing at the Super Bowl halftime because he has been denied employment, and became the face of a Nike campaign that emphasized his rebel qualities.\n\nStill, the lure of football is something Kaepernick can’t seem to shake. So his agents put out a release that includes nine questions and statistics that, they believe, shows the misinformation circulating about him. It joins the workout videos circulated on social media as part of a package to show that he remains ready and willing to take some snaps, if only given a chance.\n\nThe release:\n\nOctober 10, 2019\n\nStory continues\n\nFacts to Address the False Narratives Regarding Colin Kaepernick.\n\nThere have been so many false narratives in the media regarding Colin, we believe it is important to set the record straight, again. Nothing below is up for interpretation or debate, it’s the truth and nothing else.\n\nIs Colin still able to seek employment in the NFL after he filed a grievance?\n\nYes. Eric Reid filed the same grievance and is currently employed by an NFL team.\n\nHas Colin been offered a job by an NFL team?\n\nNo, not a single team has offered Colin a job since the 2016 season, in which he began his peaceful protest.\n\nHas Colin ever had a workout with an NFL team?\n\nNo, not a single team has brought Colin in for a workout. Seattle brought Colin in for a visit but did not work him out. Afterwards, Pete Carroll said Colin is a “starter in this league.” No other NFL team has interviewed or worked out Colin in the past 3 seasons, despite other false statements in the media to the contrary.\n\nHave you reached out to every team on Colin’s behalf?\n\nI have reached out to all 32 teams about Colin’s employment, with little to no response from teams about an opportunity for Colin. In 25 years, I have never seen anything like it.\n\nHas Colin demanded a specific salary in connection with his employment?\n\nNo, that narrative is completely false.\n\nWhat about Colin being a “distraction” with the 49ers?\n\nHis coach, Chip Kelly, during the 2016 season said about Colin, “He is zero distraction.” In that same 2016 season, Colin also won the Len Eshmont Award, voted on by 49er players and given to the 49er who best exemplifies inspirational and courageous play.\n\nDoes Colin still want to play?\n\nYes, he has been working out 5 days a week, for 3 years, in preparation to play again.\n\nIf Colin wants to play, why did he opt out of his 49ers contract?\n\nColin opted out after his conversation with the 49ers GM, John Lynch, who told Colin they were going to cut him and publicly stated, “I don’t want to characterize it as he made a decision to leave here…You can opt out, we can release you.” Colin opted out prior to free agency to maximize potential employment opportunities and because the 49ers would have cut him prior to the start of the 2017 season.\n\nDoes Colin fit into most teams’ “system”?\n\nYes. Colin played in a West Coast Offense under Jim Harbaugh, and the idea he doesn’t fit a team’s system does not mesh with how teams have adjusted their offensive schemes to fit the skill set of their quarterbacks. Colin has the same skill set as many of the young mobile quarterbacks flourishing in the NFL right now.\n\nIs Colin still good enough to play?\n\nLet’s provide some statistics to show Colin’s ability to play football at the highest level: Despite having to recover from three surgeries during 2016, Colin immediately started once healthy and was never beaten out by any other quarterback on the roster.\n\n2016 progress in QB Rating after coming back from injury:\n\n66.4 First 2 Games (Post-Injury)\n\n93.6 Next 5 Games\n\n101.1 Last 4 Games\n\n2016 Stats (11 Starts)\n\n16 TDs/4 Ints, 2,241 passing yards, 2 rushing TDs, and 468 rushingyards\n\n2016 Stats (projected for 16 starts)\n\n23 TDs/5 Ints, 3,260 passing yards, 3 rushing TDs, and 680 rushing yards\n\nIn his Week 12 start at Miami, he led the 49ers to 475 yards of total offense. Colin accounted for 409 of those yards, including 296 passing and 113 rushing, accompanied by 3 TDs. Colin accomplished all of this behind the 49ers offensive unit that ranked 4th in dropped passes and 29th in pass blocking efficiency, with a defense that ranked 32nd in points per game during Colin’s 11 starts.\n\nCareer TD/Int Ratio:\n\nColin has the 6 th best ratio in NFL History among QBs with at least 70 TDs, directly ahead of Derek Carr (7th), Drew Brees (8th), and Matt Ryan (9th).\n\nCareer Stats\n\n– 72 TD/30 INT, 12,271 passing yards, 13 rushing TDs, 2,300 rushing yards\n\nPlayoff Record\n\n– (4-2) including 1 Super Bowl appearance and 2 NFC Championship appearances.\n\nIn summary, it is difficult to think of another young player in NFL history with statistics and character as impressive as Colin’s not being given an opportunity to earn a spot on an NFL roster after what he has accomplished.\n\n###\n\nJ eff Nalley:\n\nAgent for 25+ years for multiple starting QBs, All-Pro and Pro Bowl players, 1 st round picks, and has negotiated contracts of $50M+, $60M+, and $100M+.\n\nJasmine Windham:\n\nPR Director for 5+ years for multiple All-Pro and Pro Bowl players, 1 st round picks, and Super Bowl Champions.\n\nSign up for Deadline's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.", "description": "Colin Kaepernick is obviously growing more and more frustrated that the National Football League is ignoring him. Kapernick's agent, Jeff Nailey, and PR director Jasmine Windham sent out a Q&A press release on Thursday titled \"Facts to Address The False Narratives Regarding Colin Kaepernick.", "authors": ["Bruce Haring"], "top_image": "https://s.yimg.com/ny/api/res/1.2/5cMXS__dOJYgCz8PxZDunA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjEuMDY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/Hv670Kk0G80ifCixbUNHsQ--~B/aD0xMjA5O3c9MjE0NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/deadline.com/35d6ff3602b8aeb8fd24626f8105ce59", "published_at": "2019-10-11"}