{"pub": "businessinsider", "url": "https://businessinsider.com/ski-resort-best-affordable-skiing-winter-2018-us-canada-winter-2017-10", "downloaded_at": "2019-10-14 23:30:18.334139+00:00", "title": "19 of the best ski resorts in North America that don't cost a fortune", "language": "en", "text": "Vacation rental website HomeToGo compiled a list of the most affordable ski resorts in North America.\n\nResorts were ranked by the cost to enjoy one day/night on the slopes, including equipment rental, lift pass, lunch, and accommodation in the 2018/2019 ski season.\n\nBritish Columbia, Canada was a popular spot last year, with five resorts in the area appearing on this list. Noticeably missing are any famed Colorado mountains.\n\nKeep reading for a look at where people made the most of their money on their ski trips.\n\nVisit Business Insider's homepage for more stories.\n\nWith ski season quickly approaching, it's important to assess your options before booking your winter getaway.\n\nHomeToGo, a vacation rental search tool, compiled a list of the most affordable ski resorts in North America so you can tear up the slopes, even if you're on a budget.\n\nThe company gathered data for top-rated ski resorts in the US and Canada during the 2018-2019 season and then calculated the average total cost of a one day/night stay. The final cost includes:\n\nEquipment rental: mid-level skis, boots, poles, and a helmet for one day.\n\nA one-day lift pass.\n\nLunch: a burger with fries and a soda at a mid-range restaurant on the slopes.\n\nAccommodation: the average price per person for a four-person vacation rental found on HomeToGo in the resort, between November 17, 2018 and April 20, 2019.\n\nKeep reading to check out the 19 most affordable ski resorts in North America, where a day of skiing plus an overnight stay came out under $250 this past season. Entries are ranked in descending price order. There are several spots in British Columbia, and a couple scattered out west in the US, but no notoriously pricey slopes in Colorado made the list.", "description": "Each ski resort on the list totaled under $250 for a lift pass, equipment, lunch, and overnight stay last season.", "authors": ["Taylor Borden"], "top_image": "https://image.businessinsider.com/5da478104af90920617c86c5?width=1200&format=jpeg", "published_at": "2019-10-14"}