{"pub": "abcnews", "url": "https://abcnews.go.com/US/cayman-airways-flight-makes-emergency-landing-orlando-due/story?id=65477562", "downloaded_at": "2019-09-09 08:35:29.031112+00:00", "title": "Cayman Airways flight makes emergency landing in Orlando due to feared smoke condition", "language": "en", "text": "Passengers on a Cayman Airways flight made a frightening, emergency landing in Orlando on Sunday evening after pilots detected a smoke condition on board.\n\nFlight KX792 departed Grand Cayman at 3:30 p.m. for New York's John F. Kennedy International Airport before diverting to Orlando International Airport, where it landed at 6:17 p.m., after a smoke indicator light came on showing smoke in one of the cargo holds.\n\nThe jet deployed emergency slides on the runway \"with the uncertainty of what was causing the indication,\" according to Cayman Airways.\n\nCayman Airways said there is no evidence there was actually ever smoke in the cargo hold.\n\nThere were 103 passengers and five crew members on board.\n\n\"We are extremely mindful that this emergency landing and evacuation was a very distressing event,\" Cayman Airways CEO Fabian Whorms said in a statements. \"On behalf of Cayman Airways, I offer a most sincere apology to our passengers for having to experience this emergency landing and evacuation, which was necessary in the interest of safety of our passengers and crew.\"\n\nJennifer Chirico Photography by Jennifer Lynn\n\nThe passengers were taken back to the terminal and put in a hotel before scheduling a flight for Monday.\n\nJenn Chirico, who was on the flight, posted on Facebook that the passengers were waiting in the airport since they had to be processed by customs.\n\n\"People in exit rows were to help, slides were deployed, we were instructed when on the ground to run as fast as we could from the plane,\" Chirico posted. \"It was one of the scariest things I have ever experienced.\"\n\nNo one was injured.\n\nThe airplane was removed from service for repairs, which affected four flights on Monday.\n\nABC News' Jamie Aranoff and J. Gabriel Ware contributed to this report.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/cayman-islands-ugc-mo-20190909_hpMain_16x9_992.jpg", "published_at": "2019-09-09"}