{"pub": "usatoday", "url": "https://usatoday.com/story/news/nation/2019/10/29/rescue-cat-returns-favor-alerts-sleeping-owner-apartment-fire/2503287001", "downloaded_at": "2019-10-30 02:26:32.791407+00:00", "title": "Rescue cat returns the favor, alerts sleeping owner to apartment fire", "language": "en", "text": "CLOSE A overnight fire at University Park Apartments in Lansing continued to smoke hours after the blaze displaced residents. Kate Collins, kcollins@gannett.com | @kcollins213\n\nITHACA, N.Y. – About five years ago, Danielle Schafer rescued a kitten off the side of the road.\n\nThe kitten was just weeks old, the final, tiny litter-mate remaining in Schafer’s tender grasp after its feral siblings scurried away into roadside brush.\n\nLast week, Kitty – as the gray, domestic short-haired cat female cat is affectionately known – rescued Schafer in return, pouncing her 12-pound body atop Schafer as she slept in her Lansing bedroom and alerting her to the flames spreading through the apartment walls.\n\nA New York native, Schafer moved into her small, first-floor apartment in September when she relocated to Ithaca for her clinical year of vet school at Cornell University College of Veterinary Medicine. The night before the fire, she readied her hospital scrubs, excited for her next rotation, and was asleep before midnight.\n\nAround 2 a.m., Schafer was jolted awake by Kitty jumping on top of her and what sounded like battering rams at her door.\n\nKitty is a domestic short-haired cat rescue cat belonging to Danielle Schafer, a clinical vet student at Cornell University. (Photo: Provided photo / Danielle Schafer)\n\n\"I thought someone was trying to break in,\" Schafer recalled.\n\nShe rushed to the kitchen and saw a wall of red flames consuming the front of her small apartment. Immediately, she returned to her bedroom to find Kitty and a way to safety.\n\nFor a moment, she couldn’t find either.\n\n“It was pitch-black smoke, and I tried opening the bedroom windows,” Schafer said. “I was yelling, ‘Kitty! Kitty! Kitty!’”\n\nBesides her own screams, Schafer describes the moments after the initial intense bangs – which were later determined to be nearby propane tanks exploding – as eerily quiet.\n\nAccording to Schafer, none of the fire alarms in her apartment were triggered.\n\n“It almost sounded like a peaceful crackling fire,” she said.\n\nStumbling through smoke, Schafer escaped the burning apartment through the patio doors.\n\nHer beloved Kitty was still inside.\n\nNational Cat Day: How to build up your pet's followers on Instagram\n\nOnce outside, she helped the family who lived in the apartment above her escape the worsening flames. The parents dropped their two small children, clad only in diapers, into the outstretched arms of Schafer and a neighbor.\n\nBy the time the flames were extinguished by Lansing and neighboring fire departments, 12 people had escaped to safety.\n\nThe Red Cross arrived, offering shelter, food, clothing and more.\n\n“The unfortunate part is those folks lost everything in their possession for the most part,” Morse said.\n\nSchafer recalls sitting in pajamas on the ground, exhausted and numb to her own injuries, overcome with guilt, sadness over Kitty, who was missing.\n\n“I can’t even describe the feeling,” she said.\n\nAfter regrouping at a nearby hotel, Schafer returned to the apartments at daybreak.\n\nHer apartment was still smoldering.\n\nCLOSE Kitty the rescue cat saves owner, neighbors from devastating fire near Ithaca, NY. Kate Collins, kcollins@gannett.com | @kcollins213\n\nStill, Schafer knew, just knew, that Kitty was in there, alive.\n\n\"I have to find find my cat,\" she thought. \"She saved my life, I need to save hers.\"\n\nOut loud, Schafer screamed. She cried.\n\n\"Everyone knew I was looking for my cat,\" she said.\n\nWhen a sergeant insisted that firefighters had thoroughly checked her bedroom for the missing cat, Schafer began looking under cars and in bushes, everywhere cats hide.\n\nSuddenly, Schafer heard a firefighter yelling for her.\n\n\"Is my cat dead?\" Schafer asked.\n\n\"No,\" the firefighter said. \"Look.\"\n\nIn his arms, he held a small gray cat.\n\n\"It was like a movie,\" Schafer said of the moment she was reunited with Kitty.\n\nAs Schafer predicted, Kitty had hunkered down and made a cocoon in the pillows of the bed to protect herself against the raging fire's thick black smoke. The small cat, stayed there for over seven hours until the persistent firefighter found her.\n\nKitty was treated for smoke inhalation and corneal abrasions at Cornell's Companion Animal Hospital, where she stayed for several days.\n\nSchafer and Kitty are staying with family in Long Island and expect to return to Ithaca soon.\n\n\"She's thrilled to be home,\" Schafer said.\n\nRead or Share this story: https://www.usatoday.com/story/news/nation/2019/10/29/rescue-cat-returns-favor-alerts-sleeping-owner-apartment-fire/2503287001/", "description": "The 12-pound cat named Kitty pounced atop Danielle Schafer as she slept, alerting her to the flames spreading through the apartment walls.", "authors": ["Kate Collins", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/29/PITH/ea6f3b6d-163c-4b7d-840e-de5bb9e0d17d-KITTY_ITHACA01.jpg?crop=2390,1345,x0,y806&width=1600&height=800&fit=bounds", "published_at": "2019-10-29"}