{"pub": "nymag", "url": "https://vulture.com/2019/10/the-morning-show-review.html", "downloaded_at": "2019-10-29 00:19:16.157988+00:00", "title": "The Morning Show Wants You to Watch", "language": "en", "text": "Jennifer Aniston and Reese Witherspoon, chummy for the cameras in The Morning Show. Photo: Apple TV+\n\nApple wants to make a major impression with the launch of its new streaming service, Apple TV+. The Morning Show is the most obvious example of how major it wants that impression to be. This glossy, largely compelling new series possesses major star power — Jennifer Aniston, Reese Witherspoon, and Steve Carell portray its central figures — and a penchant for leaning as hard as it can into moments of high-stakes drama. It is a serious show that, in every frame and every performance, announces that it wants to be taken seriously. Based on the first three episodes, it is also a well-executed work of television that never lets you forget you’re watching a work of television.\n\nDeveloped by showrunner Kerry Ehrin and inspired by the book Top of the Morning: Inside the Cutthroat World of Morning TV by Brian Stelter, The Morning Show is more than just a behind-the-cameras look at how morning television operates. More specifically, it’s about the #MeToo movement and what happens when a sexual-misconduct scandal rips apart the most successful infotainment program on network TV, one that happens to closely resemble the Today show.\n\nThe first episode immediately drops us into a pivotal day in the life of Alex Levy (Jennifer Aniston), the co-host of “The Morning Show” within The Morning Show. As she takes her car service through the streets of Manhattan in the wee-est of wee hours, she continually ignores calls from the show’s producer, Charlie “Chip” Black (Mark Duplass). When she finally arrives at the offices of UBA, the network that employs her, a panicky Chip is standing in front of the building, greeting her with the news that Mitch Kessler (Carell), Alex’s on-air partner of 15 years, has been fired for engaging in sexual misconduct with members of the staff. Alex has to lead the live broadcast alone and address the situation. And she only has a couple of hours to figure out what to say.\n\nPlunging the audience directly into this crisis situation is one of the smartest decisions The Morning Show makes. This in medias res approach immediately draws us into what’s happening and naturally establishes the high-stress, fast-paced environment where much of the story will unfold. The direction by Mimi Leder, who, in addition to directing several episodes, helped establish the tone and aesthetic of the series, also goes a long way toward achieving that. Like actual national morning news programs, The Morning Show looks polished. But as she did during her days on ER, Leder keeps things quite literally moving, pushing cameras through TV studios or following Chip and Alex around the tight corners of the UBA offices as they respond to colleagues constantly throwing informational fastballs. (Duplass, appropriately, looks like a deer caught in the high beams at all times.) There’s a strong sense of momentum and controlled chaos in The Morning Show that engages from the jump.\n\nThings get a little shakier when it comes to certain details. In the first three episodes, to be followed by weekly drops of each of the remaining seven installments, the accusations surrounding Mitch are never spelled out with any clarity. While watching his public shaming unfold from his palatial home outside the city, an incensed Mitch insists that all of his encounters with women have been consensual. But it’s strongly implied that the women calling him out have different stories to tell, yet we don’t get to hear exactly what they entail. There may be a narrative reason for withholding the bare facts, but with only this first trio of episodes to start with, the decision to keep them under wraps makes things murky in a way that doesn’t feel purposeful.\n\nThen there’s Bradley Jackson (Witherspoon), the Virginia reporter who unwittingly gets drawn into the morning-show vortex after video of her yelling at a disrespectful coal-mine protester goes viral and lands her an interview with Alex. The chemistry between the two is interesting enough to capture the attention of Cory Ellison (Billy Crudup, at his most charming and blatantly untrustworthy), the former head of UBA’s entertainment division who is now in charge of news. He immediately tries to recruit Jackson to join “The Morning Show” as a correspondent; through an unexpected series of developments, which I won’t spoil here, she ends up getting quickly thrust into the co-anchor chair next to Alex.\n\nWhile these events are played as surprising and unprecedented, it’s still hard to imagine any circumstance in which a news show this high-profile and under this much duress would stick someone untested and with zero hosting experience into Mitch’s former position. The force of Bradley’s personality and her utter disregard for convention — during a job interview with Chip, she starts screaming at him and telling him his show “sucks” — is supposed to be her selling point, particularly in the eyes of Cory, who is looking to reinvent the formula of “The Morning Show.” Still, for a series that, in a lot of other ways, seems committed to capturing what it’s really like to work in this industry, the hiring of Bradley is, if not quite a bridge too far, at least a few subway stops too far outside of Manhattan.\n\nThose miscalculations are often made up for by a superb cast whose performances remain grounded even when the material threatens to veer off course. The role of Bradley, an ambitious, outspoken firebrand, is about as Witherspoonian as it gets, and the actress tears into it with her usual twangy spirit. Carell is put in the unfortunate position in the first three episodes of having to yell and seem anguished almost constantly, for understandable reasons, but he finds a way to instantly convey how entitled Mitch is as well as how likable he must have seemed to the public. The makers of the show have repeatedly said that Carell is not playing Matt Lauer, and he certainly doesn’t appear to be trying to capture anything specific to the disgraced Today show host in his performance. That being said, bear in mind the following: Mitch gets fired for sexual misconduct, then adamantly contends that he’s the one being mistreated; his younger, model-esque wife leaves him; and it’s revealed that he had a button under his desk that automatically locked and closed his dressing room door. If you can absorb all that and not be reminded of Matt Lauer, then either you were just born five minutes ago — in which case, welcome to the world! — or you have somehow never heard of Matt Lauer.\n\nThe rest of the cast, which includes, among others, Gugu Mbatha-Raw, Nestor Carbonell, Karen Pittman, who played one of Elizabeth’s key sources on The Americans, and Bel Powley of Diary of a Teenage Girl, is really strong, too. But the standout is Aniston, who, like Carell, fully displays the flawed, petty sides of Alex’s personality while projecting a front-facing, inviting confidence that explains why she’s so beloved to her audience. Because of both her role on Friends and the public persona she’s developed — or, if you prefer, been saddled with by the media — Aniston has always come across as the kind of put-together woman that you wish could be your confidante. As Alex, she’s able to throw a few grenades on that image and keep us guessing about whether Alex is a true feminist or a woman who wears that label only when it suits her. Watching her and Witherspoon parry and dodge is especially fun because you so want them to get along — after all, they’re sisters in the parallel Friends universe that continues to exist in this same city! But their interactions tend to spiral into uncomfortable, unexpected places. They keep each other on their toes, and those of us watching, too.\n\nA big issue for Alex is the fact that she’s in the middle of contract negotiations and is certain the higher-ups at UBA are trying to get rid of her because of her age. (She is not wrong.) The hypocrisy of them trying to save face in the middle of a #MeToo controversy while simultaneously preparing to throw their best-known female face under a bus is not lost on her. In a contentious meeting with her bosses in episode three, Alex makes a speech, complete with a full “this is important” zoom in for a close-up, in which she announces that in this era, the old rules no longer apply. “We are doing this my way,” she says, looking down a conference-room table where most of the seats are occupied by white men. “Because frankly, I’ve let you bozos handle this long enough.”\n\nIt’s a great scene, the kind that makes you want to stand up and start slow-clapping. But it’s also the kind of scene that is clearly trying to get you to stand up and start slow-clapping. Bradley complains more than once that “The Morning Show” is too manipulative, and The Morning Show has the same problem at times. But like Bradley, once you get drawn into the center of all this swirling activity, you wind up wanting to stay. UBA, not to mention everyone at Apple TV+, wants you to keep watching. Despite the naked obviousness of that desire, you know that you probably will.", "description": "A review of the Apple TV+ series “The Morning Show,” starring Jennifer Aniston, Reese Witherspoon, and Steve Carell.", "authors": ["Jen Chaney"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/25/25-the-morning-show.w1200.h630.jpg", "published_at": "2019-10-28"}