{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-kurds-syria-turkey-isis-us-allies-sanctions-a9158626.html", "downloaded_at": "2019-10-16 20:44:42.610564+00:00", "title": "Trump says Kurds are 'no angels', after US allies helped defeat Isis", "language": "en", "text": "Donald Trump has described Kurds as \"no angels\" as he attempted to defend his decision to allow Turkey's offensive in Syria.\n\nThe comments from the president — who also said it was \"fine\" for Russia to assist Assad regime in the conflict — come despite Kurdish forces being longstanding allies of the US who played a key role in the defeat of Isis.\n\nHe also claimed imposing US sanctions on Turkey would be better than fighting in the region.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n\"All American soldiers are away from the site. Syria and Turkey can fight... They’ve got a lot of sand over there... There’s a lot of sand that they can play with,” Mr Trump said in the White House.\n\n\"They are no angels, by the way,\" Mr Trump continued, referring to a group who have been bombarded since the US pulled troops from northern Syria, allowing the Turkish offensive.\n\n\"If Turkey goes into Syria it is between Turkey and Syria. It’s not our problem,\" he said.\n\nShape Created with Sketch. In pictures: Fighting between Kurds and Isis intensifies in Kobani Show all 30 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. In pictures: Fighting between Kurds and Isis intensifies in Kobani 1/30 Kobani An explosion rocks Syrian city of Kobani during a reported suicide car bomb attack by the militants of Isis group on a People's Protection Unit (YPG) position in the city center of Kobani, as seen from the outskirts of Suruc, on the Turkey-Syria border 2/30 Kobani An explosion rocks the Syrian city of Kobani during a reported suicide car bomb attack by Isis Getty 3/30 Kobani An explosion in the Syrian city of Kobani set off as fighting continues Getty Images 4/30 Kobani Heavy smoke rises following an air strike by the US-led coalition aircraft in Kobani Getty Images 5/30 Kobani An unidentified armed man takes position near a building in the Syrian town of Kobani, as seen from near the Mursitpinar border crossing on the Turkish-Syrian border in the southeastern town of Suruc in Sanliurfa province 6/30 Kobani Kurdish fighters walk to their positions in Kobani 7/30 Kobani Residents of Kobani walk in the streets of the besieged town, as seen from near the Mursitpinar border crossing on the Turkish-Syrian border in the southeastern town of Suruc in Sanliurfa province 8/30 Kobani People's Protection Unit (YPG) fighters walk in the Syrian town of Kobani, as seen from near the Mursitpinar border crossing on the Turkish-Syrian border in the southeastern town of Suruc in Sanliurfa province 9/30 Kobani People watch the Syrian town of Kobani from near the Mursitpinar border crossing, on the Turkish-Syrian border in the southeastern town of Suruc in Sanliurfa province 10/30 Kobani A Turkish soldier stands on a top of a tank as he watches the Syrian town of Kobani from near the Mursitpinar border crossing, on the Turkish-Syrian border in the southeastern town of Suruc in Sanliurfa province 11/30 Kobani Smoke rises from the Syrian town of Kobani, seen from near the Mursitpinar border crossing on the Turkish-Syrian border in the southeastern town of Suruc. Kurdish forces defending Kobani urged a U.S.-led coalition to escalate air strikes on Isis fighters who tightened their grip on the Syrian town at the border with Turkey. A group that monitors the Syrian civil war said the Kurdish forces faced inevitable defeat in Kobani if Turkey did not open its border to let through arms, something Ankara has appeared reluctant to do 12/30 Kobani Newly arrived People's Protection Unit (YPG) fighters walk in a line in the Syrian town of Kobani, seen from near the Mursitpinar border crossing on the Turkish-Syrian border 13/30 Kobani Heavy smoke rises from the Syrian town of Kobani, seen from near the Mursitpinar border crossing on the Turkish-Syrian border in the southeastern town of Suruc in Sanliurfa province 14/30 Kobani Kurdish women mourn at the grave of a relative, who was a Kurdish fighter killed in fighting with the militants of the Islamic State group in Kobani, and was buried at a cemetery in Suruc 15/30 Kobani Turkish army tanks mechanized units take position on top of a hill near Mursitpinar border crossing in the southeastern Turkish town of Suruc in Sanliurfa province 16/30 Kobani Smoke rises after an US-led air strike in the Syrian town of Kobani. The air strikes pushed Isis fighters back to the edges of the Syrian Kurdish border town of Kobani, which they had appeared set to seize after a three-week assault, local officials said 17/30 Kobani A huge plume of smoke rises after an airstrike in eastern Kobani, Syria, behind a hilltop where militants with the Islamic State group had raised their flag on Monday AP 18/30 Kobani Turkish Kurds watch as airstrikes hit Kobani AP 19/30 Kobani Smoke rises from the Syrian town of Kobani as Turkish army tanks take position on the Turkish side of the border Reuters 20/30 Kobani Military aircraft flies over the Turkey-Syria border as it nears targets in Kobani 21/30 Kobani Smoke rises after a US-led air strike in the Syrian town of Kobani Reuters 22/30 Kobani Turkish Kurds, on the Turkey-Syria border, watch over the border at the intensified fighting between Isis and Kurdish forces AP 23/30 Kobani Smoke rises during airstrikes on the Syrian town of Ain al-Arab, known as Kobani by the Kurds Getty 24/30 Kobani A huge plume of smoke rises after an airstrike outside west Kobani, Syria AP 25/30 Kobani A militant with the Isis group walks in the town of Kobani 26/30 Kobani Militants with the Isis group, bottom, along with a machine gun-fitted pick up truck, partially seen bottom right, hold positions in Kobani, during intensified fighting with Syrian Kurds 27/30 Kobani People watch smoke rising from the Syrian town of Ain al-Arab, known as Kobani by the Kurds, after an air strike Getty 28/30 Kobani Smoke rises from a strike at an area of a mosque that destroyed its minaret, in Kobani during heavy fighting between militants with the Isis group and Syrian Kurds 29/30 Kobani Militants with Isis hold positions in Kobani, Syria, during intensified fighting with Syrian Kurds AP 30/30 Kobani A partial view of Kobani with a mosque's minaret 1/30 Kobani An explosion rocks Syrian city of Kobani during a reported suicide car bomb attack by the militants of Isis group on a People's Protection Unit (YPG) position in the city center of Kobani, as seen from the outskirts of Suruc, on the Turkey-Syria border 2/30 Kobani An explosion rocks the Syrian city of Kobani during a reported suicide car bomb attack by Isis Getty 3/30 Kobani An explosion in the Syrian city of Kobani set off as fighting continues Getty Images 4/30 Kobani Heavy smoke rises following an air strike by the US-led coalition aircraft in Kobani Getty Images 5/30 Kobani An unidentified armed man takes position near a building in the Syrian town of Kobani, as seen from near the Mursitpinar border crossing on the Turkish-Syrian border in the southeastern town of Suruc in Sanliurfa province 6/30 Kobani Kurdish fighters walk to their positions in Kobani 7/30 Kobani Residents of Kobani walk in the streets of the besieged town, as seen from near the Mursitpinar border crossing on the Turkish-Syrian border in the southeastern town of Suruc in Sanliurfa province 8/30 Kobani People's Protection Unit (YPG) fighters walk in the Syrian town of Kobani, as seen from near the Mursitpinar border crossing on the Turkish-Syrian border in the southeastern town of Suruc in Sanliurfa province 9/30 Kobani People watch the Syrian town of Kobani from near the Mursitpinar border crossing, on the Turkish-Syrian border in the southeastern town of Suruc in Sanliurfa province 10/30 Kobani A Turkish soldier stands on a top of a tank as he watches the Syrian town of Kobani from near the Mursitpinar border crossing, on the Turkish-Syrian border in the southeastern town of Suruc in Sanliurfa province 11/30 Kobani Smoke rises from the Syrian town of Kobani, seen from near the Mursitpinar border crossing on the Turkish-Syrian border in the southeastern town of Suruc. Kurdish forces defending Kobani urged a U.S.-led coalition to escalate air strikes on Isis fighters who tightened their grip on the Syrian town at the border with Turkey. A group that monitors the Syrian civil war said the Kurdish forces faced inevitable defeat in Kobani if Turkey did not open its border to let through arms, something Ankara has appeared reluctant to do 12/30 Kobani Newly arrived People's Protection Unit (YPG) fighters walk in a line in the Syrian town of Kobani, seen from near the Mursitpinar border crossing on the Turkish-Syrian border 13/30 Kobani Heavy smoke rises from the Syrian town of Kobani, seen from near the Mursitpinar border crossing on the Turkish-Syrian border in the southeastern town of Suruc in Sanliurfa province 14/30 Kobani Kurdish women mourn at the grave of a relative, who was a Kurdish fighter killed in fighting with the militants of the Islamic State group in Kobani, and was buried at a cemetery in Suruc 15/30 Kobani Turkish army tanks mechanized units take position on top of a hill near Mursitpinar border crossing in the southeastern Turkish town of Suruc in Sanliurfa province 16/30 Kobani Smoke rises after an US-led air strike in the Syrian town of Kobani. The air strikes pushed Isis fighters back to the edges of the Syrian Kurdish border town of Kobani, which they had appeared set to seize after a three-week assault, local officials said 17/30 Kobani A huge plume of smoke rises after an airstrike in eastern Kobani, Syria, behind a hilltop where militants with the Islamic State group had raised their flag on Monday AP 18/30 Kobani Turkish Kurds watch as airstrikes hit Kobani AP 19/30 Kobani Smoke rises from the Syrian town of Kobani as Turkish army tanks take position on the Turkish side of the border Reuters 20/30 Kobani Military aircraft flies over the Turkey-Syria border as it nears targets in Kobani 21/30 Kobani Smoke rises after a US-led air strike in the Syrian town of Kobani Reuters 22/30 Kobani Turkish Kurds, on the Turkey-Syria border, watch over the border at the intensified fighting between Isis and Kurdish forces AP 23/30 Kobani Smoke rises during airstrikes on the Syrian town of Ain al-Arab, known as Kobani by the Kurds Getty 24/30 Kobani A huge plume of smoke rises after an airstrike outside west Kobani, Syria AP 25/30 Kobani A militant with the Isis group walks in the town of Kobani 26/30 Kobani Militants with the Isis group, bottom, along with a machine gun-fitted pick up truck, partially seen bottom right, hold positions in Kobani, during intensified fighting with Syrian Kurds 27/30 Kobani People watch smoke rising from the Syrian town of Ain al-Arab, known as Kobani by the Kurds, after an air strike Getty 28/30 Kobani Smoke rises from a strike at an area of a mosque that destroyed its minaret, in Kobani during heavy fighting between militants with the Isis group and Syrian Kurds 29/30 Kobani Militants with Isis hold positions in Kobani, Syria, during intensified fighting with Syrian Kurds AP 30/30 Kobani A partial view of Kobani with a mosque's minaret\n\nDuring his remarks, Mr Trump welcomed the addition of further international involvement, saying that he is fine with Russia helping Syrian leader Bashar al Assad in fighting against Isis and other adversaries.\n\nMr Trump has been widely criticised for his decision remove US troops from northern Syria, which has led to a military assault on Kurdish forces who lost more than 10,000 soldiers fighting alongside the US against Isis.\n\n\"The Kurds are much safer right now, but the Kurds know how to fight,\" he said, suggesting that the Kurds were better at fighting when allied with the United States than when they were not. \"They fought with us. We paid a lot of money to fight with them but that's ok.\"\n\nThe backlash against Mr Trump over the issue has pushed him to impose fresh sanctions on Turkey, and to halt trade negotiations with the country.\n\nIn addition, Mr Trump has called on Turkey to impose a cease fire in the area, and is sending vice president Mike Pence to the region to help negotiate that measure on Wednesday. Turkey, however, has indicated that it does not want to impose a cease fire.\n\nJoining Mr Pence is secretary of State Mike Pompeo, who said during an interview with Fox News on Wednesday morning that Mr Trump wanted those two to begin negotiations to ensure the Turkish government understands the US is taking the issue seriously.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\n\"The president felt it was important that we do this at the most senior levels of the United States Government to speak to him face to face,\" Mr Pompeo said of the planned meeting with Turkish leader Recep Erdogan. \"He needs to stop – he needs to stop the incursion into Syria. This is a complicated matter with lots of states at play, lots of non-state actors as well.\"", "description": "Donald Trump has described Kurds as \"no angels\" as he attempted to defend his decision to allow Turkey's offensive in Syria. The comments from the president — who also said it was \"fine\" for Russia to assist Assad regime in the conflict — come despite Kurdish forces being longstanding allies of the US who played a key role in the defeat of Isis.", "authors": ["Clark Mindock"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/16/11/donald-trump-kurds.jpg", "published_at": "2019-10-16"}