{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/mystics-shoot-their-way-past-the-sun-in-game-1-of-the-wnba-finals/2019/09/29/e07afd82-e2d3-11e9-b403-f738899982d2_story.html", "downloaded_at": "2019-09-29 23:31:50.558649+00:00", "title": "Mystics shoot their way past the Sun in Game 1 of the WNBA Finals", "language": "en", "text": "The Washington Mystics’ opening statement in their second consecutive appearance in the WNBA Finals came from Ariel Atkins, the second-year pro out of Texas who nearly disappeared on offense during the Mystics’ semifinal series against the Las Vegas Aces.\n\nAtkins nailed a corner three-pointer for the first bucket of the Finals, just her third deep ball of the playoffs after averaging 15.2 points in nine postseason games last year as a rookie. Her shot, confident and true, was a sign of things to come Sunday afternoon at Entertainment and Sports Arena: The No. 1 seed Mystics were clearly comfortable on their home court, shot like a dream and made big plays when they counted in a 95-86 win over the No. 2 seed Connecticut Sun.\n\nWith Mayor Muriel E. Bowser looking on from a seat under the basket and Maryland Coach Brenda Frese watching several of her former players compete for both teams, Washington took a 1-0 series lead heading into Tuesday’s Game 2 in Washington.\n\n[The WNBA Finals pits Mystics vs. Sun and a bunch of Terps vs. each other]\n\nThe Mystics were in control all game thanks to a paramount first quarter, which they ended on a 12-0 run. Even when Connecticut shaved a 17-point Washington lead to four late in the fourth quarter, the Mystics didn’t flinch — both times, Elena Delle Donne got the ball and got around her defender to score and puncture the Sun’s momentum.\n\nWith Connecticut’s leading scorer, Jonquel Jones, underperforming and its starting point guard, Jasmine Thomas, off her game offensively, Washington edged just out of reach every time the Sun made a push.\n\n“Obviously, a go-to player down the stretch that they can play through and make some big plays,” Connecticut Coach-General Manager Curt Miller said of Delle Donne. “Alyssa Thomas is an elite defender, and when she bodies up on 99 percent of the people in the league and they’ve picked up their dribble, she usually gets that stop. We all know that EDD’s step through in that last movement to the basket where she leans in and create space and can get her shot off is — she’s the only person in the world that does that.”\n\n“I said it yesterday, they weren’t challenged in the Los Angeles series,” guard Natasha Cloud said, referring to Connecticut’s three-game sweep of the Sparks in the semifinals. “At all. We were challenged by Vegas. Vegas did us a great job by doing so, because we played close games down the stretch, so we’re prepared for this. Thank you, Vegas.”\n\n[Mystics execute Game 1 strategy: Make life harder on Jonquel Jones]\n\nDelle Donne led five Washington scorers in double figures with 22 points, 10 rebounds and five assists that matched a season high. The Mystics’ ball movement Sunday was just as they want it to be, and it led to 54 percent shooting from the field and 47.6 percent shooting from beyond the arc.\n\nAtkins added 21 points, including three three-pointers. Kristi Toliver, playing without the brace on her right knee that had been protecting a healing bone bruise and strained medial collateral ligament, had 18 points and five assists. Cloud had 13 points and seven assists. Emma Meesseman scored 11 off the bench.\n\nThe Mystics’ numbers paint a picture of an offensive slaughter, but in reality the Sun kept pace for much of the game. The only problem for Connecticut, playing in its first WNBA Finals since back-to-back appearances in 2004 and 2005 when the Mystics Coach-General Manager Mike Thibault was at the helm, was always chasing Washington after that lackluster first quarter.\n\n“That’s the experience we have,” Meesseman said. “Couple years back, that was a problem for us that we could not stay focused, or we would start panicking. That’s the experience we have now, that it’s not necessarily over if they come back. We can keep playing. We were still up, so it was up to us to start playing defense again, get stops. That’s our focus.”\n\nCourtney Williams led all scorers with 26 points for Connecticut, and Alyssa Thomas, playing with a torn labrum in each shoulder that will require offseason surgery, had 20 points and five steals.\n\nThe Mystics and Sun started at breakneck pace in a game that in all likelihood set the stage for an offensive shootout in this best-of-five series. Connecticut shot 48.5 percent from the field, not drastically far behind Washington, but the Mystics found a foothold first.\n\n“I suspect that both coaches will be meeting with their teams tomorrow and telling them a lot of the same things: You could have done this better, you could have done that better, take care of the ball, don’t turn it over,” Thibault said.\n\nSaid Miller: “What’s going through my head? That Mike and I are both pulling our hair out and the general TV audience is going, ‘This is damn good basketball.’ . . . This is why the two of us are here. We can make shots, we can make people — we can execute offensively, and that’s going to be the challenge for both of us, can we string consecutive stops together. Our transition is so important to us, and we’ve got to be able to get defensive stops and turn over.”", "description": "Washington makes 54 percent of its field goals and holds off Connecticut, 95-86, take an early series lead in its quest for its first championship.", "authors": ["Ava Wallace", "Reporter Covering Local Colleges", "September At Pm", "Ava Wallace Covers College Sports With A Focus On Georgetown", "Navy", "Maryland", "As Well As Tennis", "The Wnba For The Washington Post. Before Her Current Role", "She Covered Virginia", "Virginia Tech Athletics For The Post."], "top_image": "https://www.washingtonpost.com/resizer/JL8rglmhwN7nus8T4IZLIJeU54Q=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PMHMMKHC74I6TNAD644ITGMC2I.jpg", "published_at": "2019-09-29"}