{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/mitchell-robinson-hype-growing-2019-20-nba-season-2019-10", "downloaded_at": "2019-10-05 12:31:24.363560+00:00", "title": "The hype is growing around Mitchell Robinson, the Knicks' 21-year-old center who's drawing a rave reviews in training camp", "language": "en", "text": "Mitchell Robinson impressed in his rookie year with the New York Knicks, becoming a bright spot for the team with his shot-blocking prowess and above-the-rim play.\n\nHeading into his second year, Robinson is drawing attention, as teammates and observers alike rave about his raw talent and potential.\n\nRobinson said he has added the three-pointer to his game, but further development on the defensive end could make Robinson a star for the rebuilding Knicks.\n\nVisit Business Insider's homepage for more stories.\n\nRookie center Mitchell Robinson was one of the few bright spots for the New York Knicks last season.\n\nTaken in the second round with the 36th overall pick in the 2018 draft, Robinson emerged in the second half of the season as a rim-running, shot-blocking, athletic menace for the Knicks.\n\nAfter the All-Star break, the 7-foot-1 Robinson averaged 9 points on 69% shooting, 9 rebounds, and 3 blocks while playing 25 minutes per game. As the Knicks stumbled to a league-worst 17-65 record, Robinson emerged as one of the league's most exciting young players and a prospect bursting with potential.\n\nHeading into the 2019-20 season, the hype has only continued to grow around Robinson, 21, as teammates and observers alike have been impressed by his skills.\n\nESPN's Zach Lowe named Robinson of his six most intriguing players of the year. While Lowe highlighted the areas Robinson needs to improve — smarter defense, fewer fouls, a more diverse offensive repertoire — he also noted Robinson's unique defensive ability.\n\n\"Robinson burst onto the scene as the rare big man with the fast-twitch explosiveness to regularly reject jumpers ... He obliterated 22 3-pointers, five more than any other player, in just 1,360 minutes. There are maybe two living humans who can do some of the things Robinson does on defense.\"\n\nKnicks teammates have similarly discussed Robinson's defensive acumen and potential. Julius Randle, who signed a three-year, $62 million contract with the Knicks this offseason, said Robinson terrorized him last year, leading him to ask who this \"kid\" was.\n\n\"We had played at the Garden last season, and we had played Mitch,\" Randle told reporters from training camp (via SNY's Ian Begley). \"And he kept coming. Like I would get to the basket or I'd get past the first person and he kept coming out of nowhere. And I'm like, 'Man, who in the world is this kid?' ... He was just everywhere. I'm glad I got him on my team. I don't gotta deal with it now.\"\n\nRandle said Robinson has \"no clue how talented he is, how good he can be.\"\n\nVeteran big man Taj Gibson, who the Knicks also signed in free agency, echoed Randle.\n\n\"He's only scratched the surface,\" Gibson said (via Newsday's Steve Popper). \"Right now he's real talented and athletic but he shows a lot more in practice. He can shoot the ball. He's a great shot-blocker. He has so much to offer.\"\n\nRobinson's shooting has been a focal point of Knicks training camp. Last year, Robinson took just three shots beyond 10 feet, per NBA.com/Stats. Robinson spent the summer working on his three-pointer and apparently plans to use it.\n\n\"Why work on something you're not going to use? I'm looking forward to it,\" Robinson told reporters on Tuesday.\n\nRobinson doesn't look like Stephen Curry — yet — but his outside shot doesn't look bad either, particularly for someone who seemingly just added the skill in recent months.\n\nRobinson's production last season was promising because in many ways, he was still figuring out his way around a basketball court. Robinson skipped his freshman season of college and instead prepared for the NBA draft. He essentially went straight from high school to the pros, having not played competitive basketball for the 2017-18 season.\n\nMitchell Robinson. Michael Hickey/Getty Images Last year, Robinson averaged 5.7 fouls per 36 minutes, meaning he would likely foul out of most contests if he played starter's minutes. As Lowe highlighted, Robinson often chases blocks he has no chance of getting and gets sloppy with his defensive positioning.\n\nOutside of lobs and dunks and the attention he draws diving to the basket, Robinson didn't offer much on offense.\n\nYet Robinson's raw talent made the Knicks slightly better. The Knicks as a whole were outscored by 8.9 points per 100 possessions last season. With Robinson on the floor, the Knicks' net rating was -6.2, the highest of any Knicks player to play over 1,000 minutes last season. It's not a ringing endorsement, but again, the Knicks were the worst team in the league. Robinson made them marginally better as a 20-year-old.\n\nRobinson still has a way to go, and the 2019-20 season will still feature pains. But in what's yet another \"development\" season for the Knicks, they can only hope for more flashes like this from their potential young star:", "description": "Mitchell Robinson's raw talent and potential has teammates and the NBA world buzzing about what he can become.", "authors": ["Scott Davis"], "top_image": "https://image.businessinsider.com/5d97a2773e07741543267476?width=1200&format=jpeg", "published_at": "2019-10-04"}