{"pub": "breitbart", "url": "https://breitbart.com/news/czech-president-in-hospital-for-reconditioning", "downloaded_at": "2019-10-18 01:16:13.840117+00:00", "title": "Czech president in hospital for ‘reconditioning’", "language": "en", "text": "Prague (AFP) – Czech President Milos Zeman was admitted to a Prague hosptial on Thursday for what his spokesman called a four-day “reconditioning” stay, raising concerns about his allegedly solid health.\n\n“It’s a reconditioning stay starting on Thursday afternoon and lasting until Sunday,” Zeman’s spokesman Jiri Ovcacek told the Blesk tabloid.\n\n“In no case is this a serious matter, there’s no serious health problem requiring a medical intervention,” he insisted, adding Zeman wanted to be fit for the state awards ceremony on October 28, a public holiday.\n\nBut Zeman’s public appearances have led observers to question the health of the 75-year-old leader who has admitted to being hard of hearing and suffering from diabetic neuropathy in his legs.\n\nA veteran pro-Russian, pro-Chinese, anti-Muslim leftwinger, Zeman needs the help of his bodyguards to stand up and often appears to be very tired.\n\nA chain smoker and a regular drinker, Zeman recently boasted having “cut down on cigarettes from 60 to 40 a day”.\n\nHis apparent frailty has led to speculation in Prague that he may quit politics before his second consecutive term in office ends in 2023.\n\nZeman recently stoked speculation by naming three potential successors including billionaire populist Prime Minister Andrej Babis.\n\nPhysicians gave Zeman a clean bill of health following scans last month.\n\n“We found no disease, the scan was very thorough and we didn’t detect a health problem except for moderate dehydratation and weariness,” said Miroslav Zavoral, director of Prague’s Military University Hospital.", "description": "Prague (AFP) – Czech President Milos Zeman was admitted to a Prague hosptial on Thursday for what his spokesman called a four-day", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/17/e7b627_czech-president-milos-zeman-public-appearances-led-observers-question-640x335.jpg", "published_at": "2019-10-17"}