{"pub": "marketwatch", "url": "https://marketwatch.com/story/amazon-earnings-miss-is-the-price-of-growth-analysts-say-2019-10-25", "downloaded_at": "2019-10-25 16:27:04.474200+00:00", "title": "Amazon earnings miss is the price of growth, analysts say", "language": "en", "text": "Getty Images Amazon says customers have responded positively to the new one-day shipping offer\n\nAmazon.com Inc. reported an earnings miss in the third quarter, but analysts remain upbeat, chalking up the shortfall to the price of growth.\n\nAmazon AMZN, -1.33% shares fell 2.1% in Friday trading after the results were announced. According to Brian Olsavsky, the company’s chief financial officer, Amazon exceeded the $800 million the company said it would spend in the second quarter to put one-day shipping in place, made an additional large investment in the third quarter, and there are more costs to come.\n\n“So, as we head into Q4 we’ve added what’s just nearly a $1.5 billion penalty in Q4 year-over-year for the cost of shipping, which essentially is transportation costs, the cost of expanding our transportation capacity, things like adding additional roles and shifts in our warehouses,” he said, according to a FactSet transcript.\n\nSee: Amazon earnings fall for first time in more than two years, stock drops in late trading\n\nIt’s been worth every penny, according to Olsavsky.\n\n“But we’re very pleased with the customer response to one-day,” he said. “You can see it in our revenue acceleration and also in our unit growth acceleration.”\n\nIt’s also become a valuable perk for Prime members.\n\n“We have seen Prime members increase their orders, spend more,” Olsavsky said. “So they must also see it as a real help to them in their daily lives.”\n\nOlsavsky said the company also continues to invest in AWS.\n\nEven if the numbers are eye-popping, analysts are upbeat about the investments. Charlie O’Shea, Moody’s Amazon analyst, called the spend “strategically-necessary.” And besides that, the company has the money.\n\n“We continue with our view that Amazon’s robust liquidity, with over $42 billion in cash and short-term investments, as well as AWS’ steady $2.3-plus billion in operating income per quarter, provides the company with significant runway to continue with its myriad, necessary investments,” he said.\n\nKeyBanc Capital Markets highlights how much Amazon stands to gain from the one-day shipping build-out.\n\nAnd: Walmart isn’t waiting for Halloween, will launch holiday deals on Friday\n\n“With a significant amount of retail share up for grabs given ongoing traditional retail bankruptcies, Amazon is clearly taking outsized share,” analysts led by Edward Yruma wrote. “Investment to support one-day and AWS will help drive sustained long-term growth and we expect leverage over the medium term.”\n\nThe one-day offering is also another differentiator between Amazon and its chief rival, Walmart Inc. WMT, +0.15%\n\n“The ability to effectively offer the entire Prime assortment on one-day differs from Walmart.com’s more focused selection,” KeyBanc said.\n\nKeyBanc rates Amazon stock overweight with a $2,200 price target.\n\nJack O’Leary, senior analyst at Edge by Ascential, also notes the way in which Amazon is transforming retail.\n\n“Amazon’s investments in providing a superior shopping experience through delivery speed today are driving the retail business to grow massively (faster than any quarter in the past two years),” O’Leary said. “It appears that in typical Amazon fashion the company is positioning itself at the head of the pack competitively by sacrificing some declines in its stock price today.”\n\nBut Amazon isn’t just positioning itself as a retail leader, according to Susquehanna Financial Group.\n\n“We’re buyers on the dip, as we remain positive on Amazon,” analysts led by Shyam Patil wrote. “[W]e see the company as a long-term secular grower with leadership positions in three large-growth markets – e-commerce, cloud and advertising.”\n\nWatch: Here are 3 tips for picking retail stocks\n\nEven the stalled Amazon Web Services, or cloud business, isn’t a large concern because “it’s still early days and we expect AWS growth and margins to remain sold in the near and long term.”\n\nSusquehanna rates Amazon stock positive and shaved its price target to $2,200 from $2,250.\n\nBenchmark analysts aren’t deterred by the stock reaction either.\n\n“We still believe that our thesis of more aggressive upfront investment over a shorter time horizon remains on track, although, as is often the case with Amazon, we significantly underestimated the level of that upfront spend,” Daniel Kournos, a Benchmark analyst, wrote.\n\nDon’t miss: Hasbro says tariffs are to blame for earnings miss\n\n“Once the bulk of the one-day push is completed, however, we see Amazon re-establishing a deeper competitive moat that should yield in several additional years of market share gains. We’d be buyers on weakness.”\n\nBenchmark rates Amazon stock buy with a $2,100 price target.\n\nAmazon stock has rallied 16% for the year to date, the Amplify Online Retail ETF IBUY, +1.54% has gained 25.7%, and the S&P 500 index SPX, +0.47% is up 20.5% for the period.", "description": "Amazon earnings fell short of expectations but analysts think the heavy investments in one-day shipping and AWS are a positive.", "authors": ["Tonya Garcia"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT700_amazon_ZG_20191021105542.jpg", "published_at": "2019-10-25"}