{"pub": "independent", "url": "https://independent.co.uk/life-style/fashion/kimhekim-iv-drip-model-sick-paris-fashion-week-runway-instagram-a9122051.html", "downloaded_at": "2019-09-26 20:50:19.414335+00:00", "title": "Kimhēkim: Fashion brand criticised for using IV drips in runway show", "language": "en", "text": "Fashion brand Kimhēkim is facing backlash after using intravenous (IV) drip bags as accessories for its recent runway show during Paris Fashion Week.\n\nFor the spring/summer 2020 show, the Paris-based brand featured models walking the runway holding IV bags similar to those found in hospitals and wearing bandages on their arms.\n\nIn photos from the show, one model can be seen wearing a shirt that read “Sick” as she walked the runway holding the IV.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nOn Instagram, where the designer shared videos from the show, as well as an up-close picture of the Kimhēkim-branded IV bags, people have criticised the “tasteless” decision to use medical accessories and illness as a fashion statement.\n\nIn addition to accusations of ableism, some said that brand was acting insensitively towards people who suffer from illnesses or disabilities.\n\n“What is this?? Being sick isn’t a fashion accessory,” one person commented.\n\nAnother said: “This is NOT fashion. Being sick isn’t ‘trendy’ or ‘cool’”.\n\n“This is a reprehensible concept and deeply insensitive to all those who struggle with illness,” someone else commented.\n\nOthers shared their own medical experiences in an effort to convey the issue with the brand glamorising illness.\n\n“As a person with multiple chronic illnesses, I am absolutely appalled that you would do this,” one person wrote. “You’re absolutely missing the mark. I hope no one supports this behaviour.”\n\nShape Created with Sketch. Best-dressed celebrities at Milan Fashion Week SS20 Show all 28 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Best-dressed celebrities at Milan Fashion Week SS20 1/28 Iggy Pop The punk musician wore a studded leather jacket paired with a graphic T-shirt and black skinny jeans for the Gucci show. Getty Images for Gucci 2/28 Hari Nef The actor wore a blush pink short-sleeved top with a top handle Gucci handbag for the Italian label's show. Getty Images for Gucci 3/28 A$AP Rocky The musician wore a checked blazer with boxy shades and a Gucci satchel for the brand's show on Sunday. Getty Images for Gucci 4/28 Sienna Miller Miller was pictured on Gucci's front row wearing sheer tights from the brand and an ivory silk shirt underneath a black dress complete with a peacock design on the neck. Getty Images for Gucci 5/28 Barbara Palvin and Dylan Sprouse The model and actor duo both opted for classic tailoring for the Boss show on Sunday. Palvin chose all-white while Sprouse wore an electric blue suit. Getty Images 6/28 Olivia Palermo The fashion influencer was spotted at the Boss show on Sunday wearing a long brown leather skirt, white shirt and mustard yellow jacket. Getty Images 7/28 Alexa Chung The fashion designer and author sat on the front row at the Prada show on Wednesday wearing a pale blue smock shirt with floral embroidery. Getty Images for Prada 8/28 A$AP Rocky The musician was spotted at Prada wearing a navy blue suit consisting of shorts and a blazer. Getty Images for Prada 9/28 Olivia Palermo Palermo attended the Max Mara Show on Thursday wearing a brown and blue ensemble by the Italian fashion designer, featuring a satin skirt and dark pink, open-toe heels. Getty Images for Max Mara 10/28 Halima Aden The fashion model was pictured at the Max Mara show dressed in black, patterned, floor-length garment, accessorising with an over-sized, black jacket. Getty Images for Max Mara 11/28 Hikari Mori The model and granddaughter of Japanese designer Hanae Mori displayed her wild side at the Max Mara show, wearing a tiger-print, thigh-length jumper by the fashion designer. Getty Images for Max Mara 12/28 Levante The Italian singer was photographed prior to the Emporio Armani show on Thursday wearing a pair of sheer, tartan trousers, a denim, sleeveless top and a matching jacket. She accessorised with a pair of retro, red shades. EPA 13/28 Celina Locks The model opted for a suave look at the Emporio Armani show, wearing a light grey power suit and carrying a purse by the Italian luxury fashion label. Getty Images 14/28 Valentina Bella The Italian actor selected bold accessories to go with her checkered power suit, wearing a pair of red shades, carrying a red clutch bag and wearing a pair of black pumps. Getty Images 15/28 Princess Mafalda Cecilia of Bulgaria The member of royalty went for a Parisian look for the Emporio Armani fashion show on Thursday, wearing an oversized, white power suit and a black beret embossed with the fashion label's name. Getty Images 16/28 Alice Pagani The actor was spotted on the front row of the Emporio Armani show wearing a black, belted jacket, mini shorts and a pair of matching strappy heels. Getty Images 17/28 Tina Leung Fashion industry insider Leung attended the Max Mara show wearing a patterned co-ord by the fashion designer. Getty Images for Max Mara 18/28 Gala Gonzalez The Spanish model and fashion designer was all smiles at the Max Mara show, wearing an oversized black jacket with tiger-print sleeves, black boots and adding a pop of colour with a mini orange handbag. Getty Images for Max Mara 19/28 Caroline Daur The entrepreneur showcased winter chic at the Max Mara show, wearing a a pair of white high-waisted trousers, a white, long-sleeved top, black boots and a black headscarf. Getty Images for Max Mara 20/28 Nicole Kidman The Big Little Lies actor wore a colourful long-sleeved dress to the Prada show. The gown itself featured intricate patterns in black, green and red and Kidman topped the look off with fuchsia lipstick. REUTERS 21/28 Winnie Harlow The model wore a utilitarian khaki green two-piece to the Prada show. Harlow accessorised the look with high-heeled black biker boots. Getty Images for Prada 22/28 Jeanne Damas The Rouje founder wire a checked shirt dress to the Prada show. Getty Images for Prada 23/28 Susie Lau The fashion writer wore a mint green midi skirt complete with a red tulip design and a black lace cape. Lau added some eccentricity to her look by wearing grey socks underneath her emerald green peep-toe heels. Getty Images for Prada 24/28 Anna Dello Russo The Italian fashion titan wore a strapless blue floral dress for the Prada show. Getty Images for Prada 25/28 Chiara Ferragni Ferragni is a regular on the Frow at Milan Fashion Week. For the Prada show, she chose to wear a rose-covered shirt and a black midi skirt. Getty Images for Prada 26/28 Anna Wintour The American Vogue editor wore a deep crimson long-sleeves dress for the Prada show. Getty Images for Prada 27/28 Wes Andreson and Juman Malouf The revered filmmaker was pictured on the front row at the Prada show alongside his wife, author and illustrator Juman Malouf. Getty Images for Prada 28/28 Regina King The actor wore a fun pair of feathered black jeans to the Prada show, adding a simple white shirt on top. Getty Images for Prada 1/28 Iggy Pop The punk musician wore a studded leather jacket paired with a graphic T-shirt and black skinny jeans for the Gucci show. Getty Images for Gucci 2/28 Hari Nef The actor wore a blush pink short-sleeved top with a top handle Gucci handbag for the Italian label's show. Getty Images for Gucci 3/28 A$AP Rocky The musician wore a checked blazer with boxy shades and a Gucci satchel for the brand's show on Sunday. Getty Images for Gucci 4/28 Sienna Miller Miller was pictured on Gucci's front row wearing sheer tights from the brand and an ivory silk shirt underneath a black dress complete with a peacock design on the neck. Getty Images for Gucci 5/28 Barbara Palvin and Dylan Sprouse The model and actor duo both opted for classic tailoring for the Boss show on Sunday. Palvin chose all-white while Sprouse wore an electric blue suit. Getty Images 6/28 Olivia Palermo The fashion influencer was spotted at the Boss show on Sunday wearing a long brown leather skirt, white shirt and mustard yellow jacket. Getty Images 7/28 Alexa Chung The fashion designer and author sat on the front row at the Prada show on Wednesday wearing a pale blue smock shirt with floral embroidery. Getty Images for Prada 8/28 A$AP Rocky The musician was spotted at Prada wearing a navy blue suit consisting of shorts and a blazer. Getty Images for Prada 9/28 Olivia Palermo Palermo attended the Max Mara Show on Thursday wearing a brown and blue ensemble by the Italian fashion designer, featuring a satin skirt and dark pink, open-toe heels. Getty Images for Max Mara 10/28 Halima Aden The fashion model was pictured at the Max Mara show dressed in black, patterned, floor-length garment, accessorising with an over-sized, black jacket. Getty Images for Max Mara 11/28 Hikari Mori The model and granddaughter of Japanese designer Hanae Mori displayed her wild side at the Max Mara show, wearing a tiger-print, thigh-length jumper by the fashion designer. Getty Images for Max Mara 12/28 Levante The Italian singer was photographed prior to the Emporio Armani show on Thursday wearing a pair of sheer, tartan trousers, a denim, sleeveless top and a matching jacket. She accessorised with a pair of retro, red shades. EPA 13/28 Celina Locks The model opted for a suave look at the Emporio Armani show, wearing a light grey power suit and carrying a purse by the Italian luxury fashion label. Getty Images 14/28 Valentina Bella The Italian actor selected bold accessories to go with her checkered power suit, wearing a pair of red shades, carrying a red clutch bag and wearing a pair of black pumps. Getty Images 15/28 Princess Mafalda Cecilia of Bulgaria The member of royalty went for a Parisian look for the Emporio Armani fashion show on Thursday, wearing an oversized, white power suit and a black beret embossed with the fashion label's name. Getty Images 16/28 Alice Pagani The actor was spotted on the front row of the Emporio Armani show wearing a black, belted jacket, mini shorts and a pair of matching strappy heels. Getty Images 17/28 Tina Leung Fashion industry insider Leung attended the Max Mara show wearing a patterned co-ord by the fashion designer. Getty Images for Max Mara 18/28 Gala Gonzalez The Spanish model and fashion designer was all smiles at the Max Mara show, wearing an oversized black jacket with tiger-print sleeves, black boots and adding a pop of colour with a mini orange handbag. Getty Images for Max Mara 19/28 Caroline Daur The entrepreneur showcased winter chic at the Max Mara show, wearing a a pair of white high-waisted trousers, a white, long-sleeved top, black boots and a black headscarf. Getty Images for Max Mara 20/28 Nicole Kidman The Big Little Lies actor wore a colourful long-sleeved dress to the Prada show. The gown itself featured intricate patterns in black, green and red and Kidman topped the look off with fuchsia lipstick. REUTERS 21/28 Winnie Harlow The model wore a utilitarian khaki green two-piece to the Prada show. Harlow accessorised the look with high-heeled black biker boots. Getty Images for Prada 22/28 Jeanne Damas The Rouje founder wire a checked shirt dress to the Prada show. Getty Images for Prada 23/28 Susie Lau The fashion writer wore a mint green midi skirt complete with a red tulip design and a black lace cape. Lau added some eccentricity to her look by wearing grey socks underneath her emerald green peep-toe heels. Getty Images for Prada 24/28 Anna Dello Russo The Italian fashion titan wore a strapless blue floral dress for the Prada show. Getty Images for Prada 25/28 Chiara Ferragni Ferragni is a regular on the Frow at Milan Fashion Week. For the Prada show, she chose to wear a rose-covered shirt and a black midi skirt. Getty Images for Prada 26/28 Anna Wintour The American Vogue editor wore a deep crimson long-sleeves dress for the Prada show. Getty Images for Prada 27/28 Wes Andreson and Juman Malouf The revered filmmaker was pictured on the front row at the Prada show alongside his wife, author and illustrator Juman Malouf. Getty Images for Prada 28/28 Regina King The actor wore a fun pair of feathered black jeans to the Prada show, adding a simple white shirt on top. Getty Images for Prada\n\nAlthough the brand has not commented publicly in response to the backlash, it has responded to individual Instagram comments with black hearts.\n\nThe criticism comes after Gucci found itself involved in a similar controversy during its runway show at Milan Fashion Week for featuring a collection of straitjackets.\n\nWhile debuting its spring/summer 2020 collection, which featured models wearing the garments formerly used in psychiatric hospitals, non-binary model Ayesha Tan Jones staged a protest by holding up their hands, where they’d written the words: “mental health is not fashion”.\n\nIn an Instagram post uploaded after the show, Jones explained they found Gucci’s design “hurtful and insensitive” as someone who had previously suffered with mental health.\n\nThe model also accused the luxury brand of using mental health issues as “props for selling clothes in today’s capitalist climate” before describing the clothes as “vulgar, unimaginative and offensive”.\n\nThe Independent has contacted Kimhēkim for comment.", "description": "Fashion brand Kimhēkim is facing backlash after using intravenous (IV) drip bags as accessories for its recent runway show during Paris Fashion Week.  For the spring/summer 2020 show, the Paris-based brand featured models walking the runway holding IV bags similar to those found in hospitals and wearing bandages on their arms.  In photos from the show, one model can be seen", "authors": ["Chelsea Ritschel"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/26/18/gettyimages-1170531302.jpg", "published_at": "2019-09-26"}