{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/strictlys-dianne-buswell-updates-fans-20468771", "downloaded_at": "2019-10-05 22:59:39.502263+00:00", "title": "Strictly's Dianne Buswell confirms she will perform on live show after hospital dash", "language": "en", "text": "Get the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nStrictly's Dianne Buswell has updated fans following her hospital dash after being dropped on her head by her celebrity partner Dev Griffin.\n\nThe dancing pro, 30, was taken to A&E for fears she had concussion when she fell onto her head during rehearsals on Friday and later was discharged after being diagnosed with whiplash.\n\nTelling her fans that she was well and ready to rock the dance floor, on tonight's installment of Strictly Come Dancing , the red-haired beauty uploaded a snap of herself and Dev, 34, dressed in costume ahead of their Aladdin themed dance that will be performed live.\n\n(Image: Instagram)\n\nAllowing her fans to breathe a sigh of relief, she told them in the caption: \"We wanted to say thank you for all the well wishes and lovely msgs today . I am fine and we have just done the dress run!!\n\n\"We both had the best time doing it and can’t wait for the show tonight ! I must say this is prob the best movie week I have seen every body is AMAZING! !!!!!!!\n\n\"Enjoy the show tonight guys you don’t wanna miss it ! You won’t want to even blink trust me ️ @dev @bbcstrictly also the costume and makeup department have exceeded expectations thanks team I’m a monkey.\"\n\n(Image: Jeff Spicer/Getty Images)\n\nThe dancer appeared in high spirits in the snap as she donned a pair of monkey ears and stage make-up alongside Dev who was painted blue to mimic the famous genie character from the hit Disney film.\n\nDianne's message comes after The Sun reported Dianne was rushed to hospital after being dropped on her head by her partner.\n\nThe Radio 1 DJ is said to have lost his grip on the dancer during a lift in rehearsals and she went crashing to the floor.\n\n(Image: BBC/Kieron McCarron)\n\n(Image: BBC/Ray Burmiston)\n\nThe publication claimed that Dev \"doubled over in panic\" as medical staff rushed to her aid.\n\nDianne was believed to have been admitted to A&E amid fears she'd suffered a concussion.\n\nA source said: \"Dev let her slip from his grasp and Dianne fell and landed on her head. It couldn’t have been worse.\n\n\"It was horrible to watch Dianne lying prostrate on the floor...\n\n\"Dev... was praying that there was no serious damage — the worst case scenario was that she had some internal head injuries.\n\n“She plunged a long way and he couldn’t help but panic about what he’d done. Dev insisted on going to hospital and looked in total shock.\"\n\nHowever, there was no serious damage and doctors at North London’s Barnet Hospital hospital are said to have discharged her after diagnosing her with whiplash.\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033", "description": "The professional dancer has shared that she will be taking to the dance floor with Dev Griffin tonight", "authors": ["Sara-Aisha Kent", "Image", "Instagram", "Jeff Spicer Getty Images", "Bbc Kieron Mccarron", "Bbc Ray Burmiston"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20082103.ece/ALTERNATES/s1200/3_RHS-Chelsea-Flower-Show-2019-Press-Day.jpg", "published_at": "2019-10-05"}