{"pub": "news24", "url": "https://news24.com/Books/extract-siya-kolisi-against-all-odds-rugby-saved-his-life-20190921", "downloaded_at": "2019-10-05 11:44:52.570555+00:00", "title": "EXTRACT | Siya Kolisi: Against all odds – 'Rugby saved his life'", "language": "en", "text": "Siya tied the thick white rope around his waist and kicked the tyre downfield until the rope was taut behind him. Then he took a deep breath, waited for the whistle, and exploded into action, sprinting across the field with the heavy black tyre dragging behind him. He pulled up after 70 metres, gasping for breath. Then, as he began to recover, he heard the whistle again, so he turned and raced back.\n\nSince he began playing competitively, Siya had been selected at eighth man, combining his strength and speed with his ball-handling skills. But he was still smaller than most of the opposition he played against and he needed to get stronger fast.\n\nThe tyres were part of rugby life at Grey High School. They even had individual nicknames, and Siya was pretty certain that he was dragging 'Suzie' around that day. She was the heaviest of them all.\n\nSiya had done well enough at Grey Junior to move into the high school and keep his full scholarship. His easy-going nature and infectious laugh made him popular with his peers and teachers, and his commitment to the school was absolute. But high-school sports were a significant step up in skill and commitment. Training was at a level that none of the previous stars of the Under-13 'A' had experienced before.\n\nThere was a big jump in the standard between primary- and high-school rugby: there was more on-field contact, and everyone was dealing with the onset of puberty at different times. Small boys suddenly turned into giants, while some of the big ones barely changed at all. Siya was still small, but he took whatever happened in his stride and kept coming back for more. His dedication to the game was total.\n\nFollowing the death of his grandmother, the thought must have crystallised in his mind until it felt like a mantra: rugby had saved his life. If he had still been at Emsengeni Primary when his gran died and his world fell apart, then who knows what would have happened to him? Without the game, he would be on a road to nowhere, and he planned to honour the chance he had been given.\n\nComing into Grade 8 with a full scholarship, Siya threw himself into training with a ferocity and a commitment that were unusual in Under-14 rugby. His new coach was Dean Carelse,\n\na young and passionate teacher who was also eager to make his mark in the world of coaching. Dean dreamed of shaping a team that would go down in Grey history as one of the best the school had produced. He believed that if he got the team right at Under-14 level, then they would be able to stick together until they were 17- and 18-year-olds playing for the Grey High First XV, by which time they would be a formidable unit.\n\nDean was also Siya's housemaster at Merriway House, where Siya boarded, so their goals were aligned perfectly, and the pair quickly got down to work with a weekly plan that they stuck to religiously.\n\n'Mondays were light sessions,' Dean explains, 'designed to run out the stiffness and the aches and pains from the weekend games. A little touch rugby, or a quick gym session, maybe some sprints.'\n\nThe hard work happened on Tuesdays. Those were the very physical training days, with defensive drills and continuity drills with bags for at least an hour, followed by full-contact games, either against another team or with a split between the forwards and the backs.\n\nWednesdays were video sessions during which the team watched footage of their previous game, thanks to the efforts of the school audiovisual club, followed by a short 45-minute gym session.\n\nThursdays were about polishing up the team for the weekend. 'I would have seen the video of the opposition during the week, so I put this into practice,' says Carelse. The team worked on strategy as a group, and then the backs and forwards split up again to work on their specific areas of the game.\n\nFriday's schedule was more flexible, depending on the circumstances of the next game. If it was an away game, then the team would often travel together on a Friday evening; if the game was at home, then they would watch video of the opposition before attending the school hockey matches. Training was light on a Friday, and the focus stayed on the upcoming contest.\n\nIt may only have been schoolboy rugby but the preparations on game day felt very similar to what they would be for any professional team.\n\nThat's how the Grey coaching staff approached the game, and how they wanted the boys to start thinking.\n\n*This extract was taken from Siya Kolisi: Against All Odds by Jeremy Daniel, published by Jonathan Ball Publishers.", "description": "Following the death of his grandmother, the thought must have crystallised in his mind until it felt like a mantra: rugby had saved his life.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9386/7d5e51d605094c4bb275cc50c605f6bb.jpg", "published_at": "2019-09-21"}