{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/china-seen-heading-for-sub-6-per-cent-economic-growth-as-tariffs-soar ", "downloaded_at": "2019-09-04 03:48:13.775267+00:00", "title": "China seen heading for sub-6 per cent economic growth as tariffs soar", "language": "en", "published_at": "2019-09-04", "text": "[BEIJING] Economists are downgrading their forecasts for economic growth in China again, to below a level seen as necessary for the Communist Party to meet its own goals in time for its centenary in 2021.\n\nOxford Economics, Bank of America Merrill Lynch, and Bloomberg Economics on Tuesday all cut their forecasts for gross domestic product growth in 2020 to below 6 per cent as a result of increasing risks from the tariff war with the US. UBS Group AG also cut their estimate on Tuesday, although they've been estimating sub-6 per cent expansion since mid-August. In addition, Bank of America's Helen Qiao and others are warning that the government's current approach to stimulus is proving insufficient.\n\nChina is refraining from cutting benchmark policy rates or pumping large volumes of cash into the economy even as growth slows to the weakest in almost three decades and the tariff escalation in August adds further headwinds. That's endangering President Xi Jinping's ability to claim China has reached a \"moderately prosperous society\" that has doubled 2010 GDP (gross domestic product) by next year, as a rate above 6 per cent in 2019 and 2020 would be needed.\n\nThe downbeat sentiments in China adds to concern over a wider global slowdown, as a key US factory gauge released on Tuesday contracted for the first time since 2016. Meanwhile, the world's largest two economies have showed no signs of softening their stance on the protracted trade war.\n\nsentifi.com Market voices on:\n\nDemand for credit has been weak, and while targeted policy easing since late last year has helped moderate the slowdown, the impact has been small, according to a report by Louis Kuijs, chief Asia economist at Oxford Economics in Hong Kong. With all the issues facing China, \"more policy easing is needed to convincingly stabilise economic growth,\" Mr Kuijs said.\n\nChina's economic growth will likely slow to 5.7 per cent in the last quarter of 2019 and remain broadly at that pace in 2020, Mr Kuijs said. Output growth softened to 6.2 per cent in the second quarter from a year earlier, close to the lower bound of the government's full-year target of between 6 per cent and 6.5 per cent. Earliest indicators compiled by Bloomberg showed the economy slowed further in August.\n\n\"We now expect China's growth to slow to 6 per cent this year and 5.6 per cent next year. Our lower forecasts are subject to downside risks, given further threatened tariffs, and uncertainty over how the blow to business confidence from the trade war will play out,\" said Chang Shu, chief Asia economist, Bloomberg Economists.\n\nBank of America's chief Greater China economist Helen Qiao said their 2020 forecast has been cut to 5.7 per cent from 6.0 per cent, and warned of the risk that policymakers are falling behind the curve on support to the economy.\n\n\"The key reason for delayed policy response is policy agencies are waiting for the instruction from top decision makers to shift policy stance towards easing,\" Ms Qiao wrote in a note.\n\nUBS Group sees stimulus coming in the form of more monetary easing, but expects policymakers to refrain from boosting the property market unless there's a significant downturn. Wang Tao, chief China economist, now sees growth of 5.5 per cent in 2020, after cutting the growth forecast on Tuesday from 5.8 per cent. That's the second time they've lowered in less than a month, down from 6.1 per cent in early August.\n\nHow much leeway the central bank has in terms of policy easing is questionable, however, as additional tariffs on import products and domestic supply shocks will fuel inflation pressure with the yuan weakening 3.9 per cent since August.\n\nAnalysts including Citic Securities Co's Ming Ming said consumer price growth could breach the government target of 3 per cent in the coming months.\n\n\"The risk of further escalation remains significant, which would put additional downward pressure on China's growth,\" UBS's Mr Wang said, adding that she expects the People's Bank of China to further reduce reserve-ratios this year but hold off from adjusting the broader benchmark rate.\n\nBLOOMBERG", "description": ": THE BUSINESS TIMES Government & Economy - [BEIJING] Economists are downgrading their forecasts for economic growth in China again, to below a level seen as necessary for the Communist Party to meet its own goals in time for its centenary in 2021. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png"}