{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7602217/Lawmakers-urge-Apple-restore-HKMap-app-helped-Hong-Kong-protesters-track-cops.html", "downloaded_at": "2019-10-23 11:07:56.201622+00:00", "title": "Lawmakers urge Apple to restore HKMap app that helped Hong Kong protesters track cops", "language": "en", "text": "A bipartisan group of seven U.S. lawmakers including Senators Ted Cruz, Ron Wyden and Marco Rubio and Representative Alexandria Ocasio-Cortez on Friday urged Apple Inc Chief Executive Tim Cook to restore the HKMap app used in Hong Kong.\n\nEarlier this month, Apple removed the app that helped Hong Kong protesters track police movements, saying it was used to target officers.\n\nApple declined to comment.\n\nThe group separately wrote Activision Blizzard Inc's chief executive Robert Kotick, calling on him to reverse the company's decision to ban a player who voiced support for pro-democracy protests in Hong Kong. Activision Blizzard did not immediately comment on Friday.\n\nRepresentative Alexandria Ocasio-Cortez (left) and Senator Ted Cruz (right) were some authors of the letters asking for the app ban to end\n\nRon Wyden (left) and Marco Rubio (right) were among the lawmakers who said to Cook: 'When a repressive government refuses to evolve or, indeed, when it doubles down, cooperation can become complicity'\n\nHKmap Live, an app that allowed Hong Kong protesters to track police, have been removed by Apple, its developers said. The programme's web-based version (above) is still working\n\n'You have said publicly that you want to work with China's leaders to effect change rather than sit on the sidelines and yell at them. We, too, believe that diplomacy and trade can be democratizing forces. But when a repressive government refuses to evolve or, indeed, when it doubles down, cooperation can become complicity,' the members wrote to Cook.\n\nChinese Communist Party's official newspaper on Tuesday called the tracking app 'poisonous' and decried what it said was Apple's complicity in helping the Hong Kong protesters.\n\nApple said on October 9 that it had begun an immediate investigation after 'many concerned customers in Hong Kong' contacted it about the app and the company found it had endangered law enforcement and residents.\n\nIt said the HKMap app 'has been used to target and ambush police, threaten public safety, and criminals have used it to victimize residents in areas where they know there is no law enforcement.'\n\nApple said on October 9 that it had begun an immediate investigation following complaints and claimed it was being used to target officers in Hong Kong\n\nProtesters throw petrol bombs outside the police station of Tsuen Wan where the student was shot during a rally on October 2. Clashes and rampages broke out across the city last night\n\nCritics said Apple acted after pressure from Beijing in a commentary in the Chinese Communist Party's official newspaper.\n\nThe app, which crowdsources the locations of both police and protesters, from its app store plunges Apple into the increasingly fraught political tension between China and the protesters that has also ensnared other U.S. and Hong Kong businesses.\n\nThe company only just had approved the app after rejecting it earlier this month.\n\nAlphabet Inc's Google on Thursday said it had dropped a game from its app store that allowed players to pretend they were Hong Kong protesters, saying its policies forbid capitalizing on ongoing sensitive events.\n\nHowever, Google said it had found no policy violation by HKmap.live, and confirmed that the tracking app was available on its app store.\n\nThe lawmakers said Apple has censored at least 2,200 apps in China, citing the nonprofit group GreatFire.\n\nApple's action came amid a furor surrounding the U.S. National Basketball Association after a team official tweeted in support of the Hong Kong protests, which led Chinese sponsors and partners to cut ties with the NBA.\n\nLast week, Blizzard reduced the punishment dealt out to Chung Ng Wai, a Hong Kong-based Hearthstone esports gamer, for his public support of pro-democracy protests after its decision sparked controversy among players and the public.\n\nBlizzard Entertainment, a subsidiary of Activision Blizzard, said initially that it would suspend the player from competition for a year and strip him of prize money.", "description": "Senators Ted Cruz, Ron Wyden and Marco Rubio and Representative Alexandria Ocasio-Cortez wrote letters on Friday to Apple CEO Tim Cook saying 'cooperation can become complicity'.", "authors": [], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/22/20056318-0-image-a-13_1571779227845.jpg", "published_at": "2019-10-22"}