{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/update-icloud-for-windows-right-now-to-protect-against-ransomware", "downloaded_at": "2019-10-12 00:36:55.254010+00:00", "title": "Update ICloud For Windows Right Now To Protect Against Ransomware", "language": "en", "text": "Windows iTunes users: There’s a serious exploit in the Bonjour updater for Apple software on Windows that makes it possible for someone to discreetly install ransomware on your system.\n\nAs reported by Threatpost, the exploit takes advantage of the fact that Apple programs use Bonjour, a piece of networking software Windows users download alongside iTunes. Apple has already addressed the issue in a new patch for iCloud on Windows. If you use (or have ever installed) iCloud or iTunes for Windows, you should make sure it’s updated as soon as possible.\n\nWhy update it even if you don’t use it? According to Morphisec, the research firm that initially found the exploit, Bonjour installs automatically when you install iTunes, but it doesn’t automatically uninstall when you delete iTunes. If you’ve installed iTunes, and then gotten rid of it, there’s a good chance Bonjour is still there, ready to work with any compatible apps whether you have them or not.\n\nThough Apple has already addressed the exploit, the issue raises larger concerns for iPhone/iTunes users on Windows, long-term. Apple has killed off iTunes on Mac devices. With iTunes out of the spotlight, that may make the Windows app a more attractive target for bad actors. That isn’t to say that these apps are unsafe or unprotected, it’s just something to think about.", "description": "Windows iTunes users: There’s a serious exploit in the Bonjour updater for Apple software on Windows that makes it possible for someone to discreetly install ransomware on your system....", "authors": ["Whitson Gordon", "Chris Jager"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/xuwnejrdopymfubdrilp.jpg", "published_at": "2019-10-12"}