{"pub": "cnn", "url": "https://cnn.com/style/article/leonardo-da-vinci-louvre-exhibition/index.html", "downloaded_at": "2019-10-18 11:05:13.634744+00:00", "title": "Louvre gets ready for its biggest ever Leonardo exhibition", "language": "en", "text": "Jacopo Prisco , CNN Written by\n\nThe Louvre in Paris, the world's most visited museum, is gearing up for its largest ever Leonardo da Vinci exhibition, in celebration of the 500th anniversary of the artist's death.\n\nBuilding on the museum's Leonardo collection -- already the best in the world with five paintings and 22 drawings -- the show has been 10 years in the making and will feature over 120 works, including loans from institutions in Italy, Germany, Russia, the UK and the US, as well as France.\n\nThe works -- paintings, drawings, manuscripts, sculptures and artifacts -- will be displayed in the museum's Napoleon Hall for four months starting Oct. 24, and up to 7,000 visitors a day are expected.\n\nThe art of the deal\n\nLeonardo's surviving body of work as a painter is remarkably slim: only about 15 to 20 existing paintings can be comfortably attributed to him, although two of them -- the \"Mona Lisa\" and \"The Last Supper\" -- are easily among the most famous in the world. Many are too fragile to be moved, and for most institutions that own them, they represent the pinnacle of the entire collection. Loaning these works involves delicate diplomacy and challenging logistics.\n\nThe curators of the Louvre exhibition, Vincent Delieuvin and Louis Frank, have managed to get six Leonardo paintings on loan to add to the museum's own five, bringing the total to 11. The previous largest Leonardo exhibition, at London's National Gallery in 2011, featured nine paintings.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1 / 23 The Leonardo da Vinci exhibition at the Louvre includes over 120 works. This is La Belle Ferronnière (1490-1497), from the Louvre collection. The subject of this painting is believed to be Lucrezia Crivelli, a mistress of Leonardo's employer and Milan's ruler, Ludovico Sforza. Leonardo had painted a portrait of Sforza's previous mistress, Cecilia Gallerani, just a few years earlier. In fact, the walnut panels from the two works seem to come from the same tree, which has helped with attributing this work to Leonardo. The painting is also known as \"La Belle Ferronnière,\" after the headband with a jewel worn by the subject. Browse through the gallery to see a selection of the works on display. Credit: © RMN-Grand Palais (musée du Louvre) / Michel Urtad\n\n\"For us it's easier than for others. We have five of them. We start with a third of all his paintings,\" said Vincent Delieuvin on the phone from Paris. \"Most of our colleagues were very keen on lending works to us. It will be the biggest exhibition of Leonardo's paintings and probably the best collection of his drawings and scientific manuscripts.\"\n\nThe 6 loans are the \"Benois Madonna\" from the State Hermitage of St Petersburg, the \"Saint Jerome\" from the Vatican, the \"Musician\" from the Pinacoteca Ambrosiana in Milan, the \"Head of a Woman (La Scapigliata)\" from the Galleria Nazionale in Parma, and two paintings both known as the \"Madonna of the Yarnwinder\" -- one from a private collection and the other from The National Gallery in Edinburgh. They will join the five Louvre Leonardos: \"La Belle Ferronnière,\" the \"Virgin of the Rocks,\" the \"Mary and Child with Saint Anne,\" \"Saint John the Baptist\" and the \"Mona Lisa.\"\n\nHead of a Woman (Las Scapigliata) is unfinished, like many other Leonardo works. Credit: © Galleria Nazionale di Parma.\n\n\"That's a pretty great list,\" said Luke Syson, who curated the 2011 National Gallery exhibition in London. \"I know how hard it is to put together an exhibition of this kind and how complicated the discussions are with each of the lending institutions. Obviously, there's always going to be discussions and questions about which of those are by Leonardo himself. But these are the opportunities to test those works.\"\n\nNotably absent are the three Leonardos owned by the Uffizi in Florence, Italy's most visited museum, which were the subject of some political controversy and were ultimately labeled as too fragile to be transported by the museums' director. The Uffizi, however, have sent the Louvre several drawings, including Leonardo's very first known artwork, a sketch of the Arno river valley around Florence.\n\nUnlike paintings, Leonardo drawings are not scarce and many will be on display in Paris, including various preliminary sketches for his paintings, some of his astonishing anatomical studies and the most famous of them all, the \"Vitruvian Man,\" a study on the proportions of the human body. Its loan from Venice was only secured this week , after an Italian heritage group had filed an appeal with a court to block the move due to the fragility of the sketch.\n\nThe \"Vitruvian Man\" is rarely exhibited to the public. Credit: GABRIEL BOUYS/AFP/AFP/Getty Images\n\nScientific research\n\nAccording to the curators, securing the loans wasn't actually the hardest part of their decade of work on the show. \"The most difficult thing was to understand Leonardo da Vinci. The scientific preparation, the work on the archive documents, the study of Leonardo himself was really more difficult than the diplomatic and logistical aspects of the exhibition.\"\n\nThis preparation work includes a thorough analysis of Leonardo's biography by 16th-century art historian Giorgio Vasari, new scientific analysis of all the Louvre's paintings and a full restoration of three of them: \"Saint Anne,\" \"La Belle Ferronnière,\" and \"Saint John the Baptist.\"\n\nThe team's findings included new details about the \"Virgin of the Rocks,\" which Leonardo painted twice after the first version was rejected by its commissioners. Some scholars believe that the refusal was due to the angel ostensibly pointing his finger at St John and looking directly at the viewer, because both those elements were removed from the subsequent version of the painting. But Delieuvin says that the same composition, without the pointing finger, has been discovered under the original version too, and was changed only at the last moment -- what's usually called a pentimento (meaning \"repentance\" in Italian).\n\nThe Louvre version of the Virgin of the Rocks. Credit: PHAS/Universal Images Group Editorial/Universal Images Group via Getty\n\n\"This helps us tell a new story on the \"Virgin of the Rocks.\" It helps us understand in a better way the artistic personality of Leonardo da Vinci and shape his image of a perfectionist, someone who didn't do a lot of paintings, but each time was striving to find the best composition and the most beautiful pictorial execution,\" said Delieuvin.\n\nPutting so many Leonardo works together under one roof has other beneficial side effects, such as progressing the discussion on attribution. Renaissance painters did not sign their works, and most paintings were the product of a workshop, where many artists and apprentices contributed to the same artwork. That has historically spawned debates on whether some paintings show Leonardo's hand or not. \"For example, there are question marks about the degree of Leonardo's intervention on both versions of the \"Madonna of the Yarnwinder.\" Those can really be solved only by seeing these pictures next to others that everyone agrees are by his hand. The fact that both are in the show is a perfect moment to look at the claims of each of those pictures against a series of paintings that we know were painted at the same time,\" said Syson.\n\nMona Lisa & Salvator Mundi\n\nOne of the show's goals it so reassert the importance of painting in Leonardo's life. According to Delieuvin, Leonardo's prolific work as a botanist, anatomist, mathematician and scientist was entirely functional to his work as a painter, and his aim was to reproduce his study of nature in his paintings.\n\nHowever his most famous work, the \"Mona Lisa,\" won't technically be part of the exhibition, as it will remain in the room where it is normally on display, on the first floor of the museum.\n\nThe Mona Lisa is colloquailly know as La Joconde in French and La Gioconda in Italian, meaning \"jovial\" and a pun on the sitter's married name, Lisa del Giocondo. Credit: ERIC FEFERBERG/AFP/AFP via Getty Images\n\n\"We would have loved to have the \"Mona Lisa\" with us in the exhibition, but each day she gets 30,000 visitors. In the exhibition space, we can only have about 5,000 visitors a day, 7,000 when we do a night opening. Having her in the same space would make it impossible to visit the exhibition, because everyone who visits the Louvre wants to see the \"Mona Lisa,\" explained Delieuvin. Visitors will still be able to see the work with the same ticket, but will have to join the queue.\n\nThe Louvre also wanted \"Salvator Mundi\" to be in the show. The painting, whose attribution to Leonardo is disputed , sold at auction in 2017 for a record $450 million and is believed to be owned by Saudi Crown Prince Mohammed bin Salman, although its current whereabouts are unknown . \"We asked for the painting and we never changed our mind. We asked for it in 2015, when it was still with the previous owner, Russian collector Dmitry Rybolovlev. We maintained our loan request after 2017, and it's still open today. We haven't received a definitive answer.\"\n\n\"Salvator Mundi\" at the Christie's auction in 2017, in New York City. Credit: AFP Contributor/AFP/AFP/Getty Images\n\nThat means there's still a chance that \"Salvator Mundi\" could make a surprise appearance. If it does, it will be interesting to see whether the Louvre attributes it to Leonardo or not. At the 2011 London exhibition, the painting was attributed to the master, causing its value to skyrocket.\n\n\"If the painting arrives, you will discover the attribution in the catalog and in the label,\" said Delieuvin.\n\n\"But if it doesn't arrive, you won't know what we think.\"", "description": "The Louvre is gearing up for its largest ever Leonardo da Vinci exhibition, in celebration of the 500th anniversary of the artist's death, with over 120 works from institutions all over the world.", "authors": [], "top_image": "http://cdn.cnn.com/cnnnext/dam/assets/191016111408-gettyimages-944564060-restricted-super-tease.jpg", "published_at": "2019-10-18"}