{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7544339/PICTURED-Promising-student-19-crushed-death-house-party-panic-set-in.html", "downloaded_at": "2019-10-07 00:15:08.288532+00:00", "title": "PICTURED: Promising student, 19, who was crushed to death at a house party after 'panic set in'", "language": "en", "text": "Sophia Crestani (pictured) was crushed to death at a house party\n\nA promising young student has been crushed to death after falling down the stairs at a house party.\n\nIdentical twin Sophia Crestani, 19, attended a notorious party house called 'The Manor' in Dunedin, New Zealand, on Saturday night.\n\nWitnesses said there were between 500 and 600 students at the party and that revellers were 'packed in like sardines'.\n\nMs Crestani fell down the stairwell and was reportedly trampled to death after 'panic set in'.\n\nThe University of Otago student had just completed her end-of-year exams when she died.\n\nMs Crestani grew up in Wellington before moving to Dunedin to attend university two years ago.\n\nThe second-year student had previously expressed an interest in design and had modelling and acting profiles online.\n\nA student who was at the party told the NZ Herald said there was a crush after Ms Crestani fell.\n\nThe guest said the crowds made people 'slip and fall' all over the stairs throughout the night.\n\n'She may have been trampled. I went outside and saw her lying on the ground being given CPR.'\n\nMs Crestani (left) grew up in Wellington with her identical twin sister before moving to Dunedin to attend university two years ago\n\n'People started falling down the stairs onto one another, that's when the panic set in, people thinking 'I don't want to be the one on the floor'.\n\n'I don't think a lot of people realised what happened. It was awful. It was so totally packed, once you're under, you're under.''\n\nOtago Coastal Area commander Inspector Marty Gray held a press conference after Ms Crestani's death insisting it was 'too early' to understand the circumstances.\n\n'It's not a time to sort of point fingers or to indicate that anything sinister went on. It's for us to rally around this community who are hurting and for a very good reason,' Insp Gray said.\n\nThe party was reportedly held as a 'farewell' to the building - known as 'The Manor' which had been used to host parties for years prior to the university selling it\n\nHe said his department were initially contacted by Campus Watch at 11.55pm on Saturday night asking them to shut down a party at a recently sold student accommodation building.\n\nThe party was reportedly held as a 'farewell' to the building which had been used to host parties for years prior to the university selling it.\n\nFive minutes later, they received another call. A partygoer pleaded with police to come and help clear everybody out.\n\n'When our officers arrived there was… about 500 or 600 partygoers, a lot of them anxious, a lot of them trying to get out of the premises, a lot of them trying to get in the premises, a lot of disorganisation, a lot of uncertainty, a lot of anxiety,' he said.\n\n'The victim was carried out of the house by other people and resuscitation attempts were made at that time.'\n\nTwo other students were reportedly injured at the party.", "description": "Between 500 and 600 University of Otago students attended an end of exams celebration party in Dunedin, New Zealand , on Saturday night.", "authors": ["Brittany Chain For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/23/19374308-0-image-a-11_1570402198405.jpg", "published_at": "2019-10-06"}