{"pub": "yahoo", "url": "https://sports.yahoo.com/will-the-bears-even-miss-mitch-trubisky-022545902.html", "downloaded_at": "2019-09-30 04:07:11.003265+00:00", "title": "Will the Bears even miss Mitchell Trubisky?", "language": "en", "text": "CHICAGO — When the starting quarterback for a team with Super Bowl dreams leaves the game with a shoulder injury, it’s usually the cause for great sadness and strife.\n\nYet when that quarterback is named Mitchell Trubisky and the contender is named the 2019 Chicago Bears?\n\nWell, it was a weird feeling. Let’s just say normal emotions of panic and despair didn’t rule the same way in the stands at Soldier Field.\n\nScroll to continue with content Ad\n\nTrubisky lasted just six plays into Sunday’s game with the Minnesota Vikings. The third-year quarterback was forced to the locker room after a Danielle Hunter sack caused him to fall awkwardly on his left (non-throwing) arm. When he returned to the sideline in the second half, it was in street clothes and a sling.\n\nIt’s unclear how much time Trubisky will miss with the injury, as Bears head coach Matt Nagy provided no further info after the game. But following a 16-6 victory that was dominated by the Bears’ defense and deftly managed by backup Chase Daniel, one got the sense that Trubisky’s return needn’t be rushed.\n\nFor one, Daniel did more than a serviceable job after being plugged into the game, completing Trubisky’s drive with a 10-yard touchdown toss to Tarik Cohen. He finished the day by completing 22 of 30 passes for 195 yards, a 101.4 quarterback rating and — perhaps most importantly for a judgy Bears fan base — no interceptions or fumbles.\n\n“We’re very, very lucky to have Chase as our backup,” Nagy said.\n\nChicago Bears quarterback Mitchell Trubisky is seen on the sideline with his arm in a sling during the second half against the Minnesota Vikings. Trubisky was injured during the first quarter and left the game. (AP)\n\nFor another, Trubisky’s departure allowed that aforementioned fan base to take a break from the exhausting week-to-week referendum on No. 10’s skills that has dominated the season.\n\nStory continues\n\nInstead, the Bears and their fans were able to focus on a dominating defensive performance that ran the team’s record to 3-1 and ended a turbulent month on a high note. Chicago sacked Kirk Cousins six times, forced two fumbles and froze the NFL’s leading rusher Dalvin Cook to just 35 yards on 14 carries.\n\nThey also could’ve celebrated an impressive show of depth. In addition to Trubisky, the Bears were missing Pro Bowl defensive tackle Akiem Hicks, offensive lineman Kyle Long, receiver Taylor Gabriel and linebacker Roquan Smith, who was a surprise late scratch because of undisclosed personal reasons.\n\n“We’re just getting warmed up,” said all-world linebacker Khalil Mack, who strip-sacked Cousins on the first play of scrimmage in the second half. “We’re just getting warmed up.”\n\nMack’s assertion has to be a scary message for any future opponent who has seen the Bears’ D rack up a combined 10 sacks and seven turnovers between Sunday’s victory and last Monday’s win in Washington. If expected regression from the defense was a main reason that statistical models had the Bears stepping back from last year’s 12-4 record, we haven’t seen it yet.\n\nAs for future opponents, Mack said he was excited to play his old Raiders team in London next Sunday, but doesn’t plan on lobbying any barbs at Oakland coach Jon Gruden.\n\n“I can’t give you guys what you want,” Mack said to the media mob with a laugh and a grin.\n\nBut back to Trubisky, who will still no doubt dominate this week’s talk once the euphoria of Sunday’s win wears off.\n\nThe Bears entered the season publicly voicing their expectations to see a big jump from the quarterback they selected with the second pick in the 2017 draft, infamously ahead of Deshaun Watson and Patrick Mahomes.\n\nDisappointing games against Green Bay and Denver dug up repressed Rex Grossman memories among Bears fans, leading many to fret the team was once again frittering away a generational defense.\n\nA solid game from Trubisky against Washington stemmed that talk a bit, but Daniel’s performance should spark plenty of debate whether he’s more capable of serving as a mistake-free game manager the Bears can win with.\n\nDaniel will turn 33 a week from Monday and has been in the league since 2009. A career backup, he’s started only four games in his career — two in Kansas City where he played under Nagy and two with the Bears last season, when he beat Detroit and lost to the Giants with Trubisky on the sideline with a different shoulder injury.\n\nChase Daniel celebrates his team's 16-6 win over the Minnesota Vikings at Soldier Field. (Getty Images)\n\nDaniel is the quintessential backup, a playbook master who doesn’t flinch when his number is called. Matched against a Vikings defense that is intimidating in its own right, Daniel took what was given to him, managing three drives that ended in field goals after the opening drive that ended with the team’s lone touchdown.\n\nHe’s not as strong as Trubisky, neither with his arm nor his legs, but he’s also not going to make as many mistakes.\n\n“Our game plan is not going to change a whole lot,” Nagy said. “If Chase is the guy, we're going to do things that Chase does well. We're going to try to do that. If it's Mitch, then we'll continue to keep doing things with him.”\n\nOne thing the Bears will need to rectify is the performance of its running game. Rookie David Montgomery averaged just 2.5 yards per carry (21 attempts for 53 yards) to further his disappointing debut month while Cohen carried the ball five times for just 11 yards.\n\nThat’ll have to improve no matter who is quarterback.\n\nFor now, though, the Bears can celebrate the close of a month that started with a bad loss to the Packers and ended with a good win against a different division rival.\n\nThe rest of the season lies ahead, and while there’s plenty of uncertainty, it doesn’t seem as bad as it should.\n\nThat’s life with Mitch.\n\nMore from Yahoo Sports:", "description": "Normally when the starting quarterback goes down with an injury, there's cause for concern. Not so with Mitchell Trubisky.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/EZA_plVtbAEf9_eTJI._.A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/bTEDTdnzTgNyo0QPydCA8w--~B/aD0xMzkwO3c9MjA4NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/83775170-e329-11e9-8772-06ff2072c786", "published_at": "2019-09-30"}