{"pub": "rt", "url": "https://rt.com/news/470201-russian-scientists-donut-spaceship", "downloaded_at": "2019-10-05 10:49:57.701631+00:00", "title": "Space bagel: Russia to fly donut-shaped spaceship to edge of solar system", "language": "en", "text": "A team of Russian scientists is developing a donut-shaped spaceship that can reach the farthest corners of the solar system in record time by taking power directly from the Sun.\n\nThe spaceship’s clever method of sourcing fuel will allow it to overtake even the fastest probes, unravel questions about the origin of comets, and even provide electricity to future martian colonists, all while proving Albert Einstein’s theory of general relativity.\n\nAlso on rt.com ‘Ideal precursors’ of LIFE found on Saturn’s icy ocean moon, scientists say\n\nThe plate covering the middle part of the bagel-shaped ship is a solar sail. It is coated in a special substance that will begin to evaporate as it approaches the Sun, giving the ship a boost of jet acceleration without having to carry heavy engines.\n\nUsing the pressure of sunlight in this ingenious manner will allow the sailboat to speedily get to the mysterious Oort cloud at the edge of the solar system, where it’s believed that comets are born.\n\n“The duration of flights to other stars is gigantic. The Voyager 1 high-speed space probe will take 300 years to reach the Oort cloud. Our sail can reach it in 20-30 years,” said Professor Olga Starinova, of Samara University’s Department of Space Engineering.\n\n“This means that we or the next generation will be able to obtain evidence of existence clouds, presumably generating all comets, and examine what remains of the formation of the solar system about 4.6 billion years ago,” she explained.\n\nAlso on rt.com Russia invents self-destroying satellite to solve burgeoning ‘space junk’ problem\n\nThe highly advanced technology will also make it possible to prove fundamental laws of physics, such as Einstein’s famous theory, that cannot be achieved under Earth’s conditions. It will also be able to “warm” Mars by reflecting the Sun’s rays, helping to enable the colonization of the Red Planet.\n\nThe researchers have already calculated flights to all the other planets in the solar system and learned that small sailboats can be in orbits near Jupiter, Saturn or Mars for a long time, relaying scientific data back to Earth. They are now figuring out how to fly as close to the Sun as possible without burning in order to enable long-distance missions to neighboring star systems.\n\nLike this story? Share it with a friend!", "description": "A team of Russian scientists is developing a donut-shaped spaceship that can reach the farthest corners of the solar system in record time by taking power directly from the Sun.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5d975dc3203027671e519c15.jpg", "published_at": "2019-10-05"}