{"pub": "usatoday", "url": "https://usatoday.com/story/life/parenting/2019/10/20/shay-mitchell-matte-babel-welcome-first-child-baby-girl/2018466001", "downloaded_at": "2019-10-21 03:02:06.705634+00:00", "title": "Shay Mitchell and boyfriend Matte Babel welcome their first child, a baby girl", "language": "en", "text": "\"Pretty Little Liars\" actress Shay Mitchell revealed in June that she and boyfriend Matte Babel were expecting. Sunday, she posted a photo welcoming their new arrival. (Photo: David Livingston, Getty Images)\n\nCongratulations to Shay Mitchell and boyfriend Matte Babel on the birth of their first child!\n\nThe new mom announced in a tweet Sunday that she and Babel had welcomed a baby girl, posting a photo of tiny fingers wrapped around her own. She captioned the sweet picture, \"Never letting go...\" .\n\nUSA TODAY has reached out to Mitchell's reps for more details about the new arrival.\n\nThe \"Pretty Little Liars\" star announced in late June that she was expecting by sharing a photo of her pregnant belly on Instagram and a video detailing the journey on YouTube.\n\n\"Does this mean I’m allowed to drive in the car pool lane at all times now?\" she joked, captioning a topless maternity shot that showcased her growing baby bump.\n\nMitchell broke the news just five months after revealing she had suffered a miscarriage at five months.\n\n\"We all have to deal with various struggles and challenges in life,\" she wrote. \"The support and affection that so many of you show me lifts me up during even my darkest days, one of which happened last year after I miscarried and lost the child of my hopes and dreams.\"\n\nPower Rangers, diapers and epidurals\n\nSince the big reveal, the actress has been taking fans along on her pregnancy journey through her YouTube series called \"Almost Ready.\"\n\nShe documented her gender reveal party by having blue and pink Power Rangers duke it out in the ultimate fight.\n\nSpoiler: The pink ranger won.\n\nMitchel joked that she started wearing adult diapers as a result of her pregnancy.\n\n\"Honestly guys, I've never known that somebody could pee as much as you do when you're pregnant,\" Mitchell said to her stylist. \"I swear to God, in a half an hour, I went to the bathroom probably about 22 times last night to the point where I was like 'I'm (expletive) wearing diapers.' \"\n\nMitchell and Babel also shared their discussions (sometimes arguments) about whether Mitchell should have an epidural during childbirth and breastfeed their newborn.\n\nWe can only hope the new mom will continue to share the couple's parenting journey, too.\n\nREAD MORE\n\nRead or Share this story: https://www.usatoday.com/story/life/parenting/2019/10/20/shay-mitchell-matte-babel-welcome-first-child-baby-girl/2018466001/", "description": "\"Pretty Little Liars\" actress Shay Mitchell posted a photo letting the world know that she and boyfriend Matte Babel are officially parents.", "authors": ["Rasha Ali", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/27/USAT/f96f07e1-a6bf-49fa-9c8c-fe69f8d81727-GTY_1173713116.JPG?crop=2732,1537,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-20"}