{"pub": "independent", "url": "https://independent.co.uk/arts-entertainment/photography/london-architecture-tour-guide-buildings-shard-barbican-tate-a9101676.html", "downloaded_at": "2019-09-15 15:14:28.786527+00:00", "title": "Navigating the capital by the most attractive route: An Opinionated Guide to London Architecture", "language": "en", "text": "Walking through London can be a frustrating experience. Busy people scurrying along cluttered pavements while seething commuters honk their horns in standstill traffic; it doesn’t bear thinking about.\n\nFor a calmer experience, a walker would do well to direct their attention at the surrounding buildings. They don’t move, for one, and some of them are truly extraordinary sights to behold.\n\nThe capital has long served as a canvas for pioneering architects from all over the world and as such is home to all manner of bold buildings from art deco cinemas to brutalist estates to the modern-day glass monoliths.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThis does, however, mean that there are more buildings than one could hope to see in a lifetime. Lucky then that An Opinionated Guide to London Architecture, a new photo book from Hoxton Mini Press, presents a concise selection of the ones worth seeing.\n\nIt serves as a tour guide, with three different routes to follow that take in more than 50 of the capital’s best buildings.\n\nAs the title suggests, the book is a subjective guide to London’s buildings: the work of editors Sujata Burman and Rosa Bertoli, a pair of self-proclaimed design fantatics.\n\nWhile concise, it’s hardly a narrow selection. The obligatory St Paul’s Cathedral sits alongside modern classics such as the Walkie Talkie and plenty of lesser-known gems (the largest traditional Hindu temple outside of India, for example).\n\nAnd for those who can’t face the fuss of trawling through London in person: it is all right there on the page.\n\n‘An Opinionated Guide to London Architecture’ is available now from Hoxton Mini Press", "description": "Walking through London can be a frustrating experience. Busy people scurrying along cluttered pavements while seething commuters honk their horns in standstill traffic; it doesn’t bear thinking about.", "authors": ["Liam James"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/10/14/hmp-trellick-1.jpg", "published_at": "2019-09-14"}