{"pub": "investing.com", "url": "https://au.investing.com/news/forex-news/update-1new-zealand-central-bank-stands-pat-flags-scope-for-more-stimulus-1962934", "downloaded_at": "2019-09-25 04:53:31.270064+00:00", "title": "UPDATE 1-New Zealand central bank stands pat, flags scope for more stimulus", "language": "en", "text": "© Reuters. UPDATE 1-New Zealand central bank stands pat, flags scope for more stimulus\n\n* RBNZ holds rate at record-low 1%, flags scope for more stimulus\n\n* Says rates can be expected to be \"low for longer\"\n\n* NZ dollar edges up after announcement (Adds detail from c.bank statement, analyst comment & context)\n\nWELLINGTON, Sept 25 (Reuters) - New Zealand's central bank on Wednesday held the official cash rate (OCR) at a record-low 1.0%, as expected, but said there is scope for more fiscal and monetary stimulus to support an economy facing intensifying global trade and demand pressures.\n\nThe local dollar edged up as the Reserve Bank of New Zealand gave little away on whether it would add to its recent rate cuts before year-end, though it left the door open for more easing as a protracted Sino-U.S. trade war kept global recession risks elevated.\n\n\"The Monetary Policy Committee agreed that new information since the August Monetary Policy Statement did not warrant a significant change to the monetary policy outlook,\" the RBNZ said in a statement accompanying its rates decision.\n\nThe central bank said global long-term interest rates remain near historically low levels, adding that markets can expect New Zealand's interest rates to be \"low for longer\".\n\nWednesday's decision was predicted by all 14 economists in a Reuters poll. The New Zealand dollar turned positive, edging up 0.3% to $0.643 after the policy announcement.\n\nThe central bank stunned markets with a steep 50 basis-point cut in August, as policymakers sought to jolt the economy out of a sharp slowdown and protect it from the broadening impact of the Sino-U.S. trade war. said the reduction in the OCR this year has helped to push the New Zealand dollar down, adding low rates were needed to ensure inflation increases to the 2% mid-point of its target range, and employment remains around its maximum sustainable level.\n\n\"There remains scope for more fiscal and monetary stimulus, if necessary, to support the economy and maintain our inflation and employment objectives,\" the central bank said.\n\nASB Bank said a lower OCR remains very much on the cards.\n\n\"But by itself the statement suggests that a November cut isn't a dead certainty, even though we think it is the highly likely outcome,\" said ASB Chief Economist Nick Tuffley.\n\nMarkets are pricing in a 66% chance of a 25 basis point rate cut by the RBNZ in November.\n\nPolicymakers everywhere have been forced to consider more stimulus as fears grow over the broadening fallout of the U.S.-China trade dispute on the global economy.\n\nLast week, the U.S. Federal Reserve cut interest rates again to sustain a record-long economic expansion and fend off risks including weak global growth and resurgent trade tensions.\n\nEconomic growth in New Zealand has been sluggish this year as international trade tensions, China's slowing economy and Brexit uncertainty have all combined to send business confidence plummeting to record lows.\n\nRBNZ said low interest rates and increased government spending are expected to support a pick-up in domestic demand over the coming year.\n\nGross domestic product grew faster than expected in the second quarter, but that hasn't been enough to reduce pressure for more stimulus from the RBNZ, with markets wagering on further rate cuts this year. Bank Chief Economist Sharon Zollner noted that forward indicators suggested growth will continue to slide over the remainder of the year.\n\n\"And with inflation expectations already low and falling, we suspect the RBNZ will again feel the need to shoot first and ask questions later.\"", "description": "UPDATE 1-New Zealand central bank stands pat, flags scope for more stimulus", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEAAB0VB_L.jpg", "published_at": "2019-09-25"}