{"pub": "fox", "url": "https://foxnews.com/world/climate-change-activists-europe-australia-arrested", "downloaded_at": "2019-10-08 15:10:21.642427+00:00", "title": "Aggressive climate change protests hit major cities in Europe, Australia, more than 300 arrested", "language": "en", "text": "A group of extreme climate change activists around the globe has brought parts of London, France, Germany, and Australia to a standstill as they aggressively push politicians to cut carbon emissions. In London alone, the actions of the Extinction Rebellion group led to 319 arrests and prompted British Prime Minister Boris Johnson to call the group \"uncooperative crusties.\"\n\n\"I am afraid that the security people didn't want me to come along tonight before they said the road was full of uncooperative crusties,\" Reuters quoted Johnson as saying during an event Monday night. Crusties is a British slang term for eco-protesters.\n\n\"They said there was some risk I would be egged,\" he added.\n\nBREXIT DEAL IS 'ESSENTIALLY IMPOSSIBLE,' JOHNSON SAYS, IF EU STANDS BY TRADE DEMAND\n\nProtesters said they didn't think Johnson's name-calling helped the tense situation.\n\n\"We're just ordinary people trying to express our deep disappointment with how slow the process of getting climate change action to occur is taking place, with the government not really listening, not really taking it forward on the scale it needs to be taken,\" Diane Jones told Reuters.\n\nClimate protesters in Australia and New Zealand also blocked roads, entered banks and energy companies on Monday. In Sydney, police were seen dragging elderly people and men in suits through the crowds as massive groups blocked roads in and out of the city. In all, police in Australia arrested about 30 people.\n\nIn Britain, the aim of the group is to force the country to reduce its greenhouse gas emissions to net-zero by 2025. Currently, Britain's target is 2050.\n\nCLICK HERE FOR THE ALL-NEW FOX BUSINESS APP\n\nThis isn't the first time there was a mass arrest in London over climate change. In April, the city was brought to a standstill after the same group caused havoc for three days in a row, climbing and gluing themselves on subway trains and other things to prompt road closures and disrupt daily life in London. The group was also responsible for a naked protest in the British Parliament.", "description": "A group of extreme climate change activists around the globe have brought parts of London, France, Germany and Australia to a standstill as they aggressively push politicians to cut carbon emissions. In London alone, the actions of the Extinction Rebellion led to 319 arrests and prompted British Prime Minister Boris Johnson to call the group \"uncooperative crusties.\"", "authors": ["Barnini Chakraborty"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/climate-protest-4-AP.jpg", "published_at": "2019-10-08"}