{"pub": "guardian", "url": "https://theguardian.com/football/who-scored-blog/2019/sep/25/manchester-united-goals-ole-gunnar-solskjaer", "downloaded_at": "2019-09-25 13:39:31.949696+00:00", "title": "Manchester United are no longer a team that averages a goal a game", "language": "en", "text": "Manchester United were lethargic against West Ham at the London Stadium on Sunday and their shortcomings were punished. It was the first game of the season in which United failed to score, but their toothlessness in attack has been a real issue for some time. Having previously been concerned about their team’s defence, fans should be worried about the state of their attack. This team is struggling to exert any dominance in matches.\n\nSince their stunning 3-1 victory over PSG in the Champions League in March, United have played 19 games and scored just 17 goals. They have only scored more than a single goal in three of those 19 games (their 2-1 win against Watford in March, 2-1 win against West Ham in April and 4-0 victory over Chelsea on the opening day of this season).\n\nFor a club of Manchester United’s stature, this is a big concern. It is also an alarming decline from the impact Ole Gunnar Solskjær enjoyed initially after he replaced José Mourinho. There was always likely to be a drop-off after that honeymoon period but that doesn’t render the scale of their collapse as irrelevant or excusable. Manchester United’s shot-conversion rate during Solskjær’s first 17 matches in charge – up to and including the 3-1 win at PSG – was a whopping 17.8%. For context, Liverpool had the best conversion rate in the Premier League last season at 15%.\n\nDiego Simeone: 'If I want something I go after it ad nauseam' Read more\n\nUnited scored 39 goals in Solskjær’s first 17 games (2.8 per game) from a modest 219 shots (12.9 per game). In the 19 matches since that memorable win at the Parc des Princes, they have scored just 17 goals (0.9 per game) from a higher number of shots – 261, or 13.7 per game. That equates to a woeful conversion rate of just 6.5%. To give some context for that percentage, it would place them 19th out of the 20 clubs in the Premier League last season – between Fulham on 7.3% and Huddersfield on 5.3%.\n\nThere is a glaring lack of creativity in this United team, which has been heightened in Paul Pogba’s recent absence. The Frenchman has his critics, but the big concern for United is that their best performances and results – particularly since Solskjær took charge – have often been inspired by the midfielder. And he seems keen on a “new challenge”.\n\nPogba has created 11 chances from open play in the Premier League this season, which is five more than any of his teammates even though he has missed United’s last two matches. The attack is set up to play on the counterattack and exploit opposition mistakes, which they did perfectly against Chelsea on the opening day of the season. But, while have a lot of pace up front, they really struggled to break down teams that are organised defensively and sit a little deeper.\n\nUnited’s attacking players are not scoring many goals and neither are they helping their defence. The team has won possession in the attacking third just 19 times this season – only Newcastle, Wolves and Villa have done so less often. When compared to their rivals to reach the top six, United are poor at pressing their opponents. For all their talent, Marcus Rashford and Anthony Martial are not renowned for their hard work off the ball. Alexis Sánchez was supposed to fill that void but he failed spectacularly.\n\nTuchel must curb hype after Neymar completes PSG's perfect week Read more\n\nMany fans were happy to see Sánchez and Romelu Lukaku join Inter in the summer, but they are now stuck with a side that lacks versatility and cohesion in defence and attack. They are predictable and it’s difficult to see that changing any time soon.\n\nSomething has to change or the club risks losing its place in the top six, let alone the top four. The extent of the regression from Solskjær’s early reign – both in terms of attacking quality and confidence – suggests that the Norwegian is not the man to come up with a solution.\n\nPremier League team of the week\n\nLa Liga team of the week\n\nSerie A team of the week\n\nBundesliga team of the week\n\nLigue 1 team of the week\n\n• Visit WhoScored for more statistics and ratings\n\n• Follow WhoScored and Martin Laurence on Twitter", "description": "Since Manchester United beat PSG in the Champions League in March they have played 19 games and scored just 17 goals", "authors": ["Martin Laurence"], "top_image": "https://i.guim.co.uk/img/media/d891e25aeadc1a943bace7324354654272f657c1/0_127_2689_1614/master/2689.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8972fbcdca09a735e9efb8886e8ce334", "published_at": "2019-09-25"}