{"pub": "afr", "url": "https://afr.com/companies/social-impact-integral-to-entrepreneurial-success-say-young-20180710-h12hyr", "downloaded_at": "2019-10-05 06:08:26.124411+00:00", "title": "Social impact integral to entrepreneurial success, say young", "language": "en", "text": "\"This younger group is also investing at a much higher rate than its older peers, with just 27 per cent of entrepreneurs over 55 undertaking angel investing,\" Matthews says.\n\nThere are also differences between the generations in how they perceive and approach angel investing, according to the report.\n\nForty-nine per cent of young entrepreneurs primarily view angel investing as a social activity that connects them with a peer group of other business leaders and investors.\n\nOn the other hand, 76 per cent of entrepreneurs aged 55 and over regard angel investing as private activity and a way to diversify and grow an investment portfolio.\n\nInternational exposure\n\nSocial impact and start-up investments aside, younger high net worth individuals are seeking to diversify their investments through international exposures, taking advantage of strong global growth.\n\n\"They are directly investing in overseas stocks, especially in the US and Asian markets. They are also using exchange trade funds to access instant diversification, with minimal fees,\" says Brian Phelps, general manager, CommSec retail distribution.\n\nAdvertisement\n\nConversely, the search for yield is a focus for older, wealthier Australians investing in the share market.\n\n\"They are investing for long-term, sustainable income, while limiting the risk of their capital being eroded in this quest for yield. The overall dividend yield for the Australian share market is still quite strong compared to global peers,\" says Phelps.\n\n\"Older HNW Australians are also increasing their cash exposures and taking on a more defensive mentality as market volatility has increased throughout 2018 and global risks emerge,\" he says.\n\n\n\nWhile older and younger high net worth investors are often thought to have vastly different investment preferences that reflect their objectives and life stages, all groups are aware of macro-economic conditions and risk versus return attributes across markets.\n\n\"Generally speaking, younger high net worth investors have a higher risk tolerance, a preference for long-dated opportunities that are more illiquid in nature. They also have slightly larger interest in growth opportunities compared to older investors,\" says BT Private Wealth chief investment director, George Toubia.\n\nHe says high net worth investors also understand how business models are changing and how innovation creates new sources of opportunity. \"We are seeing strong interest from these groups in international markets and alternative investment areas.\"\n\nYield concerns\n\nMorgan Stanley executive director Matt Koch agrees that for older clients, achieving yield is often a major concern, particularly with interest rates globally at or near historic lows in recent years.\n\n\"We do spend time cautioning clients to resist the temptation of moving up the risk curve to seek higher yields, as we have seen in previous cycles this doesn't always end well. Within income-producing equities, rather than just looking for the highest yielders, we have seen our clients get better long-term results from stocks that have the ability to grow their dividend,\" he says.\n\nAdvertisement\n\nKoch says younger clients have a longer investment horizon and therefore tend to have bigger exposures to equities. \"They are certainly focused on investing in areas where we are seeing innovation and disruption. This tends to push them into looking offshore for opportunities, where some of the more exciting names are domiciled, lately that has primarily been in the US.\"\n\nHe says clients are also exhibiting renewed interest in alternative investments such as hedge and private equity funds as volatility in markets increases. These asset classes have historically delivered good returns in this environment.\n\nToubia notes high net worth clients understand global markets are adjusting to the interplay between central banks unwinding quantitative easing measures and heightened political and trade concerns. At the same time, returns from many asset classes such as equities, credit and real estate are less attractive compared to a few years ago.\n\n\"Clients are looking for resilient business models and sectors with supportive fundamentals and valuations, coupled with active risk management,\" he says.\n\nAttractive sectors include industrials, technology, e-commerce, consumer discretionary and regional US financials. Says Toubia: \"European companies are leaders in industrials, software and consumer discretionary sectors, and have a competitive edge on a global basis.\"\n\nUS strength\n\nIn the US, recent economic data continues to highlight the ongoing strength of the economy with positive labour, wage growth and small- to medium-size business momentum. This bodes well for the US as a source of opportunity across equity, credit and property markets.\n\n\"In line with that, investors are aware of the fundamental differences between the European and US banking sectors, with the latter being more progressed in balance sheet restructuring and capital stability,\" Toubia says.\n\nAdvertisement\n\nAdditionally, he says having been through a corporate earnings deceleration phase a few years ago, Asia offers a constructive set of consumption and services-led opportunities. Cyber security is another emerging opportunity for wealthy investors.\n\n\"Cyber security is a transformational evolution, which is expected to have sound drivers of value creation for investors. This opportunity can be harnessed by investing in those businesses that bring cutting edge cyber security solutions to the market,\" Toubia says.\n\nBack home, he says high net worth investors are looking for businesses with sustainable cash flow generation and earnings, strong dividends and the potential for medium-term yield growth.\n\nKoch agrees diversification is a focus for wealthy people. \"They recognise over the long term diversified portfolios deliver the strongest returns, with far less volatility than an 'all the eggs in one basket' approach. Effective diversification involves looking at various asset classes, geographies, currencies and industry groups.\"\n\nHis experience also suggests interest from high net worth investors in international investing continues to grow.\n\n\"We are in a world where innovation is driving growth and realistically you need to look beyond the local market to benefit. Added to that growth driver, many of the high net worth investors we speak to have a cautious view of the Aussie dollar, so diversifying into other currencies also has appeal. Frankly it is difficult to get exposure in the local market to high quality companies in growth sectors such as technology and healthcare.\"", "description": "Wealthy young people are setting up their businesses to have a positive impact on society and the environment, unlike their parents who sought autonomy.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1%2C$multiply_0.5814%2C$ratio_1.777778%2C$width_1376%2C$x_606%2C$y_177/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/87ba59109b5c9284925e052ff039f80e7ec3e0ec", "published_at": "2018-07-10"}