{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/11-google-chrome-extensions-you-need-to-download", "downloaded_at": "2019-10-09 22:09:12.323490+00:00", "title": "11 Google Chrome Extensions You Need To Download", "language": "en", "text": "Google Chrome has a lot of amazing tricks under the hood - but first you need to customise the experience with browser extensions. The trick is to find programs that are actually useful. However, with over 180,0000 options cluttering the Chrome Web Store, this can be a daunting task.\n\nFortunately, it's easy to gauge which extension are best by seeing what other people are using. Here are 11 options that have proven exceptionally popular - from speedy price-comparison tools to the indispensable grammar checker!\n\nFor the Luddites among you, a browser extension is a small, single-purpose program that brings additional functionality to your online browsing experience. They're typically created via HTML, JavaScript and CSS. Once installed, a Chrome extension will live in the browser's toolbar and can be activated with the click of a mouse button.\n\nSo which extension should you download? A recent Extension Monitor report revealed the most popular Chrome extensions. Each of the following programs has been downloaded more than 10 million times. (As Extension Monitor notes, the total number of installs is likely much higher - Google doesn't report full user counts for extensions with over 10 million users.)\n\nIn any event, 10 million downloads is a ringing endorsement in our books. With that in mind, here are 11 Chrome extensions you should be using.\n\nMost popular Chrome extensions (10m+ installs)\n\n\"Cisco Webex web and video conferencing is an easy, cost-effective way to exchange ideas and information online with anyone, anywhere on any mobile device or video system. Accelerate decision-making, keep projects on track, and collaborate in real time with integrated audio, video, and content sharing, all in one meeting.\"\n\n\"This extension adds a button to your browser toolbar. Click the translate icon whenever you want to translate the page you're visiting. The extension also automatically detects if the language of a page you're on is different from the language you're using for your Google Chrome interface. If it is, a banner appears at the top of the page. Click the Translate button in the banner to have all the text on the page appear in the new language.\"\n\n\"Easily turn web pages into PDF files that look just like the page you converted. Preserve the layout, formatting, and links of captured pages – including CSS styles, HTML5 tags, JavaScript and embedded Flash. (Windows only)\"\n\n\"Browse without worry or fear with Avast in your corner: we’ll check every site you visit, from Facebook to your bank, to ensure nothing puts you or your data at risk. We stop phishing attacks, show user reviews, and warn you if a site is deemed untrustworthy by our community of 400 million.\"\n\n\"Grammarly will make sure your messages, documents, and social media posts are clear, mistake-free, and impactful. Adding Grammarly to Chrome means that your spelling and grammar will be vetted on Gmail, Facebook, Twitter, Linkedin, Tumblr, and nearly everywhere else you write on the web. Once you register your new account, you will start to receive weekly emails with personalized insights and performance stats (one of our most popular new features). Working on a large project, an essay, or a blog post? No sweat. You can create and store all of your documents in your new online editor.\"\n\n\"Adblock Plus for Google Chrome blocks video ads, banners, pop-ups and other forms of intrusive and annoying advertising, as well as blocking tracking and malware.\"\n\n\"The Pinterest Save button lets you save any idea you find around the web so you can easily get back to it later. Just click to save dinner recipes, style inspiration, home projects and other ideas you want to try. The Pinterest Save button also has built-in visual discovery technology—hover over any image and click the visual search tool to instantly discover visually similar ideas on Pinterest.\"\n\n\"The latest update of the Skype extension gives you fast access to Skype for Web through your browser — plus you can insert Skype call links in emails, calendar items, and Twitter with one click or tap.\"\n\n\"Find the best prices, deals and discount coupons while shopping online with the price comparison and coupon extension by Avast.\"\n\n\"Automatically find and apply discounts when you shop online! Click on the Honey button during checkout and Honey will automatically apply coupon codes to your shopping cart. On Amazon discover the best time to buy with price history charts and alerts when your favorite products are on sale.\"\n\n\"Tampermonkey is the most popular userscript manager, with over 10 million users. Tampermonkey is used to run so called userscripts (sometimes also called Greasemonkey scripts). Userscripts are little computer programs that for example add download buttons to YouTube pages, cleanup your Facebook timeline or help playing an online game.\"\n\nIncidentally, there's also a lot of crap on the Chrome Web Store that is best avoided. According to Extension Monitor, approximately 50 per pent of Chrome extensions have fewer than 16 installs. Some of these extensions are actively harmful to the user - you can use Chrome Extension Source Viewer to check if your installations are safe.\n\n[Via Extension Monitor]\n\nThis story has been updated since its original publication.", "description": "Google Chrome has a lot of amazing tricks under the hood - but first you need to customise the experience with browser extensions. The trick is to find programs that are actually useful. However, with over 180,0000 options cluttering the Chrome Web Store, this can be a daunting task. Fortunately, it's easy to gauge...", "authors": ["Chris Jager"], "top_image": "https://edge.alluremedia.com.au/m/l/2019/08/Chrome-extensions.jpg", "published_at": "2019-10-09"}