{"pub": "yahoo", "url": "https://news.yahoo.com/flyers-pay-more-carbon-offsets-163806086.html", "downloaded_at": "2019-10-04 17:13:33.666457+00:00", "title": "Flyers will pay more for carbon offsets but not tax, study finds", "language": "en", "text": "By Elena Berton\n\nLONDON, Oct 4 (Thomson Reuters Foundation) - Travellers are willing to pay more for flights if they believe the extra money will be used to tackle carbon emissions, researchers said on Friday.\n\nPassengers were more likely to book flights that carried an extra fee if it was labelled as carbon offset than if it was called a carbon tax, researchers at the University of British Columbia found.\n\nOffsetting aims to mitigate the climate damage carbon emissions cause by paying to prevent or reduce emissions elsewhere.\n\n\"Taxes feel like you're charging people money for nothing,\" said David Hardisty, an assistant professor of marketing and behavioural science at UBC Sauder School of Business.\n\n\"Whereas an offset is the idea that, 'Sure we're paying, but we kind of have an idea where that payment is going, to make the environment better,' which is what people want.\"\n\nThe findings were published this week in the Journal of Environmental Psychology and suggest a possible way for the global airline industry, under pressure over carbon emissions, to improve its record.\n\nThe study consisted of two separate online surveys of more than 1,800 participants in the United States.\n\nThe aim was to gauge consumers' reaction to a $14 carbon fee that was presented to them in several different ways at the time of a hypothetical ticket purchase.\n\nConsumers were more likely to pick a flight that included a carbon price when it was called \"carbon offset for aviation fuel production and import\" as opposed to \"carbon tax for airplane travel\".\n\nThey even chose more expensive tickets with a fee described this way over cheaper tickets that did not have the $14 fee attached, according to the study.\n\nAs global concern over the environment grows, many people are choosing to shun flying altogether rather than offset their emissions. A survey published this week found that one in five travellers reports flying less.\n\nMeanwhile, celebrities who speak out about climate change, from actor Emma Thompson to Britain's Prince Harry, are facing growing scrutiny over their jetsetting.\n\nAir travel already accounts for about 2.5 percent of global emissions and the rapid growth means that by 2050, aviation could take up a quarter of the world's \"carbon budget\", according to the United Nations.\n\n\n\n\n\n(Reporting by Elena Berton, Editing by Claire Cozens. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, women's and LGBT+ rights, human trafficking, and property rights. Visit www.trust.org)", "description": "Travellers are willing to pay more for flights if they believe the extra money will be used to tackle carbon emissions, researchers said on Friday.  Passengers were more likely to book flights that carried an extra fee if it was labelled as carbon offset than if it was called a carbon tax, researchers", "authors": ["Elena Berton", "Thomson Reuters Foundation"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-04"}