{"pub": "marketwatch", "url": "https://marketwatch.com/story/are-millennials-destined-to-live-longer-and-retire-poorer-than-their-parents-2019-10-21", "downloaded_at": "2019-10-23 23:37:25.527687+00:00", "title": "Are millennials destined to live longer and retire poorer than their parents?", "language": "en", "text": "The latest research paints a grim picture of what retirement could look like for millennials — and we should all be concerned. In the developed world, no country has a higher concentration of millennials than the United States. They represent America’s future, but many have gotten off to a worse start than previous generations.\n\nMillennials earn less annually on average ($40,500) than similarly aged individuals just a decade ago ($43,300). They have less wealth than previous generations at the same age and more debt than young workers owed 30 years ago.\n\nProjecting the retirement future of millennials\n\nThe Urban Institute’s “Retirement Security in 2050” report takes a close look at how today’s retirees compare to projections about millennials when they begin to hit retirement age 30 years from now. It is anticipated that millennials will have higher average annual lifetime earnings ($50,000 versus $37,000 for those who have already reached retirement). Retirement incomes are also projected to rise from an average of $60,000 a year now to $73,000 for millennials.\n\nBut while these forecasts may be cause for optimism, the fate of some millennials probably won’t be as rosy. Current retirees face an already-alarming 24% poverty rate. As bad as it is today, that number is projected to rise to 30% for Generation X and millennial retirees, according to the Urban Institute. Those without college educations and with lower lifetime earnings will be the ones who find their outcomes much less secure.\n\nBeing a millennial has advantages and disadvantages\n\nMillennial workers tend to have high levels of education, typically associated with better savings rates and longer careers, due to less-physically demanding jobs. Working more years also postpones retirement dates and allows a longer time horizon for savings accumulation.\n\nYet many millennials don’t have a great comfort level with financial matters. More than half of women in the millennial generation say they feel “overwhelmed” by their financial situations, with 29% of men agreeing with that sentiment, according to research by the Society of Actuaries.\n\nRead: Why is it still so hard for women to save for retirement?\n\nMillennials also face many obstacles. The Brookings Institution explores the negative impact for many of this generation who started their careers during the Great Recession (from which GDP growth has still not recovered) and increasingly work in contingent jobs made popular by the “gig economy,” which often offer fewer benefits, including no way to save for retirement. Many also took out substantial student loans to pay for higher education. A typical graduate with $30,000 in school debt stands to risk having $325,000 less in savings when it is time to retire.\n\nMillennials are increasingly choosing to delay major life milestones like Homeownership, marriage, and having children. Although they will work longer, they will also live to be older than their parents and grandparents — meaning their retirement savings will have to last longer.\n\nNot all have the same opportunities\n\nMinorities face significant additional disadvantages when it comes to preparing for retirement. Only just over one-third of blacks and Hispanics have retirement accounts, compared with nearly two-thirds of white Americans, according to the Brookings Institution. Even when they have access to employer-sponsored retirement plans, less than half of Hispanics are expected to participate, as compared with two-thirds of blacks and three-quarters of whites.\n\nNot only are Hispanics less likely to have retirement accounts, but they are also projected to work fewer years than whites, leaving less time to accumulate savings. Estimates suggest 82% of whites will work for more than 30 years, compared with 58% of Hispanics.\n\nAlthough nonwhite families have seen some progress, experiencing larger income and wealth gains than their counterparts, they still have less income and wealth. More concerning is that whites are still projected to be more likely to experience upward income mobility than other ethnic groups.\n\nAccess to retirement savings plans makes a difference\n\nAccording to the National Institute on Retirement Security, only 55% of millennials are eligible to participate in an employer-sponsored retirement plan, compared with 77% of Gen X and 80% of baby boomers. For those who do have access to retirement savings plans, they will largely depend on defined-contribution plans that mean they will have to make their own decisions about saving and investing for the future.\n\nThis lack of access to simple retirement planning options helps explain why 66% of millennials have nothing saved for their so-called golden years. While many large employers already make defined-contribution plans available to their employees, too many small businesses do not.\n\nState and local governments have begun to come up with their own innovative solutions to make saving easier. To date, 11 cities and states have created new retirement savings programs featuring ideas like auto-enrollment individual retirement accounts (IRAs), multiple employer plans (MEPs) and marketplaces.\n\nThe private sector has stepped up to the plate by creating simpler, lower-cost retirement savings options that reach more workers. They have also begun to leverage technology to make the process of planning and saving more convenient for millennials who have become accustomed to such solutions to everyday challenges. The financial industry is also increasing available lifetime income solutions to help make sure that the retirement nest egg lasts for the rest of the retiree’s life.\n\nIncreased access to savings plans is essential, especially for gig economy workers and minorities who are far less likely to be able to use an employer-sponsored retirement program.\n\nMillennials still have time on their side\n\nFortunately, millennials still have the advantage of time to get themselves on track for a secure retirement and avoid retiring poorer than their parents. The key is to get started now. Every $1,000 that a worker sets aside at age 35 becomes $3,240 by retirement. Waiting five years and putting that same money into savings at age 40 reduces the return to just $2,670 by the time retirement comes around.\n\nThere will be plenty of opportunities to adjust a plan, but there’s no way to turn back the clock and start saving in the past. When it comes to retirement savings, there are no do-overs.", "description": "Being a millennial has advantages and disadvantages.", "authors": ["Angela Antonelli"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HL528_couple_ZG_20190617105958.jpg", "published_at": "2019-10-21"}