{"pub": "atlantic", "url": "https://theatlantic.com/politics/archive/2019/10/elizabeth-warren-democrats-attacks/600070", "downloaded_at": "2019-10-16 03:55:36.384221+00:00", "title": "The Democrats’ New War on Warren", "language": "en", "text": "This time, however, the difference was that Warren’s rivals called her out for it.\n\n“We heard it tonight: a yes or no question that didn’t get a yes or no answer,” Buttigieg, the mayor of South Bend, Indiana, said. “This is why people here in the Midwest are so frustrated with us, with Washington in general and Capitol Hill in particular.\n\n“Your signature, Senator, is to have a plan for everything, except this,” Buttigieg continued. “No plan has been laid out to explain how a multi-trillion-dollar hole in this Medicare for All plan that Senator Warren is putting forward is supposed to get filled in.”\n\nRead: The question Elizabeth Warren doesn’t want to answer\n\nMoments later, Klobuchar joined the criticism, pointing out that Senator Bernie Sanders of Vermont had acknowledged that taxes would go up for the middle class—albeit far less than for the wealthy—even as their total costs would decrease. “At least Bernie’s being honest,” the senator from Minnesota said. “I think we owe it to the American people to tell them where we will send the invoice.”\n\nNot to be outdone, O’Rourke cited Warren’s plan to levy a wealth tax on assets over $50 million in saying his rival was “more about being punitive” and pitting people against one another “instead of lifting people up.” Warren replied that she was “shocked” to be called punitive. “I don’t have a beef with billionaires,” she said, before launching into a part of her stump speech where she points out that even the most successful entrepreneurs in the country built their businesses using the infrastructure, educational system, and law-enforcement protection “that everyone paid for.”\n\nWarren had largely escaped attacks from her rivals in the first three debates, even as she was rising in the polls. Former Vice President Joe Biden and Sanders were more frequently the target of criticism from the long-shot candidates. But in the month since the Democrats last gathered on the debate stage, Warren has overtaken not only Sanders but Biden in key national polls and in surveys out of Iowa and New Hampshire.\n\nThe tenor of the critiques Warren received tonight were far milder versions of the attacks she’ll have to fend off from Republicans if she’s the nominee—that her unabashedly progressive agenda will turn off middle-of-the-road voters, that the candidate who boasts about all her plans is being evasive about her most far-reaching proposal.\n\nHow she responds over the next few months might well determine whether she keeps her perch atop the primary race. But for Warren, being the target of everyone’s rhetorical fire is undoubtedly a good problem to have.\n\nWe want to hear what you think about this article. Submit a letter to the editor or write to letters@theatlantic.com.", "description": "A volley of attacks from her rivals at tonight’s debate confirmed what polls have started to show: The senator from Massachusetts is the new leader of the primary pack.", "authors": ["Russell Berman"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/GettyImages_1181322369/facebook.jpg?1571189963", "published_at": "2019-10-16"}