{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7593363/Japan-3-26-South-Africa-Boks-set-Rugby-World-Cup-semi-final-Wales.html", "downloaded_at": "2019-10-20 13:01:14.833139+00:00", "title": "Japan 3-26 South Africa: Springboks set up Rugby World Cup semi-final with Wales", "language": "en", "text": "Advertisement\n\nSouth Africa's Tendai Mtawarira was lucky to escape a red card as the Springboks bludgeoned past hosts Japan 26-3 to book a World Cup semi-final with Wales.\n\n'The Beast' Mtawarira upended Keita Inagaki midway through the first-half and was sin-binned for the crude tackle.\n\nBut referee Wayne Barnes reached immediately for a yellow card, opting not to refer the decision to Television Match Official (TMO) Rowan Kitt.\n\nMakazole Mapimpi scored two tries for South Africa as they cruised into the World Cup semi-final at Japan's expense\n\nMapimpi scores his second try late on in the match as South Africa set up a semi-final with Wales in the World Cup\n\nJapan star Lomano Lava Lemeki (right) consoles distraught team-mate Yutaka Nagare following their loss in Tokyo\n\nJapan supporters wept around the country including Oita as they saw their team's dreams ended by South Africa\n\nInagaki landed on his head, leaving Japan frustrated with the level of punishment delivered to Mtawarira.\n\nMakazole Mapimpi bagged a brace and Faf De Klerk also raced in, with Handre Pollard posting 11 points off the tee as South Africa squeezed the life out of the Brave Blossoms.\n\nSo just when Japan thought they could shock the rugby world for a third time in five weeks the Springboks rolled up their sleeves and flexed sufficient muscle to subdue Jamie Joseph's men.\n\nWhere Japan conjured the miracle of Brighton by edging out South Africa 34-32 in 2015, here on home turf the Brave Blossoms fell prey to a brutalising by the Boks.\n\nFaf de Klerk soon took the game away from Japan in the second half as he fends off an opponent before scoring a try\n\nDe Klerk celebrates his try by punching the ball during a second half where South Africa scored 21 unanswered points\n\nMATCH FACTS Japan: Yamanaka (Lemeki 60), Matsushima, Lafaele, Nakamura, Fukuoka, Tamura (Matsuda 48), Nagare (Tanaka 72), Inagaki (Nakajima 48, 68), Horie (Sakata 72), Koo (Ai Valu 64), Thompson (Van der Walt 54), Moore, Leitch, Labuschagne (Mafi 12, 21), Himeno (Mafi) Penalty: Tamura South Africa: Le Roux, Kolbe (Steyn 72), Am, De Allende, Mapimpi, Pollard, De Klerk (Jantjies 74), Mtawarira (Kitshoff 54), Mbonambi (Marx 37), Malherbe (Koch 54), Etzebeth (Snyman 63), De Jager (Mostert 67), Kolisi (Kitshoff 12, 21), P. du Toit, Vermeulen (Louw 68) Tries: Mapimpi (2), De Klerk Conversion: Pollard Penalties: Pollard (3) Sin bin: Mtawarira\n\nThe world's newest favourite team found precious few answers when South Africa stuck the ball up their jumper, killing the game with a rampant driving maul for De Klerk's try.\n\nJapan might have downed Ireland 19-12 and ploughed past Scotland 28-21, but the hosts wilted in the Southern Hemisphere onslaught.\n\nNow the Boks will face Warren Gatland's Wales in Yokohama on Sunday, in a bid to reach their first final since 2007.\n\nThe tournament burst into life with a breathless group stage encounter between South Africa and New Zealand, that the back-to-back world champion All Blacks won 23-13.\n\nThere remains every chance the World Cup could finish just as it began then, with both South Africa and New Zealand appearing dangerous in attack and resolute in defence.\n\nJapan ultimately never recovered from a horror-show start.\n\nThe Boks exposed Tamura defending blindside from a scrum, and left the fly-half with nowhere to hide.\n\nDe Klerk fed Mapimpi and the powerful wing stormed over the top of Japan's playmaker and over the line for a near-immediate opening score.\n\nJapan recovered and dominated possession throughout the first-half, but could not find a way onto the scoreboard barring a penalty for Tamura.\n\nMakazole Mapimpi got South Africa off to a wonderful start with a try in the fourth minute at the Tokyo Stadium\n\nMapimpi is congratulated by South Africa team-mates for his early try as dejected Japan players look on\n\nSouth Africa's Tendai Mtawarira was penalised for performing a spear tackle on Japan's Keita Inagaki\n\nMtawarira was sent to the sin bin as a result of his dangerous challenge just 10 minutes into the World Cup quarter-final\n\nNot even Mtawarira's yellow card and a 10-minute one-man advantage could help Japan find a chink in the Springboks' hugely-impressive defensive armour.\n\nFlying wing Kenki Fukuoka so nearly scorched clear when skinning South Africa's own pace ace Cheslin Kolbe, but the Boks recovered and snuffed out the danger.\n\nFukuoka is due to retire after the World Cup to seek a career in medicine, but the 27-year-old boasts the fastest feet in the Far East and would be a huge loss to the world game should he hang up his boots prematurely.\n\nSouth Africa could only take a 5-3 lead into the interval but eventually ground down the hosts after that break.\n\nPollard slotted three from four penalty attempts as Rassie Erasmus' side inched their way to victory.\n\nJapan players and fans celebrate Yu Tamura's penalty in the first half which brought them to within two points of South Africa\n\nThree Handre Pollard penalties after half-time helped South Africa build a more comfortable 11-point cushion\n\nJapan battled well against South Africa but could not break down the two-time world champions in Tokyo\n\nFollowing stunning wins over Ireland and Scotland, Japan supporters were hoping for another upset against South Africa\n\nAnd when De Klerk scampered over after that stunning driving maul, the match was over with a quarter-hour still on the clock.\n\nMapimpi still had time to blast clear and home for his second of the night, to close the game in style.\n\nAnd so Japan's adventure came to a gruelling close not befitting with the audacious attacking elan that so lit up this tournament.\n\nBut even in defeat they can hold heads high and look to a big future.\n\nThe Boks meanwhile will be very seriously eyeing a third world title.", "description": "CHIEF SPORTS WRITER - MARTIN SAMUEL IN TOKYO: South Africa cruised into the Rugby World Cup semi-final after a thrilling second half performance saw them dump out  Japan in Tokyo.", "authors": ["Nick Purewal", "Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/13/19956010-0-image-a-2_1571576077278.jpg", "published_at": "2019-10-20"}