{"pub": "cbc", "title": "Sports-no-CBC", "url": "https://cbc.ca/sports/tennis/canadians-third-round-us-open-tennis-1.5266938", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:02:30.456730+00:00", "text": "Canada's Bianca Andreescu defeated former world No. 1 Caroline Wozniacki of Denmark 6-4, 6-4 in third-round play at the U.S. Open on Saturday in New York.\n\nThe 19-year-old Thornhill, Ont., resident needed one hour 33 minutes to defeat the No. 19 seeded and former world No. 1 Wozniacki at Arthur Ashe Stadium.\n\nAndreescu will face American Taylor Townsend in the fourth round. Townsend, who upset No. 4-seed Simona Halep on Thursday, defeated Sorana Cirstea earlier Saturday to advance to the U.S. Open Round of 16 for the first time.\n\nAndreescu, the 15th seed at the final Grand Slam of the season, raced out to a 3-0 lead in the second set before Wozniacki stormed back to tie it.\n\nWATCH | Andreescu moves on to the Round of 16:\n\nMississauga's Bianca Andreescu knocked off former world No. 1 Caroline Wozniacki in straight sets 6-4, 6-4 to reach the 4th round of the U.S. Open. 1:28\n\nBoth players struggled to hold serve in the 51-minute second set that featured seven combined breaks. Andreescu took control by breaking Wozniacki for a 5-4 lead, then held serve to win it.\n\n\"It means a lot, because this is my best result in a Grand Slam. I'm really, really pumped,\" Andreescu said.\n\nMeanwhile, Denis Shapovalov of Richmond Hill, Ont., was ousted in the third round by No. 13 seed Gael Monfils of France.\n\nMonfils toppled Shapovalov 6-7, 7-6 (4), 6-4, 6-7, 6-3 in a match that went three hours and 34 minutes, with the Canadian committing 11 double faults and 64 unforced errors.\n\nWATCH | Shapovalov falls to Monfils in 3rd round:\n\nRichmond Hill's Denis Shapovalov was eliminated from the U.S. Open after falling to Gael Monfils in 5-sets 6-7, 7-6 (4), 6-4, 6-7, 6-3 2:10\n\nOn paper, it wasn't technically an upset, with Andreescu the higher-ranked of the two.\n\nBut Wozniacki has reached the U.S. Open singles final twice. And she has been a semifinalist on three other occasions.\n\nThen ranked No. 152, Andreescu made her first big splash back in January when she upset Wozniacki — then ranked No. 3 — in the second round of the WTA Tournament in Auckland, New Zealand.\n\nWozniacki was the first top-10 player Andreescu had ever faced, and only the second ranked inside the top 20.\n\nRemarkable season continues\n\nEight months later, now in the top 20 herself, the 19-year-old repeated that success.\n\n\"I think she played very well in January as well. I didn't know her back then,\" Wozniacki said. \"Obviously she's had a great year. A lot of the players know who she is. She's made a mark. She's won two big tournaments this year.\n\n\"I think if anything I wish I could have served better today. It wasn't as easy with the sun, obviously for both of us. Otherwise I think she's playing very well. She has a lot of shots in her game that she can pull out. I tried my best. I fought hard. That's it.\"\n\nWATCH | Osaka, Gauff share special moment at U.S. Open:\n\nAfter beating Coco Gauff in straight sets, Naomi Osaka asked the 15-year-old to join her post-match interview in a stunning display of sportsmanship and grace. 0:24\n\nAndreescu improved to 39-4 on her remarkable season with the win. She also improved to 2-0 against Wozniacki.\n\nAndreescu won their first career meeting in straight sets in a Round of 16 match at the season-opening tournament in Auckland, New Zealand.\n\nTownsend, an American qualifier ranked No. 116, advanced further than she's ever gone before in a Grand Slam by doing what she does best: serve and volleying, chipping and charging, and coming forward.\n\nShe came to the net 75 times, winning 47 of those points against the 106th-ranked Cirstea.\n\nTownsend came to the net 106 times in her three-set, second-round upset of Simona Halep.\n\nGauff, 15, falls to defending champ Osaka\n\nAmerican teenager Coco Gauff's second Grand Slam tournament has ended with a 6-3, 6-0 loss to defending champion Naomi Osaka in the third round.\n\nThe 15-year-old Gauff has generated all sorts of attention already by making it to the second week at Wimbledon in July and becoming the youngest woman to win two matches at Flushing Meadows since 1996.\n\nBut in this much-hyped match under the lights in Arthur Ashe Stadium against the top-seeded Osaka, Gauff often looked exactly like what she still is: an immensely talented player who is still learning her way at tennis' top level.\n\nShe served at up to 119 mph but also double-faulted seven times.\n\nShe overcame a slow start to get within 4-3 in the opening set but also then lost the last eight games.\n\nOsaka's advantages in age — she's 21 — and experience — she is a two-time major champion — played a role. As did her on-target power, which resulted in a 24-8 edge in winners.\n\nNadal advances\n\nMoving into the men's fourth round were three-time champion Rafael Nadal and 2014 title winner Marin Cilic, who are the only past Grand Slam champs in their half of the draw and now must face each other.\n\nCilic, the No. 22 seed, overcame his own 17 double-faults and withstood 40 aces from 14th-seeded American John Isner to win 7-5, 3-6, 7-6 (6), 6-4. With Isner and Tennys Sandgren losing Saturday, zero American men reached the fourth round.\n\nOther winners included No. 6 Alexander Zverev, No. 24 Matteo Berrettini and unseeded Andrey Rublev, who beat the ever-combustible Nick Kyrgios 7-6 (5), 7-6 (5), 6-3.", "description": "Canadian tennis sensation Bianca Andreescu advanced to the Round of 16 at the U.S. Open on Saturday with a 6-4, 6-4 victory over Carolina Wozniacki of Denmark at Arthur Ashe Stadium in New York.", "authors": ["The Canadian Press"], "top_image": "https://i.cbc.ca/1.5267014.1567273711!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/andreescu-bianca-190831-1180.jpg"}