{"pub": "businessinsider", "title": "A CEO who just raised $200 million from SoftBank refuses to run his business from Silicon Valley, where rents and talent are overpriced", "url": "https://businessinsider.com/why-softbank-backed-c2fo-is-not-in-silicon-valley-2019-8?r=rr", "language": "", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 09:02:55.525211+00:00", "text": "When you think of cities that double up as tech hubs, the usual suspects probably spring to mind: San Francisco, New York, Singapore, Tokyo. One less obvious place is Kansas City.\n\nStraddling the Kansas-Missouri border, the Kansas City metropolitan area is the home of C2FO, an online marketplace for invoice discounting that raised $200 million from SoftBank in August.\n\nC2FO lets suppliers offer up their invoices at a cheaper rate, allowing them to raise cash faster than if they waited for the client to pay up the full amount. Big businesses like Amazon, for example, use the service to pay some of its vendors faster but at a discounted rate.\n\nFor both Sandy Kemper, C2FO's founder and CEO, and Colin Sharp, the firm's senior vice president for the EMEA region, Kansas City may not be as integrated as Silicon Valley. Yet, in conversation with Business Insider, both said that Kansas offered several distinct advantages over California.\n\nKemper says a tech employee staying at the same firm for 2 years is normal in Silicon Valley but really constitutes 'abject failure'\n\nThe first major advantage is that talent, famously difficult to find and retain in Silicon Valley, sticks around for longer.\n\n\"We will soon have 300 people around the globe,\" said Kemper, referring to the number of employees at C2FO. Of those, he added, \"I think you could count the folks who have left us, who we wanted to keep, on the hands and toes of one person over the last 10 years.\"\n\nHe continued: \"I talk to my CEO and founder friends out in places like Silicon Valley, or to headhunters, about what they think is a successful placement. I literally had a headhunter tell me two weeks ago: 'It may be different for you in Kansas City, but here in Silicon Valley, when I talk to the other CEOs for whom I'm recruiting, I tell them that if a person stays for 24 months, that's a success.' That, to me, is not a success. That is abject failure, in my opinion.\"\n\nC2FO, a fintech that just raised $200 million from SoftBank, is located in the Kansas City metropolitan area. A G Baxter/Shutterstock\n\nThe low employee retention rate in Silicon Valley is something Sharp witnessed firsthand. He spent time earlier in his career in New York or Silicon Valley, whose working environments he describes as \"cutthroat.\" Sharp also said salary costs were a major drawback for Valley-based tech firms.\n\n\"All your money goes on salaries and buildings, rather than on investment into products,\" he said. \"And then, you get a name for yourself, and people poach your staff.\"\n\nThe pair's comments come as more startups and investors look outside Silicon Valley, thanks to prohibitive rent and talent costs. Steve Case, the former CEO of AOL and an investor, has said he's extremely bullish on the Midwest and has launched a $150 million fund focused on startups outside the usual hubs.\n\n'There's an amazing pool of engineers and data scientists in the area'\n\nSharp cited the Kansas City lifestyle and the talent pool in the area as major boons for tech firms.\n\nRead more: How C2FO's execs walked into a meeting with SoftBank with no pitchdeck, then landed $200 million within weeks\n\n\"In Kansas, apart from the culture of the company, it's a great way of life out there,\" he said. \"You and I will both be jealous of the properties that money can buy for reasonable sums of money.\" Sharp is based in London, one of the most expensive cities in the world. He described the lifestyle benefits of Kansas as \"immense.\"\n\nColin Sharp, C2FO's senior vice president for the EMEA region, described Kansas City as \"an amazing place to run a tech business.\" C2FO\n\n\"Then, there seems to be an amazing talent pool around the area,\" he added. \"There's an amazing pool of engineers and data scientists in the area, who make the company what it is today.\"\n\nIndeed, C2FO's success has made Kemper wary of the company becoming too \"myopic.\"\n\n\"We need to be careful not to be too internally focused, to make sure that we're opening up for lots of connections to other cities — whether it's what's going on in Columbus, or Austin, or Denver, or further afield in New York and California, and then globally,\" he said.\n\nKemper says Kansas City is witnessing a 'return of confidence' in entrepreneurialism not seen since its late-1800s heyday\n\nThe 54-year-old Kemper's decision to base C2FO in Kansas was not a purely commercial choice, either. Kemper has deep family connections to the state, with his family running what he said were the \"biggest banks in the United States west of the Mississippi\" in the late 1800s and early 1900s and even helping Henry Ford launch his car firm.\n\nKemper's great-grandfather was W.T. Kemper, a business magnate who was the head of a major banking family in the early 20th century.\n\n\"Kansas City was about as entrepreneurial a city as you were going to find in the whole world in 1870,\" Kemper said. \"All of the overland routes originated from Kansas City. The great families of the East Coast had all their cattle-processing operations here. They built massive empires based on the cattle business here in Kansas.\n\n\"[My family] financed all of that westward growth. We financed [Amadeo] Giannini when he started Bank of Italy, which later became Bank of America. When Henry Ford wanted a car loan, he called my great-grandfather and said, 'I'd like some money to be able to loan out cars.' My great-grandfather said, 'What's a car?'\"\n\nHenry Ford's motor group was partially financed by Kemper's Kansas City-based ancestors at the turn of the 20th century. http://en.wikipedia.org/wiki/File:Henry_ford_1919.jpg\n\nThanks to C2FO and others, Kemper thinks Kansas City is starting to recapture some of this old entrepreneurial spirit.\n\n\"We're beginning to see a return, frankly, of confidence embedded or demonstrated by great entrepreneurial successes, albeit some of these companies a little bit smaller than [C2FO],\" he said.\n\n\"I've never seen as much entrepreneurial growth as I have in Kansas City. I understand that it's actually quite a bit like what happened previously, over a century ago. Now, we're cycling back into that. A lot of it just has to do with confidence to get out there and pursue your dreams.\"", "description": "The C2FO executives Sandy Kemper and Colin Sharp told Business Insider why the SoftBank-backed fintech was based in Kansas, not Silicon Valley.", "authors": ["Charlie Wood"], "top_image": "https://amp.businessinsider.com/images/5d6791a72e22af0a9b642332-2732-1366.jpg"}