{"pub": "cnn", "url": "https://cnn.com/2019/10/06/asia/philippines-duterte-nerve-malfunction-intl-hnk/index.html", "downloaded_at": "2019-10-07 04:08:36.454895+00:00", "title": "Philippines President Duterte reveals he has a chronic neuromuscular disease", "language": "en", "text": "(CNN) Philippines President Rodrigo Duterte has revealed he has a chronic neuromuscular disease, the latest in a series of health problems for the 74-year-old leader.\n\nIn a speech in Moscow on Saturday, Duterte told a crowd of Filipinos living in the Russian capital he had myasthenia gravis, which he described as a \"nerve malfunction,\" reported CNN Philippines.\n\nAlthough there is no known cure, there are treatments available which allow people with the disorder to have a relatively high quality of life. Most people with the condition have a normal life expectancy, according to the institute.\n\nDuterte was in Russia for a five-day official visit aimed at strengthening ties with Moscow.\n\nHe made the comment after saying that he had wanted to make eye contact with a woman who he had sung a duet with, but wasn't able to as one of his eyes \"goes everywhere.\" Duterte, who is known for his controversial and bombastic remarks, has often made headlines for his comments about women\n\nIt's also not the first time the Philippines leader has made public acknowledgments of issues with his health.\n\nIn 2017, Duterte said he needed additional oxygen when sleeping, and earlier this year, he said he used sleeping pills. He has also admitted using fentanyl -- a synthetic opioid up to 50 times more powerful than heroin -- for pain relief in the past.\n\nCritics have called for greater transparency over the septuagenarian's health, such as by disclosing medical records or a regular medical bulletin on his conditions.", "description": "Philippines President Rodrigo Duterte has revealed he has a chronic neuromuscular disease, the latest in a series of health problems for the 74-year-old leader.", "authors": ["Julia Hollingsworth"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191006224013-rodrigo-duterte-1003-restricted-super-tease.jpg", "published_at": "2019-10-06"}