{"pub": "rt", "url": "https://rt.com/usa/471440-romney-secret-twitter-pierre-delecto", "downloaded_at": "2019-10-22 13:35:50.701480+00:00", "title": "Bot race! Mitt Romney admits he’s ‘Pierre Delecto,’ anon Twitter handle who ‘liked’ impeachment, never-Trumpers & Romney posts", "language": "en", "text": "Utah Senator Mitt Romney has come clean about running a secret anonymous Twitter handle – “Pierre Delecto” – which passive-aggressively dumped on Trump and other Republican rivals while puffing up Romney and his allies.\n\nMitt Romney is Pierre Delecto. Pierre Delecto is Mitt Romney. The ultra-wealthy Mormon senator, recently rumored to be testing the waters for yet another presidential run, admitted he was behind the nom de tweet on Sunday after telling an Atlantic reporter he had a secret account – “What do they call me, a lurker?” – created to monitor political conversation.\n\nMitt Romney and New Gingrich don't like each other. That is not news. Romney once called him a \"failed leader\" who \"resigned in disgrace.\" #PierreDelecto also does not care for Newt Gingrich, as demonstrated by his like of this tweet. 3/ pic.twitter.com/B8oCtzjA9j — Don Moynihan (@donmoyn) October 20, 2019\n\n“Pierre” mostly expressed himself through “likes” of other posts – he was a big fan of anything critical of Trump, especially the president’s Syria policy. He regularly “liked” Mitt Romney’s posts. When confronted with his alter ego – he had given enough clues for another reporter to track him down, apparently wanting to be caught – he responded “C’est moi,” and set @qaws9876 to private.\n\nThe account dates back to 2011. It followed a slew of never-Trump Republicans and Romney family members, but rarely tweeted… except occasionally in support of Romney.\n\nTwitter had a field day with the revelation, likening the odd pseudonym to “Carlos Danger,” the name disgraced Congressman Anthony Weiner used to send lewd photos to underage girls.\n\nWho would win in a fight: Pierre Delecto or Carlos Danger? pic.twitter.com/pbQJrlNwtJ — “spooky” roderick strong fan account (@meeeeeeeeeels) October 21, 2019\n\nFan accounts were made.\n\nSo many fake Pierre Delecto accounts to choose from but this one is the best: #PierreDelectopic.twitter.com/TL3DW8DLQS — Doug Bluecher (@DougBluecher) October 21, 2019\n\nSeveral people suggested they would dress as Romney’s alter ego for Halloween. But what would that look like?\n\n👀WOWSERS!!👀\n\n\n\nJust when you think you've seen everything...you find out #NeverTrumper Mittens has been a #Twitter#lurker since 2011!\n\n\n\nAn unassuming handle @qaws9876 but excellent stripper name ~ I never would have guessed!\n\n\n\nWell done, #PierreDelecto! 🕵️‍♂️ pic.twitter.com/Bti8xZtRGS — 🌴௹_Actually🌴 (@G_Actually) October 21, 2019\n\nRomney claimed to be “open to the idea that the president may need to be removed from the Oval Office,” but has shied away from directly cheering on impeachment, at least under his real name.\n\nAlso on rt.com With Clinton & Romney both rumored to be JOINING 2020 race, has politics gone the way of Hollywood?\n\nThink your friends would be interested? Share this story!", "description": "Utah Senator Mitt Romney has come clean about running a secret anonymous Twitter handle – “Pierre Delecto” – which passive-aggressively dumped on Trump and other Republican rivals while puffing up Romney and his allies.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5dadcfad20302730ab432a69.JPG", "published_at": "2019-10-22"}