{"pub": "marketwatch", "url": "https://marketwatch.com/story/mobile-banking-is-safer-than-your-neighborhood-bank-branch-heres-how-to-make-it-safer-2019-10-02", "downloaded_at": "2019-10-03 07:14:57.035488+00:00", "published_at": "2019-10-02", "title": "Mobile banking is safer than your neighborhood bank branch — here’s how to make it safer", "language": "en", "text": "I’ve mentioned before that doing your banking online is safer than going to an old-fashioned brick and mortar bank. Not because you’re going to be knocked over the head by a robber at a bank (although there were nearly 3,000 bank robberies in 2018 according to the FBI), but because of the breadcrumbs you might leave behind—deposit slips, for example—that are a gold mine for crooks who want to rip you off.\n\n“We always recommend online banking,” says Liz Loewy, co-founder and chief operating officer of EverSafe, a Bethesda, Md.-based firm that monitors bank and investment accounts, credit cards and credit data for clients.\n\nBut online banking, still relatively new, continues to carry a stigma. More than half of all Americans over the age of 35 say they have security concerns, according to a survey by Nielsen. The survey shows the older you are, the more concerned you’re likely to be.\n\nBut even though online banking is considered safer, it is not without risks, and there are some things you can do to make it even safer.\n\nHere are three key tips:\n\nPassword management. Aside from the obvious—no easy to hack passwords like “12345678” or even “password” (yes, some people actually do this)—you should have a different password for every website you visit regularly, especially for your banking app. That may mean too many passwords to remember, in which case you should use a password manager. CNET reviews the best ones here.\n\nUse double authentication. An added later of security means the bad guys can’t access your account if your password somehow gets stolen (more on passwords in a second). This is usually a text sent to your phone. But like anything sent through the air by your wireless carrier, text messages can be hijacked too. So without getting too deep into the weeds with the technical stuff, I’ll just say that you should use something called an “authenticator app.” I use “Google Authenticator,” which you can download from either the Apple App Store or the Android Google Play store. It’s free, and since codes it generates appear only on your phone and aren’t sent through the air, the security is even better.\n\nAvoid public wireless networks. Translation: don’t conduct any financial transactions at the coffee shop or even in a hotel room if you’re on the road. That respectable-looking guy sipping a latte 10 feet away may be scooping up your passwords and could later peer into your bank or brokerage account. Brian Reed, chief marketing officer of NowSecure, a mobile app security firm, tells The Wall Street Journal that you should either use your device’s cellular data or what’s called a “VPN,” or virtual private network that allows you to encrypt your traffic. This could be a bit complicated for a layman, so I suggest going to your mobile store and asking for help—and here is a more detailed primer. Here is some advice and recommendations from PCMagazine.\n\nLoewy admits that all this technology is challenging, even for younger, presumably more savvy users. “The user experience can be easier,” she admits, but based on decades as a federal prosecutor focusing on elder abuse, she reiterates that banking in person remains the greater vulnerability.\n\nGiven that senior citizens are among the fastest-growing segments of the U.S. population—one in 50 Americans is over the age of 85, and this will double by 2040—the technology can and must be better.\n\nAs this occurs, Loewy urges children or other relatives, along with caregivers, to assist in making sure that a senior citizen’s financial accounts are secure and monitoring them to ensure that they stay that way. “And not just bank accounts,” she says. “It’s everything: credit cards, retirement accounts trusts real estate, everything.”\n\nKeep in mind that no senior should ever entrust such security to any one person, even a loved one. The three biggest sources of financial fraud are the so-called “three Fs and a C:” Friends, family, fiduciary and caretakers. Seniors should always have, whenever possible, multiple pairs of eyes reviewing accounts to ensure their security and to keep an eye out for any unusual or unauthorized activity.", "description": "More seniors are banking online — follow these safety tips", "authors": ["Paul Brandus"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS496_boomer_ZG_20191002122236.jpg"}