{"pub": "realclearpolitics", "url": "https://nypost.com/2019/09/25/ukraine-transcript-is-like-a-lousy-sequel-to-russia-collusion-controversy", "downloaded_at": "2019-09-26 20:54:50.625168+00:00", "title": "Ukraine transcript is like a lousy sequel to Russia ‘collusion’ controversy", "language": "en", "text": "Well, the transcript is out, and it’s already clear that Biden-Ukraine is the even-lousier sequel to the ­already-lousy Russian “collusion” flick. As a narrative of supposed Trumpian corruption, this new version is dumber, less factually sound — and more likely to cause irreparable harm to the republic if Democrats press ahead with ­impeachment.\n\nYou would think that after spending more than two years promoting the debunked collusion theory, Democrats and their media allies would give up trying to undo the outcome of the 2016 election. But no. The liberal mind is stuck in a vicious loop, forcing the left to obsessively return to 2016, like those horror-movie ghosts who can’t help but return to the site of some great trauma.\n\nSo over the past week or so, liberals heaped Ukraine hysteria atop the vast manmade mountain of Russia hysteria. The Washington Post, the chief organ of the #Resistance, described the call between President Trump and “a foreign leader” as “so troubling that it prompted an official in the US intelligence community to file a formal whistleblower complaint.”\n\nWhy? Because the interaction with the foreign leader “included a ‘promise’ ” — gasp! What had Trump promised: America’s nuclear codes in exchange for the foreign leader spending a week at one of his golf resorts? Had he revealed “how the United States obtained sensitive information,” as the paper speculated?\n\nLater it was revealed that the ­interaction involved less strategic matters. Trump, we were told, had pushed the Kiev government to look into Hunter Biden’s role in a Ukrainian energy firm, work for which the princeling was paid $50,000 a month (nice work if you can get it). The “promise” sounded like there had been a tight quid pro quo — US aid to Kiev in return for embarrassing Trump’s leading ­rival via his son.\n\nWhy wait for transcripts and hearings when there are clicks and retweets to garner? The anti-Trump Democratic-media complex just knew the facts were sure to be catastrophic. The furor moved House Speaker Nancy Pelosi to announce a “formal” impeachment inquiry (whatever that is).\n\nThen came the transcript of the call between Trump and Ukraine’s President Volodymyr Zelensky. Trump’s enemies insist the document isn’t an actual transcript but a summary memorandum — even though it sure reads like Trump’s gloriously rambling syntax (“We all watched from the United States, and you did a terrific job. The way you came from behind, somebody who wasn’t given much of a chance, and you ended up winning easily. . . .”).\n\nThe transcript isn’t very long, and the bottom line is that there was no “promise,” contrary to all the reports supposedly drawing on the whistleblower’s complaint: At no point did Trump explicitly condition any action or assistance on the Ukrainians doing anything specific.\n\nEarly on, Trump does note that he has done much more to help the Russian-threatened Ukrainians than the Europeans have, which is true and admirable. Zelensky agrees and mentions purchasing more Javelin antitank missiles from the United States.\n\n“I would like you to do us a favor, though,” Trump replies, and it’s this single clause that the ­impeachment-now crowd has seized upon to suggest a quid pro quo. But the favor Trump asks for has nothing to do with the ­illustrious, handsomely compensated Hunter Biden.\n\nInstead, Trump asks Zelensky to probe Ukraine’s role in foreign interference in the 2016 election — a perfectly legitimate request in an area of bipartisan concern.\n\nLater, when it comes to the Hunter question, Trump seems ­legitimately concerned about corruption: “There’s a lot of talk about Biden’s son,” Trump grumbles, “that Biden stopped the prosecution and a lot of people want to find out about that, so whatever you can do with the Attorney General [William Barr] would be great. Biden went around bragging that he stopped the prosecution so if you can look into it. . . . It sounds horrible to me.”\n\nAnd that’s all true. As vice president, Biden did encourage Ukraine to fire a prosecutor who happened to be investigating the company on whose board his son happened to sit. Widespread graft being Ukraine’s biggest enemy ­after Russia — the country is one of the world’s most corrupt, according to Transparency International — how was it not legitimate for the US president to probe these matters with his Ukrainian counterpart?\n\nThat’s it. That’s really all the “there” in the call that set off this brouhaha. And it falls far short of a legitimate basis for removing a duly elected president.\n\nThe US Constitution gives the president vast discretion in the conduct of foreign affairs. Ours being a fallen world, that conduct has ever been grubby, though Trump has undoubtedly made it grubbier with his vulgar ways.\n\nBut if this call is enough to justify ­impeachment, it will become impossible for any president to act on the world stage. Democrats might want to ponder that before setting out to make Mike Pence president.\n\nSohrab Ahmari is The Post’s op-ed editor.", "description": "Well, the transcript is out, and it is already clear that Biden-Ukraine is the even-lousier sequel to the already-lousy Russian “collusion” flick.", "authors": ["September"], "top_image": "https://thenypost.files.wordpress.com/2019/09/donald-trump-24.jpg?quality=90&strip=all&w=1200", "published_at": "2019-09-25"}