{"pub": "yahoo", "url": "https://news.yahoo.com/protesters-bar-haitis-president-visiting-143251751.html", "downloaded_at": "2019-10-18 03:24:55.810087+00:00", "title": "Protesters bar Haiti's president from visiting historic site", "language": "en", "text": "During a funeral for two people killed in violence related to recent protests, mourners restrain a woman related to one of the victims after she went into a trance at Champ de Mars park near the National Palace in Port-au-Prince, Haiti, Wednesday, Oct. 16, 2019. Funerals for 11 of at least 20 people killed were held in six cities, including the capital of Port-au-Prince, where at least two people were injured in a protest that broke out when presidential guards tried to block a road near where hundreds had gathered around the coffins of two victims. (AP Photo/Rebecca Blackwell)\n\nPORT-AU-PRINCE, Haiti (AP) — Haiti's embattled president was forced on Thursday to hold a private ceremony amid heavy security for what is usually a public celebration of one of the country's founding fathers.\n\nJovenel Moïse and other officials appeared at the National Pantheon Museum in downtown Port-au-Prince as hundreds of armed police officers closed down the surrounding area while protesters who demanded his resignation began to gather nearby.\n\n\"This is not how a government should be functioning,\" said Mario Terrain, who is 29 and unemployed. \"The president is in hiding.\"\n\nMoïse left after the brief ceremony to commemorate the death of Jean-Jacques Dessalines, whose rule ended in 1806 following a military revolt. Protesters had prevented Moïse from visiting Pont-Rouge, the site north of the capital where Dessalines was killed and where the ceremony is usually held.\n\nAnger over corruption, inflation and scarcity of basic goods including fuel has led to large demonstrations that began five weeks ago and have shuttered many businesses and schools. At least 20 people have been killed and more than 200 injured, including one man shot to death on Thursday in one protest. Witnesses said a group of protesters shot the man and injured another who was taken to the hospital when they tried to steal their belongings.\n\nThousands of protesters gathered in Port-au-Prince and clashed with police while a smaller crowd turned up at Pont-Rouge as they criticized Moïse.\n\n\"We dare the president to come,\" said 28-year-old Joel Theodore. \"It will be his last day in office.\"\n\nViolence also broke out in the towns of Leogane and Gressier west of Port-au-Prince, where protesters set fire to government buildings including a police station.\n\nThe president held a surprise press conference on Tuesday and said he would not resign as he once again urged unity and dialogue. Opposition leaders, however, said protesters would remain on the streets until he steps down.\n\nOn Thursday, Moïse answered only a couple of questions from reporters before leaving the museum.", "description": "PORT-AU-PRINCE, Haiti (AP) — Haiti's embattled president was forced on Thursday to hold a private ceremony amid heavy security for what is usually a public celebration of one of the country's founding fathers.  Jovenel Moïse and other officials appeared at the National Pantheon Museum in downtown", "authors": ["Evens Sanon"], "top_image": "https://s.yimg.com/uu/api/res/1.2/4bMEy7PSOnqCVEUTm2LqnQ--~B/aD0zMDYzO3c9NDU5MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/471609c78d890c3391673d83b1ce6e53", "published_at": "2019-10-17"}