{"pub": "heritage", "url": "https://heritage.org/markets-and-finance/commentary/refinance-us-debt-while-rates-are-low", "downloaded_at": "2019-09-05 07:06:26.941171+00:00", "title": "Refinance U.S. Debt While Rates Are Low", "language": "en", "text": "Today’s historically low interest rates on government bonds, along with the flattening of the yield curve, offer Uncle Sam a once-in-a-lifetime opportunity to lower his interest expenses by trillions of dollars over the next three decades. The savings could be large enough to pay for the entire Trump tax cuts and make them permanent.\n\nThe interest rate on 10-year Treasury notes is down to 1.5%, and rates on 30-year bonds have dropped below 2%. The biggest beneficiary of these low interest rates is the planet’s biggest debtor: the U.S. government, which has issued about $17 trillion in publicly held debt.\n\nTo put this in perspective, 10-year notes were paying more than 15% in 1981. It is scary to think how expensive it would become to pay down U.S. debt if rates jumped anywhere near that high again.\n\nThe Trump administration should take advantage of today’s bargain-basement borrowing costs by immediately refinancing the national debt. Millions of homeowners save hundreds of dollars a month by paying off their mortgages with new, lower-interest ones. For the U.S. government, the savings could be billions a month.\n\nThe Treasury should start issuing debt in much longer terms. This would lock in today’s low interest rates on the national debt for 10, 20, 30 years or perhaps even longer. The Journal reports that Japan, the U.K. and Austria are issuing “ultralong bonds” of 50 and even 100 years at interest rates as low as 1%.\n\nRefinancing would serve taxpayers well because debt-servicing costs are a massive and growing share of federal expenditures. The Congressional Budget Office predicts that interest on the debt will more than triple, from 1.8% of gross domestic product today to 5.7% in 30 years. Foreigners hold 40% of that debt, and their share is likely to increase.\n\nThe cost of paying off U.S. debt is set to increase for two reasons. The first, naturally, is that the government is expected to keep borrowing ever larger amounts. The second is that interest rates are likely to rise steadily in coming decades.\n\nThe flattening of the yield curve makes now a doubly advantageous time to refinance U.S. debt. Politicians have traditionally spurned converting debt to long-term bonds if it increases budget deficits in the short term—i.e., while they’re in office. Yet today the difference in interest rates between short- and long-term Treasurys has shrunk almost to zero, so the cost of converting is minimal.\n\nThe main point is that long-term rates today are well below the 4% and 5% the CBO predicts over 30 years. The budget office’s rule of thumb is that every percentage-point reduction in interest rates saves Uncle Sam more than $1.7 trillion over a decade. Refinancing the debt now could be one of the largest debt-reduction strategies ever implemented. And it would be almost painless.\n\nSome skeptics argue that low interest on government debt is more of a curse than a blessing because it makes spending and borrowing pain-free. But by this logic, Americans should wish for federal interest payments to be even higher than they are now. Fiscal hawks should continue to stress the importance of spending cuts, especially entitlement reform—but that’s no reason not to attack debt on another front by reducing interest costs.\n\nNo one can know how long interest rates will stay ultralow, but eventually they’ll rise. The smart move now is for the feds to go long. That would avoid the crisis scenario doomsayers have been worrying about for years: a moment when growing federal debt triggers a financial panic with rising interest rates and exploding payments, as happened in Greece, Puerto Rico and Venezuela. Refinancing the debt now would be a wise insurance policy.", "description": "Today’s historically low interest rates on government bonds, along with the flattening of the yield curve, offer Uncle Sam a once-in-a-lifetime opportunity to lower his interest expenses by trillions of dollars over the next three decades. The savings could be large enough to pay for the entire Trump tax cuts and make them permanent.", "authors": ["Stephen Moore", "Distinguished Visiting Fellow", "Stephen Moore Is The Distinguished Visiting Fellow For Project For Economic Growth At The Heritage Foundation."], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-09/GettyImages-144222121.jpg?itok=o-TXwkMO", "published_at": "2019-09-05"}