{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/zyus-signs-additional-cannabis-raw-material-supply-agreement", "downloaded_at": "2019-10-30 11:47:29.534261+00:00", "title": "ZYUS Signs Additional Cannabis Raw Material Supply Agreement", "language": "en", "text": "Definitive three-year agreement with Stevens Green further expands supply of high-grade cannabis raw material input for ZYUS’s medical cannabinoid-based therapeutics\n\nSASKATOON, Saskatchewan — ZYUS Life Sciences Inc. (“ZYUS”), a company focused on the global development and commercialization of innovative and patient-focused cannabinoid-based therapeutics, announced today that it has entered into a three-year supply agreement with 9869247 Canada Limited (“Stevens Green”) pursuant to which ZYUS will purchase high-grade bulk raw cannabis material cultivated and harvested at Stevens Green’s facility in Fort Erie, Ontario.\n\nSubject to ZYUS receiving a production license from Health Canada under the Cannabis Act, the receipt of which is expected in the near term, ZYUS intends to utilize the high-grade dried cannabis supplied by Stevens Green and other ZYUS approved suppliers as raw input material for processing into GMP-compliant, cannabinoid-based therapeutics.\n\nStevens Green is a licensed producer and private company based in Fort Erie, Ontario. Under the terms of the supply agreement, volumes supplied to ZYUS by Stevens Green during the first year of the agreement would be up to 1,000kg of dried product, expanding to a maximum of 10,000kg annually during the second and third years of the contract.\n\n“We are very pleased to be expanding our access to high-grade cannabis raw material from Stevens Green for processing in our proprietary GMP-designed production facility in Saskatoon,” said Brent Zettl, President and CEO of ZYUS. “Providing patients and their healthcare providers with access to a consistent supply of high-quality cannabis therapeutics, both domestically and internationally, is what will set ZYUS apart in the rapidly-growing global medical cannabis market. This supply agreement with Stevens Green strengthens ZYUS’ supply chain and is another important step for ZYUS in effectively producing high quality cannabinoid-based phyto-therapeutics.”\n\nAbout ZYUS Life Sciences Inc.\n\nZYUS is a Canadian-based life sciences company focused on the global development and commercialization of innovative cannabinoid-based therapeutics and product candidates. Through clinical research and IP development, we intend to deliver high-quality oils, gel-caps, topical creams and other cannabinoid-based therapeutics and product candidates to patients worldwide. At ZYUS, our vision is to elevate cannabinoids as a standard of care and expand the potential of medicine in pursuit of a transformational impact on patients’ lives. ZYUS: Advancing the Science of Well-Being.\n\nVisit www.zyus.com.\n\nForward-Looking Information\n\nThis news release contains forward-looking statements. Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of ZYUS to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. These forward-looking statements include, but are not limited to expectations with respect to our business plans and product lines.\n\nOften, but not always, forward-looking statements can be identified by the use of words such as “expects,” “expected,” “expectation,” “anticipates,” “believes,” “intends,” “estimates,” “predicts,” “continues,” “potential,” “targeted,” “plans,” “possible” and similar expressions, or statements that events, conditions or results “will,” “may,” “could,” “would” or “should” occur or be achieved, or the negative of these terms or other comparable terminology. Forward-looking statements are based on certain assumptions and are subject to various known and unknown risks and uncertainties, many of which are beyond the Company’s control, and cannot be predicted or quantified and consequently, actual results may differ materially from those expressed or implied by such forward-looking statements.\n\nAccordingly, readers should not place undue reliance on the forward-looking statements and information contained in this press release. Since forward-looking statements and information address future events and conditions, by their very nature they involve inherent risks and uncertainties.\n\nActual results could differ materially from those currently anticipated due to a number of factors and risks. Readers are cautioned that the foregoing list of factors is not exhaustive. The forward-looking statements contained in this news release are made as of the date of this release and, accordingly, are subject to change after such date. ZYUS does not assume any obligation to update or revise any forward-looking statements, whether written or oral, that may be made from time to time by us or on our behalf, except as required by applicable law.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191030005120/en/\n\nContacts\n\nBruce M. Mann\n\nZYUS Investor Relations and Corporate Communications\n\nbruce.mann@zyus.com\n\n1.416.271.2025", "description": "Definitive three-year agreement with Stevens Green further expands supply of high-grade cannabis raw material input for ZYUS’s medical cannabinoid-based therapeutics SASKATOON, Saskatchewan — ZYUS Life Sciences Inc.", "authors": [], "top_image": "https://mms.businesswire.com/media/20191030005120/en/736471/3/zyus_logo.jpg", "published_at": "2019-10-30"}