{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/sportsnews/article-7600531/Man-Utd-ban-fan-racially-abused-Trent-Alexander-Arnold-life.html", "downloaded_at": "2019-10-22 15:18:28.928419+00:00", "title": "Manchester United ban fan who racially abused Liverpool's Trent Alexander-Arnold for life", "language": "en", "text": "United managed to identify the supporter against their season ticket database\n\nManchester United have identified and banned the supporter who allegedly hurled racist abuse at Liverpool's Trent Alexander-Arnold.\n\nThe supporter was marched out of the stadium after claims they shouted 'you f***ing black ****' at the 21-year-old England right back during Sunday's 1-1 draw.\n\nUnited immediately launched an investigation and scoured CCTV to trace the fan involved.\n\nA fan who racially abused Trent Alexander-Arnold has been given a lifetime ban by Man United\n\nSecurity marched the fan out after claims they shouted 'you f***ing black ****' at the Liverpool star (no one pictured here is the person involved)\n\nThey managed to identify the supporter against their season ticket database and have now written to them to inform them that they have been given an indefinite ban. The fan can appeal the punishment.\n\nIt is understood that the incident took place during the first half of the match close to the players' executive boxes in the Stretford End and was met with a furious reaction from those close by.\n\nGreater Manchester Police have been made aware of the situation and are looking into what happened.\n\nAlexander-Arnold pictured during Sunday's draw (no one pictured is the person in question)\n\nA Manchester United spokesperson said: 'Racism and all forms of discrimination are completely unacceptable and do not reflect the values of our club.\n\n'Following our investigation into the alleged incidence of racist abuse on Sunday, we have issued an indefinite ban to the individual involved.\n\n'This individual is not welcome at Old Trafford and we want to reinforce that we will continue to take strong action against anyone who we identify has engaged in racist or discriminatory abuse, either online or at our matches.'", "description": "Manchester United have handed a season-ticket holder who they claim is the person that hurled racist abuse at Trent Alexander-Arnold during their draw with Liverpool an indefinite ban.", "authors": ["Mike Keegan For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/14/19995026-0-image-a-31_1571749445327.jpg", "published_at": "2019-10-22"}