{"pub": "politico", "url": "https://politico.com/story/2019/09/18/kamala-harris-iowa-poll-support-plunged-1501812", "downloaded_at": "2019-09-18 23:22:41.091871+00:00", "title": "New poll finds Harris’ support has plunged 13 points in Iowa", "language": "en", "text": "Kamala Harris now sits at sixth place in the Iowa polls. | Justin Sullivan/Getty Images 2020 elections New poll finds Harris’ support has plunged 13 points in Iowa\n\nKamala Harris’ support is plunging in Iowa, where she’s seen a 13-point drop since July, according to a new poll.\n\nNotably, the survey, commissioned by Focus on Rural America and taken after the third presidential debate in Houston, was conducted by Harris’ chief pollster, David Binder.\n\nStory Continued Below\n\nIn July, after a breakout debate in Miami, Harris was statistically tied with Elizabeth Warren and Joe Biden for first place in the state.\n\nThe new survey, conducted Sept. 14-17, shows Harris sliding into sixth place at 5 percent, with Biden at 25 percent retaking the lead he lost over the summer. Harris recently embarked on a statewide bus tour and was the first in the field to run ads in Iowa. The Harris campaign did not immediately respond to a request for comment.\n\nThe former vice president is statistically tied with Warren, who is at 23 percent. Pete Buttigieg, meanwhile, moved into third place, with 12 percent of those surveyed saying they’d back him for president.\n\nBiden’s 8-point gain since July is a sign he’s rebuilding the losses he’s faced in the first-in-the-nation primary caucus state as he struggled to catch up organizationally with Warren, who began laying down infrastructure in the state in January. Biden has ramped up his visits to Iowa and increased his level of staffing to become one of the largest campaign organizations on the ground. Warren though, has steadily gained support and is widely considered to have the best organization statewide.\n\n“At this stage, the race is still fluid but it’s also very close,” said Jeff Link, co-founder of Focus on Rural America. “Once again, organization matters. It will be imperative for Biden to match the Warren organization to maintain this lead. And, rural counties could make the difference because they are harder to organize. That’s why taking Trump to task on biofuels and standing up to Big Oil could tip the scales.”\n\n", "description": "In July, Harris was tied with Elizabeth Warren and Joe Biden for first place in the state.", "authors": ["Natasha Korecki"], "top_image": "https://static.politico.com/b2/66/4a9fb109470f860416b2c9c5da8c/190918-kamala-harris-gty-773.jpg", "published_at": "2019-09-18"}