{"pub": "nymag", "title": "No Prison Time for Ex-Cops Accused of Raping a Teen in Custody", "url": "https://thecut.com/2019/08/nypd-cops-get-probation-for-having-sex-with-teen-in-custody.html", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:07:17.695367+00:00", "text": "Eddie Martins and Richard Hall, the former NYPD detectives who admitted to having sex with a teen in their custody, won’t serve any time. Photo: Spencer Platt/Getty Images\n\nA pair of ex-NYPD detectives who admitted to having sex with a teenager in their custody are walking away from the case with five years’ probation, rather than prison sentences.\n\nOn Thursday, Eddie Martins and Richard Hall pleaded guilty to 11 charges — including bribery and official misconduct, but not rape or sexual assault — in a quiet deal that the New York Post reports appears to have been kept under wraps deliberately. Initially, the former cops faced over 40 charges stemming from a 2017 incident in which they allegedly abused an 18-year-old who goes by the social media pseudonym Anna Chambers. Martins and Hall reportedly stopped Chambers in Brooklyn’s Calvert Vaux Park, where she was sitting in a car with two friends. After they found Klonopin and marijuana in the vehicle, Chambers said, the detectives handcuffed her, put her in a van, and took turns raping her while they drove around.\n\nA subsequent rape kit recovered DNA from both Martins and Hall, who admitted to having sex with Chambers, but maintained it was consensual. They resigned when they were indicted, but at the time, it was still technically legal for New York police officers to have sex with people in their custody. While Chambers’s case did catalyze a policy change, it came too late. Defense attorneys hammered on apparent inconsistencies in her story: She repeatedly told investigators that she had been wearing a skirt on the night of the attack, when in fact she was wearing track pants; she recalled a very specific driving route and named distinct landmarks, but the cell-tower data didn’t fit. And then, it emerged that an assistant district attorney in the Brooklyn DA’s office had been having an affair with Hall.\n\nFaced with an increasingly complex case, the DA subsequently downgraded the charges in March, citing “unforeseen and serious credibility issues” while still asking that Martins and Hall do prison time. Instead, they received probation.\n\nFuck the justice system lmfaooo shits a joke — Anna Chambers (@annaaachambers) August 29, 2019\n\nOn Thursday, Chambers tweeted criticism of the justice system (“shits a joke”), while her attorney told Gothamist that they’re “outraged” over the decision.\n\n“If you’re arrested and kidnapped in a van with two large officers with guns, there’s no consent. They’re getting away with rape,” Michael David, who is representing Chambers in her civil suit against the city, said. “It sends a horrible message to victims of police sexual misconduct.”\n\nStay in touch. Get the Cut newsletter delivered daily Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "Two ex-NYPD detectives, Eddie Martins and Richard Hall, admitted to having sex with a teen in their custody in 2017. Anna Chambers says they raped her repeatedly, but “credibility issues” meant the charges were downgraded and the cops will walk free.", "authors": ["Claire Lampen"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/08/30/30-nypd-anna-chambers.w1200.h630.jpg"}