{"pub": "japantoday", "url": "https://japantoday.com/category/world/us-official-says-is-leader-believed-dead-in-us-raid-in-syria", "downloaded_at": "2019-10-28 00:28:56.820452+00:00", "title": "Trump says U.S. forces cornered IS leader in dead-end tunnel", "language": "en", "text": "This 2014 image made from video posted on a militant website in 2014, purports to show the leader of the Islamic State group, Abu Bakr al-Baghdadi, delivering a sermon at a mosque in Iraq during his first public appearance.\n\nBy ZEKE MILLER, DEB RIECHMANN and ROBERT BURNS\n\nAbu Bakr al-Baghdadi , the shadowy leader of the Islamic State group who presided over its global jihad and became arguably the world's most wanted man, died after U.S. special operators cornered him during a raid in Syria, President Donald Trump said Sunday.\n\n\"Last night, the United States brought the world's No. 1 terrorist leader to justice,\" Trump announced at the White House, providing graphic details of al-Baghdadi's final moments at the helm of the militant organization. \"Abu Bakr al-Baghdadi is dead.\"\n\nIn a national address, Trump described the nighttime airborne raid in Syria's northwestern Idlib province, with American special operations forces flying over heavily militarized territory controlled by multiple nations and forces. No U.S. troops were killed in the operation, Trump said.\n\nThe death of al-Baghdadi was a milestone in the fight against IS, which brutalized swaths of Syria and Iraq and sought to direct a global campaign from a self-declared \"caliphate.\" A yearslong campaign by American and allied forces led to the recapture of the group's territorial holding, but its violent ideology has continued to inspire attacks.\n\nAs U.S. troops bore down on al-Baghdadi, he fled into a \"dead-end\" tunnel with three of his children, Trump said, and detonated a suicide vest, killing himself and the children. \"He was a sick and depraved man, and now he's gone,\" Trump said. \"He died like a dog, he died like a coward.\"\n\nAl-Baghdadi's identity was confirmed by a DNA test conducted onsite, Trump said.\n\nTrump had teased a major announcement late Saturday, tweeting that \"Something very big has just happened!\" By the morning, he was thanking Russia, Turkey, Syria and Iraq, as well as Kurdish fighters in Syria for their support.\n\nThe operation marks a significant foreign policy success for Trump, coming at one of the lowest points in his presidency as he is mired in impeachment proceedings and facing widespread Republican condemnation for his Syria policy.\n\nThe recent pullback of U.S. troops he ordered from northeastern Syria raised a storm of bipartisan criticism in Washington that the militant group could regain strength after it had lost vast stretches of territory it had once controlled. Trump said the troop pullout \"had nothing to do with this.\"\n\nPlanning for the operation began weeks ago, Trump said, after the U.S. gained unspecified intelligence on al-Baghdadi's whereabouts. Eight military helicopters flew for more than an hour over territory controlled by Russian and Syrian forces, Trump said, before landing under gunfire at the compound.\n\nTrump vividly described the raid and took extensive questions from reporters for more than 45 minutes Sunday. He said U.S. forces breached the walls of the building because the doors were booby-trapped and chased al-Baghdadi into the tunnel, which partially collapsed after al-Baghdadi detonated the suicide vest. Many homes in Syria, which has been riven by civil war since 2011, have subterranean tunnels or shelters from the fighting.\n\nTrump also revealed that U.S. forces spent roughly two hours on the ground collecting valuable intelligence. The Syrian Observatory for Human Rights said Sunday that the U.S.-led Coalition launched at least one airstrike in western Aleppo aimed at Abu Hassan al-Muhajer, an aide to al=Baghdadi.\n\nTrump said he watched the operation from the White House Situation room as it played out live \"as though you were watching a movie.\" Trump suggested he may order the release of the video so that the world knows al-Baghdadi did not die of a hero and spent his final moments \"crying, \"whimpering\" and \"screaming.\"\n\nTrump approved the operation Saturday morning after receiving \"actionable intelligence,\" Vice President Mike Pence told CBS' \"Face the Nation.\"\n\nTrump had spent Friday night at Camp David and flew by helicopter Saturday morning to golf at his private Virginia club. He then returned to the White House.\n\nTrump said he teased the announcement as soon as American forces landed safely in a third-country. An Iraqi security official confirmed the U.S. aircraft took off from the Al-Asad air base in western Iraq, where Trump visited American forces in December.\n\nTrump said he did not follow convention in informing leaders on Capitol Hill, including House Speaker Nancy Pelosi, D-Calif., before the raid, saying he was fearful of leaks.\n\nPelosi said the House \"must be briefed on this raid, which the Russians but not top congressional leadership were notified of in advance, and on the administration's overall strategy in the region.\"\n\nDefense Secretary Mark Esper said the mission was to capture or kill the IS leader. While Trump had initially said no Americans were injured, Esper said two service members suffered minor injuries but have already returned to duty. Sen. Lindsey Graham, R-S.C., said a military dog chasing al-Baghdadi was seriously wounded by an explosive blast.\n\nIn his address from the White House, Trump suggested that the killing of al-Baghdadi was more significant than the 2011 operation ordered by his predecessor, President Barack Obama, that killed al-Qaeda leader Osama bin Laden, who was responsible for the 9/11 attacks. Trump later repeated a false claim that he predicted the threat posed by bin Laden in a book before the 2001 attacks.\n\nHe also praised Russia and the Syrian government — American foes — and defended his ban on entry to the U.S. from some Muslim-majority countries. He called European allies \"a tremendous disappointment\" for not repatriating foreign IS fighters.\n\nTrump's national security adviser, Robert O'Brien, said al-Baghdadi's remains would be dealt with in accordance with Islamic law and buried at sea in the same way that bin Laden's were.\n\nPraise for the military operation was swift, coming from American allies and even the president's political opponents. In congratulating the U.S. forces and intelligence officials, but not Trump, former Vice President Joe Biden warned that IS \"remains a threat to the American people and our allies.\"\n\nBut one counterterrorism expert said al-Baghdadi's death is not the end of IS.\n\n\"Counterterrorism must be part of the strategy, but reducing the strategy to just special operations raids and drone targeting, as this administration seems to want to, guarantees a forever war,\" said Katherine Zimmerman of the American Enterprise Institute. She said extremists' strength and staying power lies in the support they have locally among the disenfranchised and economically deprived populations.\n\nAl-Baghdadi's presence in the village a few kilometers from the Turkish border was surprising, even if some IS leaders are believed to have fled to Idlib after losing their last sliver of territory in Syria to U.S.-allied Kurdish forces in March.\n\nIraqi officials said Sunday they passed information that helped ascertain al-Baghdadi's whereabouts to the U.S. from the wife of an Iraqi aide to al-Baghdadi, as well as al-Baghdadi's brother-in-law, who was recently arrested by the Iraqis. The officials weren't authorized to publicly discuss intelligence operations and spoke on condition of anonymity.\n\nAl-Baghdadi had led IS for the last five years, presiding over its ascendancy as it cultivated a reputation for beheadings and attracted tens of thousands of followers to a sprawling and self-styled caliphate in Iraq and Syria. He remained among the few IS commanders still at large despite multiple claims in recent years about his death and even as his so-called caliphate dramatically shrank, with many supporters who joined the cause either imprisoned or jailed.\n\nHis exhortations were instrumental in inspiring attacks in the heart of Europe and in the United States. Shifting away from the airline hijackings and other mass-casualty attacks that came to define al-Qaida, al-Baghdadi and other IS leaders supported smaller-scale acts of violence that would be harder for law enforcement to prepare for and prevent.\n\nThey encouraged jihadists who could not travel to the caliphate to kill where they were, with whatever weapon they had at their disposal. In the U.S., multiple extremists have pledged their allegiance to al-Baghdadi on social media, including a woman who along with her husband committed a 2015 massacre at a holiday party in San Bernardino, California.\n\nWith a $25 million U.S. bounty on his head, al-Baghdadi was far less visible in recent years, releasing only sporadic audio recordings, including one just last month in which he called on members of the extremist group to do all they could to free IS detainees and women held in jails and camps.\n\nThe purported audio was his first public statement since last April, when he appeared in a video for the first time in five years. In that video, which included images of the extremist leader sitting in a white room with three others, al-Baghdadi praised Easter Day bombings that killed more than 250 people and called on militants to be a \"thorn\" against their enemies.\n\n© Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Abu Bakr al-Baghdadi , the shadowy leader of the Islamic State group who presided over its global jihad and became arguably the world's most wanted man, died after U.S. special operators cornered him during a raid in Syria, President Donald Trump said Sunday. \"Last night, the United States brought the…", "authors": ["Burning Bush", "Vince Black", "Norman Goodman"], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/76/60/c9a6d8c26ce53432a26efcd91576ff62c77d/urn:publicid:ap.org:8b03b63da2f744abbd4ff22ee0e28276.jpg", "published_at": "2019-10-27"}