{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7566361/DUP-deputy-leader-warns-mooted-Brexit-compromise-work.html", "downloaded_at": "2019-10-12 17:50:32.899558+00:00", "title": "DUP deputy leader warns mooted Brexit compromise...", "language": "en", "text": "The DUP has poured cold water over a reported Brexit compromise to end the deadlock over the Northern Ireland backstop.\n\nDeputy leader Nigel Dodds warned the mooted plan – reportedly being discussed by EU and UK officials in Brussels – “cannot work”.\n\nReports from the Belgian capital claimed Boris Johnson has sought to revive a proposal first put forward by Theresa May for a customs partnership between the UK and the EU.\n\nThe scheme, intended to avoid the need for customs controls on the island of Ireland, would see Northern Ireland remain politically in a customs union with the EU but it would be administered by the UK.\n\nHowever Mr Dodds – whose party’s votes will almost certainly be needed to get a Brexit deal through Parliament – told the Italian La Repubblica newspaper that Northern Ireland “must stay in a full UK customs union, full stop”.\n\n“It cannot work because Northern Ireland has to remain fully part of the UK customs union,” he said.\n\nHe added: “There is a lot of stuff coming from Brussels, pushed by the Europeans in the last hours, but one thing is sure: Northern Ireland must remain fully part of the UK customs union. And Boris Johnson knows it very well.”\n\nBritish officials have so far remained tight-lipped in the face of the reports.\n\nThe reported plan would create a customs border in the Irish Sea with goods travelling from the rest of the UK to Northern Ireland being subject to tariffs which Britain would collect on behalf of the EU.\n\nBusinesses would then be able to claim a rebate once they had shown the goods were for consumption in the UK market.\n\nHowever it would mean that Northern Ireland would be able to benefit from any post-Brexit trade deals the UK struck with other countries around the world.\n\nPrime Minister Boris Johnson refused to say whether he had offered a compromise (Alastair Grant/PA)\n\nSpeaking during a school visit on Friday, Mr Johnson repeatedly refused to say whether he had offered any concessions on the issue of the customs union.\n\nHe stressed however that he would not accept anything that “damages the ability of the whole of the United Kingdom to take full advantage of Brexit”.\n\nTalks have been continuing in Brussels after the EU’s chief negotiator Michel Barnier gave the green light on Friday for intensive discussions between officials to start.\n\nIt followed apparent progress in talks on Thursday between Mr Johnson and his Irish counterpart Leo Varadkar at a country house retreat on the Wirral.\n\nTheir discussions appeared to unblock the negotiations which had seemed to have been running into the ground following the publication of Mr Johnson’s Brexit blueprint.\n\nThe Prime Minister cautioned it was not a “done deal” and there was still “a way to go” if they were to get an agreement which would enable Britain to leave on October 31, as he has promised.\n\nMr Barnier is due to brief EU ambassadors and MEPs on Monday on progress – but time is rapidly running out if they are to get an agreement in place in time for EU leaders to sign off on it at next week’s Brussels summit.", "description": "Nigel Dodds says Boris Johnson `knows very well´ Northern Ireland must remain fully part of the UK customs union.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/18/wire-19632258-1570901925-611_636x382.jpg", "published_at": "2019-10-12"}