{"pub": "reuters", "url": "https://in.reuters.com/article/cricket-test-ind-zaf-toss/cricket-india-lose-rohit-early-in-cautious-start-to-second-test-idINKBN1WP0D6", "downloaded_at": "2019-10-10 06:56:07.303553+00:00", "title": "Cricket: India lose Rohit early in cautious start to second test", "language": "en", "text": "MUMBAI (Reuters) - India lost Rohit Sharma cheaply during a difficult opening spell from South Africa’s fast bowlers but weathered the storm to reach 77 for one at lunch in the second test at Pune on Thursday.\n\nOpener Mayank Agarwal was unbeaten on 34 while Cheteshwar Pujara was 19 not out at the break for the hosts, who lead the three-test series 1-0.\n\nBoth teams added a fast bowler to their sides from the opening test at Visakhapatnam, which India won by 203 runs, with the surface at Pune looking harder and sporting a tinge of grass cover.\n\nSouth Africa’s pacemen challenged the Indian batsmen during an inspired opening spell after Virat Kohli won the toss and chose to bat in his 50th test as captain.\n\nRohit, after enjoying the highs of twin hundreds in his maiden test as an opener at Visakhapatnam, faced a much more potent opposition on a surface offering movement.\n\nKagiso Rabada bowled his heart out without success until he managed to induce an edge behind the wicket from Rohit, who looked solid during his innings of 14.\n\nRohit’s opening partner Agarwal, who also hit a century in the opening test, appeared more shaky at the start and survived a close leg before appeal off seamer Vernon Philander.\n\nHe also had problems against short-pitched deliveries and was hit on the back of his helmet by fast bowler Anrich Nortje but that blow seemed to wake him from his slumber.\n\nThe 28-year-old, playing his sixth test match, hit the same bowler for three exquisite off-driven boundaries in an over that seemed to kickstart his innings.\n\nPujara had an usually slow start and hit Rabada straight to Temba Bavuma at short leg before he had opened his scoring but the fielder failed to hold on to the sharp chance.\n\nThe number three batsman got off the mark on the 13th ball he faced but grew in confidence as his innings progressed. He welcomed left-arm spinner Keshav Maharaj with two consecutive fours in his first over as the pitch eased out for the batsmen.\n\nIndia drafted in Umesh Yadav for spin-bowling all-rounder Hanuma Vihari in their side while South Africa handed Nortje, 25, a test debut, replacing off-spinner Dane Piedt.", "description": "India lost Rohit Sharma cheaply during a difficult opening spell from South Africa's fast bowlers but weathered the storm to reach 77 for one at lunch in the second test at Pune on Thursday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-10"}