{"pub": "mirror", "url": "https://mirror.co.uk/science/octopus-tries-steal-divers-camera-20721511", "downloaded_at": "2019-10-25 16:45:16.453426+00:00", "title": "Octopus tries to steal diver's camera in hilarious underwater tug-of-war", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA diver in France was in for a surprise during a recent expedition, after an octopus tried to steal his camera.\n\nDiver Eric Desmet was diving in the French Riviera in June, when he came across a young octopus.\n\nWanting to save the moment, Mr Desmet set up his camera, but it seemed the young octopus wasn’t in the mood to be caught on cameras.\n\nThe octopus grabbed onto the camera, sparking a rather hilarious tug-of-war between the diver and eight-legged animal.\n\nMr Desmet said: “While posting a camera to film a young octopus I got a surprise to see him going straight on to the camera and try to take it with him.\n\n(Image: ViralHog)\n\n(Image: ViralHog)\n\n“I tried several times to get it back slowly with no result so I have been waiting for a while, thinking he will have had enough soon, but he kept trying to swim away with it.”\n\nThankfully, the octopus eventually let go of the camera, and Mr Desmet was able to swim away with it.\n\nThis isn’t the first time a camera has attempted to steal a camera.\n\nBack in 2016 , a diver attempting to take a selfie with an octopus in Sydney Harbour got a surprise as the octopus tried to steal his GoPro.", "description": "Diver Eric Desmet was diving in the French Riviera in June, when he got into a tug-of-war with an octopus", "authors": ["Shivali Best", "Image", "Viralhog"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20721557.ece/ALTERNATES/s1200/0_Screen-Shot-2019-10-25-at-105952.jpg", "published_at": "2019-10-25"}