{"pub": "independent", "url": "https://independent.co.uk/voices/joe-biden-2020-campaign-democratic-candidates-pacs-bernie-sanders-trump-a9171861.html", "downloaded_at": "2019-10-25 22:23:12.909571+00:00", "title": "Joe Biden's campaign isn't going so well — but the ideas to fix it are even worse", "language": "en", "text": "In a recent statement, Joe Biden’s deputy campaign manager, Kate Bedingfield, cited the behavior of President Donald Trump and his allies for their reason to reverse a self-imposed ban on accepting help from a super PAC.\n\n“Donald Trump has decided that the general election has already begun,” Bedingfield wrote. “He and his allies are already spending massive amounts of money on paid television and digital advertising to intervene directly in Democratic primaries with the goal of preventing Joe Biden, the opponent that Trump fears most, from becoming the Democratic nominee.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nLet her tell it: “In this time of crisis in our politics, it is not surprising that those who are dedicated to defeating Donald Trump are organizing in every way permitted by current law to bring an end to his disastrous presidency.”\n\nAnd then, of course, this line: “Nothing changes unless we defeat Donald Trump.”\n\nBedingfield’s choice of words belies the true motivation of this shift: it is not borne out of strategy, but necessity. And much like the man he seeks to replace, Joe Biden is faulting someone else for his decision to flip-flop.\n\nBiden was correct when he previously opined about the ills of super PACs. During an appearance on PBS NewsHour in 2018, he claimed to have told Bernie Sanders not to create a super PAC during his 2016 run. “I’m the guy that told him, you shouldn’t accept any money from a super PAC, because people can’t possibly trust you. How will a middle-class guy accept you if you accept [that] money?” he said.\n\nYes, how will they, “Middle Class Joe?”\n\nBut it seems that the Biden campaign is cash-strapped, reportedly entering the month of October with only $9 million in the bank — far less than many of his leading rivals. Although he is drawing more money from rich donors than any other candidate, Biden lags significantly behind his competitors in terms of individual donors.\n\nIn reaction to Uncle Joe’s pleas for the plutocrats to save his fledgling operation, Faiz Shakir, Bernie Sanders’ campaign manager, said via statement: \"Let’s be clear, super PACs exist for one reason and one reason only: to help billionaires and corporations bankroll a presidential campaign with unlimited amounts of money, in exchange for favors. Every Democratic candidate should forcefully reject any help from super PACs —and they should tell their supporters and surrogates to stop engaging with super PACs that aim to buy elections and undermine our democracy.”\n\nAlthough she didn’t cite Biden by name, Elizabeth Warren wrote on Twitter: “It’s disappointing that any Democratic candidate would reverse course and endorse the use of unlimited contributions from the wealthy to run against fellow Democrats. A handful of wealthy donors should not be allowed to buy the Democratic nomination. That’s not who we are.”\n\nAlthough Biden may be burning cash on private jets, select national polls point to the enduring affinity Democratic voters have with him. Nevertheless, his inability to produce the sort of campaign that inspires and resonates with the masses speaks to what’s always been his larger issue: he has never been good at running for president. People can imagine Joe Biden as president, sure— but merely looking presidential in the media won’t get people fired up. And if you can’t get fired up, you are using that extra cash on something like a pedicure (because you deserve it) and not Biden’s stumbling bid for the presidency.\n\nThe campaign is going so badly that there are now reports of the Democrat donor class experiencing enough anxiety to think about putting up other candidates. It’s early in the race, after all, and maybe Joe isn’t going to make it. Folks like Hillary Clinton, John Kerry, Michael Bloomberg, Eric Holder, Deval Patrick and Sherrod Brown are apparently considering jumping in. To which I say: please, just leave us alone.\n\nWho wants to endure another Trump-versus-Clinton campaign? Doesn’t that sound so painful? Let Hillary spend her time trolling Republicans (because she deserves that).\n\nShape Created with Sketch. The Democrat challengers to Trump in 2020 Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The Democrat challengers to Trump in 2020 1/22 Bernie Sanders The Vermont senator has announced that he will be running again in 2020 after losing out to Hilary Clinton in the 2016 Democratic primaries. He intends to run on a similar platform of democratic socialist reform Getty 2/22 Joe Biden The former vice president - poised to be a frontrunner - has announced his run. He recently faced scrutiny for inappropriate touching of women, but was thought to deal with the criticism well EPA 3/22 Elizabeth Warren The Massachusetts Senator has formally launched her bid for president in 2020. A progressive Democrat, she is a major supporter of regulating Wall Street. Reuters 4/22 Bill De Blasio The New York mayor announced his bid on 16 May 2019. He emerged in 2013 as a leading voice in the left wing of his party but has struggled to build a national profile and has suffered a number of political setbacks in his time as mayor AFP/Getty 5/22 Pete Buttigieg The Indiana mayor and war veteran will be running for president. If elected, he would be the first openly LGBT+ president in American history Getty 6/22 Beto O'Rourke The former Texas congressman formally launched his bid for the presidency in March. He intends to run on a progressive platform, stating that the US is driven by \"gross differences in opportunity and outcome\" AP 7/22 Steve Bullock The Montana governor announced his bid on 14 May. He stated \"We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people's voice, so we can finally make good on the promise of a fair shot for everyone.\" He also highlighted the fact that he won the governor's seat in a red [Republican] state Reuters 8/22 Cory Booker The New Jersey Senator has announced that he will be running for the presidency in 2020. If he secures the nomination he said finding a female vice president would be a priority Getty 9/22 Wayne Messam Mayor of the city of Miramar in the Miami metropolitan area, Wayne Messam has announced his bid. He intends to run on a progressive platform against the \"broken\" federal government. He favours gun regulations and was a signatory to a letter from some 400 mayors condemning President Trump's withdrawal from the Paris Climate Accord Vice News 10/22 Kirsten Gillibrand The New York Senator formally announced her presidential bid in January, saying that “healthcare should be a right, not a privilege” Getty 11/22 Kamala Harris The former California attorney general will be running for president in 2020. Introduced to the national stage during Jeff Sessions’ testimony, she has endorsed Medicare-for-all and proposed a major tax-credit for the middle class AFP/Getty 12/22 John Delaney The Maryland congressman was the first to launch his bid for presidency, making the announcement in 2017 AP 13/22 Tulsi Gabbard The Hawaii congresswoman announced her candidacy in January, but is likely to face tough questions on her past comments on LGBT+ rights and her stance on Syrian President Bashar al-Assad Getty 14/22 Andrew Yang The entrepreneur has announced his presidential candidacy, and has pledged that he would introduce a universal basic income of $1,000 a month to every American over the age of 18 Getty 15/22 Julian Castro The former San Antonio mayor announced his candidacy in January and said that his running has a “special meaning” for the Latino community in the US Getty 16/22 Marianne Williamson The author and spiritual adviser has announced her intention to run for president. She had previously run for congress as an independent in 2014 but was unsuccessful Getty 17/22 Eric Swalwell One of the younger candidates, Swalwell has served on multiple committees in the House of Representatives. He intends to make gun control central to his campaign Getty 18/22 Seth Moulton A Massachusetts congressman, Moulton is a former US soldier who is best known for trying to stop Nancy Pelosi from becoming speaker of the house Getty 19/22 Amy Klobuchar Klobuchar is a Minnesota senator who earned praise for her contribution to the Brett Kavanaugh hearings Getty 20/22 Jay Inslee Inslee has been governor of Washington since 2013. His bid centres around climate change AFP/Getty 21/22 John Hickenlooper The former governor of Colorado is running on a sensible ticket. He aims to sell himself as an effective leader who is open to compromise and evidences this with his experience as governor Getty 22/22 Tim Ryan Ohio representative Tim Ryan will be running a campaign that hinges on his working class roots Getty 1/22 Bernie Sanders The Vermont senator has announced that he will be running again in 2020 after losing out to Hilary Clinton in the 2016 Democratic primaries. He intends to run on a similar platform of democratic socialist reform Getty 2/22 Joe Biden The former vice president - poised to be a frontrunner - has announced his run. He recently faced scrutiny for inappropriate touching of women, but was thought to deal with the criticism well EPA 3/22 Elizabeth Warren The Massachusetts Senator has formally launched her bid for president in 2020. A progressive Democrat, she is a major supporter of regulating Wall Street. Reuters 4/22 Bill De Blasio The New York mayor announced his bid on 16 May 2019. He emerged in 2013 as a leading voice in the left wing of his party but has struggled to build a national profile and has suffered a number of political setbacks in his time as mayor AFP/Getty 5/22 Pete Buttigieg The Indiana mayor and war veteran will be running for president. If elected, he would be the first openly LGBT+ president in American history Getty 6/22 Beto O'Rourke The former Texas congressman formally launched his bid for the presidency in March. He intends to run on a progressive platform, stating that the US is driven by \"gross differences in opportunity and outcome\" AP 7/22 Steve Bullock The Montana governor announced his bid on 14 May. He stated \"We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people's voice, so we can finally make good on the promise of a fair shot for everyone.\" He also highlighted the fact that he won the governor's seat in a red [Republican] state Reuters 8/22 Cory Booker The New Jersey Senator has announced that he will be running for the presidency in 2020. If he secures the nomination he said finding a female vice president would be a priority Getty 9/22 Wayne Messam Mayor of the city of Miramar in the Miami metropolitan area, Wayne Messam has announced his bid. He intends to run on a progressive platform against the \"broken\" federal government. He favours gun regulations and was a signatory to a letter from some 400 mayors condemning President Trump's withdrawal from the Paris Climate Accord Vice News 10/22 Kirsten Gillibrand The New York Senator formally announced her presidential bid in January, saying that “healthcare should be a right, not a privilege” Getty 11/22 Kamala Harris The former California attorney general will be running for president in 2020. Introduced to the national stage during Jeff Sessions’ testimony, she has endorsed Medicare-for-all and proposed a major tax-credit for the middle class AFP/Getty 12/22 John Delaney The Maryland congressman was the first to launch his bid for presidency, making the announcement in 2017 AP 13/22 Tulsi Gabbard The Hawaii congresswoman announced her candidacy in January, but is likely to face tough questions on her past comments on LGBT+ rights and her stance on Syrian President Bashar al-Assad Getty 14/22 Andrew Yang The entrepreneur has announced his presidential candidacy, and has pledged that he would introduce a universal basic income of $1,000 a month to every American over the age of 18 Getty 15/22 Julian Castro The former San Antonio mayor announced his candidacy in January and said that his running has a “special meaning” for the Latino community in the US Getty 16/22 Marianne Williamson The author and spiritual adviser has announced her intention to run for president. She had previously run for congress as an independent in 2014 but was unsuccessful Getty 17/22 Eric Swalwell One of the younger candidates, Swalwell has served on multiple committees in the House of Representatives. He intends to make gun control central to his campaign Getty 18/22 Seth Moulton A Massachusetts congressman, Moulton is a former US soldier who is best known for trying to stop Nancy Pelosi from becoming speaker of the house Getty 19/22 Amy Klobuchar Klobuchar is a Minnesota senator who earned praise for her contribution to the Brett Kavanaugh hearings Getty 20/22 Jay Inslee Inslee has been governor of Washington since 2013. His bid centres around climate change AFP/Getty 21/22 John Hickenlooper The former governor of Colorado is running on a sensible ticket. He aims to sell himself as an effective leader who is open to compromise and evidences this with his experience as governor Getty 22/22 Tim Ryan Ohio representative Tim Ryan will be running a campaign that hinges on his working class roots Getty\n\nAs for Michael Bloomberg: bragging about racist policies like stop-and-frisk while being a plutocrat is not how you beat a bigot.\n\nAnd while John Kerry seem swell, much like his Secretary of State kin, some people need to accept defeat and find something else to do. Oh, and Deval Patrick, you worked at Bain capital and served as former governor of Massachusetts: you know better. Lastly, while Sherrod Brown may well have performed well in the primary, it’s late October, so both he and another intriguing figure, Eric Holder, missed the boat.\n\nWhat all of them — the pundits, the donor class, the moderates — need to accept is that Joe Biden was never the be-all, end-all candidate. Any one of those candidates running could beat Trump and just about all of them — including Biden — could be beaten by Trump. The issue is finding the kind of candidate that inspires voters to the point where they feel compelled to engage. Once you get over your Joe Biden/old white guy centrist kink and take a look around, you’ll see there are already candidates across the country who are able to do that.", "description": "In a recent statement, Joe Biden’s deputy campaign manager, Kate Bedingfield, cited the behavior of President Donald Trump and his allies for their reason to reverse a self-imposed ban on accepting help from a super PAC.", "authors": ["Michael Arceneaux"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/23/08/urn-publicid-ap.org-dd58bda588fc4d22a6a24c3eefd0f89d.jpg", "published_at": "2019-10-25"}