{"pub": "yahoo", "url": "https://news.yahoo.com/photos-earthlings-descend-on-area-51-142237095.html", "downloaded_at": "2019-09-20 22:49:26.567337+00:00", "title": "PHOTOS: Earthlings descend on Area 51 for aliens, parties", "language": "en", "text": "The Little A'Le'Inn in Rachel, Nev. (Photo: John Locher/AP)\n\nA call to “storm” the secretive military base in the Nevada desert known as Area 51 attracted several dozen revelers to a heavily guarded entrance early Friday, but most did not attempt to enter the site, which has long been rumored to house secrets about extraterrestrial life.\n\nA festive scene emerged around 3 a.m. PT on Friday, the date and time a Facebook user had jokingly invited people to run into the base on foot to “see them aliens.” Among the UFO enthusiasts and curiosity seekers, one man wore an orange spacesuit and some sported tinfoil hats and alien masks. A sign in the gathering read “Save ET from the government.”\n\n“A bunch of random people in weird costumes standing outside of a government base, why would you want to miss that?” said a YouTube personality who goes by the name Atozy. “That’s a once-in-a-lifetime experience.”\n\nA man takes a picture of a sign at the Little A'Le'Inn on Thursday during an event inspired by the \"Storm Area 51\" internet hoax. (Photo: John Locher/AP) More\n\nOne young woman ducked under a protective gate and was briefly detained by authorities and released. Others stayed outside the perimeter, according to law enforcement officials keeping watch over the crowd.\n\n“They’re just here to see what’s going on,” said Sgt. Orlando Guerra of the Nevada Department of Public Safety Investigation Division. “They’re here to have fun.”\n\nThe Air Force had issued a stern warning to the public not to trespass into Area 51, which it said is used to test aircraft and train personnel.\n\nJason Strand said he had traveled from Utah to the rural Nevada site as part of a group of nine friends to take in the scene. He said he was not inclined to dart into Area 51.\n\n“We came out here to see the dumb people make a run for it,” he said.\n\nArea 51 had long been shrouded in mystery, stoking conspiracy theories that it housed the remnants of a flying saucer and the bodies of its alien crew from a supposed UFO crash in Roswell, N.M., in 1947.\n\nThe U.S. government did not confirm that the base existed until 2013, when it released CIA archives saying the site was used to test top-secret spy planes.\n\nA bus arrives for a 'Storm Area 51' spinoff event on Sept. 20, 2019 in Rachel, Nevada. (Photo: Mario Tama/Getty Images) More\n\nThe documents, however, did not end suspicion about space aliens there.\n\nArea 51 sits about 12 miles from Rachel, Nev., a tiny outpost north of Las Vegas that is hosting a music festival to entertain any UFO hunters or others heading to the region. Some residents had urged the public to stay away because they worried that the town of 50 year-round residents would be overwhelmed with unruly tourists.\n\nAs of early Friday, a few hundred campsites had been set up by visitors outside the Little A’Le’Inn, an alien-themed motel and restaurant that is Rachel’s only business.\n\n“I’m relieved it’s here,” said Connie West, co-owner of the inn, who had scrambled to set up a campground, bring in portable toilets and otherwise support the influx of visitors. “It’s happening. There was no stopping it.” (Reuters)\n\nSee more news-related photo galleries and follow us on Yahoo News Photo Twitter and Tumblr.", "description": "A call to “storm” the secretive military base in Nevada known as Area 51 attracted revelers to a heavily guarded entrance early Friday, but most did not attempt to enter the site, which has long been rumored to house secrets about extraterrestrial life.", "authors": ["Yahoo News Photo Staff"], "top_image": "https://s.yimg.com/uu/api/res/1.2/0X8A6Snok0EaMV8DhPqWMQ--~B/aD0yODA5O3c9NDIxMztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/afa82470-dbb0-11e9-b7f6-66b2839eb170", "published_at": "2019-09-20"}