{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7595833/British-grandfather-fastest-84-year-old-world-despite-suffering-two-heart-attacks.html", "downloaded_at": "2019-10-21 10:31:52.283274+00:00", "title": "British grandfather is the fastest 84-year-old in the world despite suffering two heart attacks", "language": "en", "text": "An athletic grandfather-of-two holds the title of the fastest 84-year-old in the world despite having two attacks.\n\nTony Bowman, who is from Leeds, came away with three medals in the 80-84 category at the European Masters in Italy last month.\n\nThe silver sprinter won gold in the 80m hurdles where he jumped along a track jumping two-and-a-quarter feet hurdles in only 16.8 seconds.\n\nHe scored a silver medal in the 400m relay, bronze in decathlon and came fourth in the 100m and fifth in the 200m.\n\nTony Bowman is the fastest 84-year-old in the world after winning a silver medal in the 400m relay, bronze in decathlon and came fourth in the 100m and fifth in the 200m, at the European Masters last month\n\nBut after the heart attacks in his 70s, he cut down on alcohol and chocolate to help achieve his life-long goal of running 100m at 100 years old and living to 120.\n\nHe went on to win the historical Musselburgh New Year Sprint, in East Lothian, Scotland, in his comeback race after the heart attack in 2006.\n\nAnd he broke 11 British athletics records when he he first entered the Masters category which covers anyone from 35 onwards.\n\nHis medals were in the European, international and decathlon races.\n\nTony (pictured at the European Masters track) drinks wine every other day and does dancing or playing hockey to keep fit as he was treated for abnormal heart rhythm since his surgery. He says he feels 'like a 50-year-old and life is good'\n\nTony (pictured wearing 768 bib) competes in the hurdling race at Potsdam in 2014\n\nHe said that while there are young athletes beating him, there is no 84-year-old faster than him 'in the world'.\n\nThe athlete, who is from Leeds, is already looking forward to turning 85 when he can enter the next age category.\n\nHe has 'cut down to one glass of wine every other day' and does ballroom dancing, cha cha or playing hockey to keep fit as he was treated for abnormal heart rhythm since his surgery.\n\nTony said: 'I can't let my heart get in the way of my training. When I am sprinting I have to give it my absolute all, my heart is the last thing on my mind.\n\n'I feel like a 50-year-old and life is good.'\n\nThe silver sprinter smiles with his trophy after winning the New Year Sprint in 2007. This was his comeback race after a heart attack\n\nHe holds up his £4,000 cash prize for becoming the 138th New Year Sprint winner on December 30, 2006. Today Tony has said he pays for his entry fees, travel and tracksuits outof his own pension and would like to get sponsorship\n\nHe admitted he was 'very blessed' to have good genes but still works hard to keep fit and 'loves the felling of running and sweating'. He had heart failure last year and thought he was on his 'last legs' with the sport.\n\nTony represented Middlesex schools aged 15 to 16 and won the hurdles championship in White City, London. He then came second for hurdles at an All England Schools event in Bradford.\n\nThe champion, who is married to Betty, 85, stopped running at 27 before taking it up again at 42 when he moved to Kirkstall, Leeds, and worked for Whitbread brewery. He took up the veteran's category - which is now known as a Masters.\n\nTony (pictured far left) is captured running the first London marathon in 1981, aged 44. This was just two years after he moved to Kirkstall, Leeds, and took up competitive running again. He had previously stopped at 27 years old\n\nTony said it 'would be great' to get sponsorship for the races as he has to pay out of his own pension for tracksuits, travel and entry fees.\n\n'I'm doing all of this for my country, a country that I love, and it would be nice to be able to have some help.'\n\nTony continues to compete in Masters events all over the world, with competitions in Portugal and Toronto coming up.\n\nMen as old as 105 and women in their 100s have competed in running, jumping and throwing events.", "description": "Tony Bowman, from Leeds, is the fastest 84-year-old in the world  after coming away with three medals in the 80-84 category at the European Masters. Broke 11 Brit records when he started.", "authors": ["Phoebe Eckersley For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/11/19985624-0-image-a-48_1571653020935.jpg", "published_at": "2019-10-21"}