{"pub": "fox", "url": "https://foxnews.com/world/us-poland-5g-technology-agreement-mike-pence", "downloaded_at": "2019-09-03 23:45:57.707207+00:00", "title": "US and Poland sign agreement to cooperate on 5G technology", "language": "en", "published_at": "2019-09-03", "text": "The U.S. and Poland signed an agreement Monday to cooperate on new 5G technology as concerns grow about Chinese telecommunications giant Huawei.\n\nVice President Mike Pence and Polish Prime Minister Mateusz Morawiecki signed the deal in Warsaw, where Pence is filling in for President Donald Trump, who scrapped his trip at the last minute because of Hurricane Dorian.\n\nThe signing comes during a global battle between the U.S. and Huawei, the world’s biggest maker of network infrastructure equipment, over network security and fears of Chinese access.\n\n\n\n5G IS A BIGGER DEAL AND CHINA IS A BIGGER THREAT THAN YOU THINK, THINK TANK SAYS\n\nThe U.S.-Poland agreement states: “Protecting these next generation communications networks from disruption or manipulation and ensuring the privacy and individual liberties of the citizens of the United States, Poland, and other countries is of vital importance.” Both countries pledged to endorse the principles developed by cybersecurity officials from dozens of countries at a summit in Prague this year to counter threats and ensure the safety of the next generation of mobile networks.\n\n\n\n\n\nPence, speaking at a news conference with Polish President Andrzej Duda, said he hoped the declaration would set a “vital example for the rest of Europe on the broader question of 5G.”\n\nThe U.S. has been lobbying allies to ban Huawei from 5G networks over concerns the Chinese government could force the company to give it access to data for cyberespionage. Huawei has denied the allegation and states in Europe — where countries are gearing up to deploy the new networks, starting with the auction of radio frequencies this year — have balked at U.S. calls for an outright ban.\n\nPence’s chief staff, Marc Short, cited Huawei by name in a statement later Monday that called on other nations to “ensure that only trusted providers have access to their developing networks.”\n\n“We recognize 5G networks will only be as strong as their weakest link,” he said, adding, “We must stand together to prevent the Chinese Communist Party from using subsidiaries like Huawei to gather intelligence while supporting China’s military and state security services - with our technology.”\n\nAt the news conference, Duda was asked whether the U.S. had ever provided Poland with evidence of Chinese spying using Huawei technology.\n\n\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHe didn’t mention the U.S. in his answer, but said, “Indeed, Poland’s counterintelligence has detected activity that could be of espionage nature” and that prosecutors are investigating.\n\nA Chinese businessman who served as Huawei’s sales director in Poland and a Pole who cooperated with the government on security measures were arrested in Poland in January on suspicion of espionage.\n\nDuring a visit to Sweden last week, Morawiecki said work was being done to have Swedish networking and telecommunications company Ericsson invest in 5G development in Poland.", "description": "The U.S. and Poland signed an agreement Monday to cooperate on new 5G technology as concerns grow about Chinese telecommunications giant Huawei.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/AP19245518772737.jpg"}