{"pub": "cbs", "url": "https://cbsnews.com/news/shaq-donates-handicap-accessible-house-to-family-of-atlanta-boy-isaiah-payton-paralyzed-in-shooting", "downloaded_at": "2019-10-19 11:18:32.616584+00:00", "title": "Shaquille O'Neal donates home to family of Atlanta boy paralyzed in shooting", "language": "en", "text": "A 12-year-old Atlanta boy who was shot in August has been recovering in the hospital ever since. But when he's released, he will have a new house to come home to – thanks to Shaquille O'Neal.\n\nIsaiah Payton was struck by a bullet during a high school football game at Lakewood Stadium in Atlanta on August 16. Payton was paralyzed in the shooting and another 15-year-old boy was hit in the leg, according to CBS Atlanta.\n\nA 15-year-old boy has been arrested in connection to the shooting, CBS Atlanta reports. Payton's mother, Allison Woods, said she quit her job to take care of her son, and she was looking for a handicap accessible home.\n\nNow, an NBA star is stepping up to make sure the family has what they need, WXIA reports. When Shaq learned that Payton couldn't leave the hospital because he didn't have a home equipped for his new disabilities, he decided to find a house for the family.\n\nIsaiah Payton, 12, was paralyzed in a shooting, and his mother has now quit her job in order to take care of him. Isaiah Payton's Family\n\n\"I was watching the story and it's just sad. It could have been any one of us. It could have been my son,\" O'Neal O'Neal told WXIA reporter Francesca Amiker. \"It could've been your cousin and she was living in a one-bedroom house with her two boys so we found her a one-bedroom house in College Park. Nice area. I'm going to get her some ring cameras on me. We're going to give her some furniture, TVs and pay her rent off for a year and help her get on her feet.\"\n\nRoby Lynch, the CEO of Papa John's, and Jeff Smith, the chairman of the board of Papa John's, are also helping O'Neal get this new house up and running for the family. O'Neal recently became a director on the Papa John's board.\n\nMayor Keisha Lance Bottoms and the City of Atlanta Fire Department are also supporting the efforts to help Payton's family, WXIA reports.\n\nThis is not the first time O'Neal has stepped in to better the life of a teen in need. He recently bought 10 new pairs of shoes for a Georgia boy. Thirteen-year-old Zach Keith already wears a size 18 shoe, which was difficult for his mom to afford.\n\nO'Neal wears a size 22 shoe and went through the same thing as a teen. \"Mom couldn't afford shoes. The kid had big feet. I just kind of reminisced about how that used to be me, my mom and my dad,\" O'Neal told CBS Atlanta affiliate WGCL-TV.", "description": "Isaiah Payton couldn't leave the hospital because his house was not equipped for his new disabilities – so, Shaq stepped him", "authors": ["Caitlin O'Kane"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2012/05/04/74c82117-a644-11e2-a3f0-029118418759/thumbnail/1200x630/f3bac9c2bd1c666d521d565c7fee4554/Shaquille_43610073.jpg", "published_at": "2019-10-18"}