{"pub": "news24", "url": "https://fin24.com/Economy/kieswetter-cross-border-organised-crime-on-the-rise-20191002", "downloaded_at": "2019-10-05 10:48:20.393263+00:00", "title": "Kieswetter: Cross-border organised crime on the rise", "language": "en", "text": "Cross-border organised crime is on the rise, SA Revenue Service commissioner Edward Kieswetter said on Wednesday, making particular reference to crimes involving illicit financial flows.\n\nKieswetter was the keynote speaker at the opening of the conference of the International Federation of Freight Forwarders Associations (FIATA) in Cape Town.\n\nSaying \"blatant evasions\" were a key challenge for the economy, Kieswetter said the revenue service was working on tightening enforcement.\n\n\"The risk environment has deteriorated significantly.\n\n\"SARS will, therefore, implement a full compliance model. Questionable morality among intermediaries poses challenges to the likes of SARS,\" he said.\n\n\"Blatant evasions have significant downstream implications for our domestic economies. The SA government is charged with creating conditions for economic growth to address inequality in our country. \"We have to facilitate international trade while having secure borders against the entry of high-risk consumer products from unscrupulous players across the borders.\"\n\nKnotty problem\n\nKieswetter said it was impossible to solve the problem alone.\n\n\"The landscape has become increasingly complicated. Our economic growth depends hugely on international trade volumes. Yet, we have seen slower than expected global growth due to rising trade tensions,\" he said.\n\n\"Economists expect global growth to slow even more. Any growth will be dependent on the easing of current trade tensions, which invariably hurt the smaller economies.\"\n\n'Make it hard and costly'\n\nHe said SARS has to balance the management of its customs mandate to collect taxes and protect the local SA economy from fraudulent imports while providing clarity to stakeholders of their legal obligations and making it easy and simple for those choosing to comply.\n\n\"We must make it hard and costly for those who chose fraudulently or negligently not to comply. We have to work with stakeholders to strengthen the process,\" he said.\n\n\"We still have too many information asymmetries between our data and those of China and India, for example. Therefore, blatant invoicing fraud is a significant focus for us. We want to be a lot more interventionist. If not, the only winners will be thugs and thieves.\"\n\nHe said it is very important for SARS employees to be professional and incorruptible - and promised to crack down on offenders.\n\n\"Any party seeking to collude with our officers must know that we will not tolerate collusion of any kind,\"warned Kieswetter.\n\n\"We are considering stopping all mismatched consignments to force compliance or to implement penalties starting in December this year.\"\n\n\"Let us make sure we define a higher purpose of embracing a common goal between SARS and the freight forwarding industry in order to create better and healthy societies,\" he added.", "description": "Cross-border organised crime is on the rise, SA Revenue Service commissioner Edward Kieswetter said on Wednesday, making particular reference to crimes involving illicit financial flows.", "authors": ["Carin Smith"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8556/571ad8962d3d4d99bcba546d4f410757.jpg", "published_at": "2019-10-02"}