{"pub": "thehill", "url": "https://thehill.com/blogs/congress-blog/politics/464577-how-we-argue-about-what-happens-next-matters", "downloaded_at": "2019-10-07 12:11:56.381517+00:00", "title": "How we argue about what happens next matters", "language": "en", "text": "Our democracy is an argument for itself. Our system is the result of a debate about a set of ideas about how to structure political debate. That we talk to each other, and how we talk to each other, is central to the American experiment. Which is why former senior advisor to Presidents Reagan and Bush, Peter Wehner wrote that “Democracy requires that we honor the culture of words.”\n\nBecause we have built political structures that work reasonably well most of the time, we can usually ignore those structures and let politics happen through them. It can be easy to forget that those structures do not exist outside our descriptions of them. Our political process is not a mineral vein that early colonists stumbled over. Our democracy did not exist before people invented it. Without care, that invention vanishes. A river does not notice if you swim in it or ignore it – the river was there before you showed up, and it will probably be there when you leave. Democracy on the other hand only exists as well as, and as long as we, practice it and protect it.\n\nTo say that the United States is in a perilous political moment is an understatement. The allegations about the president’s dealings with Ukraine are about whether or not the person entrusted to lead our nation tried to get a foreign government to undermine our political process. The potential crime is against our democracy.\n\nWhat the nation does next in this moment matters a great deal. Given the centrality of language to our democracy, how we talk about this moment matters a great deal as well. Everyone who discusses the allegations against the president has a responsibility to do so in ways that do not undermine, and ideally that strengthen, the system of ideas on which our democracy relies.\n\nThose weighing in on the inquiry should premise their arguments on what is best for our political system. The question before the American people is not which political party or candidate has the best ideas about health care or taxes. The question is how to best secure and strengthen a system in which debates about health care and taxes can take place.\n\nIn this light, attacks on democratic institutions make a terrible situation worse. Accusing the press, Congress, the courts, or any other broad group on which our country relies are unethical. Arguments that work from the premise that our institutions are sound but that some in those institutions are behaving badly are welcome. Such arguments lay praise or blame where it is deserved, and strengthen democratic institutions by calling out those who would weaken them.\n\nSimilarly, arguments that the press can do better, or that individual reporters are biased or sloppy can be ethical (if the arguments are true and accurate). Arguments that the whole of the American media system is the enemy or collectively “fake” are unethical. Our democracy relies on a robust, if sometimes frustrating, media. As such we should all always expect the best of those who work in media – arguments the media can do better serve to strengthen the institution by highlighting its importance even as they call out individuals who can do better.\n\nOur democracy is the result of arguments about ideas. We continue to grow and thrive because we take those ideas seriously. We should take how we argue about those ideas seriously as well.\n\nPeter Loge is the Director of the Project on Ethics in Political Communication and an Associate Professor in the School of Media and Public Affairs at The George Washington University. Over a 25+ year career in Washington he has served in senior staff positions in Congress, the Obama administration, and in a range of organizations.", "description": "Our democracy is the result of arguments about ideas. We continue to grow and thrive because we take those ideas seriously. We should take how we argue about those ideas seriously as well.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_100419as13_lead.jpg", "published_at": "2019-10-06"}