{"pub": "japantoday", "url": "https://japantoday.com/category/rugby-world-cup-2019/Rugby-World-Cup-organizers-cancel-2-games-due-to-typhoon", "downloaded_at": "2019-10-10 06:16:46.896346+00:00", "title": "Rugby World Cup organizers cancel 2 games due to typhoon", "language": "en", "text": "Alan Gilpin, left, tournament director for the 2019 Rugby World Cup, and Japan Rugby 2019 CEO Akira Shimazu attend a press briefing in Tokyo Thursday to discuss the impact of Typhoon Hagibis on the final round Rugby World Cup 2019 pool matches this weekend.\n\nBy John Pye\n\nThe powerful typhoon that has caused the first ever cancellation of Rugby World Cup games has ended Italy's prospects of reaching the quarterfinals and could upset Scotland's chances of progressing to the knockout stages as well.\n\nRugby World Cup organizers on Thursday announced that two games scheduled for Saturday - the Pool C decider between England and France in Yokohama and the Pool B game between defending champion New Zealand and Italy in the city of Toyota - had been canceled because of the anticipated impact of Typhoon Hagibis. Sunday's game in Yokohama between host Japan and Scotland could also be scrapped, depending on the weather.\n\nThe Japan Meteorological Agency is warning the powerful typhoon may bring torrential rain and strong winds to central parts of the country between Saturday and Sunday, coinciding with the last round of World Cup group games. It has urged people to take precautions to avoid potentially life-threatening danger. Airlines and train services anticipate cancellations in what is expected to be the most destructive typhoon of 2019.\n\nWorld Rugby tournament director Alan Gilpin said organizers had looked at all options, including moving the Yokohama and Toyota games to other venues, but it wasn't logistically possible in a fair way to all teams.\n\n\"While making every effort to put in place a contingency plan that would enable all of Saturday's matches to be played, it would be grossly irresponsible to leave teams, fans, volunteers ... exposed during what is predicted to be a severe typhoon, Gilpin said. \"We've taken the very difficult decision but right decision to cancel matches in affected areas.\n\n\"We don't think it undermines the quarterfinals at all,\" he told a news conference.\n\nAll games canceled because of weather are logged as scoreless draws and each team will get two competition points, meaning Italy cannot finish better than third in Pool B and England will top Pool C without having to play France, despite both teams being unbeaten. Scotland needs to beat Japan to have any chance of reaching the playoffs. If the game is canceled, Japan and Ireland will advance to the knockout rounds.\n\nAll fans with tickets for a canceled match will receive a full refund. Organizers said every effort would be made to ensure all four matches on Sunday go ahead. A final decision is expected to be made Sunday morning.\n\nNew Zealand coach Steve Hansen said cancelling their pool match with Italy was \"a no-brainer.\"\n\nThe All Blacks were informed in the morning that it was off, and they still went out and trained.\n\n\"When you get a typhoon to the level we're getting, then safety is the paramount thing so it's a no-brainer,\" Hansen said. \"The most important thing that happens now is how we adapt and adjust to it.\"\n\nThe All Blacks advanced to the quarterfinals and will know their opponent on Sunday, either Ireland, Japan or Scotland.\n\nCaptain Kieran Read said they were disappointed for themselves and Italy, and the fans.\n\n\"Of course we'd want this game in terms of game-time and things,\" Read said. \"But we've been around this game a long time, trained a lot together and we're ready to go next week. It's got no bearing on how we turn up next week and we're excited by it.\"\n\nEngland coach Eddie Jones said he no problems with the tournament decision.\n\n\"Of course everyone is disappointed. We wanted to play France and we put a lot of work into that,\" he was quoted as saying. \"We have no issues, so we're getting on with it. It's a wonderful World Cup but you can't help typhoons.\"\n\nFriday's Pool D game between Australia and Georgia at Shizuoka and Saturday's game between Ireland and Samoa at Fukuoka will go ahead as scheduled.\n\nGilpin said all 20 teams were aware of the cancellation policies well before the World Cup kicked off, so he wasn't expecting any protests or legal comeback from teams deprived of games.\n\n\"All the teams signed up to the participation agreement. They're well aware of the tournament rules,\" Gilpin said. \"That's not a concern. We always knew there would be risks (with the weather) but it's rare for there to be a typhoon of this size at this stage of the year. We have no regrets.\"\n\nThe logistics of moving 20 teams around a dozen cities and the geography involved diminished the possibility of last-minute changes to venues.\n\n\"It's complex. There's little flexibility, and that's why the tournament rules are as they are,\" he said. \"We've got some different opportunities if we have similar impacts in the knockout phase.\"\n\nTyphoon Hagibis had winds gusting up to 270 kilometers per hour (168 mph) Thursday morning. It is expected to weaken over cooler waters as it nears Japan's main island.\n\nJapan's central Pacific coast may see torrential rains beginning Friday and the high waves and tides may cause flooding. Japan is regularly hit by Pacific storms. Typhoon Faxai caused massive power outages in Chiba Prefecture near Tokyo in September. Typhoon Jebi flooded a terminal and a runway at Kansai International Airport last year.\n\n© 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "The powerful typhoon that has caused the first ever cancellation of Rugby World Cup games has ended Italy's prospects of reaching the quarterfinals and could upset Scotland's chances of progressing to the knockout stages as well. Rugby World Cup organizers on Thursday announced that two games scheduled for Saturday -…", "authors": ["Bruce Greet", "Do The Hustle", "Christopher Glen", "Bugle Boy Of Company B", "Robert Maes"], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/7d/ed/887cc65b06cb1cebf8c1479c34eca70dbdca/gilpin.jpg", "published_at": "2019-10-10"}