{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/23/labour-election-brexit-boris-johnson-jeremy-corbyn", "downloaded_at": "2019-10-24 06:41:56.022888+00:00", "title": "It’s time for Labour to bite the bullet and embrace an election | Owen Jones", "language": "en", "text": "Tis the season to be canvassing. The odds on the first December election for nearly a century have dramatically shortened. With Boris Johnson’s commitment to Brexit happening by 31 October now dead in a ditch, the Vote Leave faction of his administration is pushing hard for the “parliament versus the people” contest they have always craved. The political calculations now made by Labour will prove critical to the prospects of the embattled Corbyn project.\n\nIt was a strategic blunder for Labour and other opposition parties not to accept the election gauntlet when it was first thrown down in September. There were two reasons: the first was a genuine fear that no deal could be engineered mid-campaign. This was not baseless paranoia: the Johnson administration had proved itself to be devoid of trustworthiness, and the prime minister’s special adviser, Dominic Cummings, had fed the prospect to the media. The second was driven by those who believed a pre-election people’s vote was possible, potentially facilitated by a so-called government of national unity.\n\nBut as one Labour source put it to me, the mistake everyone made was to presume that Johnson would not strike a deal with the EU. It wasn’t his political ingenuity that was underestimated, but rather his willingness to capitulate to EU red lines, throw his DUP allies under a bus and consent to a customs border down the Irish Sea which Theresa May once proclaimed “no UK prime minister could ever agree” to, and then for the Tory party to line up cravenly behind him.\n\nAll Labour MPs believe in the inevitability of an election but are divided over the timing and circumstances. Some senior figures believe that there is a coordinated campaign within the parliamentary Labour party to put off an election until the spring.\n\nPartly, that’s down to some MPs who represent majority leave communities fearing that their seats are at risk in a Brexit-defined election. Anti-Jeremy Corbyn MPs believe that there is still space for a government of national unity which, for them, has the advantage of removing Corbyn from his position. For obvious reasons, Corbyn sympathisers would rather push ahead with an election.\n\nElection rumours intensify after Johnson and Corbyn Brexit stalemate Read more\n\nHow the electorate will respond to their Christmas shopping being interrupted by yet another vote worries MPs from all parties. One senior Labour shadow minister I spoke to is worrying about “campaigning in the rain and cold and dark … especially as tensions are so high”, and is not alone in that fear. Britain’s already febrile political circumstances will only worsen when Johnson’s “do or die” Brexit pledge is broken, after all.\n\nThe latest an election can take place in 2019 is 12 December; it would need to be called by early November to allow sufficient time for campaigning. Is a new year election possible if the EU offers an extension until the end of January? It seems far-fetched, but the EU – which will never be forced into a position where it takes the blame for no deal – has made it clear it would offer an extension in the event of a poll, and could plausibly add a month to allow a 2020 election to take place.\n\nBut it is difficult to see how such a scenario could be agreed this side of Christmas, and Johnson may have succeeded in ramming his deal through by then anyway.\n\nSome of the pro-deal Labour MPs believe that the party will be liberated from the Brexit prison if Johnson’s deal is voted through, freed to campaign on its core, bread and butter issues. This may provide a comforting rationalisation for politicians who are willing to lend votes to a hard-right project, but their actions will be relentlessly seized upon by a Liberal Democrat party seeking to exploit the subsequent fury of remainers.\n\nBoth Jo Swinson and Johnson share a common aim: for the Lib Dems to eat into the Labour vote, the former to win a few more MPs, the latter to secure a majority for a hard-right government.\n\nPlay Video 1:20 Jeremy Corbyn says PM's Brexit deal threatens jobs, rights and environment – video\n\nLabour’s least bad option, then, is to agree to an election, when it is proposed, after an extension is offered by the EU. Its current prospects seem bad. Its polling is terrible. But if it loses badly, it won’t be because of an excessively radical domestic policy prospectus – which played a key role in its 2017 surge – but rather excessive triangulation and moderation on Brexit as the country polarised.\n\nIt should have adopted its current policy of “a referendum in all circumstances with remain on the ballot paper” earlier. Centrists have now embraced the culture war enveloping the body politic – seeing remain as a new lasting identity allowing their political rebirth – while Johnson’s forces eye working-class leavers in the small-town north and Midlands. Both phenomena pose huge challenges to Labour. The party transformed its fortunes last time, starting significantly further behind the Tories than now; but have views on both the Labour leader and the Brexit culture war become too entrenched? It is only just over two years ago that 40% of the electorate crossed the psychological barrier of voting for a Labour party led by Corbyn. Since then some of them have crossed another psychological barrier to vote for the coalition-tainted Lib Dems. Which will triumph?\n\nBut Labour should shake off any self-destructive gloom. It should confidently trumpet its “let the people decide” Brexit policy, offering the only plausible route back for remainers: a compromise position between hard Brexit and the Lib Dems’ arrogantly undemocratic revoke.\n\nIt understandably fears an election defined by Brexit, but offering clarity about a genuinely uncomplicated position gives it permission to talk about the issues it cares about, as well as winning back supporters who have fled to the Lib Dems and Greens. It must put domestic issues – taxing the rich and big business, public ownership, solving the housing crisis and a real living wage – centre stage, in part by emphasising that such “burning injustices” led to Brexit in the first place and offering optimistic can-do solutions.\n\nGiven the existential climate threat facing humanity – and the urgency required to deal with the issue – it must make this a climate emergency election, buoyed by polls which show the environment has surged as an issue.\n\nLabour must pitch itself against an arrogant, entitled establishment personified by Johnson himself. Corbyn flourishes in campaigning mode: there is every prospect of reversing bad personal ratings, 2017-style.\n\nThe Brexit culture war may devour the Corbyn project yet. But an election is coming, and Labour has no alternative but to embrace it. It is not a done deal for Johnson: his own cabinet ministers fret over the possible outcome. As for the grassroots who propelled Corbyn to leadership, the battle of their political lives beckons.\n\n• Owen Jones is a Guardian columnist", "description": "If the party picks up Johnson’s gauntlet, it must pitch itself as the antidote to an arrogant Tory establishment, says Guardian columnist Owen Jones", "authors": ["Owen Jones"], "top_image": "https://i.guim.co.uk/img/media/9730f0d939e3ef94ba923e39c005f61db1f502d2/0_0_1506_903/master/1506.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=f29e7b4e693fb1594934a825040b4315", "published_at": "2019-10-23"}