{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/21/scotus-to-rule-on-constitutionality-of-consumer-financial-protection-bureau", "downloaded_at": "2019-10-22 13:31:53.213684+00:00", "title": "Supreme Court to Rule on Constitutionality of CFPB", "language": "en", "text": "The Supreme Court announced on Friday that it will take up a case on the constitutionality of the Consumer Financial Protection Bureau (CFPB).\n\nAt issue in the case, Seila Law LLC v Consumer Financial Protection Bureau, is (1) whether the 2010 Dodd-Frank Act’s:\n\n…vesting of substantial executive authority in the Consumer Financial Protection Bureau, an independent agency led by a single director, violates the separation of powers; and (2) whether, if the Consumer Financial Protection Bureau is found unconstitutional on the basis of the separation of powers, [the portion of the Dodd-Frank Act that established the agency] can be severed from the [rest of that statute].\n\nThe powers and independence given to the director of the CFPB under the Dodd-Frank Act are extraordinary. Once appointed by the president to a five year term and confirmed by the Senate, the director cannot be fired by the president unless it is “for cause,” meaning that the director could not be removed for pursuing policies counter to the president’s agenda.\n\nA ruling is expected by June of 2020, which could place the issue at the center of the presidential election. The agency was the brainchild of Sen. Elizabeth Warren (D-MA), who is currently either leading or tied with former Vice President Joe Biden in most national polls for the 2020 Democrat presidential nomination.\n\nAmy Howe wrote on Friday at SCOTUSblog:\n\nThe dispute is not merely an academic one: If the justices agree that the restrictions violate the doctrine known as the separation of powers – the idea that the Constitution divides the different functions of government among the executive, judicial and legislative branches – their ruling could potentially unravel all the CFPB’s decisions in the nine years since its creation. The case now before the court was filed by Seila Law, a law firm that provides, according to its briefs, “a variety of legal services to consumers, including assistance with the resolution of consumer debt.” When the CFPB began an investigation into whether Seila had violated federal telemarketing laws, it sought information and documents from the firm. Seila objected to the request. It argued that the structure of the CFPB is unconstitutional because the bureau is headed by a single director, who has significant power but can only be removed by the president “for cause” – that is, for a very good reason. The U.S. Court of Appeals for the 9th Circuit conceded that Seila’s argument was “not without force,” but it ultimately concluded that the Supreme Court’s cases point in the other direction. Although the director can only be removed for cause, the court of appeals reasoned, that restriction does not “impede the President’s ability to perform his constitutional duty to ensure that the laws are faithfully executed.”\n\nThe current director of the CFPB, Kathy Kraninger, has publicly stated that she believes it is unconstitutional that the president does not have the authority under the law to fire her or any future director without a specific cause.\n\nSen. Warren, for her part, vigorously argues that both the agency and the status of the director are constitutional. Should the Supreme Court rule against either of those components of the law, Warren is sure to make the ruling a big 2020 campaign issue.\n\nLeftists have criticized the conduct of the CFPB since Richard Cordray, an Obama appointee, stepped down in November 2017 to run for governor of Ohio as the Democrat nominee, a race he lost in November 2018 to Republican Gov. Mike DeWine.\n\nCordray was replaced by current White House Chief of Staff and former OMB director Mick Mulvaney as acting director. Subsequently, President Trump nominated Mulvaney’s deputy director at OMB, Kathy Kraninger, to serve as director. Kraninger was confirmed by the Senate in December 2018.\n\nUnder Mulvaney and Kraninger, the controversial and overreaching enforcement actions undertaken by the CFPB under Cordray’s leadership have declined dramatically.\n\nThis is not the first challenge to the constitutionality of the CFPB that has come to the Supreme Court for consideration.\n\nIn January, the Supreme Court decided not to hear an appeal of the D.C. Circuit Court of Appeals decision in the case of State National Bank of Big Spring v. Mnuchin\n\nThe Competitive Enterprise Institute (CEI), one of the plaintiffs in the case, noted on its website that “[t]he lawsuit argued that the structure of the CFPB violates the Constitution’s separation of powers because the agency is insulated against meaningful checks by the legislative, executive, and judicial branches of government.”\n\nFor example, unlike other agency heads, the CFPB’s director can only be fired by the president for specified causes. Normally, agency heads serve at the will of the president, an arrangement that makes an appointee more responsive and accountable to the president and, by extension, the American people. Also, unlike other regulatory agencies, Congress has no power to approve or disapprove the CFPB’s budget. Instead, the CFPB budget is taken from the budget of the Federal Reserve, which is the central banking system of the United States. That funding arrangement means the CFPB is not subject to Congress’s “power of the purse,” and it severely worsens the agency’s unaccountability. In effect, the CFPB functions like a fourth branch of government, unauthorized by the Constitution.\n\nThe lawsuit was filed in 2012, dismissed by a federal district judge in 2013, then appealed to the D.C. Circuit Court of Appeals and remanded back to the district court where, the CEI website added, “our case was put on hold by the district court pending the D.C. Circuit’s consideration of another court case, PHH Corp. v CFPB.”\n\nIn October 2016, a three-judge panel found the CFPB’s structure to be unconstitutional because its director could not be removed at will by the president. But on January 31, 2018, the en banc circuit court overturned the panel’s 2016 decision, effectively giving future heads of agencies like the CFPB enormous power with scant accountability. In the wake of this ruling, the district court in our case granted a joint motion for judgment against us in February, 2018. That ruling was summarily affirmed by the D.C. Circuit on June 8, 2018. We filed a petition for certiorari with the Supreme Court on September 6, 2018, but our petition was subsequently denied on January 14, 2019.\n\n“As a party in the first major challenge to the constitutionality of this agency, we are glad to see that this issue has now been taken up by the Supreme Court,” Sam Kazman, general counsel of the CEI said on Friday.\n\n“We urge the Supreme Court to rule that the CFPB as structured is unconstitutional in order to help ensure government agencies are accountable to American consumers and voters,” CEI Senior Fellow John Berlau added.\n\n“Under the leadership of current Director Kathleen Kraninger, the CFPB has made some positive, free-market reforms that greatly benefit consumers. But her good leadership doesn’t change our belief that the CFPB must be made constitutionally accountable by having a director subject to at-will removal by the person that Americans elect as their president,” Berlau concluded.", "description": "The Supreme Court announced on Friday it will take up a case on the constitutionality of the Consumer Financial Protection Bureau (CFPB).", "authors": ["Michael Patrick Leahy"], "top_image": "https://media.breitbart.com/media/2019/10/Supreme-Court-Pillars-with-light-640x335.jpg", "published_at": "2019-10-21"}