{"pub": "axios", "url": "https://axios.com/senate-reports-russian-interference-2016-election-9d0daca6-1e2d-4617-9295-f8eec61c1719.html", "downloaded_at": "2019-10-29 00:23:11.722646+00:00", "title": "Senate-commissioned reports show scale of Russian misinformation campaign", "language": "en", "text": "The groups’ findings bolster the public’s understanding of the Russian campaign and provide new details on how it operated:\n\nThe Internet Research Agency troll farm focused much of its attention on black audiences, creating \"an expansive cross-platform media mirage targeting the Black community, which shared and cross-promoted authentic Black media to create an immersive influence ecosystem,\" per the New Knowledge report. The group’s cultivation of sometimes-unsuspecting on-the-ground collaborators was \"substantially more pronounced on Black-targeted accounts.\"\n\nIt engaged in voter suppression. New Knowledge said that \"the suppression narratives were targeted almost exclusively at the Black community on Instagram and Facebook\" in the lead-up to the 2016 election. The IRA simultaneously targeted right-leaning audiences with content raising fears of voter fraud.\n\nThe group's efforts didn't slow down after they became clear to the public. \"Surprisingly, these campaigns did not stop once Russia's IRA was caught interfering in the 2016 election. Engagement rates increased and covered a widening range of public policy issues, national security issues, and issues pertinent to younger voters,\" said researchers from Oxford University’s Computational Propaganda Project.\n\nThe researchers' findings don't necessarily represent those of the Intelligence Committee, which is in the midst of a lengthy investigation into Russian interference.\n\nThe big picture: The Oxford researchers also highlighted the ways in which Facebook, Google and Twitter had made it difficult for the Senate panel and researchers to study the campaign.\n\nNew Knowledge added they expect Russian efforts to use smaller social media platforms and messaging services as the 2020 election approaches.\n\nWhat they're saying: Senate Intel Chair Richard Burr said in a statement, \"This newly released data demonstrates how aggressively Russia sought to divide Americans by race, religion and ideology, and how the IRA actively worked to erode trust in our democratic institutions. Most troublingly, it shows that these activities have not stopped.\"\n\n\"This should stand as a wake up call to us all that none of us are immune from this threat, and it is time to get serious in addressing this challenge,\" said Senate Intel Vice Chairman Mark Warner in a statement. \"That is going to require some much-needed and long-overdue guardrails when it comes to social media.\"\n\nRead the two reports in full:", "description": "\"This should stand as a wake up call to us all that none of us are immune from this threat.\"", "authors": [], "top_image": "https://images.axios.com/OIqFjGNwkZnzNMp7II3zIRP7z3k=/0x376:3666x2438/1920x1080/2018/12/17/1545055539267.jpg", "published_at": "2018-12-17"}