{"pub": "independent", "url": "https://independent.co.uk/sport/general/mma/conor-mcgregor-ufc-comeback-return-next-fight-las-vegas-a9169106.html", "downloaded_at": "2019-10-24 13:58:17.396733+00:00", "title": "Conor McGregor UFC comeback: Irishman announces date and location for next fight", "language": "en", "text": "Conor McGregor has confirmed he will return to the UFC on January 18 in Las Vegas.\n\nThe Irishman has not fought since losing to Khabib Nurmagomedov at UFC 229 on October 6 of last year.\n\nAn opponent is yet to be announced, but The Notorious appeared unbothered, stating: \"I do not give a f***.\"\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nA rematch with Nurmagomedov is high on McGregor's wish list, though a future meeting with the Russian is some way off, with the champion next in action next against Tony Ferguson.\n\nWhile McGregor could also face the winner of Nate Diaz vs Jorge Masvidal in the bout following his comeback.\n\nMcGregor confirmed he will be in camp for 12 weeks before his January 18 fight, with camp set to start this weekend.\n\nThe 31-year-old is not concerned over when a rematch with Nurmagomedov occurs, revealing his confidence that it will happen.\n\n\"It will happen. I am not waiting around for that man, he is a known pull-out.\n\n\"You can run but you cannot hide. He ran out of the press conference in Moscow last week. It is in his nature. Trust me I am coming for him.\n\n\"Where is he now in this country? I fly in, he flies out. Typical.\n\n\"I am going to go through the entire roster like a chainsaw through butter.\"", "description": "Conor McGregor has confirmed he will return to the UFC on January 18 in Las Vegas. The Irishman has not fought since losing to Khabib Nurmagomedov at UFC 229 on October 6 of last year. An opponent is yet to be announced, but The Notorious appeared unbothered, stating: \"I do not give a f***.\"", "authors": ["Jack Rathborn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/06/19/13/conor-mcgregor.jpg", "published_at": "2019-10-24"}