{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7560807/Cindy-Crawford-no-qualms-daughter-Kaia-Gerber-launching-professional-modeling-career-16.html", "downloaded_at": "2019-10-11 00:55:49.977222+00:00", "title": "Cindy Crawford had no qualms about daughter Kaia Gerber launching professional modeling career at 16", "language": "en", "text": "Kaia Gerber did her first professional photo shoot for Junior Versace when she was 10 and made her professional catwalk debut a few days after her 16th birthday.\n\nAnd on Thursday, at the Vogue: Forces Of Fashion event in New York, Cindy Crawford explained that she had no qualms at all about allowing her daughter to follow in her footsteps at such a young age.\n\n'I had no trepidation at all about saying yes to Kaia,' the 53-year-old supermodel said, according to E!. 'I felt comfortable and I was like, ‘Go for it, have fun and I'm always here if you have a question.''\n\nModel genes: Cindy Crawford, 53, and daughter Kaia Gerber, 18, were among the celebrity participants at the Vogue: Forces Of Fashion event in New York on Thursday\n\nThe mother and daughter duo were among the participants at the event held at Spring Studios in the Tribeca neighborhood.\n\nCindy revealed that by the time Kaia embarked on her professional career as a fashion model, she was well prepared for what lay ahead.\n\n'She was pretty well-versed in designers and young photographers,' the proud mom gushed.\n\nHowever, she added: 'There are some things no matter how much someone can tell you about the industry, there are things you have to learn firsthand.'\n\nSupportive: During a panel discussion, Cindy revealed she had had 'no trepidation at all' about letting her daughter launch a professional runway career at 16 and told her 'go for it'\n\nModel: Kaia Gerber did her first professional photo shoot for Junior Versace when she was 10, left, and made her professional catwalk debut at NYFW a few days after her 16th birthday, right\n\nAs for some of the criticism she received for allowing her daughter to star modeling at such a young age, Cindy's defense is that, thanks to social media, 'everyone's a model in their everyday life.'\n\nAs for Kaia, the now 18-year-old couldn't be happier at the way things have panned out and says she's fine if people want to make comparisons between her and Cindy.\n\n'If I have to be compared to anyone in the world, it's the biggest compliment,' she commented.\n\nShared: As for criticism, Cindy's defense was that, thanks to social media, 'everyone's a model in their everyday life.' Kaia said being compared to her famous mom is the biggest compliment\n\nStylish: For the Vogue event, Cindy donned a blue gray pantsuit featuring a blazer tied with a sash. She added strappy black stiletto heels and carried a black purse\n\nLeggy look: Kaia opted for an olive green suit with a thigh-skimming skirt and long jacket belted at the waist. She paired the outfit with knee-high black leather boots\n\nSince her debut walk for Raf Simons' Calvin Klein Collection at New York Fashion Week in 2017 put on her on the map, Kaia has been in constant demand by top fashion houses.\n\nShe's modeled for Marc Jacobs, Burberry, Alexander Wang, Coach, Prada, Chanel, Fendi, Moschino, and Versace, among others.\n\nShe landed her first solo Vogue cover in February 2018 and also collaborated the same year with the late designer Karl Lagerfeld for her first collection.\n\nShe was also named Model of the Year at The Fashion Awards 2018.\n\nThis year, she's been traveling to Fashion Weeks all over the globe, most recently walking for Chanel in Paris.\n\nIn demand: This year, Kaia has been traveling to Fashion Weeks all over the globe, most recently walking for Chanel in Paris, pictured\n\nSocial night: Later on Thursday, the mother and daughter headed out once again, this time heading to the Global Lyme Alliance Gala. Cindy looked lovely in a black tuxedo-style pant suit", "description": "'I had no trepidation at all about saying yes to Kaia,'  the supermodel, 53, said in NYC Thursday. 'I felt comfortable and I was like, 'Go for it, have fun and I'm always here if you have a question.''", "authors": ["Rachel Mcgrath For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/00/19564494-0-image-a-15_1570751947340.jpg", "published_at": "2019-10-11"}