{"pub": "theverge", "url": "https://theverge.com/2019/10/29/20938711/xbox-one-console-streaming-preview-android-xcloud-feature-test", "downloaded_at": "2019-10-30 00:00:47.271012+00:00", "title": "Xbox One testers can now stream any game to an Android phone", "language": "en", "text": "Microsoft is allowing Xbox One testers to access the company’s latest Console Streaming feature. It’s a new feature that lets you play your own Xbox One games from your personal console on a mobile device. While Microsoft is also testing its Project xCloud game streaming preview, Console Streaming uses your own Xbox One to stream any game to a mobile device instead of using a cloud-based Xbox instance.\n\nProject xCloud is also currently limited to just four games during the initial preview period, whereas this Console Streaming feature supports all the existing Xbox 360 and Xbox One games you have installed on your personal console.\n\n“If you’re an Xbox Insider in the Alpha and Alpha Skip-Ahead rings in the US and UK, you can now try a preview of Xbox Console Streaming,” explains Jonathan Hildebrandt, an Xbox program manager. “You’ll be able to play your owned and installed Xbox One games, including Xbox Game Pass titles, on an Android phone or tablet remotely from your home console.”\n\nMuch like xCloud, this new Console Streaming feature is limited to Android, and it uses the same app to access your home console over the internet instead of a cloud-based Xbox. Microsoft has not mentioned any plans to bring this or Project xCloud to iOS devices just yet.\n\nRequirements for this feature to work include:\n\nAn open or moderate NAT type\n\nUpload bandwidth of at least 4.75 Mbps (9 Mbps preferred)\n\nNetwork latency of 125 ms or less required (60 ms or less preferred)\n\nThe Xbox One console to be set to instant-on in the power options\n\n“This preview is an important step in our journey to deliver game streaming to Xbox players around the world,” notes Hildebrandt. “We’ll work closely with you and the Insider community to gather feedback that will shape and define future iterations of Xbox Console Streaming.”", "description": "Microsoft is allowing Xbox One owners to stream games from their own consoles to Android phones. It’s part of a new Console Streaming feature on the Xbox, and it’s arriving for testers ahead of the launch of the cloud-based Project xCloud game streaming service.", "authors": ["Tom Warren", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/egWa07QiqBKJvHZGXTDs-UcFVzs=/0x18:940x510/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19329288/XboxServices_GmStrmng_Hero_2019_Male1_RGB_HomeScreen_Edit.png", "published_at": "2019-10-29"}