{"pub": "fox", "url": "https://foxnews.com/us/hurricane-dorian-homeless-pets-reunite-owners", "downloaded_at": "2019-09-13 20:08:21.646798+00:00", "title": "Hurricane Dorian victims reunite with their beloved pets weeks after storm", "language": "en", "text": "LOXAHATCHEE, Fla. –– Amid the devastation in the Bahamas left behind by Hurricane Dorian – the dozens of lives lost and the hundreds of homes swept away -- there is another growing concern: Dozen of emaciated and sick pets roaming the island with no place to go.\n\nAnimal groups are trying to reunite the pets with their owners, and trying to save the lives of others whose owners have not been found.\n\n\"They have lost everything over there,\" said Lauree Simmons, founder and president of the Big Dog Ranch Rescue, a group located in Palm Beach County. \"They need their animals, they need their dogs, they need their best friend, and they need to know that everything is OK.\"\n\nPriscilla Aylen, 75, said she was in tears when she was reunited with her Labradoodle, Emma, for the first time since Hurricane Dorian hit her home in Freeport, Bahamas. As water poured into her home, her granddaughter waded outside with the dog -- but the pet was swept away by the rising waters. Dramatic video taken by Aylen’s son showed the family struggling to get to safety.\n\n“The water was coming into the house very, very quickly,” Aylen said.\n\nHURRICANE DORIAN: MEDICAL TEAMS RACE TO SAVE LIVES IN THE BAHAMAS\n\nShe thought she’d never see the dog again. But Big Dog Ranch Rescue helped her locate Emma. On their rescue trip to the Bahamas, they found Emma, and flew her back to Florida, where she was reunited with her owner.\n\n“Lots of tears,” Aylen said, “absolutely thrilled to pieces to have her back.”\n\nBig Dog Ranch is one of a handful of animal rescue groups helping pets impacted by Hurricane Dorian. The Humane Society of the Grand Bahamas reported having almost 200 dogs in its shelters when the hurricane hit. The storm killed over half of them.\n\nSimmons said the dogs her group has rescued from the Bahamas were taken to Florida by boat or plane. Once the dogs arrive, they are taken to a shelter and fully examined. The staff runs tests on each and nurses them back to health since many were found badly injured.\n\nOne German Shepherd they named Freeport arrived at the shelter with numerous health issues. The roof of Freeport's home caved, and part of it fell on his back, severely injuring him.\n\n\"His owners brought him to the plane and said, 'Please take our dog and get him the care he needs... we know he will die here if he stays,'” Simmons recalled.\n\nThe group now has over 70 rescued dogs, and the number keeps climbing.\n\nSimmons said many Bahamians are still also looking for pets that were lost during the storm, not knowing whether they are dead are alive.\n\n“We've gotten nine pleas from owners sending us pictures and locations where their dog was left,\" Simmons said. \"We also got a desperate plea from a family of five who had lost their home and they tried to get on a plane and they wouldn't let them take their dogs, so they stayed behind and they wouldn't leave their dog. We found a way yesterday to get their family to Nassau because two of their children didn't have visas to come in and get them on a plane safely.\"\n\nBahamian evacuee Stacy Rodgers described the relief her family felt to be safe with their dog in their arms.\n\n“We were not leaving without her, so we had to make sure that all of our paperwork was up to date before they even considered even letting us leave, so we said we are going to stay behind until somebody let us go,\" Rodgers said. \"I am glad that she is more relaxed now, she is really relaxed.”\n\nThe rescue group plans to find people to adopt the dogs whose owners have not been found. The group has already completed four trips to the Bahamas to rescue dogs left homeless by Hurricane Dorian. It plans to return again.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“We expect there's going to be a whole lot more and this is just the tip of the iceberg,\" Simmons said. \"The quicker we get them out the better chance they have for survival.”", "description": "Amid the devastation in the Bahamas left behind by Hurricane Dorian – the dozens of lives lost and the hundreds of homes swept away -- there is another growing concern: Dozen of emaciated and sick pets roaming the island with no place to go.", "authors": ["Elina Shirazi", "Elina Shirazi Joined Fox News In As A Multimedia Reporter Based In Miami."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/dogs-horizontal.jpg", "published_at": "2019-09-12"}