{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7618985/Rumer-Willis-emulates-Marie-Antoinette-elaborate-corset-dress-Halloween-bash.html", "downloaded_at": "2019-10-28 00:39:18.707622+00:00", "title": "Rumer Willis emulates Marie Antoinette in elaborate corset dress at Halloween bash", "language": "en", "text": "She usually steps out in her signature laid-back ensembles.\n\nBut Rumer Willis pulled out all the stops as she attended a Halloween party with her sister Scout at private members' club San Vicente Bungalows in West Hollywood, California, on Saturday evening.\n\nThe actress, 31, channelled the last Queen of France, Marie Antoinette, for her outing as she sported a busty corset dress, which featured detailed floral print and lace embroidery.\n\nKooky display: Rumer Willis (L) pulled out all the stops as she attended a Halloween party with her sister Scout (R) at San Vicente Bungalows in West Hollywood, California, on Saturday\n\nMixing 18th century chic with current style trends, the Once Upon a Time in Hollywood star complemented her elaborate mini-dress with white fishnet tights, gold lace-up boots and a pale pink handbag.\n\nThe Empire actress maintained her kooky display with her hair and make-up as she sported a heavily-applied blusher and a black wig with ringlet curls.\n\nScout, 28, meanwhile, opted for a slightly more demure look in a quirky black gown, complete with a sweetheart neckline and puffball sleeves.\n\nBusty babe: The actress, 31, channelled Marie Antoinette for her outing as she sported a busty corset dress, which featured detailed floral print and lace embroidery\n\nThe real deal: The last queen of France ruled the European country before the French Revolution\n\nSmitten: Jonah Hill was also pictured at the starry venue with his new fiancée Gianna Santos\n\nEarlier in the week, their mother Demi Moore hinted her ex-husband and their father Bruce Willis 'didn't deserve' to get paid more than her in 1991's Mortal Thoughts.\n\nThe American actress, 56, shocked the audience on Wednesday's instalment of The Late Late Show by naming a male co-star who she believed didn't deserve to get paid more than her.\n\nAfter being praised for her work when it came to gender disparity in Hollywood during a game of Spill Your Guts or Fill Your Guts, the actress, 56, was asked by James Corden on which one of her former male co-stars didn't deserve a bigger paycheck than her.\n\nFamous family: Rumer, Scout, and their sister Tallulah, 25, are the children of screen stars Demi Moore and Bruce Willis - who were married from 1987 until 2000\n\nDesperately trying to worm her way out of drinking hot sauce, Demi - who has starred alongside the likes of Woody Harrelson, Patrick Swayze and Michael Douglas - surprisingly answered: 'I'd say Bruce Willis.'\n\nShe offered some context to her upcoming answer: 'OK, I don't know if I could say he didn't deserve. That's not necessarily up to me to say...\n\n'I'd say Bruce Willis,' she revealed of her ex-husband, 64, who she was married to from 1987 to 2000, and starred with in 1991's Mortal Thoughts.\n\nDemi, who has made a series of shock revelations in her new memoir Inside Out, then tried to backtrack: 'No, I can't say that he didn't deserve it.'\n\nHowever, James wasn't buying the friendly exes jargon, quipping back: 'Well, then you're not answering the question!'\n\nSuccumbing to the pressure of giving a real answer, Demi was then forced down the shot of hot sauce.\n\nDemi was married to Bruce from 1987 until 2000 and the pair are parents to three children - Rumer, Scout, and Tallulah, 25.", "description": "The actress, 31, pulled out all the stops as she attended a Halloween party with her sister Scout, 28, at private members' club San Vicente Bungalows in Hollywood, California, on Saturday.", "authors": ["Rianne Addo", "Jabeen Waheed For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/14/20245706-0-image-a-170_1572186095390.jpg", "published_at": "2019-10-27"}