{"pub": "businessinsider", "url": "https://businesstimes.com.sg/consumer/angry-farmers-to-face-off-with-new-zealands-fonterra-over-financial-woes ", "downloaded_at": "2019-09-18 05:11:37.583223+00:00", "title": "Angry farmers to face off with New Zealand's Fonterra over financial woes", "language": "en", "text": "Fonterra, the world's biggest dairy exporter, will face off this month with farmer shareholders angry about the New Zealand company's ill-fated foreign expansion and resulting poor returns.\n\n[WELLINGTON] Fonterra, the world's biggest dairy exporter, will face off this month with farmer shareholders angry about the New Zealand company's ill-fated foreign expansion and resulting poor returns.\n\nRuctions at Fonterra, where a second year of financial losses is forecast following asset writedowns worth billions of dollars, have reverberated widely in a country where dairy farming is crucial to both the national accounts and politics.\n\nA few of the approximate 10,500 farmers who supply Fonterra with milk and comprise its cooperative structure have transferred production to smaller rivals in recent years, while many others say they have limited options to do that.\n\n\"It's a diabolical mess,\" said Malcolm Lumsden, owner of Waikato-based Lumsden Farms, who is among farmers demanding a clear turnaround strategy at meetings when Fonterra's delayed annual results are released on Sept. 26.\n\nsentifi.com Market voices on:\n\nThe company has flagged an annual loss of as much as NZ$675 million (S$588.7 million) and write-downs of up to NZ$860 million for assets in Brazil, China and other countries that are being investigated by the Financial Markets Authority.\n\nWith a general election due next year, Regional Economic Development Minister Shane Jones has called Fonterra's management \"grossly inept\", while the government has tightened its oversight of how the company sets milk payments to farmers.\n\nChief executive Miles Hurrell, who is due to give more details on company strategy with the earnings statement, has pledged to rein in Fonterra's global ambitions to focus on producing milk in New Zealand.\n\nFonterra Chairman John Monaghan told Reuters he was confident the new strategy \"implemented well ... will bring a new period of success for our co-op.\"\n\nRural communities are a significant voter base in New Zealand, where dairy directly contributes about 3.5 per cent to the country's NZ$200 billion gross domestic product.\n\nAnd there are growing concerns about rising debt in the sector. The Reserve Bank of New Zealand has warned that dairy farm debt is among the highest in the country at about NZ$41 billion.\n\nFor many farmers who have watched their shareholding halve in value over less than two years, Fonterra's decision to axe its annual dividend was the final straw.\n\n\"I've lost half a million dollars on those dividends,\" said one farmer, who requested anonymity after transferring some of his milk production to other producers. \"We continued to tell Fonterra to look after us, but they never listened.\"\n\nTom Mason's dairy business Terracostosa stopped supplying milk to Fonterra earlier this year, switching to competitor Synlait.\n\n\"With Fonterra, we had a lot of capital invested in something we had no control over and it appeared they were taking risks with that money,\" Mr Mason said.\n\nColin Armer, Fonterra's biggest individual shareholder, whose complaints sparked the FMA probe, said management had made some \"very poor past decisions.\"\n\nFonterra Chairman John Monaghan acknowledged \"the impact that recent decisions have had on our share price and the balance sheets of our owners in a challenging environment.\"\n\nMORE WRITEDOWNS?\n\nFounded in 2001 as a \"national champion\" cooperative to represent New Zealand's dairy farmers, Fonterra grew into a global processer of milk in China, Latin America and Australia, as well as at home. Previous management sought to transform the company from a simple milk processor into a producer of value-added dairy products as it chased profits offshore.\n\nAmong Fonterra's biggest missteps was the 2015 purchase of an 18.8 pre ent stake in Chinese infant formula manufacturer Beingmate Baby & Child Food for NZ$755 million, just as the China market became hyper-competitive and demand slowed. Fonterra last month announced it would cut its Beingmate stake by selling shares after failing to find a buyer.\n\nMeanwhile, back home, Fonterra's share of the milk processing market dropped from 96 per cent in 2001 to 82 per cent currently, with consultants TDB Advisory expecting it to be about 75 per cent by 2021.\n\n\"We won't have it all our own way, but we're confident that, implemented well, the new strategy will bring a new period of success for our co-op,\" Mr Monaghan said when asked about farmer discontent.\n\nOthers are not yet convinced.\n\nANZ Bank dairy analyst Susan Kilsby estimated that Fonterra may need to take further asset write downs of NZ$300 million to NZ$700 million, flagging Beingmate, the company's Chile offshore milk-processing business and Australian operations as concerns.\n\nCredit-rating agency Standard & Poor's, which has downgraded Fonterra twice in the last five years, expressed faith in the new management but warned of a \"sizable execution risk\".\n\nMany farmer shareholders have little patience for any more stumbles.\n\n\"Fonterra should get back to what is was set up to do, which is collecting, processing and selling milk,\" said Mr Lumsden. \"It was never set up to be an international player.\"\n\nREUTERS", "description": ": THE BUSINESS TIMES Consumer - [WELLINGTON] Fonterra, the world's biggest dairy exporter, will face off this month with farmer shareholders angry about the New Zealand company's ill-fated foreign expansion and resulting poor returns. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/09/18/AK_fta_1809.jpg?itok=x5atDnH6", "published_at": "2019-09-18"}