{"pub": "zdnet", "url": "https://downloads.zdnet.com/product/20420-78239849", "downloaded_at": "2019-10-05 00:23:23.530278+00:00", "title": "New York Travel Guide -Tourias Download", "language": "en", "text": "Now with travel guide content by MARCO POLOWith the TOURIAS Travel New York, you always have all the important information at hand when traveling.Whether at home on the couch during travel planning, on the way in the resort or even after the trip - the TOURIAS Travel Guide New York will give you useful tips for your trip. Whether it's exploring sights, discovering great restaurants or going out in the hippest clubs.But the TOURIAS apps can do much more:High quality travel guide content from TOURIAS and MARCO POLO with up to 60,000 POIs.Free offline maps and complete offline use without expensive roaming charges.With our MyGuide feature you can create your own entries in the app. Of course, the personal experiences can also be shared directly via Facebook.Tour tickets: Fancy tours by locals can be booked directly via the app. You discover the destination in a very special way.Augmented Reality: Discover the spots of the holiday destination via the camera of the smartphone / tablet.Pointer dictionaryGPS use to locate - Where am I?\"\"Nearby\"\" feature - Where is the nearest restaurant?Upgrade: With the optional upgrade you can make the TOURIAS Travel Guide free of advertising and enrich it with additional entries from MARCO POLO including insider tips (the best information from the popular MARCO POLO volumes).TOURIAS is a brand of the publishing group MAIRDUMONT.We are constantly working to optimize our products and offers for our customers. The product range of our media house is cross-media and includes print products and digital media. The publishing program includes the MARCO POLO travel guides, Falk city maps, Baedeker travel guides, the ADAC cartography, DuMont travel guides, the German Lonely Planet travel guides, the Kompass outdoor program, the VARTA guides and Shell Atlas, various travel and mobility portals, mobile applications, TV offers and eBooks.We are happy to receive your feedback, information on the destination, wishes and suggestions at info@tourias-mobile.com.", "description": "Now with travel guide content by MARCO POLOWith the TOURIAS Travel New York, you always have all the important information at hand when trav", "authors": [], "top_image": "https://zdnet2.cbsistatic.com/fly/bundles/zdnetcore/images/logos/zdnet-logo-large.png", "published_at": "2019-10-04"}