{"pub": "dailymail", "url": "https://dailymail.co.uk/travel/article-7513325/Have-blast-Orlando-WITHOUT-trip-Disney-airboat-rides-shopping-Florida-Mall.html", "downloaded_at": "2019-10-05 08:52:14.159235+00:00", "title": "Have a blast in Orlando WITHOUT a trip to Disney, from airboat rides to shopping at the Florida Mall", "language": "en", "text": "Some of us just don't do theme parks. The last time I went on a rollercoaster (by mistake, thinking it was a scenic water ride), I was green for the rest of the day.\n\nSo when my husband suggested we should take the children to Orlando in Florida, we came to a compromise.\n\nI would find as many alternative activities for the family to enjoy, on the understanding we would never set foot in a theme park. The children, Ella, 11, and Ollie, eight, were sure I would relent once we got there.\n\nWild things\n\nWhizzy rascals: Fun at Boggy Creek Airboat Adventures, where you can whizz through Florida's wetlands\n\nHoliday snap: Liz at Gatorland. The wildlife park has been dedicated to 'gators' great and small for more than 70 years\n\nThere's nothing particularly scenic about Orlando's main drag — the sprawling International Drive — with its huge shopping malls, eat-as-much-as-you-want buffet restaurants and big attractions, but head south for 30 minutes by car to the Central Florida Everglades in Kissimmee and the scenery changes completely.\n\nYou can whizz through wetlands which stretch in either direction in an airboat at Boggy Creek Airboat Adventures (bcairboats.com). Out on the water, we see alligators basking in the sun, their heads emerging from the murky depths. The children squeal with delight.\n\nOn land, there's a replica Native American village, where we learn about the Jororo Tribe, which once lived on the Kissimmee River, from a local. The children love his body piercings and tattoos.\n\nTo get close to the alligators, we head to Gatorland (gatorland.com). The wildlife park has been dedicated to 'gators' great and small for more than 70 years, and is 20 minutes' away by car from International Drive.\n\nWe goggle at 14 ft monsters in the breeding marsh, feed medium-sized alligators bait, and see the razor-sharp teeth of beady-eyed babies.\n\nAs if we were in any doubt, The Gator Jumparoo and Up-Close Encounter shows, where keepers show off the power of some giants, demonstrate only too clearly that alligators are not to be messed with.\n\nThrill and spills\n\nWonderWorks, pictured, an indoor 'edutainment' centre on International Drive, promises exploration and learning at the same time\n\nThey don't call Florida the 'Sunshine State' for nothing. Orlando has year-round sun.\n\nSo for a day in the shade, we head to WonderWorks, (wonderworksonline.com), an indoor 'edutainment' centre on International Drive, which promisingly offers exploration and learning at the same time.\n\nI feel smug that I am ticking the 'good parent' box, in zones including 'natural disasters' and 'space exploration', where we experience a hurricane and earthquake, ride wonder coasters and take on a glow-in-the-dark rope course.\n\nThere are no big rides at WonderWorks, but head to ICON Park (iconparkorlando.com), less than a mile way, and you'll find a 400 ft observation wheel, where the far-reaching views stretch to the East coast.\n\nNights out on holiday are usually restrictive with children, but at Old Town Kissimmee, just south of Orlando, we join petrol heads in a gleaming Chevy from across the region for the Saturday night Classic Car Cruise (myoldtownusa.com).\n\nOut of this world\n\nThe Kennedy Space Center Visitor Complex on Merritt Island, just under an hour's drive from Orlando\n\nGet lucky and you'll see a real rocket launch at Kennedy Space Center Visitor Complex (kennedyspacecenter.com) on Merritt Island, just under an hour's drive from Orlando. We get very lucky indeed watching a satellite shoot into space.\n\nIn the centre itself, there are enough exhibits to visit over several days. Walk underneath the suspended 364 ft-long Saturn V, the largest rocket ever flown, and you feel very small.\n\nElla is particularly interested in the Heroes & Legends area, which documents the success of space pioneers. My husband is so impressed with the dramatic recreation of the 1969 Apollo 11 launch from the actual operation room used on the day that he goes back for more.\n\nJust for fun\n\nThe Florida Mall, pictured, is 20 minutes east of International Drive. It has a hands-on Crayola Experience\n\nIt is the children who spot Epic McD, the world's largest entertainment McDonald's on West Sand Lake Road, just a few minutes' away from International Drive. And it turns out to be a good find.\n\nAs well as a free soft play area, there's an arcade of 50 games with pre-loaded money cards.\n\nTaking children shopping is a test of endurance, but at Florida Mall (simon.com/mall/the-florida-mall), 20 minutes east of International Drive, the hands-on Crayola Experience provides enough of an incentive.\n\nHere we make personalised crayons. Buying time for grown-up purchases of cut-price sportswear, my husband promises the children we'll later visit the huge M&M's store.\n\nBack home, Ollie has an alligator claw keyring from Gatorland, while Ella has a personalised Chevy number plate on her wall.\n\nAnd no one asks why we didn't do theme parks.\n\nTicket savings\n\nAvoid international bank charges and pre-pay for tickets to Orlando Attractions. Combination tickets provide additional savings (orlandoattractions.com).\n\nBuy a Kids Eat Free Card Plus before you leave for free meals for children under 11 in Orlando (kidseatfreecard.com).", "description": "Liz Kavanagh took her family to Orlando in Florida but decided that they would never set foot in any of the theme parks. Here she shares the alternative activities that she, her children and husband enjoyed.", "authors": ["Liz Kavanagh For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/27/20/19022008-0-image-a-120_1569611508957.jpg", "published_at": "2019-09-27"}