{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/downton-abbey-bosses-ask-julian-fellowes-sequel-movie-rakes-120-million-10885451", "downloaded_at": "2019-10-09 00:50:06.548589+00:00", "title": "Downton Abbey bosses call for sequel as movie rakes in £110 million", "language": "en", "text": "Downton Abbey bosses are looking for the sequel (Picture: Focus)\n\nDownton Abbey bosses are looking ahead to a sequel following the unsurprising success of the first film\n\nThe main cast of the hit ITV series returned for the story’s first big-screen outing which focused on a visit from the royal family in 1927, which throws the Crawley family into disarray and sees them come face-to-face with King George V and Queen Mary.\n\nHowever, it has been claimed that with a current worldwide total of $135.4 million (£110 million), distributor Focus Features have kindly asked the creator and writer of the show, Julian Fellowes, to start work on a follow-up.\n\nThe film reportedly cost $20 million (£16 million) so it’s already made nearly seven times its costs; not bad for a period drama that began life on Sunday evenings on ITV.\n\n‘Downton’s popularity as a film has been phenomenal. It took £60million in America alone and has been a roaring success. Julian and the team are over the moon with how it played out. No one expected it would be this big,’ an insider has now claimed.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nSpeaking to The Sun, they added: ‘The commercial viability of a second film is now a dead cert, so Julian has been told to start putting pen to paper on the follow-up.’\n\nAdvertisement\n\nAdvertisement\n\nThe film saw the likes of Dame Maggie Smith taking another turn as Dowager Countess of Grantham, Michelle Dockery as Lady Mary, Elizabeth McGovern as her mother Cora, Hugh Bonneville as the Earl of Grantham and Laura Carmichael as Lady Edith.\n\nNewcomers included Imelda Staunton as Lady Bagshaw, the cousin of Lady Violet (Dame Maggie Smith) along with Kate Phillips and Simon Jones who play the monarch and Queen who visit the Crawleys in the movie.\n\nDownton Abbey is in cinemas now.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Breaking Bad creator finally confirms Walter White’s fate ahead of El Camino release\n\nMORE: The Greatest Bake Off: Sandi Tokvig makes dig about Henry’s ‘girlfriend’ amid Alice dating rumours", "description": "Downton Abbey film has been a box office success after years on ITV.", "authors": ["Rebecca Lewis"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/downtonabbey-8a12_1570572793.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-08"}