{"pub": "metro", "url": "https://metro.co.uk/2019/10/28/gunman-opens-fire-at-vigil-held-for-victims-of-mass-shooting-10996335", "downloaded_at": "2019-10-28 13:30:00.668953+00:00", "title": "Gunman opens fire at vigil held for victims of mass shooting", "language": "en", "text": "Bullets were fired during a vigil held for shooting victims at a Halloween in Texas (Picture: EPA – AP)\n\nMourners ran for their lives after a gunman opened fire during a vigil for people killed in a mass shooting at a university party.\n\nA gunman opened fire at the vigil in Greenville, near Dallas, Texas, hitting a news truck three times during the service on Sunday night.\n\nIt was organised after two people were killed at a university Halloween homecoming party for Texas A&M students on Saturday.\n\nPolice are still looking for the shooters, with the first attacker understood to have escaped during the chaos.\n\nNBC Dallas-Fort Worth Diana Zoga was at the vigil and said: ‘Our news unit was hit at least three times,’ adding she had not seen anyone injured.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nAuthorities believe the attacker responsible for Saturday’s shooting may have been targeting one person, with the victims hit by random shots, Hunt County Sheriff Randy Meeks said.\n\nAdvertisement\n\nAdvertisement\n\nIt is thought the gunman entered the party through the back door and opened fire.\n\nWhen the shots rang out ‘complete chaos’ descended with hundreds fleeing.\n\nOf the 12 injured, six were trampled or hurt by glass in the ensuing melee, according a spokesman for the sheriff’s department.\n\nSix others were injured by gunfire. Four are critical and one was said to be in a good condition as of Sunday afternoon. The status of the sixth person was not known.\n\nHunt County Sheriff Randy Meeks, centre, addresses members of the media at the sheriff’s department headquarters after the deadly shootings in Greenville, Texas, on Sunday October 27 ( Picture: The Dallas Morning News via AP)\n\nThe two people killed were both males, Sheriff Meeks said, with Kevin Berry Jr, 23, of Dallas, having been named in local media as one of the dead.\n\nAuthorities were still looking for the as-yet-unidentified suspect.\n\nThe following morning Halloween masks and other debris were strewn about and pools of blood seen on the ground.\n\nKimberly Wilson, 46, said her daughter, 19, had travelled to the party from Dallas.\n\nShe said: ‘She’s angry, hurt, upset. She’s going through that whole emotional thing. When you’ve not been trained to deal with something like that – it just throws you off.’\n\nSheriff Meeks praised the patrol sergeant and deputy at the scene saying his officers had quickly determined one gunshot victim had life-threatening injuries and got them hospital, while the deputy triaged others until paramedics arrived.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Gunfire at Greenville vigil held for victims of Texas A&M mass shooting", "authors": ["Chris Caulfield"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_93244834_1572266402.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-28"}