{"pub": "axios", "url": "https://nba.com/article/2019/10/08/adam-silver-statement-china-nba", "downloaded_at": "2019-10-08 12:54:17.566211+00:00", "title": "Adam Silver's statement on NBA and China", "language": "en", "text": "NBA Commissioner Adam Silver issued the following statement regarding the NBA and China:\n\nI recognize our initial statement left people angered, confused or unclear on who we are or what the NBA stands for. Let me be more clear.\n\nOver the last three decades, the NBA has developed a great affinity for the people of China. We have seen how basketball can be an important form of people-to-people exchange that deepens ties between the United States and China.\n\nAt the same time, we recognize that our two countries have different political systems and beliefs. And like many global brands, we bring our business to places with different political systems around the world.\n\nBut for those who question our motivation, this is about far more than growing our business.\n\nValues of equality, respect and freedom of expression have long defined the NBA -- and will continue to do so. As an American-based basketball league operating globally, among our greatest contributions are these values of the game.\n\nIn fact, one of the enduring strengths of the NBA is our diversity -- of views, backgrounds, ethnicities, genders and religions. Twenty-five percent of NBA players were born outside of the United States and our colleagues work in league offices around the world, including in Beijing, Hong Kong, Shanghai and Taipei.\n\nWith that diversity comes the belief that whatever our differences, we respect and value each other; and, what we have in common, including a belief in the power of sports to make a difference, remains our bedrock principle.\n\nIt is inevitable that people around the world -- including from America and China -- will have different viewpoints over different issues. It is not the role of the NBA to adjudicate those differences.\n\nHowever, the NBA will not put itself in a position of regulating what players, employees and team owners say or will not say on these issues. We simply could not operate that way.\n\nBasketball runs deep in the hearts and minds of our two peoples. At a time when divides between nations grow deeper and wider, we believe sports can be a unifying force that focuses on what we have in common as human beings rather than our differences.", "description": "NBA Commissioner Adam Silver issued the following statement regarding the NBA and China:\r\n\r\nI recognize our initial statement left people angered, confused or unclear on who we are or what the NBA", "authors": ["Official Release"], "top_image": "https://publish.nba.com/images/cms/2019-04/GettyImages-1037428364.jpg?cw=1045&w=1046&x=0&ch=588&h=698&y=110", "published_at": "2019-10-08"}