{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/14/jackson-square-ventures-just-closed-its-third-fund-with-193-million-heres-how-it-plans-to-invest-it", "downloaded_at": "2019-10-14 23:19:33.459271+00:00", "title": "Jackson Square Ventures just closed its third fund with $193 million; here’s how it plans to invest it – TechCrunch", "language": "en", "text": "Jackson Square Ventures (JSV), an eight-year-old, San Francisco-based early-stage venture firm that takes its name from the neighborhood in San Francisco where it’s headquartered, has closed its third fund with $193 million in capital commitments — a sizable step up from its first two funds, which had both rounded up roughly $120 million from the firm’s limited partners.\n\nThe firm, whose founding partners originally spun out of Sigma Partners, invests primarily in U.S.-based software-as-a-service and marketplace companies, with occasional outliers if it can find a way to rationalize the investment. Such was the case with Cornershop, a Latin American online grocery delivery service that JSV co-founder Greg Gretsch first came to know when one of the company’s co-founders, Oskar Hjertonsson, moved in across the street from him.\n\nRecalls Gretsch, “This ‘Swede from Chile’ had sold his earlier company, Needish, to Groupon and it later became Groupon Latin America. Afterward, I advised him a bunch and told him, ‘I’d invest in anything you do.’ Then he said he and his team were working on a group photo-sharing application, and I was like, ‘I’d invest in anything but that.’ ” Gretsch laughs now, but Hjertonsson and company soon realized that a much bigger opportunity was to start a kind of Instacart for Latin America.\n\nThat particular pitch resonated with Gretsch, who invested as an angel investor. A year later, he brought the team to JSV with one caveat. “I told everyone, ‘I know this is out side the norm for us. It’s outside the U.S. in Latin America. But it is a marketplace.” Soon after Gretsch’s colleagues — including fellow managing directors Pete Solvik and Josh Breinlinger — met the team and JSV co-led Cornershop’s Series A round. Cornershop went on to raise roughly $32 million altogether before selling a majority stake in its business last week to Uber for undisclosed terms.\n\nGretsch says that Hjertonsson and his co-founders are exactly the type of founders that JSV seeks out. “They’re humble and not cocky or overly promotional.”\n\nHe says that more broadly, JSV avoids companies in hyped-up spaces, sticking instead to what it knows, which includes enterprise software (DocuSign was among its portfolio companies), and network effects businesses, whether they’re business-to-business or business-to-consumer companies (Gretsch counts portfolio companies OfferUp and Strava in the latter category).\n\nAs for how much the firm puts to work, Gretsch says that its sweet spot is Series A deals and that JSV tends to write initial checks of between $4 million and $6 million, preferring a more concentrated portfolio to spreading its bets.\n\nWhen it does pull the trigger, it’s typically to fund a company that’s already seeing a million dollars in annual recurring revenue, though he says marketplaces can be “pre-revenue” as long as they’re able to show traction on both the supply and demand side. For example, JSV led the Series A round last year in LA-based CREXi, a four-year-old commercial real estate marketplace and technology platform for buyers, brokers, agents and tenants. At the time, it had no revenue, but it could apparently show demand on the part of brokers wanting to list properties on its platform.\n\nGenerally speaking, says Gretsch, JSV looks to own 15 to 20% of a company — which is down from 20 to 25 percent in years past, owing to companies raising larger and sometimes continuous seed rounds.\n\nOf course, it also means that companies are further along by the time JSV seems them, and they very typically have customers using the product already. In fact, Gretsch notes that these days, JSV spends “most of our time focusing on customer references, because if customers are singing your praises, that says a lot.”", "description": "Jackson Square Ventures (JSV), an eight-year-old, San Francisco-based early-stage venture firm that takes its name from the neighborhood in San Francisco where it’s headquartered, has closed its third fund with $193 million in capital commitments — a sizable step up from its first two funds, which had both rounded up roughly $120 million from the […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/Screen-Shot-2019-10-14-at-11.25.34-AM.png?w=512", "published_at": "2019-10-14"}