{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7580911/The-Vatican-launches-85-Click-Pray-rosary-beads.html", "downloaded_at": "2019-10-16 21:42:40.774246+00:00", "title": "The Vatican launches £85 'Click to Pray' rosary beads", "language": "en", "text": "The Vatican has launched 'Click to Pray' rosary beads that connect to smartphones in a bid to attract younger, more digital-savvy generations to the Church.\n\nThe so-called 'eRosary' can be worn as a bracelet and connected to smartphones by a mobile app that's activated by making the sign of the cross.\n\nThe rosary bracelet by 'Click to Pray' is compatible with an iOS and Android app and can be ordered from Amazon.it for £85 ($110).\n\nIt features 10 black agate and hematite rosary beads, and a silver 'smart cross'.\n\nThe Vatican has launched 'Click to Pray' eRosary beads (pictured) that connect to smartphones in a bid to attract younger and more digital-savvy generations to the Church\n\nClick to Pray said in a statement: 'Aimed at the peripheral frontiers of the digital world where the young people dwell, the Click To Pray eRosary serves as a technology-based pedagogy to teach the young how to pray the Rosary, how to pray it for peace, how to contemplate the Gospel.'\n\nChristians wanting to use the electronic device for their prayers must first download the 'Click to Pray eRosary' app, which the bluetooth-friendly and water-resistant bracelet then syncs to.\n\nTaiwan-based tech company GadgTek Inc (GTI) developed the eRosary as part of Pope's Worldwide Prayer Network initiative.\n\nOnce activated, the 'Click to Pray' app offers the wearer to pray the standard rosary, a contemplative rosary or a 'themed' rosary, with options including Laudato Si, migrants and refugees, vocations, and young people.\n\nThe eRosary features 10 black agate and hematite rosary beads, and a silver 'smart cross'\n\nThe app tracks the wearer's progress during each prayer and logs each rosary completed. It also contains a selection of prayers and songs.\n\nAccording to the organisation's website, the app 'connects you with thousands of people who, in all the continents, are praying every day for the challenges of humanity and for the mission of the Church as the Pope proposes in his monthly prayer intentions.'\n\nIt 'offers you three brief moments of prayer each day' and people are 'invited to join the Pope's call to connect your heart with others seeking to serve the mission of Jesus.'\n\nThe website added: 'In addition to daily prayer, the device also records and provides your health data, so you are encouraged to have a better lifestyle.'", "description": "The Vatican has launched 'Click to Pray' eRosary beads which connect to your smartphone via the 'Click to Pray eRosary' app and can track the wearer's progress during each prayer.", "authors": ["Sophie Tanno For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/19/19801584-0-image-a-32_1571250833139.jpg", "published_at": "2019-10-16"}