{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/nationals/fourteen-years-after-baseballs-return-to-dc-the-original-nats-love-what-theyre-seeing/2019/10/17/d9e0f4a0-f10a-11e9-b648-76bcf86eb67e_story.html", "downloaded_at": "2019-10-18 01:11:25.046499+00:00", "title": "The 2005 Nationals brought baseball back to D.C. They love what they're seeing now.", "language": "en", "text": "No, this isn’t their town, and this isn’t their team. But man, when the current Nats won their first pennant Tuesday night, the guys who first wore white jerseys with “Nationals” (and, later, “Natinals”) across their chests watched with interest.\n\n“You get goosebumps,” said Schneider, the catcher. “You see the Lerners. You see the fans. They went through a lot — not just to have a team taken away, but when it came back they struggled for all those years. It’s the whole picture: playing at RFK, opening the new stadium. Then you watch them celebrate, it’s awesome.”\n\nAD\n\nAD\n\nThe 2005 Nationals didn’t choose to be in the position they were in, ambassadors of baseball in a city that had been without the sport since 1971. They arrived that April having no idea where to live, where to eat, how they would be received — or what, all these years later, they would mean.\n\nIt says here they should mean something to the current group, because they still clearly remember that summer, and all the struggles that followed.\n\n“To see the joy on the fans’ faces when we came back, that’s what it’s all about,” said Cordero, the closer. “Seeing how happy they were back then, and seeing how happy they were [Tuesday] night, it honestly made me tear up a little bit. To see them go through all those down years as fans, all the hard times and all that heartbreak, it made me so happy to see everybody enjoy it.”\n\nAD\n\nAD\n\nPause the memories for a minute, and let’s do this: Next Friday, Washington will host its first World Series game in 86 years. There will be at least two and likely three games at Nationals Park. Each ceremonial first pitch should be treated as an opportunity.\n\nBecause this is Washington, there is the unique chance to ask the President. That’s what the Nats and Major League Baseball did in 2005, when Schneider was on the receiving end of George W. Bush’s high strike on Opening Night. He still has a framed photo of the moment on the wall in his office. Indeed, Washington’s other appearances in the World Series — as the Senators in 1924, ’25 and ’33 — were marked by presidential first pitches from Calvin Coolidge and Franklin D. Roosevelt.\n\nPresident Trump turned down an invitation to throw out the first pitch at Nats Park on Opening Day 2017. What would the reception be, in this town at this time, for the sitting president to accept the honor? I’ll let others discuss.\n\nAD\n\nAD\n\nThere are, after all, three games, and other options. Joe Gibbs comes to mind. So do John Riggins and Art Monk and Darrell Green. Alex Ovechkin is the most deserving Capital and a Stanley Cup-winning icon, but he got the honor before Game 4 of the National League Division Series. Elena Delle Donne went on the night the Nats closed out St. Louis in the NLCS. Bradley Beal and John Wall? Wes Unseld actually won a title here and would probably be a better choice.\n\nA D.C. celebrity? Who are we talking about? Wolf Blitzer? Let’s . . . not.\n\nHere, instead, are two options: Find as many of the 2005 Nats as you can, send them plane tickets, and line them up across the infield to throw a dozen first pitches at once.\n\nAD\n\nOr even better, recreate that first night at RFK Stadium, April 14, 2005, when that first Nats team ran onto the field, where they greeted old Senators who once manned those same spots. Brad Wilkerson would be in left to meet Juan Soto, Ryan Church in center for Victor Robles, José Guillen in right, Vinny Castilla at third, Cristian Guzman at short, Jose Vidro at second, Johnson at first and Schneider behind the plate. Then have Livan Hernandez, who threw the first real pitch (as well as 120 others) against Arizona, and Cordero, who closed it out, make the ceremonial tosses to Schneider and Bennett.\n\nAD\n\nKinda makes you wish Frank Robinson were around to oversee it all.\n\n“I loved Frank,” Cordero said.\n\nAD\n\n“I loved Frank,” Johnson said.\n\nWhen Robinson, the Hall of Famer who managed those Nats, passed away in February at 83, Schneider, who was then the catching coach for the Miami Marlins, took two days off from spring training and flew to Los Angeles for his funeral. Carroll got out all his old Montreal Expos gear and wore it to his son’s Little League practice so he would be asked about it, so he could have the opportunity to talk about the man he once played for.\n\n“You’d knock on his door,” Schneider remembered, “and he’d yell, ‘What do you want?’ and say to get out and start cursing. Then you’d sit down in a chair, and before you know it, an hour later, you’re still talking to him.”\n\nAD\n\nSo, another first-pitch consideration: Frank’s widow Barbara, and/or his daughter Nichelle.\n\nAD\n\nThese choices won’t impact the games. Still, why not make a memory? With the pennant secured, this year is unlike any in Nationals’ history. But 2005 is unlike any year in baseball history.\n\nYes, other teams have relocated, but none in these circumstances. As the Expos, many of those guys had endured a regular season with “home” games split between Montreal and Puerto Rico. Because they were owned by Major League Baseball, their roster had been limited by budget constraints. So Jim Bowden, hired by MLB in the offseason as the general manager, assembled a group that was, um, eclectic.\n\nAD\n\n“From a personality and different-characters-in-the-clubhouse perspective, it was a wide spectrum,” said Bennett, the backup catcher. “That was another unique part of that season. You’d have somebody over here, and across the clubhouse you’d have a complete 180. I think that made it a lot of fun.”\n\nAD\n\nEven more reason to bring them back. You remember Guillen, the snap-at-any-moment slugger. But there was Joey Eischen, the say-anything lefty reliever. Carlos Baerga, the veteran infielder, had so many quips that Carroll printed up T-shirts with all his favorite sayings. I’m not sure Johnson took off that shirt all year.\n\n“Baerga was the biggest character of them all,” Carroll said. “He reminds me of what Parra’s bringing to the team now.”\n\nAD\n\nSee. They’re paying attention.\n\nLast year, when Washington hosted the All-Star Game, MLB invited several of those former Nats to town. Some hadn’t seen each other in years.\n\n“It’s like nothing’s changed,” Cordero said.\n\nThey’re not Hall of Famers. Their teams didn’t win. They weren’t sure what the reception would be like.\n\n“They were like, ‘Go sign autographs,’ and I even doubted myself,” Carroll said. “I was the utility guy. Who would show up? But there was way more support than I anticipated. You realize, ‘Huh, I was really part of something cool, something not too many people can say they were a part of.’ ”\n\nAD\n\nThey carry pieces of it to this day. Bennett has his batting helmet, some jerseys and a couple bats signed by the boys. Carroll has a poster of the first pitch at RFK, issued by The Post, hanging in his office (the same poster I have in mine). They all have ties to one Nat: Ryan Zimmerman was a 20-year-old third baseman when he was called up that September. Now, he’s a 35-year-old first baseman in uncharted waters.\n\n“To see Zimmy,” Schneider said, “I can’t get a smile off my face when I see him on TV.”\n\nFind them. Bring back as many as want to come. Give them a ball. Tell them to pitch. The 2005 Nationals understand Washington as a baseball city in a way no other group does. In a weird way, this pennant matters to them. They should be made to feel like they matter, too, because they do.\n\nFor more by Barry Svrluga, visit washingtonpost.com/svrluga.\n\nAD", "description": "Members of the 2005 team remember it all from back then and are reveling in it all right now.", "authors": ["Barry Svrluga", "Sports Columnist With Beat Writing Experience On Baseball", "Golf", "The Nfl", "College Basketball", "College Football", "Sports Columnist"], "top_image": "https://www.washingtonpost.com/resizer/fy87kGa6VV0NVewqDQ8FJpePGXI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/G2QT5PXRC4I6TBUT6SD6IZ4EVI.jpg", "published_at": "2019-10-17"}