{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/urine-soaked-bed-elderly-mum-20546061", "downloaded_at": "2019-10-09 18:58:49.217905+00:00", "title": "Mum, 72, 'left to die by sons in urine-soaked bed with bedsores down to bone'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAn elderly mum was left to die by her own sons on a urine-soaked mattress, a court heard.\n\nShirley Thompson died of blood poisoning on September 2, 2017, suffering from infected bedsores down to the bone and a serious wound the size of a fist.\n\nThe 72-year-old's two sons, Phillip Thompson, 43, and his brother David Thompson, 40, are on trial for her manslaughter.\n\nPhotos shown at New South Wales Supreme Court in Australia show the stained mattress where Ms Thompson lay for months.\n\nOn August 23, 2017 paramedics found her naked on the bed when David finally called an ambulance.\n\nHe told the control room his bedridden mother couldn't eat and had a wound on her backside, the court heard on Monday.\n\n(Image: AAP/PA Images)\n\nShe was rushed to Blacktown Hospital where she died little more than a week later.\n\nBoth brothers have pleaded not guilty and are being tried by a judge alone.\n\nProsecutor Jeff Tunks said Ms Thompson became extremely isolated after her husband's death in 2012.\n\nHe said she was totally dependent on her sons for her nutrition, mobility, and personal hygiene.\n\nHe told the court the brothers were aware in the weeks before her death that their mum's condition was deteriorating.\n\nParamedic Megan Kuhner, who attended the Greystanes house after the triple-zero call, said Ms Thompson's room had a stench and smelt 'really poorly'.\n\nEverything was filthy and when Ms Kuhner first looked at the floor she thought it was just dirt and not actually carpet.\n\n(Image: AAP/PA Images)\n\nThe patient, whose pallor was almost greyish, was lying in bed on a towel smelling of urine.\n\n\"It was quite disgusting,\" Ms Kuhner said. \"It was just soaked in urine and faecal matter.\"\n\nMs Thompson had bruises, pressure sores and a large open wound on her bottom, a wound which contained faecal matter.\n\nWhen asked about medical treatment, David Thompson told her: \"She doesn't like to see doctors. She is very stubborn.\"\n\nMs Kuhner noticed both sons were quite clean despite the house being filthy.\n\nAt one stage, Ms Thompson told her: \"I am so thankful to have my sons.\"\n\nTriage nurse Lauren Cole said Ms Thompson was pale and generally unkempt and smelt of urine.\n\n(Image: AAP/PA Images)\n\nShe had a deep, red inflamed wound on her bottom which was 'the size of my fist and I could put my fist in it'.\n\nBut defence lawyers told Justice Des Fagan the case was about choices made by the mother, who had previously refused any medical care.\n\n\"We say Shirley Thompson died because of choices she herself made,\" Tony Evers, acting for the younger brother, said.\n\nHe claimed she made choices about when, if and what to eat, about using the bathroom and about not seeking medical help.\n\n\"It is true the house could have been cleaner, but of course he was not a professional. He was her son,\" he said.\n\n(Image: AAP/PA Images)\n\nJanet Manuel, for Phillip Thompson, said her client was employed full-time and had provided the income for the family while his brother looked after the household.\n\n\"The Crown is unable to prove beyond a reasonable doubt that Shirley Thompson lacked the capacity to make decisions for her own care,\" she said.\n\nIn his police interview, David Thompson said his mother refused to seek medical help after he noticed 'a thing on her backside like a sore'.\n\nAsked why he didn't just ring an ambulance himself, he said: \"I love her and I didn't want to upset her in any way.\"\n\nThe trial continues.", "description": "Naked Shirley Thompson died from blood poisoning caused by infected bedsores at her home in Sydney, Australia", "authors": ["Tom Davidson", "Image", "Aap Pa Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20546068.ece/ALTERNATES/s1200/0_Thompson-Brothers-Court.jpg", "published_at": "2019-10-09"}