{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/25/WS5db29dada310cf3e35573a9c.html", "downloaded_at": "2019-10-25 16:23:06.580130+00:00", "title": "Acclaimed violinist and conductor Zukerman returns to Beijing", "language": "en", "text": "By Chen Nan | chinadaily.com.cn | Updated: 2019-10-25 15:01\n\nMaestro Pinchas Zukerman [Photo provided to China Daily]\n\nAfter a ten year absence, Maestro Pinchas Zukerman returned to the Beijing Music Festival with the Adelaide Symphony Orchestra to conduct a performance of Ludwig van Beethoven's Egmont, Op.84 and Edward Elgar's Enigma Variations, Op.36. Zukerman also performed as a soloist for Wolfgang Amadeus Mozart's Violin Concerto No. 5 in A major, K. 219.\n\nThe internationally acclaimed violinist and conductor is a frequent visitor to China. The three selected music pieces performed during the Beijing Music Festival are some of the greatest classical works frequently performed worldwide.\n\nThe Egmont Overture was composed by Beethoven between 1809-1810 in parallel with a play of the same name in 1787 by Johann Wolfgang van Goethe. The story centers around Dutch nobleman, Count Egmont, whose life and heroism is expressed boldly through the composer's music.\n\nMozart wrote the Violin Concerto No. 5 when he was 19 years old which premiered during the Christmas season that year in Salzburg.\n\nThe last piece of the concert was Elgar's Enigma Variations, a series of 14 short musical portraits and premiered in London on June 19, 1899. Elgar created miniature portraits of his closest friends through his music, as well as of his wife and himself.\n\nThis year marks the 120th anniversary of the piece's premiere in London.", "description": "After a ten year absence, Maestro Pinchas Zukerman returned to the Beijing Music Festival with the Adelaide Symphony Orchestra to conduct a performance of Ludwig van Beethoven's Egmont, Op.84 and Edward Elgar's Enigma Variations, Op.36. Zukerman also performed as a soloist for Wolfgang Amadeus Mozart's Violin Concerto No. 5 in A major, K. 219.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/25/5db29dada310cf3e97a2f9c9.jpeg", "published_at": "2019-10-25"}