{"pub": "nymag", "url": "https://vulture.com/2019/10/dickinson-apple-tv-review.html", "downloaded_at": "2019-10-29 23:56:11.549216+00:00", "title": "Dickinson Is a Different, Better Kind of Origin Story", "language": "en", "text": "Hailee Steinfeld stars as Emily Dickinson, reimagined as a rebellious queer, goth goofball, in the new Apple TV+ comedy. Photo: Apple TV+\n\nIn 1998, former U.S. poet laureate Billy Collins published a poem called “Taking Off Emily Dickinson’s Clothes.” “I proceeded like a polar explorer,” the poem goes, “through clips, clasps, and moorings / catches, straps, and whalebone stays, / sailing toward the iceberg of her nakedness.” When the narrator works his way through all her many layers of clothing and reaches the boundary of her corset, he says, “I could hear her sigh when finally it was unloosed.”\n\nCollins’s image of Dickinson — strapped into her repressive clothing, standing at her window in silence — would not be that out of place on Dickinson, a new comedy arriving November 1 on the brand-new Apple TV+ streaming platform. The difference is that in a scene from episode three that’s almost analogous to Collins’s undressing image, Emily (Hailee Steinfeld) stands in front of a mirror and frantically lifts up all her many layers of clothing, her dress and petticoat and underskirt and God knows what else. She finally gets to the bottom-most layer and wails “Noooooooo!” in exaggerated despair, before falling to the floor and dragging herself over to the bed as though her legs have stopped working. Her friend, lover, and soon-to-be sister-in-law Sue (Ella Hunt) rushes over to ask her what’s wrong. “Life is an endless sea of pain!” Emily moans. “I got my period.”\n\nIt was then that I decided I loved Dickinson.\n\nI had been onboard earlier, but it’s hard to get a handle on Dickinson’s tone. It’s part queer teen romance, part silly literary revisionism, part high-school comedy, and part pure absurdism. It’s also yet one more example of what my colleague Bilge Ebiri described as the “Who Fucks Industrial Complex,” a wave of entertainment that works by taking characters like Archie, Nancy Drew, and Sabrina the Teenage Witch, and reimagining them as people with sex lives. They are human beings with functioning endocrine systems. They are people with desires that extend beyond mere hand-holding and an occasional peck on the cheek.\n\nThe inherent appeal of the Who Fucks genre is the way it rehabilitates familiar figures, taking characters who’d been stuck in airless, inhuman stories, and reframing them as fully dimensional, flawed people. It’s related to the superhero-origin-story trend, another way to rewind a particular narrative about who a person is and retell the story in a way that takes trauma or grief more seriously. (Superhero origin stories, for whatever reason, almost never emphasize the Who Fucks element. It’s always Who Broods Endlessly Rather Than Having Productive Conversations With a Therapist.)\n\nThe thing is that not all humanizing looks the same. You only have to look at the space between Dickinson and Billy Collins’s “Taking Off Emily Dickinson’s Clothes” to see two possible poles of difference. In one, Emily Dickinson is a figure to be discovered, and in the other, she’s the one demanding her own power. In Collins’s poem, even thinking of Dickinson’s body is radical. It’s subversive to imagine that she possesses human flesh somewhere underneath her carapace of corsets. In Dickinson, Emily is the one at war with her own embodiment. She’s fascinated by the idea of death, and she’s stuck inside an unruly body that longs for women rather than men and also has to deal with menstruation at a time before ibuprofen or tampons. In Dickinson, Emily can take off her own clothes, thank you very much.\n\nThat’s not a full accounting of what Dickinson is trying to accomplish; it’s so much sillier and weirder than that. Toby Huss wanders around in a nightshirt as Emily’s father, delivering apologies after issuing harsh edicts about inappropriate behavior. Jane Krakowski buzzes around the house as Mrs. Dickinson; by episode three she walks right up to the line of teetering over the edge into fully unhinged, and I hope in future episodes she takes the leap. Meanwhile, Emily’s sister Lavinia (Anna Baryshnikov) is already there. In one of my favorite shots of the first three episodes, Lavinia wonders to herself whether she’s been knitting all day long, and with no further commentary or winking, the scene briefly cuts to an image of a scarf trailing out of the room and down the hallway.\n\nAs illustrated by the scarf gag, Dickinson has a sense of humor that bounces between goofy and grim. Wiz Khalifa appears in Emily’s dreams as a chilled-out, tiny-sunglasses-wearing Death, who rides around in a black carriage with a fully stocked bar. The repeated jokes about Sue’s orphanhood are so bleak it’s easy to misread them as not intentionally jokes (although I’m almost positive they are). In episode three, Jason Mantzoukas has a cameo while Emily is high on opium, and that’s the most I’ll say about that. It is Emily Dickinson by way of Daniel Ortberg, A Knight’s Tale, Gossip Girl, and Daria. If in a future season Cardi B shows up playing Elizabeth Cady Stanton, it would feel entirely appropriate.\n\nThe thing about the Who Fucks Industrial Complex, after all, is that it’s not just about the Who, and it’s definitely not just the sex. It’s also not about accuracy. This Emily Dickinson likely looks as much like the Dickinson of the historical record as Christian Bale’s Batman looks like Adam West’s. It’s not quite the same: Dickinson was a real woman, and reimagining her has different implications than rewriting the backstory of a fictional character. But Dickinson’s not making a claim about literal truth — the scarf that winds its way several feet down the hallway should be enough to communicate that, if Wiz Khalifa’s Death hadn’t already. It’s making a claim about how we should handle our historical icons, and what their iconography can withstand. We will not lose the beauty of Emily Dickinson’s work if we giggle while imagining her writing it while throwing an epic house party when her parents are out of town.\n\nDickinson is a different kind of origin story, one that co-opts the myth of Emily Dickinson to peel her out of her corset and imagine her as a rebellious queer, goth goofball. She is too death-obsessed to fall into the trap of the blockheaded Badass Feminism in Hulu’s Handmaid’s Tale, and she’s too snide and whiny to be mistaken as a heroic figure. She is Emily Dickinson, messy and horny and smart and very, very fun to watch.", "description": "A review of the new Apple TV+ comedy “Dickinson,” starring Hailee Steinfeld as Emily Dickinson, Ella Hunt as her friend, lover, and soon-to-be sister-in-law Sue, Toby Huss and Jane Krakowski as her parents, and Wiz Khalifa as Death.", "authors": ["Kathryn Vanarendonk"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/29/29-dickinson.w1200.h630.jpg", "published_at": "2019-10-29"}