{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/2019/10/27/political-courage-age-trump", "downloaded_at": "2019-10-28 00:30:40.577303+00:00", "title": "Political courage in the Age of Trump", "language": "en", "text": "As the curator of the #ToddlerinChief thread, I can assure you that this will drive the president bonkers. While observed instances of toddler behavior from the president have skyrocketed since August, his peak toddler output came in late August and early September 2018. It was when that op-ed landed at the same time as Bob Woodward’s “Fear” and Arizona U.S. Sen. John McCain’s funeral.\n\nThis column, however, is not about Trump but about the Beltway reaction to this book. Anonymous’s return has inspired a fair amount of derision within the chattering class. Axios reporter Jonathan Swan tweeted, “Is this douchebag still quietly, oh so quietly, saving the republic? Spare us.” Soledad O’Brien wrote, “Don’t be an anonymous coward.” You get the gist.\n\nAD\n\nAD\n\nThis reaction is surprising to me. As the announcement noted, the author has taken no advance (the easiest and safest way for authors to make money) and intended to donate a large fraction of the royalties to nonprofit organizations. That is certainly more altruistic than most authors I know. As Politico’s Jack Shafer noted Wednesday, an awful lot of folks in Washington talk to reporters under the cloak of anonymity. James Madison, Alexander Hamilton and John Jay published the Federalist Papers under the guise of “Publius.” This anonymous senior official is not even remotely in the league of the Founding Fathers, but Shafer is not wrong about how well that op-ed has aged:\n\nTime has been remarkably good to Anonymous’ op-ed. When first published, it seemed vague, unnecessarily guarded and excessively self-congratulatory about its own courage. But read in the context of what we’ve learned since about resistance by senior officials to President Donald Trump’s orders, the op-ed seems a lot smarter. The op-ed boasted that the Trump administration was filled with many senior administration officials “working diligently from within to frustrate” parts of Trump’s “agenda and his worst inclinations.” A steady stream of news stories has appeared — and continues to appear almost daily — confirming the assertion of aggressive sandbagging of the president by top administration officials.\n\nSo why the blowback? I suspect because this announcement happened during the same moment that a number of civil service and political appointees have demonstrated far more courage than the anonymous senior official. The author of “A Warning” still has the cloak of anonymity. Current and former officials such as Laura Cooper, Fiona Hill, William Taylor, Marie Yovanovitch, Michael McKinley, George Kent and Philip Reeker defied the Trump White House and agreed to testify in front of the House impeachment inquiry. Unlike the author of “A Warning,” they don’t have the luxury of thinking about lucrative book contracts; they are probably concerned about their mortgages and their legal fees. Nonetheless, they have all spoken truth to power in a far braver and riskier way than the op-ed writer.\n\nMany Trump officials have consoled themselves with leaking damaging tidbits and writing anonymous op-eds. But the people brave enough to follow rules and go on record—Fiona Hill, Bill Taylor, the whistleblower who started it all—are the one who actually protected this country. — Susan Hennessey (@Susan_Hennessey) October 23, 2019\n\nThe contrast between these people and, say, Jim Mattis is also striking. Ever since he stepped down, the former defense secretary has been attempting to walk a tightrope between discretion and discussion about his time in the Trump administration, but with a strong bias toward the former. He has gotten even more closemouthed about Trump since plumping his book on Sunday morning talk shows. Despite many commentators begging him to start talking, he keeps acting like a retired military officer rather than a former civilian official. Even though former military officers are speaking out about Trump, the most Mattis can do is joke about him.\n\nAD\n\nAD\n\nLet’s stipulate that those testifying as part of the House impeachment inquiry deserve praise for greater political bravery than Mattis or the anonymous official. And sure, I would love for Mattis or Rex Tillerson or H.R. McMaster or John Kelly to be more forthcoming about Trump’s unfitness for office.\n\nBut perhaps we need to judge the political courage of these folks against a slightly different standard. Like, say, members of Congress.\n\nRecently, after the Trump White House announced the 2020 Group of Seven summit would be hosted at his Doral, Fla., resort but before Trump backed down, Sen. Kevin Cramer (R-N.D.) praised the announcement, saying, “It may seem careless politically, but on the other hand there’s tremendous integrity in his boldness and his transparency.” Sen. Rick Scott (R-Fla.) said, “There’s no conflict of interest in holding anything in the great state of Florida.” When Trump backed down, it was not because of these two clowns.\n\nAD\n\nAD\n\nThen there are the GOP members of the House of Representatives.\n\nTried to ask Rep. Mo Brooks about Taylor testifying that he had been told Trump wanted probes announced before releasing aid and he erupted over the question. \"The opening statement doesn't make any difference!\" he said. Asked about the substance, \"it doesn't make any difference\" pic.twitter.com/1O7KXkvClE — Manu Raju (@mkraju) October 23, 2019\n\n.@Jim_Jordan defends Trump calling the impeachment inquiry a \"lynching\": \"The president's frustrated.\" pic.twitter.com/MZ9oCoPJnp — Oliver Willis (@owillis) October 22, 2019\n\nThis is an awfully long way from John F. Kennedy writing, “When party and officeholder differ as to how the national interest is to be served, we must place first the responsibility we owe not to our party or even to our constituents, but to our individual consciences.\"\n\nIn a party filled with toadies and sycophants, any form of backbone or dissent from “the genius of our great President” mantra should be welcomed by critics of this administration. In normal times, I would want former chief of staff John Kelly to flatly state that Trump is unfit for office. In these times, well, I can live with Kelly telling the Washington Examiner’s David Drucker, “Someone has got to be a guide that tells [Trump] that you either have the authority or you don’t, or Mr. President, don’t do it. Don’t hire someone that will just nod and say, ‘That’s a great idea Mr. President.’ Because you will be impeached.”\n\nAD\n\nAD\n\nWatergate did not end Richard Nixon because Deep Throat came forward out of the goodness of his heart. It happened in part because Mark Felt was hoping to use the scandal to advance his own career. One can praise the political courage of people including Yovanovitch or Cooper without rejecting what anonymous officials have to say in books. In a world in which GOP members of Congress are terrified of the base, even mild forms of dissent from the party line should be encouraged.\n\nAD", "description": "Are we defining political courage down?", "authors": ["Daniel W. Drezner", "Daniel W. Drezner Is A Professor Of International Politics At The Fletcher School Of Law", "Diplomacy At Tufts University", "A Regular Contributor To"], "top_image": "https://www.washingtonpost.com/resizer/8O7En7jtX6IYE8HvRTOO7UG61uw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4BOVOMVOZQI6RC2TKAIWO2HETE.jpg", "published_at": "2019-10-27"}