{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/10/unknown-british-soldiers-finally-laid-rest-100-years-since-died", "downloaded_at": "2019-10-10 15:11:42.539347+00:00", "title": "Unknown British soldiers finally laid to rest more than 100 years since they died after crowdfunded project recovers their bodies", "language": "en", "text": "For over a century they had lain in the earth at the place they fell, near the strategically important Messines Ridge overlooking the Belgian town of Ypres.\n\nOver a hundred soldiers from both sides of the First World War had been lost in the ground, after the site had changed hands four times during the fighting.\n\nBut on Wednesday, as a light drizzle fell onto the shoulders of the bearer party, two unknown British soldiers were finally laid to rest at the culmination of a crowdfunded archaeological project that has discovered 110 previously missing servicemen.\n\nThe service was conducted by Father Patrick O’Driscoll, Chaplain to the 1st Battalion The Royal Regiment of Fusiliers, the present-day unit formed from the Royal Fusiliers (City of London Regiment) in which the fallen men had served.\n\nServing Fusiliers from the Regiment formed the bearer and firing parties.\n\nFather O’Driscoll said: “We come together today to remember and thank these men for their great sacrifice in fighting and dying together as one. Even though we do not know their names, we remember their humanity and courage and that even in the hell of battle they were there for each other even to death.\n\n“So in prayer and celebration we place these men together in this consecrated", "description": "For over a century they had lain in the earth at the place they fell, near the strategically important Messines Ridge overlooking the Belgian town of Ypres.", "authors": ["Dominic Nicholls", "Defence", "Security Correspondent", "Benedict Spence", "Charlotte Gill"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/10/TELEMMGLPICT000212596877-xlarge_trans_NvBQzQNjv4BqDWe775LjDCVm_2Dq6YUMoGclioocPp7CdIUOTtw1IRI.jpeg?imwidth=1200", "published_at": "2019-10-10"}