{"pub": "thehill", "url": "https://thehill.com/policy/international/465411-dismissed-ukraine-ambassador-blames-ouster-on-a-concerted-campaign", "downloaded_at": "2019-10-11 19:57:39.409762+00:00", "title": "Dismissed Ukraine ambassador blames ouster on 'a concerted campaign against me'", "language": "en", "text": "The former U.S. ambassador to Ukraine told congressional investigators on Friday that President Trump Donald John TrumpDemocratic 2020 hopefuls tout LGBTQ plans at town hall Trump defends Syria move at rally: 'Bring our troops back home' Pompeo adviser resigning: report MORE recalled her to Washington after \"a concerted campaign against me\" that included unfounded allegations, according to a copy of her opening statement.\n\nADVERTISEMENT\n\nMarie Yovanovitch said that Deputy Secretary of State John Sullivan told her that she had \"done nothing wrong and that this was not like other situations where he had recalled ambassadors for cause.”\n\nSullivan said President Trump had \"lost confidence in me and no longer wished me to serve as his ambassador,” Yovanovitch said in her testimony.\n\nShe also said that the State Department had \"been under pressure from the president to remove me since the summer of 2018.”\n\nThe New York Times and The Washington Post both published the opening statement, which was given to three congressional committees hearing closed-door testimony as part of an impeachment inquiry against Trump.\n\nThe impeachment inquiry was triggered by a whistleblower complaint that alleged Trump pressured Ukraine's leader to conduct an investigation of former Vice President Joe Biden Joe BidenDemocratic 2020 hopefuls tout LGBTQ plans at town hall Trump bashes Biden at Minnesota rally, asks 'Where's Hunter? 'Off-script' Trump rails against impeachment, Democrats at feisty rally MORE related to corruption in Ukraine. The whistleblower said administration officials were worried that Trump had used his office for personal gain on the call, and that they had sought to cover it up.\n\nYovanovitch expressed extreme surprise at her removal, saying that while she understood “that I served at the pleasure of the President, I was nevertheless incredulous that the U.S. government chose to remove an Ambassador based, as best as I can tell, on unfounded and false claims by people with clearly questionable motives.”\n\nShe discussed what she described as “attacks” from former New York City Mayor Rudy Giuliani Rudy GiulianiPompeo adviser resigning: report 'Off-script' Trump rails against impeachment, Democrats at feisty rally Trump's former Ukraine envoy was dismissed after she pushed Giuliani to go through official channels: report MORE, who is acting as Trump's personal attorney, in regards to her removal.\n\nShe said she had only met with Giuliani a handful of times, but suggested two associates of his who were arrested on campaign finance charges on Wednesday may have played a role in her ouster.\n\n“With respect to Mayor Giuliani, I have had only minimal contacts with him—a total of three that I recall,” Yovanovitch said. “I do not know Mr. Giuliani’s motives for attacking me. But individuals who have been named in the press as contacts of Mr. Giuliani may well have believed that their personal financial ambitions were stymied by our anti-corruption policy in Ukraine.”\n\nThe two men arrested at Dulles Airport on Wednesday are Lev Parnas and Igor Fruman, who were reportedly helping Giuliani investigate Biden.\n\nYovanovitch blasted the efforts to promote what she described as “baseless conspiracy theories” that she warned undermined U.S. foreign policy.\n\n“The harm will come when private interests circumvent professional diplomats for their own gain, not the public good,” Yovanovitch said.\n\n“Our efforts were intended, and evidently succeeded, in thwarting corrupt interests in Ukraine, who fought back by selling baseless conspiracy theories to anyone who would listen. Sadly, someone was listening, and our nation is the worse off for that,” Yovanovitch said.\n\nShe noted that her removal occurred during an “especially challenging time in bilateral relations,” and when the U.S. Embassy in Ukraine most needed “continuity\" due to the election of a new Ukrainian president.\n\nYovanovitch also focused her opening statement on expressing serious concerns around the Trump administration’s support of the State Department, saying that the “basic understanding” that the government will protect diplomats “no longer holds true.”\n\n“Today, we see the State Department attacked and hollowed out from within,” Yovanovitch testified. “State Department leadership, with Congress, needs to take action now to defend this great institution, and its thousands of loyal and effective employees.\n\n\"We need to rebuild diplomacy as the first resort to advance America’s interests and the front line of America’s defense. I fear that not doing so will harm our nation’s interest, perhaps irreparably.\"\n\nDespite her criticism of the Trump administration, Yovanovitch emphasized that the idea she was “disloyal” to Trump was “fictitious,” pushing back against allegations that she told embassy staff to ignore Trump’s orders due to the likelihood that he would be impeached.\n\nThe intelligence community whistleblower complaint alleged that the then-prosecutor general Yuri Lutsenko accused Yovanovitch of giving him a \"do not prosecute\" list. Lutsenko later retracted his remarks.\n\nYovanovitch denied the allegations in her prepared remarks, stating that \"I have never myself or through others, directly or indirectly, ever directed, suggested, or in any other way asked for any government or government official in Ukraine (or elsewhere) to refrain from investigating or prosecuting actual corruption.\"\n\nYovanovitch appeared for testimony on Capitol Hill despite the White House announcing earlier this week that the Trump administration would not comply with the House impeachment inquiry, citing the lack of a formal vote to authorize the investigation.", "description": "The former U.S.", "authors": [], "top_image": "https://thehill.com/sites/default/files/yovanovitchmarie_101119getty.jpg", "published_at": "2019-10-11"}