{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/where-do-i-find-my-clipboard-history-on-a-pc-or-mac", "downloaded_at": "2019-09-30 04:04:53.300888+00:00", "title": "Ask LH: Where Do I Find My Clipboard History On A PC Or Mac?", "language": "en", "text": "Dear Lifehacker. Many times, I copy something to my clipboard, and before pasting, I accidentally overwrite it by copying something else. How do I find the ‘history’ of what I’ve copied to my clipboard? Is there any app that can help? Thanks, CTRL+C Snafu\n\nDear CTRL+C Snafu,\n\nYou neglected to specify what operating system you use, Sunny, but that’s fine! I’ll cover both Windows and macOS, so everyone can figure out how to restore that which they accidentally overwrote on their clipboards. (And, yes, this is a problem I have, too, so I’m glad we’re talking about it.)\n\nTo start, I’m going to assume you’re on Windows 10 (if you’re a Windows user), and you’re running the latest version of the operating system. Open up the Settings app, click on System, scroll the left sidebar down a bit, and click on Clipboard. I’ve already enabled my Clipboard History, so your screen should look kind of like this—but you’ll want to enable your Clipboard History if it’s unchecked.\n\nScreenshot: David Murphy\n\nScroll down a bit, and you can also use this screen to clear your clipboard history:\n\nScreenshot: David Murphy\n\nNow, whenever you press Windows Key + V (not CTRL + V), your clipboard history will pop up on your screen. Click on anything on the list to paste it wherever your cursor happens to be. It’s as easy as that.\n\nEnabling Clipboard History on macOS\n\nYou’ll need a third-party app to enable a true clipboard history on your Mac—the built-in clipboard stores one item and one item only. Some options you can explore include CopyClip, Paste (which is super-expensive), Alfred 4, PasteBot, and the open-source Clipy.\n\nThey’re all pretty easy to use, and they should give you a foolproof method for preserving that which you’ve copied (for a short time, if nothing else). I’d probably go for the free or inexpensive apps first—especially those with some kind of trial—so you can feel out whether it meets your needs before you pay anything, if you even decide to go that route. Really, this should be a staple inclusion in the operating system itself, and I wouldn’t be surprised if Apple dumps this feature into a future version of macOS at some point.", "description": "Dear Lifehacker. Many times, I copy something to my clipboard, and before pasting, I accidentally overwrite it by copying something else. How do I find the ‘history’ of what I’ve copied to my clipboard? Is there any app that can help?...", "authors": ["Jackson Ryan", "Sarah Basford"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/qbzvsdvhc1hpgybjtpw3.jpg", "published_at": "2019-09-30"}