{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/national-memorial-officers-suicide-1.5307588", "downloaded_at": "2019-10-09 08:29:38.248735+00:00", "title": "Call to commemorate officers who died by suicide persists | CBC News", "language": "en", "text": "Etched into the glass panels of the Parliament Hill memorial known as the Honour Roll are the names of the more than 880 Canadian police and peace officers who have died in the line of duty since Confederation.\n\nThe names of officers who have died by suicide aren't included.\n\nThe widow of an Ontario Provincial Police officer who took his own life and a former Ottawa police staff sergeant want that to change.\n\nJosh de Bock died died by suicide in August 2018. At the time, he was working in the force's forensic identification unit.\n\n\"He is a hero in life and in death, and he should be acknowledged and recognized equally as anyone else, any other fallen officer who died in the line of duty,\" said his widow, Loan de Bock.\n\n\"His death was a result of his mental decline, and it was a cumulative toll of police work. And because of that, I believe he deserves to be up there [on the wall].\"\n\nShe submitted an application to the national memorial in March to have his name engraved on the wall. The application was accompanied by a letter of support by then Interim OPP Commissioner Gary Couture, saying he believed de Bock's death the result of mental illness acquired in the line of duty, and a letter from his doctor stating the same.\n\nThe Canadian Police Association sent back a request for more information, including whether his illness was recognized by Ontario's Workplace Safety and Insurance Board and if he had been diagnosed with a mental health condition at the time of his death.\n\nLoan de Bock, right, plans to continue advocating to have the name of her husband Josh, centre, added to the Canadian Police and Peace Officers Memorial Honour Roll. (Loan de Bock)\n\nShe called it \"insulting\" that families are being asked to provide more information, proof, that their loved ones died in the line of duty and mental health issues aren't given the same consideration as physical injuries.\n\n\"It's just saying to the officers that they're not as important as others who have died in the line of duty,\" she said.\n\nShe also believes part of the reason police organizations are dragging their feet is because they don't want to offend families of officers who have been killed on the job.\n\nSyd Gravel agrees.\n\nHe's a former Ottawa police staff sergeant and co-founder of Badge of Life Canada, an organization that helps police and correctional officers deal with mental health issues caused by their jobs.\n\nThey did die, in my opinion, in the line of duty. - Syd Gravel, Badge of Life Canada\n\nGravel was part of the transition team in the 1990s when Ottawa police handed stewardship of the memorial over to the Canadian Police Association. At the time, Gravel said, the idea of including the names of officers who had taken their own lives was raised.\n\nBut according to Gravel, it was family members of fallen officers who objected.\n\n\"Essentially, it was a very sensitive issue for some of the families to accept that someone that died by suicide would be recognized as a line of death duty. The family members made it clear to us as an organizing committee that they weren't comfortable with us including those names at that time,\" he said.\n\nSyd Gravel, a former Ottawa police staff sergeant, co-founded Badge of Life Canada and has been open about his own struggles with PTSD. (CBC)\n\nJob weighs heavily\n\n\"When we look at people who die by suicide, the perspective is that … it's not seen by some as being that death that came about as a result of wearing the uniform, and I think that's the link that's lacking,\" he said.\n\nThe job weighs heavily on officers, Gravel said, and for some it can be too much.\n\n\"People are still not getting that wearing a uniform, seeing over 600 to 900 traumatic events in a career, can potentially be more than anybody can handle.\"\n\nThe Ottawa Police Service's own memorial website lists the names of 14 officers who died in the line of duty between 1929 and 2009, but does not include two officers who took their lives in the past five years, including one who died last week on the eve of the annual memorial weekend for fallen officers on Parliament Hill.\n\nDet. Thomas Roberts, 35, died by suicide at Ottawa police headquarters on Elgin Street on Sept. 27, the eve of a weekend dedicated to the memory of fallen officers. (Ottawa police )\n\nIssue being discussed\n\nIn a statement to CBC News, the Ottawa Police Service wrote: \"Suicides are not considered incidents where an officer was killed in the line of duty.\"\n\nIn August 2018, Toronto police began accepting applications for members who have \"lost their lives because of mental health injuries\" for the service's Memorial Wall after reaching a settlement with the Ontario Human Rights Commission.\n\nOntario's chief coroner investigated the suicides of nine police officers in the province in 2018 alone.\n\nCBC News contacted the organizations responsible for deciding which fallen officers are added to the Honour Roll. The Canadian Police Association, Canadian Association of Chiefs of Police (CACP) and Canadian Peace Officers Memorial Association all declined an interview.\n\nThe CACP and the CPA would only say the issue is part of an ongoing discussion.\n\nTerry Welsh, co-ordinator of the Canadian Memorial Service, confirmed to CBC News that no officer who has died by suicide has ever been included on the Honour Roll. Welsh said one application was received in the past couple years, but was sent back to the police service's chief for more information. He did not name the police force.\n\n'I'm intensely heartbroken'\n\nTo qualify currently, the officer must have been on duty at the time of their death, or, if off duty, must have \"died as a result of an external influence.\"\n\nHowever, the rules also seem to leave the door open, stating: \"Notwithstanding the above, any set of circumstances which led to the death of an officer, may be considered.\"\n\nGravel is hoping that consideration will extend to officers who have taken their own lives.\n\n\"I'm intensely heartbroken every time we lose a member, and I'm intensely heartbroken, knowing full well that it's going to be discussed one more time to see if they can get their names on the wall on Parliament Hill because they did die, in my opinion, in the line of duty,\" he said.\n\nDe Bock is also hoping to fight for change so her husband and other officers who took their lives are recognized.\n\n\"We just have to continue to persevere to make sure that the names and legacy of our loved ones is not forgotten and that it is recognized.\"", "description": "Etched into the glass panels of the Parliament Hill memorial known as the Honour Roll are the names of the more than 880 Canadian police and peace officers who have died in the line of duty since Confederation. The names of officers who have died by suicide aren't included.", "authors": [], "top_image": "https://i.cbc.ca/1.5307712.1570549329!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/canadian-police-and-peace-officers-honour-roll-on-parliament-hill-oct-3-19.jpeg", "published_at": "2019-10-09"}