{"pub": "businessinsider", "url": "https://businessinsider.com/army-green-berets-train-airmen-marine-jungle-warfare-center-okinawa-2019-9", "downloaded_at": "2019-09-25 23:38:10.889416+00:00", "title": "US Army Green Berets invited US airmen to train at the Marine Corps' jungle-warfare center — here's what they put them through", "language": "en", "text": "US Air Force airmen from Kadena air base in Japan joined US Army Green Berets in Okinawa for training at the Marine Corps' Jungle Warfare Training Center.\n\nThe training exercise was meant to bridge the gap in small-unit tactics, communication techniques, and patient-extraction procedures.\n\nVisit Business Insider's homepage for more stories.\n\nThroughout the Pacific Theater, US military units must overcome jungle terrain riddled with cliffs, poisonous creatures, dense foliage yielding mere yards of visibility, and muddy slopes that threaten to launch anyone down 30-foot ravines of twisted roots and jagged rocks.\n\n\n\nWelcome to the jungle.\n\n\n\nUS Army Green Berets from 1st Battalion, 1st Special Forces Group (Airborne), invited Team Kadena airmen to train with them at the US Marine Corps Jungle Warfare Training Center (JWTC) at Camp Gonsalves, Okinawa, Japan.\n\n\n\n\"The Special Forces detachment incorporated airmen from around Okinawa to attend a training exercise to bridge the gap in small unit tactics, communication techniques, and patient extraction procedures between our airmen and the Green Berets,\" said US Air Force Staff Sgt. Michael Triana, an independent duty medical technician paramedic (IDMT-P) from the 67th Fighter Squadron.\n\n\"Each airman is trained in a different specialty providing various perspectives to achieve the tactical objectives presented by the detachment in the jungle.\"", "description": "As the masters of the indigenous approach, the Green Berets are responsible for training US personnel and allies throughout the Indo-Pacific region.", "authors": ["Staff Sgt. Peter Reft", "Us Air Force"], "top_image": "https://image.businessinsider.com/5d8bc6722e22af445a6d1fbd?width=1200&format=jpeg", "published_at": "2019-09-25"}