{"pub": "yahoo", "url": "https://finance.yahoo.com/news/ge-stock-is-ripping-higher-after-earnings-110543175.html", "downloaded_at": "2019-10-30 11:20:04.990635+00:00", "title": "Why GE stock is ripping higher after earnings", "language": "en", "text": "The logo for General Electric appears above a trading post on the floor of the New York Stock Exchange, Friday, Aug. 16, 2019. General Electric rebounded 6.7% after reporting late Thursday that its CEO had bought 250,000 shares of GE stock. GE had taken a plunge on new concerns about its accounting practices. (AP Photo/Richard Drew)\n\nAnd it’s another quarter from the beleaguered GE (GE) where it’s helpful to have some CFA textbooks nearby alongside a history book on the industrial icon.\n\nAll in all, one can’t blame investors for initially sending GE shares 7% higher in the pre-market Wednesday in the aftermath of third quarter earnings. The company showed modest incremental progress on its turnaround under turnaround guru CEO Larry Culp. It’s not blow the doors off progress, but after the two years of terrible headlines at GE it may be just enough for the bulls (they are out there on GE, still) that Culp isn’t out there slashing guidance and totally failing to deliver on his cash flow promises.\n\nAgain, incremental is being viewed as a win.\n\nGE’s adjusted earnings came in at 15 cents a share versus Wall Street forecasts for 11 cents a share. Total revenue of $23.36 billion compared to analyst forecasts of $22.93 billion.\n\n“Our results reflect another quarter of progress in the transformation of GE. We are encouraged by our strong backlog, organic growth, margin expansion, and positive cash trajectory amidst global macro uncertainty,” Culp said in a statement.\n\nHere’s a flash analysis of what Yahoo Finance liked, and didn’t like, from GE’s quarter.\n\nThumbs up\n\nOrder backlog increased 14% to $386 billion, with gains in both equipment (+4%) and services (+17%).\n\nThe company reiterated its full-year industrial segment operating revenue, industrial segment adjusted operating margin, and adjusted earnings per share.\n\nIndustrial segment free cash flow seen unchanged to up to $2 billion on the year. Three months ago, GE said it saw free cash flow falling $1 billion to being up $1 billion.\n\n“Project stabilization” called out in the beat-up Power business.\n\nThumbs down\n\nPower business: Orders plunged 30% and 20% organically for what is known on the Street as GE’s problem child business. The segment operated a loss of $144 million versus a loss of $676 million a year earlier. Gas power orders dove 17% and power orders cratered 54%.\n\nRenewable business: The segment turned in a loss of $98 million on a 13% revenue increase. GE blamed “higher losses on legacy contracts, pricing (although stabilizing at the orders level), tariffs, and increased R&D investment, partially offset by cost productivity and strong volume.”\n\nDisclosed about $1.74 billion in one-time charges. One is a $1 billion charge for what GE calls a “premium deficiency charge” and the other $740 million for an impairment to its hydro business within the renewable energy business.\n\nIndustrial free cash flow of $650 million fell 43% year-over-year.\n\nNow bring on that earnings call.\n\nBrian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow him on Twitter @BrianSozzi\n\nRead the latest financial and business news from Yahoo Finance\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "How should investors interpret another mixed quarter from General Electric?", "authors": ["Brian Sozzi"], "top_image": "https://s.yimg.com/uu/api/res/1.2/MG9cJUS_w.O__FIuQWxfLA--~B/aD0zODQwO3c9NTc2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-08/7cc93d80-c27b-11e9-abdf-0f61e10557e3", "published_at": "2019-10-30"}