{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/23/WS5dafb59aa310cf3e355720ad.html", "downloaded_at": "2019-10-23 12:15:47.297052+00:00", "title": "UN envoy criticizes interference in China's affairs", "language": "en", "text": "By HONG XIAO at the United Nations | chinadaily.com.cn | Updated: 2019-10-23 10:06\n\nZhang Jun, China's permanent representative to the UN, speaks at UN headquarters in New York, Sept 12, 2019. [Photo/Xinhua]\n\nChina's top envoy to the United Nations, in response to recent accusations about Xinjiang and Hong Kong by the United States and other countries, on Tuesday rejected the charges as interference and an attempt to provoke confrontation.\n\nZhang Jun, China's permanent representative to the UN, who spoke at the Third Committee of the 74th session of the UN General Assembly at UN headquarters in New York, said the charges also were made under the pretense of supporting human rights.\n\nZhang said \"the trend of the world is unstoppable, and the strong bullying the weak receives no support\".\n\n\"China urges these countries to abandon hegemony and power politics, and stop all the wrong deeds that go against the trend of history,\" he said.\n\n\"It must be pointed out that one must examine oneself before criticizing others,\" he said.\n\nZhang said some countries \"create troubles everywhere, plot color revolutions, seriously violate human rights of people of relevant countries, and show no remorse for the terrible human rights record of their own\".\n\n\"We urge these countries to do more self-reflection and clean up their own houses, instead of being troublemakers,\" he said.\n\n\"It must be pointed out that China's development achievements are widely recognized, and that making human rights accusations against China is barking up the wrong tree,\" he said.\n\nZhang said China has traveled a journey in several decades that took developed countries several centuries.\n\n\"On a land of 9.6 million square kilometers, there is no fear of war or displacement. Nearly 1.4 billion people are living in peace, freedom and happiness. This is human rights protection in the best sense and the best practice of human rights protection,\" he said.\n\nZhang spoke about China's achievements on human rights in the past 70 years since the founding of the People's Republic of China.\n\nThe Chinese people have turned a poor country into the world's second-largest economy, the largest manufacturer and the largest trader in goods, he said. More than 800 million people have been lifted out of poverty, and nearly 400 million have become middle-income earners.\n\nChina has installed a sound legal system of protecting human rights and established the world's largest democratic election system at the primary level, Zhang said.\n\nThe country has provided development assistance of nearly 400 billion yuan to more than 160 countries and international organizations. Over 550 cooperation outcomes have been delivered under the Belt and Road Initiative.\n\n\"All these have given a strong boost to the human rights cause of developing countries,\" he said.\n\n\"No matter how the world may change, their desire for a better life will not change, their conviction in the path of socialism with Chinese characteristics will not change, and their resolve to uphold national sovereignty, security and development interests will not change,\" he said.\n\nZhang also detailed China's positions and proposals to promote and protect human rights.\n\nZhang stressed that countries must follow a path of human rights development suited to national conditions. \"There is no one-size-fits-all approach. Countries need to bear in mind the practical circumstances, consider both universality and specialty, and strive to find a tailored and effective model of promoting and protecting human rights,\" he said.\n\nZhang called on countries to promote and protect human rights in the course of development. For developing countries, Zhang said rights to survival and development should be \"the top priority and the basis for promoting all human rights in a balanced manner\".\n\n\"Countries must seek common progress through dialogue and cooperation. It is important to advocate extensive consultation, joint contribution and shared benefits,\" he said.\n\n\"All countries are equal despite their sizes. All countries' independent choices of development path and human rights protection model should be respected,\" Zhang said. \"One must not interfere in others' internal affairs or impose one's own will onto others. Efforts should be made to promote mutual learning and harmonious co-existence among civilizations and leave no room for hate speech claiming racial supremacy and clash of civilizations.\"\n\nZhang said that China will continue to be active in international human rights cooperation and constructively seek common progress and development with all countries in an open, inclusive, candid and cooperative spirit.", "description": "China's top envoy to the United Nations, in response to recent accusations about Xinjiang and Hong Kong by the United States and other countries, on Tuesday rejected the charges as interference and an attempt to provoke confrontation.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/23/5dafb59aa310cf3e97a28a95.jpeg", "published_at": "2019-10-23"}