{"pub": "cbc", "url": "https://cbc.ca/news/canada/nova-scotia/macdonald-bridge-halifax-climate-change-1.5310569", "downloaded_at": "2019-10-07 12:06:46.773247+00:00", "title": "Access Denied", "language": "en", "text": "A climate change protest this morning has shut down the Macdonald Bridge, backing up commuter traffic as thousands of people seek alternate ways get to downtown Halifax from Dartmouth, part of rallies that are also being held in other Canadian cities.\n\nIn Nova Scotia, buses are being rerouted and the threat of gridlock loomed as traffic shifted to the MacKay Bridge, which also spans Halifax Harbour.\n\nThe bikeway and pedway are also closed.\n\n\"We certainly apologize and we very much empathize with those folks. They're absolutely right to be frustrated,\" said Patrick Yancey of Extinction Rebellion, which organized the Bridge Out protest.\n\n\"They certainly should not be having to deal with this situation. None of us should be — this should have been solved a long, long time ago. We encourage them to vent their frustrations to their MLAs, their MPs, their premier and prime minister as well. Hopefully, we'll not have to do this sort of thing again.\"\n\nSupporters gathered at 7 a.m. AT at the Dartmouth bridge terminal before marching onto the Macdonald. Traffic was expected to flow until they got close to the bridge.\n\nYancey couldn't say when the protest will finish.\n\n\"Well, we're not going to really presume in advance to know how long it's going to last. But we'll see.\"\n\nThe scene now as police block the protesters from accessing the MacDonald Bridge. Have talked to pedestrians and cyclists upset they can't use the lanes. Police closed that. <a href=\"https://t.co/h9Sj37VRTV\">pic.twitter.com/h9Sj37VRTV</a> —@cbccolleenjones\n\nThe protests are also expected to close busy bridges in Vancouver (Burrard Street Bridge), the Prince Edward Viaduct in Toronto.\n\nSimilar protests in the United Kingdom this summer created traffic disruptions that lasted for hours or even days.\n\nProtest organizers in Nova Scotia are demanding the province develop a plan for \"net-zero emissions\" within six years, including closing down coal-fired and biomass power plants.\n\nThey also want the province to keep its commitment to close the Boat Harbour pulp mill effluent facility in Pictou County and to stop the Alton natural gas storage project near the Shubenacadie River.\n\nOrganizers have said some protesters are willing to be arrested.\n\nAll motor vehicles will be stopped, say organizers\n\nAll motor vehicles will be stopped from driving over the Macdonald during the protest, Yancey said.\n\n\"We're definitely on board with making a special exception for emergency vehicles.\"\n\nHalifax Transit has issued an advisory warning that all buses that use the Macdonald Bridge will be diverted to the MacKay.\n\nProtesters were not permitted on the bridge deck Monday morning. All traffic had to be rerouted, and bikes and pedestrians were also prevented from crossing. (David Irish/CBC)\n\nOfficials are also encouraging people who use bus routes along Alderney Drive in Dartmouth and through the community of Woodside to disembark and cross the harbour on ferries from those locations.\n\nMetrolink passengers from Dartmouth into Halifax will also be encouraged to get off and board the ferry.\n\nHalifax police assemble at the Dartmouth approach to the Macdonald Bridge. (Craig Paisley/CBC)\n\nA shuttle at the Halifax ferry terminal will be available to take passengers to Summer Street, via Lower Water, Cogswell and Barrington streets, and then up Spring Garden Road.\n\nHalifax Transit also said the Metrolink Service from Lower Sackville will not go down Windmill Road in Burnside, but will instead use Highway 102 to get to Halifax.\n\nOfficials urge working from home, delaying commute\n\nOfficials with Halifax Harbour Bridges have urged people to carpool, take the ferry, work from home or delay their commute.\n\nCoun. David Hendsbee, whose district includes thousands of residents on the Eastern Shore, said commuters have had time to prepare.\n\nBut he worries an accident on the MacKay could easily throw a giant wrench into the rush hour, and is concerned about how people will react if the protest continues past Monday.\n\n\"I hope that it's a one-time event, but if it comes to be more of a frequent issue then I think we need to take more of a [direct] action, perhaps by prohibiting them from doing it,\" said Hendsbee, who sits on the board of Halifax Harbour Bridges.\n\nHe also criticized the decision by Extinction Rebellion to forbid buses on the Macdonald Bridge, given public transit gets people out of cars and is a way of fighting climate change.\n\n\"Here they are going to divert the buses as well. If you ask me, that's totally asinine,\" he said.\n\nA few dozen climate change protesters at the Dartmouth bridge bus terminal, preparing for the march to the Macdonald bridge. (Paul Palmeter/CBC)\n\nThe Macdonald Bridge, which has 48,000 crossings a day, has been shut down before during morning rush hour. At several points during the Big Lift, the three-year redecking project, the bridge did not reopen on time following an overnight work closure.\n\nIn one case, in March 2016, vehicles were not allowed on the bridge until 9:50 a.m. and traffic backed up for four kilometres on the Highway 111 approach to the MacKay.\n\n'Very important moment'\n\nRobert Huish, an associate professor at Dalhousie University who studies the impacts of climate change, said Monday's bridge protest is a \"very important moment.\"\n\nHe noted it comes on the heels of street protests that have drawn millions of people worldwide, and more than 10,000 in Halifax last month, to demand urgent measures to avert an environmental catastrophe.\n\n\"Right now that form of protest, that solidarity, was one about bringing people together,\" Huish said in an interview last week.\n\n\"Now we're stepping into a different territory come Monday when the bridge is planned to be blocked, and that is one that is going to be a bit more aggressive and intentionally inconvenient.\n\n\"The message is now changing a bit from being, 'Let's all be together,' to say we're now going to create an inconvenient space to recognize just how inconvenient climate change really is.\"\n\nMORE TOP STORIES", "description": "Buses are being rerouted and commuters crossing Halifax Harbour will likely face lengthy delays this morning as a protest by environmental activists has closed down the Macdonald Bridge, one of the crossings targeted in rallies also being held in other Canadian cities.", "authors": [], "top_image": "https://i.cbc.ca/1.5311441.1570449368!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/halifax-macdonald-bridge-protesters.jpg", "published_at": "2019-10-07"}