{"pub": "businessinsider", "url": "https://businessinsider.com/amazon-hiring-thousands-received-applications-2019-9", "downloaded_at": "2019-09-20 22:36:47.357682+00:00", "title": "Amazon says it received more than 200,000 job applications for its 30,000 open positions", "language": "en", "text": "Since announcing its Career Day recruitment events earlier this month, Amazon has received more than 200,000 online applications for 30,000 open spots.\n\nThe influx of applicants came in the days leading up to and following Amazon's nationwide Career Day events, held this week in Boston, Nashville, Dallas, Chicago, Seattle, and Arlington, Virginia. According to Amazon, the e-commerce giant has now received 208,000 applicants, at the rate of more than 18 job applications per minute.\n\nRead more: Thousands of people waited in long lines for tips about getting hired at Amazon during the e-commerce giant's Career Day. Here's what it was like on the ground in Arlington.\n\nAcross the events — which attracted thousands of prospective employees — Amazon recruiters conducted 4,500 interview training sessions and reviewed more than 7,000 resumes, the company reported. Its most highly attended Career Day was in Arlington, where more than 5,000 people attended in hopes of snagging jobs at Amazon's second headquarters, which is expected to open officially later this month.\n\n\"We've been humbled by the response,\" Ardine Williams, Amazon's vice president of workforce development, told Business Insider at the Arlington event. \"I think it's far exceeded my expectations. Clearly this is what I was hoping for.\"\n\nAttendees were told in advance that the company would not be taking applications at the event and instead would provide information on open roles as well as provide career development services. Prospective employees were encouraged to apply for the roles online, which span across corporate offices, fulfillment centers, and stores.\n\n\"People across the country understand the value of Amazon jobs with $15 minimum wage, full benefits from day one, and upskilling opportunities, and they demonstrated that by submitting more than 208,000 applications for careers at Amazon in the past week,\" Beth Galetti, senior vice president of HR at Amazon, said in a press statement.", "description": "More than 208,000 people have applied to Amazon since the company announced its Career Day events, part of an effort to fill 30,000 open jobs.", "authors": ["Bethany Biron"], "top_image": "https://amp.businessinsider.com/images/5d82532c2e22af545c1cd67f-1920-960.jpg", "published_at": "2019-09-20"}