{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/13/felicity-huffman-first-person-be-sentenced-college", "downloaded_at": "2019-09-13 18:25:11.188358+00:00", "title": "Felicity Huffman to be first parent sentenced in college admission scandal", "language": "en", "text": "Actress Felicity Huffman on Thursday will become the first parent to be sentenced in the controversial college admission scandal.\n\nThe former “Desperate Housewives” star will appear in front of a Boston federal court to be sentenced after pleading guilty to a single count of conspiracy and fraud in May for paying $15,000 for her daughter’s SAT score to be boosted by William “Rick” Singer, the scheme’s mastermind.\n\nHuffman’s lawyers have argued she was merely a “customer” in the scheme and are attempting to shield her from jail time, recommending a year of probation, a $20,000 fine and 250 hours of community service.\n\nProsecutors have recommended a month in prison along with a $20,000 fine, saying she chose to participate because she knew the scheme was wrong but moved forward due to her “sense of entitlement, or at least moral cluelessness.”\n\nHuffman said in a letter to the court that she has “a deep and abiding shame” surrounding her decision and only wanted to help her daughter, whose suboptimal math scores jeopardized her chance of going to an acting college. Her daughter reportedly didn’t know about the scheme.\n\nMs. Huffman will be the first of 34 parents who were charged in the scandal to be sentenced, some of who paid upwards of $500,000 to help propel their children into elite schools.\n\nOne of those cases is “Fuller House” star Lori Loughlin and her husband Mossimo Giannulli, who are accused of shelling out half a million dollars for their two daughters to be admitted to University of Southern California as members of the crew team, although neither participated in the sport they were recruited for.\n\nMs. Loughlin and Mr. Giannulli have declined their right to separate attorneys and are scheduled to appear in court Oct. 2.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Actress Felicity Huffman on Thursday will become the first parent to be sentenced in the controversial college admission scandal.", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/13/college_admissions-bribery_34853_c0-0-3600-2098_s1770x1032.jpg?230cde9fde22eec7bd06276e29ac2436a9089615", "published_at": "2019-09-13"}