{"pub": "townhall", "url": "https://townhall.com/columnists/davidharsanyi/2019/10/11/hey-congress-take-back-your-war-powers-n2554553", "downloaded_at": "2019-10-11 05:10:02.027912+00:00", "title": "Hey, Congress: Take Back Your War Powers", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nIf you want to stop Donald Trump from making unilateral decisions regarding war and peace, then stop letting all presidents make unilateral decisions about war and peace. It's really quite simple. Trump can abruptly pull back U.S. troops from northern Syria because Congress, having abdicated its foreign policy responsibilities long ago, has no leverage to stop him.\n\nWhen Congress passed the War Powers Resolution as the Vietnam War was winding down, it gave the president the power to send troops abroad for 60 days in response to any \"national emergency created by attack upon the United States, its territories or possessions, or its armed forces.\" If the president failed to gain congressional support for the deployment, he would have another 30 days to pull back troops.\n\nCongress is the institution vested with the power to declare wars, debate where we send troops and decide which conflicts will be funded. Presidents have been ignoring this arrangement, abusing authorizations for the use of military force (AUMFs) and imbuing themselves with the power to engage in conflicts wherever they like, without any coherent endgame and without any buy-in from Congress.\n\nCongress, in turn, has shown no interest in genuinely challenging executive power. Its members are far more concerned with political self-preservation. Ignoring abuse shields them from tough choices and ensuing criticism -- even as they use war as a partisan cudgel.\n\nEven if you don't believe all these conflicts rise to an Article I declaration -- and I don't -- the more accountability there is in foreign entanglements the better. Right now, we have little genuine debate or consensus building -- in a nation that already exhibits exceptionally little interest in foreign policy -- regarding the deployment of our troops, almost always in perpetuity, around the world.\n\nIt's a bipartisan problem. Barack Obama, whose political star rose due to his opposition to the Iraq War, was perhaps our worst offender, circumventing Congress and relying on a decade-old AUMF, which he invoked 19 times during his presidency, to justify a halfhearted intervention against ISIS (not al-Qaida) in Syria (not Afghanistan.)\n\nTrump could bomb Iran tomorrow, use Obama's reasoning and have a far stronger legal defense for his actions.\n\nIt was also Obama who joined Europeans in the failed intervention in Libya, where he worked under NATO goals rather than U.S. law. There was hardly a peep from Democrats fretting over the corrosion of the Constitution.\n\nRepublicans were also given ample chance to sign off on Syrian intervention in 2013 when Obama, fully aware of congressional aversion to accountability, asked for a new AUMF to get out of bombing Assad. It would have been a great time for senators to dictate long-term goals in Syria. It's not too late. If they believe Trump's strategy is wrong, they can still force his hand by explaining the mission with a new AUMF. Let's see if voters agree.\n\nRight now, I imagine only a sliver of Americans fully understand the situation in Syria. I'm definitely not one of them. Yes, Trump's haphazard abandonment of Syrian Kurds and empowering of Turkey seems like a bad idea for several reasons. I'm hawkish about destroying the remnants of JV-team ISIS and sympathetic toward the idea of protecting civilians from Assad's chemical attacks and shielding the Kurds from Turkish aggression. But now we're talking about an open-ended military commitment that keeps evolving. And anyone who claims to know with any certitude how these events will shake out is lying to you.\n\nThe only thing we can be certain of is that there few good options in the Syria mess, and that includes our allies. Although the Kurds have endured much as a people and deserve our support, the Kurdish PKK, our allies in northern Syria, aren't chaste freedom fighters but Maoists with ties to terrorist organizations.\n\nIn other words, we face few good options mired in perhaps the most volatile situation in the world. Under these conditions, our foreign policy shouldn't be driven by the arbitrary \"great and unmatched wisdom\" of any single person. This brand of unilateral power was problematic when the well-mannered Obama sold out Syria to coddle the Iranian terror state, and it's problematic when an impulsive Trump acquiesces to the wishes of Erdogan. (But Washington seems to freak out only when the word \"withdrawal\" is mentioned.)\n\nWhoever's president, the founders clearly foresaw Congress taking far more responsibility for conflicts we enter. So, who knows? Maybe next intervention it will.\n\nDavid Harsanyi is a senior editor at The Federalist and the author of the book \"First Freedom: A Ride Through America's Enduring History With the Gun.\"", "description": "If you want to stop Donald Trump from making unilateral .10/11/2019 1:08:00AM EST.", "authors": ["David Harsanyi", "Cortney O'Brien", "Matt Vespa", "Julio Rosas"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/37/dc25df1c-cfa7-4bfc-9177-4384a7938093.png", "published_at": "2019-10-11"}