{"pub": "axios", "url": "https://link.axios.com/offshore-wind-energy-troubles-142fd8b9-522b-47a7-beab-6213566e52de.html", "downloaded_at": "2019-10-28 09:50:06.125419+00:00", "title": "Axios", "language": "en", "text": "The big picture: With New England and Mid-Atlantic states enacting aggressive clean-energy policies, offshore wind in the United States promises to help combat climate change and create jobs. The numerous projects in the regulatory pipeline could power nearly 10 million homes.\n\nBut the only offshore wind farm operating in the country, near Rhode Island and operated by Ørsted, is tiny — just 5 turbines.\n\nProposals for far bigger farms, including this one off Atlantic City, are piling up as one project is delayed and the Trump administration conducts a broad review of the cumulative impact of all of them.\n\nØrsted’s U.S.-based CEO, Thomas Brostrøm, said in an interview here that this review is a “speed bump” — but he also acknowledged his company is making contingency plans if delays go on for too long.\n\n“We've seen maybe a speed bump, which creates a little bit of uncertainty but that's following 4 or 5 years of very, very positive development. And obviously this is way too big to fail. We're looking at $70 billion to be invested over the next 10 years.”\n\n— Thomas Brostrøm, Ørsted U.S. CEO, \"Axios on HBO\" interview\n\nWhere it stands: The Interior Department, which regulates energy on federal lands and in federally owned waters, aims to complete the broader analysis of the industry’s impact, especially on commercial fisheries, early next year.\n\nIt’s part of an extended review of one particular project planned for Massachusetts, called Vineyard Wind. The project is backed by Avangrid, Inc., a U.S.-based subsidiary of Spanish energy firm Iberdrola and Copenhagen Infrastructure Partners, a Danish investment firm.\n\nThe Interior Department hasn’t publicized the scope of the broader review, including how many wind farms and other specifics. Department spokesman Stephen Boutwell said the additional review “will help ensure the future success of all ocean users.”\n\nWhat they’re saying: Even Sen. Sheldon Whitehouse (D-R.I.), an ardent climate-change advocate, quietly signed onto a letter recently urging the Trump administration to conduct more comprehensive reviews.\n\nCritics say such reviews could slow projects down, but Whitehouse contends they would ultimately speed up the process.\n\nHe also criticized Vineyard Wind for setting “a very bad example for the industry” by, according to Whitehouse, making a deal without getting input from area fisheries.\n\n“If it was going to be the future of offshore wind to follow that example, they [the industry] were in for a long series of really difficult battles and long lawsuits and delays. So what we’re trying to do is head that off so that [the Interior Department] has a good process with a lot of good work up front.”\n\n— Sen. Sheldon Whitehouse (D-R.I.), \"Axios on HBO\" interview\n\nThe other side: Brendan Moss, Vineyard Wind spokesman, said the company was the first U.S.-based developer to hire a liaison to the fisheries in 2010 and continues to pursue that approach. “The insight of fishermen and fisheries research scientists is invaluable as we work to develop a strong and responsible American offshore wind industry,” Moss said.\n\nThe intrigue: Clouding the bureaucratic fight over process is President Trump’s uniquely strong hatred of wind, possibly stemming from a fight one of his golf courses in Scotland waged (unsuccessfully) against an offshore wind farm there.\n\nMore than any other type of energy, he regularly bashes wind in rallies, saying (inaccurately) that wind turbines cause cancer and that if it’s not windy, you can’t watch TV.\n\nYes, but: Trump’s hatred hasn’t (yet) led to any tangible impact on the actual approval of wind farms, say executives, politicians and others following the process closely.\n\nTrump’s first secretary of the Interior, Ryan Zinke, was vocally supportive of offshore wind, praising it at wind conferences and writing op-eds. The current leader, David Bernhardt, has not publicly commented on offshore wind, but it’s unclear whether that means he’s putting roadblocks up.\n\n“I do think that a little more time will tell whether Secretary Bernhardt’s intentions are honorable or not with respect to offshore wind,” Whitehouse said. “It’s hard to pick out right now out of the noise what is simple incompetence and what is a general desire to impede offshore wind.”", "description": "Smart, efficient news worthy of your time, attention, and trust", "authors": [], "top_image": "https://assets.axios.com/203e9f932cc97836ac2ff4c6c982676c.png", "published_at": "2019-10-28"}