{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7564063/Canadian-mountain-biking-legend-Jordie-Lunn-dead-36-Mexico-bike-accident.html", "downloaded_at": "2019-10-12 00:48:24.968048+00:00", "title": "Canadian mountain biking legend Jordie Lunn dead at 36 after Mexico bike accident", "language": "en", "text": "Canadian mountain bike legend Jordie Lunn died after a tragic biking accident in Mexico, his family shared.\n\nThe 36-year-old had been riding along a trail in Cabo San Lucas on October 9 when he was involved in 'tragic accident,' his family shared in a release to Pink Bike.\n\nWhile the release did not go into specifics, it did state that Lunn sustained a 'fatal head injury.\n\n'Jordie lost his life doing exactly what he loved,' Lunn's family continued.\n\nScroll down for video\n\nThe 36-year-old had been riding along a trail in Cabo San Lucas on October 9 when he was involved in an accident and sustained a fatal head injury\n\n'Jordie lost his life doing exactly what he loved,' Lunn's family said in a statement\n\n'Jordie had an incredible 20+ year career as a mountain biker. He will always be cherished for his heart and love that he gave to his family, friends, and fans, as well as the incredible talent that he had on his bikes.'\n\nLunn was known for his outrageous stunt work and often shared videos of himself pulling off stellar feats.\n\nIn 2003, he was the highest ranked North American DH racer in the World Cup. That same year, he was fastest Canadian at Mont-Saint-Anne.\n\nThe racer-turned-free rider became the first mountain biker to land a corked 720 - an intricate flip trick - in 2007.\n\nLunn was known for his outrageous stunt work and often shared videos of himself pulling off stellar feats\n\nGreg Watts, a professional mountain bike rider who was friends with Lunn, was with the biker in Mexico at the time of the incident\n\nLunn was known for films including 'Ride to the Hills, 'The Collective,' 'ROAM,' and more which showed off his skills.\n\nGreg Watts, a professional mountain bike rider who was friends with Lunn, was with the biker in Mexico at the time of the incident.\n\n'GUTTED,' he said in an Instagram post. 'We lost a human that you hope everyone could be like. If he doesn’t make it to heaven then heaven doesn’t f*****g exist.\n\nBrayden Barrett-Hay, one of the bikers on the trip, shared that Lunn's death did not 'feel real at all'\n\n'I had the pleasure of spending his last few hours alive with him along with @dberrecloth @braydenbarretthay and @lone_wolf_productions and he was truly enjoying what he loved.\n\n'Perfect day of riding in a perfect location. Just didn’t seem real and I still can’t grasp it. My condolences go out to his family because I know he loved his brothers and I know he was their glue. #longlivejordie.'\n\nBrayden Barrett-Hay, one of the bikers on the trip, shared that Lunn's death did not 'feel real at all.'\n\nHe added: 'Our Mexico trip went sideways and we lost such a legend and one of the sickest kindest dudes in MTB, someone I’ve idolized since the day I started riding!!! “ROAM” his back yard jumps was something that drove me down the path i’m on now!'\n\nSeveral other professional bikers and bike brands shared photos and videos with, offering words of support for his family.\n\nSeveral other professional bikers and athletes shared photos and videos with Lunn, offering words of support for his family\n\nEmil Johansson shared a photo with Lunn and said he was 'gutted' by the loss\n\nMountain bike free rider Andreu Lacondeguy declared that he would 'never forget' Lunn\n\n'You will be missed,' the athlete added\n\nBrook Macdonald posted a touching tribute where he said Lunn had lived his life to the fullest", "description": "The 36-year-old had been riding along a trail in Cabo San Lucas on October 9 when he was involved in 'tragic accident,' his family shared in a release. He sustained a 'fatal head injury,' they added.", "authors": ["Matthew Wright For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/21/19605444-0-image-a-66_1570824311117.jpg", "published_at": "2019-10-11"}