{"pub": "dailymail", "url": "https://dailymail.co.uk/debate/article-7556411/Cricket-hero-Ben-Stokes-says-horseplay-BEL-MOONEY-says-sends-troubling-message.html", "downloaded_at": "2019-10-10 00:13:42.955069+00:00", "title": "Cricket hero Ben Stokes says it was horseplay but BEL MOONEY says it sends a very troubling message", "language": "en", "text": "Of course nobody really knows what happened.\n\nBen Stokes and his wife Clare may well have been fooling around when he was snapped with his meaty hand at her face and throat at an awards dinner on Tuesday night.\n\nThe cricketing golden couple have been very quick to assure the world that's just what it was. Fooling around. No problem, all good fun, just their innocent way of showing affection and so on. Which is their business, for sure. No one can know what goes on in any marriage, or how a couple work out their private dynamics.\n\nYet when I showed my husband the photographs taken at the Professional Cricketers' Association do (making absolutely no comment myself), he stared for a moment, then grimaced.\n\nBen Stokes was seen with his hand on his wife Clare's face at an awards ceremony - but the couple insist it is a gesture of affection between them\n\nWhy? Because the sight of a guy appearing to grab his wife's face and throat made him 'very uncomfortable'. For even if there was no real animosity behind the behaviour, the images of our cricketing hero leave a sour taste in the mouth.\n\nSurely we are entitled to ask, in what universe is it funny or affectionate to grab a woman by the face and throat?\n\nWho can forget the now infamous pictures of Charles Saatchi and his then wife Nigella Lawson taken in 2013? The couple were sitting outside the smart London restaurant Scott's when a row escalated into physical abuse, with Saatchi grasping Lawson by the throat and tweaking her nose, to her obvious distress.\n\nMs Lawson later faced further humiliation when forced to answer detailed questions about the incident in court, where she was giving evidence in the trial of two of the couple's personal assistants accused of fraud.\n\nShe said the incident was sparked when she spoke about looking forward to having grandchildren — only to have Mr Saatchi tell her 'I'm the only person you should be concerned with' and make his point with physical force, which made her cry.\n\nSaatchi appeared as a witness and told jurors he was only holding his wife's neck to 'make her focus' and laughed off the matter as 'a playful tiff'. He also admitted that he had accepted a police caution over the incident with Nigella.\n\nNot long afterwards, he announced that he was filing for divorce and their ten-year marriage was over. Later Lawson was to speak of 'emotional scars' and 'bullying'. Significantly, she commented: 'I think he likes everybody to do what he wants.'\n\nYes, those powerful silverback males do like to dominate. They consider it their right. After all, the phrase 'rule the roost' refers to the strutting cock in the henhouse, and the 'top dog' is leader of the pack. That's why many women are attracted to powerful men like Saatchi, associate strength with masculinity and relish the whiff of danger in their testosterone.\n\nTop sportsmen like Ben Stokes enjoy great status — and the adulation of crowds can lead to overweening arrogance. But with all the perks and privileges comes great responsibility and, like it or not, these men become role models for their fans.\n\nSo what do the pictures of Ben Stokes communicate to blokes who hero-worship the brilliant cricketer who delivered glory to England on the field?\n\nThe couple insist they often make this gesture to each to show their affection\n\nBen and Clare were all smiles as they celebrated her 30th birthday this week\n\nThat it's just fine to muck about and manhandle your old lady? That a bit of physical playfulness is fine, even when you're using arm muscles that can knock a 90mph cricket ball for six and a soldier unconscious outside a nightclub? I'm referring here to Stokes's trial for affray, of which he was cleared.\n\nIs it all just a bit of a laugh? Now I am certainly not saying that is what Ben Stokes thinks. But I am suggesting that it is the disturbing message his behaviour could portray, however innocent it may have been.\n\nIn my 14 years of writing an advice column, I have learned of untold bullying behind the closed doors of marriage. Some men never lift a finger in physical violence, yet bruise their partners' very souls with verbal assaults and/or the gradual chipping away at self-esteem which renders some women incapable of standing up for themselves.\n\nWomen have written to me in despair because their husbands constantly belittle them in public, all the jokey put-downs a way of asserting not just superiority but ownership, too.\n\nOne woman wrote to tell me her husband calls her 'stupid' all the time: 'He says he is having a laugh and I shouldn't take it so seriously . . . This will go on, because I am allowing it but what else am I supposed to do? If I don't behave, I will find myself homeless and penniless and there isn't much hope for a 50-year-old woman.'\n\n'Behave'? The poor woman means she has to put up and shut up — because the husband can do exactly as he pleases and she has no choice. The balance of power in the relationship is so skewed she is a virtual prisoner.\n\nBelieve me, this is not uncommon. The terrible truth is that while there are millions of decent men who deplore bullying behaviour, there are also many others who secretly admire butch and blokey attitudes — yes, even when they spill into physical violence.\n\nHow else can we explain the shocking statistics? In the year ending in March 2016, there were 1.2 million reported experiences of domestic violence in England and Wales, and this year domestic violence is at its highest level in five years.\n\nNigella Lawson and her husband Charles Saatchi's marriage ended not long after he was photographed holding her by the neck outside a restaurant in 2013\n\nOne woman in four experiences domestic violence in her lifetime, and in England and Wales two women are killed each week by a current or former partner.\n\nI wonder how such women would regard pictures of a public figure grasping his wife by her face and throat for fun? Outside a smart restaurant or at a glitzy party, the 'playful tiff' or mock-violent horseplay must seem to take place in a different world.\n\nPerhaps they see it as the behaviour of rich and famous people who don't care what others think of them. If so, surely it serves to mock the suffering of the women who are real victims of domestic violence.\n\nWomen who have felt brutal hands at their throats for real, and live out their days in terror of saying or doing the wrong thing.\n\nWomen who dread the clink of a beer because they know the booze will just make things much worse.\n\nWomen who are so beaten down and ashamed they tell lies about their bruises, saying they tripped or walked into a cupboard door.\n\nWomen who are desperate for help that never comes.\n\nWill those women look at the pictures of Ben Stokes and see affection? And a bit of fun? And what will the men who bully and abuse them think? Snigger and say: 'Good old Stokesy!'?\n\nThat thought is intolerable. And it is why lovely Mrs Stokes should not be quite so ready to dismiss the concerns of others as 'unbelievable nonsense'. Because for all the assurances of harmony and fun, this 'crazy story' (as Mrs Stokes called it) is not nothing.\n\nSomething is wrong when men in the public eye forget that how they act matters. In our age of endless photographs and twittering social media, behaviour can quickly become distorted and dispatch unpleasant — even dark — messages out into the wider world. So they should be careful.", "description": "BEL MOONEY: Of course nobody really knows what happened. Ben Stokes and his wife Clare may well have been fooling around when he was snapped with his meaty hand at her face.", "authors": ["Bel Mooney For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/23/19512668-0-image-a-20_1570658917725.jpg", "published_at": "2019-10-09"}