{"pub": "indiatimes", "url": "https://indiatimes.com/news/thousands-of-gold-scheme-investors-cheated-dog-trapped-and-beaten-in-noida-more-top-news-378827.html", "downloaded_at": "2019-10-29 15:04:50.398163+00:00", "title": "Thousands Of Gold Scheme Investors Cheated, Dog Trapped And Beaten In Noida + More Top News", "language": "en", "text": "It was a 'black Diwali' for the lakhs of depositors of the scam-hit PMC bank this year. But they are not the only ones who are now staring at an uncertain future of their investments.\n\nHundreds of customers who had invested in the investment schemes of Goodwin Jewellers were caught off guard just ahead of the festivals after it came to light that the owners, Sunilkumar and Sudheesh Kumar are missing, so is their money. Read More\n\nStray Dog Trapped In Net, Beaten Up For Entering An Upscale Residential Society In Noida\n\nAn FIR has been registered against five people after a video of a stray dog being beaten up by two men went viral.\n\nDon't Miss 231 SHARES 264 SHARES 617 SHARES 123 SHARES\n\nAbhishek Tiwari, who claims to be a local BJP functionary and four others were booked by the Sector 49 police under IPC Section 506 (criminal intimidation) and Section 11 of the Prevention of Cruelty to Animals Act on the complaint by animal rights activist Kaveri Rana. Read More\n\nSpike In Grenade Attacks And Killings Of Non-Kashmiris Emerge As New Militant Tactics\n\nIt will be three months soon since the abrogation of Article 370 and 35A of the Indian Constitution that granted special status to the state of Jammu and Kashmir and its hasty bifurcation into two Union Territories but the centre’s maintained claims of normalcy having been restored in the Kashmir Valley even as it continues to remain under the clampdown has come under the scanner as there has been a considerable spike in grenade attacks as well as killings of non-Kashmiri truck drivers in the region.\n\nAnother truck driver was killed by suspected militants on Monday in Jammu and Kashmir's Anantnag district. Read More\n\nOnce Sacred, Yamuna Water Has Now Turned Toxic. Green Activists Demand Early Cleaning\n\nSince time immemorial, the rivers of north India have been regarded as not only the lifeline of the people residing in the adjoining areas but also very sacred in their religious and cultural beliefs. Yamuna, which passes through Delhi and Agra, is among the most prominent but Green activists have gathered along the banks of the river to demand its early cleaning.\n\nThe reason? The banks of the river withstood a tragedy barely 10 days ago when hundreds of people on a pilgrimage (Braj Yatra) were swept away while crossing the river in a pontoon bridge. The fragile plastic rope they were holding on to didn't prove strong enough and many began to drown after a virtual stampede. Read More\n\nBJP Leader Kapil Mishra Booked After He Suggested Population Control Of Muslims To Reduce Pollution\n\nAn FIR has been registered against BJP leader and disqualified former AAP MLA from Karawal Nagar, Kapil Mishra after a controversial tweet for stoking communal hatred.\n\n\"If you want pollution to come down, then you should reduce these firecrackers and not the ones burst on Diwali,\" Mishra said in a tweet with the photo of a Muslim family. Read More", "description": "It was a 'black Diwali' for the lakhs of depositors of the scam-hit PMC bank this year. But they are not the only ones who are now staring at an uncertain future of their investments. Hundreds of customers who had invested in the investment schemes of Goodwin Jewellers were caught off guard just ahead of the festivals after it came to light that the owners.", "authors": [], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/top_news_1572351204_800x420.jpg", "published_at": "2019-10-29"}