{"pub": "thehill", "url": "https://thehill.com/policy/finance/overnights/464755-on-the-money-federal-judge-rules-against-trump-in-fight-over-tax", "downloaded_at": "2019-10-07 23:30:33.897659+00:00", "title": "On The Money: Judge tosses Trump lawsuit over NY tax return subpoena | US, Japan sign trade deals | Trump faces narrowing window for trade deals | NBA sparks anger with apology to China", "language": "en", "text": "Happy Monday and welcome back to On The Money. I'm Sylvan Lane, and here's your nightly guide to everything affecting your bills, bank account and bottom line.\n\nSee something I missed? Let me know at slane@thehill.com or tweet me @SylvanLane. And if you like your newsletter, you can subscribe to it here: http://bit.ly/1NxxW2N.\n\nWrite us with tips, suggestions and news: slane@thehill.com, njagoda@thehill.com and nelis@thehill.com. Follow us on Twitter: @SylvanLane, @NJagoda and @NivElis.\n\nTHE BIG DEAL--Federal judge rules against Trump in fight to keep tax records from Manhattan prosecutors: A federal judge on Monday dismissed President Trump Donald John TrumpWhite House says Turkey will soon launch Syria operation Trump associates pressured Ukraine over gas firm in order to benefit allies: report Trump praises Woodward, slams other journalists over 'Face the Nation' segment MORE's lawsuit challenging a subpoena from New York prosecutors for his tax returns.\n\nJudge Victor Marrero, a district judge in New York appointed by former President Clinton, rejected Trump's argument that he cannot be subject to the criminal process while in office.\n\n\"This Court cannot endorse such a categorical and limitless assertion of presidential immunity from judicial process as being countenanced by the nation's constitutional plan,\" Marrero wrote in a 75-page ruling.\n\nADVERTISEMENT\n\nMarrero said that Trump was advancing a position that presidents, their relatives and their businesses are above the law and that aspects of such a position are \"repugnant to the nation's governmental structure and constitutional values.\" The Hill's Naomi Jagoda tells us more here.\n\nBear in mind: Despite Marrero's ruling, the appeals court has blocked enforcement of the subpoena until a panel of appellate judges conducts an expedited review of the case. Until then, Trump's records are staying put.\n\nTrump's response: Trump's lawyers filed an emergency notice of appeal to the U.S. Court of Appeals for the 2nd Circuit.\n\nShortly after the ruling came out, Trump tweeted: \"The Radical Left Democrats have failed on all fronts, so now they are pushing local New York City and State Democrat prosecutors to go get President Trump. A thing like this has never happened to any President before. Not even close!\"\n\nThe background: The Manhattan district attorney's office issued a grand jury subpoena in August to Trump's accounting firm, Mazars USA, for Trump's tax returns and other financial records. The following month, Trump's personal lawyers filed a lawsuit seeking to block enforcement of the subpoena.\n\nThe district attorney's office is investigating payments made ahead of the 2016 presidential election to women who have claimed they had affairs with Trump.\n\nLEADING THE DAY\n\nU.S., Japan sign trade deals: President Trump on Monday oversaw the signing of two limited trade deals with Japan, slashing tariffs on $7.2 billion worth of America's agricultural exports, but avoiding thorny issues such as auto tariffs.\n\n\"From Day One my administration has worked tirelessly to achieve a level playing field for the American worker,\" Trump said at the signing ceremony.\n\n\"It's a great deal for us and our workers,\" he added.\n\nThe deals were signed by U.S. Trade Representative Robert Lighthizer Robert (Bob) Emmet LighthizerOn The Money: Economy adds 164K jobs in July | Trump signs two-year budget deal, but border showdown looms | US, EU strike deal on beef exports Chinese, US negotiators fine-tuning details of trade agreement: report The Trump economy keeps roaring ahead MORE and Japanese Ambassador to the U.S. Shinsuke J. Sugiyama in the White House.\n\nWhat's in the deals: The first deal scraps Japanese tariffs on nuts, berries, grains, wine, cheese and other products amounting to roughly $4.3 billion, and reduces tariffs on beef and pork products amounting to $2.9 billion. Current tariffs would remain on another roughly $1.7 billion of agricultural exports.\n\nThe second deal focuses on digital products, such as digital media and software, which will face reduced trade barriers and tariffs. Digital trade between the two countries already amounts to $40 billion.\n\nThe deals cover roughly $55 billion in trade, about a quarter of the nearly $218 billion in goods traded between the two countries.\n\nThe Hill's Niv Elis has more here.\n\nTax-return whistleblower in spotlight amid impeachment fight: A whistleblower allegation about possible misconduct in the IRS presidential tax-return audit program is receiving new attention amid House Democrats' impeachment inquiry into President Trump.\n\nBut progressive groups are also urging leaders to disclose more information about the tax complaint, arguing it could be crucial to Democrats' oversight.\n\nNaomi Jagoda tells us why here.\n\nWhat we know: The whistleblower complaint is largely shrouded in mystery, with few public details.\n\nIts existence was first revealed by the Democratic-led House Ways and Means Committee in court documents in August in its lawsuit for Trump's tax returns.\n\nThe Washington Post reported Thursday that the whistleblower is an IRS employee who said he was told that at least one Treasury Department political appointee tried to interfere with an audit of Trump or Vice President Pence's tax returns.\n\nNBA sparks anger with apology to China: The NBA is under fire from all sides after apologizing to China for a tweet from Houston Rockets general manager Daryl Morey that showed solidarity with pro-democracy protesters in Hong Kong.\n\nMorey on Friday tweeted \"fight for freedom, stand with Hong Kong,\" bringing a sharp rebuke from China, where several businesses and TV networks cut ties with the Rockets and blocked their games from Chinese viewers.\n\nThe NBA moved to contain the fallout, faced with the prospect of a serious setback to its work in China's lucrative market. Morey deleted the tweet and expressed his regrets. The NBA also issued a statement Sunday apologizing for the tweet, and both Rockets owner Tilman Fertitta and All-Star power forward James Harden distanced themselves from Morey.\n\nAs the league scrambled to save face in China, lawmakers at home from both parties ripped the NBA, accusing it of putting profit over principle. I tell you why here.\n\nWhat they're saying:\n\nFormer Rep. O'Rourke (D-Texas): \"The only thing the NBA should be apologizing for is their blatant prioritization of profits over human rights. What an embarrassment.\"\n\nGOOD TO KNOW\n\nBusiness economists are predicting a slowdown in growth next year amid President Trump's trade war with China, according to a quarterly survey released Monday.\n\nWith a resilient but slowing economy at his back, President Trump is approaching a crucial two-week sprint in trade talks with China and the European Union before a new round of costly tariffs kick in.\n\nAs another potential government shutdown looms next month, activist groups are pushing for legislation to protect low-wage federal contractors, a group they say can least afford to lose income but has the fewest protections.\n\nODDS AND ENDS", "description": "Happy Monday and welcome back to On The Money. I'm Sylvan Lane, and here's your nightly guide to everything affecting your bills, bank account and bottom line.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_100419as6_lead.jpg", "published_at": "2019-10-07"}