{"pub": "washingtonpost", "url": "https://washingtonpost.com/immigration/federal-judge-blocks-trump-administration-from-detaining-migrant-children-for-indefinite-periods/2019/09/27/49a39790-e15f-11e9-b199-f638bf2c340f_story.html", "downloaded_at": "2019-09-28 00:58:33.865692+00:00", "title": "Federal judge blocks Trump administration from detaining migrant children for indefinite periods", "language": "en", "text": "A playground is seen at the South Texas Family Residential Center, which houses families pending disposition of their immigration cases, in Dilley, Tex. (Jabin Botsford/The Washington Post)\n\nA federal judge in Los Angeles has blocked the Trump administration from activating new regulations that would have dramatically expanded its ability to detain migrant children with their parents for indefinite periods of time, dealing a blow to the president’s efforts to tamp down unauthorized border crossings.\n\nU.S. District Judge Dolly M. Gee issued the permanent injunction Friday, hours after hearing arguments from the Justice Department and advocates for immigrants in a long-running federal case in the Central District of California.\n\nLawyers for the Justice Department had urged Gee to allow the Trump administration to withdraw from the Flores Settlement Agreement, a 1997 federal consent decree that sets basic standards for detaining migrant children. The decree led to a 20-day limit for holding children in detention facilities that have not been licensed by the states for the purpose of caring for minors.\n\n[Trump administration moves to terminate court agreement, hold migrant children and parents longer]\n\nPresident Trump has called Flores a “loophole” that has enabled hundreds of thousands of families, many from impoverished Central American countries, to cross the southern boundary and claim asylum. Those migrants generally are quickly released into the United States because of the 20-day limit on detaining children.\n\nThe Department of Homeland Security and the Department of Health and Human Services issued new rules in August that sought to terminate the settlement and lift the 20-day limit by allowing the federal government to license such facilities.\n\nIn the ruling Friday, Gee wrote that the regulations “fail to implement and are inconsistent with the relevant and substantive terms of the Flores Settlement Agreement,” and therefore cannot take effect, noting that the agreement is a binding contract that was never appealed.\n\n“Defendants cannot simply ignore the dictates of the consent decree merely because they no longer agree with its approach as a matter of policy,” she wrote. “Defendants cannot simply impose their will by promulgating regulations that abrogate the consent decree’s most basic tenets.”\n\nThe Justice Department is widely expected to appeal the decision, but a spokesman for the department did not signal the administration’s next steps Friday.\n\n“The Department of Justice is disappointed that the court is continuing to impose the outdated Flores Agreement even after the government has done exactly what the Agreement required: issue a comprehensive rule that will protect vulnerable children, maintain family unity, and ensure due process for those awaiting adjudication of their immigration claims,” a spokesman said. “The Trump Administration will continue to work to restore integrity to our immigration system and ensure the proper functioning of the duly enacted immigration laws.”\n\nWithdrawing from the settlement is part of Trump’s “beautiful puzzle,” an assortment of tough immigration enforcement measures designed to reduce the flow of Central American families and unaccompanied minors streaming across the U.S.-Mexico border.\n\nRep. Joaquin Castro (D-Tex.), chair of the congressional Hispanic Caucus, hailed the ruling Friday.\n\n“I am pleased that our justice system has stopped the Trump Administration plans to indefinitely detain families in prisonlike conditions,” Castro said. “This victory gives us hope and is a reminder to us all — elected officials, immigration lawyers, organizers, and advocates — to keep fighting. Flores is not a loophole — it’s a lifesaving standard that protects the basic rights and dignity of migrant children.”\n\nActing Homeland Security Secretary Kevin McAleenan, who has pushed for the termination of the Flores pact, said officials did not want to hold families longer than 50 days, but critics said the proposed regulations left open the possibility that minors could be detained for months or years.\n\nMore than 800,000 migrants have been taken into federal custody at the border this year, and the majority have been in family units. Advocates say they are fleeing dangerous and unstable regions in Central America’s “Northern Triangle,” the nations of Guatemala, Honduras and El Salvador.", "description": "Trump administration officials had hoped new rules would take effect soon to solidify the decline in border crossings.", "authors": ["Maria Sacchetti", "Reporter Covering Immigrant Communities", "Immigration", "Customs Enforcement", "September At Pm", "Maria Sacchetti Covers Immigration For The Washington Post", "Including U.S. Immigration", "The Court System. She Previously Reported For The Boston Globe", "Where Her Work Led To The Release Of Several Immigrants Jail. She Lived For Several Years In Latin America", "Is Fluent In Spanish."], "top_image": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2019/08/25/National-Politics/Images/botsford190823DillyTX59860.JPG?t=20170517", "published_at": "2019-09-27"}