{"pub": "usatoday", "url": "https://usatoday.com/story/news/education/2019/07/11/barack-obama-prison-reform-inmate-felon-clemency-ban-box/1707154001", "downloaded_at": "2019-10-06 13:21:00.668156+00:00", "title": "Obama sends letter to prisoner he freed, who made the dean's list: 'I am so proud of you'", "language": "en", "text": "CLOSE Former prisoners are going back to work and school with the help of both Democrats and Republicans. USA TODAY\n\nPresident Barack Obama granted Danielle Metz clemency in 2016. Out of prison, she made the dean’s list in college. She wished she could thank Obama for his help.\n\nIn a story published Monday in USA TODAY, Metz expressed her gratitude toward the former president.\n\n“You don't know what you did for me,” she imagined herself telling him. “I’m finally coming into my own. I made the honor roll.”\n\nThis week, Obama wrote her a letter, wishing Metz all the best.\n\n“I am so proud of you, and am confident that your example will have a positive impact for others who are looking for a second chance,” Obama wrote to Metz. “Tell your children I say hello, and know that I’m rooting for all of you.”\n\nBarack Obama's letter to Danielle Metz. (Photo: Danielle Metz)\n\nMetz was arrested in 1993 for drug offenses related to her husband’s cocaine trafficking ring. At 26, she was sentenced to three life sentences plus another 20 years.\n\nIn federal prison, Metz earned her GED. She began writing letters and making appeals for her freedom. In 2016, Obama commuted her sentence, and Metz enrolled in Southern University in New Orleans the following year. At 50 years old, she was a college freshman.\n\nMore lives changed from second chances: California's prisoners are getting bachelor's degrees\n\nIn her second semester at Southern, she earned a 3.75 grade point average and made the dean’s list.\n\nDanielle Metz shows the affidavit for her prison release in New Orleans on Feb. 15. President Barack Obama granted her clemency in 2016. She had been serving multiple life sentences for charges related to her husband's drug ring. (Photo: Cheryl Gerber, The Hechinger Report)\n\nIn a heartwarming twist, Obama came across the USA TODAY story and sent a personal note to the woman whose life he dramatically changed.\n\nWhat about college in prison? Bipartisan push to remove ban on prison Pell Grants\n\nThe original story about Danielle Metz was produced by The Hechinger Report, a nonprofit, independent news organization focused on inequality and innovation in education. Sign up for the Hechinger newsletter.\n\nRead or Share this story: https://www.usatoday.com/story/news/education/2019/07/11/barack-obama-prison-reform-inmate-felon-clemency-ban-box/1707154001/", "description": "President Obama granted clemency to Danielle Metz in 2016. After she made the dean's list in college, she wished she could thank him. Now, she has.", "authors": ["Max Cohen", "Published P.M. Et July"], "top_image": "https://www.gannett-cdn.com/presto/2019/07/11/USAT/de7a7f08-5cd9-45d3-94f2-c0605d422792-metz_letter.jpg?crop=3171,1807,x0,y189&width=3200&height=1680&fit=bounds", "published_at": "2019-07-11"}