{"pub": "metro", "url": "https://metro.co.uk/2019/10/12/love-islanders-group-recall-the-wild-x-factor-celebrity-auditions-you-wont-see-and-claim-itv2-bosses-banned-their-singing-from-screen-10901926", "downloaded_at": "2019-10-12 09:20:46.088043+00:00", "title": "Love Islanders reveal wild X Factor: Celebrity auditions you won't see", "language": "en", "text": "Meet The Love Islanders (Picture: ITV)\n\nLove Island stars are often tossed aside as talentless idols slowly but surely robbing us all of morality. But on X Factor: Celebrity, Samira Mighty, Wes Nelson, Zara McDermott and Eyal Booker are gracing prime time Saturday night telly to say otherwise.\n\nThe four twenty-somethings all lived under the watch of ITV2 viewers in the Love Island villa throughout the summer of 2018, unaware that there was a connection deeper than any short-lived fling, between an unlikely foursome.\n\nA year later, Simon Cowell came calling and Love Islanders were born.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\n‘When we sat in the room together for the first time, we were like, “Is this going to work? We don’t know?” But then when we did start to sing together, we just got stronger since,’ recalled Wes to Metro.co.uk.\n\nAdvertisement\n\nAdvertisement\n\nTonight viewers will make their own minds up as the troupe take on Shawn Mendes’ There’s Nothing Holdin’ Me Back, but the Love Islanders are keen to dispel the myth that reality stars have as much musicality as Ed Balls has rhythm.\n\n‘I don’t think they were allowed to show us singing [on Love Island],’ claimed Zara.\n\n‘I think it’s such a hard pill for people to swallow that we have such a passion for music,’ Wes continued. ‘No one has ever understood that and why would they when they’ve never seen it. Eyal was in a pop band from a young age, Samira’s been on the West End, Zara’s got a studio in her house, I was going to pursue a musical career had this not come along and now we’ve all formed together.’\n\nEyal Booker, Samira Mighty, Zara McDermott and Wes Nelson make up the Love Islanders (Picture: Getty)\n\nAside from Eyal’s failed pop career, none of the Love Islanders were exactly famed for their vocal prowess, which made their addition to the X Factor: Celebrity line-up somewhat of a mystery. Their fellow islander, the famously loyal Georgia Steel, however, let slip several cast members auditioned for another shot at their 15 minutes of fame.\n\n‘We don’t know who auditioned, but all we know is that we all auditioned individually, and then they said to us, “Would you be open to being in a band. And I was like yeah. Then a couple of weeks later, we walked into a room and they’re all sat there and I was like, “Oh my God, hi”’ said Zara.\n\nAdvertisement\n\nAdvertisement\n\nWes explained: ‘Especially with this process, we’re completely new to this. This is not our forte, we have no expertise on this, so you just trust the process. They obviously heard numerous people audition – so they put us together so they must feel we sound good together.’\n\nBut the Love Islanders have a tough battle on their hands ahead with the likes of established singers Megan McKenna, Coronation Street and Lion King actress Victoria Ekanoye, and Grammy Award-winning Glee star Kevin McHale all eyeing up Simon Cowell’s record deal.\n\nX Factor: Celebrity airs tonight at 8.35pm on ITV.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: X Factor: Celebrity judge Nicole Scherzinger can only be filmed from left side and we’re a bit obsessed\n\nMORE: Martin Bashir reveals tragedy of brother’s death pushed him to sing on X Factor: Celebrity", "description": "Love Islanders group recall the wild X Factor: Celebrity auditions you won't see and claim ITV2 bosses banned their singing from screen", "authors": ["Adam Miller"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_88834196_1570797097.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-12"}