{"pub": "investing.com", "url": "https://ph.investing.com/news/economy/china-threatens-to-retaliate-if-us-enacts-hong-kong-bill-67254", "downloaded_at": "2019-10-16 03:58:23.480755+00:00", "title": "China Threatens to Retaliate If U.S. Enacts Hong Kong Bill", "language": "en", "text": "(Bloomberg) -- China threatened to retaliate if the U.S. Congress follows through with enacting legislation that would require an annual review of whether Hong Kong is sufficiently autonomous from Beijing to justify its special trading status.\n\nThe Chinese Ministry of Foreign Affairs said in a statement on Wednesday that it would take strong measures if the bill passed. The Hong Kong Human Rights and Democracy Act is one of four measures passed by the U.S. House in unanimous voice votes Tuesday.\n\nThe bill provides for sanctions against officials “responsible for undermining fundamental freedoms and autonomy in Hong Kong.” A similar bill is also pending before the Senate, where the legislation has strong bipartisan support. The legislation must pass both houses and be signed by President Donald Trump to become law.\n\nChina’s threat dented investor appetite for risk, with S&P 500 Index futures slipping 0.2% and the weakening slightly.\n\nThe extended losses after the statement, weakening as much as 0.13% versus the dollar.\n\n“Basically traders are not buying this trade deal and think the yuan is unlikely to strengthen,” says Stephen Chiu, Asia currency and rates strategist at Bloomberg Intelligence. The yuan will likely range around 7.1 “until we get more concrete details regarding the trade agreement. Even so, the market could still doubt Trump will return with another hit.”\n\nA spokesman for the Hong Kong government separately “expressed regret” over the House action, urging foreign legislatures not to interfere in the city’s affairs. Thousands of protesters gathered in Hong Kong’s central district on Monday calling for the legislation’s passage, many of them waving American flags.\n\nThe House passed H.Res. 543, a resolution reaffirming the relationship between the U.S. and Hong Kong, condemning Chinese interference in the region and voicing support for protesters, some of whom have visited Capitol Hill in recent weeks.\n\n“Retaliation, that’s all they ever talk,” Representative Chris Smith, a New Jersey Republican and a sponsor of the bill, told Bloomberg Television. “And they try to browbeat and cower people, countries, presidents, prime ministers and the like all over in order to get them to back off. We believe that human rights are so elemental, and so in need of protection, and that’s why the students and the young people are out in the streets in Hong Kong virtually every day.”\n\nLawmakers also passed the Protect Hong Kong Act, H.R. 4270, which would halt the export to Hong Kong of crowd-control devices such as tear gas and rubber bullets. The bill is intended to prevent police in Hong Kong from using those non-lethal weapons on protesters.\n\nIn addition, the House adopted a resolution introduced by Foreign Affairs Committee Chairman Eliot Engel of New York and the panel’s top Republican, Michael McCaul of Texas, which commends the Canadian government for starting extradition proceedings in the U.S. case against Huawei executive Meng Wanzhou.\n\nThe resolution, H.Res. 521, also calls for the release of two Canadian nationals detained in China and due process for a third sentenced to death for drug smuggling.\n\nRepublican Senators Rick Scott of Florida, Ted Cruz of Texas and Josh Hawley of Missouri visited Hong Kong over the two-week congressional recess that ended Tuesday. Hawley met with local pro-democracy activist Joshua Wong and got into a back-and-forth with Hong Kong Chief Executive Carrie Lam.\n\nHawley said on Twitter that he called Hong Kong a “police state” on purpose “because that is exactly what Hong Kong is becoming.”\n\n(Updates with market reaction in fourth paragraph.)", "description": "China Threatens to Retaliate If U.S. Enacts Hong Kong Bill", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic3c1d0f225f7261d92ab0f5df14400df7.jpg", "published_at": "2019-10-16"}