{"pub": "theverge", "url": "https://theverge.com/2018/12/17/18141106/tumblr-porn-ban-adult-content-appeal", "downloaded_at": "2019-10-05 13:08:15.792345+00:00", "title": "Tumblr porn vanishes today", "language": "en", "text": "Tumblr’s ban on adult content is now in effect and users will begin to see explicit posts disappear from public view. Media showing sex acts, exposed genitals, and “female-presenting” nipples will be hidden.\n\nAll posts that are currently flagged as explicit are now being hidden from view, according to Tumblr, and that includes posts that users are in the process of appealing. In addition to what’s already gone, more adult content is going to be flagged in coming weeks, Tumblr says, and it hopes that the automated tools will be more accurate at picking out what counts as explicit.\n\nTumblr announced the ban on December 3rd to immediate backlash. Users began to mourn the site’s diverse sex positive communities and massive archives of explicit content. Some began to share a guide posted to Github for exporting Tumblr blogs on Windows, while others wrote eulogies for the site.\n\nTumblr is acknowledging users’ reactions while not changing the policies\n\nIn a blog post that went up today, Tumblr apologized to users: “We are sorry that this has not been an easy transition and we know we can do a better job of explaining what we’re doing.” It said the change would be a slow process that involves “flagging tens of billions of GIFs, videos, and photos.”\n\nMany users also criticized Tumblr’s decision to consider “female-presenting nipples” as explicit, while male-presenting nipples were still okay. Some pointed out that in the case of non-binary, genderfluid, or trans individuals, it would be confusing where the line would be drawn on whose nipples would be considered explicit. In its blog post today, Tumblr has added the caveat, “yeah, we know you hate this term,” but maintained the language and distinction.\n\nAfter Tumblr initially announced the ban, users immediately began to see innocuous posts of turtles, dogs, and dolls all flagged as explicit. Photos containing a bit of skin in leather tights or cleavage such as in a Fashion Week show were also flagged, despite not fitting Tumblr’s definition of adult content. Whether these posts are hidden from view today depends on whether users’ appeals were processed in time.\n\n“We understand and agree that there have been too many wrongfully flagged posts since we announced the policy change,” says Tumblr. But if users don’t appeal their posts, then they’re out of luck. That could also be a problem for popular older accounts, which may not have anyone monitoring them to appeal the overly aggressive moderation.\n\nFlagged content will be hidden, but not deleted, Tumblr emphasized. That will allow posts to be appealed even after they’re removed from public view.\n\nThis is explicit content. WILL SOMEBODY THINK OF THE CHILDREN!! #Tumblr pic.twitter.com/WQ5WCq3fgb — Emily | Animator & Illustrator☃️ (@EDAnimation) December 4, 2018\n\nTumblr says that its automated tools are getting smarter over time, so even if this cute photo of a dog is censored for now, eventually the tools should learn better. It also reassures bloggers that “all appeals will be sent to a real, live human who can make the appropriate call.”\n\nMore clarity was given on Tumblr’s nipple ban, with Tumblr saying nipples would be allowed in depictions of gender-confirmation surgery, breastfeeding, post-mastectomy surgery, and other health-related situations. Nudity in politics, sculptures, and illustrations are likewise allowed. But users will still need to appeal if their posts are misclassified, or they’ll remain hidden.", "description": "Tumblr’s ban on adult content is now in effect and users will begin to see explicit posts disappear from public view. Media showing sex acts, exposed genitals, and \"female-presenting\" nipples will be hidden.", "authors": ["Shannon Liao", "Dec"], "top_image": "https://cdn.vox-cdn.com/thumbor/O7zIGrXVdra3E5nZXmwTUH9VOPc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13627120/acastro_191203_177_tumblr_0003.jpg", "published_at": "2018-12-17"}