{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/uk-johnson-scores-rare-win-brexiteers-joy-short-lived-191022204953589.html", "downloaded_at": "2019-10-23 08:37:21.416805+00:00", "title": "UK's Johnson scores rare win - but Brexiteers' joy is short-lived", "language": "en", "text": "London, United Kingdom - UK Prime Minister Boris Johnson has scored a political victory by convincing the UK's divided parliament to back a Brexit deal for the first time in two years of political turmoil.\n\nIn another dramatic day in UK politics, MPs on Tuesday backed by 329 votes to 299 the second reading of a bill setting out his withdrawal agreement with the European Union - in what Johnson called a \"joyful\" moment.\n\nMore:\n\nHowever, parliamentarians immediately rejected the prime minister's bid to fast-track his Brexit legislation so that he could meet his \"do or die\" October 31 deadline for the UK to quit the EU.\n\nHe has now kicked the ball back into the EU's court, saying he will \"pause\" the progress of the legislation until Brussels decides whether to grant the UK an extension beyond October 31 - with analysts mostly suggesting it is likely to do so.\n\nBut while the day's events mean Brexit in some form has moved closer - despite continuing opposition among many MPs to leaving the EU - the risk of the UK withdrawing without an agreed deal remains.\n\n\"It certainly is looking very likely now that the UK will leave, given that the second reading has been approved - but Johnson really is going to have to think about what to do next,\" said Tim Bale, professor of politics at Queen Mary University London.\n\n\"I don't think it is necessarily a disaster for him not leaving on October 31 and suspect he will be forgiven by many of the voters he is trying to attract, as long as it looks as if he tried his best and was prevented from doing so by Parliament.\"\n\nThreat to pull bill\n\nThe prime minister had threatened to withdraw his withdrawal bill completely, thereby moving the United Kingdom closer to a \"no-deal\" Brexit if he lost control of the timing of the legislation, then engineering an election in which he could blame Parliament for his woes.\n\nA fear among Johnson's hardline Brexit supporters is that as his bill comes under scrutiny more potential flaws will be revealed, while any delay offers \"remainers\" the chance to attach key amendments such as a second Brexit referendum.\n\n\"As ever, it is really difficult to predict what is going to happen - nothing can or should be ruled out, although clearly, the UK Parliament is closer to authorising Brexit than it has been in the past,\" David Phinnemore, professor of European politics at Queen's University Belfast, told Al Jazeera.\n\n191022133107869\n\n\"We don't know what the requirements are going to be from the opposition in order to make progress on the Withdrawal Agreement Bill - we still can't rule out there being another referendum or a general election, and what the outcome of that might be.\"\n\nDavid Jeffery, a lecturer in British politics at the University of Liverpool, said that despite Johnson's victory, Brexit is not yet enshrined in law.\n\n\"It's still just a bill - not an act: all that has changed at the moment is that the House of Commons has shown there is a potential majority for that agreement, but that agreement hasn't been passed,\" he told Al Jazeera.\n\n\"The vote on timing was a way for people to signal to Boris that there is potential in the Commons to support his deal, but that MPs won't be bullied into quickly approving it.\"\n\nHowever, Jeffery believes Johnson has little intention of allowing the Commons to dictate the timetable because he has put so much emphasis on making Brexit happen on October 31.\n\n\"I think his best hope now is to go to the EU and say 'I have got this bill, it has support in the house, so you need to say: No extension', and that will force MPs who really do want to avoid no-deal to actually vote for this deal.\"\n\nTwo groups of MPs were key to Johnson's initial win - Conservative MPs expelled from the party for opposing a \"no-deal\", but now mostly being lured back by the prime minister, and opposition Labour MPs frustrated with the inability of Parliament to move forward with Brexit.\n\nA third group, the small Northern Irish Democratic Unionist Party - who are infuriated with Johnson over his proposals to leave the region within the EU customs orbit - appears to have backed him in the first vote then frustrated him in the second.\n\nEuropean leaders must decide\n\nAttention is now turning to what European leaders decide to do, with the possibility of offering either a very short Brexit extension or a longer, three-month extension.\n\nBale said Johnson was likely to lobby strongly against a longer extension, but offering the UK a short extension could be a hostage to fortune because it creates a new \"cliff edge\" if MPs still cannot agree on Johnson's bill when it returns to Parliament.\n\n\"What they might do is grant some kind of rolling extension, say an extension for three months that can be foreshortened if the bill passes in Parliament before then,\" he said.\n\n191017111245923\n\nPhinnemore said the European Parliament will also want time to weigh up its options and could kick this down the road into its next plenary session in November.\n\n\"The pragmatist in me says they will want to create enough time so that a majority can be found in the UK Parliament for approving the withdrawal agreement at a third reading,\" he said.\n\n\"I would imagine the UK government is thinking along those lines, as well. It was interesting to note that the final statement from the prime minister in Parliament did not include that we will have Brexit on October 31 - his commitment is to Brexit itself.\"\n\nLabour leader Jeremy Corbyn said Johnson was \"the author of his own misfortune\" and called on him to work with other parties to agree a \"reasonable timetable\" to his legislation.\n\nHowever, there is no concealing the fact that, in order to get farther than his predecessor, Theresa May, Johnson has relied on the support of Labour MPs, opening the prospect of a fresh bout of civil warfare in the opposition.", "description": "British PM puts EU withdrawal bill on hold as UK awaits word from Brussels on possible three-month Brexit delay.", "authors": ["Gavin O'Toole"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/22/98ed00d1071f491ab5c02fe0511f973e_18.jpg", "published_at": "2019-10-22"}