{"pub": "investing.com", "url": "https://ca.investing.com/news/economy/update-1greta-thunberg-leads-montreal-climate-strike-amid-aviation-emissions-talks-1977059", "downloaded_at": "2019-09-27 15:10:01.340102+00:00", "title": "Greta Thunberg leads Montreal climate strike amid aviation emissions talks", "language": "en", "text": "Greta Thunberg leads Montreal climate strike amid aviation emissions talks\n\n* Thunberg due to speak at the protest\n\n* Student climate protesters stage more Friday marches\n\n* Environment is among top issues at Canada election\n\n* The vote is less than a month away\n\nBy Allison Lampert\n\nMONTREAL, Sept 27 (Reuters) - Teenage activist Greta Thunberg, who inspired a \"flight-shaming\" movement against air travel, is spearheading a climate change strike on Friday in Montreal where U.N. aviation leaders are gathering to debate plane emission targets.\n\nThe 16-year-old Swede is in Canada and will speak at the protest, which is taking place less than a month before a federal election where the environment is one of the top issues for voters, according to polls.\n\nBoth Liberal Prime Minister Justin Trudeau and Green Party chief Elizabeth May will also be joining in the march, while New Democrat leader Jagmeet Singh will be in one on the west coast. Conservative leader Andrew Scheer is not participating.\n\nAt a campaign stop on Thursday, Trudeau said he looked forward to marching in Montreal \"to fight for the environment\".\n\nBoth Trudeau and May have focused on their climate action plans ahead of the Oct. 21 election, but Trudeau has also had to defend his decision to buy and expand a major oil pipeline in western Canada. month, Thunberg sailed across the Atlantic to the United States from Britain in a zero-carbon emissions boat to protest air travel emissions, and she denounced world leaders earlier this week for failing to tackle climate change. has inspired millions of young people to take to the streets over climate change since starting solitary weekly protests outside Swedish parliament a year ago.\n\nOn Friday, protests started in Asia and then continued in Europe. Tens of thousands of students kicked things off in New Zealand, and Thunberg herself has been tweeting images from marches held in dozens of cities around the world. ACTION\"\n\nIn Montreal, the march begins at about 12 p.m. ET (4 p.m. GMT) and Thunberg is expected to speak at the end, at about 4 p.m. ET.\n\nThe Montreal protest comes as the International Civil Aviation Organization (ICAO) is debating ways to minimize the sector's impact on the environment at its triennial assembly, which runs until Oct. 4 in the Canadian city. expressed \"enthusiasm and support\" for the march on Thursday, adding that \"more action and faster innovation are now required to address aviation's near- and long-term impacts\".\n\nCommercial flying accounts for 2.5% of carbon emissions. But with passenger numbers forecast to double by 2037, experts say emissions will rise if more is not done.\n\nIn 2016, ICAO brokered the first global industrial climate initiative with a medium-term scheme to help airlines avoid adding to their net emissions from 2020.\n\nThe Carbon Offsetting and Reduction Scheme for International Aviation requires most airlines to limit emissions or offset them by purchasing credits from environmental projects.\n\n\"I am convinced that if we can solve the problem of greenhouse gas emissions, aviation will continue to grow in an important way,\" Airbus CEO Guillaume Faury told reporters on Thursday evening in Montreal.\n\nIndustry says around $40 billion in climate financing will be generated between 2020 and 2035. In Europe, environmentalists and the industry itself want ICAO to commit now to setting longer-term goals at its 2022 assembly.\n\n\"During the ICAO assembly, we will join with our industry partners to call for a significant and ambitious long-term target for CO2 reduction,\" said Angela Gittens, director general of Airports Council International.", "description": "Greta Thunberg leads Montreal climate strike amid aviation emissions talks", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/news_headline_rolled_69x52._800x533_L_1419494221.jpg", "published_at": "2019-09-27"}