{"pub": "reuters", "url": "https://in.reuters.com/article/india-kashmir/india-partially-restores-mobile-phone-lines-in-kashmir-idINKBN1WT1EX", "downloaded_at": "2019-10-14 11:30:21.956906+00:00", "title": "India partially restores mobile phone lines in Kashmir", "language": "en", "text": "FILE PHOTO: An aerial view shows Dal lake, one of Kashmir's main tourist attractions, in Srinagar, September 20, 2019. REUTERS/Francis Mascarenhas/File Photo\n\nSRINAGAR (Reuters) - India restored some mobile phone services in contested Kashmir on Monday, two months after imposing a communications clampdown on the Himalayan region.\n\nIndia stripped its portion of the Muslim-majority Kashmir valley of statehood and autonomy on Aug. 5, cutting internet and phone lines and arresting thousands in an attempt to dampen dissent.\n\nThe restrictions have gradually been eased. Landlines were restored last month, and an advisory asking tourists to not travel to the region was lifted last week. But the majority of people in the region remain without access to mobile networks or broadband internet connections.\n\nMobile phones taken out on contracts, known in India as “post-paid” plans, were functional across Indian-administered Kashmir on Monday. Pre-paid mobile phones remained restricted.\n\n“It is a big relief,” said Javed Ahmed, a Kashmiri in the region’s main city of Srinagar. “At least we can get in touch with our loved ones. But the major issue is the internet shutdown.”\n\nThe communication restrictions have hit access to healthcare and services and rights groups have been calling for them to be removed. In August, United Nations experts termed the curbs “a form of collective punishment”.\n\n“Patients were not able to report to hospital due to the clampdown,” said a psychiatrist at Srinagar’s Shri Maharaja Hari Singh hospital, who declined to be named as he was not authorised to speak to the media. “We hope they will do now. They missed a lot of sessions of counselling.”\n\nNuclear-armed arch-rivals India and Pakistan have fought two wars over Kashmir. Both countries claim the region in full but rule it in part.\n\nNew Delhi maintains that some restrictions in the region are still required to combat a decades-old insurgency against its rule, which it accuses Pakistan of fomenting. Islamabad denies this, saying it provides only diplomatic and moral support to Kashmiri separatists.", "description": "India restored some mobile phone services in contested Kashmir on Monday, two months after imposing a communications clampdown on the Himalayan region.", "authors": ["Fayaz Bukhari", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440694479&w=1200&r=LYNXMPEF9D0VZ", "published_at": "2019-10-14"}