{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/state-department-official-expected-part-impeachment-probe/story?id=66532626", "downloaded_at": "2019-10-26 11:16:30.479029+00:00", "title": "State Department official expected to appear as part of impeachment probe", "language": "en", "text": "Philip Reeker, the acting Assistant Secretary of European and Eurasian affairs, is scheduled to appear Saturday for a closed-door interview with the three congressional committees leading an impeachment inquiry into President Donald Trump.\n\nInterested in Impeachment Inquiry? Add Impeachment Inquiry as an interest to stay up to date on the latest Impeachment Inquiry news, video, and analysis from ABC News. Add Interest\n\nReeker would be the ninth official to appear for testimony as part of the inquiry and the latest in a line of career diplomats who have complied with a House subpoena and defied White House orders not to comply.\n\nAs the top U.S. diplomat for Europe, Reeker was communicating with key officials who were either part of the efforts of Trump and his personal lawyer Rudy Giuliani to have Ukraine launch investigations that would favor him politically, or were swept up in that effort. Reeker also was communicating with Secretary of State Mike Pompeo and his top aides and may be able to shed more light on what Pompeo knew.\n\nGiuliani was working with former special envoy for Ukraine Kurt Volker and U.S. ambassador to the European Union Gordon Sondland to press Ukraine's new president, Volodymyr Zelenskiy, and his advisers to open investigations into the Ukrainian energy company Burisma and former Vice President Joe Biden's son, Hunter, as well as into a conspiracy theory about Ukrainian interference in the 2016 election.\n\nAt the heart of the impeachment inquiry is whether launching those investigations was a precondition for Trump to meet with Zelenskiy and release $391 million of military assistance to the country as it battles Russian-led separatists in its eastern provinces.\n\nReeker has remained out of the spotlight of the impeachment saga so far. But like other career diplomats before him, Reeker is expected to appear for his deposition after being subpoenaed despite a White House letter to the House saying executive branch officials would not testify.\n\nEPA via Shutterstock, FILE\n\nReeker has been a Foreign Service officer since 1992 under Republican and Democratic administrations and was made acting assistant secretary in March by Pompeo. He received the nomination for and became ambassador to Macedonia under George W. Bush and previously served as deputy assistant secretary for Europe and deputy spokesperson for the department.\n\nReeker’s testimony could involve discussions around the former U.S. ambassador to Ukraine, Marie Yovanovitch. According to emails turned over by the State Department to its inspector general and obtained by ABC News, Reeker forwarded emails in March to Ulrich Brechbuhl, a top Pompeo adviser, about attacks against Yovanovitch while she was still ambassador.\n\nFor months, Giuliani and his associates accused Yovanovitch of blocking investigations into Democrats by withholding visas and giving the prosecutor general a list of officials not to prosecute, despite the fact that career state department officials dismissed those claims as false.\n\nIn one of the forwarded emails, deputy assistant secretary George Kent called those accusations a \"fake news-driven smear campaign\" led by Giuliani and his associates. Kent testified before the impeachment probe on Oct. 15.\n\nIn an email to Brechbuhl, who serves as the State Department counselor, Reeker called the accusations against Yovanovitch a \"fake narrative\" that was \"really ... without merit or validation.\"\n\nOn two other occasions, as Yovanovitch was being attacked in conservative U.S. media, Reeker forwarded Brechbuhl information gathered by State Department officials to counter the allegations. In one case, the subject line was, \"Ukr[aine] fake news smear: Thursday Updates.\"\n\nNevertheless, Trump recalled her from her post early and called her \"bad news.\"\n\nThe committees likely also will press Reeker on any contacts with Bill Taylor, the veteran U.S. diplomat whom Pompeo convinced to come out of retirement to take over for Yovanovitch. As the top diplomat to Ukraine, Taylor testified Tuesday that he learned from communications with Sondland that a Trump-Zelenskiy meeting and that security assistance were dependent on Zelenskiy opening investigations.\n\nIn his opening statement obtained by ABC News, Taylor references Reeker directly, saying that in a conversation in June with Reeker, Sondland, Brechbuhl and Energy Secretary Rick Perry, they all agreed that a meeting between Trump and Zelenskiy was an \"agreed upon goal.\"\n\nBecause Reeker is appearing on a Saturday, it's possible there will be fewer elected representatives present, as many members return to their home districts on weekends. Staff members who work on the three House committees will be present for the testimony, though, and will be allowed to ask questions, as has been the case for other witness depositions.", "description": "A State Department official is scheduled to speak before three committees on Saturday in relation to the ongoing impeachment probe.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/philip-reeker-rex-aa-191025_hpMain_16x9_992.jpg", "published_at": "2019-10-26"}