{"pub": "yahoo", "url": "https://finance.yahoo.com/news/veoneer-inc-vne-expected-beat-143202408.html", "downloaded_at": "2019-10-17 01:52:17.688933+00:00", "title": "Veoneer, Inc. (VNE) Expected to Beat Earnings Estimates: Can the Stock Move Higher?", "language": "en", "text": "Wall Street expects a year-over-year decline in earnings on lower revenues when Veoneer, Inc. (VNE) reports results for the quarter ended September 2019. While this widely-known consensus outlook is important in gauging the company's earnings picture, a powerful factor that could impact its near-term stock price is how the actual results compare to these estimates.\n\nThe earnings report, which is expected to be released on October 23, 2019, might help the stock move higher if these key numbers are better than expectations. On the other hand, if they miss, the stock may move lower.\n\nWhile management's discussion of business conditions on the earnings call will mostly determine the sustainability of the immediate price change and future earnings expectations, it's worth having a handicapping insight into the odds of a positive EPS surprise.\n\nZacks Consensus Estimate\n\nThis company is expected to post quarterly loss of $1.40 per share in its upcoming report, which represents a year-over-year change of -79.5%.\n\nRevenues are expected to be $476.42 million, down 9.4% from the year-ago quarter.\n\nEstimate Revisions Trend\n\nThe consensus EPS estimate for the quarter has been revised 2.22% higher over the last 30 days to the current level. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period.\n\nInvestors should keep in mind that an aggregate change may not always reflect the direction of estimate revisions by each of the covering analysts.\n\nPrice, Consensus and EPS Surprise\n\nEarnings Whisper\n\nEstimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. Our proprietary surprise prediction model -- the Zacks Earnings ESP (Expected Surprise Prediction) -- has this insight at its core.\n\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\n\nThus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only.\n\nA positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time, and a solid Zacks Rank actually increases the predictive power of Earnings ESP.\n\nPlease note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).\n\nHow Have the Numbers Shaped Up for Veoneer, Inc.\n\nFor Veoneer, Inc.The Most Accurate Estimate is higher than the Zacks Consensus Estimate, suggesting that analysts have recently become bullish on the company's earnings prospects. This has resulted in an Earnings ESP of +7.17%.\n\nStory continues", "description": "Veoneer, Inc. (VNE) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.", "authors": ["Zacks Equity Research"], "top_image": "https://s.yimg.com/uu/api/res/1.2/c17LscPwh2ZHDPRMekvC8w--~B/aD02MDA7dz05MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/2f0d6efdd8740952a371c97ddea6e926", "published_at": "2019-10-16"}