{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/03/swedish-police-warn-brutal-nigerian-mafia-gaining-foothold-stockholm", "downloaded_at": "2019-10-05 05:54:44.462119+00:00", "title": "Swedish Police Warn Brutal Nigerian Mafia Gaining Foothold in Stockholm", "language": "en", "text": "Stockholm police have warned of the growing influence of the “Black Ax”, a Nigerian criminal gang connected to drug trafficking and prostitution involving illegal migrants.\n\nThe Black Ax is said to be an international group which operates in several southern European countries. Fifteen members of the group were arrested this week in Gothenburg in connection to drug trafficking cases, Sveriges Radio reports.\n\nEarlier this week, Gothenburg police arrested 15 drug smugglers connected to an international cocaine and heroin smuggling ring, finding 115 million Swedish kronor’s ($11,647,775/£9,467,375) worth of drugs.\n\nSwedish customs say they seized approximately 300lbs of narcotics in total, including 110lbs of heroin. Prosecutor Anna Svedin noted that the network was based in the Netherlands and said: “Some of the defendants have links to Black Ax, but not all.”\n\nLennart Karlsson, intervention manager at the Klara area in Stockholm, said that police have noted an increased presence of the Nigerian mafia in recent years. Mr Karlsson said: “The really heavy establishment has been over the last five years.”\n\nItaly: Nigerian Mafia Bust Reveals Sexual Slavery, Voodoo Rituals https://t.co/l9VGeXtztg — Breitbart London (@BreitbartLondon) February 16, 2019\n\n“The mosque here hears from us. They often meet people who have been told to come here and get contacts to get a job. But then the Black Ax members hang outside and attract them,” he continued.\n\n“This organisation works with both prostitution and drug trafficking,” he added.\n\nKarlsson labelled the Nigerian mafia “one of the world’s most effective crime syndicates” and went on to note: “So unfortunately for us, they probably have a pretty bright future.”\n\nThe Nigerian mafia is also known to use juju, a Nigerian equivalent of voodoo, to force migrants to become drug traffickers or prostitutes. This technique has been seen elsewhere in Europe such as Spain and Italy where the Nigerian mafia also operates.\n\nEarlier this year, Italian police warned of the potential of Islamic radicalisation among the Nigerian mafia, saying that the influence of terrorist groups like Boko Haram was spreading among mafia members.", "description": "Stockholm police have warned of the growing influence of the \"Black Ax\", a Nigerian criminal gang connected to drug trafficking.", "authors": ["Chris Tomlinson"], "top_image": "https://media.breitbart.com/media/2018/11/GettyImages-906225764.png", "published_at": "2019-10-03"}