{"pub": "indiatimes", "url": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/best-train-ever-made-in-india-trail-blazing-train-18-could-be-a-game-changer-for-inter-city-commuters", "downloaded_at": "2019-10-05 13:32:12.634943+00:00", "title": "Best train ever made in India? Trail blazing Train 18 could be a game changer for inter-city commuters", "language": "en", "text": "Vying to match state-of-the-art trainsets running in Europe or Japan the Indian Railways’ new genre train, codenamed ‘Train 18’, signifies a “major leap in technology wholly developed by our engineers”, as minister Piyush Goyal said in his recent interim budget speech. The growing global trend favours trainsets for medium and high speed trains, implying a set of coaches coupled mechanically and electrically with driving cabs at both ends and distributed traction power across the train, conducive to quicker turnaround at terminals, faster acceleration, energy efficiency and operating flexibility.\n\nAs a ‘Make in India’ initiative the Integral Coach Factory (ICF), Chennai turned out this first of the programmed ten semi-high-speed (up to 160 km/h) trainsets, to progressively replace the inter-city Shatabdi Express trains. In his own words, the just retired ICF general manager S Mani led a key team “to harness their technical chutzpah to design and manufacture the best train ever made in India, matching world standards … and do it well before December 2018 and hence the name Train 18”.\n\nBeyond the concept of a new generation world class train on IR, the project obliged Mani to pugnaciously follow up to secure IR board’s sanction, then motivate his team to successfully roll out the first trainset, with 80% of components procured indigenously, within an incredible 18 months, that too within the estimated cost tag of Rs 100 crore.\n\nA 16 coach rake, with all its power equipment under-slung, provides optimum seating capacity of 1,128 – in two executive cars, 12 second class coaches, and two motorised coaches. Combining functionality and aesthetics, speed with safety, and service with style, the avant-garde train has a striking modern look along with high-end amenities and conveniences comparable to, if not better than, an aircraft – including digitalised sliding doors and footsteps, emergency talk-back unit, CCTVs, Wi-Fi, GPS-based information screens, LCD TV on executive class rotatable seats, zero discharge vacuum based toilets, intelligent air conditioning.\n\nThe T18 project has generated new confidence in IR to set its sights high, and to explore export possibilities as semi-high speed (150-200 km/h) trainset can be a cost-effective alternative to highly cost-intensive HSR systems (250-350 km/h). A project to develop/ acquire 15 trainsets, aluminium bodied, energy efficient, including some with sleeper coaches is also on the anvil to replace the present Rajdhani rakes. Hopefully, IR board will pursue the project with alacrity.\n\nIR faces the looming shadow of competition not only from budget airlines but also from modern, high-capacity buses as well as personal cars covering inter-city distances. Notwithstanding some sporadic launches of new branded trains, such as Tejas, Humsafar, Antyodaya, Uday, IR has demonstrated little concerted strategy to expand, accelerate and modernise its passenger business.\n\nFirstly, IR needs to acknowledge that a rigid bureaucratic structure is antithetical to business ethos. It must shed its widely, and mistakenly, perceived role of a departmental undertaking with public service obligation and, instead, perform as a corporate entity oriented to customers. Secondly, it may well restructure its passenger and freight businesses as separate profit centres for specialised and focussed attention.\n\nThirdly, its debilitating pricing structure needs to be immediately addressed. The second class ordinary train journeys constituted 78.6% of IR’s total passenger traffic in 2016-17, yielding just 16.7% of total passenger earnings. Narrowing fare gap between airlines and railways has been a catalyst for the switch from trains to airlines. IR must not out-price itself in the “upper class” segment. It is presumed it has done due diligence while fixing the Vande Bharat Express fares at 1.4 times the basic fare for economy class on Shatabdi Express and 1.3 times for executive class.\n\nAgain, the slow, stopping “regional” services contribute the maximum loss in passenger business and consume scarce movement capacity. An autonomous corporate entity under the IR umbrella, will be well placed to deal in this segment of rail business with a clear focus, coordinate better with respective state government authorities and provide for multi-modal transport.\n\nThe real importance of ‘T18’ lies in lessons it holds for frugal engineering, project management, and empowering managers who dare dream big. Hopefully, this story of gumption, guts and grit will spur IR management to break the mould of their perceived ineptitude and pusillanimity. It needs to heed how some of the most successful companies faded into irrelevance – because they remained complacent, failing to adapt their businesses and structures to brewing market disruptions, trends and technologies.", "description": "Vying to match state-of-the-art trainsets running in Europe or Japan the Indian Railways’ new genre train, codenamed ‘Train 18’, signifies a “major leap in technology wholly developed by our engineers”, as minister Piyush Goyal said...", "authors": ["Raghu Dayal"], "top_image": "https://timesofindia.indiatimes.com/blogs/wp-content/uploads/2019/02/GettyImages-1125037314.jpg", "published_at": "2019-02-21"}