{"pub": "fox", "url": "https://foxnews.com/opinion/tucker-carlson-outrage-trump-syria-gop-kurds", "downloaded_at": "2019-10-08 15:15:06.940568+00:00", "title": "Tucker Carlson: Outrage over Trump's Syria decision shows Washington's perverse priorities", "language": "en", "text": "Finally, some good news from Washington. That doesn't happen very often. Over the weekend, the Trump administration announced plans to withdraw the remaining American troops that are still stationed in Northern Syria.\n\nOf countless decisions Donald Trump has announced via Twitter, you'd think this would be the least controversial of all. There's no reason for Americans to remain in Syria. ISIS no longer controls the cities there. We have no plans to overthrow the Assad government either.\n\nSo, there's no longer a mission, and yet Syria remains a dangerous place. Five Americans have been killed there just this year, and that's especially poignant, given how pointless it is. So whatever you think of Donald Trump, he is admitting this -- the obvious -- and trying to fix it.\n\nTRUMP DEFENDS DECISION TO WITHDRAW TROOPS FROM SYRIA AMID GOP CRITICISM\n\nFor once, Americans are coming home from a Middle Eastern tar pit, rather than staying forever, and we ought to be celebrating that. Across the country people are. But in Washington, people are apoplectic. They're telling us we're not allowed to leave Syria. It's immoral, they say. It's a betrayal. Not a betrayal of Americans - that wouldn't be a problem here in Washington. It happens here every day.\n\nNo, it's much worse than that. It's a betrayal of an ethnic group in the mountainous parts of Southwest Asia called the Kurds.\n\nNow, what exactly do the people on TV know about Kurds? Well, nothing really. And in fact, it would be shocking if anyone at MSNBC had ever met a Kurd. And yet, suddenly on Monday, everyone in Washington seemed thoroughly outraged on their behalf.\n\nJoel Rubin, former Deputy Assistant Secretary of State: Yes, amen. It's psychotic. It makes no sense. Essentially, you can go to the slaughter at the hands of Turkey. I'm washing my hands off it.\n\nAndrea Mitchell, NBC News chief foreign affairs correspondent: What is the message to abandoning these Syrian Kurds who have fought so valiantly for the U.S.?\n\nJohn Berman, CNN anchor: And now it seems as if the U.S. is hanging them out to dry.\n\nBen Wedeman, CNN senior international correspondent: Yet again, the Kurds are being betrayed by those who helped them.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nJim Sciutto, CNN anchor: I just wonder, where is U.S. credibility in the region with both its friends and its adversaries after abandoning the Kurds again?\n\nWe'd love to tell you that it was just the lefty hacks on CNN demanding that we stay in Syria forever. But unfortunately, it was not. Not even close. A ton of Republicans on Capitol Hill made exactly the same point.\n\nWhat you're looking at is a set of priorities so mindless, so perverse and distorted that there's, in fact, no fixing them.\n\nMitt Romney did, so did Pat Toomey of Pennsylvania, Ben Sasse of Nebraska, even Mitch McConnell, the Senate Majority Leader. All of them seemed far angrier about the prospect of leaving Syria than they ever do about illegal immigration or Americans dying of fentanyl ODs.\n\nSome of the angry senators cited Vladimir Putin as if it were somehow 1982 again, and Russia was the preeminent threat to American interests. The professional neocons, not surprisingly -- and there are a lot of them here -- went completely bonkers, wilder even than they usually are.\n\nFormer Bush speechwriter David Frum suggested that President Trump must be paying off Turkey for covering up Jamal Khashoggi's murder in the Saudi consulate in Istanbul. Whoa. Frum provided no evidence that this was true, but no one in Washington asked for any evidence. They were too busy nodding along in agreement. Oh, yes, yes.\n\nSen. Lindsey Graham of South Carolina, for example, got so worked up by the idea of Americans leaving a foreign war zone, the one thing that is never allowed, that he forgot to make any sense at all.\n\n\"If I didn't see Donald Trump's name on the tweet, I thought it would be Obama's rationale for getting out of Iraq,\" he said during an interview on Fox News on Monday. \"So here's what's going to happen. This is going to lead to ISIS' reemergence, nothing better for ISIS than to create a conflict between the Kurds and Turkey. The Kurds will now align with Assad because they have nobody to count on because we abandoned them. So this is a big win for Iran and Assad, a big win for ISIS.\"\n\nWhenever politicians in Washington tell you they know exactly what's going to happen, be sure not to bet on it. But think more deeply about it for a second.\n\nAssad and ISIS and Iran, for that matter, are on different sides of the conflict. So how can an American withdrawal be a win for both sides? That actually doesn't make any sense at all. Graham didn't explain how that might work. He turned down our offer to come on \"Tucker Carlson Tonight\", so we can only guess.\n\nNikki Haley, meanwhile, strongly agrees with Graham. After resigning as U.N. ambassador, Haley took a job on the board of directors of Boeing, the airplane manufacturer. Three months ago, Turkey suggested it may back out of a $10 billion deal with Boeing to buy jets for Turkish Airlines.\n\nOn Monday, perhaps not coincidentally, Haley tweeted this: \"We must always have the backs of our allies if we expect them to have our back. The Kurds were instrumental in our successful fight against ISIS in Syria. Leaving them to die is a big mistake. #TurkeyIsNotOurFriend.\"\n\nTurkey is not our friend? That's a surprise to those of us who've been paying attention because it was barely a year ago that official Washington -- I mean, everybody -- was outraged. They were savaging the president for the crime of undermining NATO.\n\nThe Atlantic, in one example, ran this headline: \"Trump's Biggest Gift to Putin is Questioning NATO.\" Just questioning NATO was totally forbidden. It was a sin. And people like Nikki Haley strongly agreed with that.\n\nBut here's the weird thing: The Kurds aren't part of NATO because there is no Kurdistan. Turkey is part of NATO. They're one of our fabled NATO allies. That means we're bound by treaty to defend the Turks if they are attacked.\n\nIndeed, at this very moment, you may not know this, Turkey is hosting about 50 American nuclear weapons. So does that make Turkey our friend or our enemy? Washington can't decide.\n\nThe only point that everyone here can agree on is that the interests of foreigners are far more important than our own interests. It is immoral, they are telling us, to look at for own people. But it is virtuous to suffer for others, particularly for those who hate us.\n\nHundreds of thousands of Americans die from drugs manufactured by our enemies abroad -- Mexico and China. How do our leaders respond? They shrug. They couldn't care less. They do nothing.\n\nAnd then Turkey threatens to invade Northern Syria, a place that one in a thousand Americans could find on a map. And guess what that is? It's a historic crisis, and Lindsey Graham won't stand for it.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWhat you're looking at is a set of priorities so mindless, so perverse and distorted that there's, in fact, no fixing them. In the end, the only solution may be the obvious one --- relocate the Kurds to Youngstown, Ohio. Only then will Washington finally care.\n\nAdapted from Tucker Carlson's monologue from \"Tucker Carlson Tonight\" on Oct. 7, 2019.\n\nCLICK HERE READ MORE FROM TUCKER CARLSON", "description": "You would think Trump's decision to withdraw US forces from a potential endless war in Syria would be celebrated. Not in Washington.", "authors": ["Tucker Carlson", "Tucker Carlson Currently Serves As The Host Of Fox News Channel S", "Fnc"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/08/694940094001_6093015064001_6093023786001-vs.jpg", "published_at": "2019-10-08"}