{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-england-vs-france-guilhem-guirado-mourad-boudjellal-jacques-brunel-a9146166.html", "downloaded_at": "2019-10-07 20:10:10.156154+00:00", "title": "Rugby World Cup 2019: France squad on the cusp of chaos with captain Guilhem Guirado ousted ahead of England clash", "language": "en", "text": "The French rugby squad is on the cusp of an all-too-familiar civil war at the Rugby World Cup ahead of ‘Le Crunch’ against England, following a stunning outburst from Toulon owner Mourad Boudjellal and report captain Guilhem Guirado has been ousted from his role by the senior management.\n\nFrance laboured to a 23-21 victory over Tonga on Sunday night to book their place in the quarter-finals with a match to spare. But their performances in Japan have got increasingly worse as the tournament has gone on, and with a winner-takes-all encounter against rivals England scheduled on Saturday, the French camp appears to be in disarray once again.\n\nEight years after a player coup took France from pool-stage calamity in losing to Tonga to the World Cup final, French newspaper Midi Olympique has reported a fallout between Guirado and the senior staff that includes head coach Jacques Brunel and assistant Fabien Galthie, who is set to replace Brunel after the World Cup. It adds that the row could spread to the rest of the squad given that Guirado remains “the players’ captain”, but Jefferson Poirot seems certain to skipper Les Bleus against England this weekend.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe scenario took a further twist on Monday after Toulon owner Boudjellal – for whom Guirado played for in France between 2014 and this summer – launched a fierce verbal attack on the coaching team, and called for the players to “take control” of the campaign as has happened in the past.\n\n“Take control guys, take the power, because there are coaches all over the place. Our team spirit is almost non-existent,” Boudjellal said. “Individually, we have players who are world class. Collectively, for several years, that hasn’t been the case.\n\nShape Created with Sketch. Rugby World Cup 2019 best pictures Show all 35 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rugby World Cup 2019 best pictures 1/35 Rugby World Cup 2019 The tournament takes place in Japan AFP/Getty Images 2/35 Rugby World Cup 2019 France's players attends a training session at the Fuji Hokuroku Park AFP/Getty Images 3/35 Rugby World Cup 2019 Japanese children perform the Haka AFP/Getty Images 4/35 Rugby World Cup 2019 Ireland's Rhys Ruddock attends a gym training session AFP/Getty Images 5/35 Rugby World Cup 2019 Japan's wing Kotaro Matsushima is tackled by Russia's centre Vladimir Ostroushko AFP/Getty Images 6/35 Rugby World Cup 2019 Former New Zealand international Richie McCaw holds the Rugby World Cup trophy during the tournament's opening ceremony AFP/Getty Images 7/35 Rugby World Cup 2019 Japan fans cheer on their team AFP/Getty Images 8/35 Rugby World Cup 2019 An Argentina fan wearing a mask with an image of football player Lionel Messi AFP/Getty Images 9/35 Rugby World Cup 2019 France supporters kiss outside the Tokyo Stadium AFP/Getty Images 10/35 Rugby World Cup 2019 A France supporter dressed as Obelix AFP/Getty Images 11/35 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 12/35 Rugby World Cup 2019 Australia's hooker Silatolu Latu is tackled AFP/Getty Images 13/35 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 14/35 Rugby World Cup 2019 A France fan waits AFP/Getty Images 15/35 Rugby World Cup 2019 Argentina's centre Jeronimo de la Fuente (C) is tackled by France's wing Yoann Huget AFP/Getty Images 16/35 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 17/35 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 18/35 Rugby World Cup 2019 Japan's players bow AFP/Getty Images 19/35 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara (L) and full back Ben Smith interact with fans AFP/Getty Images 20/35 Rugby World Cup 2019 Fans await the start of a game AFP/Getty Images 21/35 Rugby World Cup 2019 Ireland's wing Jacob Stockdale (2nd R) runs with the ball AFP/Getty Images 22/35 Rugby World Cup 2019 England's centre Manu Tuilagi scores a try AFP/Getty Images 23/35 Rugby World Cup 2019 England supporters attend a match AFP/Getty Images 24/35 Rugby World Cup 2019 A dog with ears coloured in pink AFP/Getty Images 25/35 Rugby World Cup 2019 A Wales supporters laughs outside the City of Toyota Stadium AFP/Getty Images 26/35 Rugby World Cup 2019 A US fan wears shows his support for the Eagles against England. Getty Images 27/35 Rugby World Cup 2019 Argentina vs Tonga takes places at the picturesque Hanazono Stadium. Getty Images 28/35 Rugby World Cup 2019 An Argentina supporter celebrates the victory over Tonga. AFP/Getty Images 29/35 Rugby World Cup 2019 Isileli Nakajima celebrates after Japan beat Ireland in one of the great World Cup upsets. AFP/Getty Images 30/35 Rugby World Cup 2019 The Japan team celebrate following the famous win over Ireland. AFP/Getty Images 31/35 Rugby World Cup 2019 The Tokyo Stadium was lit up by fireworks following Japan's win in the capital. Getty Images 32/35 Rugby World Cup 2019 Workers clear the stadium after the match in Tokyo. REUTERS 33/35 Rugby World Cup 2019 Japanese fans celebrate in the Tokyo fans park. AFP/Getty Images 34/35 Rugby World Cup 2019 All across the country, Japan fans were jubilant after the incredible win. AFP/Getty Images 35/35 Rugby World Cup 2019 Namibia fans show their support ahead of kick-off against South Africa. AFP/Getty Images 1/35 Rugby World Cup 2019 The tournament takes place in Japan AFP/Getty Images 2/35 Rugby World Cup 2019 France's players attends a training session at the Fuji Hokuroku Park AFP/Getty Images 3/35 Rugby World Cup 2019 Japanese children perform the Haka AFP/Getty Images 4/35 Rugby World Cup 2019 Ireland's Rhys Ruddock attends a gym training session AFP/Getty Images 5/35 Rugby World Cup 2019 Japan's wing Kotaro Matsushima is tackled by Russia's centre Vladimir Ostroushko AFP/Getty Images 6/35 Rugby World Cup 2019 Former New Zealand international Richie McCaw holds the Rugby World Cup trophy during the tournament's opening ceremony AFP/Getty Images 7/35 Rugby World Cup 2019 Japan fans cheer on their team AFP/Getty Images 8/35 Rugby World Cup 2019 An Argentina fan wearing a mask with an image of football player Lionel Messi AFP/Getty Images 9/35 Rugby World Cup 2019 France supporters kiss outside the Tokyo Stadium AFP/Getty Images 10/35 Rugby World Cup 2019 A France supporter dressed as Obelix AFP/Getty Images 11/35 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 12/35 Rugby World Cup 2019 Australia's hooker Silatolu Latu is tackled AFP/Getty Images 13/35 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 14/35 Rugby World Cup 2019 A France fan waits AFP/Getty Images 15/35 Rugby World Cup 2019 Argentina's centre Jeronimo de la Fuente (C) is tackled by France's wing Yoann Huget AFP/Getty Images 16/35 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 17/35 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 18/35 Rugby World Cup 2019 Japan's players bow AFP/Getty Images 19/35 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara (L) and full back Ben Smith interact with fans AFP/Getty Images 20/35 Rugby World Cup 2019 Fans await the start of a game AFP/Getty Images 21/35 Rugby World Cup 2019 Ireland's wing Jacob Stockdale (2nd R) runs with the ball AFP/Getty Images 22/35 Rugby World Cup 2019 England's centre Manu Tuilagi scores a try AFP/Getty Images 23/35 Rugby World Cup 2019 England supporters attend a match AFP/Getty Images 24/35 Rugby World Cup 2019 A dog with ears coloured in pink AFP/Getty Images 25/35 Rugby World Cup 2019 A Wales supporters laughs outside the City of Toyota Stadium AFP/Getty Images 26/35 Rugby World Cup 2019 A US fan wears shows his support for the Eagles against England. Getty Images 27/35 Rugby World Cup 2019 Argentina vs Tonga takes places at the picturesque Hanazono Stadium. Getty Images 28/35 Rugby World Cup 2019 An Argentina supporter celebrates the victory over Tonga. AFP/Getty Images 29/35 Rugby World Cup 2019 Isileli Nakajima celebrates after Japan beat Ireland in one of the great World Cup upsets. AFP/Getty Images 30/35 Rugby World Cup 2019 The Japan team celebrate following the famous win over Ireland. AFP/Getty Images 31/35 Rugby World Cup 2019 The Tokyo Stadium was lit up by fireworks following Japan's win in the capital. Getty Images 32/35 Rugby World Cup 2019 Workers clear the stadium after the match in Tokyo. REUTERS 33/35 Rugby World Cup 2019 Japanese fans celebrate in the Tokyo fans park. AFP/Getty Images 34/35 Rugby World Cup 2019 All across the country, Japan fans were jubilant after the incredible win. AFP/Getty Images 35/35 Rugby World Cup 2019 Namibia fans show their support ahead of kick-off against South Africa. AFP/Getty Images\n\n“Since when have we been frightened against these teams [such as Tonga], who we respect, of course, but who aren’t on our level? Take control guys, because it is your history, your World Cup.\n\n“You are there for your career and for your country. You are there for French rugby and to try to go as far as possible, to see if you can win this World Cup – but we will only get there if you take control.\n\n“Japan is a magnificent country to visit. Out coaches who are there, I invite you to visit Japan, go and look around, treat yourself and leave the players to tell their own stories because for years I have not understood the game plan of this France team.\n\n“Honestly, I don’t understand. Something is going wrong, so it’s over to you guys [the players]. Tell the coaches to go on holiday. Write your story yourself.\n\n“There is a lot of experience, there are guys in this group who will certainly be major coaches in the future, so start to be a big coach today. Start today, kick the coaches out, take control, tell your own story, because we are ready to follow you.”\n\nBrunel looks set to stick with Racing 92 hooker Camille Chat ahead of Guirado for the Pool C decider against England.", "description": "The French rugby squad is on the cusp of an all-too-familiar civil war at the Rugby World Cup ahead of ‘Le Crunch’ against England, following a stunning outburst from Toulon owner Mourad Boudjellal and report captain Guilhem Guirado has been ousted from his role by the senior management.", "authors": ["Jack De Menezes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/07/14/france-chaos.jpg", "published_at": "2019-10-07"}