{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7602103/Frank-Lampard-admits-proud-recognition-Chelseas-academy.html", "downloaded_at": "2019-10-23 11:09:49.054950+00:00", "title": "Frank Lampard admits he is proud at the recognition of Chelsea's academy", "language": "en", "text": "Their paths have never crossed until tonight. But at different points over the last few years, Chelsea and Ajax have travelled parallel roads.\n\nIn the hunt for a return to Europe’s top table, both have turned to young and old. In Amsterdam, it was Johan Cruyff who laid the foundations for last season’s run to the Champions League semi-finals. Matthijs de Ligt, Frenkie De Jong and Co did the rest.\n\nNow Chelsea’s own young crop are trying to make similar memories under Frank Lampard.\n\nFrank Lampard insist Chelsea have a lot of work to do to rival Ajax's academy\n\nAfter hordes of academy players fell through the cracks, the likes of Fikayo Tomori, Tammy Abraham and Mason Mount have turned the tide. On Wednesday they take another step, without the likes of N'Golo Kante, Ross Barkley and Antonio Rudiger.\n\n‘We've got a long way to go to claim the similarities but I think (there is) pride in the short term,’ Lampard said last night. ‘It's long-deserved recognition for the academy itself and those players... but we are at a place here that is steeped in history of bringing young players through, creating great teams with groups of young players over the years. We have a long way to go to do that.’\n\nHe added: '(Ours) is a nice story until now but success in the longer term is what we have to work for... it is just the beginning of the road.’\n\nFikayo Tomori is among the Chelsea academy graduates to break through this season\n\nAjax boss Erik ten Hag believes the two clubs share a 'philosophy' on the pitch and behind the scenes Chelsea are beginning to mirror their Dutch counterparts, too.\n\nSince Lampard came in, Claude Makelele, Petr Cech and Ashley Cole have all joined the raft of club legends throughout the club's hierarchy. In Amsterdam, meanwhile, it's ex-Ajax pair Edwin van der Sar and Marc Overmars steering the ship.\n\n'I think it is a good model,' Lampard said. 'With ex-players, you would hope there is a feeling for the club, a feeling from the fans who like to see players who care about their careers at the club.\n\n'You can try and continue with an idea or an ethos, which is where teams like Ajax and Bayern Munich get it so right because it doesn’t change on short-term results. It tends to stay for the longer term.'\n\nAjax academy stars Frenkie de Jong and Matthijs de Ligt led the club to a semi-final last term\n\nThe Chelsea boss does not want to form an Old Boy's Club, though. 'Merit' was the word he used repeatedly.\n\nLampard isn't keen to copy anyone else’s model, either. He wants Chelsea to continue on their own path, starting tonight.\n\n'Games like these are probably where you learn a lot,' Tomori admitted. 'I don’t really think we can put a lid on ourselves.'\n\nDusan Tadic has been nominated for the Ballond'Or award and is leading Ajax's latest rebuild\n\nAjax are searching for a new way, too. De Jong and De Ligt have both gone and their manager says they must 'forget' last year's success.\n\nThreats remain, though, with Dusan Tadic and Donny van de Beek leading their latest rebuild.\n\nAjax are unbeaten all season and have won nine of their last 10 games.\n\nIt's form like that Lampard will want to copy. Starting on Wednesday club.", "description": "DANIEL MATTHEWS IN AMSTERDAM: Their paths have never crossed until tonight. But at different points over the last few years, Chelsea and Ajax have travelled parallel roads.", "authors": ["Daniel Matthews For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/21/20052376-0-image-a-8_1571774638176.jpg", "published_at": "2019-10-22"}