{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/apple-screen-time-feature-outsmarted-by-teens-2019-10", "downloaded_at": "2019-10-19 15:15:42.553444+00:00", "title": "Teens keep outsmarting Apple's features for limiting screen time, and parents are starting to get frustrated", "language": "en", "text": "Teens keep discovering ways to get around Apple's Screen Time parental control feature, the Washington Post reported.\n\nApple introduced the feature in iOS 12, but it hasn't yet fixed bugs that parents have pointed out in the last year.\n\nKids share tips for beating parental controls, organizations like Protect Young Eyes warn parents.\n\nVisit Business Insider's homepage for more stories.\n\nKids are outsmarting parents and Silicon Valley engineers when it comes to using their phones.\n\nChildren as young as 9 continue to find new ways to avoid parental controls on their devices, according to a report from Reed Albergotti at the Washington Post.\n\nScreen Time is an iOS tool that lets users block content, set time limits for certain apps, and set up scheduled \"Downtime\" when the phone can't be used — at least, that's what it should do. Almost as soon as it was released, kids starting finding ways around it. YouTube videos and Reddit posts have tips for removing parental controls in under five minutes.\n\nInternet safety groups like Protect Young Eyes try to combat these parental control hacks by warning parents of some of the most common workarounds and how to prevent them. In its list of \"12 Ingenious Screen Time Hacks,\" the groups found some clever workarounds. Some kids realized that changing the time zone in settings gets them out of mandatory Downtime. Other hacks include watching Youtube videos within iMessage, factory resets to undo control settings, and using Siri to send texts when iMessage is turned off. Or, to go about it another way, kids figure out their parents' passcodes using screen recording or accessing an old iTunes backup on a a Macbook or PC.\n\nRead more: Gen Z women are less likely than millennial women to want to be reachable at all times, and it might be a sign of 'tech fatigue'\n\nScreen Time allows users to set limits on certain apps. Apple\n\nNow, parents are growing frustrated at the lack of response or help from Apple after they discover that their children have figured out how to beat Screen Time, the Post reported. Posts on Apple forums show parents going months without receiving a satisfying answer.\n\nIn a Reddit post from last year, one user posted that his 7-year-old son figured out a way around the controls, and hundreds of commenters had similar problems. In the most upvoted comment on the post, another user wrote, \"I know my son is smarter than me. i just tell him when it's time for a break and have him hand over the iPad the old fashioned way.\"\n\nApple did not respond to Business Insider's request for comment on bugs or workarounds in Screen Time, but a spokesperson told the Post that the company builds users \"powerful tools to manage their iOS devices and are always working to make them even better.\"\n\nApple released its parental control feature, Screen Time, in 2018 as part of iOS 12. According to the Post, two major shareholders at Apple pushed the board to introduce parental controls to address screen addiction in children.", "description": "Teens have figured out ways around Apple's Screen Time parental controls, and they're now sharing their tips with each other.", "authors": ["Mary Meisenzahl"], "top_image": "https://image.businessinsider.com/5b69c7382be4ab1e008b4e69?width=1200&format=jpeg", "published_at": "2019-10-19"}