{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/trumps-potential-senate-impeachment-trial-what-we-know.html", "downloaded_at": "2019-10-19 11:09:58.693039+00:00", "title": "Trump’s Potential Senate Impeachment Trial: What We Know", "language": "en", "text": "McConnell has explained impeachment trial rules to his Caucus, but rules can always be changed. Photo: Win McManee/Getty Images\n\nThough the primary focus of attention in the impeachment saga is how the House proceeds toward formal articles of impeachment, the Senate’s role if Trump is in fact impeached is important and controversial as well. Just ask Bill Clinton — or the ghost of Andrew Johnson — since both of these impeached presidents were acquitted by the Senate. How a Senate trial will actually play out is a complicated question.\n\nWhat Does the Constitution Say About an Impeachment Trial?\n\nIt’s helpful to understand that for both chambers, the U.S. Constitution doesn’t spell out a whole lot beyond specifying that the House has the “sole power” to impeach executive and judicial branch officials for “Treason, Bribery, and other High Crimes and Misdemeanors” and that the Senate has the “sole power” to remove impeached officials by a two-thirds vote if they are found guilty of such charges. We know that the Founders also provided that for presidential impeachments the chief justice of the Supreme Court will be the Senate’s presiding officer, which was intended to avoid putting a vice-president, who might inherit the presidency if a removal did occur, in the chair. So the two things we absolutely know from the Constitution are that Chief Justice John Roberts will preside over a trial and that Trump can only be removed from office if two-thirds of the Senate votes to eject him. Beyond that, House and Senate rules, and ad hoc decisions made by the two chambers about matters not specified in the rules, decide pretty much everything other than the evidence itself.\n\nDoes the Senate Have to Hold a Trial If the House Impeaches Trump?\n\nConstitutional authorities differ on this question, which is germane because Trump himself keeps claiming that any House impeachment over the Ukraine scandal (and probably anything else) is “unconstitutional” or at least unwarranted. In theory, the man who runs the Senate, Majority Leader Mitch McConnell, could agree with that assessment and refuse to hold a trial. And because the courts are extremely reluctant to intervene in “political questions” involving executive–legislative collisions, he might get away with it.\n\nBut in fact, McConnell has repeatedly said he would indeed hold a trial — too many times to reverse himself, in all probability, as the Hill reports:\n\n“Under the impeachment rules of the Senate, we’ll take the matter up. The chief justice will be in the chair … We intend to do our constitutional responsibility,” he said.\n\nMcConnell had previously indicated that he would have “no choice” but to take up impeachment if the House passes articles, though he has also [run] a Facebook ad over the recent two-week recess positioning himself and the GOP-controlled Senate as a roadblock to Trump being removed from office.\n\nCould the Senate Have a Perfunctory or Truncated Trial?\n\nAgain, McConnell has been talking as though there will be a real trial, but means are available to cut it short, as Democrats tried to do during the impeachment trial of Bill Clinton. There was some discussion of this possibility at a closed meeting of Senate Republicans this week, where McConnell led a discussion of trial procedures, as BuzzFeed’s Paul McLeod reports:\n\nSeveral Republicans said they would not support using a procedural motion to dismiss to avoid an impeachment trial. But this does not rule out using one at some point to end the trial midway. A motion to dismiss can be brought forward by either the House or White House lawyers and would need a majority vote to end the trial. (Republicans could do this on their own.)\n\nSen. Thom Tillis said that if the trial is underway for two or three weeks and the only evidence put forward is the whistleblower complaint and the transcript of Trump’s Ukrainian call, there would “probably” be enough Republican support to pass a motion to dismiss.\n\nDuring the Clinton impeachment trial, senators unanimously voted to allow Democratic Sen. Robert Byrd to put forward a motion to dismiss two weeks into the trial. The motion failed.\n\nHad Democrats constituted a Senate majority then, as Republicans do now, that vote might have gone the other way. Another way to cut things short would be a motion to adjourn, which could pass on a party-line vote. Indeed, during the Senate trial of Andrew Johnson in 1868, the Senate did just that after the president was acquitted on three articles of impeachment; no votes were held on the remaining eight articles.\n\nWhat Governs the Conduct of the Senate Trial?\n\nRegardless of how it begins or ends, the trial itself is governed by standing Senate rules, last modified in 1986. They are largely based on precedents set in the Andrew Johnson trial. The basic idea is that articles of impeachment are presented to the Senate by House impeachment managers, and are then disputed by counsel for the president, with senators observing but not becoming directly involved (other than by written questions submitted to one or both of the parties). Witnesses are called and cross-examined according to protocols and timelines adopted by the Senate just before the trial begins on a majority vote. During the Clinton impeachment proceedings, they were (somewhat miraculously) adopted by unanimous consent, in part because the outcome of the trial was in zero doubt. Even though the outcome of a Trump trial may also be preordained (e.g., acquittal on a more or less party-line vote), any bipartisan procedural agreements are unlikely.\n\nAre Senators Under a Gag Order on Impeachment?\n\nOne aspect of the trial procedure as spelled out by the standing rules was alluded to by McConnell in his discussions with his Republican colleagues this week:\n\nMcConnell … warned that senators won’t be allowed to speak because they are jurors. McConnell said such silence “would be good therapy for a number of them.”\n\nMore accurately, senators are like jurors — and judges, too — in that they observe the back-and-forth between House managers and their lawyers and the president and his lawyers and don’t speak until they go into a closed session to deliberate. The standing rules also provide that when it comes time to vote, each senator stands by her or his desk and simply announces “guilty” or “not guilty.”\n\nIt’s also worth keeping in mind that Senate’s standing rules are subject to amendment, which would normally require a supermajority. But as Bob Bauer observed at Lawfare blog, there are ways around that problem for a devious operator like McConnell:\n\nSenate leadership can seek to have the rules “reinterpreted” at any time by the device of seeking a ruling of the chair on the question, and avoiding a formal revision of the rule that would require supermajority approval. The question presented in some form would be whether, under the relevant rules, the Senate is required to hold an impeachment “trial” fully consistent with current rules — or even any trial at all. A chair’s ruling in the affirmative would be subject to being overturned by a majority, not two-thirds, vote.\n\nIn any event, the “silence” expected of senators is not imposed until the articles of impeachment are passed by the House and presented to the Senate — i.e., until the trial begins. So when you hear senators say they won’t comment on impeachment charges or the possibility of “impeachable offenses” having been committed to avoid prejudging a “case” they may try as “jurors,” that’s a purely voluntary and informal assertion. From the perspective of the Constitution and the standing Senate rules, they can run their mouths all they want before and after the trial. But some may choose to hide behind the “prospective juror” fiction to keep their own counsel, as became clear when Lindsey Graham proposed sending a letter to Nancy Pelosi informing her that the Senate had no intention of removing Trump from office over the Ukraine scandal, as the Hill reported:\n\nSeveral, including Sens. Mitt Romney (R-Utah) and Susan Collins (R-Maine), have declined to weigh in on the impeachment proceedings and admonished their colleagues who have already made a decision.\n\nCollins, one of two GOP senators up for reelection in a state won by Hillary Clinton, told reporters in Maine that it was “entirely inappropriate” for senators to be taking a position.\n\nRomney declined to comment on Wednesday on Graham’s letter, but he said last week that he was going to keep “an open mind” on impeachment.\n\n“It’s a purposeful effort on my part to stay unbiased, and to see the evidence as it’s brought forward,” he said.\n\nOther Senate Republicans are reportedly raining on Graham’s parade, not because they believe they are required to remain silent but because they don’t want to display any Republican disunity or place vulnerable senators on record this early in the process.\n\nWhen Will the Trial, If There Is One, Begin and End?\n\nMcConnell has warned his troops they should be ready to begin a trial by Thanksgiving, though of course, he has zero control over the key factor: when the House passes articles of impeachment. The duration of the trial depends on all the factors mentioned above and others: the number of articles, the rules adopted by the Senate for calling and examining witnesses, and how contentious it all becomes (likely very contentious given the generally polarized atmosphere, Trump’s own personality, and the proximity of the 2020 elections). The precedents suggest it could go pretty quickly, as I recently observed:\n\nThe Johnson impeachment trial in 1868 lasted from March 5 until May 16, when the Senate’s first crucial “test vote” on a catch-all article of impeachment failed by one vote. Ten days later the Senate voted predictably to acquit on two other articles, and subsequently voted for general acquittal and adjournment.\n\nClinton’s impeachment trial was more hurried: It began on January 7, 1999, when presiding officer Chief Justice William Rehnquist was sworn in, and ended on February 12, with Clinton’s easy acquittal on both articles (45 senators, all Republicans, voted for his guilt on the perjury article, with ten Republicans defecting; and 50 senators vote for the obstruction article, with five Republicans defecting).\n\nSo one senator’s prediction of a Thanksgiving-to-Christmas trial of Trump doesn’t sound completely outlandish, particularly since McConnell is telling his caucus to expect only Sundays off.\n\nIn any event, it’s going to be a wild ride. But at this point, Senate Republicans as a whole plan to protect their president while at least minimally complying with traditional procedures.", "description": "The Senate will have a trial if Trump is impeached, but its procedures and duration depend on a mix of minimal constitutional provisions, standing Senate rules, and ad hoc arrangements largely controlled by Mitch McConnell and his majority.", "authors": ["Ed Kilgore"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/17/17-mitch-mcconnell.w1200.h630.jpg", "published_at": "2019-10-18"}