{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/11/rreport-shepard-smiths-exit-could-spark-fox-news-exodus", "downloaded_at": "2019-10-12 02:09:01.123130+00:00", "title": "Report: Shepard Smith’s Exit Could Spark Fox News ‘Exodus’", "language": "en", "text": "Longtime Fox News Channel Shepard Smith’s unexpected departure could be the start of an “exodus” at the news network, according to one staffer.\n\nSmith announced during Friday’s edition of his weekday program Shepard Smith Reporting that today would be his final broadcast at the network.\n\nSmith, known for his critical coverage of President Donald Trump, said in a statement:\n\nRecently I asked the company to allow me to leave FOX News and begin a new chapter. After requesting that I stay, they graciously obliged. The opportunities afforded this guy from small town Mississippi have been many. It’s been an honor and a privilege to report the news each day to our loyal audience in context and with perspective, without fear or favor. I’ve worked with the most talented, dedicated and focused professionals I know and I’m proud to have anchored their work each day — I will deeply miss them.\n\nAccording to CNN, staffers inside Fox News were “openly weeping” over the news of Smith’s departure and said some “were here and have stayed here solely” due to the anchor.\n\n“Don’t be surprised if there’s an exodus,” the staffer continued, before adding, “Fox hasn’t just lost Shep today.”\n\nSmith joined Fox News in 1996 and covered major news stories for the network for over two decades. In a statement, Fox News president and executive editor, Jay Wallace, said Smith will leave his post as chief news anchor and managing editor of the outlet’s breaking news unit.\n\nWallace said in a statement:\n\nShep is one of the premier newscasters of his generation and his extraordinary body of work is among the finest journalism in the industry. His integrity and outstanding reporting from the field helped put FOX News on the map and there is simply no better breaking news anchor who has the ability to transport a viewer to a place of conflict, tragedy, despair or elation through his masterful delivery. We are proud of the signature reporting and anchoring style he honed at FOX News, along with everything he accomplished here during his monumental 23-year tenure. While this day is especially difficult as his former producer, we respect his decision and are deeply grateful for his immense contributions to the entire network.\n\nSmith’s departure comes as President Trump’s relationship with Fox News continues to deteriorate. On Thursday, the president knocked Smith in a pair of tweets that were critical of a Fox News poll that found a record 51 percent of voters support his impeachment and removal from office.\n\nThe president tweeted:\n\nWhoever their Pollster is, they suck. But @FoxNews is also much different than it used to be in the good old days. With people like Andrew Napolitano, who wanted to be a Supreme Court Justice & I turned him down (he’s been terrible ever since), Shep Smith, @donnabrazile (who gave Crooked Hillary the debate questions & got fired from @CNN), & others, @FoxNews doesn’t deliver for US anymore. It is so different than it used to be.\n\nSpeaking to reporters ahead of his rally in Louisiana, President Trump questioned whether Smith’s exit from Fox News was prompted by his ratings.\n\n“I’m assuming he’s leaving because of bad ratings,” the president said.\n\n“I wish him well,” he added.", "description": "Fox News Channel Shepard Smith's unexpected departure could be the start of an \"exodus\" at the news network, according to a staffer.", "authors": ["Joshua Caplan"], "top_image": "https://media.breitbart.com/media/2019/10/Shep-Smith-Signoff-640x335.png", "published_at": "2019-10-11"}