{"pub": "mirror", "url": "https://mirror.co.uk/3am/katie-price-brands-driving-ban-20581701", "downloaded_at": "2019-10-15 08:02:14.793668+00:00", "title": "Katie Price brands her driving ban 'b******s' and says the courts have got it in for her", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nKatie Price has posted a video of herself furiously ranting about her latest driving ban.\n\nShe uploaded a video to her YouTube channel where she blasted the court as \"having it in for me\" and said the police just pull her over because she is famous.\n\nIn the video, the begins by discussing the spat between Rebekah Vardy and Coleen Rooney.\n\nShe then moves on to a shouty rant about the court sending her letters about her driving offences to the wrong address.\n\nThe 41-year-old was charged with withholding the name of the driver earlier this month following a collision which involved her Range Rover last November.\n\nShe pleaded guilty and did not attend the sentencing because she was abroad.\n\n\"Do you want the next bit of juicy gossip?\", Katie asks in the video.\n\n\"In fact, I'm so p****d off that I have to air it MY way, not the media way.\n\n\"I've been banned now four times from driving.\n\nWell it's actually not driving. Not me driving\", she adds as she picks up some letters from beside her.\n\n\"It's about paperwork\", she declares, waving the letter in her hand.\n\n\"In court yesterday my lawyer said to the court I would not be there because I would be out of the country.\n\n(Image: Instagram/Valet Magic)\n\n\"We proved that we'd be out of the country, but the judge wasn't even interested in adjourning it.\n\n\"Why? Because I believe they've got it in for me\", she announces.\n\nShe continues: \"I just want to clarify something. Where I live, there's five houses around me and they all have the same post code.\n\n\"But we all have different names on our house\", she explains.\n\n(Image: Katie Price/Youtube)\n\n\"My house could be called Pink Princess, but my neighbours could be called Purple Princess.\n\n\"So when people write to me I don't always get it on time.\n\nShe explained that letters addressed to her often get given to her neighbours and vice versa.\n\n\"It happens a lot\", she says.\n\n\"Parking tickets, court stuff, police stuff, anything.\"\n\nShe then ranted that \"the court don't wanna hear\" that her letters for her driving offences go to the wrong house.\n\nShe continued: \"I need to drive and I am going to appeal.\n\n\"I live in the middle of nowhere, I have a son with disabilities that might need to get rushed to hospital at certain times, my mum is terminally ill and I need to visit her.\n\n\"If they're banning me for two years, how do I know she's going to be here in two years' time?\n\n(Image: Instagram)\n\n\"I need to be able to get to my mum.\n\n\"It's obscene that the courts won't listen just because they've banned me before three times - which was also unfair because they don't want to listen.\"\n\nShe continued: \"There needs to be something done about sending me stuff to the wrong address. Which is why I didn't have all the information.\n\n\"Which is why I didn't wrote back who was driving at this time and that time. They need to hear my story.\"\n\n(Image: BBC)\n\nKatie also blasted her house being nicknamed \"mucky mansion\".\n\nShe said that she doesn't live in the house right now because it is being renovated, but \"something has gone wrong\", which she says she will explain another time.\n\nShe added that the builders in and out of her house all the time and her post gets moved because of it.\n\n\"It's obscene being banned for two years. Two years is a long time.\n\n\"I don't deserve it at all.\n\n\"It's a load of b******s.\"\n\n(Image: Instagram)\n\nShe went on to claim the police pull her over \"just to be nosey\" and then criticise her attitude.\n\nShe added that they know who she is because of her iconic pink Range Rover.\n\n\"They know it's me\", she claims.\n\nShe also revealed the police had even sent a bailiff to her house regarding the case after she did not respond.", "description": "The model and businesswoman ranted furiously about her latest driving ban and claimed the police pull her over because she is famous", "authors": ["Verity Sulway", "Image", "Instagram Valet Magic", "Katie Price Youtube", "Instagram", "Bbc"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20581715.ece/ALTERNATES/s1200/1_katie-price-5.jpg", "published_at": "2019-10-15"}