{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/5/california-gas-mileage-standards-set-trump-challen", "downloaded_at": "2019-09-06 12:17:16.618979+00:00", "title": "Official: Trump to revoke California's authority on mileage standards", "language": "en", "text": "WASHINGTON — The Trump administration is moving forward with a proposal to revoke part of California’s authority to set its own automobile gas mileage standards, a government official said Thursday, in another confrontation with a state that has repeatedly challenged environmental rollbacks.\n\nThe Environmental Protection Agency was preparing paperwork for the White House that would set a single national standard for fuel economy, according to the official, who is familiar with the regulatory process and spoke on condition of anonymity because the plan has not been made public.\n\nPresident Donald Trump has pushed for months to weaken Obama-era mileage standards nationwide and has targeted California’s decades-old power to set its own mileage standards as part of that effort.\n\nAdministration moves to rescind authority that Congress granted probably would end up in court. When President George W. Bush challenged California’s mileage-setting ability, California fought it. The Obama administration subsequently dropped the Bush effort.\n\nThe Trump plan would have to be posted in the Federal Register and would be subject to public comment.\n\nHis administration has tried to ease or remove scores of environmental regulations that it regards as unnecessary and burdensome. The tougher mileage standards were a key part of the Obama administration’s efforts to reduce climate-changing fossil fuel emissions.\n\nCalifornia has sued the Trump administration 27 times on environmental matters alone, often as part of a group of states. Counting preliminary injunctions, California has won in court 19 times, said Sarah Lovenheim, a spokeswoman for California Attorney General Xavier Becerra.\n\nEPA officials did not immediately respond to a request for comment Thursday.\n\nThe mileage move would target California’s half-century-old authority under the Clean Air Act to set its own, tough tailpipe emission standards. California’s long struggles with smog mean the state has been setting its own mileage standards since before the 1970 law was written. Congress allowed California to seek waivers from the national mileage standards for that reason.\n\nAbout a dozen states have opted to follow California’s mileage standards\n\nThe waiver has allowed California, the state with the most people and by far the biggest economy, to steer the rest of nation toward cutting down on car and truck emissions that pollute the air and alter the climate.\n\nThe auto industry as a whole doesn’t like the far tougher Obama-era mileage standards and fears it won’t be able to meet them, as U.S. consumers keep shifting away from sedans to less-efficient trucks and SUVs. Most automakers favor increasing mileage requirements at a lower rate than set under Obama. They also want one U.S. standard to avoid having to engineer separate vehicles for California and the states that follow its rules.\n\nIn July four automakers - Ford, Honda, BMW and Volkswagen - broke from the rest of the industry and struck a deal with California agreeing to 3.7 percent increases in mileage per year. That’s less than the 5 percent annual increase under the Obama-era standards.\n\nThe side deal has irked Trump, who has chastised Ford in tweets.\n\n___\n\nKrisher reported from Detroit.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Trump administration is moving forward with a proposal to revoke part of California's authority to set its own automobile gas mileage standards, a government official said Thursday, in another confrontation with a state that has repeatedly challenged environmental rollbacks.", "authors": ["The Washington Times Http", "Tom Krisher", "Ellen Knickmeyer"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/13/trump_energy_plan-lawsuit_09162_c0-418-3997-2748_s1770x1032.jpg?89858a099db606a3989f8c47a87bc1ad4af0cbc8", "published_at": "2019-09-05"}