{"pub": "realclearpolitics", "url": "https://msn.com/en-us/news/politics/biden-weathering-attacks-from-trump-returns-to-campaign-trail/ar-AAHX9Ps?li=BBnbfcL&ICID=ref_fark", "downloaded_at": "2019-09-28 12:41:05.016344+00:00", "published_at": "2019-09-28", "title": "Biden, Weathering Attacks From Trump, Returns to Campaign Trail", "language": "en", "text": "< PREVIOUS SLIDE SLIDE 1 of 3 NEXT SLIDE > Joseph R. Biden Jr. spoke on Friday in Las Vegas, his first public campaign event since House Democrats opened an impeachment inquiry into President Trump. © Bridget Bennett for The New York Times\n\nLAS VEGAS — Joseph R. Biden Jr., under daily attack from President Trump and facing renewed scrutiny of his family, used his first public event since Democrats began an impeachment inquiry to lash back at the president, saying he had “violated his oath of office” and asserting, in a newly emerging campaign message, that he was trying to “hijack this election.”\n\nMr. Biden said Mr. Trump “may have committed a crime” and had endangered the country’s national security.\n\nWearing his signature aviator sunglasses in the Las Vegas sun and heat, Mr. Biden, who has rarely emphasized impeachment, avoided the issue Friday afternoon. But he forcefully denounced the president’s recent attacks against him and his son Hunter, declaring them “flat, dead wrong,” while asserting that his family could “handle this.”\n\nSign Up For the Morning Briefing Newsletter\n\n“It’s not about me,” he said, speaking to a modest but supportive crowd at a community center. “We’ll overcome this. This is fine.”\n\nIn the week since the furor erupted over Mr. Trump’s entreaty to the president of Ukraine to investigate Mr. Biden and his son, the former vice president has toggled between searing criticism of Mr. Trump and a more traditional campaign message, as his team wrestles with how to maximize a moment that highlights both Mr. Trump’s unease about facing Mr. Biden and the delicate personal nature of the issue for the Democratic candidate.\n\nOn Friday, he also offered his views on health care and climate change, joked about how hot it was outside, posed for selfies with the crowd and even signed a baseball.\n\nMr. Biden’s denunciation of the president continued a week of stinging exchanges between the two, as the president has hammered away at Mr. Biden over his son Hunter’s past work for a Ukrainian energy company.\n\nOn Friday, Mr. Trump’s campaign released a new ad — part of a $10 million advertising push — accusing Democrats of trying to “steal” the election in retribution for having lost the last one. And he declared that Mr. Biden had promised Ukraine $1 billion in exchange for firing the prosecutor who was investigating his son, suggesting Democrats were hypocritical.\n\nIn response Mr. Biden’s deputy campaign manager, Kate Bedingfield, issued a strongly worded statement, saying Mr. Trump’s presidency was “melting down.”\n\n“Donald Trump is terrified of Joe Biden because the Vice President would beat him like a drum,” she said.\n\nNo evidence has emerged that Mr. Biden intentionally acted to aid his son in his work in Ukraine.\n\nA guide to the Democratic contenders who want to face Trump\n\nMr. Biden’s return to the campaign trail on Friday represented the start of a critical and unpredictable phase of his presidential bid: He is now not only running to lead the Democrats against Mr. Trump in 2020, but he is also grappling with a national spotlight on his family, and how to handle questions — and any potential political fallout — associated with his role in the Ukraine story line that House Democrats are now investigating.\n\nMr. Trump has been regularly attacking Mr. Biden and his son over their dealings with Ukraine, often using innuendo and falsehoods. The president has also delivered deeply personal insults about Hunter Biden, seemingly trying to bait the elder Mr. Biden into retaliating.\n\nHow Mr. Biden handles Mr. Trump’s constant broadsides — as well as questions from reporters and voters about Ukraine, impeachment and his son’s business history — will be a significant test for the candidate who has topped polls for much of the primary race but has seen his lead dip recently.\n\n“You have to be strategic and thoughtful about how you respond and when you respond and the nature of your response,” said the former Iowa governor Tom Vilsack, who attended a recent Biden fund-raiser but has not endorsed any candidate. “He has focused as much on the damage to the country, the concerns he has about misuse of power, as he has on the personal side of this.”\n\nBiden advisers, who argue that Mr. Trump’s focus on the former vice president underscores his fears about Mr. Biden, have mounted a ferocious offensive against reporters who have questioned Mr. Biden’s record on Ukraine or raised his son’s business dealings. It is a strategy they say will continue; whether Mr. Biden faces doubts from voters over those issues will become clearer in the coming weeks.\n\nPrivately, some of Mr. Biden’s advisers and allies said this week that they would like to see the former vice president speak out more forcefully against Mr. Trump, in a way that channels the outrage of the party’s base and the resolve of Democrats in Congress.\n\nFollowing Tuesday’s announcement of an impeachment inquiry, Mr. Biden’s instinct was to be more restrained than some supporters would prefer, and he is far less eager to discuss impeachment than some of his rivals have been.\n\n[Sign up for our politics newsletter and join the conversation around the 2020 presidential race.]\n\nSome political strategists said that Mr. Biden faced risks if he failed to push back hard against Mr. Trump, and that he could help himself if he used this moment to show he would be a formidable adversary in a general election against Mr. Trump.\n\n“Is Biden going to take the fight to him, or is it going to be something more nuanced in an age when nuance doesn’t work?” said Mary Anne Marsh, a Democratic strategist based in Boston.\n\nShe said Mr. Biden could not afford to dodge the situation, especially on the trail with voters. “He has to address it,” Ms. Marsh said. “It’s the elephant in the room.”\n\nEven as he tore into Mr. Trump on Friday, some in Mr. Biden’s camp say that he will also continue to promote his policy messages, as he did in Las Vegas. But with Mr. Trump and Republicans seemingly poised to continue attacks on Mr. Biden and his son, his ability to stay on that message will face another significant test.\n\nSlideshow by photo services\n\nMr. Biden is already under pressure from several directions: He faces intense competition for the nomination from Senator Elizabeth Warren, who has been rising in polls and overtook him in a key survey in Iowa recently. He will soon announce his fund-raising results for the third quarter of 2019, which will show whether or not he has momentum in the money race. As the end of the quarter approaches, Mr. Biden has spent much of his time at high-dollar fund-raisers — which are covered by the news media — a decision that has taken him away from public events at a momentous time for his candidacy.\n\nMr. Biden, 76, continues to face concerns about his age from some voters who are eager for a fresh approach to politics, and he is often the target of challenges from his more liberal Democratic rivals over issues like health care and immigration.\n\nMr. Biden has been relatively measured in the last several days, avoiding unusual jeremiads or off-key criticisms of the president.\n\nOn Tuesday he delivered a public statement casting Mr. Trump’s overtures to Ukraine as a national emergency that transcends the personal nature of his attacks. At private fund-raisers since, he has insisted that his family did not engage in wrongdoing, but has also sought to keep the focus on the broader challenges that he says Mr. Trump poses to the country.\n\nAt a fund-raiser in Pasadena, Calif., on Thursday, he mocked the president, joking about what a call between Mr. Trump and the Ukrainian president might have sounded like.\n\n“It’s never been about me,” he said, striking a more serious note at a fund-raiser in San Marino, Calif., also on Thursday. “It’s a tactic that’s used by this president to try to hijack an election so we do not focus on the issues that matter in our lives, in your lives.”\n\nBy Friday morning, Mr. Biden had reprised the hijacking metaphor in a Twitter post.\n\nThe message accompanied a video that highlighted the false or politically motivated nature of some of Mr. Trump’s claims about the Bidens. Meanwhile, his team has been aggressively raising money online off the Ukraine controversy in the final days of the fund-raising quarter.\n\nIn interviews at his event in Las Vegas, most voters said they approved of the more disciplined way Mr. Biden had responded to Mr. Trump’s attacks and wanted the vice president to remain focused on presenting his agenda for the country. Some said they were far more concerned about Mr. Biden’s age than they were about any negative implications from being connected to the impeachment inquiry.\n\nEmily Anderson Shaw, a 46-year-old from Pahrump, Nev., who came to the event with her husband, echoed the notion that Mr. Biden would be walking into the president’s trap if he decided to engage aggressively.\n\n“I think what Trump wants is for him to argue, because that’s what Trump does — he likes to argue,” she said. “Don’t fall into it.”\n\nPaul Glass, 67, of Las Vegas, said Mr. Biden was “playing it smart.”\n\n“He doesn’t need to get into the dumpster with Donald Trump about throwing lies and lies and lies out there,” he said. “Put your thoughts out there — what you believe, what you’re pushing for the American people — put it out there and let it run.”\n\nJonathan Martin contributed reporting.", "description": "Joe Biden lashed back at the president, saying he had “violated his oath of office.\"", "authors": [], "top_image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAHXhi1.img?h=373&w=624&m=6&q=60&o=t&l=f&x=1008&y=261"}