{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7593785/NHS-secretary-89-accepts-payout-age-discrimination-case.html", "downloaded_at": "2019-10-20 17:12:45.892239+00:00", "title": "NHS secretary, 89, accepts payout in age discrimination case", "language": "en", "text": "NHS secretary Eileen Jolly was sacked from her job at the Royal Berkshire Hospital aged 86 after managers blamed her failing to use a computer system\n\nAn 89-year-old woman who became the oldest person ever to sue her bosses for age discrimination, has accepted an out-of-court settlement offered by the NHS trust she successfully took to a tribunal.\n\nNHS secretary Eileen Jolly was sacked from her job at the Royal Berkshire Hospital after managers blamed her failing to use a computer system because of her 'old secretarial ways'.\n\nAt the age of 86 years, she was escorted out of the Reading hospital's premises following her wrongful dismissal as a result of being discriminated against because of her age.\n\nWidow Mrs Jolly was due to attend a remedy hearing at the employment tribunal offices in Reading last Monday but the hospital trust offered her a cash payment as an out-of-court settlement which prevented the case being opened up in public again. She accepted the sum.\n\nThe payment amount remained 'undisclosed' last night and Mrs Jolly was said by neighbours at her home in Tilehurst, Berkshire, to have 'gone away for a few days.'\n\nIn a statement yesterday, a spokesman for the Royal Berkshire NHS Foundation Trust said that the case had been 'upsetting and distressing for all concerned'.\n\n'The trust is disappointed by the outcome in this case. However, the trust has and operates an equal opportunities policy and, following a detailed review of the case, is taking steps ensure that lessons are learned and that all reasonable steps are taken to prevent any form of discrimination from occurring in the workplace.\n\nRoyal Berkshire NHS Foundation Trust have agreed an 'undisclosed' out-of-court settlement to prevent the case being opened up in public again\n\n'The trust will comply with the tribunal's order to pay an agreed sum to Mrs Jolly by way of compensation.\n\n'Given that these proceedings have been upsetting and distressing for all concerned, the trust is pleased that this matter is now concluded and parties can move on. It wishes Mrs Jolly all the best for the future.'\n\nMrs Jolly's semi-detached home in Tilehurst lay quiet today as neighbours said she had not been seen in a few days.\n\nGrandmother Mrs Jolly was dismissed in January 2017 over claims she did not properly use a computer system at the Royal Berkshire Hospital in Reading.\n\nThe NHS trust admitted she was unfairly dismissed as she was not given the chance to appeal but insisted the decision to sack her was not made on the basis of her age. However, Mrs Jolly told the tribunal that an internal report into her work compiled by a manager included 'unpleasant remarks' about her age and health.\n\nShe said at the time: 'I felt as though he had assumed that at my age and because of my health I was a liability and incapable of change, and had to go'\n\nShe said at the time: 'I felt as though he had assumed that at my age and because of my health I was a liability and incapable of change, and had to go.'\n\nThe widow, who has a heart condition and walks with the aid of a stick, was particularly hurt that one colleague was quoted as saying: 'It was always a concern that you could walk in and find Eileen dead on the floor.'\n\nMrs Jolly told the tribunal she had not taken a day off sick for 10 years, despite having had a cardiac arrest at work in 2004 when she had to be resuscitated by a surgeon. She said that it had been her intention to continue to work for as long as I could - until she was at least 90 years old.\n\nEmployment judge Andrew Gumbiti-Zimuto ruled that Mrs Jolly's grievances had not been addressed by the trust and that she had been discriminated against on the grounds of age.\n\nHe judged that in the lack of training offered she had been treated differently from other staff and noted a reference by one manager to her being stuck in 'old secretarial ways'.\n\nThe judge ruled that inappropriate and hurtful comments had been made about her age and health conditions and her dignity had been violated; in short her dismissal was 'tainted by discrimination'.\n\nEven without this, the judge said, the dismissal was unfair because procedures - particularly around the capability review and the failure to hear her appeal - had been incorrectly followed.\n\nIt was also clear, he said, that managers had a view of Mrs Jolly's role that she did not share. She understood that she was performing competently. He added there was a suspicion she was a scapegoat.\n\nMrs Jolly's barrister, Mark Green, said at the the time that her sacking showed hospital bosses were guilty of 'insidious stereotyping about elderly people'.", "description": "Former NHS secretary Eileen Jolly, 89, agreed to an out-of-court settlement with Royal Berkshire NHS Trust after they were found to have discriminated against Ms Jolly based on age.", "authors": ["William Cole For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/16/19959864-0-image-a-34_1571586898151.jpg", "published_at": "2019-10-20"}