{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7593893/Get-fit-15-minutes-best-exercise-prevent-skin-sagging-knees.html", "downloaded_at": "2019-10-20 23:29:47.958112+00:00", "title": "Get fit in 15 minutes: The best exercise to prevent your skin from sagging around your knees", "language": "en", "text": "WHAT TO DO\n\nAs we age we tend to notice the skin around our knees sagging more, says celebrity personal trainer Nadya Fairweather (u‑shape.co.uk). So try a seated wall squat to keep them strong.\n\nStand back to a wall, bottom touching, arms down, palms facing forward, chin off chest. Slowly sit your bottom down, moving your feet away from the wall as you go until your hips and knees are at a 90-degree angle. Hold this sitting stance for 30 seconds. Stand back up, shake out legs, do some shoulder rolls and begin again.\n\nTry for three sets of 30 seconds. If that’s too easy try for a longer hold until you feel the quadriceps (tops of your legs) working.\n\nPersonal trainer Nadya Fairweather suggests practicing seated wall squats to keep the skin around your knees strong\n\nWHAT TO EAT\n\nNutritionist Shona Wilkinson (shonawilkinson.com) says these foods will help prevent sagging skin.\n\nBone broth is a great source of collagen, which keeps skin plump. It’s best to make your own with bones from the butcher. But if this takes too much time, buy it ready-made.\n\nCitrus fruits are great for tightening skin, due to their vitamin C content. This is a vital nutrient required by our body to make its own collagen. Berries are also good; snack on them as much as possible or add them to a smoothie.\n\nGarlic is high in sulphur, which helps to synthesise and prevent collagen loss. It’s best raw, but add cooked garlic to meals, too.\n\nWHAT TO WEAR", "description": "Nadya Fairweather suggests seated wall squats to keep the skin around your knees from sagging. Nutritionist Shona Wilkinson recommends pairing the work out with a diet rich in vitamin C.", "authors": ["Daily Mail Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/20/19963492-0-image-a-4_1571598137605.jpg", "published_at": "2019-10-20"}