{"pub": "yahoo", "url": "https://news.yahoo.com/engineer-weighs-hard-rock-hotel-230112931.html", "downloaded_at": "2019-10-15 15:24:11.172663+00:00", "title": "Engineer weighs in on Hard Rock Hotel collapse: 'Logically, it doesn't make sense'", "language": "en", "text": "NEW ORLEANS – On Saturday morning, structural engineer Walter Zehner’s phone rang with news of a devastating construction collapse on a site he once worked.\n\nThe plan for 1031 Canal St. had completely changed since Zehner left the project approximately three years ago, moving from a mixed use retail/residential design to what was planned to be a Hard Rock Hotel.\n\nWhen Zehner arrived at the downtown construction site Saturday, he saw six to eight concrete levels had collapsed, the edges hanging down the side of the building as if they’d melted.\n\n“It was a lot worse than I could have imagined,” Zehner said. “And I’ve seen the videos of the collapse and it’s kind of hard to figure out exactly what was going on there.\"\n\nIn his career, Zehner has designed complex structures such as the Astor Crowne Plaza in the French Quarter, which he said is “very similar” to the planned Hard Rock Hotel.\n\nBut he’s also spent time as a trial witness tasked with explaining exactly how a build go wrong.\n\n“It’s almost like problem solving, like being a detective,” Zehner said. “I’m sure eventually I’m going to be called by somebody’s attorney to help them on this one.”\n\nHard Rock Hotel collapse: Witness describes 'mind boggling' construction collapse in New Orleans\n\n'Very dangerous situation': Two dead, one still missing after Hard Rock hotel collapse\n\nAs local and federal authorities attempt to determine what could have caused the building to crumble, which resulted in two deaths, Zehner said an investigation would begin with examining the original plans to see if it was designed properly. If the design is sound, the investigation will move to examining the construction process.\n\n\"The one thing I find hard to understand is the collapse started at the rear of the building (by Rampart and Iberville streets) but it wound up, you had collapsed slabs all the way on the front end of the build, which is 300 feet away (on Canal Street),\" he said. \"So I don’t know how that progression worked like that. I guess that’s part of what the investigation is going to reveal.”\n\nThis aerial photo shows the Hard Rock Hotel in New Orleans, which was under construction, after a fatal partial collapse on Saturday, Oct. 12, 2019. More\n\nWhile he believes it’s too early to have an answer as to what caused the collapse, the spread of damage around the edge of the property “certainly raises questions” for Zehner.\n\n“Logically, it doesn’t make sense it would happen that way. There’s got to be a reason for that to happen, and that's going to be part of the investigation,” he said.\n\nZehner heard the rumors of too heavy a load being placed atop the building or of a vehicle nudging a column. The city also experienced a drop in temperature between Friday and Saturday, but Zehner said the 11-degree swing was likely not drastic enough to affect building materials.\n\n“Ideas have been tossed out that some kind of activity in the building might have caused it. Probably makes more sense than anything, and I think it’s a matter of finding out what was going on at that time. There were people working. What were they doing that could have contributed to this?” he said. “But I think it’s kind of early on before anyone can start speculating what the actual cause was.”\n\nThe $85 million project’s design is now helmed by architecture firm Harry Baker Smith and constructed by Citadel Builders. Kailas Companies acquired the property for $3.6 million in 2007, though it wasn’t until 2018 that the project was announced as a Hard Rock Hotel.\n\nThere have been questions in the aftermath of the collapse as to whether the site was properly inspected and up to date on all permits.\n\nNew Orleans Director of Homeland Security Colin Arnold said that is being investigated.\n\nThere is no evidence that an ongoing federal corruption investigation focusing on the Department of Safety and Permits is connected to the Hard Rock Hotel project. But the agency has dealt with the challenges such cases present.", "description": "Structural engineer Walter Zehner worked on the project before it became a planned Hard Rock Hotel. A look at what he thinks could have happened:", "authors": ["Andrew J. Yawn", "Lafayette Daily Advertiser"], "top_image": "https://s.yimg.com/uu/api/res/1.2/NUlcyr3pQe.u1A01cZxHJw--~B/aD0xNDk5O3c9MjI0ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_travel_320/2e0fa482aa385f9f380ef3bf558f209e", "published_at": "2019-10-14"}