{"pub": "metro", "url": "https://metro.co.uk/2019/10/13/tory-rebels-deny-plot-force-new-brexit-delay-10909678", "downloaded_at": "2019-10-13 18:45:55.863702+00:00", "title": "Tory rebels deny ‘plot’ to force new Brexit delay", "language": "en", "text": "Reports had accused Mr Hammond of plotting to sink Mr Johnson’s Brexit efforts (Picture: LNP; PA)\n\nPhilip Hammond has said reports of a conspirator ‘plot’ to take down Brexit were wide of the mark.\n\nThe former Chancellor tweeted his position following a story that said MPs could ‘force’ a delay to the 31 October deadline – even if the Prime Minister won Commons backing for a deal with the EU next weekend.\n\nThe Mail on Sunday reported that MPs Philip Hammond and Dominic Grieve, both former cabinet ministers, were central figures in a move to force Boris Johnson to write to Brussels asking for an Article 50 extension no matter what he returned with during the final week of negotiations.\n\nThe move was said to have ’caused fury’ within Downing Street as it could put Mr Johnson’s post-Brexit election plan into doubt and scupper any possibility of leaving the EU by Halloween.\n\nAdvertisement\n\nAdvertisement\n\nBut Mr Hammond said it was parliament’s responsibility to read through and legislate on the details of any deal in full, and not just vote on snippets or headlines.\n\nThe Mail on Sunday is wrong – there is no plot.\n\nIf Parliament approves a deal that has been agreed with the EU, the Benn Act does not apply. But parliament will need to see the full detail of a deal, not just a headline, before it will approve anything. — Philip Hammond (@PhilipHammondUK) October 12, 2019\n\nThe Runnymede and Weybridge MP tweeted: ‘There is no plot.\n\n‘If Parliament approves a deal that has been agreed with the EU, the Benn Act does not apply.\n\n‘But Parliament will need to see the full detail of a deal, not just a headline, before it will approve anything.’\n\nMr Hammond, who has generally voted for the UK to leave the EU, continued: ‘We have voted for a deal three times in the Commons – and will do so again if it’s a deal that benefits the whole of the UK.’\n\nHe was also quick to publicly call out Richmond Park MP Zac Goldsmith who had branded him and others a ‘disgrace’ who ‘never had any intention of honouring the referendum, despite their solemn promises to their constituents.’\n\nZac – I voted for a Brexit deal three times in the Commons. You did not.\n\nWhat’s really ‘a disgrace’ is colleagues who claimed to want to honour the referendum, but voted down a deal that would have seen us leave on 29th March. https://t.co/aIlKtwAA5o — Philip Hammond (@PhilipHammondUK) October 12, 2019\n\nAdvertisement\n\nAdvertisement\n\nMr Hammond replied: ‘Zac – I voted for a Brexit deal three times in the Commons. You did not.\n\n‘What’s really ‘a disgrace’ is colleagues who claimed to want to honour the referendum, but voted down a deal that would have seen us leave on 29th March.’\n\nNumber 10 hope a last-minute breakthrough over customs arrangements between Northern Ireland and the Republic could be approved during Thursday’s two-day EU summit.\n\nThis would allow MPs to vote on it during Saturday’s extraordinary Commons sitting – the first time a Saturday session has been called since the Falklands War.\n\nYesterday though, the DUP’s Westminster leader Nigel Dodd reiterated demands that Northern Ireland must leave the EU Customs Union with Great Britain.\n\nThe Jacob Rees-Mogg led ERG faction of hard Tory brexiteers has also said it was still in the dark over the details of Mr Johnson’s plan.\n\nThe group voted with Brexit opponents to thwart Theresa May’s withdrawal bill – which included a controversial Irish border customs backstop – three times.\n\nMr Rees-Mogg said in a Sunday Times article: ‘In the final stages of the Brexit negotiation, compromise will inevitably be needed, something even the staunchest Leavers recognise albeit unwillingly – but as a Leaver Boris can be trusted.’\n\nThere are six days remaining until the 19 October deadline imposed by the Benn-Act, which requires the Government to either secure parliamentary backing for a deal or ask the EU for an extension to the Brexit process.\n\nFrantic week ahead will decide the UK's future over Brexit", "description": "Tory rebels deny plot to take down Brexit as Philip Hammond dismissed suggestions saying Parliament must vote on any proposed deal", "authors": ["Chris Caulfield"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/07/PRC_76764187_1570978372.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-13"}