{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/eastenders-spoilers-karen-mitch-defend-keanu-affair-sharon-exposed-10897854", "downloaded_at": "2019-10-10 18:43:41.957437+00:00", "title": "EastEnders spoilers: Karen and Mitch defend Keanu over Sharon affair", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nKeanu Taylor (played by Danny Walters) and Sharon Mitchell’s (Letitia Dean) affair secret has already been discovered by Mel Owen (Tamzin Outhwaite) and she could expose the truth at any moment. And when their relationship bombshell does inevitably come out, Karen Taylor (Lorraine Stanley) and Mitch (Roger Griffiths) will be fighting their son’s corner.\n\nExclusively discussing what’s around the corner with Metro.co.uk, actors Lorraine and Roger have teased that the Taylors will be going head-to-head with the Mitchells.\n\nAdvertisement\n\nAdvertisement\n\nRoger told us: ‘It’s about family support, that’s what it’s about and balance. And remember, Keanu is my son as well. I brought him up and it’s that thing of the care of duty.\n\nLorraine continued: ‘Karen would protect her son to the bitter end.’\n\nDon’t mess with the Taylors (Picture: Backgrid)\n\n‘And the father has to support,’ Roger added.\n\n‘She ain’t gonna let no one take the mick out of him,’ Karen continued. ‘Even if he’s done wrong, she’ll be there.’\n\nLooks like the Taylors won’t be backing down in a showdown with the Mitchells, so we better get our popcorn prepped!\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: EastEnders spoilers: Jean Slater receives tragic death news tonight\n\nMORE: EastEnders spoilers: Eating disorder storyline for Honey Mitchell?\n\nAdvertisement Advertisement", "description": "EastEnders spoilers: Karen and Mitch defend Keanu as affair with Sharon is exposed.", "authors": ["Cydney Yeates"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/eastenders1_1570727494.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-10"}