{"pub": "investingcom", "url": "https://ph.investing.com/news/world-news/duterte-spokesman-critical-of-us-senators-comments-on-senator-detention-59338", "downloaded_at": "2019-09-30 00:54:21.091588+00:00", "title": "Duterte spokesman critical of U.S. senator's comments on senator detention", "language": "en", "text": "Duterte spokesman critical of U.S. senator's comments on senator detention\n\nGlobal 8 hours ago (Sep 30, 2019 00:50)\n\nDuterte spokesman critical of U.S. senator's comments on senator detention MANILA, Sept 29 (Reuters) - Philippine President Rodrigo\n\nDuterte's spokesman on Sunday criticised a U.S. lawmaker for\n\nmaking a \"baseless\" accusation of abuse in the case of a\n\ndetained critic of the Filipino leader.\n\nPresidential Spokesman Salvador Panelo was reacting to a\n\nstatement by U.S. Senator Patrick Leahy, who said the detention\n\nof Philippine Senator Leila De Lima was a \"wrongful\n\nimprisonment\".\n\nLeahy made the remarks in a statement he sent to local\n\nnetwork ABS-CBN News on Friday, in which he criticised Panelo\n\nfor saying Washington was interfering in Philippine affairs over\n\na proposed travel ban against officials behind De Lima's\n\nimprisonment.\n\nDe Lima, among the biggest critics of Duterte's deadly\n\nanti-drugs crackdown, has been detained since 2017 on narcotics\n\ncharges.\n\nA U.S. Senate bill has been filed seeking to bar entry of\n\nPhilippine officials found to be involved in De Lima's\n\nimprisonment.\n\n\"Every year, the United States provides large amounts of aid\n\nto the Philippines, and I have supported that aid,\" Leahy was\n\nquoted by ABS-CBN News as saying.\n\n\"I assume President Rodrigo Duterte's spokesman who\n\ndefended the wrongful imprisonment of Senator De Lima does not\n\nconsider our aid to be 'interfering' in their sovereignty,\"\n\nLeahy said.\n\nPanelo said Leahy's statement assumed the American lawmaker\n\nhas sufficient knowledge of Philippine laws and had personally\n\nexamined De Lima's case.\n\nPanelo also said in a statement Leahy had never visited the\n\nPhilippines to personally examine De Lima's case.\n\n\n\n\n\n\n\nDuterte spokesman critical of U.S. senator's comments on senator detention", "description": "Duterte spokesman critical of U.S. senator's comments on senator detention", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/World_News_9_800x533_L_1420026261.jpg", "published_at": "2019-09-29"}