{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/global-opinions/canadas-election-results-are-a-victory-for-the-planet/2019/10/22/d4dbf440-f4fd-11e9-a285-882a8e386a96_story.html", "downloaded_at": "2019-10-23 15:57:49.662562+00:00", "title": "Canada’s election results are a victory for the planet", "language": "en", "text": "Prime Minister Justin Trudeau pulled through in Monday’s federal election, as his Liberal Party won a plurality of 157 seats in the country’s 338-seat House of Commons. Though he will now have to govern with other, smaller parties, this was an unexpectedly strong result. During his campaign, he admitted that he had worn blackface and brownface on several occasions, and Canada’s former attorney general accused him of unduly pressuring her to end a prosecution.\n\nAD\n\nAD\n\nIn this challenging political environment, the prime minister made big promises on climate change. He had already imposed a carbon tax system on Canada’s provinces and, after Monday’s results, there is little doubt it will fully phase in early next year. He pledged to plant 2 billion trees and to adopt substantially more ambitious greenhouse emissions goals — to net-zero emissions by 2050, the direction scientists say the world must go.\n\nThese initiatives won the prime minister few votes in oil-producing provinces such as Alberta. But, when one adds the votes for Mr. Trudeau’s Liberal Party and smaller parties such as the Greens and the New Democratic Party, a clear majority backed assertive climate action. Parties favoring policies at least as tough as Mr. Trudeau’s won 216 seats and 63 percent of the popular vote. Though the Liberals lost their outright majority, this was in part due to the resurgence of the Bloc Quebecois, which also promised to resist a carbon tax rollback.\n\n“You have asked us to show even more vision and ambition as we tackle the greatest challenge of this era, climate change,” Mr. Trudeau said Monday night, according to a translation in Canada’s National Post of his French-language remarks. “That is exactly what we will do.”\n\nAD\n\nAD\n\nTo be sure, the election was not a referendum on a single policy. But the prime minister’s Conservative opponents relied on the conventional wisdom that carbon taxes are political poison, and they lost. As other states and countries impose carbon prices of various kinds, that conventional wisdom increasingly looks due for revision.\n\nRead more:\n\nAD", "description": "The prime minister won while making big promises on climate change.", "authors": ["Editorial Board"], "top_image": "https://www.washingtonpost.com/resizer/1QZN-tfPYRb1mdRCQmiAk8haKoo=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FOPBTYHVCAI6TDHQJTEZ65GRE4.jpg", "published_at": "2019-10-22"}