{"pub": "yahoo", "url": "https://sports.yahoo.com/steph-curry-fires-back-kevin-182111292.html", "downloaded_at": "2019-09-19 09:32:02.475355+00:00", "title": "Steph Curry fires back after Kevin Durant criticizes Warriors offense", "language": "en", "text": "Kevin Durant has sent some mixed messages about what he wants in his basketball situation.\n\nHe was the man in Oklahoma City, co-starring with Russell Westbrook in an offense heavily predicated on isolation basketball. In search of playing a more beautiful game, Durant left OKC in 2016 to join the Warriors and Steve Kerr's ball-movement offense.\n\nAfter three years and unparalleled success, Durant exited the Bay to head to Brooklyn, signing with the Nets in free agency in July. The two-time NBA Finals MVP discussed his exit from the Warriors in an interview with the Wall Street Journal, and he had some critiques of Kerr's motion offense. Durant believes the system is limited, and there would come a time in the playoffs where he needed to \"go into his bag\" to get his own shot because the opposition had figured out how to slow down Kerr's offense.\n\nScroll to continue with content Ad\n\nCurry, who has been almost unstoppable in the Warriors' system, had something to say about Durant's criticism.\n\n\"Well, I don't care what plays we ran,\" Curry told ESPN's Rachel Nichols on \"The Jump.\" \"We won two championships. And at the end of the day, we had a lotta talent and there was an expectation of us figuring out how to balance all that. And we talked a lot about it throughout the three-year run. It wasn't always perfect, but I think in terms of, you know, the results and what we were able to do on the floor, that kinda speaks for itself.\n\n\"We all wanna play iso-ball at the end of the day in some way, shape or form. But I'd rather have some championships, too.\"\n\n[RELATED: Steph responds to KD's belief Warriors never accepted him]\n\nStory continues\n\nIt's hard to argue with either point of view. Durant is one of the most talented scorers in NBA history, and was a seamless fit in Kerr's offense. But his isolation game almost is unguardable, so it's understandable why he would want the ball in his hands more. Really, who wouldn't want Durant to have the ball?\n\nBut as Curry said, the Warriors' results over the past five seasons speak to the success and potency of their ball-movement offense, one of the reasons the Warriors almost were able to win the 2019 NBA Finals even after Durant ruptured his Achilles.\n\nJust turn on the tape, and you can see how effective the offense is, both with and without Durant.\n\nSteph Curry fires back after Kevin Durant criticizes Warriors offense originally appeared on NBC Sports Bay Area", "description": "Do you want to have the ball or do you want rings?", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/mHNL5iE5JINgQg36VRcyFQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/nU3CfDoyKkocr0Hp9Tfh9Q--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnbayarea.com/3ad11bd6510689378afdd2786094dbb1", "published_at": "2019-09-18"}