{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/police-release-pictures-men-wanted-20756481", "downloaded_at": "2019-10-30 12:32:46.255172+00:00", "title": "Police release pictures of men wanted in connection with Haringey Borough racial abuse", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nPolice have released images of three men they want to speak to in connection with the incidents which saw Yeovil's FA Cup clash with Haringey Borough abandoned earlier this month.\n\nHaringey players were reportedly subjected to racial abuse from visiting supporters, with goalkeeper Valery Douglas Pajetat claiming he was also spat at and hit by an object thrown by supporters.\n\nDefender Coby Rowe also alleged he was labelled a \"black c***\" as players of both sides walked off the field in protest causing the game to be called off.\n\nThe Met Police have now released pictures of the three men they are looking to speak to as they continue to investigate the ugly October 19 incidents.\n\n(Image: PA)\n\n(Image: PA)\n\nTwo days after the game, two men, aged 23 and 26, were arrested in Chard and Yeovil on suspicion of racially aggravated common assault.\n\nThey were released on bail to a date in mid-November, and police are now looking to speak to three more men in connection with the events.\n\n(Image: PA)\n\nA Met Police spokesperson said: \"Police are appealing for the public’s help to identify three men they would like to speak to as part of an investigation into reports of racist comments made during a football match between Haringey Borough FC and Yeovil Town on Saturday, 19 October.\n\n\"Officers from the Met are leading the investigation with the assistance of Avon and Somerset police.\n\n(Image: Twitter)\n\n\"Anyone who was at the football match or who is able to identify the men pictured is asked to call police on 101 quoting CAD 5272/19 Oct.\"\n\nThe match was replayed last night (Tuesday) with Yeovil running out 3-0 winners to book their place in the first round proper.", "description": "Police want to speak to three men after the incidents which caused Yeovil's FA Cup clash at Haringey Borough to be abandoned", "authors": ["Rich Jones", "Image", "Pa", "Twitter"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20655452.ece/ALTERNATES/s1200/0_Haringey-Borough.jpg", "published_at": "2019-10-30"}