{"pub": "businessinsider", "url": "https://businesstimes.com.sg/companies-markets/singapore-airlines-malaysia-airlines-to-share-flight-revenue-expand-routes-in-new ", "downloaded_at": "2019-10-30 09:24:44.485400+00:00", "title": "Singapore Airlines, Malaysia Airlines to share flight revenue, expand routes in new tie-up", "language": "en", "text": "THE national flag carriers of Singapore and Malaysia have proposed a new wide-ranging partnership, subject to regulatory approvals from the competition authorities.\n\nSingapore Airlines (SIA) and Malaysia Airlines Berhad (MAB) are looking to share revenue on flights between the two countries, expand their codeshare routes, and participate in joint marketing activities to develop tourism, under an agreement inked on Wednesday.\n\nThe agreement also includes SIA’s subsidiaries SilkAir and Scoot, as well as MAB’s sister airline, Firefly.\n\nIt comes after the signing of a memorandum of understanding in June this year, which aimed to provide new customer benefits and business opportunities.\n\nsentifi.com Market voices on:\n\nAs part of the proposed partnership, flights between Singapore and Malaysia will operate under a joint business arrangement. SIA and MAB intend to coordinate their flight schedules to give passengers more flight choices and frequencies.\n\nStay updated with\n\nBT newsletters Terms & conditions Sign up\n\nThe two airline groups also plan to offer joint-fare products, align their corporate programmes to “enhance the value proposition” to customers, and explore tie-ups between their frequent-flyer programmes, they said in a joint media statement.\n\nBoth groups will expand their regional and long-haul codeshare arrangements to include more destinations on each other’s networks.\n\nCurrently, the airlines codeshare on flights between Singapore and Kuala Lumpur, Kota Kinabalu, Kuching and Penang. With the proposed expansion, SIA and SilkAir will codeshare on MAB’s domestic flights and thus serve a total of 16 destinations in Malaysia.\n\nIn turn, MAB will progressively codeshare on flights between Singapore and Malaysia, Europe, South Africa and other destinations, once the necessary approvals are granted. This will be implemented in phases.\n\nCodeshares are commercial arrangements whereby one airline sells seats on a flight operated by another airline, with each carrier using their own flight number.\n\nSubject to regulatory approvals, the codeshare flights will be progressively made available for sale through the airlines’ respective booking channels in key markets around the world.\n\nIn addition, both flag carriers will work on joint marketing activities to boost long-haul tourism to Malaysia and Singapore.\n\nSIA and MAB will also explore the potential development of airpasses, which allow multi-stop itineraries. The possible airpasses will give customers who travel to Malaysia through Kuala Lumpur and Singapore more choices to visit other parts of the country such as Kuantan, Kuching and Kota Kinabalu using a single ticket.\n\nShares of SIA were trading at S$9.24 as at 4.40pm on Wednesday, up four cents or 0.44 per cent.", "description": ": THE BUSINESS TIMES Companies & Markets - THE national flag carriers of Singapore and Malaysia have proposed a new wide-ranging partnership, subject to regulatory approvals from the competition authorities. . Read more at The Business Times.", "authors": ["Fiona Lam"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-30"}