{"pub": "yahoo", "url": "https://sports.yahoo.com/2019-russian-grand-prix-live-123837814.html", "downloaded_at": "2019-09-27 15:02:26.599555+00:00", "title": "2019 Russian Grand Prix live stream: How to watch the race online and on TV", "language": "en", "text": "Lewis Hamilton is seeking back-to-back Russian Grand Prix wins in Sochi: Getty\n\nIt was another fine day for Ferrari in Singapore, with Sebastian Vettel taking victory from team mate Charles Leclerc.\n\nThe two drivers have not yet made a sizeable dent in Lewis Hamilton’s rather large lead at the top of the Drivers’ Championship for the 2019 season, but will be looking to narrow the gap in Russia.\n\nScroll to continue with content Ad\n\nHowever, this is a favourite track for Mercedes – five wins in the five years since the Sochi circuit was introduced to the calendar suggests they find the going good.\n\nHamilton has three of those victories, including last year, being let through by Valtteri Bottas after the Finn had taken pole.\n\nHere is everything you need to know about the 2019 Russian Grand Prix.\n\nWhere can I watch it?\n\nSky Sports F1 will show live coverage of the race. Their programming begins at 10.30m.\n\nHighlights of the race will air on Channel 4. They start at 6.30pm on Sunday evening.\n\nCan I stream the race?\n\nSky Sports subscribers can watch the race via the Sky Go app or via a web browser.\n\nRead more\n\nHamilton: Mercedes will be underdogs for rest of Formula One season\n\nYou can watch the Russian Grand Prix through Now TV via Sky Sports Day Pass for £9.99.\n\nWhere is it?\n\nThe Russian Grand Prix takes places at the Sochi Autodrom, with the circuit surrounding the site of the 2014 Winter Olympics.\n\nWhat time is it?\n\nThe race is due to start at 12.10 BST.\n\nWhat time does qualifying begin?\n\nQualifying follows the third practice session on Saturday, and should begin at 1pm BST.\n\nWhat is our prediction?\n\nMercedes have not lost in Russia since the race was added back on to the Formula 1 calendar in 2014, and Lewis Hamilton will continue that streak this weekend.\n\nRead more\n\nRead more Hamilton: Mercedes will be underdogs for rest of Formula One season", "description": "It was another fine day for Ferrari in Singapore, with Sebastian Vettel taking victory from team mate Charles Leclerc.The two drivers have not yet made a sizeable dent in Lewis Hamilton’s rather large lead at the top of the Drivers’ Championship for the 2019 season, but will be looking to narrow the", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/XXLIfy_GkHSZCtOfUEABgA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03ODY-/https://s.yimg.com/uu/api/res/1.2/tlXdLWcw7sD4MfEL_sBrDQ--~B/aD0zOTM7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/d8feb7808c7e7b8b05433c23e04b3b0a", "published_at": "2019-09-27"}