{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/2019/09/20/white-house-grants-tariff-exemptions-more-than-chinese-products", "downloaded_at": "2019-09-20 22:55:06.462886+00:00", "title": "Chinese officials cancel U.S. farm visits as Trump says he feels no pressure to cut trade deal before 2020 elections", "language": "en", "text": "The outlook for a near-term trade deal between the White House and China darkened on Friday, as President Trump called China a “threat to the world” and dismissed the idea of an interim agreement the same day Chinese officials canceled a planned visits with farmers in Montana and Nebraska.\n\nThe combined news spooked investors, and the Dow Jones Industrial Average lost 160 points, or around 0.6 percent.\n\nNegotiations are set to continue, but the twin events on Friday suggested there is not an urgency on either side to complete an agreement.\n\nAt a press conference, Trump told reporters he was not under any pressure to complete a trade deal with China before the 2020 election, even though he has insisted in recent weeks that China wants to cut a deal with him to revive its economy. He also said he would hold out for a large, comprehensive agreement that has eluded the White House for more than a year. His comments appeared to defy the growing political and economic pressure for him to resolve the trade war soon.\n\n“We’re looking for a complete deal,” Trump said. “I’m not looking for a partial deal. We’re looking for the big deal. We’ve taken it to this level.”\n\nTrump often characterizes Chinese officials and their eagerness to reach a deal in a way that isn’t consistent with the way Chinese officials talk about the talks. They have not expressed any urgency to resolve differences with the White House.\n\nHis comments were the latest in a series of sometimes contradictory signals about his approach with Beijing. In August, relations between the U.S. and China appeared to worsen markedly, but the mood had shifted in recent weeks and it appeared both sides were trying to reset talks. It’s unclear, though, how well the talks are going. Chinese officials had planned to visit farmers in Montana next week, but that visit was canceled on Friday without any explanation.\n\nScott Kulbeck, director of membership services for the Montana Farm Bureau Federation, said he just received the news this morning and was not given information as to whether the delegation would reschedule.\n\n“We didn’t even get to the point where we were told what they wanted to discuss,” Kulbeck said.\n\nSimilarly, the Nebraska Department of Agriculture learned Friday morning that meetings with a Chinese delegation had been canceled, said Christin Kamm, the department’s public information officer. Kamm said she did not have any information as to why the Chinese canceled its visit to the state or whether the meeting would be rescheduled.\n\nThe U.S. and China are two of the world’s largest economies, and Trump has alleged that China rips off U.S. consumers and businesses through unfair trade practices. He has insisted that they purchase more U.S. farm products, stop subsidizing businesses that compete with U.S. firms, and halt the theft of intellectual property from American companies, among other things.\n\nAt the crux of Trump’s trade war with China are the escalating tariffs he has imposed on Chinese imports. The White House has already imposed tariffs on more than $250 billion in Chinese goods, and higher tariffs will go into effect next month and then even more in December. These tariffs are driving up the cost of a range of products, but Trump has said they are necessary to disrupt Chinese supply chains and rebalance the economic relationship between the two countries.\n\nThe trade war has had a direct impact on the U.S. economy, leading businesses to pull back on investing while they wait to see how Trump plans to proceed. Trump has in the past said China wanted to wait until after 2020 to see if he was reelected before agreeing to a deal. Sometimes he has said he would be fine with waiting, but other times he has expressed frustration that talks keep bogging down.\n\nIn recent days he has said he would consider an interim agreement, but on Friday he said such an approach was off the table. He has also said in the past that China was trying to delay an agreement until after the 2020 election, but on Friday he claimed that he was under no political pressure to speed things up.\n\n“We have right now a little spat, but I think we’re doing very well,” Trump said.\n\nTrump administration officials are meeting with Chinese officials this week and next, and they are supposed to hold higher-level talks in October. Trump has complained that he nearly had a trade deal with China several months ago, but Chinese officials have disputed this, saying key issues have not been resolved.\n\nHe is under considerable political pressure to adjust to growing complaints from farmers and business groups about the costs of the trade war. His comments on Friday came just hours after the White House said it would temporarily spare more than 400 Chinese products from tariffs.\n\nThe exemptions apply to a wide assortment of goods ranging from plastic straws and coffee filters to car radiators and dog leashes, according to documents published Friday by the Office of the U.S. Trade Representative. The 437 products were among those swept into the trade war last year when the White House slapped tariffs on $250 billion in Chinese goods.\n\n[China calls off rise in tariffs on U.S. soybeans and pork as trade overtures resume]\n\nTrump is counting on a strong economy to propel him to reelection, but there have been signs of a slowdown. Manufacturing is in a recession, businesses have cut spending, and Trump’s trade war is starting to bite businesses and consumers. Wall Street often gets rattled by Trump’s unpredictable and sometimes contradictory jousts with China.\n\nA new survey from the Institute for Supply Management showed that factory activity shrank in August for the first time in three years. New orders for manufactured goods dropped for the second month in a row to a level not seen since late 2009, and production and employment contracted for the first time in three years. Another report from IHS Markit confirmed the findings, which showed the weakest manufacturing activity in nearly 10 years.\n\nAll told, the agency granted the exclusions from 1,100 requests made by companies and other U.S. entities. The order also exempted outdoor wick-burning torches, certain electric-powered skateboards and motorcycles, parts of swimming pool vacuum cleaners and water drinking fountains for pets.\n\nCompanies are permitted to request exemptions from new tariffs, typically on the grounds that it would be very difficult or expensive to find the items in another country.\n\nBut the exclusion process is an opaque one, said Chad P. Bown, a senior fellow at the Peterson Institute for International Economics. Bown said it isn’t entirely clear what determines which companies prevail, or not, especially when there’s so little precedent for how the government handles and responds to these sorts of requests.\n\nAnd as companies try to dodge the effects of Trump’s tariffs, Bown said, the exclusions could actually sow further divisions within the business community. It may become a priority for some companies to get their products off the lists, rather than mobilize in a broader pushback against Trump’s trade war.\n\n“In a very important sense, [the exemptions] can quell some dissension and displeasure that might be publicly voiced by American companies that are actually being harmed,” Bown said. “They’re holding out hope that theirs is the one product that is exempt.”\n\nDocuments from the U.S. Trade Representative lay out three sets of exclusions. One set, which is based on tariffs on $200 billion worth of goods implemented last September, will expire in August 2020. Another set, based on tariffs of $16 billion worth of goods implemented last August, will expire this time next year. A third set of exclusions, based on tariffs on $34 billion worth of books that took effect last July, will also expire this time next year.\n\nLast week, China said it was canceling planned tariff increases on American soybeans and pork. Days before, China had eased tariffs on 16 U.S. products, including alfalfa and lubricant oils. Trump responded by delayed a planned tariff increase on $250 billion of Chinese goods until Oct. 15 to avoid conflicts with Beijing’s plans to celebrate the 70th anniversary of the Chinese revolution.", "description": "The comments come after the U.S. granted exemptions on more than 400 Chinese products and while mid-level trade talks are under way between the two nations.", "authors": ["Rachel Siegel", "National Business Reporter", "September At Pm", "Rachel Siegel Is A National Business Reporter. She Previously Contributed To The Post'S Metro Desk", "The Marshall Project", "The Dallas Morning News."], "top_image": "https://www.washingtonpost.com/resizer/jSjz2yHDpve-c9yUMeViFjURujw=/1484x0/d1i4t8bqe7zgj6.cloudfront.net/09-20-2019/t_aaced1c884fe4926a103634ab4ca14dd_name_vlcsnap_2019_09_20_13h32m04s055.jpg", "published_at": "2019-09-20"}