{"pub": "yahoo", "url": "https://sports.yahoo.com/having-catch-astros-nats-kids-crash-world-series-065337292--mlb.html", "downloaded_at": "2019-10-27 00:37:16.343935+00:00", "title": "Having a catch: Astros, Nats kids crash World Series warmups", "language": "en", "text": "Having a catch: Astros, Nats kids crash World Series warmups David Chirinos, 12, son of Houston Astros catcher Robinson Chirinos plays catch in the outfield before Game 3 of the baseball World Series against the Washington Nationals Friday, Oct. 25, 2019, in Washington. (AP Photo/Alex Brandon)\n\nWASHINGTON (AP) -- After Robinson Chirinos yanked a line drive off the foul pole in left field to give the Houston Astros a 4-1 lead in Game 3 of the World Series against the Washington Nationals, he huddled with his 12-year-old son, David, in the clubhouse.\n\n''I came inside and he was waiting for me, like, 'Give me a hug, nice job, good swing,''' Chirinos said. ''Stuff like that, you can't put into words. There's some memories you're going to remember forever. So I thank God and the Houston organization to allow me to do that.''\n\nAll season, Major League Baseball has urged clubs and fans to ''Let the Kids Play.'' On Friday night, the Nationals and Astros didn't need the encouragement. There were enough youngsters with gloves during pregame warmups to fill out a Little League infield.\n\nScroll to continue with content Ad\n\nOwen Kendrick, the 10-year-old son of Nationals veteran Howie Kendrick, took grounders alongside the team at second base - one of his dad's many positions. Owen and his 8-year-old brother Tyson also chased fly balls in the outfield.\n\n''We do it all year,'' Nationals pitching coach Paul Menhart said. But in the World Series?\n\n''Why not? Why treat it any differently?'' Menhart said. ''We're a family-oriented team. Family's always welcome.''\n\nDuring batting practice, Washington second baseman Brian Dozier hit a high, routine fly ball to center field. Pitcher Joe Ross camped under it, barely needing to move a step. Meyer Cabrera, the 12-year-old son of infielder Asdrubal Cabrera, ran for the ball, stopped and watched Ross catch it.\n\nMeyer playfully tossed his glove and hit Ross in the leg, and they both laughed.\n\nCabrera said his son flew in from Florida earlier Friday to be with him for his first World Series home game.\n\nStory continues\n\n''That means a lot for me. He's always with me, all the time, in the regular season,'' Cabrera said.\n\nThe Nats are the oldest team in the majors, which means plenty of kids are old enough and slick enough to handle sharp grounders or towering fly balls.\n\nReliever Sean Doolittle, who so far is only a dad to two dogs, said the team showed it has its priorities straight when it backed bullpen mate Daniel Hudson's decision to leave during the NLCS to be with his wife, who gave birth to their third daughter.\n\n''I think we've been able to keep our identity and play the same way that we played all season long in the playoffs, and not every team is able to do that, but I think that's one thing that's helped us handle some of the pressure that comes with making a playoff run like this,'' Doolittle said. ''As the playoffs progress, there's more and more stress. Your resting stress levels just increase, and for them to still be able to get some time with their families, I think that balance is really, really important.''\n\nFrom a distance, David Chirinos looked almost like another player in the outfield in his blue team-issued sweatshirt. But he was the only one to raise his arms in triumph and high-five a player after a routine catch. On a home run, he ran back to the wall and pretended to leap and rob a long ball.\n\nWhen batting practice ended, he ran off the field, beaming, with beads of sweat on his forehead as he descended the dugout steps.\n\nThe stakes of the night ahead didn't matter - he was just a kid playing a game.\n\n---\n\nAP Sports Writer Stephen Whyno contributed to this report.\n\n---\n\nFollow Ben Nuckols at https://twitter.com/APBenNuckols\n\n---\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP-Sports", "description": "After Robinson Chirinos yanked a line drive off the foul pole in left field to give the Houston Astros a 4-1 lead in Game 3 of the World Series against the Washington Nationals, he huddled with his 12-year-old son, David, in the clubhouse.  ''I came inside and he was waiting for me, like, '", "authors": ["Ben Nuckols", "Ap Sports Writer"], "top_image": "https://s.yimg.com/ny/api/res/1.2/4m7J9F7MwAA_qOLsI12U8g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTY4NDtoPTEwMjQ-/https://s.yimg.com/uu/api/res/1.2/H_tOKuoHK2yNiUOztsITNA--~B/aD01MTI7dz0zNDI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201910251847676544962", "published_at": "2019-10-26"}