{"pub": "breitbart", "url": "https://breitbart.com/tech/2019/10/18/uber-lays-off-400-u-s-employees-imports-hundreds-of-foreign-workers", "downloaded_at": "2019-10-19 11:10:08.217583+00:00", "title": "Uber Lays Off 400 U.S. Employees, Imports Hundreds of Foreign Workers", "language": "en", "text": "Uber Technologies Inc. is laying off 400 American employees at its California offices while seeking to import hundreds of foreign workers through the H-1B visa program.\n\nAs detailed by the Mercury News, Uber laid off 88 U.S. employees in August and is laying off about 320 U.S. employees this month at its San Francisco and Palo Alto offices. In total, Uber executives said about 350 U.S. employees had been laid off. The majority of the layoffs are software engineers.\n\nSimultaneously, Uber has sought to import more than 1,000 foreign workers through the H-1B visa to take U.S. jobs in Fiscal Year 2019. This year, alone, Uber asked to import up to 1,129 H-1B foreign workers despite the layoffs.\n\n“When they’re laying off, they shouldn’t be using H-1Bs at all, or maybe sparingly at best,” said Howard University Ron Hira to the Mercury News. “It runs totally contrary to the intent of the H-1B program.”\n\nEvery year, more than 100,000 foreign workers are brought to the U.S. on the H-1B visa and are allowed to stay for up to six years. There are about 650,000 H-1B visa foreign workers in the U.S. at any given moment. Americans are often laid off in the process and forced to train their foreign replacements, as highlighted by Breitbart News. More than 85,000 Americans annually potentially lose their jobs to foreign labor through the H-1B visa program.\n\nThe Mercury News reports that Uber was able to import nearly 300 H-1B foreign workers this year — about double what the tech corporation had previously imported. In 2018, Uber imported about 152 H-1B foreign workers and in 2017, nearly 160 H-1B foreign workers were imported.\n\n“Big Tech is laying off hard working Americans and replacing them with cheap foreign workers with H-1B visas,” Rep. Paul Gosar (R-AZ) wrote in an online post. “Silicon Valley should be hiring American workers FIRST.”\n\n71 percent of tech workers in Silicon Valley are foreign-born, while the tech industry in the San Francisco, Oakland, and Hayward area is made up of 50 percent foreign-born tech workers. https://t.co/nLUuqBAAgv — John Binder 👽 (@JxhnBinder) January 18, 2018\n\nBetween 2016 and 2018, Uber has sought to import nearly 2,500 H-1B foreign workers to take high-paying white-collar jobs that would otherwise go to American STEM graduates and professionals.\n\nOftentimes, importing a foreign worker on the H-1B visa is the first step in a multinational corporation’s effort to outsource the American job, as the foreign worker arrives in the U.S., is trained in the job, and then is eventually sent back overseas with the job.\n\nAnalysis conducted last year reveal that 71 percent of tech workers in Silicon Valley are foreign-born, while the tech industry in the San Francisco, Oakland, and Hayward areas is made up of 50 percent foreign-born tech workers.\n\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.", "description": "Uber Technologies Inc. is laying off nearly 400 American employees at its California offices while seeking to import hundreds of foreign workers.", "authors": ["John Binder"], "top_image": "https://media.breitbart.com/media/2019/05/Uber-cars-waiting-for-customers-640x335.jpg", "published_at": "2019-10-18"}