{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/leah-bracknells-final-written-words-20635993", "downloaded_at": "2019-10-16 21:12:19.492533+00:00", "title": "Leah Bracknell's final written words as she vowed to 'do anything' to save her life", "language": "en", "text": "Get the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLeah Bracknell vowed she'd \"do anything\" to save her life in her powerful and emotional final blog post.\n\nThe former Emmerdale star has sadly lost her battle with lung cancer at the age of 55.\n\nShe had been diagnosed with stage 4 cancer three years ago.\n\nThe much-loved actress had detailed her fight against the disease in her online blog, Something beginning with C .\n\nIn her final post, Trew Medicine, posted on July 14, she talked about valiantly continuing to fight for her life.\n\nLeah talked about attending the UK's very first cancer awareness and holistic health festival, Trew Fields, that was created by a woman named Sophie Trew following her own cancer journey at the age of 23.\n\n(Image: Leah Bracknell/Instagram)\n\n(Image: blog)\n\nShe talked about how the event left her infused with joy and hope.\n\nLeah revealed she had even taken to the stage at the festival to talk about her experiences.\n\nShe said her chosen subject was \"From Cancer Victim to Cancer Rebel\".\n\nLeah wrote: \"The aim of the talk focuses on taking one’s power back : from our dis-ease, from medical professionals, from expectation, from fear etc. And how I challenge myself to see cancer as my teacher and guide, not simply my enemy, in order that cancer become more than just an ordeal or something to be endured, but an opportunity to expand and fully engage with the precious gift of life.\"\n\nLeah wrote about being a \"cancer rebel\" and said she was prepared to try \"almost anything\" to save her life.\n\n(Image: blog)\n\n(Image: blog)\n\nShe wrote: \"I saw my own life reflected as a microcosm of the bigger picture: there we were in our thousands, from all walks of life: pensioners, students, mothers, fathers, teenagers, families – “rebels” committing acts of non- violent civil disobedience in order to save the fragile balance of life on earth.\n\n\"Before time runs out. Life on earth faces extinction and the hour glass is almost empty. It’s almost midnight. For me too. Time is running out. I reject the expected notion of being passive or a patient or of being a victim, and I am prepared to try almost anything to “save” my life, even if, like the XR rebels it means breaking the law, just a little. Besides, I ain’t got nothing to lose.\"\n\nLeah's tragic passing was confirmed by her manager this afternoon.\n\n(Image: ITV/REX/Shutterstock)\n\nThe statement said: \"It is with the deepest sadness that Leah Bracknell's family confirm that Leah passed away in September, three years after her diagnosis with stage 4 lung cancer.\n\n\"They would like to thank all the public for their support and generosity which contributed to the extension and quality of her life over the past three years. Leah continued to embrace life and faced her illness with positivity. Many aspects of her journey can be found on her blog.\n\n\"Leah was best known and much loved as Zoe Tate in Emmerdale. She also had roles in Judge John Deed, A Touch of Frost, The Royal Today and DCI Banks to name just a few, as well as numerous appearances on stage and in pantomime. As well as acting, Leah was also an accomplished yoga teacher and shamanic healer.\n\n\"Leah had an energy and enthusiasm for life, a kind heart and much love to give to those around her.\n\n\"Her family have asked for privacy at this very sad time.\"", "description": "The former Emmerdale star, who played Zoe Tate for 16 years, has sadly lost her battle with lung cancer at the age of 55", "authors": ["Vicki Newman", "Image", "Leah Bracknell Instagram", "Blog", "Itv Rex Shutterstock"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article13373651.ece/ALTERNATES/s1200/2_Leah-Bracknell.jpg", "published_at": "2019-10-16"}