{"pub": "marketwatch", "url": "https://marketwatch.com/story/slowing-but-still-strong-us-jobs-market-keeps-economy-going-in-turbulent-times-2019-09-28", "downloaded_at": "2019-09-28 12:40:09.534063+00:00", "title": "Slowing but still-strong U.S. jobs market keeps economy going in turbulent times", "language": "en", "text": "Getty Images/iStockphoto The U.S. economy is riding out rougher times on the strength of the best labor market in decades. Can it last?\n\nTrump impeachment talk, China trade tensions, drone strikes in Saudi Arabia, a messy “Brexit” — it’s all enough to sour Wall Street and Main Street on the U..S. economy’s future.\n\nThank goodness for the strongest labor market in several decades.\n\nTo be sure, the U.S. jobs market itself is also showing signs of stress. Hiring has slowed this year, bigwig CEOs say they’re cutting back and a recent survey suggests service-oriented companies are reducing employment for the first time in a decade.\n\nThe economy is still producing enough new jobs, however, to outstrip the number of people entering the labor force each month, such as new immigrants, high school and college grads and working mothers heading back to the office.\n\nWhat’s more, the pace of layoffs and the unemployment rate remain near a 50-year low\n\nRead: For the first time in 11 years, 80% of Americans in their prime are working\n\nThe latest snapshot on the labor market due next Friday October 4 is likely to show more of the same. The economy likely added 140,000 new jobs in September, up from 130,000 in the prior month. That should keep the unemployment rate at or near 3.7%.\n\nSee: MarketWatch Economic Calendar\n\nIt’s probably unrealistic to expect much better than that. The number of new jobs added in the past six months, for instance, has tapered off to a 150,000 monthly average from 223,000.\n\n“The fact remains that job growth has cooled,” economists Michelle Girard and Kevin Cummins of Natwest Markets wrote to clients.\n\nFortunately that’s still more than enough to keep layoffs from rising for the first time in a decade, a turnabout that if it happens could undermine consumer confidence and even jeopardize the longest expansion in U.S. history.\n\nThe U.S. has to produce no more than 100,000 new jobs a month, economists estimate, to keep layoffs and the unemployment rate from rising.\n\nAmid all the political and global uncertainty, the labor market represents a sturdy foundation for the U.S. economy. Americans are willing to keep spending because they have a secure job and steadily rising incomes. And it’s strong consumer spending that’s keeping the economy out of recession.\n\nOther areas of the economy are less healthy. The closely followed ISM survey of manufacturing activity, to take one example, is likely to reflect broad weakness in September. The August survey showed the first contraction in manufacturing in three and a half years.\n\nU.S. exports have also been weak — another casualty of the China trade war.\n\nWall Street is watching closely to see if the manufacturing’s shadow lengthens.\n\n“We’re on the lookout for any signs of weakness in manufacturing spilling over into other sectors of the economy,” RBC economists Nathan Janzen and Josh Nye wrote.", "description": "Trump impeachment talk, China trade tensions, drone strikes in Saudi Arabia, a messy “Brexit” — it’s all enough to sour Wall Street and Main Street on the...", "authors": ["Jeffry Bartash"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HP743_jobshi_ZG_20190819165336.jpg", "published_at": "2019-09-28"}