{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/15/twitter-world-leaders-break-rules", "downloaded_at": "2019-10-15 23:05:55.128714+00:00", "title": "Twitter says it will restrict users from retweeting world leaders who break its rules – TechCrunch", "language": "en", "text": "Twitter says it will restrict users from retweeting world leaders who break its rules\n\nTwitter said it will restrict how users can interact with tweets from world leaders who break its rules.\n\nThe social media giant said it will not allow users to like, reply, share or retweet the offending tweets, but instead will let users quote-tweet to allow ordinary users to express their opinions.\n\nThe company said the move will help its users stay informed about global affairs, but while balancing the need to keep the site’s rules in check.\n\nWe haven’t used this notice yet, but when we do, you will not be able to like, reply, share, or Retweet the Tweet in question. You will still be able to express your opinion with Retweet with Comment. — Twitter Safety (@TwitterSafety) October 15, 2019\n\nTwitter has been in a bind, amid allegations that the company has not taken action against world leaders who break its rules.\n\n“When it comes to the actions of world leaders on Twitter, we recognize that this is largely new ground and unprecedented,” Twitter said in an unbylined blog post on Tuesday.\n\nLast year, Twitter said it would not ban President Trump despite incendiary tweets, including allegations that he threatened to declare war on North Korea. However, in the case of Iran’s supreme leader Ayatollah Seyed Ali Khamenei, he had one of his tweets deleted from the site.\n\n“We want to make it clear today that the accounts of world leaders are not above our policies entirely,” the company said. Any user who tweets content promoting terrorism, making “clear and direct” threats of violence, and posting private information are all subject to ban.\n\nBut Twitter said in cases involving a world leader, “we will err on the side of leaving the content up if there is a clear public interest in doing so.”\n\nIn such a case, “we may place it behind a notice that provides context about the violation and allows people to click through should they wish to see the content,” said Twitter, making good on a promise it made in June.\n\n“Our goal is to enforce our rules judiciously and impartially,” Twitter added in a tweet. “In doing so, we aim to provide direct insight into our enforcement decision-making, to serve public conversation, and protect the public’s right to hear from their leaders and to hold them to account.”", "description": "Twitter said it will restrict how users can interact with tweets from world leaders who break its rules. The social media giant said it will not allow users to like, reply, share or retweet the offending tweets, but instead will let users quote-tweet to allow ordinary users to express their opinions. The company said the […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-1129162556.jpg?w=569", "published_at": "2019-10-15"}