{"pub": "thehill", "url": "https://thehill.com/policy/technology/overnights/467796-hillicon-valley-fcc-takes-action-against-huawei-and-zte-justice", "downloaded_at": "2019-10-28 23:33:18.039249+00:00", "title": "Hillicon Valley: FCC chief aims to ban Huawei, ZTE from federal program | DOJ to allow body cameras in joint task forces | Facebook workers push back over political ads", "language": "en", "text": "Welcome to Hillicon Valley, The Hill's newsletter detailing all you need to know about the tech and cyber news from Capitol Hill to Silicon Valley. If you don't already, be sure to sign up for our newsletter with this LINK.\n\nWelcome! Follow the cyber team, Maggie Miller (@magmill95), and the tech team, Emily Birnbaum (@birnbaum_e) and Chris Mills Rodrigo (@chrisismills).\n\nFCC HITS HUAWEI: Federal Communications Commission (FCC) Chairman Ajit Pai on Monday announced a two-part proposal that would ban the use of FCC funds for equipment from companies deemed national security threats, including Chinese telecommunications companies Huawei and ZTE.\n\nWhat the FCC will consider: The first proposal would bar U.S. telecom providers from using money from the FCC's $8.5 billion Universal Service Fund (USF) to purchase equipment from telecom companies deemed national security threats, and would designate Huawei and ZTE as companies that pose a threat It would also create a process to designate other companies as threats in the future.\n\nADVERTISEMENT\n\nThe second proposal would require U.S. telecom providers that have used money from the USF to rip out equipment from designated companies including Huawei and ZTE. It would also call for an assessment of how much equipment from Huawei and ZTE is already integrated into networks, and how much it would cost to rip out.\n\nAs part of the proposals, the FCC will also look to establish a \"reimbursement program\" to help telecom carriers implement the changes. A senior FCC official told reporters during a call on Monday that money from the USF is used by hundreds of U.S. telecom providers.\n\nTimeline: The FCC will vote on whether to approve the proposals during its next full commission meeting on Nov. 19.\n\nPai's pitch: \"When it comes to 5G and America's security, we can't afford to take a risk and hope for the best,\" Pai said. \"We need to make sure our networks won't harm our national security, threaten our economic security, or undermine our values.\"\n\nPai added that \"as the United States upgrades its networks to the next generation of wireless technologies -- 5G -- we cannot ignore the risk that the Chinese government will seek to exploit network vulnerabilities in order to engage in espionage, insert malware and viruses, and otherwise compromise our critical communications networks.\"\n\nNeither Huawei nor ZTE immediately responded to request for comment.\n\nRead more on the proposal here.\n\nJUST A LITTLE SNAPSHOT: The Justice Department will permit local police officers to wear body cameras during joint task force operations with federal agents in a pilot program, the department announced Monday.\n\nThe pilot program will allow officers participating on federal task forces to wear cameras when serving arrest warrants and executing search warrants, according to a department press release. The program will begin Nov. 1.\n\n\"These are some of the most dangerous jobs in law enforcement, and I am grateful for the sacrifice of those who serve,\" Attorney General William Barr William Pelham BarrSchiff: Barr 'weaponizing' DOJ 'to go after the president's enemies' 'Saturday Night Live' targets Trump supporters as Alec Baldwin returns Comey: Mueller 'didn't succeed in his mission because there was inadequate transparency' MORE said in the release. \"The Department of Justice has no higher priority than ensuring the safety and security of the American people and this pilot program will continue to help us fulfill that mission.\"\n\nThe department release states the decision arose out of \"input and guidance\" from state and local law enforcement leaders as well as other federal agencies.\n\nRead more here.\n\nRESPONDING TO THE 'RESPONSE' ACT: A long-awaited GOP proposal to combat mass shootings has been receiving pushback from education groups and children's privacy advocates over language they say could result in the \"over-surveillance\" of minors.\n\nAfter months of deliberations, including meetings with victims and law enforcement officials in communities wracked by deadly shootings, Sen. John Cornyn John CornynAdvocates warn kids' privacy at risk in GOP gun violence bill Senators concerned impeachment will consume agenda House passes bill aimed at reducing rape kit backlog MORE (R-Texas) introduced a Republican-backed \"bill to help prevent mass shootings\" on Wednesday.\n\nThe Restoring, Enhancing, Strengthening, and Promoting Our Nation's Safety Efforts (Response) Act, which has several Republican co-sponsors, bundles some of the top GOP proposals to combat mass shootings into one bill. It would expand resources for mental health treatment, facilitate the creation of \"behavioral intervention teams\" to monitor students exhibiting disturbing behavior and offer new tools for law enforcement.\n\nThe pushback: But advocates have raised red flags over the Response Act's requirement that schools begin monitoring their computer networks to \"detect [the] online activities of minors who are at risk of committing self-harm or extreme violence against others.\"\n\nUnder Cornyn's legislation, nearly all federally funded schools in the U.S. would be required to install software to surveil students' online activities, potentially including their emails and searches, in order to flag \"violent\" or alarming content.\n\nPrivacy experts and education groups, many of which have resisted similar efforts at the state level, say that level of social media and network surveillance can discourage children from speaking their minds online and could disproportionately result in punishment against children of color, who already face higher rates of punishment in school.\n\n\"This is all very frightening,\" an education policy consultant, who has been tracking the legislation, told The Hill. \"There's no real research, or even anecdotal information, to back up the idea ... that following everything [kids] do online is really a way to determine that they're going to be violent.\"\n\nSources told The Hill they have been pressing Cornyn's office over the issue, pointing out there is little evidence that increasing online monitoring can effectively reduce violence in schools.\n\nWhat it means: The conflict highlights the high-stakes trade-offs between children's privacy and school safety in a country facing a seemingly constant stream of school shootings. \"I think these people are well-meaning,\" said one source who has been lobbying against the legislation. \"I don't think there's any intent to do harm to kids.\"\n\nStill, Cornyn's office has been rebuked as they sought endorsements for the bill from several education groups and advocates, according to multiple sources.\n\nRead more on the pushback here.\n\nDEAR MARK: Hundreds of Facebook employees are raising sharp concerns over the company's policy allowing misinformation in political ads, raising the stakes as the company simultaneously faces a firestorm of criticism from policymakers and 2020 Democrats externally.\n\nIn a letter to Facebook CEO Mark Zuckerberg Mark Elliot Zuckerberg'Saturday Night Live' targets Trump supporters as Alec Baldwin returns Facebook Green New Deal ad tests Ocasio-Cortez's concerns about the platform Ocasio-Cortez blasts Facebook's ad decisions, calling them 'increasingly disturbing' MORE, obtained by The New York Times, the employees wrote they \"strongly object\" to Facebook's decision not to fact-check political ads paid for by elected officials or political candidates.\n\n\"Misinformation affects us all,\" they wrote, according to a copy published by the Times. \"Our current policies on fact checking people in political office, or those running for office, are a threat to what FB stands for.\"\n\n\"We strongly object to this policy as it stands,\" the employees continued. \"It doesn't protect voices, but instead allows politicians to weaponize our platform by targeting people who believe that content posted by political figures is trustworthy.\"\n\nThe controversy: Earlier this month, Facebook clarified that it does not fact-check or censor misinformation in political ads, drawing aggressive scrutiny from leading Democratic presidential candidates including former Vice President Joe Biden Joe BidenBiden: Trump 'an idiot' for saying Russian interference a 'hoax' Biden: 'I know I'm the frontrunner' in 2020 race 2020 Democrats set sights on corporate tax hike MORE and Sen. Elizabeth Warren Elizabeth Ann WarrenBiden: 'I know I'm the frontrunner' in 2020 race 2020 Democrats set sights on corporate tax hike Tlaib endorses Sanders at Detroit campaign rally MORE (D-Mass.).\n\nZuckerberg defended the policy at a congressional hearing last week during a fiery line of questioning from Rep. Alexandria Ocasio-Cortez Alexandria Ocasio-CortezTlaib endorses Sanders at Detroit campaign rally Sanders, Tlaib make donations to Detroit marching band Facebook Green New Deal ad tests Ocasio-Cortez's concerns about the platform MORE (D-N.Y.), who pressed the tech executive over whether she could place ads making false claims about Republican rivals.\n\nOcasio-Cortez on Monday praised the Facebook employees that signed on to the letter, calling them \"courageous.\"\n\n\"Facebook's culture is built on openness so we appreciate our employees voicing their thoughts on this important topic,\" Bertie Thomson, Facebook's vice president of corporate communications, said in a statement to The Hill.\n\n\"We remain committed to not censoring political speech, and will continue exploring additional steps we can take to bring increased transparency to political ads,\" she said.\n\nRead more on the Facebook letter here.\n\nINSTAGRAM EXPANDS BAN ON SUICIDE CONTENT: Instagram on Sunday announced it was expanding its ban on suicide-related content to include fictional depictions of suicide and self-harm.\n\n\"We will no longer allow fictional depictions of self-harm or suicide on Instagram, such as drawings or memes or content from films or comics that use graphic imagery,\" Instagram head Adam Mosseri said in a blog post.\n\n\"We will also remove other imagery that may not show self-harm or suicide, but does include associated materials or methods.\"\n\nAccounts sharing graphic content will also no longer be recommended in search or the Explore tab. The platform will also boost the visibility of helplines like the National Suicide Prevention Lifeline and The Trevor Project.\n\nInstagram launched its policy on graphic images of self-harm in February, following public outcry in the United Kingdom over the death of British teenager Molly Russell, who killed herself after viewing graphic content on the platform.\n\nHer father, Ian Russell, has called out Instagram repeatedly for not doing enough to keep teens from viewing self-harm-related content.\n\nInstagram has removed, reduced the visibility of or added sensitivity screens to more than 834,000 pieces of graphic content since February, Mosseri said.\n\nRead more on Instagram's decision here.\n\nTHE RUSSIANS ARE AT IT AGAIN: Microsoft announced Monday that it had found evidence of a Russian hacking group targeting over a dozen national and international sporting and anti-doping groups with \"significant cyberattacks.\"\n\nThe company found that around 16 organizations on three continents were targeted by a group known as \"Strontium\" or \"Fancy Bear/APT28\" beginning in September, and that some attacks had been successful.\n\nThe group used spear-phishing attacks and exploited internet-connected devices in order to attack the companies, along with the use of malware.\n\nThe attacks occurred just before reports emerged about Russia being banned by the World Anti-Doping Agency from competing in all major sports events due to doping incidents. Russia was banned in 2017 from competing in the 2018 Winter Olympics due to the use of performance-enhancing drugs.\n\nTom Burt, the corporate vice president of Customer Security and Trust at Microsoft, wrote in a blog post on Monday that \"the methods used in the most recent attacks are similar to those routinely used by Strontium to target governments, militaries, think tanks, law firms, human rights organizations, financial firms and universities around the world.\"\n\nBurt noted that the majority of the recent attacks were not successful, and that the company has notified all the impacted companies. Microsoft did not name the organizations targeted.\n\nRead more here.\n\nA LIGHTER CLICK: The cutest little nugget\n\nAN OP-ED TO CHEW ON: Playing with fire: Global offensive cyber operations\n\nNOTABLE LINKS FROM AROUND THE WEB:\n\nGeorgia hit by massive cyberattack (BBC News)\n\nSouth Africa grapples with multiple cyberattacks (CyberScoop)\n\nWhat's driving Europe's new aggressive stance on tech (Politico)\n\nSen. Kamala Harris Kamala Devi HarrisDemocratic lawmakers, 2020 candidates pay tribute to Conyers 2020 Democrats set sights on corporate tax hike Harris reverses course, attends South Carolina justice forum MORE says Big Tech shouldn't profit from hate (Axios)", "description": "Welcome to Hillicon Valley, The Hill's newsletter detailing all you need to know about the tech and cyber news from Capitol Hill to Silicon Valley.", "authors": [], "top_image": "https://thehill.com/sites/default/files/huawei_052719getty_lead.jpg", "published_at": "2019-10-28"}