{"pub": "yahoo", "url": "https://sg.style.yahoo.com/youtube-star-gigi-gorgeous-says-193800499.html", "downloaded_at": "2019-10-25 22:45:29.557017+00:00", "title": "YouTube Star Gigi Gorgeous Says ‘We Need to Shout From the Rooftops: Makeup Is Genderless’", "language": "en", "text": "YouTube star and transgender activist Gigi Gorgeous says it’s time to “shout from the rooftops — makeup is genderless.”\n\nThe author and beauty guru is about to drop a makeup collection in partnership with Ipsy, a monthly beauty subscription service, this November. Gorgeous says she hopes the products will be worn by people of all genders.\n\n“Makeup is not for just women,” she said in a conversation with Instagram influencer and founder of The Skinny Confidential Lauryn Evarts Bosstick at WrapWomen’s Power Women Summit Friday.\n\nAlso Read: Watch Chrissy Metz and Diane Warren Perform 'Breakthrough' Song 'I'm Standing With You' (Video)\n\n“Growing up, I would walk through the department stores, I’d see Coco Rocha selling red lipstick, and I’d see another super model there selling a fragrance or whatever. And I would never see anybody who looked different, or was maybe male,” she said. “So for me, it was about pushing diversity and inclusivity with this makeup line, because I wanted to make my makeup not for myself now as a woman — I wanted to make makeup for myself when I was 16 and I was a boy.”\n\nGorgeous also told a story about what it was like to be a boy getting started in the YouTube beauty space.\n\n“Now it’s not a thing to be like, ‘Oh my God, it’s a boy in makeup,'” Gorgeous said. “When I started in my previous gender, I was a boy in makeup. I was doing YouTube and I was really sharing my story. I was in high school, I was going through it, I was being bullied, I was very different. Nobody was even doing YouTube. So that’s a group I’m really glad has come out, because it’s showing a lot of people, you’re not alone, you’re not that different. You’re talented, you shouldn’t be pointed and gawked at, you should be applauded for being creative and putting yourself out there.”\n\n\n\n\n\nAlso Read: Power Women Summit 2019: Follow the Live Blog\n\nTheWrap’s 2019 Power Women Summit takes place on October 24 and 25 at the Fairmont Hotel in Santa Monica. The event brings together the industry’s most influential women to drive “Toward 50/50” equity and inclusivity in entertainment and media.\n\nThe summit aims to inspire and empower more than 1,000 women across the landscape of their professional careers and personal lives. This year, the summit is being held at the beautiful Fairmont Miramar Hotel in Santa Monica with the backdrop of the beach and the hotel’s iconic fig tree.\n\nPresented by WrapWomen Foundation, the non-profit arm of TheWrap, the event is providing two days of education, mentorship, workshops and networking to promote the goal of greater women’s leadership in this industry, and gender balance in media, entertainment and technology overall.\n\nRead original story YouTube Star Gigi Gorgeous Says ‘We Need to Shout From the Rooftops: Makeup Is Genderless’ At TheWrap", "description": "YouTube star and transgender activist Gigi Gorgeous says it’s time to “shout from the rooftops — makeup is genderless.”The author and beauty guru is about to drop a makeup collection in partnership with Ipsy, a monthly beauty subscription service, this November. Gorgeous says she hopes the products will", "authors": ["Margeaux Sippell"], "top_image": "https://s.yimg.com/uu/api/res/1.2/dbpcBMnSiQZJR3ibBlH8Fg--~B/aD00MDA7dz02MTc7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thewrap.com/e2c3f1f28bc875c57f405e4fee2ce3a2", "published_at": "2019-10-25"}