{"pub": "mirror", "url": "https://mirror.co.uk/film/thor-love-thunder-director-taika-20585483", "downloaded_at": "2019-10-15 15:05:27.813776+00:00", "title": "Thor Love and Thunder director Taika Waititi discusses potential cancer storyline", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe Marvel Cinematic Universe could be about to feature some hard-hitting subject matter.\n\nTaika Waititi has teased a potential avenue for the fourth film in the Thor series starring Chris Hemsworth as the God of Thunder.\n\nThor: Love and Thunder will see Natalie Portman return to her role as Dr. Jane Foster, Thor's former love interest, who will become the superheroine known as The Mighty Thor.\n\nIn the comics, Jane wields the hammer as the warrior, but whilst undergoing a battle against breast cancer.\n\nSpeaking to Variety, Waititi has teased that this medical story could become a part of the film.\n\n\"I think that's a really powerful part of the books,\" said Waititi. \"I think it's really cool that she's fighting this thing and there's two battles going on. Personally I really love that storyline. But whether it ends up in the film is yet to be seen.\"\n\n(Image: Marvel comics)\n\nThe Thor: Ragnarok director added: “We’re not sure if we’re going to do a complete lift of that whole storyline. These things change through the shoot and even when we’re editing sometimes.\n\n\"Like, ‘Let’s get rid of that storyline where she’s got breast cancer. We’ll change it to something else, or maybe she’s fine.'”\n\nHemsworth and Portman will be joined in the cast by Tessa Thompson, reprising her role as Valkyrie, who is now the ruler of Asgard following the events of Avengers Endgame.\n\nThor: Love and Thunder is released in cinemas on November 5, 2021.\n\nAre you excited for Thor: Love and Thunder? Let us know in the comments below.", "description": "Thor: Ragnarok director Taika Waititi will helm the fourth solo outing for Chris Hemsworth as the God of Thunder", "authors": ["Lewis Knight", "Image", "Marvel Comics"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article18762611.ece/ALTERNATES/s1200/0_Marvel-Studios-Hall-H-Panel.jpg", "published_at": "2019-10-15"}