{"pub": "businessinsider", "url": "https://pedestrian.tv/gaming/misadventure-in-little-lon-true-crime-game-melbourne", "downloaded_at": "2019-10-20 23:25:43.662096+00:00", "title": "This True Crime Phone Game Lets You Play Detective On The Streets Of Melbourne In 1910", "language": "en", "text": "I’m not really a gamer, but slap my left butt cheek and call me Colonel because true crime IS my jam, and Misadventure In Little Lon, an augmented reality game you can play on your phone while wandering through Melbourne, is right up my alley.\n\nThe premise is this. It’s 1910, and you’re wandering around Melbourne’s notorious red-light district. It’s part historical adventure, part mystery – if you play in Melbourne, you’ll get to visit heritage sites where actual events went down, but you can also play it anywhere in the world (just without the IRL locations being involved, obviously).\n\nThe game sees you play the role of detective, as you investigate a series of clashes in Little Lon which led to Ernest Gunter’s demise. Was Gunter hit in an unprovoked attack, or did he attack a member of the terrifying Bourke Street Rat associates? Who is lying and who is telling the truth? That’s for you to decide.\n\nThe first five scenes can be enjoyed via a free trial, and then it’s just $4.99 to buy the game. Which is cheaper than a large coffee if you add all the weird milks, so honestly this is a no-brainer. It takes two hours to play and you’ll walk for around 3km, which is also great exercise.\n\nKeen? Misadventure In Little Lon is available on the App Store or Google Play, and there’s a few techy things like needing some AR download that I don’t understand, so definitely read the info before you pay $$$. Here’s the site for all the details!", "description": "True crime augmented reality game 'Misadventure In Little Lon' lets you wander the streets of Melbourne, but in 1910 as you try to solve a murder.", "authors": ["Melissa Mason"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/Screen-Shot-2019-10-21-at-9.25.52-am.png", "published_at": "2019-10-20"}