{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/13/bureau-alcohol-tobacco-firearms-and-explosives-und", "downloaded_at": "2019-10-14 03:48:19.249727+00:00", "title": "EXCLUSIVE: ATF beleaguered by crisis in age of mass shootings", "language": "en", "text": "An epidemic of mass shootings has put a spotlight on the Bureau of Alcohol, Tobacco, Firearms and Explosives, revealing an agency that is understaffed, underfunded and treated as a political punching bag on both the right and the left.\n\nThe ATF finds itself at a crossroads. With 300 agents expected to retire in 2018 and 2019, the rate of new hires isn’t keeping up and the agency is short-staffed for investigating gun crimes and policing dealers.\n\nSome lawmakers want to abolish the agency.\n\nThe Trump administration and Congress so far have ignored the brewing crisis at the ATF, leaving it languishing without a permanent director and chipping away at its budget. That needs to change if Congress wants to get serious about tackling the nation’s gun problems, said Kenneth E. Melson, former acting ATF director.\n\n“If they are really concerned, Congress would give ATF the resources to prevent and respond to mass shootings, but ATF is a political football,” he said.\n\nThe ATF is one of the smallest federal agencies with fewer investigators than the Las Vegas Police Department. It employees about 5,000 people, including 2,600 federal agents. Those numbers have remained largely stagnant since 2001, even though gun deaths have skyrocketed 34% during the same period.\n\nEven the bureau concedes it is struggling. In its 2020 budget request, the bureau said its “unprecedented” increased workload, outdated technology and staffing shortages have put the public at risk.\n\n“The growth of violent gun crime is an external challenge that has strained ATF’s ability to respond to requests for assistance to address the needs of the nation’s cities and citizens most affected by this violence,” the bureau wrote, adding that “requests for services and support continue to exceed our ability to respond.”\n\nStaffing levels are expected to dwindle over the next few years. In the 2018 calendar year, 172 agents retired but only 156 agents were hired, according to internal estimates obtained by The Washington Times. Through the end of this September, 52 agents had been hired and retirements are expected to track at the same pace as 2018.\n\nAn ATF spokeswoman declined to comment on the retirement numbers. She said a detailed plan to address attrition would be “merely speculation.”\n\nBut the ATF’s budget request revealed that 471 ATF agents, or roughly 17%, are 50 or older. The mandatory retirement age for federal law enforcement officers is 57.\n\n“Stronger gun laws are not going to help if you don’t have agents to enforce the gun laws,” Mr. Melson said. “We need to resource the ATF sufficiently to enforce the gun laws that we have.”\n\nThe Trump administration does not appear committed to strengthening the agency. Last year, the White House proposed transferring the ATF’s alcohol and tobacco responsibilities to the Treasury Department. It also proposed cutting the budget of the Justice Department, which oversees the ATF, by 2%. At the time, then-acting ATF Director Thomas Brandon said belt-tightening would eliminate 377 positions from the bureau.\n\n“ATF won’t be as able to do what it can do today,” Mr. Brandon told Congress. “You hear people say to trim the fat. Well, then we trimmed into muscle. Now we’re trimming into bone.”\n\nThe Justice Department rebuffed requests for more agents, a source familiar with the matter told The Washington Times.\n\nA Justice Department official disputed the claim, saying the department “fully supported” the ATF’s proposals and Attorney General William Barr personally requested that Congress expand the agency’s ability to investigate gun violence.\n\nFormer Deputy Attorney General Rod Rosenstein also dismissed reports of tension between the ATF and the Justice Department.\n\n“ATF is an essential Department of Justice agency,” he said. “ATF is the central pillar of the federal government’s efforts to combat violent crime. Every U.S. attorney who makes reducing violent crime a priority relies heavily on ATF’s agents and its partnerships with local police departments. ATF played a primary role in helping to reduce violent crime in Baltimore from 2007 to 2015, and it is doing the same in many other cities.”\n\nBut Mr. Melson said Justice Department brass did not respect the ATF during the Obama administration. He said his counterparts at other law enforcement agencies had nice placards on their desks during one meeting with top Justice Department officials. His placard said “Department of Treasury,” even though the ATF was moved out of that department 10 years earlier, he said.\n\nHe said the Justice Department can do more to promote the ATF.\n\n“The future of the ATF depends a lot on the leadership in the Justice Department, and if you don’t have an attorney general talking about the role of the ATF, it might atrophy,” he said. “And if you don’t have a confirmed director that can go to Congress and talk about budget and regulatory issues, the ATF will not progress. The status quo will remain the same.”\n\nDavid Chipman, a former ATF agent who works for Giffords, a group advocating tougher gun control laws, blames the firearms lobby. He said it worked for years to undercut the ATF’s budget.\n\n“We all agree gun violence is a significant public safety threat, so why is the ATF the size that it is?” he said. “That is largely because the gun lobby has been concerned about an effective and aggressive ATF, and their influence over legislators has kept the ATF ineffectual, at least budgetwise.”\n\nOne of the biggest problems facing the ATF is the lack of leadership, analysts say. The ATF has had a permanent director for only four of the past 13 years. The gun lobby pushed in 2006 to make the ATF director a Senate-confirmed position.\n\n“All of these federal law enforcement agencies need to have some permanence,” said Donald Mihalek, executive director of the Federal Law Enforcement Officers Association. “Without that permanence, you have agencies that are floating with no direction and the acting director tends to be managing rather than leading. The ATF director has become one of the most political positions in federal law enforcement, and it shouldn’t be.”\n\nMr. Brandon, who served as acting director since 2015, retired in April. President Trump has nominated Chuck Canterbury, who heads the Fraternal Order of Police, to lead the agency. But the Senate hasn’t scheduled a vote and Mr. Canterbury sparred with Republicans during a contentious confirmation hearing.\n\nMr. Canterbury angered Republicans with evasive answers about his views on gun rights. A frustrated Sen. John Kennedy, Louisiana Republican, said he might not support the nomination.\n\nPolitical interference has always had an outsized influence on the ATF, especially compared with its sister agencies such as the FBI and Drug Enforcement Administration. The gun lobby and its Republican allies have claimed the ATF is out to confiscate legally owned weapons while Democrats have assailed the agency for not doing enough to prevent gun violence.\n\n“The ATF has always been a stepchild compared to the other agencies,” Mr. Melson said. “It has been one of the most, if not most underappreciated federal law enforcement agencies in the Department of Justice. It’s always caught between the gun rights advocates and those who want to add more restrictions to the possession and use of guns.”\n\nPresidents Reagan and Obama proposed eliminating the ATF. Rep. F. James Sensenbrenner Jr., Wisconsin Republican, introduced legislation to abolish the bureau while the left-leaning Center for American Progress argued that it should be folded into the FBI.\n\nArkadi Gerney, who managed former New York Mayor Michael R. Bloomberg’s anti-gun initiatives, said the idea of moving the ATF into the FBI has merit.\n\n“The ATF is an agency that is an also-ran playing second fiddle to other law enforcement agencies,” he said. “It has a difficult mission, but it doesn’t have the resources, leadership or political standing to be successful.\n\n“I think the ATF can do a really good job,” he said. “I think the question is: Is it more likely that is going to happen on its own, or might we get there faster by taking the agency and putting its people in the FBI? My gut is the latter.”\n\nMr. Melson disagreed.\n\n“I think it needs to stand on its own,” he said. “These agents are tremendous, and they get results. If you put them into the FBI, it is just going to make the FBI too big and too expansive.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "An epidemic of mass shootings has put a spotlight on the Bureau of Alcohol, Tobacco, Firearms and Explosives, revealing an agency that is understaffed, underfunded and treated as a political punching bag on both the right and the left.", "authors": ["The Washington Times Http", "Jeff Mordock"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/13/AP_18301030926641_c0-1222-2667-2777_s1200x700.jpg?153c1f22a435413ba35fcd06024559e0914e1001", "published_at": "2019-10-13"}