{"pub": "reuters", "title": "Pakistan would not use nuclear weapons first, amid tensions with India: PM Imran Khan", "url": "https://in.reuters.com/article/india-kashmir-pakistan/pakistan-would-not-use-nuclear-weapons-first-amid-tensions-with-india-pm-imran-khan-idINKCN1VN1JS", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:06:00.351940+00:00", "text": "ISLAMABAD (Reuters) - Pakistan would not use nuclear weapons first, Prime Minister Imran Khan said on Monday, amid tensions with arch-rival India after New Delhi revoked the special status of its part of the disputed Kashmir region.\n\nFILE PHOTO: Pakistani Prime Minister Imran Khan gestures as he addresses the Azad Kashmir parliament on Pakistan's 72nd Independence Day in Muzaffarabad, Pakistan-administered Kashmir, August 14, 2019. REUTERS/Stringer/File Photo\n\n“We both are nuclear-armed countries. If these tensions increase, the world could be in danger,” Khan said, addressing members of the Sikh religious community in the eastern city of Lahore. “There will be no first from our side ever,” he said.\n\nTension remains high in Kashmir, where security forces have used tear gas against stone-throwing protesters and the valley remains under lockdown after Indian Prime Minister Narendra Modi’s decision to withdraw special rights for the Muslim-majority state on Aug. 5.\n\nBy stripping Indian-controlled Kashmir of its special status, New Delhi blocked the region’s right to frame its own laws and allowed non-residents to buy property there. Delhi said the change would help Kashmir’s development, to the benefit of all, but its move angered many residents of the region and was strongly condemned by Pakistan.\n\nKhan has so far focused on a global diplomatic campaign condemning India’s actions, accusing Modi of committing human rights violations and atrocities in the valley.\n\nHe has also said frequently that any misadventure between two nuclear-armed nations could endanger the world.\n\nMuslim-majority Kashmir has long been a flashpoint between India and Pakistan. Both countries rule parts of Kashmir while claiming it in full. Two of the three wars they have fought have been over it.\n\nAlso on Monday, Islamabad gave a consular access to an Indian who was given a death sentence for spying by a Pakistani military court, which the International Court of Justice asked Pakistan to review in mid-July.\n\n“Pursuant to the decision of the International Court of Justice, Pakistan provided consular access on 02 September, 2019 to India for Commander Kulbhushan Jadhav, Indian spy, serving Indian Naval officer,” a Pakistani foreign office statement said.\n\nThe statement said that at India’s request, there was no restriction on the language of communication and the access was recorded, which continued for two hours.\n\nAn Indian external affairs ministry statement said “Jadhav appeared to be under extreme pressure to parrot a false narrative to bolster Pakistan’s untenable claims.” It said Delhi would wait for a detailed report to determine the extent of conformity to the ICJ directives.", "description": "Pakistan would not use nuclear weapons first, Prime Minister Imran Khan said on Monday, amid tensions with arch-rival India after New Delhi revoked the special status of its part of the disputed Kashmir region.", "authors": ["Asif Shahzad", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190902&t=2&i=1425426236&w=1200&r=LYNXNPEF8117H"}