{"pub": "breitbart", "url": "https://breitbart.com/news/tourists-surge-at-uluru-before-australia-bans-climb", "downloaded_at": "2019-10-10 06:17:20.013547+00:00", "title": "Tourists surge at Uluru before Australia bans climb", "language": "en", "text": "Sydney (AFP) – Large numbers of tourists are rushing to scale Uluru — also known as Ayers Rock — ahead of a looming ban on climbing a site sacred to indigenous Australians.\n\nPhotographs of hundreds of people clambering up the giant red monolith have provoked a social media backlash, with critics lashing as “ignorant” those going against the wishes of the traditional Aboriginal owners of the land, the Anangu.\n\n“A mass of morally and ethically bankrupt people,” indigenous woman Laura McBride tweeted alongside an image showing a queue of people snaking up the side of Uluru.\n\n“One even hiking a toddler up, teaching the next generation how to be ignorant.”\n\n“Imagine rushing to climb Uluru before it closes just so you could brag about disrespecting the oldest living culture in the world,” tweeted National Indigenous Television journalist Madeline Hayman-Reber, who called the scenes “embarrassing”.\n\nOfficials say the ban, which comes into effect on October 26, is intended to show respect for cultural practices, protect the site from further environmental damage and to ensure visitors’ safety.\n\nMore than 395,000 people visited the Uluru-Kata National Park in the 12 months to June 2019, according to Parks Australia, about 20 percent more than the previous year.\n\nAround 13 percent of those who visited during that period made the climb, park authorities said.\n\nMore recent figures are not available but Tourism Central Australia CEO Stephen Schwer said there had been a “significant jump” in the number of people visiting in recent weeks, with the period leading up to the ban coinciding in part with school holidays.\n\n“Its been very busy, particularly down in the national park precinct itself,” he told AFP.\n\n“We’ve had quite an issue with accommodation availability, because there’s a lot of people want to climb Uluru before it closes. It’s been a busier than normal holiday period.”\n\nJapanese visitors and Australians on driving holidays were most likely to want to scale Uluru, Schwer said, though he urged them not to do so.\n\nAustralian tourist Belinda Moore, 33, drove to Uluru from her home in central Queensland state to ascend the rock, an experience she said she “absolutely loved”.\n\n“It’s always been something to tick off the bucket list and when we heard it was closing, we knew it was now or never,” she told AFP.\n\nMoore said she did not think her climb was disrespectful to traditional owners as she was not Aboriginal.\n\n“It may be for their own people, because it’s their sacred site,” she said.\n\n“I’m pretty sad that they’re closing it, but it’s still amazing just to see it. I would still recommend it.”\n\nThe climb will be permanently closed as of October 26, the anniversary of ownership being handed back to the Anangu people.\n\nUluru has great spiritual and cultural significance to indigenous Australians, with their connection to the site dating back tens of thousands of years.\n\nThough visitor numbers were expected to decline once the ban was in place, Schwer said local tourism operators were “not particularly concerned” as it would return the area to normality.\n\n“People need to remember that in central Australia we’re a very interconnected community,” he said. “The people who are requesting the climb closure are our friends and colleagues.\n\n“We’re just looking forward to being able to have the climb consigned to the annals of history.”", "description": "Sydney (AFP) – Large numbers of tourists are rushing to scale Uluru — also known as Ayers Rock — ahead of a looming ban on climbing a", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/09/05a899_uluru-as-ayers-rock-is-large-sandstone-rock-formation-world-biggest-monolith-640x335.jpg", "published_at": "2019-10-09"}