{"pub": "investing.com", "url": "https://za.investing.com/news/general/revenge-porn-now-criminalised-and-carries-hefty-fine-or-jail-time-1963894", "downloaded_at": "2019-10-06 07:26:37.771617+00:00", "title": "Revenge Porn Now Criminalised And Carries Hefty Fine Or Jail Time", "language": "en", "text": "© Reuters.\n\n\n\n\n\n\n\n\n\n\n\nPresident Cyril Ramaphosa has this week signed into law the Films and Publications Amendment Act 11 of 2019 which criminalises revenge porn, amongst other offenses concerning the distribution of pornographic material.\n\nThe Act aims to clamp down on the distribution of child pornography and images or videos of a sexual nature without the consent of the person featured.\n\nSpeaking to Joanne Jospeh on 702, social media expert Emma Sadleir said victims may now lay criminal charges which could result in the perpetrator being imprisoned or paying a hefty fined.\n\n“If you can’t identify who is in the content, then the sanction’s up to R150,000 fine and/or two years in prison. But if it is identifiable content, i.e. your name, or a tattoo is in it, or your face or a birth mark or something that makes the content easily identifiable then the sanction jumps to R300,000 fine and/or a four-year term of imprisonment.”\n\nPreviously those who sought legal recourse in matters concerning revenge porn would have to file a case of crimen injuria.\n\nPOKING HOLES IN THE NEW LAW\n\nSadleir has noted aspects of the amendment bill as being problematic, and defeating the purpose of what is generally thought to be a progressive piece of legislation.\n\nShe said, for example, the definition of the word ‘private’ makes it difficult for someone who has initially shared an image with a specific recipient to seek recourse when that same image is further distributed without the sender’s consent.\n\n“The definition of ‘private’ was ‘something that was not ordinarily seen in public’. In this most recent version they’ve changed the definition to ‘something that is not intended to be seen by others’”.\n\nThat worries me greatly because if I am involved in sexting and I take picture of myself naked and I send it to my boyfriend, then I have intended in capturing that photo for it to be seen by others. If he sends it on, I wouldn’t be able to rely on the law because I did intend for somebody else to see it.”\n\nSadleir said though she knows it wasn’t the intention of the legislatures, she describes this as “legislated victim shaming”.\n\nShe said she is also concerned that the perpetrators may hide behind the portion of the Act which requires demonstration of intent to do harm, as not all distribution of offensive material is done with the sole intent to do harm.\n\n\n\n\n\n\n\n\n\n\n\nThe post Revenge Porn Now Criminalised And Carries Hefty Fine Or Jail Time appeared first on iAfrica.com.", "description": "Revenge Porn Now Criminalised And Carries Hefty Fine Or Jail Time", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPED0M0I8_L.jpg", "published_at": "2019-10-06"}