{"pub": "blastingnews", "url": "https://us.blastingnews.com/sports/2019/10/nba-clippers-open-new-la-rivalry-with-win-over-lakers-003004811.html", "downloaded_at": "2019-10-24 23:47:39.343859+00:00", "title": "NBA: Clippers open new LA rivalry with win over Lakers", "language": "en", "text": "The Los Angeles Lakers and the Los Angeles Clippers tipped-off NBA opening night on Tuesday. It was the big date after the official first game of the new season between the last champion Raptors and New Orleans in Toronto.\n\nKawhi dominates LeBron\n\nThe Clippers beat the Lakers 112-102. Kawhi Leonard looked every bit the player that just led Toronto to its first championship, scoring 30 points for the revamped Clippers while playing inspiring defense, at times really dominating his new Lakers rival LeBron James.\n\nJames controlled the ball for much of the night, but struggled offensively, scoring 18 points, while making just one of his five three-point attempts. The James-Davis duo so expected did not show its best, but Anthony Davis will be a double-digit guarantee all along the season.\n\nThe best team won\n\nLou Williams added 21 points, and Montrezl Harrell had 17 off the bench. The Lakers showed off their new 1-2 punch of James and Anthony Davis.\n\nDavis scored 25 points, making nine of 14 free throws, and James had 18. Danny Green outscored them both with 28 points, including seven three-pointers, in the highest-scoring debut by a Laker in franchise history. With this win, the Clippers start the season off right and will be maybe the LA/California team to beat. One thing is sure when Paul George goes back, and the franchisee will be very hard to play.\n\nThe Clippers will play against the Warriors tomorrow, whereas the Lakes will host Utah in two days.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. LeBron James NBA\n\nToronto as a champion\n\nToronto started the night with a ring ceremony. It ended with a 130-122 win in overtime, a victory over the New Orleans Pelicans that followed the unveiling of the first championship banner in the history of the N.B.A.’s lone Canadian franchise.\n\nOn opening night of the Raptors’ 25th season, Toronto took a comeback from a double-digit deficit, led by Pascal Siakam’s 34 points and 18 rebounds.\n\nStill, the Raptors ultimately managed to scratch out a win that preserved the evening’s celebratory feel. The last MVP Kawhi Leonard went to the Los Angeles Clippers, but the Raptors showed the collective force they had last season and yesterday to win over New Orleans.\n\nToronto will play the next game against Celtics in Boston on Friday, October 25.\n\nThe program of the week\n\nYesterday, October 22\n\nToronto Raptors – New Orleans Pelicans 130-122 OT\n\nLos Angeles Clippers – Los Angeles Lakers 112-102\n\nTonight, October 23\n\nPhiladelphie Sixers – Boston Celtics\n\nUtah Jazz – Oklahoma City Thunder\n\nThursday, October 24\n\nDetroit Pistons – Atlanta Hawks\n\nGolden State Warriors – Los Angeles Clippers\n\nFriday, October 25\n\nBoston Celtics – Toronto Raptors\n\nSacramento Kings – Portland Trail Blazers\n\nLos Angeles Lakers – Utah Jazz\n\nSaturday, October 26\n\nMilwaukee Bucks – Miami Heat\n\nDetroit Pistons – Philadelphie Sixers\n\nSunday, October 27", "description": "Kawhi Leonard won round one against LeBron in the first game of the West Conference.", "authors": ["Zeegee Cecilio", "Read More On The Same Topic Vincent Toussaint", "Champions League Records Cristiano Ronaldo Smashed", "Eminem'S Publisher Sues Spotify", "'The Masked Singer' Season", "Wednesday", "September Premiere Recap"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/23/os/b_1200x630/kawhi-dominates-lebron-on-first-nba-game-image-credit-marcio-jose-sanchezyoutube_2343793.jpg", "published_at": "2019-10-23"}