{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/ad-astra-is-one-of-the-best-space-movies-in-years", "downloaded_at": "2019-09-20 05:11:14.913327+00:00", "title": "Ad Astra Is One Of The Best Space Movies In Years", "language": "en", "text": "Image: Fox\n\nGorgeous spaceships flying deep into space to save planet Earth. Peril in an infinite abyss. Beautifully composed reflections off a helmet. We’ve seen it all before. Even the most futuristic space movies usually feel somewhat familiar and yet Ad Astra, the latest film from director James Grey, does not. It tells a seemingly simple story set in a realistic future with twists and turns that feel completely fresh, while never losing sight of its lead character or lofty themes. It’s one of the best space movies in years.\n\nBrad Pitt stars as Roy McBride, a very capable, very focused astronaut who is the son of the most famous astronaut of all time, Clifford McBride. Clifford (Tommy Lee Jones), however, went into space decades ago hoping to find intelligent life and never returned. His son followed in his path by becoming as a space explorer and, one day, circumstances dictate Roy has to go out and find out what happened to his father.\n\nAs written by Grey and Ethan Gross, Ad Astra takes place in the “near future.” A time when you can buy a ticket to go to the Moon, there’s a manned outpost on Mars, and a U.S. government agency called Space Command is tasked with handling all of that, while also looking for intelligent life. It’s a future that both feels attainable but also incredible thanks to how it’s presented. For example, we meet Roy on a space station exploring for aliens, which just so happens to be docked right above Earth’s atmosphere.\n\nThe Moon is habitable and a tourist attraction. It’s also a war zone with countries on Earth battling for land and pirates roaming the dust, pillaging for valuables. And instead of Mars or some unfathomable location all the way out in the infinity being the film’s ultimate goal, Ad Astra’s goal is Neptune. A planet that’s billions of miles away and yet still in our solar system. It’s far enough to feel new but close enough to feel logical, just like the film itself.\n\nSpace pirates! (Photo: Fox)\n\nWhen your space movie has action scenes featuring moon pirates, but tackles the search for extraterrestrial life in a matter-of-fact way, and also aspires to reach a planet most movies ignore, you begin to see how Ad Astra is unpredictable and propulsive. There are other, more spoilerly examples too of ways the film approaches space exploration in a very unexpected manner, such as what happens when Roy finds an abandoned ship or how he gets off Mars. So at almost every turn, the narrative does something you’ve probably ever thought of.\n\nThen, when it comes to the action set pieces themselves, the familiarly of them transposed into this genre is its own brand of surprising. Each action scene feels inspired by a classic movie. First Point Break, then Mad Max, then Indiana Jones, then 2001. And yet, to add yet another dash of originality, all of those high-octane scenes feel slightly understated because they’re seen through Roy’s point of view, which is always very demure and relaxed. The juxtaposition of wow set pieces with grounded elements and characters is yet another way Ad Astra distinguishes itself.\n\nA large part of the film’s tone is because of Roy himself. He’s a complex, captivating character and Pitt plays him with cool intensity. Roy is known for his inhuman cool under the direst of circumstances — a trait that holds for most of the movie. However, we also learn how his demeanour and mental state are driven by losing his father at a very young age and how his dedication to his job damaged his personal life. He’s a broken man on the inside, but calm, collected, and put together on the outside. A fascinating alchemy, just like the movie he’s in.\n\nWith the film being so focused on Roy though, Ad Astra never really explores any of its other characters. Liv Tyler has one or two lines of dialogue as Roy’s estranged wife. Ruth Negga is the head of the Mars base who is so interesting you want a spin-off movie entirely about her. But instead, she’s merely an intriguing cog in Roy’s story, as most of the other actors are too. You kind of wish there were additional rounded characters in the film but, ultimately, Roy’s complexities are more than enough.\n\nIf you like Brad Pitt monologuing, Ad Astra has you covered. (Photo: Fox)\n\nAnother small knock against the film is that Ad Astra offers very few clues of its ultimate message. From the very beginning of the film, it’s obvious Grey is interested in more than taking the audience on a deep space adventure. Roy’s omniscient narration, as well as his frequent psychology checks, make that clear. But throughout, those bigger thematic strands get lost in the dynamic narrative. By the time the film reaches its climax and Grey’s intentions get stated loud and clear, it’s almost as if they’ve been tacked on, even though they obviously weren’t.\n\nAnd though the balance of pathos, action, and story may not be perfect, once it all comes together you can’t stop thinking about it. Roy finds more than he’s expecting while looking for his father and the poignant final moments play out softly and quietly. No, those moments don’t quite measure up to the film’s wild action scenes but they make up for it by being manically thought-provoking, reaffirming, and filled with a mix of emotions that reflect back on the audience itself. Ad Astra is a film that is ultimately a tiny bit imbalanced but leaves us exhilarated and contemplative of how it all ties together and what it means to us.\n\nThese days, space movies are so common it’s shocking to see something like Ad Astra. All the familiar, well-explored elements are there, but they’re done in ways that show the potential of space adventure from a whole new angle.\n\nThe action is intense while still seeming possible. The characters are provocative and dictate the tone. And, ultimately, the film’s message is impactful. Ad Astra an excellent movie that’s likely to inspire and entertain.\n\nAd Astra is in Australian cinemas now.", "description": "Gorgeous spaceships flying deep into space to save planet Earth. Peril in an infinite abyss. Beautifully composed reflections off a helmet. We’ve seen it all before. Even the most futuristic space movies usually feel somewhat familiar and yet Ad Astra, the latest film from director James Grey, does not. It tells a...", "authors": ["David Tracy", "David Nield"], "top_image": "https://edge.alluremedia.com.au/m/g/2019/09/Screen-Shot-2019-09-20-at-9.36.22-am.png", "published_at": "2019-09-20"}