{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/bitcoin-price-flat-at-83k-as-moving-averages-indicators-flip-bearish", "downloaded_at": "2019-10-15 12:27:29.757996+00:00", "title": "Bitcoin Price Flat at $8.3K as Moving Averages Indicators Flip Bearish", "language": "en", "text": "Bitcoin price (BTC) continued its latest sideways trading pattern on Oct. 15 as analysts increasingly warned over likely short-term volatility.\n\nCryptocurrency market daily overview. Source: Coin360\n\nBitcoin clings to $8K support\n\nData from Coin360 showed BTC/USD remaining near $8,300 at press time, having fluctuated around that level over the past 24 hours.\n\nHighs during that period topped out at $8,390, the culmination of a build-up that reversed a previous downtrend at $8,240.\n\nBitcoin seven-day price chart. Source: Coin360\n\nSince a sudden dip took place on Sunday evening, Bitcoin has stayed quieter, trading in a narrow range above $8,000 support.\n\nThat range forms part of “choppy” conditions for BTC/USD, according to regulator Cointelegraph contributor Michaël van der Poppe.\n\nFor him, moving average (MA) prices are dictating the upper and lower bounds for the largest cryptocurrency this week. Specifically, it is “stuck between the 200-Day MA/EMA & 100-Week MA,” he said in private comments.\n\nFellow contributor filbfilb elaborated on likely price trajectory in the coming hours and days, erring on the side of a slide lower to test $8,000. He told subscribers of his Telegram channel:\n\n“Moving averages are crossed bearish on every major timeframe up to but not including the weekly.”\n\nVan der Poppe nonetheless remains unconcerned about the overall health of crypto markets. “It completely looks like a beartrap and overall doesn’t look bad at all if you check this whole year,” he summarized.\n\nAt current levels, Bitcoin is still up 120% versus the start of the year.\n\nAltcoin growth broadly fizzles\n\nAltcoins meanwhile slackened their march upwards, which characterized trading on Monday. The top twenty cryptocurrencies by market cap broadly failed to move, gaining or losing up to 2%.\n\nThe exception was Binance Coin (BNB), which benefited from a dedicated exchange-traded product launching on Swiss stock exchange SIX.\n\nEther (ETH), the largest altcoin by market cap, meanwhile gained 0.5% to trade at around $184.\n\nEther seven-day price chart. Source: Coin360\n\nThe overall cryptocurrency market cap, the “bear trap” described by van der Poppe, dropped slightly to below $226 billion, with Bitcoin’s share at 66.3%.", "description": "Analysts are anticipating a retest of $8K as Bitcoin price indicators turn bearish on multiple timeframes, according to analysts", "authors": ["William Suberg"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvYTg1MGY2MTE2ZmUwOTNmYTM1NDY2NDRjY2EyNmU3ZWQuanBn.jpg", "published_at": "2019-10-15"}