{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7548779/Chris-Hemsworth-Elsa-Pataky-appear-tense-line-domestic-flight.html", "downloaded_at": "2019-10-08 05:14:12.869990+00:00", "title": "Chris Hemsworth and Elsa Pataky appear tense as they line up for a domestic flight", "language": "en", "text": "They're usual mode of air travel is via private jet.\n\nBut Chris Hemsworth, 36, and his wife Elsa Pataky, 43, decided to ditch their VIP aircraft for a public aircraft on Monday as they travelled back home to Byron Bay after spending the weekend in Melbourne.\n\nThe A-lister duo were spotted looking rather tense as they dragged their luggage through Melbourne Airport's bustling terminal.\n\nShould have taken the private jet! Chris Hemsworth, 36, and his wife Elsa Pataky, 43, appeared tense as they lined up for a domestic flight back to Byron Bay after spending the weekend in Melbourne on Monday\n\nPerhaps attempting to avoid unwanted attention, the glamorous couple chose to walk through the building separately before finally meeting at the departure gate.\n\nMuscle-bound Chris showed off his physique in a simple black T-shirt that hugged his biceps and chest.\n\nHe completed his look with a pair of lack skinny jeans, matching canvas sneakers and a sporty wrist watch.\n\nIs everything OK? The A-lister duo were spotted looking rather tense as they dragged their luggage through Melbourne Airport's bustling terminal\n\nLow key departure: Perhaps attempting to avoid unwanted attention, the glamorous couple chose to walk through the building separately before finally meeting at the departure gate\n\nThor blimey! Muscle-bound Chris showed off his physique in a simple black T-shirt that hugged his biceps and chest\n\nMeanwhile, Elsa looked typically chic in a back-and-white striped long-sleeve top, black skinny jeans and heeled suede boots.\n\nTying her flaxen mane into a loose chignon, the Spanish actress completed her ensemble with a series of draped pendant necklaces, gold rings and a cross-body handbag.\n\nAt times, the couple attempted to fly under the radar by covering their famous faces with sunglasses.\n\nMonochromatic chic: He completed his look with a pair of lack skinny jeans, matching canvas sneakers and a sporty wrist watch\n\nChic: Meanwhile, Elsa looked typically chic in a back-and-white striped long-sleeve top\n\nBad news? At one stage, Elsa appeared to become frustrated with something that had popped up on her phone\n\nThe duo's solemn appearance was worlds away from how they appeared while watching the UFC at Marvel Stafdium in Melbourne on Sunday.\n\nThe pair appeared in high spirits on the day, with Chris looking particularly thrilled to be right by the ring.\n\nAt times, they were seen cosying up together as they eagerly watched on, cheering and smiling as they sat in the front row.\n\nGoing incognito? At times, the couple attempted to fly under the radar by covering their famous faces with sunglasses", "description": "They're usual mode of air travel is via private jet.", "authors": ["Monique Friedlander For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/05/19426648-0-image-a-103_1570508774462.jpg", "published_at": "2019-10-08"}