{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-usa-trump-maralago-china-case/trespassing-trial-of-chinese-woman-arrested-at-mar-a-lago-moves-to-jury-idUKKCN1VV1IH", "downloaded_at": "2019-09-11 07:33:02.034098+00:00", "title": "Trespassing trial of Chinese woman arrested at Mar-a-Lago moves to jury", "language": "en", "text": "FORT LAUDERDALE, Fla. (Reuters) - A Chinese woman accused of hoodwinking U.S. Secret Service agents to gain illegal entry to President Donald Trump’s Florida resort repeated her assertion that she “did nothing wrong” as her federal court trial was handed to a jury on Tuesday.\n\nFILE PHOTO: U.S. President Donald Trump's Mar-a-Lago Club is shown ahead of the arrival of Hurricane Dorian in Palm Beach, Florida, U.S., August 31, 2019. REUTERS/Joe Skipper/File Photo\n\nThe actions of Yujing Zhang, 33, at Trump’s private Mar-a-Lago club in March sparked concerns that she might have been a spy, although she was charged only with trespassing and making false statements. Prosecutors have offered no explanation in court for her motives.\n\nThey focussed instead on trying to prove she used deception to gain unlawful access to private property.\n\nZhang, who prosecutors said was carrying multiple electronic devices when arrested, insisted she was entitled to admission to Mar-a-Lago because of a contract for which she had paid $20,000 to attend a U.S.-China economic development event at the resort.\n\n“I made a contract to go to Mar-a-Lago and see the president and his family, and I do think it is the fact that I did nothing wrong,” she told jurors in halting English as she delivered a brief summation of her defense on the second day of her trial.\n\nZhang took the unusual approach of serving as her own lawyer for the proceedings, with a public defender assigned to her in court acting as a legal adviser.\n\n“I did not lie,” she said. “I went into Mar-a-Lago and had a visit, and that is what I wanted to say. Thank you.” She delivered a similarly succinct denial of wrongdoing in her opening statement on Monday.\n\nIn closing arguments for the government, Assistant U.S. Attorney Rolando Garcia countered that Zhang had been notified in advance by the company sponsoring the event that it had been cancelled and that she had demanded her money back. He cited electronic messages retrieved by the FBI from her cellphone.\n\nRolando also detailed how Zhang allegedly bluffed her way through Secret Service and resort security checkpoints onto the club grounds in Palm Beach, Florida, in part by passing herself off as the relative of an actual club member of the same name.\n\n“She was bound and determined to get on that property,” Rolando said. “She knew she wasn’t supposed to be there.”\n\n‘WEIRD AND STRANGE’\n\nThe trial in a federal courthouse in Fort Lauderdale was recessed for the day after U.S. District Judge Roy Altman instructed the 12-member jury. The panel was due to begin its deliberations on Wednesday morning.\n\nFront-desk Mar-a-Lago receptionist Ariela Grumaz testified earlier on Tuesday that Zhang “was acting very weird and strange” during her March 30 visit.\n\nThe Chinese national ignored a “no filming” sign and, using her cell phone, captured video of the ornate lobby as she strolled inside, raising suspicions and prompting Grumaz to urge security personnel to watch her.\n\nZhang, wearing an evening dress in the early afternoon, began texting on her cell phone and Grumaz asked her to leave. She calmly walked outside and was immediately surrounded by Secret Service agents.\n\n“That is what struck me. She was totally in control,” Grumaz told jurors.\n\nZhang, who at times appeared bewildered during her trial, faces up to six years in prison if convicted.\n\nShe had four cellphones, a laptop computer, an external hard drive device and a thumb drive in her possession at the time of her arrest, the Secret Service said in a court filing. Initial examination of the thumb drive determined it contained “malicious malware,” the Secret Service said.\n\nA subsequent search of Zhang’s Palm Beach hotel room reportedly uncovered a device meant to detect hidden cameras and nearly $8,000 in cash.\n\nTrump visited Mar-a-Lago the weekend Zhang was arrested but was playing golf during her time at the property.\n\nThe Chinese Foreign Ministry has said it had no knowledge of any connection between Zhang and the Beijing government and was leaving it to U.S. authorities to “handle the case in accordance with the law, fairly and appropriately.”", "description": "A Chinese woman accused of hoodwinking U.S. Secret Service agents to gain illegal entry to President Donald Trump's Florida resort repeated her assertion that she \"did nothing wrong\" as her federal court trial was handed to a jury on Tuesday.", "authors": ["Erik Bojnansky", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190910&t=2&i=1428431519&w=1200&r=LYNXNPEF8914Q", "published_at": "2019-09-11"}