{"pub": "thehill", "url": "https://thehill.com/homenews/campaign/464937-louisiana-gop-bring-in-big-names-to-block-democratic-governor", "downloaded_at": "2019-10-09 10:44:27.417661+00:00", "title": "Louisiana GOP bring in big names to block Democratic governor", "language": "en", "text": "Louisiana Republicans are calling in their party’s biggest surrogates in a last-minute push to stop Gov. John Bel Edwards (D) as he barrels toward reelection.\n\nVoters in Louisiana head to the polls Saturday for an all-party primary contest in which Edwards leads by a wide margin. If Edwards takes more than 50 percent of the vote, he would win the race outright; if not, he would face one of two Republicans vying for second place in a Nov. 16 runoff.\n\nIn hopes of avoiding what would be an embarrassing loss in one of the most conservative states in the country, Republicans are mounting a last-minute push to excite their base and dampen Edwards’s numbers.\n\nADVERTISEMENT\n\nVice President Pence appeared with the two leading Republicans, Rep. Ralph Abraham (R) and businessman Eddie Rispone, in New Orleans last weekend. Donald Trump Jr. Donald (Don) John TrumpKey Republicans split with Trump on Biden investigation push Ocasio-Cortez says woman who suggested 'eating babies' was Trump supporter Ocasio-Cortez hits Trump after he calls her a 'wack job' MORE campaigned in Lafayette on Monday. And President Trump Donald John TrumpPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Trump directed Perry, State Dept. officials to talk to Giuliani on Ukraine: report Murkowski warns against rushing to conclusions on Trump impeachment MORE will hold a rally Friday in Lake Charles. The Republican Governors Association and a super PAC funded by a prominent Louisiana donor have aired ads blasting Edwards for his handling of a sexual harassment scandal involving one of his former aides.\n\nBut Republicans have been unable to coalesce behind either Abraham or Rispone, and polls show Edwards — one of the last Southern Democrats to hold statewide office — on the brink of winning outright.\n\n“It’s really amazing how a state that’s so red would be so enamored with a Democrat,” state Rep. Larry Bagley (R) said in an interview. “They’re pulling out the stops to try to hurt John Bel’s numbers.”\n\nA survey released Monday by the Louisiana-based firm JMC Analytics and Polling shows Edwards leading with 47 percent, ahead of Rispone’s 22 percent and Abraham’s 19 percent. A Mason-Dixon survey released Monday showed Edwards at 45 percent, Rispone at 22 percent and Abraham at 17 percent.\n\nRispone, a wealthy businessman making his first run for public office, has spent more than $11 million of his own money introducing himself to voters. He has positioned himself as an outsider capable of reforming state government.\n\nAbraham, serving his third term in Congress, has seen his support slip in recent weeks after Rispone launched a broadside against him. Abraham has struggled to raise enough money to stay on air; the most recent fundraising reports showed Rispone outspending Abraham eight times over.\n\nADVERTISEMENT\n\n“They both have strong conservative values, and they’re both get-it-done kind of guys,” said state Sen. Beth Mizell (R), who is unaligned in the race. “I’m counting on it going to a runoff.”\n\nIf the December runoff is necessary, history would argue for the Republican: No governor has ever won reelection when they have been forced to compete in a runoff.\n\n“For some middle-of-the-road Republicans, John Bel will be their first choice. They like that he works,” said state Rep. Patrick Connick (R). “If Edwards doesn’t take it in the first round outright, the last Republican candidate standing will be the favorite.”\n\nEven with history against him, the most recent polls show Edwards would start a runoff in the lead. The Mason-Dixon survey shows Edwards leading Rispone by 9 points and Abraham by 15 points, though Republican voters would likely coalesce behind their nominee after the primary.\n\nEdwards has spent the last days of the election season running positive spots showcasing support from women voters, and from Republicans, while defending his handling of the sexual harassment scandal in which the aide was fired.\n\n“He brought members of both parties together to make the hard decisions,” state Sen. Dan “Blade” Morrish (R) says in one of Edwards’s advertisements.\n\nSeveral state legislators told The Hill they had seen few signs of the race beyond their television screens. But there are hints that Louisiana voters are excited to show up: More than 370,000 people cast ballots during the early voting period, an increase of 100,000 ballots from the 2015 race.\n\nThe early voting population may represent a concerning trend for Edwards: Of those who cast a ballot early, about 155,000 were Republicans, 60,000 more than turned out four years ago. The early electorate is whiter than it was four years ago, and more male.\n\nBut like other Southern states where ancestral Democrats regularly vote Republican, and like some ancestrally Republican suburbs that voted Democratic in the 2018 midterm elections, partisan affiliations are not as strong an indication of how voters are voting this year, said John Couvillon, the pollster behind JMC Analytics.\n\nEdwards has shown an ability to make inroads with Republican voters, especially Catholics who care about his anti-abortion stance; a recent advertisement his campaign paid for shows a photo of Edwards meeting Pope Francis Pope FrancisLouisiana GOP bring in big names to block Democratic governor Pompeo, Pope Francis urge protections of religious freedom The Hill's Morning Report — Trump takes aim at whistleblower MORE.\n\nAt the same time, white voters in rural areas have increasingly aligned themselves with Republican candidates, and especially President Trump, even if they don’t bother to change their voter registration.\n\nThe specter of impeachment, thrown into the mix just weeks before voters head to the polls, threatens to upend a race that Edwards has tried to keep focused on Louisiana-specific issues.\n\n“What I think is happening is you have a turbocharged political atmosphere just like you did last year during the Kavanaugh hearings,” Couvillon said. “The tricky balance that a Southern Democrat has to make, particularly in a state like Louisiana where blacks are more than half of the Democratic Party base, is you’re trying to energize a base while at the same time getting enough votes from independents and Republicans.”", "description": "Louisiana Republicans are calling in their party’s biggest surrogates in a last-minute push to stop Gov. John Bel Edwards (D) as he barrels toward reelection.", "authors": [], "top_image": "https://thehill.com/sites/default/files/edwardsjohnbel_071816getty_lead.jpg", "published_at": "2019-10-09"}