{"pub": "reuters", "url": "https://reuters.com/article/us-awards-emmys/game-of-thrones-fleabag-take-top-emmy-honors-on-night-of-upsets-idUSKBN1W70FF", "downloaded_at": "2019-09-23 04:27:02.997718+00:00", "title": "'Game of Thrones,' 'Fleabag' take top Emmy honors on night of upsets", "language": "en", "text": "LOS ANGELES (Reuters) - Medieval drama “Game of Thrones” closed its run with a fourth Emmy award for best drama series while British comedy “Fleabag” was the upset winner for best comedy series on Sunday on a night that rewarded newcomers over old favorites.\n\n71st Primetime Emmy Awards - Photo Room – Los Angeles, California, U.S., September 22, 2019 - George R.R. Martin (C) and the cast and crew of Game of Thrones poses backstage with their award for Outstanding Drama Series. REUTERS/Monica Almeida\n\nBilly Porter, the star of LGBTQ series “Pose,” became the first openly gay black man to win a best dramatic actor Emmy, while British newcomer Jodie Comer took the Emmy for her lead actress role as a psychotic assassin in the quirky BBC America drama “Killing Eve.”\n\n“I am so overjoyed to have lived long enough to see this day,” said Porter, 50, crowning a standout year in which he made waves on red carpets at the Oscars and the Met Gala for his gender-fluid outfits.\n\nThe Emmys are Hollywood’s top honors in television, and the night belonged to Phoebe Waller-Bridge, the star and creator of Amazon Studios’ “Fleabag” who also created “Killing Eve.”\n\nWaller-Bridge took the trophy for best comedy actress, beating out six-time “Veep” actress winner Julia Louis-Dreyfus as well as last year’s Emmy champ Rachel Brosnahan for “The Marvelous Mrs. Maisel.” Waller-Bridge also won an Emmy for comedy writing.\n\n“This is just getting ridiculous!,” Waller-Bridge said as she accepted the comedy series Emmy.\n\n“It’s really wonderful to know, and reassuring, that a dirty, pervy, angry, messed-up woman can make it to the Emmys,” Waller-Bridge added.\n\nAlready the most-awarded series in Emmy history with 38 wins, HBO’s “Game of Thrones” went into Sunday’s awards show as the clear front runner, despite a fan uproar over the conclusion of the series.\n\nIt emerged from the Emmys with a leading 12 wins, with Soviet nuclear accident drama “Chernobyl” taking 10 and “The Marvelous Mrs. Maisel” winning eight, including for supporting actors Tony Shalhoub and Alex Borstein.\n\nRelated Coverage Factbox: Key winners at the 2019 Emmy awards\n\n‘FIRE AND ICE’\n\nAmong networks, HBO won 34 Emmys overall, followed by Netflix with 27.\n\n“These last 10 years have been the best years of our lives,” “Game of Thrones” co-creator David Benioff said.\n\n“I can’t believe we finished it, I can’t believe we did it. We did it all together and it’s over, and we shall never see your like again,” he added.\n\nPeter Dinklage was the only one of the nine nominated “Game of Thrones” actors to win, for his supporting role as Tyrion Lannister.\n\n“We literally walked through fire and ice for you, and I would do it all again in a heartbeat,” Dinklage said, thanking Benioff and co-creator D.B. Weiss.\n\nIn the closely contested limited series category, the Television Academy spread its honors among “Chernobyl,” wrenching social justice drama “When They See Us” and “Fosse/Verdon,” starring Michelle Williams as Broadway singer and dancer Gwen Verdon.\n\nWilliams used her acceptance speech to thank the FX network and make an impassioned plea for pay equity in Hollywood.\n\n“They (FX) understood that when you put value into a person, it empowers that person to get in touch with their inherent value, and where do they put that value? They put it into their work,” Williams said.\n\nSlideshow (30 Images)\n\nNewcomer Jharrel Jerome was named best actor for “When They See Us,” the Netflix dramatization of the men known as the Central Park Five who were wrongly accused and imprisoned for rape in 1980s New York.\n\nJerome dedicated his honor to “the men we know as the exonerated five,” and the five men, seated in the audiences, stood and pumped their fists.\n\nOther first time Emmy winners included Julia Garner for drug trafficking thriller “Ozark,” British actor Ben Whishaw for “A Very English Scandal,” and Jesse Armstrong, the creator of media conglomerate family drama “Succession.”", "description": "Medieval drama \"Game of Thrones\" closed its run with a fourth Emmy award for best drama series while British comedy \"Fleabag\" was the upset winner for best comedy series on Sunday on a night that rewarded newcomers over old favorites.", "authors": ["Jill Serjeant", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1432821235&w=1200&r=LYNXMPEF8M073", "published_at": "2019-09-23"}