{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/6/sheriff-country-singer-kylie-rae-harris-caused-dea", "downloaded_at": "2019-09-07 02:19:56.005536+00:00", "title": "Sheriff: Country singer Kylie Rae Harris caused deadly crash", "language": "en", "text": "TAOS, N.M. (AP) - Country singer Kylie Rae Harris caused a three-vehicle crash in northern New Mexico that left her and a 16-year-old girl dead, authorities said.\n\nTaos County Sheriff Jerry Hogrefe told the Taos News that investigators believe Harris caused Wednesday’s crash and that speed appeared to be a contributing factor when she clipped the back of another vehicle, sending her into oncoming traffic. She then crashed head-on into an SUV driven by Maria Elena Cruz.\n\nHarris and the Taos High School student died at the scene. The responding emergency crew included the teen’s father, Pedro Cruz, the deputy chief of the San Cristobal Volunteer Fire Department.\n\n“At this time, I will say with most certainty that Miss Cruz was an innocent victim of this senseless crash caused by Ms. Harris,” the sheriff said.\n\nAuthorities also have said evidence at the crash scene indicated alcohol may have been involved, though they declined to provide details. They were awaiting a toxicology report from the coroner’s office.\n\nThe Taos News reported that Harris, 30, had a prior DWI conviction in Collin County, Texas, in 2017 and had been ordered to install an ignition interlock device on her vehicle, according to court records.\n\nA single mother, Harris was in Taos to perform at an annual music festival. She had posted on social media earlier that day that she was low on gas and 36 miles (58 kilometers) from the nearest gas station. “Dear baby Jesus please don’t let me get stranded in NM,” she tweeted.\n\nHarris‘ publicist, Sarah Frost, said Thursday the musician’s family and friends were heartbroken over her death. Harris released a self-titled album earlier this year and had spent the summer traveling to shows throughout Texas.\n\nStudents and faculty at Taos High were in shock after learning that Cruz was killed in the crash. The sophomore was remembered as beautiful, kind, hardworking, intelligent and inspirational.\n\nTaos County Fire Manager Mike Cordova said in an email that the Cruz family was reeling from her death. The community of San Cristobal was holding a fundraising dinner Friday to help the family with funeral costs.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Country singer Kylie Rae Harris caused a three-vehicle crash in northern New Mexico that left her and a 16-year-old girl dead, authorities said.", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-09-06"}