{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7597335/Crown-Princess-Mette-Marit-Norway-details-battle-living-chronic-pulmonary-fibrosis.html", "downloaded_at": "2019-10-22 13:55:14.103808+00:00", "title": "Crown Princess Mette-Marit of Norway details the battle of living with chronic pulmonary fibrosis", "language": "en", "text": "Crown Princess Mette-Marit of Norway, who was diagnosed with chronic pulmonary fibrosis last October, has spoken candidly about how the disease has changed her life.\n\nThe 46-year-old told German TV that the life-limiting condition causes her to become 'exhausted faster than before'.\n\nThe disease which has no known cure, causes breathing problems as scar tissue forms on the lungs, and has forced her to slow down her hectic schedule of royal duties.\n\nThe Norwegian royal was diagnosed with chronic pulmonary fibrosis, just months after revealing that she was suffering from debilitating vertigo.\n\nCrown Princess Mette-Marit of Norway, 46, (pictured) spoke about living with chronic pulmonary fibrosis in an interview during her Literature Train in Germany\n\nAccording to Royal Central, Crown Princess Mette-Marit is using medication to aid her in keeping track of the disease.\n\nShe reportedly knew about her rare lung disease 'for quite some time', before going public.\n\n'I can decide more about my everyday life and I realise how good it is to me. I can just go for a walk and have more time to read, life has slowed down,' she told an interviewer.\n\nSpeaking at the Literature Train, she added that she finds it difficult to talk about her condition.\n\n'I am well aware of my state of health, but I do not want it to get so much attention from outside, which is one of the reasons why I like my \"new little life\" so much.'\n\nThe Princess spoke of continuing life as normal, at the time of her diagnosis.\n\nThe mother-of-three (pictured with husband, Crown Prince Haakon) told how the lung disease has caused her life to slow down\n\nWHAT IS IDIOPATHIC PULMONARY FIBROSIS? Idiopathic pulmonary fibrosis (IPF) is a condition in which the lungs become scarred and breathing becomes increasingly difficult. It's not clear what causes it, but it usually affects people around 70-75 years of age and is rare in people under 50. Several treatments can help reduce the rate at which IPF gets worse, but there's currently no treatment that can stop or reverse the scarring of the lungs. The symptoms of IPF tend to develop gradually and get slowly worse over time. Symptoms can include: shortness of breath\n\na persistent dry cough\n\ntiredness\n\nloss of appetite and weight loss\n\nrounded and swollen fingertips (clubbed fingers) There is no cure and it's very difficult to predict how long someone with IPF will survive at the time of diagnosis. Regular monitoring over time can indicate whether it's getting worse quickly or slowly. Source: NHS\n\nThe Royal Court released a statement when the Princess was diagnosed, revealing that she is continually being monitored by medical professionals.\n\nA statement from the Royal Court said: 'The Crown Princess has undergone extensive investigations related to her health and an unusual variant of fibrosis has been detected in the lungs, according to the Crown Princess's doctor, Professor Kristian Bjøro at the National Hospital.\n\n'It is not yet clear whether the pulmonary disease is linked to a more extensive autoimmune disease process or if there are other causes that underlie the lung changes.'\n\nThe princess added: 'Although such a diagnosis in times will limit my life, I'm glad that the disease has been discovered so early.\n\n'My goal is still to work and participate in the official programme as much as possible.'\n\nMette-Marit (pictured at the Frankfurt Book Fair) was suffering from Benign Paroxysmal Positional Vertigo just months before she was diagnosed with chronic pulmonary fibrosis\n\nCrown Princess Mette-Marit was diagnosed with chronic pulmonary fibrosis, just months after revealing that she was suffering from Benign Paroxysmal Positional Vertigo (BPPV), which can cause a loss of balance, dizziness and nausea.\n\nThe Royal is a particularly rare case as chronic pulmonary fibrosis typically occurs in people aged between 70-75.\n\nAccording to the NHS, 'before the availability of treatments like pirfenidone and nintedanib, about half of people with IPF lived at least 3 years from their diagnosis. Around 1 in 5 survived for more than 5 years'.\n\nThe mother-of-three appeared in good spirits at the Literature Train despite her health concerns, as she posed for photographs alongside her husband Crown Prince Haakon.\n\nCrown Princess Mette-Marit married into the Norway royal family in 2001.\n\nThe royal (pictured with husband, Crown Prince Haakon) who married into the royal family in 2001, has revealed plans to continue with life as normal", "description": "Crown Princess Mette-Marit, 46, spoke to German TV about her battle with chronic pulmonary fibrosis, which has forced her to slow down her hectic schedule of royal duties.", "authors": ["Latoya Gayle For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/18/20001780-0-image-a-61_1571680169379.jpg", "published_at": "2019-10-22"}