{"pub": "theverge", "url": "https://theverge.com/2019/8/13/20758599/idealfuture-dragonfly-futurefon-indiegogo-crowdfunding-phone-scam-fraud-case", "downloaded_at": "2019-10-05 14:08:04.039041+00:00", "title": "The crowdfunded phone of the future was a multimillion-dollar scam", "language": "en", "text": "In 2014, Jeffrey Tschiltsch opened an email from Indiegogo and saw the future of computing. The email showed something called the “Dragonfly Futurefön,” a kind of computer-phone hybrid. The Futurefön’s page showed a sleek, palm-sized touchscreen that slotted into a laptop dock, then folded flat and flipped open again, revealing a second screen and a full-sized laptop keyboard. It could run both Windows and Android, and its creator, a startup called IdealFuture, promised to replace your phone, laptop, and tablet at an incredible price of $799. Dubious but intrigued, Tschiltsch put down a $200 deposit.\n\nFive years later, Tschiltsch still wouldn’t have a Futurefön. Instead, he’d be sitting in an Illinois courthouse testifying at the behest of the FBI, which claimed the device was the last step in a decade-long fraud operation that cost victims nearly $6 million. “I always thought it was ambitious,” Tschiltsch says now. “It didn’t occur to me that the guy had just taken the money.”\n\nTschiltsch is just one of many angry Indiegogo backers who say Futurefön creator Jeff Batio strung them along with lies, excuses, and faked product updates. But the backers aren’t just angry with Batio. They’re frustrated by how easily a scammer could flourish in the high-risk world of gadget crowdfunding — and how poorly Indiegogo was equipped to deal with it.\n\nAccording to its crowdfunding campaign, the Dragonfly Futurefön was a convertible, dual-screened notebook meant to dramatically simplify computing. Its “Slingshot” section was a 7-inch Android phone with a stylus, but that was only one part of the device. That phone plugged into a split-hinged keyboard base, which was also equipped with a slide-out touchpad, a second 7-inch display, a dockable Bluetooth headset, and a separate battery and processor.\n\nThe device was modular: you could use both pieces separately, or you could plug the phone into the base and get a dual-display laptop that looked like two tiny netbooks. (An optional upgrade added “Win-Droid” capability, which let the laptop section run either Windows or Android.) The combined effect was simultaneously cute and futuristic, especially with an eye-catching clip-on cover. Batio — in a quote attributed to himself on the Indiegogo page — declared it as nothing less than “a mobile metamorphosis.”\n\nFuturefön backer Rebecca Pillinger was blown away by the renderings. “This just sounded like an amazing product,” she says. She’d never owned a smartphone, her tablet had recently broken, and she loved her dual-screen desktop setup at work. Wrapping all three devices into one $800 package sounded fantastic.\n\nFans of straightforward computing might find a three-in-one transforming dual-screen laptop ridiculous. But in 2014, lots of major electronics companies were chasing similar ideas. In 2011, Motorola had released a full-sized laptop shell for its Atrix Android phone called the Lapdock. The 2013 Razer Edge was a high-powered laptop that doubled as a handheld gaming console. The 2012 Asus PadFone was a 4-inch phone that fit completely inside of a 10-inch tablet that paired with a laptop-style keyboard and an electronic stylus, which was also a wireless headset. The same year as the Futurefön campaign, Asus announced an even more ambitious five-in-one Android / Windows phone / laptop / tablet at Computex, although the idea never made it to market.\n\nA convertible laptop seemed downright staid when you could earn $23,000 with a mind-reading headset for dogs\n\nCrowdfunded gadgets, meanwhile, were taking the world by storm. Facebook had just acquired the crowdfunded Oculus Rift virtual reality headset for $2 billion. More than 85,000 people had backed a surprisingly good smartwatch called the Pebble. A company had raised $13 million to build a tricked-out, high-tech cooler. If you could earn $23,000 by promising a mind-reading headset for dogs, selling an $800 convertible laptop was downright staid.\n\nThe Futurefön wasn’t a sure bet — but to many backers, it seemed like a calculated risk. “This will probably never see the light of day, but it’s too cool not to back for $200,” thought Tschiltsch. Pillinger figured she could only afford the Futurefön at its early-bird Indiegogo price, not its full retail cost. “The worst thing I thought could happen was that they would have set out with the honest intention of producing the phone, but procrastinate and not get around to putting the work in,” she says.\n\nThe Indiegogo campaign was designed to allay those doubts. IdealFuture portrayed Batio as an entrepreneur who’d been building exotic personal computing hardware for decades. Its Indiegogo page touted a “multi-display transforming laptop” he’d unveiled in 2002, called the Xentex Flip-Pad Voyager. Social media VP Bridget Hogan claimed in an interview that IdealFuture already had a US-based manufacturer, allowing it to ship the Futurefön within six months. After Tschiltsch tweeted doubts about the project, he remembers, someone from IdealFuture reached out to say they had “everything lined up.”\n\nBatio didn’t claim to have vast technical knowledge, but he made up for it with vision. His personal website described him as a “dynamic futurist” — a term he’d coined for “someone who doesn’t ‘see’ the future based on studying the trends being created by others, but instead is someone who helps to create the future.” Other dynamic futurists included Thomas Edison and Bill Gates, and an Indiegogo promotional video compared IdealFuture to Rosa Parks and the Tiananmen Square protesters.\n\nA closer look at Batio and IdealFuture might have raised several red flags. IdealFuture had posted reams of 3D models but virtually no pictures of actual hardware — a practice that Kickstarter had banned two years earlier, but Indiegogo had not. The Dragonfly Futurefön’s specs seemed almost impossibly good; its 7-inch phablet weighed precisely as much as the far smaller Samsung Galaxy S5 phone, for instance. And while Batio had been working on experimental computers for decades, he hadn’t actually shipped any — including a laptop he’d already promised Indiegogo backers in an earlier campaign. His ventures had left a string of disgruntled investors and contractors, some of which might have been ready to talk if anyone called them. But the Futurefön raised hundreds of thousands of dollars before anybody picked up the trail.\n\nJeff Batio’s computing dreams started in the late ‘90s when he was struck by the idea of a super foldable, split-screened laptop. Batio filed several patents for his unique design, and around 2000, he founded a company called Xentex to build it.\n\nThe resulting Flip-Pad Voyager was created with help from legendary design firm Frog. It was essentially a dual-monitor portable desktop, folding once like a huge traditional laptop, then again across a split-screen and keyboard for more convenient traveling. Unlike the Futurefön, it had no smartphone component, but it still had its share of weird features. In addition to the dual-screen setup, you could use the two panels as a single giant display with a seam down the middle, or you could swivel one to face away from you — in case, for example, you needed to show somebody else a spreadsheet or slideshow.\n\nThe Voyager received positive (if someone bemused) press coverage when it was announced, even making it to the cover of PC Magazine in 2002. The writeup, which is still online, calls the Flip-Pad Voyager “the mother of all desktop replacement notebooks,” adding “we’ve never seen anything like it.”\n\nBut the device never made it into stores. In Batio’s telling, the Voyager was almost ready to ship when its Korean manufacturing partner went bankrupt, effectively killing the product. But not everyone agrees with that story. A lawsuit from angry investors accused Xentex of hiding serious technical problems that doomed the project. Batio wasn’t a defendant in the lawsuit, but plaintiffs alleged that he’d spent company money on houses and luxury cars, making the company’s financial challenges even harder to overcome.\n\nBatio denied the claims and called the lawsuit a transparent attempt to seize control of the company. He noted that two of the plaintiffs were charged with trying to fraudulently sell Xentex stock, among other offenses. Even so, Xentex dissolved, and the Voyager was never seen again — except for one semi-functional prototype that appeared on eBay in 2008.\n\nMikal Greaves, who led Frog’s engineering team during the years Xentex was active, believes Batio really had a functional computer. “Jeff had money, Frog, and a contract manufacturer, who got him very close to a shippable product,” he says. That didn’t mean the Voyager was commercially viable. The market for a 12-pound, nearly $5,000 portable desktop was always going to be limited. But in Greaves’ opinion, it wasn’t a scam. “Crowdfunding Futurefön,” he says, was “another thing altogether.”\n\nBatio bounced back from Xentex’s failure almost immediately, founding a new company called Armada and launching the IdealFuture brand in the early 2010s. His Voyager design morphed into the Radian desktop docking station and the IF Convertible, a transforming laptop that’s nearly identical to the Futurefön. IdealFuture brought the IF Convertible to Indiegogo in 2013, where it earned $18,000 from only 33 people. But a year later, the company claimed to have “redesigned the entire device,” and it launched its Futurefön campaign to far greater success.\n\nThree people who worked with IdealFuture describe being initially fascinated but quickly disillusioned by the project — and losing thousands of dollars in the process. Realtor and musician Ryan Farhood says he invested $10,000 in IdealFuture and worked on a song for the company. (The jingle was sadly lost to history.) A friend had vouched for Batio, and Farhood was impressed enough to share the Futurefön design with a connection at chip-making giant Qualcomm. But when Qualcomm was unenthusiastic and Farhood started asking hard questions about the project, he claims, his relationship with Batio soured. “Everything was pure pose. There were no prototypes. There was no working, functional model,” says Farhood. “Too bad I’d already deposited the money.”\n\nWeb designer Allison Sugahara met Batio through a business partner who’d gone to school with Batio’s “VP of Social Media” Bridget Hogan. (Three sources describe Hogan as Batio’s only long-term employee.) “He was really compelling and got us really excited for the project,” she says, and Sugahara stayed up all weekend building the site on a tough deadline. But when she tried to collect the $2,000 fee, Batio claimed he was strapped for cash. The phone number she’d been given stopped working, and her company was left with a $150 first payment and a certificate for 50,000 shares of IdealFuture stock.\n\nA friend of Sugahara, who asked to be identified only as Chris, ended up in a similar situation. He’d toured Batio’s apartment building for a crowdfunded film he was shooting, and Batio had offered him much-needed work making videos for the first Indiegogo campaign. “When he said something, he said it to the point where you were like — wow, is it here right now? This sounds amazing,” says Chris. But Batio kept putting off his invoices, and when the second campaign rolled around, Chris finally gave up on getting paid.\n\nFuturefön backers in 2014 seemingly didn’t look too closely into IdealFuture’s background, and neither did reporters. Where the IF Convertible had gotten little press, the Futurefön attracted attention from several tech sites — even CNBC, which featured the device in a crowdfunding “face off” article. The coverage was skeptical but generally polite, taking the company’s claims in good faith while noting that IdealFuture was probably aiming way too high.\n\nBut there was one place where the Futurefön wasn’t just a cool oddity: r/ShittyKickstarters, a Reddit forum for discussing shady crowdfunding campaigns. “The ‘Dragonfly’, a fake device that will never work, is nearing $500,000!” a member posted in late 2014. “Ending today. Recap in comments. I’m dying inside.”\n\nOther members gleefully vivisected IdealFuture’s product. “It’s like they found a list of recent things that are ‘hot’ in technology and just put them into a blender,” wrote one person. Others tried to pin down the backers’ psychology: “Technology is magic. This sound magic-er-er. So they throw money at it.” A few simply cracked jokes about Batio’s inspirational quotes. “Any fool can make something complicated. It is hard to make something simple,” one pronouncement claimed. A Shitty Kickstarters poster quipped back: “Now I understand the vision behind the two-tablet-split-keyboard-bluetooth-docking-sort-of-Android-sort-of-Windows-sort-of-laptop/tablet/phone device.”\n\n“To make a device like that would be like making a new car line, like making a Tesla. Or like making an iPad.”\n\nThe community was hooked. “From the start, you could tell that it was completely wrong,” says one member, who goes by the username Otidder. “It looked tacky, the specifications were completely overblown. Like, there was no way they were going to be able to sell this thing at the price that they said they would.” Google searches pulled up Xentex’s legal drama and the stalled IF Convertible campaign, cementing skeptics’ conviction that the Futurefön would never ship. A member even discovered that somebody else had built an almost identical-looking laptop called the Dragonfly back in 2009.\n\nThe original Dragonfly’s creator could have warned backers that IdealFuture wouldn’t deliver. Like Batio, MIT graduate Ed Bullister started filing laptop patents as a side project in the ‘90s. (According to Bullister, the two have never met, and Bullister only learned about the Futurefön when a Redditor contacted him.) He eventually produced a mechanical mock-up to show manufacturers and investors.\n\nBut the more people Bullister spoke to, the less feasible a custom-built folding laptop seemed. “Everything has to be new. The display is a non-standard size. The keyboard is probably the easiest thing — but that has to be split in half, and you’ve got a lot of wires that have to go across the hinges,” he tells The Verge. “It was a huge project.” One adviser said it would cost $100 million to bring to market.\n\nPlenty of crowdfunding companies set unrealistic goals or hit intractable technical snags. But Bullister doesn’t think a campaign like IdealFuture’s, with its massive promises and comparatively tiny budget, could possibly be launched in good faith. “To make a device like that would be like making a new car line, like making a Tesla. Or like making an iPad,” he says. “It’s beyond ‘fake it till you make it.’ It’s like, I’m either so clueless that I shouldn’t be in the business, or — I just think this is a fraud.”\n\nDespite all this, IdealFuture cruised past its minuscule $10,000 goal, taking in nearly $650,000 by the campaign’s December end date and continuing to raise money through Indiegogo’s brand-new InDemand feature. IdealFuture posted flurries of updates at first, boasting about hiring a new engineering team and working on a functional prototype. But slowly, backers like Tschiltsch started to lose faith. “They were really active on their Indiegogo campaign. They were always posting updates and showing stuff,” he says. “But it was all mockups all the time.”\n\nMembers of r/ShittyKickstarters, who had created a dedicated subreddit for the Futurefön, started welcoming newly minted skeptics. In mid-2016, they finally found what seemed like clear evidence of fraud.\n\nIdealFuture had posted a video of Bridget Hogan walking around Los Gatos, California, with the latest Futurefön mock-up. Critics pored over the footage, convinced it was a trick. Somebody spotted a 2014 date on one screenshot and called it out, but Batio convincingly shut the claim down, saying that his filmmaker had just pulled an old image from Google. Then, some remarkably determined Redditors zoomed in on two chalkboard signs in the background of the shots. They cross-referenced the promotional deals with announcements on Facebook, only to find matching posts from 2014 — before the campaign had even closed.\n\nBy that point, many backers had already given up on the Futurefön. “At first, it seemed like a project that got away from them,” says Leland Babitch, one of the backers. “But as it went on, the updates really had this tone of a coverup — you know, sort of giving just enough to keep people going and feel like they weren’t being cheated out of their money. … And then they just stopped.” IdealFuture posted one last update in July 2016, claiming to have found a manufacturing partner. Then, the page went dark forever.\n\n“The updates really had this tone of a coverup.”\n\nAt the time, Tschiltsch figured IdealFuture was just the latest of several crowdfunding startups whose dreams had been too big for reality. By the summer of 2016, Kickstarter and Indiegogo gadgets seemed like clearly risky propositions. The impossibly thin CST-01 watch had proven virtually impossible to manufacture. The unique YotaPhone smartphone saw “unforeseen delays” and initially failed to ship in the US. The Coolest Cooler, once hailed as a Kickstarter success story, had been dubbed one of crowdfunding’s biggest disasters after serious delays. “I just sort of wrote it off,” says Tschiltsch. He’d almost forgotten about the project by 2018 — when an FBI agent called him up.\n\nThe agent told Tschiltsch that “there was this case they’d been working on — that it was getting ready to go to trial,” and he started asking about the Futurefön. What had Tschiltsch expected to get when he backed the campaign? Why had he done it? What did he think about IdealFuture’s long string of updates? After Tschiltsch answered the questions, the agent invited him to testify in court.\n\nIdealFuture, it turned out, hadn’t just disappeared. Batio had been indicted on fraud charges that spanned 13 years, from Armada’s early days to the last Indiegogo updates. And the alleged total profits were far higher than even IdealFuture’s biggest skeptics imagined: in addition to the $725,000 he’d gotten for the Futurefön, he’d supposedly collected $5 million from Armada investors, a fundraising venture that now seemed like fraud.\n\n“Mr. Batio worked consistently and against the odds to realize his products.”\n\nIt was a genuinely surprising development. The government had cracked down on crowdfunding campaigns before, starting in 2015, when the Federal Trade Commission went after the creator of a board game called The Doom That Came to Atlantic City. But “caveat emptor” was still a central principle of crowdfunding — and the line between a scam and an honest failure could be difficult to find.\n\nThe case finally went to trial a year later. Tschiltsch testified, as did Farhood and several other backers and former associates. (Hogan, who many Futurefön skeptics also considered a scammer, did not appear or testify at the trial.) A jury convicted Batio of 12 mail and wire fraud counts, each carrying a maximum sentence of 20 years in prison. His sentencing is scheduled for September.\n\nBatio has strongly disputed the allegations against him, saying that Armada was close to shipping a product and IdealFuture was on track to deliver the Futurefön. He asked for a new trial after the conviction, claiming that the jury had refused to discuss vital information and that the court had denied a critical witness request. The government, he said, was attempting to “criminalize failure” — presenting normal startup setbacks as evidence of fraud. “The government misunderstood and misrepresented the product development process,” reads the filing. “Mr. Batio worked consistently and against the odds to realize his products.”\n\nToday, some of IdealFuture’s backers acknowledge that they were looking at the Futurefön through rose-colored glasses. “I was quite new and naïve regarding crowdfunding,” says backer Aurélien Cornil, who believed in IdealFuture’s good intentions until the very end. “I thought I could trust the people posting projects and that Indiegogo checked the projects it hosted.” But they’re also angry at Indiegogo. While Batio clearly didn’t need crowdfunding to raise millions of dollars, it helped him reach a huge audience in a short period of time. And during that time, numerous people seemingly reached out with complaints — only to be ignored or put off.\n\nOne Redditor claimed to have flagged the Futurefön back in 2014, saying Indiegogo’s support staff had promised to review it. In reality, Indiegogo let IdealFuture keep raising money until a month after the final update in 2016, even as angry backers berated the platform in comments. “I felt bad for some of the backers, because they were clearly in way over their heads,” says Otidder. “Indiegogo really needs to shoulder some of the responsibility here — because they’re the ones giving a platform to these people.” A detailed 2016 exposé of the Futurefön emphasized that crowdfunding scams were rare but called them an “existential threat” to the system. “If Indiegogo sweeps this under the rug, they are sending a signal to the market that fraudulent campaigns will never have any consequences,” wrote the author.\n\nPillinger says she doesn’t expect Indiegogo to police every campaign for potential fraud, but the platform’s promotional email felt like a stamp of approval. “I think the reason it didn’t occur to me that the Futurefön might be a scam was precisely that it was promoted by Indiegogo,” says Pillinger. “I would have exercised more skepticism if I had come across it just searching their site, or promoted by a stranger on Twitter, for example.” Indiegogo even tweeted a fresh ad for the Futurefön in 2016 while IdealFuture was fielding constant inquiries about its failure to deliver.\n\nIndiegogo declined to be interviewed for this story, but a spokesperson says campaigns are currently evaluated by its trust team before being promoted. “We have evolved and learned from our past campaigns to improve and protect our backer community,” she wrote.\n\n“Somebody has an idea, and all that person needs is media.”\n\nBut the problems with Futurefön may have been bigger than crowdfunding platforms. Tech media rewards interesting concepts all the time — even when they almost certainly won’t work, like a bracelet that projects a working smartphone on your forearm or the aforementioned dog mind-reading kit. In that context, the Futurefön hype just didn’t seem that strange. “Somebody has an idea, and all that person needs is media,” says Farhood. “Like, hey, look at this cool video! I know it’s not a real working prototype. But look how cool this cool video is!” Even if sites don’t endorse a product, they’re helping it spread — and a few people might decide it’s worth throwing a few (or a few hundred) dollars at it.\n\nHardware crowdfunding is still a huge market. After the early exuberance and the inevitable fallout, Kickstarter and Indiegogo are trying to make the whole process less risky, even if that means dramatically changing how their services work. But for some of the Futurefön’s backers, these sites’ sheen is long gone. “I kind of soured on it now,” says Tschiltsch, who also backed the Pebble smartwatch, the Coolest Cooler, and the failed CST-01. “I think it’s hard to vet, with the information you’re given on these websites, for any kind of real complex hardware project.” He’s still backing campaigns, but he sticks to more achievable creative projects like animated horror film To Your Last Death, which is currently set for a US premiere next month.\n\nBabitch says that when he realized IdealFuture was a fraud and not just a failure, it just didn’t bother him that much. “I also, probably at the same time, realized that a lot of the stuff I have gotten really hasn’t been all that interesting,” he says. While a device like the Futurefön might be exotic, mainstream products like the Microsoft Surface — a convertible tablet that can functionally replace a laptop — are a lot more usable.\n\nBut he concedes that getting scammed didn’t keep him away from crowdfunding. “I probably still haven’t learned my lesson. I like technology. I like cool things,” he says. “I like having gadgets.”", "description": "The IdealFuture Dragonfly Futurefön seemed too good to be true. Then Indiegogo backers lost $700,000 — and its creator, Jeff Batio, was charged with fraud.", "authors": ["Adi Robertson", "Aug", "Photo Illustration"], "top_image": "https://cdn.vox-cdn.com/thumbor/IGTAq5LYHb3oMfV2uOD4NDn-hC8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18956400/acastrO_190801_3571_futureFon_0001.jpg", "published_at": "2019-08-13"}