{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/11/WS5da08a50a310cf3e3556fff2.html", "downloaded_at": "2019-10-11 19:37:53.509188+00:00", "title": "NATO chief urges Turkey to show restraint in military operation in northern Syria", "language": "en", "text": "Xinhua | Updated: 2019-10-11 21:57\n\nTurkish Foreign Minister Mevlut Cavusoglu attends a news conference in Ankara, Turkey, April 1, 2019. [Photo/Agencies]\n\nISTANBUL -- Turkish Foreign Minister Mevlut Cavusoglu on Friday asked NATO to show \"clear solidarity\" with his country in its fight against \"terrorism\" and \"threats\" in northern Syria, while the bloc's chief called for Turkey to act \"with restraint.\"\n\n\"It's not enough to say we understand Turkey's legitimate concerns. We want to see clear solidarity,\" Cavusoglu said at a joint press conference with NATO Secretary-General Jens Stoltenberg in Istanbul.\n\nTurkey launched the Operation Peace Spring on Wednesday into northern Syria against the Kurdish militia known as the People's Protection Units (YPG), with a view to eliminating what it calls \"terrorism\" along its border and establishing a safe zone to \"facilitate the return of Syrian refugees\" being sheltered on Turkish land.\n\nAnkara sees the YPG as the Syrian offshoot of the Kurdistan Workers' Party outlawed for its armed struggle against the Turkish state over the past three decades.\n\nSpeaking of the ongoing Turkish operation, Cavusoglu said the move aims to put an end to the threat of terrorism that lies beyond Turkey's border and it is \"crucial to the security of the alliance\" as well since the Turkish border also constitutes the NATO's southeastern border.\n\nWhile saying that no other NATO ally has suffered more from terror attacks, instability, violence and turmoil and hosted so many refugees as Turkey does, Stoltenberg also urged Ankara to act \"with restraint\" in its operation in northern Syria, raising the alliance's concerns about the Islamic State terrorists being held in prisons there.\n\n\"Daesh is still a threat. Daesh is still a common enemy, and therefore we need to make sure that the gains we have made are not jeopardized,\" Stoltenberg underlined, using the Arabic name of the Islamic State.\n\nCavusoglu said the militant group targeted Turkey the most, and it would be out of the question to release its prisoners.\n\n\"It is our duty, and we are determined and sensitive to hold them accountable for what they have done,\" he said. \"We will sustain our fight against Daesh and other terrorist organizations decisively.\"\n\nTurkey suffered a spate of deadly attacks over the years blamed on the Islamic State, in which more than 300 people were killed.", "description": "", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/11/5da08a50a310cf3e97a0bf4c.jpeg", "published_at": "2019-10-11"}