{"pub": "townhall", "url": "https://townhall.com/columnists/brentbozellandtimgraham/2019/09/25/abortion-horrors-buried-by-the-press-n2553637", "downloaded_at": "2019-09-25 04:36:20.616592+00:00", "title": "Abortion Horrors Buried By the Press", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nThe grotesque nature of abortion and the industry that profits from it is routinely hidden by the national press beneath a gauzy layer of rhetorical blather about \"a woman's right to choose.\" It's drummed into the public daily: Abortion is a precious civil right and a sacrament of feminism, never a death, let alone a murder.\n\nLook no further than the discovery of more than 2,200 dead unborn babies in the Illinois home of a recently deceased abortion doctor named Ulrich Klopfer.\n\nThey told us Dr. Kermit Gosnell was one of a kind for his creepy storage of dead-baby parts in jars. It turns out he was a piker. Klopfer stored each \"fetus\" in an individual plastic bag full of medical-grade preservative and put it in a box -- totaling more than 70 boxes in his garage, from the floor to the ceiling.\n\nThe Indiana attorney general reports that records indicate these unborn babies lost their lives between 2000 and 2002, when Dr. Klopfer operated three abortion clinics in Fort Wayne, Gary and South Bend, Indiana. One man told Fox News that his mother, who is Klopfer's neighbor, always wondered what was in all those boxes.\n\nOnly Fox News cared about this revolting story. CNN has given it about a minute on air one weekend day, and The New York Times' initial story was put deep inside the paper, on page A-22. But ABC, CBS, NBC, MSNBC, NPR and PBS? These same networks that wailed for hours about the inhumanity of illegal migrant \"kids in cages\" had hardly any interest in something a thousandfold more horrific.\n\nAt least USA Today's editorial page editor asked us to evaluate the coverage and noted the lack of interest. The Washington Examiner pestered presidential candidate Pete Buttigieg for days to respond, as the doctor performed his grisly business in the town where Buttigieg serves as mayor.\n\nAfter Fox News' Tucker Carlson made the same point, Buttigieg put out a statement. \"Like everyone, I find that news out of Illinois extremely disturbing, and I think it's important that that be fully investigated,\" he said. \"I also hope that it doesn't get caught up in politics at a time when women need access to health care.\"\n\n\"(E)xtremely disturbing\"? That's all? He couldn't even condemn it? It really wasn't that disturbing, was it?\n\nWomen's \"access to health care.\" Orwell, call your office. Remind Buttigieg there was a garage full of \"women's access.\" Not even this angle stirred the networks to action.\n\nThe same trend could be seen in the 2015 Center for Medical Progress video exposes of Planned Parenthood. The networks could barely be moved. Now the leftist government of California is prosecuting the center's David Daleiden and Sandra Merritt for having secretly recorded footage of this murder-for-hire conglomerate. When the target is Food Lion or General Motors, the networks call it \"investigative journalism\" and champion \"the public's right to know.\" But when it's the abortion industry, especially Planned Parenthood?\n\nThen-Attorney General Kamala Harris called the recordings a crime and had the California Department of Justice seize their tapes and other evidence. Attorney General Xavier Becerra is prosecuting Daleiden and Merritt, and after Daleiden was scheduled to appear on Carlson's program, he sought a gag order to restrict what Daleiden is allowed to say about his case in public.\n\nWhere are the crusading Brian Stelters and their lectures about the First Amendment?\n\nNewsworthy developments are spilling out of this trial. National Review noted that in a preliminary hearing, California obstetrician-gynecologist and \"longtime abortionist\" Forrest Smith told the court that the Planned Parenthood executives in the footage \"likely illegally altered abortion procedures, causing babies to be born alive and putting the mothers in danger of complications in their quest for more intact fetal body parts.\"\n\nThe \"news\" networks couldn't care less. They're currently stoking a national panic about teenagers caught up in a \"vaping epidemic\" or championing children who profess they are doomed to die in the next 12 years due to global warming.\n\nL. Brent Bozell III is the president of the Media Research Center. Tim Graham is director of media analysis at the Media Research Center and executive editor of the blog NewsBusters.org.", "description": "The grotesque nature of abortion and the industry that profits .09/25/2019 0:32:06AM EST.", "authors": ["Brent Bozell", "Tim Graham", "Katie Pavlich", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/257/69d2a9fc-86a6-4396-bcbb-67d630cb84bf.jpg", "published_at": "2019-09-25"}