{"pub": "nytimes", "url": "https://nytimes.com/2019/09/26/opinion/papua-riots-indonesia-monkey.html", "downloaded_at": "2019-09-26 07:52:03.848507+00:00", "title": "Opinion | Indonesia Has a Papua Problem", "language": "en", "text": "JAKARTA , Indonesia — In an ideal Indonesia, a Papuan man would live in Jakarta and become a civil servant. He would marry a Padang woman from western Indonesia. They would open a small restaurant and hire a young Sundanese woman. Their customers would be a mix of Javanese, Betawi and other ethnic groups.\n\nThis was the scenario of a TV sitcom, “Minus Family,” that aired a few years ago, for which I was a head writer. The show tried to tap Indonesia’s obsession with diversity and harmony, which is encapsulated in the state motto, “We are all different but we are one.” An obsession with diversity and harmony that, in reality, often ends in violence.\n\nAs Indonesians were celebrating Independence Day on Aug. 17, a photo surfaced online, like pus leaking from a wound, and was widely circulated. It showed a Papuan man at a protest in Surabaya, a city on eastern Java, holding up a poster with the words, “If we are monkeys, then don’t force monkeys to fly The Red and White.” A few days before, an Indonesian national flag (red and white) in front of a dormitory for Papuan students had been torn down. The police, the army and some nationalist groups blamed the students, and a mob stormed the building. In a video recording of the scene, the crowd can be heard shouting, “Monkey.”\n\nSupreme irony: Just then a film adaptation of Pramoedya Ananta Toer’s novel “Bumi Manusia” (“This Earth of Mankind”) was playing in theaters throughout the country. The story, set in Dutch colonial times, features a young Javanese protagonist who is mocked by his Dutch teacher and nicknamed “Minke” — Monkey. In the book, the name Minke comes to symbolize how a colonial power subjugated the Javanese indigenous consciousness. Today, a young Papuan holds up a poster with the word “monkey” to denounce the oppression of Papuans under Indonesian rule.", "description": "A racial slur. Riots. And the real character of a popular president revealed.", "authors": ["Eka Kurniawan"], "top_image": "https://static01.nyt.com/images/2019/09/26/opinion/26kurniawan/26kurniawan-facebookJumbo.jpg", "published_at": "2019-09-26"}