{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/the-latest-wallabies-change-10-for-georgia", "downloaded_at": "2019-10-08 09:37:06.651653+00:00", "title": "The Latest: Wales' Moriarty keen to reacquaint with Fiji", "language": "en", "text": "TOKYO (AP) - The Latest on Day 19 at the Rugby World Cup (all times local):\n\n5 p.m.\n\nHaving faced them as an impressionable teen, Wales back-rower Ross Moriarty is determined to make a big impression against Fiji in Wednesday’s Pool D match.\n\nMoriarty said it was a “bit an eye opener” as an 18-year-old playing for Gloucester’s A team when it faced the flying Fijians seven years ago.\n\n“To be on this stage now makes it even bigger and I’m excited to get out on the pitch, get a start, and show everyone what I can do,” said Moriarty, who starts his first game at this World Cup after being on the bench in wins against Georgia and two-time champion Australia. “Obviously I’ve been disappointed not to get the starts, but nonetheless this is a World Cup and it’s great to be involved and to come off the bench and get some minutes to contribute.”\n\nThe battle with Fiji’s imposing forwards is expected to have a large bearing on the outcome at the Oita Dome, where a win will move Wales into the quarterfinals.\n\n“We know it’s going to be tough. We’ve been working hard in the last week and we’ve done our analysis,” said Moriarty, who is set to win his 35th test cap. “We know they have some great individuals, but so do we and we’re just going to make sure we put everything out there and do the job.”\n\n___\n\n4 p.m.\n\nNew Zealand loose forward Ardie Savea is having issues with his goggles but will keep trying to play with them.\n\nSavea became the first player to wear goggles in a Rugby World Cup last Wednesday against Canada. He wore them for only minutes though because the strap broke.\n\nHe didn’t wear them when he started against Namibia on Sunday because in the warmup they fogged up in the humidity.\n\nSavea says he will persist with them because he needs to. The vision in his left eye is failing - his sight is already blurry - and he needs the goggles to protect his right eye so he can reduce the risk of going totally blind.\n\n“I’ll keep training in them, and if they’re working, they’re working,” he says. “But it’s hard with the conditions. If they’re not working on game day, I’ll park it up, but if they are, sweet.”\n\n___\n\n3:40 p.m.\n\nFrance must iron out its inconsistencies at the Rugby World Cup before facing England in their table-topping Pool C decider on Saturday.\n\nThat’s the view of scrumhalf Antoine Dupont, who has highlighted where the French lineup has made its most errors in the three group games so far.\n\n“There are a few things to look at,” Dupont said. “The problems persist. We made handling errors and the set-pieces were not always reliable.”\n\nFrance led comfortably against Argentina, the United States, and Tonga before getting reeled back in each game.\n\n“We missed the control that would have allowed us to be more comfortable, but we were never in real trouble or very worried,” Dupont said. “Our defense was strong. We are still in a good place overall.”\n\nEngland tops the group by two points because it leads France 3-1 in bonus points.\n\nWhen the sides last met, England routed France 44-8 in the Six Nations.\n\nBut Dupont hopes the fact France is already qualified takes some of the stress away, and the Tricolors will therefore play more freely on Saturday at Yokohama.\n\n“We can measure ourselves against one of the best teams in the world without having to worry about qualification,” Dupont said. “It’s always a good test. After the pool phase there is no good draw, there are only big teams left.”\n\n___\n\n3 p.m.\n\nAustralia has made 10 changes to the starting lineup that beat Uruguay last weekend for its last Pool D match against Georgia on Friday in Shizuoka.\n\nA win will secure the Wallabies a quarterfinals spot.\n\nFlanker Jack Dempsey is the only player to retain his place in the forwards. David Pocock is captain.\n\nHalves Nic White and Matt To’omua, wing Jordan Petaia and fullback Kurtley Beale also return. To’omua switches from inside center to flyhalf and Petaia moves from left to right wing.\n\nWhite and To’omua have never previously played together at 9 and 10 for Australia. They are the 11th halves combination for the Wallabies since the 2015 Rugby World Cup.\n\nThe front row of Scott Sio, Tolu Latu, and Sekope Kepu started together only once previously, last November in the 37-18 loss to England.\n\nAustralia: Kurtley Beale, Jordan Petaia, James O’Connor, Samu Kerevi, Marika Koroibete, Matt To’omua, Nic White; Isi Naisarani, David Pocock (captain), Jack Dempsey, Rory Arnold, Izack Rodda, Sekope Kepu, Tolu Latu, Scott Sio. Reserves: Jordan Uelese, James Slipper, Taniela Tupou, Adam Coleman, Michael Hooper, Will Genia, Christian Lealiifano, Dane Haylett-Petty.\n\n___\n\n2:45 p.m.\n\nTwo-time champion South Africa seeks a bonus-point win at the expense of Canada to be certain of advancing to the quarterfinals in the only Rugby World Cup match on Tuesday.\n\nThe teams meet indoors in Kobe’s Misaki Stadium, and both teams are wary of controlling possession. All three previous games in Kobe - England-United States, Scotland-Samoa, Ireland-Russia - have suffered from more than 30 handling errors each in humid conditions. But the Tier One side has won each time.\n\nThe Springboks have rebounded from their opening loss to New Zealand by beating Namibia 57-3 and 14-man Italy 49-3, and expect their second-string team to manage Canada.\n\nThe Canadians have lost to Italy 48-7 and to New Zealand 63-0, and are building to a last Pool B match against Namibia this weekend.\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Latest on Day 19 at the Rugby World Cup (all times local):", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-10-08"}