{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/erroll-spence-junior-rushed-hospital-serious-car-accident-10895656", "downloaded_at": "2019-10-10 15:06:00.047990+00:00", "title": "Errol Spence Junior rushed to hospital after serious car accident", "language": "en", "text": "Errol Spence Junior is the current IBF and WBC welterweight world champion (Picture: Getty)\n\nWelterweight world champion Errol Spence Junior is said to be in a serious condition following a car crash in Dallas.\n\nThe 29-year-old American was reported to have been thrown from his white Ferrari after an incident took place shortly before 3.00am local time.\n\nSpence’s vehicle is said to have been the only car involved in the accident and he was taken to hospital after, according to police, it flipped on multiple occasions having been travelling at high speed.\n\nErrol Spence Junior’s Ferrari was badly damaged following the accident (Picture: CBS11 News)\n\nA Dallas Police statement said: ‘At 2:53am a Ferrari traveling at a high rate of speed northbound in the 500 S. Riverfront Blvd.\n\n‘The Ferrari veered left over the center median onto the southbound lanes and flipped multiple times ejecting the driver who was not wearing a sea belt.’\n\nAdvertisement\n\nAdvertisement\n\nSpence Junior has won all of his 26 professional fights, 21 by knockout, and maintained his unbeaten record following an impressive win over fellow American Shawn Porter last month.\n\nHe is considered to be among the best pound for pound fighters in the world at present and currently holds both the IBF and WBC welterweight belts.\n\nMORE: Eddie Hearn praises Tyson Fury’s WWE appearance but can’t see Anthony Joshua following suit\n\nMORE: Oleksandr Usyk prefers Deontay Wilder showdown to fights against Anthony Joshua or Tyson Fury\n\nMore to follow…", "description": "Welterweight world champion Errol Spence Junior is said to be in a serious condition following a car crash in Dallas. The 29-year-old American was reported to have been thrown from...", "authors": ["Metro Sport Reporter"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1178455724_1570712540.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-10"}