{"pub": "japantoday", "url": "https://japantoday.com/category/features/health/cbd-oil-a-guide-to-the-hemp-extract-that%E2%80%99s-taking-over-the-wellness-world", "downloaded_at": "2019-10-20 23:24:01.336441+00:00", "title": "CBD oil: A guide to the hemp extract that’s taking over the wellness world", "language": "en", "text": "By Lucy Dayman\n\nIf you’ve been tuning into any lifestyle blogs, magazines, or pop by health food shops of late, there’s a very likely chance that you’ve stumbled upon the acronym, CBD. That’s because it’s taking the wellness world by storm.\n\nToday you can get lattes, chocolates, oils, and lotions infused with the stuff, and you’ll find users online regularly championing the benefits of this hemp extract.\n\nWhile already popular in the States and Europe, it’s now slowly but surely creeping into the Japanese market. But like anything that comes from the hemp plant, there’s still a bit of ambiguity about what CBD is, what it does, and its legal status here, in a nation with very strict anti-marijuana laws. So in an effort to clear up any ambiguities, we’ve put together a crash course on CBD with a specific focus on Japan.\n\nWhat is CBD?\n\nWithout getting too scientific, CBD (cannabidiol) is a compound found in the flower of the cannabis plant. No matter your attitude to the plant, it’s hard to deny that this famous green flower has a bevy of medicinal properties. These properties have been utilized by cultures across the globe since the discovery of its powers.\n\nCBD is one of the hundreds of phytocannabinoids, or often simply referred to as a cannabinoid, produced by the plant. A cannabinoid is a compound that reacts to the human body’s endocannabinoid system (ECS), a cell-signaling system that experts are still trying to learn more about. In general, the ECS plays a significant role in the regulation of many of our crucial human functions, including sleep, stress, appetite, mood, memory, and even reproduction and fertility.\n\nWhile a cannabinoid can be manufactured artificially, CBD is naturally occurring, and it’s a safe, non-addictive substance. It’s closely linked to THC, the compound in marijuana that makes you high. Both compounds have been found to have relaxation and mood-elevating effects (from higher levels of dopamine), though those effects can vary from person to person. Although similar to THC, an article by the Healthline states that studies confirm CBD reacts to the human body in a very different way to THC, and will never leave a consumer feeling high or stoned.\n\nWhat is it used for?\n\nClick here to read more.\n\nExternal Link\n\nhttps://savvytokyo.com/\n\n© Savvy Tokyo", "description": "If you’ve been tuning into any lifestyle blogs, magazines, or pop by health food shops of late, there’s a very likely chance that you’ve stumbled upon the acronym, CBD. That’s because it’s taking the wellness world by storm.  Today you can get lattes, chocolates, oils, and lotions infused with the…", "authors": ["Savvy Tokyo"], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/b8/ad/7e566b586b19d87438a158fc7c1f53242e30/Screen%20Shot%202019-10-16%20at%2013.52.44.png", "published_at": "2019-10-20"}