{"pub": "metro", "url": "https://metro.co.uk/2019/10/05/ryan-reynolds-blake-lively-secretly-welcomed-third-child-two-months-ago-10865426", "downloaded_at": "2019-10-05 12:35:55.272699+00:00", "title": "Ryan Reynolds and Blake Lively ‘secretly welcomed third child two months ago’", "language": "en", "text": "Ryan Reynolds and Blake Lively ‘welcome third child’ (Picture: Getty)\n\nBlake Lively is thought to have given birth to her third child with Ryan Reynolds ‘two months ago’.\n\nThe Gossip Girl star, 32, and the Deadpool actor – who share daughters James and Inez – reportedly welcomed a baby earlier this year.\n\nAn insider told Us Weekly their new arrival is ‘about two months old,’ but no other information is known.\n\nWhile the lovebirds are yet to speak publicly about the little one, Ryan, 42, has been active on social media – posting a snap of Aviation Gin on his Instagram story.\n\nBlake confirmed her pregnancy earlier this year, unveiling her baby bump on the red carpet at the Pokemon Detective Pikachu premiere, back in May.\n\nAnd she previously explained how much she wanted a big family, telling Allure: ‘I’d love 30 [children] if I could.’\n\nBlake revealed her pregnancy at the Pokemon Detective Pikachu premiere (Picture: FilmMagic)\n\nShe also opened up about her parenting style with the little ones, admitting she was just ‘figuring out what the heck’ to do.\n\nAdvertisement\n\nAdvertisement\n\n‘I think it’s hard to slap labels on any parents because it’s just so tricky,’ the Serena Van Der Woodsen actress told People.\n\n‘It’s like every moment you’re figuring out what the heck you’re doing. You think, “Ooh, should I be more strict, or should I be more I don’t know, emotional?” Or whatever it is.\n\n‘If anybody knows how to be a parent, I feel like grandparents really know how to be parents. But parents, you just figure it out as you go. So, I wouldn’t put a label on it.’\n\nBlake and Ryan are also parents to daughters James and Inez (Picture: Rex)\n\nRyan also explained himself and Blake make sure they spend enough time as a family, and don’t film projects at the same time.\n\n‘Blake and I don’t do movies at the same time. If she is doing a movie in Thailand and I am doing a movie in Vancouver we would just never see each other,’ he said.\n\n‘We operate as a unit, and that works really well for us.\n\n‘The kids stay with us, and the family stays together, and that is where home is.\n\n‘So if we are in Spain or Utah or New York, as long as we are together, we’re home.’\n\nAdvertisement\n\nAdvertisement\n\nFamily goals or what?\n\nMetro.co.uk has contacted reps for Blake and Ryan for a comment.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: The Circle reveals game-changing ratings twist as new arrival Paddy Smyth joins the show\n\nMORE: Elton John relives emotional moment he prayed to see kids again after nearly dying from prostate cancer", "description": "Blake Lively is thought to have given birth to her third child with Ryan Reynolds ‘two months ago’", "authors": ["Rishma Dosani"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/09/GettyImages-1031029008_1570257100.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-05"}