{"pub": "businessinsider", "url": "https://businessinsider.com/lunchclub-pitch-deck-series-a-andreessen-horowitz-led-2019-9?r=rr", "downloaded_at": "2019-09-18 23:28:56.031895+00:00", "title": "The founders of Lunchclub, a startup for making better professional connections, used this pitchdeck to raise $4 million in funding", "language": "en", "text": "We've all heard the old adage: \"It's not what you know, it's who you know.\" And in many ways, that idea still holds true today.\n\nBut as Lunchclub cofounder and CTO Scott Wu told Business Insider in a recent interview, he quickly learned when entering the workforce that something wasn't quite right about the networking events he was attending.\n\n\"It felt so inefficient and artificial,\" Wu said. \"It's like you're going through this transactional affair more for the purposes of growing your network and less so about really getting to know people.\"\n\nWu and his cofounder Vladimir Novakovski — who previously worked together at the investment management software company, Addepar — teamed up to try and change the way networking typically happens.\n\nWith Lunchclub, instead of cocktail parties with numerous attendees and nametags, users can set-up one-on-one coffee or lunch meetings with people who are looking to accomplish similar goals. If someone is looking for career advice, they'll be paired with someone who can offer them mentorship. If someone just wants to brainstorm their crazy ideas, they'll pair them with someone who wants to do the same.\n\nWu said that he and Novakovski actually found their third co-founder — Hayley Leibson — through Lunchclub. They were looking for someone to run operations at the company and Leibson was looking to join an early startup with major upside. Leibson was already a Lunchclub power user at the time, and so the fit was just right.\n\n\"We found that not only was she super, super amazing at building communities, but also that she was excited to join something new,\" Wu said of Leibson, who previously founded an online network of female founders called, Women Founders Community.\n\nRead more: The pitch decks that helped hot startups raise millions\n\nThe first time CTO told us that the real \"secret sauce\" behind Lunchclub is the data his team uses to make connections. That data is comprised of public information from social networks (namely, Twitter and Linkedin), information users provide at setup regarding their goals for using Lunchclub, and user feedback from the coffee or lunch meeting they have already attended. Wu said that early on, the team used to make these connections manually, but that now the process is totally automated.\n\nEach Monday, a user will receive an email that asks them how many Lunchclub meetings they want that week, which times work best, and which areas of the city would be most convenient to meet. Twenty-four hours later, they receive their matches with a personalized introduction.\n\nWu told us that the decision for Lunchclub itself to make the matches for users is an \"important feature\" of the product.\n\n\"There's no swiping aspect. You receive the match from Lunchclub and you're expected to take that meeting,\" Wu said. \"I think that's a very important feature of it. A lot of the swiping culture I think has led to much more transactional and much less genuine [interactions] and a lot of the networks that build around that, you can see the effect.\"\n\nNotably, Lunchclub is meant to foster professional relationships, Wu said, and so using the service for dating purposes isn't supported. Also, today, there is no cost to use Lunchclub. In the future, Wu said his team will consider offering an enterprise service where companies pay for connections to qualified candidates.\n\nCurrently, Lunchclub is available in seven major cities, including San Francisco, New York, LA, and London. And recently, to help grow its team and expand its services even further, the San Francisco-based startup raised a $4 million seed funding round led by the Silicon Valley powerhouse VC firm, Andreessen Horowitz. In total, Lunchclub has raised over $5 million from investors.\n\nHere's the pitch deck that helped Lunchclub raise millions to help build the professional networking platform of the future (some sensitive data has been redacted):", "description": "Using data inputs, Lunchclub matches users who are looking for career advice, looking for their next employee, or just looking to brainstorm a crazy idea.", "authors": ["Nick Bastone"], "top_image": "https://amp.businessinsider.com/images/5d8065112e22af3c607f8df3-2732-1366.jpg", "published_at": "2019-09-18"}