{"pub": "yahoo", "url": "https://news.yahoo.com/steeda-tuned-2019-ford-mustang-230602444.html", "downloaded_at": "2019-10-22 15:16:50.409866+00:00", "title": "Steeda-Tuned 2019 Ford Mustang Bullitt Packs 775 HP", "language": "en", "text": "The $97,000 price tag might be a steal for this car!\n\nShortly after Ford launched the 2019 Ford Mustang Bullitt, Steeda announced plans for a tuned version of this car to pay homage to Steve McQueen: the limited-production Steve McQueen Edition. Steeda only built 300 of these tuned Mustangs for the 2019 model year, and this particular 2019 Ford Mustang Bullitt Steve McQueen Edition, no. 31 of 300, is up for sale through Imperial Motorcars listed for $97,000.\n\nSteeda-Tuned 2019 Ford Mustang Bullitt Packs 775 HP More\n\nIncluded in that price is the base price of the 2019 Mustang Bullitt that starts at $46,595, and that doesn't event factor in any options. This car is at least equipped with the available Recaro racing bucket seats, but this was probably fully loaded from the dealership. From there, Steeda got a hold of it adding almost $41,000 worth of performance upgrades. Factor in the limited production of the Steve McQueen Edition and this car's super-low miles (just 75 miles on the odometer), and this car is a no-brainer if you're looking for a car that is destined to be an instant classic.\n\nThe 2019 Mustang Bullitt already increased power output (480 hp) over the base Mustang GT (460 hp), but Steeda bumped things up even more giving the Steve McQueen Edition a base tune of 550 horsepower as well as beefed-up suspension components for improved handling. If that's not enough, there's also an optional Whipple Supercharger upgrade that squeezes 775 horses from this screaming V8, and to handle the increased power output, Steeda also fitted this car with severe-duty half shafts and a belt assembly. The seller of this car also opted for the stylish Alcantara steering wheel bringing the list of upgrades to $40,875.\n\nAll-in, you're getting an incredible performance that is collectible right out of the gate.\n\nIf you're interested in this rare 2019 Ford Mustang Bullitt Steve McQueen Edition or any of the other cool and collectible cars being sold by Imperial Motorcars, click HERE for their contact info.\n\nMore From Imperial Motorcars...\n\n\n\n\n\n\n\n\n\n", "description": "The $97,000 price tag might be a steal for this car!Shortly after Ford launched the 2019 Ford Mustang Bullitt, Steeda announced plans for a tuned version of this car to pay homage to Steve McQueen: the limited-production Steve McQueen Edition. Steeda only built 300 of these tuned Mustangs for the 2019", "authors": ["Jeffrey N. Ross"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3abwwTG6ZXmYXo9gZMW57w--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en_us/autoclassics_668/a8923876ff18a488d3f4a93bd094fa04", "published_at": "2019-10-21"}