{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/article-7509727/Inter-AC-Milan-unveil-two-shortlisted-designs-proposed-new-stadium.html", "downloaded_at": "2019-10-05 08:53:50.005446+00:00", "title": "Inter and AC Milan unveil the two shortlisted designs for their proposed new stadium", "language": "en", "text": "Inter Milan and AC Milan have unveiled the two shortlisted designs for their proposed new stadium, which would see the demolition of the Stadio Giuseppe Meazza - commonly referred to as San Siro.\n\nThe two rival clubs play their home games at the San Siro - which was built in 1925 and is the largest stadium in Italy with a capacity of 80,000 - and would share the new venue as well.\n\nThe two architectural firms revealed their plans at a presentation at Milan's Politecnico university, with Manica-Cmr Sportium showcasing its 'The Rings of Milano' design and Populous presenting its 'The Cathedral' project.\n\nTwo architectural firms have submitted designs for the new Inter Milan/AC Milan stadium\n\nAmerican firm Populous presented its 'The Cathedral' project at Milan's Politecnico university\n\n'We believe we have a very exciting project and one which we believe will be a shining light for the city of Milan and also for Italian football,' Milan chief executive Ivan Gazidis said.\n\n'It's about bringing two clubs to where they belong, but also bringing Italian football back to where it belongs. We're absolutely convinced we can do that.\n\n'The top clubs around the world are built on solid foundations and the first foundation is a world class stadium.'\n\nManica-Cmr Sportium showcasing its futuristic 'The Rings of Milano' design\n\nManica have promised to keep surrounding areas as public green space for fans to enjoy\n\nThe city council will decide whether to give the green light to one of the designs following a collaborative consultation with the clubs, fans and residents.\n\nAlternatively, it could choose to renovate the existing stadium, which would cost an estimated 510 million euros compared to the 650 million euros required for a new stadium.\n\nHowever, the clubs insisted that is an 'unfeasible' option for a number of reasons, not least because it would lead to a loss of revenue as the two clubs would have to play their home matches in another city during the construction works.\n\nThe San Siro is set to be bulldozed with a new stadium built in its place for AC and Inter Milan\n\nA new stadium would take approximately three years to build while renovation works would have an estimated duration of five to six years, with any delays potentially putting at risk its planned use for the opening ceremony of the 2026 Winter Olympics.\n\nBoth projects would bring the fans closer to the field than the existing stadium and both also give a nod to the old stadium.", "description": "The two rival clubs both play their home games at the San Siro - which was built in 1925 and is the largest stadium in Italy with a capacity of 80,000 - and would share the new venue as well.", "authors": ["Ap Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/26/22/18985670-0-image-a-2_1569534615072.jpg", "published_at": "2019-09-26"}