{"pub": "nymag", "title": "About Great British Baking Show’s Paul Hollywood’s Instagram", "url": "https://thecut.com/2019/08/paul-hollywood-instagram-great-british-baking-show.html", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:24:17.648583+00:00", "text": "Paul Hollywood. Photo: paul.hollywood / Instagram\n\nIf you have had the soothing joy of watching the Great British Baking Show, you’ll doubtlessly be familiar with Paul Hollywood, an intimidating and somehow unsettlingly erotic presence tasked with sampling various tarts and pastries, as well as chastising unprofessional bakers over “soggy bottoms” and stodgy cakes. What you may not know, however, is that in addition to being a celebrity chef, Hollywood is an artist — and his medium of choice is Instagram.\n\nThis realization did not come easily to me. Out of the Great British Baking Show’s regular stable of quirky characters, he’s not the most, uh, agreeable. (To his credit, he’s competing with the delightful Mary Berry.) He gets a little too much pleasure out of being the bad-cop judge. He gives off some voted-Leave vibes. Also, his blue eyes are disconcertingly icy. But after going on a deep dive into his personal Instagram, I can come to no other conclusion.\n\nI mean … he is a man named Paul Hollywood.\n\nHe is a man with the bravery to post thotty selfies. (While he does write comically earnest captions alongside the thirst traps, we all — myself included — have our faults.)\n\nAnd he’s a Motorcycle Guy. (If you’re wondering if he self-identifies as a “speed freak,” you got it, mate — he bloody does.)\n\nAnd he has the confidence to take an incredibly wide stance, and also to go zip-lining.\n\nAnd I simply cannot look away from his inspiring midlife crisis. Twenty years ago, men in the throes of this state might’ve found themselves drawn to the material comforts of, say, a leather-seated sports car or a woman no more than half their age. To my knowledge, that much hasn’t changed. What has changed, though, is that these agonizing men can now post through their suppressed existential dread on social media. And that is exactly what Mr. Hollywood is doing.\n\nSure, he may possess some of the more unpalatable qualities of an aging dirty dog — notably, a fondness for uncouth remarks and younger girlfriends — but I respect that he knows exactly who he is. In fact, in an interview with the Times from July 2017, he went so far as to explicitly admit it: “I think I am perpetually in a midlife crisis.” And I think that’s beautiful.\n\nStay in touch. Get the Cut newsletter delivered daily Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "“Great British Bake Off” judge Paul Hollywood’s Instagram features photos of motorcycles and beer, as well as thirsty selfies — all the signs that he’s living out his midlife crisis.", "authors": ["Amanda Arnold"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/08/29/29-paul-hollywood.w1200.h630.jpg"}