{"pub": "fox", "url": "https://foxnews.com/science/nasa-trump-manufacturing-push-six-innovative-technologies", "downloaded_at": "2019-10-11 12:50:25.124212+00:00", "title": "NASA advances Trump-led manufacturing push with six innovative technologies", "language": "en", "text": "NASA is doing its part to advance American manufacturing.\n\nThe Trump administration has pushed American manufacturing as a cornerstone of economic growth. According to a report released last year, the White House said that “advanced manufacturing…is an engine of America’s economic power and a pillar of its national security,\" adding that advances in manufacturing have played \"a major role in America’s global economic dominance in the 20th century.”\n\nHowever, the report warned that “this century saw dramatic changes, with significant declines in U.S. manufacturing employment starting in the 1990s and accelerating losses during the 2008 recession.”\n\nNASA IS READY TO TEST ITS FIRST ALL-ELECTRIC EXPERIMENTAL X-PLANE: 'A SIGNIFICANT EVENT'\n\nNASA, which not only develops but builds extremely complex aerospace systems, is a big part of the manufacturing push. The government space agency has come up with a list of six emerging technologies that are “ripe” for commercialization in the country.\n\nHere’s a taste of what’s been invented in America by NASA to manufacture and maintain its aerospace systems.\n\n3D printing inspection process\n\nWhen NASA researchers at Marshall Space Flight Center realized that there were “very few options out there\" for 3D printing inspection processes, they \"created their own.\" Known as “Interim, In Situ Additive Manufacturing Inspection,” the system uses infrared and visual cameras to monitor printing in real-time, layer by layer.\n\n“Manufacturers can pause the process and make corrections as needed, reducing material, energy, and time wasted in bad parts,” the space agency said.\n\nRocket assembly\n\nThis NASA technology speeds up rocket assembly, but it can also be used for shipbuilding and airframe assembly. Researchers at Marshall developed new modular fixtures for holding metal in place during assembly. Other methods often require long design time at a cost of millions of dollars.\n\nNASA's modular fixtures are easily adjustable so they can be used on rocket sections with various diameters and heights.\n\nMaking complex metal structures\n\nNASA's Langley Research Center researchers have a long history of developing electron-beam free-form fabrication technology, a kind of 3D printing process.\n\n“For many years there was no adequate way to maintain an even deposition height of the molten metal being deposited by the system. This technology solves that problem,” NASA said.\n\nWhile e-beam wire deposition is used in rapid prototyping of metal parts in space, it can also be applied to in a range of applications, from small components to large aerospace structures, NASA added.\n\nNASA CHIEF SCIENTIST SAYS 'WE'RE CLOSE' TO MAKING ANNOUNCEMENTS ABOUT LIFE ON MARS\n\nHandheld Laser Torch\n\nTo repair engine nozzles on space shuttles, NASA researchers developed a handheld laser torch for welding and brazing metals. Its unique design allows increased precision, portability, maneuverability, and safety for the user.\n\nNASA believes the torch would be useful in manufacturing things like eyeglasses frames, jewelry and medical hardware.\n\nHigh-Speed Smart Camera\n\nWhen trying to make aircraft faster and more efficient, airflow in advanced turbine engines is critical. “A supersonic jet can’t function properly unless the airflow entering the machine is compressed and slowed to subsonic speed in the inlet before it reaches the engine,” NASA said.\n\nThe smart camera uses high-speed image processing to monitor airflow of an aircraft engine's intake. In manufacturing, it could be used in assembly lines, part placement, and position monitoring, according to NASA.\n\nJoining dissimilar parts\n\nThermal Stir Welding allows manufacturers to join dissimilar materials and to weld at high rates. Automotive parts, shipbuilding, fuel tanks, and railway manufacturing are all applications that could benefit from the increased speed of the technology, NASA said.\n\nCLICK HERE TO GET THE FOX NEWS APP", "description": "NASA is doing its part to advance American manufacturing.", "authors": ["Brooke Crothers"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/nasa-SLS.jpg", "published_at": "2019-10-11"}