{"pub": "independent", "url": "https://independent.co.uk/news/world/europe/franco-exhumation-spain-fascism-civil-war-valley-fallen-a9169651.html", "downloaded_at": "2019-10-24 16:03:11.084194+00:00", "title": "Divided over a dictator, Spain exhumes Franco’s remains 'to repair an infamy’", "language": "en", "text": "The long-awaited and controversial exhumation of Francisco Franco’s remains from the Valley of the Fallen mausoleum, 44 years after his death, was finally carried out on Thursday.\n\nThe transfer of the remains to a much more low-key cemetery in the village of Mingorrubio near Madrid had been a key promise of Spain’s socialist government.\n\nPedro Sanchez, Spain’s acting prime minister, said the exhumation was “a step towards reconciliation”, but it has been criticised by opposition parties as divisive, in a country where scars from the brutal 1936-39 civil war that brought Franco to power still linger.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe general’s resting place in the ostentatious Valley of the Fallen had become a place of pilgrimage for Franco loyalists. His exhumation received strong support from those who believed it glorified the fascist dictator, and for those who lost loved ones at the hands of Franco’s death squads especially, the move could not come soon enough.\n\n“I never thought it logical or correct that a person like that who committed so much harm should be in a place like the Valley of the Fallen,” one woman told The Independent, asking to remain anonymous. Her grandfather was killed in the war, but like tens of thousands of others, his body remains unrecovered in one of the mass graves across Spain.\n\n“People nostalgic for Franco’s era will use it to try to whip up some outrage, but that’s not going to change what he is or was, whether he’s in one place or another. Whatever we think of him is going to stay the same.”\n\nHowever, the exhumation - after which Franco’s remains were taken to Mingorrubio by helicopter - was passionately opposed by his family, and Spain’s hard right, as well as parts of the church.\n\nKept at a distance of some 300 metres from the Mingorrubio-El Pardo cemetery by a long line of police, hundreds of Franco supporters waited hours for the funeral cortege and helicopter to arrive, chanting their devotion to the general.\n\n“This isn’t a homage, this is to support Francisco Franco and his family at a time when they are suffering,” Jose Ramon Medina, who travelled 400 miles from his home town of El Ejido, told The Independent.\n\n“People die and are buried across Spain every day, but this is a desecration of a tomb. Maybe it’s legal, but it’s showing a total lack of respect.”\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nThere was widespread excitement and shouts of support for Antonio Tejero, when the former civil guard who masterminded a failed coup d’etat against Spain’s democratic government in 1981 moved through the crowd. His son, Ramon, a priest, officiated a commemorative mass for Franco during his reburial.\n\nMany of the mostly middle-aged and elderly crowd outside the cemetery bore flowers and wreaths, and repeated chants of “Arriba España!, Viva Franco!” well into the afternoon. Others were draped in illegal pre-democracy Spanish flags, wore Franco-era army hats or gave out posters of the general.\n\nWhen the funeral cortege containing Franco’s relatives and the coffin passed by, arms were outstretched in the Fascist salute, and yet another hard-right anthem was sung.\n\n“They want to change the history of Spain 80 years after it happened,” said an unemployed man who had driven through the night from Seville.\n\n“This exhumation is simply part of a political campaign, and coming here to pray for Franco’s soul is something we have to do.”\n\nMr Sanchez said it was necessary now to begin the process of identifying the thousands of Franco victims who were also buried at the mausoleum.\n\n“It’s an infamy that has to be repaired,” he added.", "description": "The long-awaited and controversial exhumation of Francisco Franco’s remains from the Valley of the Fallen mausoleum, 44 years after his death, was finally carried out on Thursday. The transfer of the remains to a much more low-key cemetery in the village of Mingorrubio near Madrid had been a key promise of Spain’s socialist government.", "authors": ["Alasdair Fotheringham"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/24/15/franco-0.jpg", "published_at": "2019-10-24"}