{"pub": "independent", "url": "https://independent.co.uk/independentpremium/poetry-pharmacy-national-poetry-day-william-seighart-a9128066.html", "downloaded_at": "2019-10-21 00:19:16.052364+00:00", "title": "A poem a day keeps the doctor away: prescriptions for everyday dilemmas", "language": "en", "text": "Most of us know at least one poem by heart. Probably learned at school. Possibly for an exam. At the time, going over the lines again and again until they sunk in may have made you feel like doing a spot of DIY trepanning with a 9H pencil. But I bet that years later you’re glad you made the effort. Particularly if that poem was Philip Larkin’s “This Be The Verse”. You know it. It’s the one that starts, “They f*** you up…” There are very few terrible situations to which the deep wisdom contained in those 12 lines can’t be in some way applied. Mum, if you’re reading, I see it as a reflection on the weight of history rather than being about parenting per se.\n\nWilliam Sieghart understands the comfort of poetry. He’s the founder of the Forward Prizes for Poetry and National Poetry Day. In The Poetry Pharmacy, he offered readers poetic prescriptions for a number of conditions including loneliness, heartbreak and lack of courage. The anthology sold more than 50,000 copies in hardback, making it one of the most popular poetry anthologies ever. In the follow-up, The Poetry Pharmacy Returns, Sieghart describes with his trademark gentle wisdom 50 new conditions, from choosing a life partner to “pushy parenting” and pairs each with a poem that cuts to the heart of the matter, offering a solution, solace or simply a much-needed laugh.\n\nI opened the book on a Tuesday morning, ahead of a day I’d ear-marked for edits but which was already threatening to be swallowed up with busy-work. You know the sort of thing: renewing insurance, sending get-well flowers, tracking down the builder who left halfway through a job… I no longer hold out any hope that the builder will ever return to finish laying the slabs in my back yard but I want to know if I can sell his giant spirit level on eBay to off-set some of the cash he took for materials that never appeared.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nI read Sieghart’s prescription for “General Overload”, which is “The Orange” by Wendy Cope, with its final verse full of encouragement. “The rest of the day was quite easy, I did all the jobs on my list…” Then I read Sieghart’s prescription for “Bombardment by Minutiae”. For that you need “The Washing” by Jaan Kaplinski. And before I knew it, I was reading about “Procrastination”. William Stafford’s “You Reading This, Be Ready” was a perfect choice. Afterwards, uplifted by Sieghart’s observation that there’s never a right time to get started but that “it could be this moment, right now, which you look back on as the beginning of it all”, I put the book down and at least got the insurance renewed and the get-well flowers ordered.\n\nAnd later the same day, haunted by a line from Stafford’s poem – “What can anyone give you greater than now” – I started work on a synopsis that has been rattling around my brain for months.\n\nIn The Poetry Pharmacy and The Poetry Pharmacy Returns, Sieghart has nailed the purpose of poems for me. Reading the right poem at the right time feels like sitting across a table from someone you love and admire, having them listen to what’s bothering you then reach across that table to take your hand and say, “I know exactly what you mean.” Or even “let me kiss it better.”\n\nReading the right poem at the right time feels like sitting across a table from someone you love and admire\n\nEveryone should have a poem or two in their arsenal. The poem I return to in my head again and again isn’t one I learned in English class, however. I learned it by heart for my A-level French literature paper. I worked incredibly hard for that exam. I aced my mocks. But when it came to the day of the A-level itself, I opened the paper and found all the knowledge I had crammed over the previous months had deserted me.\n\nAt least, that’s what I thought had happened. I felt my armpits prickle and my eyes sting with incipient tears as I saw my chance of a good grade and a university place disappear in a terrifying jumble of words I might as well have never seen before. The fact was, I never had seen them before. As I tried to make sense of the stanzas in front of me, I gradually became aware that I wasn’t the only one in that exam room shifting uneasily in her seat. And then our teacher stood up and told us what was wrong.\n\n“I’m afraid we’ve been learning from the wrong syllabus.” Half an hour’s worth of frantic phone calls later, she told us we had to approach all the questions as “unseen”. The examination board had promised to mark our efforts “kindly”.\n\nThe poem I had wanted to see that day was Victor Hugo’s “J’ai cueilli cette fleur pour toi sur la colline”, which roughly translates as “I picked this flower for you on the hill”. The poet describes finding a small, pale flower with no scent on a slope overlooking the sea. The land is poor. The flower is struggling to grow in the shallow soil. Hugo laments its fate – to be blown away by the storms coming in from the ocean – and picks it to die in a “gulf more infinite”. His uncaring lover’s breast.\n\nAt the time I learned that poem, aged 17, I loved it because I loved the image of a woman’s disdain as deep and implacable as the ocean, hoping that one day I might move a man to such emotion that he’d write a poem half as heartfelt about me. Now I love the poem because, while I would not wish the same experience on any stressed-out teenager, its absence on that exam paper taught me that things will go wrong but that solutions will usually be found. I mutter it to myself whenever I see an egg-yolk yellow bird’s foot trefoil, which is the flower I picked on the last long beach walk I took with my father.\n\nThe memory of that day is sad but infinitely special. Dad told me things I feel he’d waited four decades to tell me. And when there’s no flower and no cliff and no wild wind to blow away the smell and the sadness of the city, then I have those lines to transport me from the claustrophobia of the Northern line to the magnificence of Durdle Door, which is how I imagined Hugo’s landscape.\n\nWilliam Sieghart gets that. His prescription for “Despair At The World” – an increasingly common condition in what Sieghart describes as “this choking world” with its “strutting and flapping politicians” - is Mary Oliver’s “Don’t Hesitate”. It’s an exhortation to take your happiness wherever you find it. It begins: “If you suddenly and unexpectedly feel joy, don’t hesitate. Give in to it.” I’m learning it by heart.", "description": "Most of us know at least one poem by heart. Probably learned at school. Possibly for an exam. At the time, going over the lines again and again until they sunk in may have made you feel like doing a spot of DIY trepanning with a 9H pencil. But I bet that years later you’re glad you made the effort. Particularly if that poem was Philip Larkin’s “This Be The Verse”. You know it.", "authors": ["Christine Manby"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/16/10/Poetry-pharmacy-illo.jpg", "published_at": "2019-10-20"}