{"pub": "metro", "url": "https://metro.co.uk/2019/10/16/game-thrones-star-isaac-hempstead-wright-gutted-books-alternative-ending-10931808", "downloaded_at": "2019-10-16 20:40:44.395154+00:00", "title": "GoT's Isaac Hempstead Wright 'gutted' if books had alternative ending", "language": "en", "text": "Isaac Hempstead Wright would be ‘gutted’ if books had alternative ending (Picture: Getty)\n\nGame of Thrones star Isaac Hempstead Wright says he’d be ‘gutted’ if George RR Martin gave the books an alternative ending.\n\nThe 20-year-old played Bran Stark in the fantasy saga, and ended up shocking fans when his character somehow ended up on the Iron Throne.\n\nBut despite the unexpected ending, it seems the actor would be more than happy if the books finished in the same way.\n\nWhen chatting with Metro.co.uk ahead of the Q Awards, in London, we asked how he’d feel if the iconic writer placed someone else in charge of the seven kingdoms.\n\n‘I will be a bit gutted I think,’ Isaac confessed.\n\n‘What’s nice is the fact the books and the show were able to evolve as their own thing, so George has no obligations to end it in any of the same ways we did.’\n\nBran ended up on the Iron Throne (Picture: Rex)\n\nHe added: ‘That’s quite cool, you’re going to get two alternative endings to Game of Thrones.’\n\nAdvertisement\n\nAdvertisement\n\nWe pressed to see who he’d want on the throne, to which the actor smirked: ‘It would have to be another Stark I think, Sansa or someone.’\n\nWhen suggesting Jon Snow as a potential candidate, Isaac didn’t look too impressed, and just sniggered: ‘Urrmm…’\n\nWe’ll leave you to interpret that however you like!\n\nThe star said it would have to be a Stark to take his place (Picture: FilmMagic)\n\nSince leaving the HBO hit, the star has taken on a number of projects including both Voyagers and The Blue Mauritius.\n\nBut he was never afraid of being type cast, saying: ‘I think the thing is, it would be mad if you thought you would ever get away from Game Of Thrones. It’s massive.\n\n‘For a lot of us it was one of the first things we ever did, so people do strongly associate us with those roles.\n\n‘But it doesn’t faze me because it’s not like it has been something awful we’ve been a part of and it’s hanging over our heads, and we wish we could forget about it.’\n\nHe added: ‘It’s something that is part of history, and is something really cool to have been a part of.\n\n‘Whether or not it makes it hard and we are type cast or whatever, it’s still such a nice thing to be a part of.’\n\nAdvertisement\n\nAdvertisement\n\nGame of Thrones seasons one to eight are available to stream on NOW TV.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Lewis Capaldi, Stormzy and The 1975 win big at the Q Awards 2019\n\nMORE: Lewis Capaldi ‘swipes finger to the bone’ and still hasn’t found love on Tinder", "description": "Game of Thrones star Isaac Hempstead Wright would be 'gutted' if books had alternative ending.", "authors": ["Abigail Gillibrand"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_90155697-e1571249738953_1571250744.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-16"}