{"pub": "independent", "url": "https://independent.co.uk/life-style/fashion/fashion-fix-podcast-bbc-charli-howard-diversity-metoo-interview-listen-a9112141.html", "downloaded_at": "2019-09-20 08:16:49.727949+00:00", "title": "Charli Howard interview: ‘Why I’m tackling #MeToo and diversity in the BBC’s new fashion podcast’", "language": "en", "text": "The fashion industry is in a state of flux, and in the wake of London Fashion Week, there’s much to discuss beyond the trends. Body positivity activists questioned the lack of diversity on the runways, fans wondered why their favourite designers were absent from the lineup, and Extinction Rebellion tried to call the whole thing off.\n\nAnd of course there’s also Brexit, which the British Fashion Council (BFC) says could set the industry back by £900m in a no-deal scenario.\n\nThere’s a lot to unpick, which is why model and activist Charli Howard has launched a new podcast series to do just that.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nFashion Fix launches on BBC Sounds today, with episodes tackling issues such as body image, sustainability and sexual harassment within the industry. Guests include Mariah Idrissi, one of the first models to wear a hijab in a mainstream fashion campaign, and Kalpona Akter, a former child garment worker who now runs the Bangladesh Centre for Worker Solidarity.\n\nMany of the topics discussed in the series are ones that Howard has personally dealt with. In 2015, she found fame for writing an open letter on Facebook to her former modelling agency, who she claims dropped her from their books because, at a UK size eight, she was “too big” to get work.\n\nShape Created with Sketch. Best-dressed celebrities at Milan Fashion Week SS20 Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Best-dressed celebrities at Milan Fashion Week SS20 1/11 Alexa Chung The fashion designer and author sat on the front row at the Prada show on Wednesday wearing a pale blue smock shirt with floral embroidery. Getty Images for Prada 2/11 A$AP Rocky The musician was spotted at Prada wearing a navy blue suit consisting of shorts and a blazer. Getty Images for Prada 3/11 Nicole Kidman The Big Little Lies actor wore a colourful long-sleeved dress to the Prada show. The gown itself featured intricate patterns in black, green and red and Kidman topped the look off with fuchsia lipstick. REUTERS 4/11 Winnie Harlow The model wore a utilitarian khaki green two-piece to the Prada show. Harlow accessorised the look with high-heeled black biker boots. Getty Images for Prada 5/11 Jeanne Damas The Rouje founder wire a checked shirt dress to the Prada show. Getty Images for Prada 6/11 Susie Lau The fashion writer wore a mint green midi skirt complete with a red tulip design and a black lace cape. Lau added some eccentricity to her look by wearing grey socks underneath her emerald green peep-toe heels. Getty Images for Prada 7/11 Anna Dello Russo The Italian fashion titan wore a strapless blue floral dress for the Prada show. Getty Images for Prada 8/11 Chiara Ferragni Ferragni is a regular on the Frow at Milan Fashion Week. For the Prada show, she chose to wear a rose-covered shirt and a black midi skirt. Getty Images for Prada 9/11 Anna Wintour The American Vogue editor wore a deep crimson long-sleeves dress for the Prada show. Getty Images for Prada 10/11 Wes Andreson and Juman Malouf The revered filmmaker was pictured on the front row at the Prada show alongside his wife, author and illustrator Juman Malouf. Getty Images for Prada 11/11 Regina King The actor wore a fun pair of feathered black jeans to the Prada show, adding a simple white shirt on top. Getty Images for Prada 1/11 Alexa Chung The fashion designer and author sat on the front row at the Prada show on Wednesday wearing a pale blue smock shirt with floral embroidery. Getty Images for Prada 2/11 A$AP Rocky The musician was spotted at Prada wearing a navy blue suit consisting of shorts and a blazer. Getty Images for Prada 3/11 Nicole Kidman The Big Little Lies actor wore a colourful long-sleeved dress to the Prada show. The gown itself featured intricate patterns in black, green and red and Kidman topped the look off with fuchsia lipstick. REUTERS 4/11 Winnie Harlow The model wore a utilitarian khaki green two-piece to the Prada show. Harlow accessorised the look with high-heeled black biker boots. Getty Images for Prada 5/11 Jeanne Damas The Rouje founder wire a checked shirt dress to the Prada show. Getty Images for Prada 6/11 Susie Lau The fashion writer wore a mint green midi skirt complete with a red tulip design and a black lace cape. Lau added some eccentricity to her look by wearing grey socks underneath her emerald green peep-toe heels. Getty Images for Prada 7/11 Anna Dello Russo The Italian fashion titan wore a strapless blue floral dress for the Prada show. Getty Images for Prada 8/11 Chiara Ferragni Ferragni is a regular on the Frow at Milan Fashion Week. For the Prada show, she chose to wear a rose-covered shirt and a black midi skirt. Getty Images for Prada 9/11 Anna Wintour The American Vogue editor wore a deep crimson long-sleeves dress for the Prada show. Getty Images for Prada 10/11 Wes Andreson and Juman Malouf The revered filmmaker was pictured on the front row at the Prada show alongside his wife, author and illustrator Juman Malouf. Getty Images for Prada 11/11 Regina King The actor wore a fun pair of feathered black jeans to the Prada show, adding a simple white shirt on top. Getty Images for Prada\n\nAhead of the series launch, Howard spoke to The Independent about the industry’s glorification of homogenised beauty, avoiding castings with “dodgy” photographers and why London Fashion Week shouldn’t be cancelled.\n\nWhy is it that in 2019 the fashion industry continues to champion a limited type of female beauty?\n\nThere are still a lot of people at the top who have done things a certain way for a long time, and because social media has developed so rapidly, I think a lot of brands find it hard to keep up with changes. But there’s really no excuse anymore to use the same body shape and colour over and over. If you’re a consumer buying a product, you deserve to see yourself represented. Using larger women doesn’t mean that a brand’s image will be cheapened; it can still be just as beautiful and aspirational.\n\nDo you think we’ve reached a place where body diversity is being celebrated in the industry?\n\nAlthough we’ve got a while to go before we truly see diversity on a day-to-day basis, I do think the industry is changing quite rapidly, especially in America, and a lot of that is down to social media. I’ve mostly been working in New York for the past four years and most campaigns there feature women of every size, shape and colour. It wasn’t uncommon 10 years ago to see image after image, advert after advert featuring the same white, tall, skinny women – which I think has created a generation of women feeling insecure about their bodies. But nowadays, if a brand isn’t inclusive, a consumer can jump on their phone and complain on Instagram, meaning brands have to sit up, take notice and create positive imagery.\n\nWhy did you want to address #MeToo in the podcast? Is this a common problem within fashion and is it something you’ve ever dealt with yourself?\n\nI’ve definitely been in positions that I haven’t felt comfortable with, like being groped, leered at, hearing crude comments or being sent weird messages before and after working with someone. There were times I asked agents not to send me on castings because I knew the photographer was dodgy, but I was told that it could ‘affect my career’ if I didn’t go. If anything weird happened, I learnt not to say anything to anyone because I came to expect it. But thanks to MeToo, I realised that no one has to put up with behaviour that makes them feel uncomfortable.\n\nExtinction Rebellion is calling for the BFC to cancel LFW altogether: is that the right approach from an environmental perspective? What would you suggest?\n\nPersonally, I feel London Fashion Week is such a creative and exciting time for Britain, so I’d hate for it to be cancelled completely like Stockholm Fashion Week.\n\nBut the Extinction Rebellion campaign is a wake-up call to remind us that in a Climate Emergency, it can’t just be business as usual.\n\nCan retailers do more to promote sustainable fashion?\n\nI definitely think more can be done in terms of sustainability – whether that’s brands coming together and donating to an environmental charity, or using fabrics that are recycled as well as recyclable, or even made from wild rubber or pineapple leaves! It’s about making conscious decisions and thinking about the bigger picture: Earth.\n\nWhat can individuals do to help?\n\nI think we’ve all got to accept that we need to buy less! Maybe all the fashion weeks – not just London – could do more to promote platforms that help us rent, repair or re-sell clothes. Because then we’re really valuing all the craft and creativity that went in to making them in the first place.\n\nFashion Fix with Charli Howard is available now on BBC Sounds", "description": "The fashion industry is in a state of flux, and in the wake of London Fashion Week, there’s much to discuss beyond the trends.", "authors": ["Olivia Petter"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/19/15/1920-x-1080-charli.png", "published_at": "2019-09-20"}