{"pub": "scmp", "url": "https://yp.scmp.com/article/3513/let-heat-fire-your-imagination", "downloaded_at": "2019-10-24 14:11:39.218320+00:00", "title": "Let the heat fire your imagination", "language": "en", "text": "The trumpet fanfare, the shower of confetti, the excited throng can all mean only one thing: no, not another royal wedding, but the launch of's 2011 Summer Story competition!\n\nEvery Saturday throughout the holidays, fiction by nine finalists chosen by our judges will be published alongside illustrations created by our talented artists. Finalists will also receive a certificate from Young Post. The winner will get HK$1,200 worth of Dymocks vouchers, while the nine finalists will each get HK$200 worth of Dymocks vouchers. The winner's story will also feature on our cover.\n\nThe theme for this summer's competition is: \"But you don't know who they really are.\" You can interpret this line however you like, and you don't have to limit your subject matter to summer holidays or even summer. Stories must be set in Hong Kong and be between 1,800 and 2,000 words.\n\nE-mail your entries to yp_summer@scmp.com by June 17, with \"S Fiction\" in the subject field. Include your name, age, school, phone number and a jpeg headshot of yourself.\n\nDeadline extended to June 30.\n\nThe judges' decision will be final. This competition is not open to SCMP staff members or their families\n\nEntries received\n\nFirst Finalist: Stefanie Yip\n\nRead her story\n\nSecond Finalist: Emily Archibald\n\nRead her story\n\nThird Finalist: Ayra Maria Perakath\n\nRead her story\n\nFourth Finalist: Charlotte\n\nRead her story\n\nFifth Finalist: Ngo Hiu-ching\n\nRead her story\n\nSixth Finalist: Shirley Foo\n\nRead her story\n\nSeventh Finalist: Ngo Pui-ying\n\nRead her story\n\nEighth Finalist: Heidi Au Yeung Yat-ning\n\nRead her story\n\nNinth Finalist: Talise Tsai\n\nRead her story\n\nWinner: Janessa Chou Ho-wing\n\nRead her story", "description": "Read the finalists' stories!", "authors": [], "top_image": "http://www.yp.scmp.com/home/website/Images/UploadImages/20110218/pdf.jpg", "published_at": "2019-10-24"}