{"pub": "yahoo", "url": "https://news.yahoo.com/khamenei-tells-irans-guards-develop-091751042.html", "downloaded_at": "2019-10-15 04:32:00.292754+00:00", "title": "Khamenei tells Iran's Guards to develop advanced, modern weapons", "language": "en", "text": "Iran's Supreme Leader Ayatollah Ali Khamenei gives a speech to a group of scholars and seminary students of religious sciences in Tehran\n\nBy Parisa Hafezi\n\nDUBAI (Reuters) - Supreme Leader Ayatollah Ali Khamenei told Iran's elite Revolutionary Guards on Sunday to develop more advanced and modern weapons, amid increasingly tense disputes with the United States and Gulf Arab states.\n\nTensions in the Gulf have risen to new highs since May 2018, when the Trump administration withdrew from a 2015 international nuclear accord with Tehran that put limits on its nuclear program in exchange for the easing of sanctions.\n\nAs U.S. sanctions have been reimposed, there have been a series of attacks in Saudi Arabia and the Gulf that Washington and its allies have blamed on Iran, which denies responsibility.\n\n\"The Guards should have advanced and modern weapons ... Your weapons should be modern and updated. It should be developed at home. You need to develop and produce your weapons,\" Khamenei said in a speech at Imam Hossein Military University in Tehran.\n\n\"Today the Guards have a powerful presence inside and outside Iran ... America's hostile approach has increased the Guards' greatness,\" Khamenei said, according to state TV.\n\nWashington and Riyadh have accused Iran of being behind attacks on Saudi oil facilities on Sept. 14, which temporarily knocked out half Saudi oil output. Tehran denies any role in the strikes which were claimed by Yemen's Iran-backed Houthi forces.\n\nAmid the tensions, Washington plans to deploy about 3,000 troops to Saudi Arabia, including fighter squadrons, an air expeditionary wing and air defense personnel.\n\nPakistani Prime Minister Imran Khan arrived in Tehran on Sunday, saying he would continue efforts to defuse the row between Tehran and Riyadh, which have been locked in proxy conflicts in the Middle East.\n\nKhan, who also met Khamenei, is visiting Tehran after he said U.S. President Donald Trump had asked him to help reduce tensions with Iran.\n\n\"Pakistan does not want conflict between Iran and Saudi Arabia,\" Khan told a joint news conference with Iranian President Hassan Rouhani, broadcast on state television.\n\n\"I am happy to facilitate talks between Tehran and Riyadh,\" said Khan, saying he had \"constructive talks\" with Rouhani and planned to visit Saudi Arabia on Tuesday.\n\nKhamenei told Khan that U.S.-allied Gulf Arab States were \"under the will of the United States\" and warned that any attacker would regret taking action against Iran, according to state television. \"Ending the war in Yemen will have a positive impact on the region.\"\n\nSaudi Minister of State for Foreign Affairs Adel al-Jubeir said on Sunday that Riyadh had not asked Islamabad to mediate.\n\nThe minister told reporters in Riyadh the Pakistani prime minister was acting \"on his own initiative\" and said Iranians needed \"to change their behavior, their policies if they want countries to deal with them as with normal countries.\"\n\nIran's foreign ministry said before Khan's visit that Tehran was ready for talks with Riyadh with or without a mediator.\n\nRouhani told the news conference after meeting Khan that \"any effort based on goodwill is welcomed ... during the meeting, we agreed that the regional issues can be resolved through diplomacy and through dialogue between countries.\"\n\n\n\n\n\n(Writing by Parisa Hafezi, additional reporting by Olesya Astakhova in Riyadh; Editing by Raissa Kasolowsky and Edmund Blair)", "description": "Supreme Leader Ayatollah Ali Khamenei told Iran's elite Revolutionary Guards on Sunday to develop more advanced and modern weapons, amid increasingly tense disputes with the United States and Gulf Arab states.  Tensions in the Gulf have risen to new highs since May 2018, when the Trump administration", "authors": ["Parisa Hafezi"], "top_image": "https://s.yimg.com/uu/api/res/1.2/7ekoosM6.SxaKr_.6UyRzQ--~B/aD0zMDA7dz00NDk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/6d46085f3bf76a34294bccc0c5c3bf18", "published_at": "2019-10-13"}