{"pub": "yahoo", "url": "https://news.yahoo.com/facebook-mark-zuckerberg-sheryl-sandberg-involved-with-content-issues-130044793.html", "downloaded_at": "2019-09-10 07:45:22.451336+00:00", "title": "Facebook's Zuckerberg and Sandberg are this involved with the company's content issues", "language": "en", "text": "Just how hands-on are Mark Zuckerberg and Sheryl Sandberg when it comes to sensitive content issues at Facebook (FB)? According to top executives at the social media giant, they are “incredibly involved.”\n\nThat’s important because with Facebook under fire from regulators over questions on several fronts including possible antitrust violations, freedom of speech, data security, and national security, the focus of the company’s two top executives reflects the social media giant’s priorities and how it responds to myriad criticisms and challenges.\n\nIn an exclusive interview at Facebook’s Menlo Park headquarters with the three executives who oversee content at Facebook — Monika Bickert, Head of Global Policy Management; John DeVine, VP of Global Operations; and Guy Rosen, VP of Integrity — all three executives spoke at length about the efforts the company was making to moderate content and mitigate and adjudicate hot-button issues like hate speech, misinformation, and hacking. With 2.4 billion monthly users spread globally across the company’s four primary platforms — Facebook, Instagram, WhatsApp, and Messenger — it’s no small task.\n\n‘The involvement is very deep’\n\nThe three executives who spoke to Yahoo Finance describe the process of navigating sensitive content issues as “nuanced” where intelligent and good-intentioned participants often disagree. And they, and others at the company, spoke of Zuckerberg and Sandberg’s stepped-up involvement in that process.\n\n“Any time that we're dealing with something that is close to the line or it's something where it's not really clear how the policies apply or it's something that's particularly important, we will, at the very least, send an email up to Mark and Sheryl so that they know what's going on,” Bickert told me. “Very often, we will end up having a back-and-forth with them about why we're making the decision we're making, and make sure they're OK with it.”\n\nFacebook Head of Policy Managment Monika Bickert participates in a discussion and question-and-answer session about 'Internet Security and Privacy in the Age of Islamic State' at the Washington Institute for Near East Policy February 26, 2016 in Washington, DC. (Photo by Chip Somodevilla/Getty Images) More\n\nI asked Bickert if this would include for instance the doctored video of Nancy Pelosi posted on Facebook that appeared to show her slurring her words or drunk. “With anything that is very big that a lot of people are talking about, we will absolutely loop them in,” said Bickert, who has testified before Congress twice on behalf of the company and who previously worked for 10 years as an Assistant U.S. Attorney for the Department of Justice.\n\nFacebook decided to leave the Pelosi video up. But it directed anyone seeing the post to fact-checking sites that described how the footage was manipulated. Bickert also told Anderson Cooper that Facebook “dramatically reduced the distribution” of the post. Soon thereafter a news report says the Pelosi post couldn’t be found on Facebook, though Facebook says it hasn’t been removed. The video appeared on other sites, as well. Twitter kept the video up, while YouTube reportedly took it down, stating that it violated its policies against deceptive practices.\n\nFacebook was widely criticized — including by Pelosi herself — for keeping the video up, though again, it appears to be unfindable on Facebook at this point. It’s just one example of what the company has to address, as well as the different responses by its social media competitors. It’s also worth noting that there are all sorts of distorted images of President Donald Trump on social media, including Facebook.\n\nWith the president, as well as high-level Democrats, highly tuned to the vagaries of social media, it’s understandable that Zuckerberg and Sandberg would want to be kept in the loop when these issues crop up. It might also make it difficult, however, for them later to suggest they were out of the loop when it comes to a content issue at the company.", "description": "Facebook's Mark Zuckerberg and Sheryl Sandberg are “incredibly involved\" with sensitive content issues.", "authors": ["Andy Serwer With Max Zahn"], "top_image": "https://s.yimg.com/uu/api/res/1.2/UrEJTY1vkzMuYV1v.mTSUA--~B/aD00ODU7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2018-10/00951610-ce31-11e8-af7b-ff9dfc96fdf5", "published_at": "2019-09-09"}