{"pub": "fox", "url": "https://foxnews.com/health/teen-wakes-up-thinking-each-day-is-june-11th-memory-resets-every-two-hours-its-like-a-movie", "downloaded_at": "2019-09-12 07:21:23.664921+00:00", "title": "Illinois teen wakes up thinking each day is June 11: 'It's like a movie'", "language": "en", "text": "An Illinois teenager wakes up every day thinking it's June 11, 2019, the day she suffered a traumatic brain injury. Two hours later, her memory resets, and she's back to where she started when she woke up.\n\nThis is not a remake of the 1993 movie \"Groundhog Day.\" It's Riley Horner's life.\n\n\"I have a calendar on my door and I look and it's September and I'm like 'Woah',\" Horner told WQAD.\n\nCOLORADO WOMAN, 24, IN HEART FAILURE CREATES BUCKET LIST 3RD TRANSPLANT IS DENIED\n\nOn that fateful June 11, Horner was accidentally kicked in the head by a fellow student who was crowd-surfing during a dance. At first, her doctors simply dismissed it as a concussion and sent her home on crutches. But today, her condition remains a medical anomaly.\n\nHorner has suffered through dozens of seizures and countless hospital visits but doctors keep repeating there is nothing medically wrong with her.\n\n\"They can't see anything. You can't see a concussion though on an MRI or a CT scan. There's no brain bleed, there's no tumor,\" Horner's mother, Sarah told the station. \"My brother passed away last week and she probably has no idea. And we tell her every day but she has no idea about it.\"\n\nPURDUE PHARMA REACHES TENTATIVE SETTLEMENT IN OPIOID LAWSUIT, BUT SOME STATES AREN'T ON BOARD\n\n\"I know it's hard for them as much as it's hard for me. And people just don't understand. It`s like a movie,\" Riley said. \"Like, I will have no recollection of [this interview] come supper time.\"\n\nHorner carries no acquired knowledge with her at the start of the next two-hour cycle. She even has to carry around all her school supplies with her at all times because she doesn't remember where her locker assignment is.\n\n\"[Doctors] told us that she might just be like this forever. And I am not okay with that,\" Sarah Horner said.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nRiley's family fears the clock might be ticking for the fate of her future, as Sarah said studies have shown after six months of short term memory the damage could be irreversible.\n\n\"We need help,\" Sarah implored. \"We need somebody that knows a little bit more because she deserves better. I mean she wanted to be in the medical field and now she can’t even hold a job if she wanted to.\" Riley told the station she just wants anyone else experiencing similar synonyms to know they are not alone.\n\nClick for more from WQAD.com.", "description": "An Illinois teenager wakes up every day thinking it's June 11, 2019, the day she suffered a traumatic brain injury. Two hours later, her memory resets, and she's back to where she started when she woke up.", "authors": ["Morgan Phillips"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/doctor-consulting-iStock.jpg", "published_at": "2019-09-12"}