{"pub": "cbc", "url": "https://cbc.ca/sports/hockey/nhl/winnipeg-jets-calgary-flames-heritage-classic-1.5337035", "downloaded_at": "2019-10-27 12:00:33.705384+00:00", "title": "CBC Sports", "language": "en", "text": "Bryan Little picked a big stage to score his first goal of the season.\n\nHis overtime winner lifted the Winnipeg Jets to a 2-1 win over the Calgary Flames in a snowy Heritage Classic outdoor game Saturday in Regina.\n\nThe 31-year-old forward from Cambridge, Ont., scored at 3:04 of extra time on a two-on-one with Kyle Connor.\n\n\"It's pretty cool,\" Little said. \"It was one of those games where I pretty much didn't have any chances.\n\n\"Then you get a two-on-one like that in overtime. I'll admit I really didn't do too much. I just went to the net and put my stick on the ice and Kyle made a great pass. But it was definitely a great feeling.\"\n\nWATCH | Little leads Jets to Heritage Classic win:\n\nBryan Little scored in overtime to push the Winnipeg Jets to a 2-1 victory over the Calgary Flames in the 2019 Heritage Classic. 1:37\n\nLittle missed the first nine games of this season with a concussion.\n\nThe longest-serving Jet in his 13th NHL season wasn't able to play in the 2016 Heritage Classic at Winnipeg's IG Field because of a knee injury.\n\n\"It was definitely frustrating last time watching from the sidelines and not getting to experience it,\" Little said. \"When I heard we were playing outside I had this circled on the calendar. Definitely lived up to everything.\"\n\nThe NHL's 28th outdoor game since 2003 was a prairie-province showdown at Mosaic Stadium, and Canada's first 'neutral' site for an outdoor game.\n\nJets defenceman Josh Morrissey scored the tying goal in the third period for Winnipeg (6-6-0). Goalie Connor Hellebuyck made 29 saves for the win.\n\nElias Lindholm scored for Calgary (6-5-2). David Rittich stopped 43 shots for the Flames in his first start in an outdoor game.\n\nBoth teams were right at home\n\nThe 33,350-seat stadium built in 2017 to be the new home of the CFL's Saskatchewan Roughriders was sold out and liberally sprinkled with Flames red, Jets blue and Roughrider green.\n\n\"As soon as we walked out of the tunnel, the crowd was electric,\" Morrissey said.\n\n\"It was completely full and as a player, it was just an awesome time and I think the city and the province really embraced it.\"\n\nA high of 17 degrees the previous day gave way to cloud and winds making for a sub-zero game day.\n\nWind gusts between 28 and 43 kilometres per hour put the windchill at minus-10 by puck drop at 8 p.m. local time.\n\nSnowflakes began dusting Mosaic a few hours prior to the game and intensified after the opening faceoff.\n\nAs snow accumulated between scrapes, puck handling, shooting and passing became laborious.\n\n\"It feels right,\" Flames forward Matthew Tkachuk said. \"It feels like that's how hockey should be and how legends of the past grew up playing.\n\n\"You hear all the greats talk about growing up and playing on the outdoor rink. It's cool to play in that environment where it's snowing, it's causing the ice to be slower, you're falling, you're losing the puck, it bounces all over the place.\n\n\"You knew it was going to be a low-scoring game and it was fun.\"\n\nIt may have been a low-scoring game, but both teams had ample chances and put 26 shots on net apiece over the first two periods.\n\nWith Flames centre Sean Monahan serving a tripping minor, the Jets couldn't score on a 4-on-3 in extra time. Captain Blake Wheeler put the puck off the crossbar with seconds remaining in the penalty.\n\nAnswer to a trivia question\n\nMorrissey pulled the Jets even at 15:49 of the third period with a power-play goal. He threaded a shot through traffic to the top corner of the net on Rittich's glove side.\n\nHis was Winnipeg's first goal in an outdoor game. The Jets were shut out 3-0 by the Edmonton Oilers in 2016.\n\nAfter a scoreless first period, Lindholm's power-play goal at 14:47 of the second was his team-leading seventh goal of the season.\n\nJohnny Gaudreau, on Hellebuyck's right, tapped the puck over to Lindholm to shovel it past Winnipeg's netminder.\n\nJets head coach Paul Maurice challenged the goal believing Tkachuk raised his stick above his shoulders to knock down the puck and keep it in the offensive zone.\n\nMaurice was denied, which resulted in a Jets minor penalty for the failed challenge.\n\nWinnipeg scored once on five power-play chances, while the Flames went 0-for-3.\n\nThe outdoor game was Calgary's first of five road games over eight days. The Jets face the Ducks in Anaheim on Tuesday.\n\nNotes\n\nJets centre Mason Appleton was a scratch Saturday having broken a bone in his foot throwing the football with his teammates at Mosaic prior to Friday's skate . . . Flames defenceman Travis Hamonic played his 600th NHL game Saturday.", "description": "Bryan Little scored the overtime winner for the Winnipeg Jets in a 2-1 win over the Calgary Flames in Saturday's Heritage Classic outdoor game.", "authors": [], "top_image": "https://i.cbc.ca/1.5337196.1572153092!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/connor-hellebuyck.jpg", "published_at": "2019-10-27"}