{"pub": "metro", "url": "https://metro.co.uk/2019/10/23/zinedine-zidane-reacts-chelsea-hero-eden-hazard-misses-open-goal-real-madrid-10967906", "downloaded_at": "2019-10-23 10:59:45.240909+00:00", "title": "Zinedine Zidane reacts after Chelsea hero Eden Hazard misses open goal for Real Madrid", "language": "en", "text": "Eden Hazard missed an open goal in Real Madrid’s Champions League win over Galatasaray (Picture: Getty)\n\nZinedine Zidane insists he is ‘not worried’ about the form of Eden Hazard after the Chelsea hero missed an open goal in the Champions League.\n\nBelgium superstar Hazard completed a dream move to the Bernabeu over the summer in a deal that cost the Spanish giants £150million.\n\nThe 28-year-old has endured an underwhelming start to his Real Madrid career, scoring just once in nine appearances, and struggled against Galatasaray on Tuesday evening.\n\nHazard wasted a golden chance for Real Madrid (Picture: Twitter)\n\nHazard had the chance to score his first Champions League goal for Real but squandering a guilt-edged opportunity after rounding the goalkeeper only to hit the bar.\n\nReacting to the miss and Hazard’s form for Real Madrid, manager Zidane said: ‘It doesn’t worry me.\n\n‘He’s better and he’s going to improve more. The important thing is that he continues to have chances, because he’s going to put them in.’\n\nAdvertisement\n\nAdvertisement\n\nProlific Champions League winners Real Madrid made a poor start to this season’s competition, losing to PSG before dropping points at home to Club Bruges.\n\nThey returned to winning ways in Istanbul, however, with Toni Kroos’ goal enough to secure the victory and lift Madrid off the bottom of Group A.\n\nOn the 1-0 win, Zidane added: ‘I’m delighted for the whole team because there’s been a lot of criticism, it’s not an easy place to come to and we showed good character.\n\n‘It’s important to win when you play every three days and tonight we were focused right from the off.\n\nZinedine Zidane has pleased with Real Madrid’s win (Picture: Getty)\n\n‘We created a lot of chances after some really good moves and I would have liked to have seen us get a second and even a third because that would have meant that the opposition would have eased off in terms of their pressing.\n\n‘At 1-0 they still believed they could level things up right until the end, but we were focused from the first minute until the last.\n\n‘We worked hard and were strong and that’s what got us the win.’", "description": "Zinedine Zidane insists he is 'not worried' about the form of Eden Hazard after the Chelsea hero missed an open goal in the Champions League. Belgium superstar Hazard completed a...", "authors": ["Metro Sport Reporter"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/hazard-miss-2-c31a_1571821411.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-23"}