{"pub": "euronews", "url": "https://euronews.com/2019/10/19/egypt-uncovers-3-000-year-old-mummies-valley-kings-n1069001", "downloaded_at": "2019-10-19 15:18:47.338605+00:00", "title": "Egypt reveals mummies in newly discovered ancient coffins", "language": "en", "text": "LUXOR, Egypt — Colorful wooden coffins adorned with paintings and inscriptions that were recently discovered by a team of Egyptian archaeologistswere opened on Saturday to reveal perfectly preserved mummies.The 30 sealed coffins were found by accident under a mound behind the Asasif Necropolis on the west bank of the Nile river, Mostafa Waziri, secretary-general for Egypt's Supreme Council of Antiquities, told NBC News\"I'm very happy we found this discovery with Egyptian hands,\" Waziri said.The archaeologists were conducting an unrelated dig when someone noticed what appeared to be the face of a coffin, Waziri explained. They continued digging to discover a cachet of coffins stacked in two layers only a few feet under the sand.The coffins are estimated to be 3,000 years old and belonged to men, women and two children, who were most likely priests.\n\nEgypt\\'s Antiquities Minister Khaled el-Enany, and Mostafa Waziri, the Secretary General of the Supreme Council of Antiquities, surround a sarcophagus belonging to a man in front Hatshepsut Temple at Valley of the Kings in Luxor on Oct. 19, 2019. Khaled Desouki\n\nEgypt's Ministry of Antiquities has described the coffins as one of the \"biggest and most important\" discoveries in recent years.On Saturday, glove-clad archaeologists delicately pried open two of the coffins to uncover perfectly preserved mummies — one man and one woman — wrapped in cloth. One had a piece of skull visible.The gender of the mummies can be distinguished by the shape of their hands. Waziri said women were buried with their hands open while men's hands were closed.The Asasif Necropolis is located in the ancient town of West Thebes. Most tombs at the necropolis date back to the Late Period, which ended in 332 B.C., but the newly discovered coffins are believed to be much older.The elaborate decorations on the coffins were likely to compensate for the fact they weren't buried in proper tombs, Waziri said. The similarity in design suggests they were all made at the same workshop.The coffins were well preserved because they were so well hidden from tomb raiders, Waziri said.Coffins found in tombs are often damaged due to termites, but because these were buried in the sand, they were completely intact.The 20 coffins pulled from the site will be displayed in the Grand Egyptian Museum set to open in Giza next year.Molly Hunter and Charlene Gubash reported from Luxor, Egypt, and Linda Givetash from London.", "description": "The perfectly preserved coffins hidden under a mound of sand were discovered by an Egyptian team of archaeologists by accident.", "authors": [], "top_image": "https://static.euronews.com/articles/4244156/1000x563_nbc-191019-egypt-sarcophagus-discovery-al-1024_672431f75ffec67950fe399c6571698e.jpg", "published_at": "2019-10-19"}