{"pub": "fox", "url": "https://foxnews.com/us/arizona-trooper-arrested-on-sex-related-kidnapping-and-fraud-charges-police", "downloaded_at": "2019-09-11 07:25:26.643628+00:00", "title": "Arizona trooper arrested on sex-related, kidnapping and fraud charges: police", "language": "en", "text": "An Arizona state trooper was arrested Tuesday and charged with 61 counts -- ranging from alleged sexual abuse and extortion to kidnapping and fraud -- after his department said he was using his position to trade \"leniency for favor.\"\n\nTremaine Jackson, 43, worked for the Arizona Department of Public Safety (AZDPS) for 13 years and was assigned to the department's Metro Motors District when authorities say they started receiving calls from women alleging that he'd made inappropriate comments and sexually abused them while on the job.\n\nARIZONA WOMAN ARRESTED AFTER DAUGHTER, 10, RECORDS HER DRIVING DRUNK: POLICE\n\nCol. Frank Milstead, director of AZDPS, said at a press conference Tuesday that on May 19, the department received its first complaint from a female motorist. who said Jackson made inappropriate comments to her during a traffic stop.\n\nWhile investigating that complaint, police received a second complaint that alleged Jackson made inappropriate comments and engaged in \"criminal behavior to the extent of sexual abuse,\" Milstead said. Jackson was put on administrative leave.\n\nAs the AZDPS's special investigation unit began to further probe Jackson's behavior while on duty, it contacted several women who had been stopped or cited by him dating back to Oct. 29, 2018, when police believe the first account of inappropriate and unlawful contact occurred.\n\nMilstead said the investigation revealed at least eight women were alleged to have been harassed or sexually abused by Jackson while he was in uniform and in a marked or unmarked Arizona Department trooper car. Further, Milstead said, \"we believe this may not be all of our victims.\"\n\n\"I implore anyone who has contact with Trooper Jackson, who may have been affected by contact with him, who may have been victimized, either through commentary or through physical action by Trooper Jackson to please come forward,\" Milstead said.\n\nJackson will be booked at the Maricopa County Jail on Tuesday afternoon.\n\nIn addition to 13 charges of sexual abuse, Jackson also faces eight counts of forgery, a dozen counts of fraudulent schemes and eight counts of tampering with a public record for allegedly falsifying department worksheets or citations, Milstead said.\n\nCLICK HERE FOR THE FOX NEWS APP\n\nHe also faces eight counts of unlawful imprisonment and eight counts of kidnapping for \"keeping people an inordinate amount of time and not allowing them ... to leave when they were not under arrest.\"\n\nMilstead said Jackson used his positional authority to extort sexual favor from women and called the allegations \"horrifying.\"", "description": "An Arizona State Trooper was arrested Tuesday and charged with 61 counts of sexual abuse, sexual extortion, kidnapping, harassment and fraud after his department received multiple complaints from women that alleged they were sexually harassed during traffic stops.", "authors": ["Vandana Rambaran", "Vandana Rambaran Is A Reporter Covering News", "Politics At Foxnews.Com. She Can Be Found On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Tremaine-Jackson.jpg", "published_at": "2019-09-10"}