{"pub": "afr", "url": "https://afr.com/property/commercial/adam-neumann-s-era-of-excess-and-eccentricity-is-over-at-wework-20191023-p533d2", "downloaded_at": "2019-10-23 09:44:18.840504+00:00", "title": "WeWork co-founder's era ends with $US1.2b payout", "language": "en", "text": "If the rescue package was personally humbling for the 40-year-old Neumann, it's poised to make him a very rich man. In an unusual deal that is almost certain to spark the ire of WeWork staffers being dismissed by the thousands, Neumann will walk away with as much as $US1.2 billion as well as a $US500 million credit line from SoftBank, after it pushed him out as chief executive officer last month.\n\nHe'll remain as a board observer and can assign two board seats.\n\nThe deal serves to give WeWork a second chance at least in the short-term. SoftBank will soon provide WeWork with $US1.5 billion, accelerating a financing agreement that was originally scheduled for April, people familiar with the plans have said.\n\nSoftBank is also organising a $US5 billion debt package, which will include contributions from SoftBank itself, Mizuho Financial Group and other lenders.\n\nEmblematic of high-flying, growth-at-all-costs unicorns, WeWork's never made a penny in profits, losing $US900 million in the first half of this year. Burning through cash since its inception, it faced a crunch that could have left the company short of funds as soon as next month.\n\nWeWork's business model strategy has made it the biggest private office tenant in cities like New York and London. Supplied\n\nSerious questions remain about its business model of renting and renovating office space that it leases to individuals and companies. That strategy has made it the biggest private office tenant in cities like New York and London. But it's also left it in a precarious position. It has some $US47 billion of future rent payments due and some $US1 billion in renovation costs.\n\nLandlords and tenants have become cautious when dealing with the firm. Google has walked away from a potential Toronto lease and landlords are reaching out to WeWork rivals to see if they will take over WeWork leases or buildings if it becomes necessary.\n\nAdvertisement\n\nSoftBank also must grapple with reducing costs including a workforce of more than 12000 people that had grown bloated under Neumann. WeWork already plans to lay off 2000 people and sell some non-core businesses.\n\nEven as it reduces the workforce, SoftBank will also need to deal with growing dissatisfaction among employees, some of whom have worked for years in anticipation of an initial public offering that never materialised. At least five C-level executives have headed for the exits in recent weeks, and some staffers, unsure of their fate, stopped reporting for duty altogether, people familiar with the situation said last week.\n\nAs part of SoftBank's plan, one of its executives, Marcelo Claure, will take over as chairman of WeWork's board, one of the people said. WeWork appointed Artie Minson and Sebastian Gunningham as co-CEOs last month after investors pushed back against the IPO.\n\nEven before the bailout, the Japanese investment bank had committed more than $US10 billion to the company. As its estimated valuation cratered, WeWork last month ousted Neumann as CEO and, eventually, pulled its IPO in the face of investors who balked at its losses and corporate governance.\n\nThe debacle has been an embarrassment for SoftBank. It valued WeWork at $US47 billion as recently as the start of the year. Already, SoftBank has invested more than WeWork is estimated to be worth without its latest capital infusion - about $US8 billion.\n\nUnder the deal, Neumann is allowed to sell a little under $US1 billion of stock to the Japanese investment firm, said the people, who asked to remain anonymous because the agreement hasn't been announced.\n\nNeumann currently owns 22 per cent of WeWork. It couldn't immediately be learned what his stake will fall to after any sale to SoftBank. He will also get a roughly $US185 million consulting fee.\n\nSoftBank and JPMorgan declined to comment. WeWork couldn't immediately be reached.\n\nAdvertisement\n\nSoftBank's stock purchase from Neumann is part of a broader offer to buy as much as $US3 billion from existing shareholders, one of the people familiar with the matter said. The $US500 million credit line for Neumann will be secured by some of his stock. And a $US500 million loan to Neumann extended by JPMorgan, UBS and Credit Suisse will be repaid, one of the people said.\n\nWhen Neumann stepped down from the CEO role, it triggered terms of the loan that would have put him in technical default, according to a person familiar with the matter.\n\nJPMorgan had been pitching a $US5 billion debt package for WeWork. Last week, the company had been leaning toward the bank's plan over SoftBank's, because it wouldn't dilute existing shareholders or force the startup to cede control.\n\nBut disagreements over the company's valuation - JPMorgan's plan had pegged WeWork about $US5 billion - pushed the company toward SoftBank, which was willing to increase its equity stake and provide a payout to Neumann, according to a person familiar with the situation.\n\nFor his part, SoftBank chief Masayoshi Son is showing signs of contrition for the role he played in inflating WeWork's valuation. On a call Monday, Son apologised to investors in the first Vision Fund, which injected capital into WeWork at a valuation of north of $US21 billion in 2017, according to a person briefed on the matter.\n\nBloomberg", "description": "Just weeks ago Adam Neumann was running one of the world's most valuable startups. Today, WeWork is no longer his.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2648%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/d1ca77a31a268714a3390f01e260440744f8d68c", "published_at": "2019-10-23"}