{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-49803733", "downloaded_at": "2019-09-24 01:00:10.015783+00:00", "title": "US policeman suspended for arresting two six-year-olds", "language": "en", "text": "Image copyright Getty Images Image caption At least one child was handcuffed (file photo)\n\nA US police officer has been suspended after arresting two six-year-olds at a school in Orlando, Florida.\n\nOne of the two was handcuffed after throwing a tantrum and kicking a teacher, the girl's grandmother told US media.\n\nThe officer, Dennis Turner, was suspended as officials said he did not secure the necessary permissions to arrest the two.\n\nProsecutors say they will try to erase the arrests from their records.\n\nBoth children were charged with misdemeanour battery. Little about the other arrest - which was in a separate incident - has been made public.\n\n\"The children will not be prosecuted, and just as importantly I am looking into options that may reverse the legal damage such as removing the arrest from the children's records,\" said State Attorney Aramis Ayala in a news conference.\n\nPolice Chief Orlando Rolón said in a statement: \"As a grandparent of three children less than 11-years-old this is very concerning to me. Our department strives to deliver professional and courteous service.\"\n\nNeither child has been identified by police, but the grandmother of one of the children said she suffered sleep apnoea which had contributed to her behaviour.\n\nMeralyn Kirkland told NBC that when she went to retrieve her granddaughter from jail, \"they told us we had to wait a few minutes because [she] was being fingerprinted, and when she said fingerprinted it hit me like a tonne of bricks\".\n\n\"No six-year-old child should be able to tell somebody that they had handcuffs on them and they were riding in the back of a police car and taken to a juvenile centre to be fingerprinted, mug shot.\"\n\nAccording to Orlando Police, Mr Turner was retired from the police force but was working as security in the school as part of the local department's reserve unit.\n\nSchools have increasingly turned to hiring part-time officers since a series of deadly school shooting attacks, such as on Sandy Hook Elementary School in 2012 and Marjory Stoneman Douglas High School in 2018.\n\nAccording to AFP, 46% of US schools have an officer present on campus for at least one day of each week.", "description": "A six-year-old girl was handcuffed and charged with battery, her grandmother told US media.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/3DAF/production/_108919751_gettyimages-914038200.jpg", "published_at": "2019-09-23"}