{"pub": "atlantic", "url": "https://theatlantic.com/politics/archive/2019/09/modi-trump-politics-daily/598510", "downloaded_at": "2019-09-20 22:36:09.268476+00:00", "title": "The Atlantic Daily: Trump at the Modi-eo", "language": "en", "text": "Modi has made Hindu identity (and demonizing Muslims) a core part of his appeal. As Jonah Blank wrote in The Atlantic, Modi’s pitch has distinctly Trumpian themes: “We’re being outbred by minorities. We’re being laughed at by the world. We’re overrun with immigrants—and you know what kind. We’re second-class citizens in our own nation. Make India Great Again.”\n\nWhy Houston? Why now?\n\nPart of the reason that Modi is being ferreted to Houston may be a ploy to get coal-wary India to buy Texas oil, but Trump’s decision to tag along is a testament to the growing clout of the Indian diaspora, especially in Texas. (Though the deluge of flooding in Houston this week may dull the visibility of that clout on Sunday.)\n\nTexas used to be ruby red for Republicans, but that’s quickly changing—in part because of demographic shifts. As my colleague Ronald Brownstein has written, since 2010, the number of Asian Americans who moved to the state nearly matched the number of white people who did so. Some 120,000 Indian Americans live in the Houston area, part of the reason that it’s become the most diverse major city in the nation.\n\nBut the president has a lot of work to do to get Indian Americans aboard the Trump Train: Only something like 16 percent of Indian Americans voted for Trump in 2016, and the president’s immigration policies haven’t exactly helped to move that needle. So while Trump may be looking forward to gloating in front of an audience of 50,000, chances are he won’t be seeing all that many MAGA hats in the crowd.\n\n—Saahil Desai\n\nWhat Else We’re Watching\n\n(Carlos Barria / Reuters)\n\nExclusive: The DHS is finally going after white supremacists. Kathy Gilsinan reviewed the Department of Homeland Security’s new counterterrorism strategy, which is targeting the rise of domestic extremism, including white supremacy, with new money for prevention programs that have already seen funding and personnel cuts during the Trump presidency.\n\nYes, Yang matters. The tech executive might not pay much attention to social issues, but his emphasis on economic distress as the root of America’s problems harkens back to another businessman-turned-politician: Ross Perot. “Few politicians grasp how disruptive [automation] will be,” Peter Beinart argues.\n\nWe hardly knew ya, Bill. After failing to qualify for the September debate and barely cracking more than 1 percent in national polls, New York City Mayor Bill de Blasio announced last night that he would drop out of the Democratic presidential primary. You can keep track of who’s still in the race here.\n\nSome states are already blowing up their voting systems. To avoid situations where voters have to choose between the “lesser of two evils,” some states are looking to a ranked-choice voting system, where voters list candidates by order of preference and the least popular choices are eliminated if no one reaches a majority. That losers’ votes get redistributed based on who their voters ranked next. Maine will be the first to switch in 2020, Russell Berman reports.", "description": "The Indian prime minister holds a rally in Houston with Donald Trump. Plus: the DHS plan to go after white supremacists.", "authors": ["Saahil Desai", "Christian Paz"], "top_image": "https://cdn.theatlantic.com/assets/static/a/theatlantic/img/default-thumbnail.png", "published_at": "2019-09-20"}