{"pub": "independent", "title": "Rugby World Cup 2019: Jack Nowell has surgery to have appendix removed in setback to injury recovery", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-england-squad-jack-nowell-surgery-appendix-removed-operation-a9088851.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:07:18.262436+00:00", "text": "Jack Nowell has suffered fresh setback in his bid to be fit for the Rugby World Cup after being forced to have his appendix removed during England’s training camp in Italy.\n\nNowell has not played any rugby since the Premiership final on 1 June and is yet to return to full training, despite being named in the final 31-man squad to go to Japan by head coach Eddie Jones.\n\nThe wing was admitted to hospital for four nights after complaining of pain on his arrival in Treviso last Wednesday, and he underwent surgery the same night to remove his appendix.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe Exeter Chiefs back remained in hospital until Sunday, when he was released to continue his recovery with the rest of the squad.\n\n\"Jack was sick,” said England defence coach John Mitchell. “He had appendicitis and came out of hospital yesterday. He's nice and hungry! He's in good spirits and is back running.\n\nShape Created with Sketch. England Rugby World Cup squad Show all 32 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. England Rugby World Cup squad 1/32 England Rugby World Cup squad Eddie Jones has named his 31-man England squad. EPA 2/32 <b>Props:</b> Mako Vunipola Club: Saracens Caps: 53 Getty 3/32 <b>Props:</b> Joe Marler Club: Harlequins Caps: 58 PA 4/32 <b>Props:</b> Ellis Genge Club: Leicester Tigers Caps: 10 Getty Images 5/32 <b>Props:</b> Kyle Sinckler Club: Harlequins Caps: 58 Getty Images 6/32 <b>Props:</b> Dan Cole Club: Leicester Tigers CapsL 86 PA 7/32 <b>Hookers:</b> Jamie George Club: Saracens Caps: 37 Action Images via Reuters 8/32 <b>Hookers:</b> Luke Cowan-Dickie Club: Exeter Chiefs Caps: 12 EPA 9/32 <b>Hookers:</b> Jack Singleton Club: Saracens Caps: 1 10/32 <b>Locks:</b> Maro Itoje Club: Saracens Caps: 27 Reuters 11/32 <b>Locks:</b> George Kruis Club: Saracens Caps: 32 Action Images via Reuters 12/32 <b>Locks:</b> Joe Launchbury Club: Wasps Caps: 59 Getty 13/32 <b>Locks:</b> Courtney Lawes Club: Northampton Saints Caps: 59 Getty Images 14/32 <b>Back row:</b> Mark Wilson Club: Sale Sharks (on loan from Newcastle Falcons) Caps: 13 AFP/Getty Images 15/32 <b>Back-row:</b> Lewis Ludlam Club: Northampton Saints Caps: 1 Action Images via Reuters 16/32 <b>Back row:</b> Tom Curry Club: Sale Sharks Caps: 11 PA 17/32 <b>Back row:</b> Sam Underhill Club: Bath Caps: 9 Reuters 18/32 <b>Back row:</b> Billy Vunipola Club: Saracens Caps: 42 Getty 19/32 <b>Scrum-halves:</b> Ben Youngs Club: Leicester Tigers Caps: 86 20/32 <b>Scrum-halves:</b> Willi Heinz Club: Gloucester Caps: 1 Getty Images 21/32 <b>Fly-halves:</b> Owen Farrell Club: Saracens Caps: 70 EPA 22/32 <b>Fly-halves:</b> George Ford Club: Leicester Tigers Caps: 56 Getty 23/32 <b>Centres:</b> Piers Francis Club: Northampton Saints Caps: 5 Getty Images 24/32 <b>Centres:</b> Manu Tuilagi Club: Leicester Tigers Caps: 33 REUTERS 25/32 <b>Centres:</b> Henry Slade Club: Exeter Chiefs Caps: 22 Getty Images 26/32 <b>Centres:</b> Jonathan Joseph Club: Bath Caps: 41 Getty Images 27/32 <b>Wings:</b> Jonny May Club: Gloucester Caps: 45 EPA 28/32 <b>Wings:</b> Anthony Watson Club: Bath Caps: 34 PA 29/32 <b>Wings:</b> Joe Cokanasiga Club: Bath Caps: 5 Getty Images 30/32 <b>Back-three:</b> Ruaridh McConnochie Club: Bath Caps: 0 Getty 31/32 <b>Back three:</b> Jack Nowell Club: Exeter Chiefs Caps: 33 Getty 32/32 <b>Back-three:</b> Elliot Daly Club: Saracens Caps: 31 Getty Images 1/32 England Rugby World Cup squad Eddie Jones has named his 31-man England squad. EPA 2/32 <b>Props:</b> Mako Vunipola Club: Saracens Caps: 53 Getty 3/32 <b>Props:</b> Joe Marler Club: Harlequins Caps: 58 PA 4/32 <b>Props:</b> Ellis Genge Club: Leicester Tigers Caps: 10 Getty Images 5/32 <b>Props:</b> Kyle Sinckler Club: Harlequins Caps: 58 Getty Images 6/32 <b>Props:</b> Dan Cole Club: Leicester Tigers CapsL 86 PA 7/32 <b>Hookers:</b> Jamie George Club: Saracens Caps: 37 Action Images via Reuters 8/32 <b>Hookers:</b> Luke Cowan-Dickie Club: Exeter Chiefs Caps: 12 EPA 9/32 <b>Hookers:</b> Jack Singleton Club: Saracens Caps: 1 10/32 <b>Locks:</b> Maro Itoje Club: Saracens Caps: 27 Reuters 11/32 <b>Locks:</b> George Kruis Club: Saracens Caps: 32 Action Images via Reuters 12/32 <b>Locks:</b> Joe Launchbury Club: Wasps Caps: 59 Getty 13/32 <b>Locks:</b> Courtney Lawes Club: Northampton Saints Caps: 59 Getty Images 14/32 <b>Back row:</b> Mark Wilson Club: Sale Sharks (on loan from Newcastle Falcons) Caps: 13 AFP/Getty Images 15/32 <b>Back-row:</b> Lewis Ludlam Club: Northampton Saints Caps: 1 Action Images via Reuters 16/32 <b>Back row:</b> Tom Curry Club: Sale Sharks Caps: 11 PA 17/32 <b>Back row:</b> Sam Underhill Club: Bath Caps: 9 Reuters 18/32 <b>Back row:</b> Billy Vunipola Club: Saracens Caps: 42 Getty 19/32 <b>Scrum-halves:</b> Ben Youngs Club: Leicester Tigers Caps: 86 20/32 <b>Scrum-halves:</b> Willi Heinz Club: Gloucester Caps: 1 Getty Images 21/32 <b>Fly-halves:</b> Owen Farrell Club: Saracens Caps: 70 EPA 22/32 <b>Fly-halves:</b> George Ford Club: Leicester Tigers Caps: 56 Getty 23/32 <b>Centres:</b> Piers Francis Club: Northampton Saints Caps: 5 Getty Images 24/32 <b>Centres:</b> Manu Tuilagi Club: Leicester Tigers Caps: 33 REUTERS 25/32 <b>Centres:</b> Henry Slade Club: Exeter Chiefs Caps: 22 Getty Images 26/32 <b>Centres:</b> Jonathan Joseph Club: Bath Caps: 41 Getty Images 27/32 <b>Wings:</b> Jonny May Club: Gloucester Caps: 45 EPA 28/32 <b>Wings:</b> Anthony Watson Club: Bath Caps: 34 PA 29/32 <b>Wings:</b> Joe Cokanasiga Club: Bath Caps: 5 Getty Images 30/32 <b>Back-three:</b> Ruaridh McConnochie Club: Bath Caps: 0 Getty 31/32 <b>Back three:</b> Jack Nowell Club: Exeter Chiefs Caps: 33 Getty 32/32 <b>Back-three:</b> Elliot Daly Club: Saracens Caps: 31 Getty Images\n\n\"His general ankle progression is in line with where he needs to be. He's right on target for us. I don't know how much weight he's lost but he looks lean.\"\n\nNowell continues to recover from ankle ligament surgery and as a result will not be a part of the squad that faces Italy this Friday in England’s final World Cup warm-up match, leaving him in a race against time to be fit for their opening pool game against Tonga on 22 September.\n\nEngland will also be without Mako Vunipola for the clash Italy at Newcastle’s St James’ Park, with the loosehead prop still around a week away from recovering from the hamstring setback he suffered in the victory over Ireland.\n\nHenry Slade is also set to miss out on the match unless he can prove his fitness in Tuesday’s main training session, having already sat out all three of England’s warm-up matches with a knee injury.", "description": "Jack Nowell has suffered fresh setback in his bid to be fit for the Rugby World Cup after being forced to have his appendix removed during England’s training camp in Italy. Nowell has not played any rugby since the Premiership final on 1 June and is yet to return to full training, despite being named in the final 31-man squad to go to Japan by head coach Eddie Jones.", "authors": ["Jack De Menezes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/02/15/jack-nowell.jpg"}