{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/any-brexit-triumph-boris-johnson-20557891", "downloaded_at": "2019-10-11 08:14:41.116133+00:00", "title": "Any Brexit triumph for Boris Johnson could soon turn into a headache for Jeremy Corbyn", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThere are few things more hazardous than a pack of journalists not in possession of all the facts.\n\n\n\nThat is the situation we find ourselves in this morning with Brexit.\n\n\n\nWe know the talks between Boris Johnson and Leo Varadkar went better than expected but we have no idea yet what concessions were made to break the deadlock.\n\n\n\nThe uncharacteristic lack of leaking from both sides - Dublin is normally as watertight as a colander - has been interpreted that a significant shift has taken place.\n\n\n\nMuch has also been read into Downing Street’s reticence, with the assumption that Johnson is about to abandon his red lines on the customs union.\n\nCautious voices have noted that any optimism could be misplaced and the EU is simply trying to avoid being the fall guy if the talks do collapse.\n\nWe should find out more after Michel Barnier’s talks with Brexit Secretary Stephen Barclay in Brussels this morning.\n\n(Image: REUTERS)\n\n\n\nJohnson and Varadkar said they can see a “pathway to a deal” but this is very different to saying an agreement can be ferried down an exclusive lane for ministerial limos on a cordoned-off motorway.\n\n\n\nIf the outline of an agreement can be struck then it will go into the “tunnel” - behind-the-scenes negotiations were both sides hammer out the fine details before the package is presented at next week’s EU summit.\n\n\n\nWe know from experience that any putative deal can unravel quickly when it enters EU council of 28 nations.\n\nLet us presume there is the basis for a deal.\n\n\n\nThe first question is whether it can be done before October 31 or will Johnson be forced to ask for an extension.\n\n\n\nOne of the reasons Jeremy Hunt lost the Tory leadership race was his refusal to commit to a deadline because he foresaw exactly this situation.\n\n\n\nSo it would be ironic if the Prime Minster was obliged to request a few more weeks in order to get an agreement over the line.\n\n\n\nHe could conclude this is a price worth paying if it means he can go into an election as the man who sorted Brexit.\n\n(Image: REUTERS)\n\n\n\n\n\n(British voters may be remarkably forgiving of a man who cleaned up the mess he was responsible for in the first place.)\n\n\n\nThe second major hurdle is getting any deal through Parliament.\n\n\n\nIf Johnson has ceded ground on a customs union he could struggle to gain the support of the DUP and several Tory ERG ultras leaving him reliant on Labour votes.\n\nA couple of dozen Labour MPs have signalled they will support whatever deal is presented just to make the issue go away.\n\n\n\nThis puts Jeremy Corbyn in a difficult position. The Labour leader has strong grounds to oppose a no-deal but he could face a backlash from some Labour voters if he is seen as the man who blocks the chance to finally end the Brexit nightmare.\n\n\n\nThe dilemma for Corbyn is that Johnson’s deal - if we get this far - could be far worse than Theresa May’s when it comes to environmental protections and workers’ rights.\n\n\n\nLabour MPs would be right to fear the consequences of Johnson’s deregulation but it could be a hard sell explaining to voters why they yet again voted down a deal.\n\n\n\nCorbyn also knows that if he did back Johnson a sizeable number of his backbenchers would rebel.\n\nAny triumph for Johnson could soon turn into a headache for Corbyn.\n\n\n\nToday's agenda:\n\n\n\nStephen Barclay holds talks with Michel Barnier in Brussels.\n\n\n\n12pm - Tulip Siddiq MP and Richard Ratcliffe to hold a press conference in Westminster today following the return of Gabriella Zaghari-Ratcliffe to the UK.\n\n\n\n12.30pm - EU ambassadors updated on state of Brexit talks.\n\n\n\nSNP conference is taking place in Aberdeen.\n\n\n\nWhat I am reading:\n\n\n\nIain Martin in the Times (£) on why Dominic Cummings has run out of road.", "description": "If Boris Johnson can secure a Brexit deal he will need the support of Labour MPs to get it through Parliament. How will Jeremy Corbyn respond?", "authors": ["Jason Beattie", "Image", "Getty Images", "Reuters"], "top_image": "https://i2-prod.dailyrecord.co.uk/incoming/article20554954.ece/ALTERNATES/s1200/0_Boris-Johnson-Meets-Irish-Taoiseach-To-Discuss-Brexit-Deal.jpg", "published_at": "2019-10-11"}