{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/24/number-drivers-fined-using-mobile-phones-record-low-amid-concerns", "downloaded_at": "2019-10-25 00:04:28.986376+00:00", "title": "Fines for using mobile phones at wheel at record low amid concerns there are not enough police to catch drivers", "language": "en", "text": "The number of drivers fined for using mobile phones has fallen to a record low, amid fears there are not enough police patrols to catch offenders.\n\nSome 38,600 fixed penalty notices were issued by police to offenders in 2018 compared with 53,000 during the previous 12 months, according to Home Office data.\n\nThis is the lowest amount since current records began in 2011.\n\nAA President Edmund King suggested more offenders would be deterred from using their phones and caught if there were more police patrols.\n\n\"We must not be complacent as often drivers are still spotted using phones at the wheel,\" he said.\n\n\"Only a fifth of drivers say there is a visible police presence on their local roads, so a more prominent presence would help to deter the use of hand-held mobiles and texting at the wheel.\"\n\nSince March 2017, motorists caught using a hand-held phone have faced incurring six points on their licence and a £200 fine - up from the previous penalty of three points and £100.\n\nA recent report by the Commons Transport Select Committee urged the Government to consider banning the use of mobiles in hands-free mode.\n\nIt claimed current laws which only proscribe the use of devices being held by drivers gives the \"misleading impression\" that hands-free use is safe despite it creating \"the same risks of a collision\".", "description": "The number of drivers fined for using mobile phones has fallen to a record low, amid fears there are not enough police patrols to catch offenders.", "authors": ["Greg", "Fraser Nelson", "Michael Deacon"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/24/TELEMMGLPICT000158036186-xlarge_trans_NvBQzQNjv4Bqek9vKm18v_rkIPH9w2GMNoGXySPv9M1Jbe0Fc3Bi1Fk.jpeg?imwidth=1200", "published_at": "2019-10-24"}