{"pub": "businessinsider", "url": "https://businessinsider.com/what-is-the-highest-credit-score-fico-vantagescore", "downloaded_at": "2019-10-19 11:36:26.510291+00:00", "title": "The highest credit score is 850, but you don't need it to get the best interest rates", "language": "en", "text": "The highest credit score is 850.\n\nYou don't need a perfect score to qualify for the best interest rates on loans, but your score will need to fall within the Good to Excellent range.\n\nIf you're looking to improve your score, making on-time payments is most important. But you'll also want to pay attention to other factors like credit utilization rate, credit length, credit mix, and new credit accounts.\n\nRead more personal finance coverage.\n\nYour credit score can affect your ability to secure a loan and the interest rate that you're able to qualify for. But even if you don't plan to apply for a mortgage, car loan, or credit card in the near future, your credit score may still impact your life.\n\nUtility companies, landlords, insurers, and cell phone companies have all been known to consider credit history when considering new customers. Building a good credit score can benefit you financially in multiple ways.\n\nBut what exactly is a good credit score? More specifically, what's the highest credit score? And does having the highest credit score even matter?\n\nWhat is the highest credit score?\n\nThe two most popular credit scoring models are FICO and VantageScore. In both scoring models, the highest credit score is 850.\n\nAt one time, the lowest possible scores on FICO and VantageScore were different. But now, the lowest possible score on both models is 300.\n\nDoes it matter if I don't have the highest credit score?\n\nIf you don't have a perfect score, there's no need to fret. Most people don't. According to Experian, only 1.2% of Americans have the highest credit score.\n\nSo does that mean that only 1.2% of people qualify for the best interest rates? No. You don't need an 850 credit score to qualify for prime interest rates. But you will want your score to fall within a certain range.\n\nAccording to MyFICO, there are five main scoring ranges:\n\nPoor : Below 580\n\n: Below 580 Fair : 580-669\n\n: 580-669 Good : 670-739\n\n: 670-739 Very Good : 740-799\n\n: 740-799 Exceptional: 800+\n\nWorking towards a credit score in the \"Good\" range would be a great initial goal. And if you're able to build a score that falls within the \"Very Good\" or \"Exceptional\" range, you can expect to receive some of the best interest rates currently available.\n\nIt's also possible to have no credit score whatsoever. If you've never applied for credit before or haven't used credit in more than 24 months, you could find yourself in this situation.\n\nIn its 2015 report, the Consumer Financial Protection Bureau found that 26 million people were \"credit invisible.\" While having no credit isn't the same as having bad credit, it still makes it difficult to qualify for the best rates on loans.\n\nHow to improve your credit score\n\nWhether you have a poor credit score or none at all, you can take action today towards building the score that you want. In both the FICO and VantageScore models, payment history is the most important factor. So if you're looking to improve your score, making on-time payments each month is a critical first step.\n\nNext, you'll want to consider your credit utilization ratio — the percentage of your available credit that you use each month. Aiming to keep your credit utilization ratio below 30% is a great start.\n\nOther factors that affect your credit score include your length of credit history, your credit mix, and new credit accounts that you recently opened. These factors aren't as influential, but paying attention to them could help you lift your score to the next level.\n\nWant to check your credit score? You can do so for free once every 12 months at AnnualCreditReport.com. Your bank or credit card issuer may provide your credit score for free as well. You can also use credit score sites like Credit Karma or Credit Sesame.\n\nMore coverage from How to Do Everything: Money", "description": "You don't need the highest credit score to qualify for the best interest rates, but your score will need to fall within the Good to Excellent range.", "authors": ["Clint Proctor"], "top_image": "https://image.businessinsider.com/5da63ba64af9094328049e85?width=1200&format=jpeg", "published_at": "2019-10-18"}