{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/judge-directs-state-department-hand-ukraine-documents-watchdog/story?id=66486489", "downloaded_at": "2019-10-24 02:35:22.666589+00:00", "title": "Judge directs State Department to hand over Ukraine documents to watchdog group", "language": "en", "text": "A federal judge has directed the State Department to begin delivering documents to a watchdog group that requested records related to the Trump administration’s interactions with the president’s personal attorney, Rudy Giuliani, about Ukraine.\n\nInterested in Ukraine? Add Ukraine as an interest to stay up to date on the latest Ukraine news, video, and analysis from ABC News. Add Interest\n\n\"The documents and records are of critical importance,\" U.S. District Judge Christopher Cooper said in a Washington, D.C., courthouse on Wednesday.\n\nThe documents were requested under the Freedom of Information Act by American Oversight, a watchdog organization founded by former Barack Obama administration officials.\n\nCooper directed the State Department to begin handing over the records within 30 days.\n\nTimothy A. Clary/AFP/Getty Images\n\nEarlier this month, American Oversight filed a lawsuit seeking to compel the State Department to begin \"processing and releasing senior officials' correspondence with Giuliani and other communications about efforts to pressure the Ukrainian government to open a political investigation,\" a press release from the group read.\n\n\"The lawsuit also sought the release of records related to the recall of U.S. Ambassador to Ukraine Marie Yovanovitch,\" the group added.\n\nThe administration’s interactions with Giuliani and the Ukrainian government are now the focus of an impeachment inquiry on Capitol Hill. Democrats have accused the president of engaging Ukraine’s new leader, Volodymyr Zelenskiy, in a quid pro quo.\n\nOn Tuesday, the United States' top diplomat in Ukraine, Ambassador Bill Taylor, told impeachment investigators that he believed actors inside and outside of the federal government had coordinated to withhold military aid to Ukraine until Zelenskiy expressed public support for investigations that may help President Trump politically.\n\nThe president fired back on Twitter on Wednesday, calling Taylor a \"Never Trumper.\"", "description": "A federal judge has directed the State Department to begin delivering documents to a watchdog group who requested records related Ukraine.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/rudy-giuliani-mo_hpMain_20191023-194552_16x9_992.jpg", "published_at": "2019-10-23"}