{"pub": "yahoo", "url": "https://sports.yahoo.com/yankees-considering-firing-pitching-coach-152344849.html", "downloaded_at": "2019-10-28 23:34:55.547550+00:00", "title": "Yankees fire pitching coach Larry Rothschild", "language": "en", "text": "UPDATE: That was fast. Rothschild has been fired.\n\n11:23 AM: Some teams just fire a guy and you never hear about the leadup to the decision. With the Yankees you get all kinds of inside leaking and speculation first. I guess it goes with the territory when there are a couple of dozen reporters dedicated to your beat, all chattering with their own inside sources.\n\nScroll to continue with content Ad\n\nAnyway: Buster Olney of ESPN reports that the Yankees “have discussed moving on from pitching coach Larry Rothschild.”\n\nRothschild has been the Yankees pitching coach since the 2011 season, staying on after Joe Girardi was fired and Aaron Boone took over. There has been speculation that Girardi, just hired by the Phillies, may bring Rothschild on board with his coaching staff if the Yankees let him go.\n\nAnd to be sure, there is a segment of Yankees fandom and observers who think Rothschild should go. The Yankees ranked sixth in team ERA in the American League this season, which is down a notch from 2018. Which was down two notches from 2017. That sort of thing tends to vary, of course — injuries and native talent level of the roster matter the most — and it’s not always clear how much control a pitching coach has over ultimate performance. It is the case, though, that the pitching coach is often held responsible for ultimate performance, and there is a sentiment out there that it’s time for the Yankees to move on from Rothschild.", "description": "Larry Rothschild has been the Yankees pitching coach since 2011.", "authors": ["Craig Calcaterra"], "top_image": "https://s.yimg.com/ny/api/res/1.2/kSTPpKcUEy8zTc.yxWQ0ng--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NDguOA--/https://s.yimg.com/uu/api/res/1.2/vfCfBeWXDJXErfKJB7dLwA--~B/aD0xMDgwO3c9MTg0NztzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/nbcsports.com/a9c077b9b1b73fd0c5ef1a32bea4bd35", "published_at": "2019-10-28"}