{"pub": "thehill", "url": "https://thehill.com/opinion/national-security/464664-then-there-were-10-when-does-living-history-outlive-its-value", "downloaded_at": "2019-10-08 12:52:55.853667+00:00", "title": "Then there were 10: When does living history outlive its value?", "language": "en", "text": "To an aviation enthusiast or history lover, little compares with the joyous grumble of a large radial aircraft engine.\n\nMy dad flew twin-engine C-47 transports in the European Theater of Operations in World War II; the indomitable “Skytrain” mounted two of these engines. Their concussive song rivals anything by Beethoven (and I love Beethoven).\n\nThe magnificent B-17 “Flying Fortress” bested the C-47 by two — four big Wright R-1820 “Cyclone” engines, each developing almost 1,000 horsepower.\n\nADVERTISEMENT\n\nOf nearly 13,000 B-17s lifted aloft by those radial engines to end tyranny in Europe and Asia, only 47 remain. Until Oct. 2, 11 of them were airworthy; that day B-17G Nine-O-Nine was lost, along with seven lives, in a crash in Connecticut.\n\nThese airplanes are nearly eight decades old. They belong to a period of American history that, with the passage of its veterans and the passage of American innocence, has catapulted into the glamorous embrace of millions here and abroad.\n\nRestoring these old “warbirds” is honorable business, the work of dedicated amateurs and professionals who lovingly return rusting metal and shredded fabric to its wartime glory. It has been my privilege to work with some of them, restoring a B-17G like the one now destroyed. The difference is that the bird we restored will never fly, will never crash.\n\nAn airplane is a machine. The lifeblood of that machine called “B-17” is high-octane gasoline. Its moving parts are lubricated by flammable oil and other fluids, all traveling through plumbing designed barely three decades after the Wright Flyer’s first powered flight of 120 feet in 1903. The electrical systems … well, you get the picture.\n\nThese airplanes were experiencing disastrous failures when they were new.\n\nADVERTISEMENT\n\nA news article states that such crashes are rare — one here, one there. But remember, there are relatively few of these planes flying. The ratios, taken into consideration, suggest a different picture of risk. Two previous B-17 crashes, one in 1987 and one in 2011, thankfully spared lives; I would say they were lucky. On Oct. 2, the luck ran out.\n\nTwo of the lives lost belonged to the skilled pilots who had thousands of hours flying the B-17. If pilot error is cited as contributing to the crash, it’s reasonable to assert that no pilot could better handle Nine-O-Nine’s predicament.\n\nI earned my private pilot’s license when I was 20, just before I left for the Army. I recently flew aboard a C-47 like the one my dad flew. I did so fully aware that I was taking a risk different from any associated with a flight aboard a modern airliner. I wonder if many passengers stepping aboard warbirds are as aware.\n\nDuring that short flight, I was struck by how hard these pilots worked to get, and keep, the airplane off the ground — coordinating unceasingly; flying the airplane was physically and mentally demanding. Flying these complex airplanes was the business of young, superbly trained pilots at the peak of their physical and mental abilities. And even they occasionally “got it wrong.”\n\nIs this a call to end the flight of these old machines that we call “living history”? After all, many enthusiasts think they cannot be truly appreciated unless in flight. (In fact, many warbird interiors have been changed to accommodate civilian passengers. Gun turrets are gone. Their instrument panels are updated. Few flying warbirds have interiors as meticulously restored as a good static display bird.)\n\nAnd many of the old warbirds are flying, offering the incomparable experience of a powerful, legendary machine in operation. They are kept aloft with rebuilt parts, specialized skills handed down through generations of mechanics, deep pockets, generous donations, and sheer love for machines that reflected the best in us during a struggle to vanquish the worst.\n\nCurrently, hundreds of C-47s and DC-3s — the civilian version — are flying, many earning their keep hauling passengers and freight all over the world. They thunder across the Atlantic in warrior colors to commemorate D-Day. We thrill to P-51 “Mustangs” beating up the field at airshows, and AT-6 “Texans” too; there are quite a few of them left.\n\nI suggest, however, that at some point, the responsible warbird lover must question if a bird is better grounded — honored in “static” display, like that Fortress I helped restore to pristine beauty, as it looked when it came off the line in 1945.\n\nAt what point does the experience of future generations outweigh the present sacrifice of those who yearn to feel the thrill of flight in a machine built to subdue nations but is now being subdued by that greatest of vanquishers, time?\n\nI would suggest that such a point is in view when we are down to 10.\n\nJeffrey E. Phillips retired from the U.S. Army as a major general with 37 years of service and now directs a Washington-based nonprofit that supports the military’s Reserve and National Guard units. The views expressed here are the author’s alone.", "description": "At some point, the responsible warbird lover must question if a bird is better grounded — subdued by that greatest of vanquishers, time.", "authors": [], "top_image": "https://thehill.com/sites/default/files/b17_bomber_10072019_1.jpg", "published_at": "2019-10-08"}