{"pub": "dailybeast", "url": "https://seattletimes.com/seattle-news/politics/a-look-at-whos-hosting-trump-at-seattle-fundraiser", "downloaded_at": "2019-10-08 15:03:53.371055+00:00", "title": "A look at big names hosting Trump for Seattle fundraiser Aug. 30", "language": "en", "text": "A Seattle-area fundraiser planned for Republican presidential nominee Donald Trump will be hosted by prominent Northwest investors and real-estate developers, according to an invitation.\n\nDonald Trump’s planned campaign swing through Washington in late August will include a Seattle fundraiser hosted by prominent Pacific Northwest investors and real-estate developers.\n\nThe Republican presidential nominee’s Aug. 30 fundraiser is scheduled for late afternoon at an undisclosed location, according to an invitation.\n\nHosts of the event will include longtime Seattle real-estate developer Martin Selig and Vancouver-based developer Clyde Holland, who held a fundraiser for Trump rival Jeb Bush’s super PAC in Seattle last year.\n\nTrump’s hosts also will include Vancouver-area billionaire Ken Fisher, founder of Fisher Investments, which manages assets of more than $60 billion. (He has written several best-selling books and a long-running investment advice column for Forbes.)\n\nFisher and Holland are big donors to state GOP causes — each gave more than $100,000 in July to the Reagan Fund, a political-action committee devoted to flipping control of the Washington state House to Republicans.\n\nOther hosts include: state GOP chairman Susan Hutchison; state Sen. Don Benton, R-Vancouver, Trump’s campaign director in Washington; and Hossein Khorram, an Iranian-American apartment developer and GOP activist from Clyde Hill.\n\nPortland investor Peter Stott and hotelier Bashar Wali also are listed as hosts.\n\nTickets for the event will cost donors $2,700 apiece, with high rollers paying $10,000 per couple for a photo reception with Trump, or $25,000 for dinner and a photo. For $100,000 per couple, event co-chairs will get a VIP meeting with the candidate.\n\nIn an email, Khorram said the fundraiser’s location has not yet been determined.\n\nIf donors come through with those big checks, the event should help Trump make up a big fundraising gap in Washington state.\n\nSo far, he has raised about $270,000 from Washington donors, according to Federal Election Commission filings. Democratic presidential nominee Hillary Clinton has raised $4.5 million in this state.\n\nTrump’s August visit also is expected to include public rallies, but details have not been released. He made his first campaign foray to Washington in May, with public events in Spokane and Lynden.", "description": "A Seattle-area fundraiser planned for Republican presidential nominee Donald Trump will be hosted by prominent Northwest investors and real-estate developers, according to an invitation.", "authors": ["Seattle Times Political Reporter", "Jim Brunner"], "top_image": "https://static.seattletimes.com/wp-content/uploads/2016/08/28f9fca8-5b45-11e6-98c3-8c3d24d6f4a5-780x501.jpg", "published_at": "2016-08-05"}