{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/fc-bayern-munich-announces-digital-token-to-boost-fan-engagement", "downloaded_at": "2019-10-11 12:31:14.492506+00:00", "title": "FC Bayern Munich Announces Digital Token to Boost Fan Engagement", "language": "en", "text": "Germany’s FC Bayern Munich has become the latest football club to announce blockchain-based merchandise for fans. As reported Oct. 11, the club will partner with Stryking Entertainment to produce digital collectibles of its players.\n\nPlay FC Bayern Munich past vs. present\n\nThe collectibles will take the form of digital player cards with the likenesses of FC Bayern Munich players, past and present.\n\nStryking is also creating a fantasy-league style challenge for the cards, offering a gameplay aspect to the collectibles. Fans can build virtual squads and play each other with outcomes derived based on current form and historical data.\n\nMore clubs are expected to join Stryking as licensing partners for the system.\n\nJust the latest football/blockchain link-up\n\nThere seems to have been quite a trend for European football clubs to sell tokenized collectibles of late.\n\nJust last month, Spanish club Atletico Madrid announced the launch of its own fan token. The 2 euro token will give fans voting rights, and allow access to merchandise and games.\n\nMeanwhile, English Premier League club Manchester City is also upping its blockchain game, announcing in August that it is to tokenize its players. Fans can build and train a digital team of players using real-life match stats and in-app training.\n\nAlso last month, another Premier League club, Watford FC, started accepting Bitcoin (BTC) for its merchandise and put the Bitcoin logo on its shirt sleeve in an unprecedented move.", "description": "FC Bayern Munich to launch digital collectibles of its players using blockchain technology", "authors": ["Jack Martin"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvMmU0NDMxZjJmY2QwN2IzMTM4YzQ0ZmZlMmI5Y2UzZWYuanBn.jpg", "published_at": "2019-10-11"}