{"pub": "abcnews", "url": "https://abcnews.go.com/US/thousands-fresh-apples-recalled-listeria-concerns-michigan-produce/story?id=66609144", "downloaded_at": "2019-10-29 15:06:53.550813+00:00", "title": "Thousands of fresh apples recalled over listeria concerns by Michigan produce company", "language": "en", "text": "North Bay Produce is recalling apples over potential listeria contamination concerns.\n\nThe Traverse City, Michigan-based food and beverage company issued the voluntary recall on Monday for 2,297 cases and 2 bulk bins of fresh apples due to the potential to be contaminated with listeria monocytogenes, according to theU.S. Food and Drug Administration.\n\nThe bad apples were distributed to wholesalers, retailers and brokers in Florida, Illinois, Kentucky, Louisiana, Michigan, North Carolina, Texas and Wisconsin from Oct. 16 to Oct. 21.\n\nThe fresh apple varieties included McIntosh, Honeycrisp, Jonathan, Fuji, Jonamac and Red Delicious apples, according to the FDA recall statement.\n\n\"Recalled apples were sold in plastic bags under the brands; Great Lakes, North Bay Produce Pure Michigan as well as unbranded in clear plastic tote bags, white paper tote bags, and individually from retailers display trays,\" the FDA said.\n\nFDA\n\nClick here for a full list of products, descriptions and photos.\n\nIn Monday's recall, the FDA said the listeria monocytogenes organism can \"cause serious and sometimes fatal infections in young children, frail or elderly people, and others with weakened immune systems.\"\n\nShort-term symptoms in healthy individuals can include high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea. Listeria infection can cause miscarriages and stillbirths among pregnant women, according to the FDA.\n\n\"The recall was initiated as a result of a finished product test that indicated the presence of the organism. Upon notification, we immediately ceased the production and distribution product from the identified facility and continue our investigation as to what caused the issue, in cooperation with FDA,\" the company said in a statement.\n\nNorth Bay Produce notified commercial customers and has worked with them to \"remove recalled product from commerce.\"", "description": "North Bay Produce issued a voluntary recall of six fresh apple varieties through the FDA over concerns of listeria monocytogenes.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/recall-1-ht-er-191029_hpMain_16x9_992.jpg", "published_at": "2019-10-29"}