{"pub": "washingtontimes", "title": "California lawmakers eye bills on vaccines, guns, housing", "url": "https://washingtontimes.com/news/2019/sep/2/california-lawmakers-eye-bills-on-vaccines-guns-ho", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:06:39.527622+00:00", "text": "SACRAMENTO, Calif. (AP) - California state lawmakers have just two weeks remaining in their session to sort through hundreds of bills, some addressing volatile topics such as vaccinating children and shootings by police.\n\nThe session that began in January will end Sept. 13 after lawmakers pile bills on the desk of freshman Gov. Gavin Newsom. He’ll have until mid-October to approve or veto the legislation.\n\nHere are a few bills under consideration.\n\n___\n\nVACCINATIONS\n\nNewsom supports a proposed crackdown on doctors who sell what health officials say are bogus medical exemptions for families who want to avoid having their children vaccinated. The bill he negotiated with Sen. Richard Pan, a fellow Democrat, would give state health officials oversight of doctors who grant more than five medical exemptions annually and schools with vaccination rates less than 95%.\n\nIt has been one of the year’s most contentious bills. One activist is charged with shoving Pan, while others disrupted a legislative hearing on Friday. Opponents say the bill interferes with parental choice and doctors’ decisions.\n\nSB276 is awaiting passage in the Assembly, but it would have to go back to the Senate for final action.\n\n___\n\nGIG ECONOMY\n\nCalifornia could force companies like Uber and Lyft to treat their drivers like employees, guaranteeing them minimum wage, workers compensation and other protections. The proposal would be the nation’s strictest on worker classification, potentially setting a precedent for other states. Assemblywoman Lorena Gonzalez, a Democrat, says her measure would protect workers. But companies say workers want to be independent because it gives them flexibility.\n\nThe companies are trying to negotiate with Newsom and unions over a separate bill with different requirements for gig companies. Uber, Lyft and DoorDash are threatening to spend at least $90 million on a California ballot measure if they can’t make a deal.\n\nAssembly Bill 5 is now before the Senate.\n\n___\n\nPOLICE USE OF FORCE\n\nNewsom has already signed a law allowing police to use deadly force only when it is necessary to prevent death or serious injury. A companion bill supported by law enforcement would require training for officers in de-escalating confrontations. Advocates say the combination would give California the most sweeping response to public outrage over police shootings.\n\nSB230 is awaiting consideration in the Assembly and would have to return to the Senate for final action.\n\n___\n\nPG&E;\n\nLawsuits against Pacific Gas & Electric in several devastating wildfires caused by its equipment forced the company to file for bankruptcy in January. Lawmakers have set up a fund to help utilities pay for future wildfire claims. But some lawmakers, led by Republican Assemblyman Chad Mayes, want to go further by allowing PG&E; to borrow money against its future profits to help pay past claims. It’s a politically sensitive issue, as many lawmakers don’t want to do anything that would help the utility. AB235 is currently blocked in the Senate Rules Committee.\n\nIt would have to clear the Senate and the Assembly.\n\n___\n\nCOLLEGE ATHLETICS\n\nPotential landmark legislation would allow athletes at state colleges and universities to profit from the use of their names, likenesses and images. The bill stops short of paying players a salary, but it would let them hire an agent and accept paid endorsements. Schools oppose the bill after NCAA President Mark Emmert warned that such a law could prevent California schools from competing for national championships. NCAA rules bar payments to student athletes.\n\nSenate Bill 206 has cleared the Senate and is awaiting Assembly action.\n\n___\n\nPRIVACY\n\nCalifornia passed a law last year that forces companies to tell consumers what data they collect about them and allows consumers to refuse to let that data be sold.\n\nLawmakers are considering several amendments before the law goes into effect on Jan. 1, including an exemption for employers collecting data about employees.\n\nThose new bills have passed the Assembly and are awaiting action in the Senate.\n\n___\n\nHOUSING\n\nMost of the big ideas intended to ease California’s housing crisis failed to pass this year. But a remaining measure from Democratic Assemblyman David Chiu would cap annual rent increases at 7% plus inflation. The cap would expire in 2023 and would not apply to landlords leasing fewer than 10 single-family homes or to properties built in the past decade.\n\nAssembly Bill 1482 was sent Friday to the Senate Rules Committee, indicating negotiations are still underway.\n\n___\n\nFIREARMS\n\nOne proposal would limit sales of the type of rifle used in recent shootings at a Poway synagogue and a Gilroy food festival to one a month for adults and bar sales to anyone under 21. A “red flag” effort would let employers and co-workers seek gun-violence restraining orders from judges if someone poses a significant danger of harm and if less restrictive alternatives have been ineffective. The restraining order would require the subject to surrender their firearms.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "California state lawmakers have just two weeks remaining in their session to sort through hundreds of bills, some addressing volatile topics such as vaccinating children and shootings by police.", "authors": ["The Washington Times Http"], "top_image": ""}