{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7575673/National-Enquirer-SHREDDED-secret-documents-damaging-Trump-stories-Ronan-Farrow-claims.html", "downloaded_at": "2019-10-15 16:36:52.552482+00:00", "title": "National Enquirer SHREDDED secret documents of damaging Trump stories, Ronan Farrow claims", "language": "en", "text": "The National Enquirer shredded documents of damaging information regarding Trump that were hidden in a safe just before the 2016 election, journalist Ronan Farrow alleges in his new book Catch and Kill.\n\nThe book alleges that in the first week of November 2016, National Enquirer editor in chief Dylan Howard ordered a staff member to 'get everything out of the safe' and said 'we need to get a shredder down there.'\n\nThis reportedly happened the same day a Wall Street Journal reporter called the Enquirer for a comment on a story about how parent-company American Media (AMI) bought former Playboy model Karen McDougal's story about her affair with Donald Trump, paying $150,000 for it and then never publishing it.\n\n'The staffer opened the safe, removed a set of documents, and tried to wrest it shut,' Farrow writes in the bombshell book out Tuesday. 'Later, reporters would discuss the safe like it was the warehouse where they stored the Ark of the Covenant in Indiana Jones, but it was small and cheap and old.'\n\nRonan Farrow claims in his new book that National Enquirer editor in chief Dylan Howard ordered a staff member to shred 'dirt' on Trump that was in the safe\n\nFarrow quotes Enquirer employees who say a trash disposal crew came later in the day to collect a 'larger than customary volume of refuse'.\n\nFarrow's book Catch and Kill is available Tuesday\n\nAccording to Farrow, Howard has previously put together a list of the 'dirt' the paper had on Trump dating back decades.\n\nAfter the election, Trump's former lawyer and fixer Michael Cohen reportedly asked for all of AMI's documents about the prescient.\n\nCohen would eventually plead guilty to campaign finance violations alleging he, Trump and the tabloid were involved in buying the silence of a porn actress and a Playboy model who alleged affairs with Trump.\n\n'There was an internal debate: some were starting to realize that surrendering it all would create a legally problematic paper trail, and resisted,' Farrow writes. 'Nevertheless, Howard and senior staff ordered the reporting material that wasn't already in the small safe exhumed from storage bins in Florida and sent to AMI headquarters.'\n\nAll the Trump documents were first put in a small safe and then transferred to a larger safe in AMI's headquarters.\n\n'It was only later, when one of the employees who had been skeptical started getting jumpy and went to check, that they found something amiss: the list of Trump dirt didn't match up with the physical files,' Farrow writes. 'Some of the material had gone missing.'\n\nBut Farrow says that Howard swore to colleagues that 'nothing had ever been destroyed,' - a claim he maintains to this day.\n\nAn American Media spokesperson said in a statement: 'Mr. Farrow's narrative is driven by unsubstantiated allegations from questionable sources and while these stories may be dramatic, they are completely untrue.'\n\nThe book alleges that in the first week of November 2016, Dylan Howard (pictured) ordered a staff member to 'get everything out of the safe' and said 'we need to get a shredder down there.'\n\nThe National Enquirer payed Playboy model Karen McDougal a $150,000 payment in exchange for 'life rights' to any story about an affair with a married man and then never published it - a similar She claims she had a year-long sexual affair with Trump\n\nLast year, federal prosecutors had granted immunity to National Enquirer chief David Pecker, potentially laying bare his efforts to protect his longtime friend Trump.\n\nThe Associate Press first reported last year that the Trump records were stored alongside similar documents pertaining to other celebrities' catch-and-kill deals, in which exclusive rights to people's stories were bought with no intention of publishing to keep them out of the news - also the name of Farrow's book.\n\nBy keeping celebrities' embarrassing secrets, the company was reportedly able to ingratiate itself with them and ask for favors in return.\n\nBut after The Wall Street Journal initially published the first details of Playboy model Karen McDougal's catch-and-kill deal shortly before the 2016 election, those assets became a liability.\n\nFearful that the documents might be used against American Media, Pecker and the company's chief content officer, Dylan Howard, removed them from the safe in the weeks before Trump's inauguration, according to one person directly familiar with the events.\n\nFive people familiar with the National Enquirer's parent company, American Media Inc., who spoke to the AP on the condition of anonymity because they signed non-disclosure agreements, said the safe was a great source of power for Pecker, the company's CEO.\n\nAt the time it was unclear whether the documents were destroyed or simply were moved to a location known to fewer people.\n\nJerry George, a longtime Enquirer reporter who left the publication in 2013, said the practice of catch and kill took root at the Enquirer under Pecker. Though George had no personal knowledge of Trump-specific catch and kills, he said that AMI generally paid hush money only if it believed it had something to gain.\n\n'It's ''I did this for you,'' now what can you do for me,' George said. 'They always got something in return.'\n\nCatch and kills were loathed by the National Enquirer's reporters, he said, because they robbed the publication of juicy stories.\n\nThe National Enquirer was accused of cozying up to Trump, putting Trump on the cover in January 2016 and again in December 2016 - after he had won the election\n\nDonald Trump and David Pecker have a long relationship. They were pictured together in 2004 when Trump presented Pecker with a distinguished alumnus award from Pace University, in New York, which the AMI publisher graduated in 1972\n\nFormer Enquirer employees who spoke to the AP said that negative stories about Trump were dead on arrival dating back more than a decade when he starred on NBC's reality show 'The Apprentice.'\n\nIn 2010, at Cohen's urging, the National Enquirer began promoting a potential Trump presidential candidacy, referring readers to a pro-Trump website Cohen helped create. With Cohen's involvement, the publication began questioning President Barack Obama's birthplace and American citizenship in print, an effort that Trump promoted for several years, former staffers said.\n\nThe Enquirer endorsed Trump for president in 2016, the first time it had ever officially backed a candidate. In the news pages, Trump's coverage was so favorable that the New Yorker magazine said the Enquirer embraced him 'with sycophantic fervor.'\n\nPositive headlines for Trump, a Republican, were matched by negative stories about his opponents, including Hillary Clinton, a Democrat: An Enquirer front page from 2015 said 'Hillary: 6 Months to Live' and accompanied the headline with a picture of an unsmiling Clinton with bags under her eyes.", "description": "Ronan Farrow claims in his new book that editor in chief Dylan Howard ordered a staff member to shred 'dirt' on Trump that was in a safe.", "authors": ["Kayla Brantley For Dailymail.Com", "Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/16/19748562-0-image-a-8_1571154222662.jpg", "published_at": "2019-10-15"}