{"pub": "cnbc", "url": "https://cnbc.com/2019/10/08/4-fast-growing-green-jobs-pay-up-to-90000-a-year-for-people-who-love-the-environment.html", "downloaded_at": "2019-10-08 15:49:37.548614+00:00", "title": "4 fast-growing green jobs that can pay up to $90,000 a year", "language": "en", "text": "Helping to protect the planet by promoting sustainability can also be good for your bottom line. Many eco-friendly, or green, jobs are expected to grow over the next decade, according to an April 2019 report from The Bureau of Labor Statistics, and many of them pay well, too. The BLS identified 10 environmentally focused careers, which, it notes, pay \"well above the $38,640 median annual wage for all occupations in 2018.\" These are hands-on jobs that tend to require specific expertise and training, as well as, at minimum, an associate's or a bachelor's degree. People in these professions tend to work directly with agriculture or natural resources. They may also analyze data in a lab to seek solutions to environmental problems, like water pollution or waste disposal. Here are four green jobs with high median annual wages in 2018 that will also, BLS predicts, see \"rapid employment growth.\"\n\n1. Environmental engineering technicians\n\nTwenty/20\n\nMedian annual wage: $50,560 After environmental engineers develop devices used to clean up pollution, technicians step in to put them to work. It's also typical for technicians to test, operate, and modify that equipment while analyzing soil or groundwater samples. Although that may include disposing lead, asbestos, and other hazardous material, according to the BLS. On the plus side, an associate degree is all that's needed to enter the field.\n\n2. Environmental scientist and specialist\n\nTwenty/20\n\n3. Hydrologist\n\nTwenty/20\n\nMedian annual wage: $79,370 Hydrologists analyze how the movement of water influences the environment. Hydrologists spend time in the field collecting water and soil samples to test pH or pollution levels, and that may require hiking for long distances while carrying necessary equipment, according to the BLS. Some hydrologists begin their careers with a master's degree. Advanced researchers typically need a Ph.D.\n\n4. Atmospheric and space scientist\n\nGetty Images", "description": "These environmentally focused green or eco-friendly careers, according to BLS, paid \"well above the $38,640 median annual wage for all occupations in 2018.\" They're also expected to see \"rapid employment growth.\"", "authors": ["Myelle Lansat"], "top_image": "https://image.cnbcfm.com/api/v1/image/105860465-1555611990787gettyimages-539327404.jpeg?v=1555612029", "published_at": "2019-10-08"}