{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/breaking-milton-keynes-stabbings-man-20669552", "downloaded_at": "2019-10-22 13:37:14.158580+00:00", "title": "Milton Keynes stabbings: Man, 21, arrested after two teenagers killed at house party", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA 21-year-old man has been after two teenagers were killed at a house party.\n\nTwo 17-year-old boys died in the incident.\n\nThames Valley Police said a man was arrested on Monday evening and remains in custody.\n\nHe has been charged with two counts of murder, and two counts of attempted murder.\n\nThe force said: \"The arrest is in connection with an incident in Archford Croft, Emerson Valley, Milton Keynes at 11.59pm on Saturday, when officers were called to a report of a stabbing.\n\n\"A 17-year-old boy died of his injuries at the scene. A second boy, also 17, was taken to hospital where he also sadly died.\"\n\nThe pair who died have been named as Dominic Ansah and Ben Gillham-Rice.\n\n(Image: Vagner Vidal/Hyde News & Picture)\n\n(Image: Vagner Vidal/Hyde News & Picture)\n\nThe teens were among 15 to 20 invited guests at the private 23rd birthday party.\n\nOne of the boys died at the scene while the other passed away in the early hours after being rushed to hospital.\n\nPolice said earlier two other males, aged 17 and 23, were injured in the incident.\n\nThe pair suffered serious but not life-threatening injuries, the force added.", "description": "Dominic Ansah and Ben Gillham-Rice, both 17, died in the incident in Emerson Valley, Milton Keynes on Saturday night", "authors": ["Talia Shadwell", "Image", "Vagner Vidal Hyde News", "Pictures Ltd", "Picture"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20660243.ece/ALTERNATES/s1200/1_PAY-Double-murder-hunt-as-teenage-boys-stabbed-to-death1.jpg", "published_at": "2019-10-21"}