{"pub": "zdnet", "url": "https://www.zdnet.com/article/pixel-4-no-added-value-way-too-late-and-more-expensive-than-iphone-11", "downloaded_at": "2019-10-15 16:25:10.818273+00:00", "title": "Google Pixel 4: No added value, way too late, and more expensive than iPhone 11", "language": "en", "text": "Google faces a high bar as Pixel 4 follows Apple, Amazon, Microsoft showcases Made by Google 2019 has a few tough acts to follow, explains Larry Dignan, as Apple, Amazon and Microsoft all recently outlined strong product lineups and even some 2020 plans. Read more: https://zd.net/2ATO63L\n\nGoogle has launched the Pixel 4 and Pixel 4 XL smartphones after months of leaks, which left virtually nothing to the imagination.\n\nThe specs\n\nThe anticlimactic event confirmed everything we already knew: The devices are powered by Qualcomm's Snapdragon 855 platform and have an upgraded camera system that puts them on par with the Samsung Galaxy S10/S10 Plus and the iPhone 11.\n\nIf you compare the specifications of the Pixel 4 and S10, they are very similar, with some minor differences. The Pixel 4 XL has a display with a 90Hz refresh rate, which gives it a slight edge over the S10 Plus, with a 534ppi pixel density (compared to the S10 at 522ppi) and identical screen resolution at 1440x3040.\n\nThe S10 Plus has three main cameras, whereas the Pixel 4 XL only has two. Both the Pixel 4 and the S10 Plus use specialized machine learning chips and software to assist in image processing, such as for low light photography.\n\nThe main difference the Pixel 4 has from its competitors is that it utilizes a front camera and sensor array similar in functionality -- although not in technology implementation -- to the iPhone 11's Face ID. That means it eschews the under-screen fingerprint sensor of the S10 (and other devices like the Huawei P30 and the OnePlus 7) entirely for facial recognition.\n\nMemory-wise, both variants of the Pixel 4 have 6GB of RAM and are only offered in 64GB and 128GB versions. They have no SD expansion card capability like the Samsung Galaxy S10 and other Android devices feature. Instead, Google provides the end-user with unlimited cloud storage for Google Photos, at native camera resolution in uncompressed formats. Samsung offers the Galaxy S10 in multiple memory configurations, with 8GB and 12GB RAM variants, and with a base level of 128GB of storage.\n\nThe prices\n\nThe 64GB 5.7-inch Pixel 4 starts at $799, with the 128GB version costing $899 (comparatively, Apple's storage increase increments are done at $50 bumps). The Pixel 4XL starts at $899 with 64GB and goes up to $999 with 128GB. The comparable to the Samsung Galaxy S10 with 8GB of RAM and 128GB of storage, which is on streets for under $859, and the Samsung Galaxy S10 Plus with 8GB of RAM and 128GB of storage can be purchased factory-unlocked for under $959.\n\nThe 64GB iPhone 11 with its excellent twin camera system is $699, and the 64GB iPhone 11 Pro is $999. This is before any applicable iPhone trade-in, which most iPhone buyers are going to do. Yes, Google has an equivalent trade-in program, but it is less aggressive on trade-in value than Apple and Samsung, too. Google is the underdog, with only a 2.23% market share in North America; it should be more aggressive than either of these two. It isn't.\n\nThe Pixel 4 and Pixel 4 XL are just as expensive -- and, in their base configurations, arguably, less capable -- than the base level Samsung Galaxy S10 and S10 Plus, respectively. Never mind how much more expensive they are than other Qualcomm Snapdragon 855 phones, such as the OnePlus 7 Pro, which is $829. Oh yeah, and the S10 shipped seven months ago in March 2019.\n\nThe just-launched Pixel 4 is using technology that is already on its way out, as the Qualcomm Snapdragon 865 was just announced and is expected to launch in November.\n\nWhy do we need the Pixel?\n\nWell, it's because Google has made a complete and utter mess of its OEM ecosystem. The toxic hellstew.\n\nSeriously, what would be the point of Google releasing its own Android hardware if it could get its OEMs to update their devices on a timely basis? The Samsung S10 is only now entering beta for Android 10. And that's the company's flagship if you don't count the Note 10, which only recently started shipping at the end of August. Never mind how long it is going to take to get to the S9, or even the S8, which is unlikely to get updates to the latest version.\n\nThat's just Samsung, Google's top OEM partner. That's not counting LG, Lenovo/Motorola, OnePlus, Huawei, ZTE, and any number of second-tier OEMs. Sure, Google launched the Android One program -- which, if everyone were on board, would eliminate the need for a Pixel device. But nobody other than a few firms, like Nokia and Xiaomi, want to be a member of that club or launch their top-of-the-line hero devices in it. You won't find the Galaxy S10 or Note10 on it.\n\nIf you wanted to see innovation and value out of the Pixel 4 launch, forget it. What we got instead was overpriced, underpowered, and delivered too late. The company could do better, but clearly, it thinks its customers would rather pay a premium so that they can get software updates on time. How freaking arrogant and stupid is that?\n\nI understand the need to build a reference platform. Microsoft does this with its Surface hardware to inspire its OEM partners to innovate. However, Google doesn't seem to be able to do the same thing with Pixel -- its partners are doing whatever they damn well please and aren't even keeping pace with essential software updates. If anything, the Pixel is coming in at last place in the yearly Android device race. It's not \"best of the breed,\" and it's not the device one would choose over any other OEM product based on specifications alone.\n\nThe only thing it has going for it is that it always launches with the latest and greatest version of Android, and it stays patched and updated for three years. Is that worth a premium? I don't think so.\n\nSure. Sign me up for a new Pixel 4 XL. The only reason why I am buying one is that I write about this junk; I need to follow developments in the Android OS, and I already own a Pixel 3 I can trade in for $250 -- which is less than what they gave me for the Pixel 2 last year. I'm not recommending this phone to anybody seriously considering an Android device. It's just not a good value.\n\nIs the Pixel 4 an overpriced disappointment when you compare it to its competition? Talk Back and Let Me Know.", "description": "Why do we need Pixel devices, again?", "authors": ["Jason Perlow"], "top_image": "https://zdnet2.cbsistatic.com/hub/i/r/2019/10/15/f1cd2c7a-c9fc-43ad-af88-d895673cf3a8/thumbnail/770x578/3aeafea8ea8554ccdf8176a4e4617ecb/gold-pixel-4.jpg", "published_at": "2019-10-15"}