{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7628019/Will-women-voters-forgive-Boris-Johnsons-serial-flings-MELISSA-KITE-argues-Tory-leader.html", "downloaded_at": "2019-10-30 00:08:47.143633+00:00", "title": "Will women voters forgive Boris Johnson's serial flings? MELISSA KITE argues the Tory leader", "language": "en", "text": "How will Boris’s love life play on Britain’s doorsteps? I ask the question as a devout Johnson supporter who predicted that he would be a great Prime Minister — and I believe so far I have been proved right.\n\nHe has grown in stature and worked miracles to get as far as he has in fighting off outrageous Remainer plots to kill Brexit.\n\nHis politically astute handling of the treacherous debacle has, against all odds, almost delivered victory for the 17.4 million of us who voted to leave the EU.\n\nLet’s face it, he would have succeeded were it not for the fact that the entire parliamentary system has gone rotten to the core and become rigged against him.\n\nPart of the reason is Carrie Symonds. I fear there is something female voters don’t quite like about seeing a man well into his 50s with a girlfriend almost half his age in Downing Street\n\nBut with Boris leading the Tories into battle in the December General Election, his private life will be the biggest card his opponents can play to try to destabilise him. And he has brought that situation on himself.\n\nJust before he became PM, I couldn’t see why people should scrutinise his love life. But watching Boris in power, I have had a change of heart.\n\nPart of the reason is Carrie Symonds. I fear there is something female voters don’t quite like about seeing a man well into his 50s with a girlfriend almost half his age in Downing Street.\n\nCarrie Symonds looks lovely, but I’m not sure we women care too much about that. What we want to know is whether she and Boris are stable. Too many relationships crumble in the media spotlight. Too many public figures are fickle in the way they flit from one partner to another.\n\nWhat we want to know is whether she and Boris are stable. Too many relationships crumble in the media spotlight\n\nBack in the real world, women are tired of watching the dramas. We are afflicted with fling fatigue. And many of us sympathise with the long-suffering ex-wife.\n\nA messy break-up may count for entertainment when it’s some five-minute wonder from a reality show, but a lot of voters want the private lives of their political leaders to be boring, if truth be told.\n\nThat was the only explanation for Theresa May’s popularity. People felt reassured knowing she would never be found in flagrante, although I suppose they used to say that of John Major, and then along came Edwina Currie. In any case, Mrs May delivered on that score. Her personal life was wondrously dull.\n\nIt is important not because voters are judgmental, but because we don’t want our leaders to be compromised, or put at a disadvantage, especially when our country’s future hangs in the balance.\n\nTory victory if Boris were partnered by his elegant and sensible wife, Marina Wheeler, from whom he is now sadly separated?\n\nIt makes our already fraught situation more volatile if the Opposition can take Boris apart by harking on about ex-girlfriends or asking them to spill the beans. In the present political climate, Boris’s weakness for women makes him more vulnerable than he ought to be.\n\nThat late-night row with Carrie, I predict, will be revisited during the election campaign. As will his less than gentlemanly behaviour with previous lovers and the extra- marital pregnancies.\n\nLabour will also be hot on the trail of any more revelations about the Jennifer Arcuri affair in which the U.S. tech entrepreneur is said to have received favourable treatment as a result of her friendship with Boris when he was Mayor of London.\n\nBut there is another, perhaps deeper, reason why I’m wary, and that first surfaced when I saw Miss Symonds posing with Chris Packham, TV naturalist and darling of the animal rights lobby, at a bird-watching festival.\n\nCarrie Symonds looks lovely, but I’m not sure we women care too much about that\n\nThat late-night row with Carrie, I predict, will be revisited during the campaign\n\nMiss Symonds is herself an evangelist for animal rights — nothing necessarily wrong with that, but her appearance with Mr Packham will have alarmed vast numbers of voters in rural Britain.\n\nIt was his pressure group, Wild Justice, which mounted a legal challenge forcing rural quango Natural England to revoke licences allowing farmers and conservationists to shoot birds viewed as pests, such as crows, magpies and pigeons.\n\nUnable to protect their crops and vulnerable livestock from attacks by these birds, farmers were so outraged that the then Environment Secretary Michael Gove had to overturn the order in June.\n\nWhatever her beliefs, Miss Symonds has to be very careful not to appear to lecture voters to endorse activists such as Chris Packham. Otherwise, they may think she is abusing her position as the PM’s consort, getting something other than romance out of being with Mr Johnson.\n\nBut there is another, perhaps deeper, reason why I’m wary, and that first surfaced when I saw Miss Symonds posing with Chris Packham\n\nIn other words, the real problem here might not be about Boris using women, but about women using Boris, or the perception that they are.\n\nMiss Symonds and her animal rights agenda, Miss Arcuri and her business interests (her firms received £100,000 of public money) . . . it looks as though Boris is letting his guard down. And that makes a Prime Minister appear weak, potentially.\n\nSo far, however, his durability is of Teflon-strength, but with Boris, one feels each revelation might be the tip of the iceberg.\n\nI don’t care what he’s been up to romantically, but once we are in election mode, I really hope he battens down the hatches.\n\nLet’s face it, who among us could not honestly say they would feel more assured of Tory victory if Boris were partnered by his elegant and sensible wife, Marina Wheeler, from whom he is now sadly separated?", "description": "MELISSA KITE: Part of the reason is Carrie Symonds. I fear there is something female voters don't like about seeing a man well into his 50s with a girlfriend almost half his age in Downing Street.", "authors": ["Melissa Kite For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/22/20348764-0-image-a-11_1572387257101.jpg", "published_at": "2019-10-29"}