{"pub": "yahoo", "url": "https://finance.yahoo.com/news/walgreens-fiscal-4q-earnings-snapshot-112013583.html", "downloaded_at": "2019-10-30 09:06:56.665464+00:00", "title": "Walgreens to shutter in-store clinics, add Jenny Craig sites", "language": "en", "text": "FILE - This June 25, 2019, file photo shows a sign outside a Walgreens Pharmacy in Pittsburgh. Walgreens will shutter nearly 40% of the clinics in its stores as the drugstore chain cuts costs and shifts to other businesses it believes will draw more people through its doors. The company said Monday, Oct. 28, that it will close 150 Walgreens-run clinics by the end of the year, but it will keep open more than 200 that are run in partnership with health care providers. (AP Photo/Gene J. Puskar, File)\n\nWalgreens will shutter nearly 40% of the clinics in its stores as the drugstore chain cuts costs and shifts to other businesses it believes will draw more people through its doors.\n\nThe company said Monday that it will close 150 Walgreens-run clinics by the end of the year, but it will keep open more than 200 that are run in partnership with health care providers.\n\nDrugstore chains like Walgreens started years ago adding small clinics that dole out flu shots and handle relatively minor health issues like sinus infections. But analysts say the chains have struggled to make money off the clinics, which face growing competition from telemedicine services that allow customers to get care through their smartphones.\n\nWalgreens has been focusing more on testing primary care clinics, which offer more extensive care, connected to some of its stores in Kansas City and Houston.\n\nThe chain also is working on partnerships with other companies like the grocer Kroger Co. to improve its food offerings. Walgreens said Monday that it also will open 100 locations for the weight-loss company Jenny Craig at stores nationwide, starting in January.\n\nEdward Jones analyst John Boylan said the closing of the clinics is immaterial to the company financially, and he expects the services Walgreens offers at its stores to shift over time.\n\nWalgreens Boots Alliance Inc. runs more than 18,750 stores internationally. That includes 9,277 in the United States, Puerto Rico and the U.S. Virgin Islands.\n\nIt has been trimming its total as part of a plan to cut costs. Walgreens has been hit by challenges including reimbursement cuts and lower price increases for branded drugs.\n\nDrugstores also face competition in areas outside their pharmacies from online options like Amazon.com.\n\nWalgreens said Monday that it has raised its annual savings target from its cost cutting program to $1.8 billion by fiscal 2022, up from a previous goal to exceed $1.5 billion.\n\nIn the final quarter of fiscal 2019, Walgreens earnings tumbled 55% to $677 million, due in part to charges from its cost-cutting program. Adjusted results totaled $1.43 per share.\n\nRevenue climbed 1.5% to $33.95 billion.\n\nThe results surpassed Wall Street expectations. Analysts expected, on average, earnings of $1.41 per share on $33.86 billion in revenue, according to Zacks Investment Research.\n\nBoylan termed the quarter good but not great. He said in a research note that Walgreens sales turned out better than expected, and that should continue.\n\nThe analyst said he expects Walgreens to grow its business as health plans narrow the network of pharmacies they cover in exchange for a break on pharmacy costs.\n\nShares of Deerfield, Illinois-based Walgreens slipped 12 cents to $55.30 in Monday afternoon trading.\n\nThe stock had dropped 19% since the beginning of the year as of Friday's close. Meanwhile, the Dow Jones industrial average, of which Walgreens is a component, has climbed nearly 16%.\n\n___\n\nFollow Tom Murphy on Twitter: @thpmurphy\n\n_____\n\nElements of this story were generated by Automated Insights (http://automatedinsights.com/ap) using data from Zacks Investment Research. Access a Zacks stock report on WBA at https://www.zacks.com/ap/WBA", "description": "Walgreens will shutter nearly 40% of the clinics in its stores as the drugstore chain cuts costs and shifts to other businesses it believes will draw more people through its doors.  The company said Monday that it will close 150 Walgreens-run clinics by the end of the year, but it will keep open more", "authors": ["Tom Murphy"], "top_image": "https://s.yimg.com/uu/api/res/1.2/eewB53uD1nxSBieUVURI9Q--~B/aD0zODcxO3c9NTgwNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/d97fa80547820a39ffbe54446b3776e7", "published_at": "2019-10-28"}