{"pub": "fox", "url": "https://foxbusiness.com/industrials/ronan-farrow-book-catch-and-kill-amazon-top-seller", "downloaded_at": "2019-10-11 00:21:28.689469+00:00", "title": "Farrow's 'Catch and Kill' zooms to bestseller list; NBC headlines promise big sales says book pro", "language": "en", "text": "Ronan Farrow’s highly anticipated new book which presents explosive cover-up charges against NBC News leadership and rape allegations against former \"Today\" anchor Matt Lauer, doesn’t release until next week, but it’s already the top seller on Amazon.\n\nContinue Reading Below\n\n“Catch and Killer: Lies, Spies and a Conspiracy to Protect Predators” jumped to the No. 1 best-seller spot in books on Amazon Thursday. The book will be released on Oct. 15.\n\n“All the press around it is nothing but good news for the sales prospects of the book,” Jonathan Segura, the executive editor of the trade magazine Publishers Weekly, told FOX Business.\n\nThe book has drawn big headlines over new accusations that former “Today” host Matt Lauer raped another NBC News employee at the 2014 Sochi Olympics and company leaders were aware. It also details how film producer Harvey Weinstein allegedly got NBC to back away from the story about his own sexual misconduct — which Farrow had been working on — by letting network leaders know that he could reveal accusations against Lauer.\n\nLauer has denied the rape accusation in a public letter. NBC News chair Andy Lack has disputed Farrow's account in an internal memo, according to The Hollywood Reporter. Company leaders have said Farrow’s story wasn’t up to standards. He later published a piece on Weinstein in The New Yorker.\n\nThe headline-drawing back-and-forth drama involving big names and powerful executives may provide more fuel on the fire for sales of “Catch and Kill.”\n\nPublisher Little, Brown and Company declined to share any advance sales figures with FOX Business. But the book’s early jump on Amazon indicates it could surpass sales of Farrow’s last book, “War on Peace,” which spent five weeks on The New York Times’ nonfiction bestsellers list last year.\n\n“War on Peace” detailed what Farrow described as the “decline” of U.S. diplomacy and worldwide influence, drawing on his experience in the State Department. But publishers have seen some reader “burnout” on books reporting on politics and the Trump administration since the big success of Michael Wolff’s “Fire and Fury” and Bob Woodward’s “Fear,” according to Segura.\n\nWith “Catch and Kill” reportedly holding many revelations about headline-making scandals, Segura said Farrow likely has a subject that will hold the public’s attention.\n\n“This is a different thing altogether,” Segura said. “I think there’s a lot of interest around it.”\n\n“She Said,” by Times reporters Jodi Kantor and Megan Twohey, who beat Farrow to breaking the Weinstein story, has spent three weeks on the best sellers list since it was released last month.\n\nAt the end of the day, the writing also just needs to be good for a title to sell well, according to Segura.\n\n“If there’s nothing else that’s true in this world right now, it’s that people are hungry for narrative,” he said.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE", "description": "The upcoming book is getting a boost in sales from big buzz in the press.", "authors": ["James Leggate"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/catch-kill-farrow-getty.jpg?ve=1&tl=1", "published_at": "2019-10-10"}