{"pub": "zdnet", "url": "https://www.zdnet.com/article/accc-loses-legal-battle-to-tpg-over-misleading-consumer-allegations", "downloaded_at": "2019-10-11 05:10:18.545430+00:00", "title": "ACCC loses legal battle to TPG over misleading consumer allegations", "language": "en", "text": "The Australian Competition and Consumer Commission (ACCC) has lost a legal stoush with TPG over alleged misleading conduct, with the Federal Court dimissing the case and the ACCC ordered to pay costs.\n\nThe case involved a AU$20 prepayment by customers to cover services not included in their plans, such as overseas phone calls.\n\nWhen the balance fell below AU$10, TPG would automatically top up the balance from the customer bank account or credit card, or if the customer left TPG, the balance was forfeited.\n\nIn his judgment, Justice O'Callaghan said the case hung on whether the use of the word \"prepayment\" was misleading or deceptive, and whether the forfeiting of the unused balance to TPG was unfair.\n\n\"The ACCC agrees that it would have no issue with TPG if it used, instead of the word 'prepayment', the words 'access fee',\" O'Callaghan wrote.\n\n\"In my view, it is artificial to give the single word 'prepayment' as much work to do as the ACCC case requires.\"\n\nO'Callaghan added that when an ordinary consumer would read the terms of the contract with TPG, they would understand the left over balance would be kept by TPG. The company has kept over AU$16 million in forfeited amounts.\n\n\"By a simple enough process of deduction, it would therefore be sufficiently apparent to a reasonable or ordinary consumer of telecommunication services that he or she will forfeit between $10 and $20 upon cancellation of their plans,\" O'Callaghan said.\n\nThe ACCC said it is considering the judgment.\n\n\"We brought this case because we believed TPG misled its prepaid customers about their ability to use up their full prepayment for services outside their plans, and to obtain a refund of any unused funds when they ended their contract,\" ACCC chair Rod Sims said.\n\n\"We will continue to take cases against telco businesses that we consider are making misleading claims about their services.\"\n\nThe ACCC and TPG are currently awaiting judgment in a much bigger case, as Justice Middleton is deliberating on whether to approve the merger of Vodafone and TPG, which the ACCC blocked in May.\n\nCentral to that case is the ACCC's contention that TPG will build a fourth mobile network if the telco is prevented from gaining control of the Vodafone network.\n\nRelated Coverage", "description": "Federal Court dismisses case with ACCC to pay costs.", "authors": ["Chris Duckett"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2017/07/06/9f67e014-24d6-46cc-9610-47991fc17efb/thumbnail/770x578/bbbc86d405d4df9c7a3c9e1b11c8ca24/legal.jpg", "published_at": "2019-10-11"}