{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/google-boss-says-you-must-20586550", "downloaded_at": "2019-10-15 23:07:41.996059+00:00", "title": "Google boss says you must tell visitors if you have Nest or Alexa in your home", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA Google chief has admitted he warns visitors he has installed the company's smart speakers in his home before they enter.\n\nRick Osterloh thinks homeowners should tell visitors about any smart home devices being used in their homes.\n\nThe tech giant's head of devices suggested the smart tech should even alert visitors that they are on.\n\nThe voice-activated smart home devices, including Google's Nest speakers and Amazon's range of Echo device, have raised privacy concerns in some quarters because of their use of microphones and audio recording capabilities.\n\n\"Does the owner of a home need to disclose to a guest? I would and do when someone enters into my home, and it's probably something that the products themselves should try to indicate,\" he told the BBC.\n\n(Image: Getty Images)\n\n(Image: AFP via Getty Images)\n\nSome smart home devices now come with physical switches which disable or cover camera lenses, as well as disable microphones.\n\nThey also have LED lights which indicate if they are active in an effort to improve transparency.\n\nEarlier this year, Google , Apple, Microsoft, Amazon and Facebook all admitted human reviewers had been used to analyse some members of the publics' voices recorded by their smart devices.\n\nCritics accused the firms of failing to adequately declare these practices, which the companies claimed are carried out for quality control and to improve speech recognition technology.\n\n(Image: REUTERS)\n\nMr Osterloh acknowledged that wider regulation was needed for the technology sector and its use of data, but said Google was taking steps to make such processing more secure.\n\nHe said: \"The approach we're taking is to try to keep all of this information on devices as much as possible and always keep it private and secure and encrypted.\"\n\n\"But everyone would benefit from clarity of standards and regulation. It is a challenging space to navigate. And it's very import,\" Mr Osterloh added.", "description": "Rick Osterloh, during a speech to launch the Google Pixel 4, said people should be warned that Google Nest and Amazon Echo devises are active", "authors": ["Martyn Landi", "Image", "Reuters", "Getty Images", "Afp Via Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20586868.ece/ALTERNATES/s1200/2_Made-by-Google-19-event-in-the-Manhattan-borough-of-New-York.jpg", "published_at": "2019-10-15"}