{"pub": "independent", "url": "https://independent.co.uk/sport/general/boxing/ksi-vs-logan-paul-rematch-press-conference-fight-youtube-stream-date-latest-jake-paul-a9146766.html", "downloaded_at": "2019-10-07 23:31:04.833021+00:00", "title": "KSI vs Logan Paul rematch: UK press conference draws 4,000 strong crowd as YouTube stars come face-to-face again", "language": "en", "text": "KSI and Logan Paul drew an audience of more than 4,000 fans at their press conference in London.\n\nThe YouTube sensations with more than 40,000,000 subscribers between them met once more after demand for another face to face hit fever pitch.\n\nFans were seen queueing on Caroline Street, just off Commercial Road in East London from 9am in unprecedented scenes in boxing, as they drew more fans than plenty of world title fights in the sport have seen.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nPrior to the meeting on stage, Eddie Hearn confirmed that the bout would be shown on Sky Sports Box Office for £9.95 – as he exclusively told The Independent weeks ago.\n\n“Live on Sky Sports, this will be huge. It’s £9.95, and we’re just working out how to structure it.\n\nShape Created with Sketch. KSI vs Logan Paull II UK press conference Show all 26 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. KSI vs Logan Paull II UK press conference 1/26 Action Images via Reuters 2/26 Action Images via Reuters 3/26 Action Images via Reuters 4/26 Action Images via Reuters 5/26 Action Images via Reuters 6/26 Action Images via Reuters 7/26 Action Images via Reuters 8/26 Action Images via Reuters 9/26 Action Images via Reuters 10/26 Action Images via Reuters 11/26 Action Images via Reuters 12/26 Action Images via Reuters 13/26 Action Images via Reuters 14/26 Action Images via Reuters 15/26 Action Images via Reuters 16/26 Action Images via Reuters 17/26 Action Images via Reuters 18/26 Action Images via Reuters 19/26 Action Images via Reuters 20/26 Action Images via Reuters 21/26 Action Images via Reuters 22/26 Action Images via Reuters 23/26 Action Images via Reuters 24/26 Action Images via Reuters 25/26 Action Images via Reuters 26/26 Action Images via Reuters 1/26 Action Images via Reuters 2/26 Action Images via Reuters 3/26 Action Images via Reuters 4/26 Action Images via Reuters 5/26 Action Images via Reuters 6/26 Action Images via Reuters 7/26 Action Images via Reuters 8/26 Action Images via Reuters 9/26 Action Images via Reuters 10/26 Action Images via Reuters 11/26 Action Images via Reuters 12/26 Action Images via Reuters 13/26 Action Images via Reuters 14/26 Action Images via Reuters 15/26 Action Images via Reuters 16/26 Action Images via Reuters 17/26 Action Images via Reuters 18/26 Action Images via Reuters 19/26 Action Images via Reuters 20/26 Action Images via Reuters 21/26 Action Images via Reuters 22/26 Action Images via Reuters 23/26 Action Images via Reuters 24/26 Action Images via Reuters 25/26 Action Images via Reuters 26/26 Action Images via Reuters\n\n“Billy Joe Saunders could be on normal Sky Sports Main Event and one other bout will be on box office.”\n\nHave no doubt that fans will pay in their bunches for just the main event – they are not here for the likes of Saunders and Devin Haney, they are here as much to see KSI and Paul trade verbal blows as they are to watch them in the ring.\n\nThe press conference started in somewhat bizarre fashion with KSI walking out holding a dog which he named ‘King Kong’, a dig at the passing of Logan’s dog Kong who died earlier this year. Fans couldn’t help but join in on mocking Paul as they chanted ‘where’s your dog?’ repeatedly at Paul in all black, wearing a beret and a simple mustache.\n\nPaul’s first words on stage after being booed by the entire crowd: “Wow, wow, wow. That’s a shame! After all the help we gave you in World War II, this is how you return the favour! Winston Churchill would be ashamed.”\n\nYou’d have done well to hear him speak over the chanting from fans, booing and screaming at him while simultaneously cheering for their hero – KSI.\n\n“I have no respect for this man,” KSI said.\n\n“I can’t wait to finish him off. Welcome to London, mother******.”\n\nThe press conference, of course, couldn’t be complete with Shannon Briggs interrupting with his ‘let’s go champ!’ tagline, repeated no fewer than 500 times on stage.\n\nThe pair failed to hold back as Logan got as personal as possible, threatening to kill his opponent in the ring.\n\n“I might kill this man. JJ is on his fifth abortion, his fifth. Five babies – dead. I might return the favour and kill you.”\n\nThere was some boxing talk, too.\n\n“You’ve got a very good jab but you can’t fight backwards,” KSI said when asked by host The True Geordie about Paul’s strengths and weaknesses.\n\n“On the night, all your boxing ability is going to go out of the window.\n\n“My biggest strength is my strength. You cannot knock me out.”\n\nAs fans got even more excited by every word KSI shouted at his opponent, they began to descend into chaos, throwing bottles, tissue, anything they could find at the American.\n\n“If you’re going to throw things at me, at least hit me,” Paul said as he addressed the crowd.\n\nBefore coming face to face one final time before fight week, the pair both, inevitably, predict knockouts.\n\nNow, both men going away and back to their training camps in the knowledge that they have drawn thousands and generated interest perhaps unlike any boxing event has seen before.\n\nWhat happens next, happens in the ring.", "description": "KSI and Logan Paul drew an audience of more than 4,000 fans at their press conference in London. The YouTube sensations with more than 40,000,000 subscribers between them met once more after demand for another face to face hit fever pitch. Fans were seen queueing on Caroline Street, just off Commercial Road in East London from 9am in unprecedented scenes in boxing, as they", "authors": ["Adam Hamdani"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/07/20/ksi-logan-paul-20.jpg", "published_at": "2019-10-07"}