{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/front-foot-england-ready-to-go-the-distance-warns-youngs-20191018", "downloaded_at": "2019-10-18 10:36:12.537077+00:00", "title": "'Front-foot' England ready to go the distance, warns Youngs", "language": "en", "text": "Oita - England's rocky recent World Cup record will count for nothing when they lock horns with fierce rivals Australia in Saturday's crunch quarter-final, insists Ben Youngs.\n\nThe Leicester scrum-half warned Friday that Eddie Jones's side were a different animal to the 2015 flops - who became the first World Cup hosts to crash out in the pool stage - and would be ready for anything the Wallabies throw at them in Oita.\n\n\"Obviously if you compare it to 2015 it's very different,\" said Youngs, also one of four England players this weekend who were involved in the 2011 quarter-final defeat to France.\n\n\"For us what's happened in the past is irrelevant. Clearly we weren't good enough in '11 or '15 - but in '19 we feel we're more than capable of achieving something.\"\n\nEngland's 33-13 defeat by Australia ultimately cost them a place in the knockout stage four years ago under Stuart Lancaster's doomed stewardship.\n\nDespite a six-game losing streak against England, defiant Wallabies coach Michael Cheika has backed his players to spring another upset, declaring: \"The fear inside us is dead.\"\n\nBut Youngs believes the two weeks England have spent preparing in Miyazaki, after last week's devastating typhoon washed out their final pool fixture against France, has helped their cause.\n\n\"We've certainly been able to get our teeth into Australia a lot earlier,\" he said.\n\n\"We basically have to make sure we take the game to them, get ourselves on the front foot and come out with an intensity that marries up with our preparation,\" added Youngs.\n\n\"The waiting's over now. It's great that so many people will be cheering (in England) tomorrow, up early, wearing the shirt -- we certainly feed off that.\"\n\nYoungs started in England's 19-12 loss to France the last time they reached a World Cup quarter-final and predicts that building an early lead will be key against Australia.\n\n\"It's a fantastic occasion, I was lucky to play in one,\" he said, calling for England to be \"relaxed and clear-thinking\" at the weekend.\n\n\"I suppose my experience of that is just making sure the intensity of the game doesn't shock you at the beginning.\n\n\"I imagine the first 20 minutes will be pretty full-on, so we've got to make sure we get off to the start that we want.\"\n\nWith captain Owen Farrell switching to fly-half in place of George Ford, Jones selected a fit-again Henry Slade alongside Manu Tuilagi in a dynamic midfield pairing.\n\n\"Henry can play, he can run, he can kick -- he's an all-rounder,\" said Tuilagi. \"For him to be back just adds a massive part to our game, especially with Faz at 10.\"\n\nDefence coach John Mitchell tipped England to make life difficult for Australia.\n\n\"Defence is a big part of our game - it's infectious, it gives us energy,\" he said.\n\n\"There will be lots of pressure and it will come down to who handles the big moments better.\"\n\nSamurai imagery has been all the rage at this World Cup, but Youngs flashed a sheepish grin when asked if Aussie Jones, previously Japan's head coach, had asked the players to summon the warrior spirit.\n\n\"It's not easy without a samurai sword,\" he said.\n\n\"But we've got some boys in this team who don't know when they're beat. Everyone involved is going to fight right to the end.\"\n\nTeams:\n\nEngland\n\n15 Elliot Daly, 14 Anthony Watson, 13 Henry Slade, 12 Manu Tuilagi, 11 Jonny May, 10 Owen Farrell (captain), 9 Ben Youngs, 8 Billy Vunipola, 7 Sam Underhill, 6 Tom Curry, 5 Courtney Lawes, 4 Maro Itoje, 3 Kyle Sinckler, 2 Jamie George, 1 Mako Vunipola\n\nSubstitutes: 16 Luke Cowan-Dickie, 17 Joe Marler, 18 Dan Cole, 19 George Kruis, 20 Lewis Ludlam, 21 Willi Heinz, 22 George Ford, 23 Jonathan Joseph\n\nAustralia\n\n15 Kurtley Beale, 14 Reece Hodge, 13 Jordan Petaia, 12 Samu Kerevi, 11 Marika Koroibete, 10 Christian Lealiifano, 9 Will Genia, 8 Isi Naisarani, 7 Michael Hooper (captain), 6 David Pocock, 5 Rory Arnold, 4 Izack Rodda, 3 Allan Alaalatoa, 2 Tolu Latu, 1 Scott Sio\n\nSubstitutes: 16 Jordan Uelese, 17 James Slipper, 18 Taniela Tupou, 19 Adam Coleman, 20 Lukhan Salakaia-Loto, 21 Nic White, 22 Matt To'omua, 23 James O'Connor", "description": "England's rocky recent World Cup record will count for nothing when they lock horns with fierce rivals Australia, insists Ben Youngs.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7270/a65dab6211e648f7b24a6d8b19b6bbef.jpg", "published_at": "2019-10-18"}