{"pub": "wsj", "url": "https://barrons.com/articles/future-returns-green-bonds-on-the-rise-01570541371?mod=rsswn", "downloaded_at": "2019-10-08 15:00:03.552241+00:00", "title": "Future Returns: Green Bonds on the Rise", "language": "en", "text": "Wind turbines stand at the Arkona offshore wind park in the Baltic Sea off the coast of Sassnitz, Germany.\n\nText size\n\nGreen bonds have surged as an investment category in the last decade, with new issuance this year alone expected to reach about US$250 billion globally—a more than 20% increase from a year ago.\n\nThe securities provide one of the most direct ways for investors to make a measurable, positive impact on the environment, by funneling capital to projects across the globe that have a specific environmental benefit.\n\nOne example from earlier this year is Netherlands-based TenneT Holding’s €1.25 billion (US$1.4 billion) two-part offering to connect offshore wind projects to the onshore electricity grids in the Netherlands and Germany.\n\nAnother is China’s Industrial and Commercial Bank of China (ICBC) Singapore branch’s three-part, multi-currency US$2.2 billion-equivalent Green Belt and Road Inter-bank Regulation Cooperation Bond, which will finance renewable energy, low-carbon and low-emissions transportation, energy efficiency, and sustainable water and wastewater management.\n\nThe volume of outstanding green bonds—both “labeled” and “unlabeled”—has reached around US$2 trillion, according to Stephen Liberatore, a managing director at TIAA’s Nuveen and manager of the TIAA-CREF Social Choice Bond Fund.\n\nLiberatore, who also manages TIAA-CREF’s Short-Duration Impact Bond (ticker: TSBRX), and TIAA-CREF’s Green Bond (TGROX) funds, recently spoke with Penta about what the green bond market is all about, how it’s evolving, and what kind of returns investors can expect.\n\nTo Label a Bond Green—or Not\n\nA growing number of fixed-income securities issued by corporations and governments, big and small, can be considered green, but issuers that choose to call a security “green” tend to follow the Green Bond Principles, voluntary guidelines established by an industry group of underwriters, issuers, and investors.\n\nThe principles are a “way for the industry to provide guidance for both issuers and investors to understand what was expected for you if you were going to issue a green bond, and for investors, [the principles outline] what you would expect to receive as a green bond,” says Liberatore, who was on the initial executive committee that established the principles.\n\nThe labeled green bond market alone includes more than US$1 trillion in offered securities, with more issuers realizing the label “provides them a platform to discuss how green they are—to say to their regulators, their shareholders, their clients, and their employees that they are focused on climate change,” Liberatore says.\n\nNuveen also buys unlabeled securities that meet criteria the firm has developed, focusing on how the proceeds will be used, and whether or not the issuer can provide data on the environmental impact the investment will make.\n\nGrowing Diversification\n\nThroughout the sector’s rapid growth, the type of green bond issuers have shifted from “super sovereigns,” like the World Bank or Asian Development Bank, to corporations—utilities and energy companies, but also banks and auto makers. Apple has issued US$2.5 billion in green bonds over time to finance clean energy and environmental projects in its operations and throughout its supply chain.\n\nThere’s also more diversity in the type of bonds being issued. While super sovereigns initially issued short-duration securities, which didn’t offer much additional yield over government benchmarks, issuers more recently are offering longer-dated bonds, with the proceeds going to fund specific projects.\n\nThere’s also been a spate of securities out of emerging markets, some with unusual structures. Earlier this month AES Gener, a Chilean power generation company, issued a US$450 million preferred security that matures in 60 years and can’t be called back by the issuer in the first five years. The notes were priced to yield 6.40%, Liberatore says.\n\n“They did it because it allows them to count that as part of their equity capital,” he says.\n\nGreen Returns\n\nNuveen is an active total return manager, so it seeks deals that are attractive from a relative value perspective. Because a bond is green, however, doesn’t mean it will yield more—or less—than a similarly structured bond by an issuer with a similar credit rating.\n\n“What you’re doing as the investor in this space is you’re controlling how the proceeds are being used—only for a green project or projects—but the underlying credit risk is still with the issuer as a whole,” Liberatore says.\n\nOne question is whether green bonds could actually outperform their plain-vanilla bond counterparts in a recession, since the sector hasn’t really been through a down-cycle, Liberatore says. “We just don’t have that data or experience yet,” he says.\n\nThe five-year return of the US$4.4 billion TIAA-CREF Social Bond fund is 3.73%, 0.37 of a percentage point, above the average return in Morningstar’s Intermediate Core-Plus Bond category through Oct. 4. The TIAA-CREF Green Bond fund has been open less than a year, and has $31 million in assets.\n\nSustainable Bond Trends\n\nThe success of green bonds has led to the creation of other types of fixed-income securities to fund social and environmental projects. Among the newest are “sustainable transition bonds”—securities that fund projects that allow an issuer to facilitate the transition to a more green-oriented business.\n\nBut the direct benefit to the environment isn’t always clear. Repsol, a Spanish oil-and-gas company, recently issued what was considered a sustainable transition bond to fund efforts to make their operations more efficient. While a more efficient operation would lead to fewer emissions of carbon dioxide—clearly good for the environment—it would still perpetuate Repsol’s oil-and-gas business.\n\n“We did not participate in this particular transaction because our investors are not looking to support the elongation of the fossil fuel life cycle,” Liberatore says.\n\nCurrently the European Union is working on a “green bond standard and sustainable finance taxonomy” according to Moody’s Investors Service, which argues the standard would support the market’s growth and maturation.\n\nBut Liberatore is concerned the taxonomy will be too prescriptive about what is or is not green.\n\n“We try to leave the flexibility up to the issuer,” he says. “If you think you have an environmentally beneficial project, we would love for you to describe it to us and explain it, and maybe it’s something that we can be supportive of, or not.”\n\nFor example, the fund recently invested in the first “blue bond”—a US$15 million security issued by The Republic of Seychelles to support sustainable marine and fisheries projects. The World Bank provided a US$5 million guarantee on the deal, which also included a US$5 million loan from the Global Environment Facility, which will be used to partially cover interest payments.\n\nLiberatore says the innovative public-private partnership structure provides a template that could make it easier for other issuers to issue bonds.\n\n“It’s that innovation within the market that I think is critical to rapid growth and diversification,” Liberatore says. “Anytime you try to implement very prescriptive things that may or may not capture that innovative curve, you’re going to be missing out.”", "description": "Nuveen’s Stephen Liberatore on the growing market for fixed-income securities to finance environmental projects", "authors": [], "top_image": "https://images.barrons.com/im-114687/social", "published_at": "2019-10-08"}