{"pub": "yahoo", "url": "https://news.yahoo.com/euro-zone-bond-yields-ecb-090906388.html", "downloaded_at": "2019-10-30 09:25:39.996821+00:00", "title": "Euro zone bond yields up as ECB starts bond purchases, Fed awaited", "language": "en", "text": "* Euro zone bond yields up\n\n* ECB resumes asset purchased, introduces tiered rates\n\n* Fed expected to cut rated by 25 bps\n\n* Euro zone periphery govt bond yields http://tmsnrt.rs/2ii2Bqr\n\nBy Elizabeth Howcroft\n\nOct 30 (Reuters) - Germany's benchmark 10-year bond yield rose on Wednesday to near a recent three-month high, as the European Central Bank resumed its asset-purchase programme and investors awaited the outcome of a U.S. Federal Reserve meeting.\n\nBond yields across the euro zone have risen in the past month as Brexit uncertainty has faded, but the resumption of the ECB's bond-buying scheme to bolster growth and inflation was expected to support regional bond markets.\n\nThe ECB said in September it would buy 20 billion euros worth of bonds a month.\n\n\"It will be first orders today, but it's more the stock effects that is having market impact, not the flow effect,\" said Daniel Lenz, rates strategist at DZ bank.\n\n\"(ECB purchasing) may have some impact if there were some larger tickets during especially this morning - usually central banks come up with their orders before mid-day,\" Lenz said. The short-term impact would be limited, he said.\n\nWednesday also sees the ECB's introduction of tiered rates, to help mitigate the effect of negative interest rates on banks.\n\nEuro zone bond yields across most maturities rose as much as 2 basis points in early trade - possibly boosted by Spanish inflation data which came in marginally above expectations.\n\nGermany's 10-year bond yield was last up around 1.5 bps on at -0.34%, near Monday's three-month high of -0.32%. It is up 22 bps so far in October and set for its biggest monthly jump since early 2018, largely driven by expectations that Britain will avoid a no-deal Brexit.\n\nData from the German state of Saxony showed consumer prices rose by 1% year-on-year in October. A nationwide inflation report is expected later in the day.\n\nBut the bigger focus for markets was the Fed, which concludes a two-day meeting on Wednesday. A rate cut is widely expected, but attention will be focused on any hints about future policy.\n\nOmitting the reference that the Fed \"will act as appropriate to sustain the expansion\" would be a signal that the Fed is done with its precautionary rate cuts,\" Commerzbank's head of rates and credit research, Christoph Rieger, wrote in a note. (Reporting by Elizabeth Howcroft, editing by Larry King)", "description": "Germany's benchmark 10-year bond yield rose on Wednesday to  near a recent three-month high, as the European Central Bank resumed its asset-purchase programme and investors awaited the outcome of a U.S. Federal Reserve meeting.  Bond yields across the euro zone have risen in the past month as Brexit", "authors": ["Elizabeth Howcroft"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-30"}