{"pub": "news24", "url": "https://traveller24.com/News/Flights/ethiopian-airlines-increases-us-air-access-to-africa-20190612", "downloaded_at": "2019-10-09 00:51:46.526520+00:00", "title": "Ethiopian Airlines increases US air access to Africa", "language": "en", "text": "The US is one of the largest travel markets to Africa, with increased connectivity boding well for both the traveller and the continent.\n\nEthiopian Airlines announced in statement it would be launching a thrice-weekly flight to John F Kennedy (JFK) Airport in New York via Abidjan, as of June 17, 2019. With new the JFK flight services, Ethiopian will be serving 24 weekly flights between African and North America.\n\nWith the addition of the new thrice weekly service to JFK Airport to the already operating 4 weekly service to Newark via Lomé, Ethiopian will operate to New York daily. JFK is the sixth busiest airport in the United States and an international gateway into North America. John F Kennedy Airport is the airline's second station in New York in addition to Newark, connecting the North America’s gateway with its extended network of more than 120 destinations globally - including South Africa.\n\nCape Town just recently confirmed added US connectivity with a direct flight between Newark and Cape Town coming into effect in December 2019.\n\nREAD: This Asian carrier, aiming to be the world's leading digital airline, has just upped capacity to SA\n\nAs the largest aviation group in Africa and a Skytrax certified Four Star Global Airline, the airline continues to improve connectivity despite the recent Boeing 737-8 Max setback. The airline grounded its Max fleet after the incident in March in which all 149 passengers and eight crew members aboard died. Boeing's Max 8 continues to be grounded globally due to safety concerns.\n\nThe airline is the fastest growing Airline in Africa, with some seventy-plus years of operation and subsequently becoming an African Aviation hub of note,overtaking Dubai as a gateway to the continent - largely buoyed by reforms being put in by its new Prime Minister and visa reforms.\n\nForwardKeys data for the period between 2013 and 2018 highlights that Addis Ababa has grown its volume of international transfer passengers to Sub-Saharan Africa, five years in a row.\n\nGroup CEO of Ethiopian Airlines, Tewolde GebreMariam says, \"The US is one of our most important markets owing to the presence of a large African diaspora and the promising multi-faceted relations between Africa and the USA. Hence, the new service is a significant addition to our expanding network in the USA and offers better connectivity for African and US passengers. Moreover, the service catalyzes trade, tourism, investment and people- to- people relations between Africa and the United States.”\n\nREAD: Ethiopian Airlines makes flying simple with rollout of fast travel self check-in\n\nFind Your Escape by searching and comparing flight prices here. You can also sign-up for the Traveller24 Weekly Newsletter – Subscribe here. Or download the News24 App here, to receive expertly curated travel ideas and deals directly to your mobile.", "description": "The US is one of the largest travel markets to Africa, with increased connectivity boding well for both the traveller and the continent.", "authors": ["- Selene Brophy"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/5057/8f360873543c464d8f2bda35ebd61222.jpg", "published_at": "2019-06-12"}