{"pub": "telegraph", "url": "https://secure.telegraph.co.uk/news/2019/10/08/tuesday-morning-news-briefing-brexit-delay-blame-game", "downloaded_at": "2019-10-08 09:37:40.264018+00:00", "title": "Tuesday morning news briefing: Brexit delay blame game", "language": "en", "text": "PS: The Treasury is to mint 10 million Brexit 50p coins - three times more than previously planned. The design is due to be signed off today. See it here.\n\nDuty of care: Web giants 'cashing in' on misery of children\n\nThe head of the NHS has accused internet firms of \"cashing in\" on addiction, as he announced plans to treat children with disorders caused by gaming and social media. Simon Stevens said the health service is left \"picking up the pieces\" of young lives wrecked by obsessions fuelled by technology. As Health Editor Laura Donnelly reports, it follows The Telegraph's Duty of Care campaign - calling for more stringent regulation of web giants to protect youngsters.\n\nBritain's nuclear hotline: the AA, a phone box and four pennies\n\nDuring the Sixties, fears of a nuclear war ran high. Little did the population know that Britain's fate might depend on the Automobile Association, a phone box and a prime minister making a reverse-charge call. What would defence chiefs do in the event of a four-minute warning if Harold Macmillan was away from his desk? The answer lies in documents at the National Archives described by a historian as \"the most bizarre file I have ever discovered\". Read them here.\n\nNews digest\n\nGallery: The big picture\n\nGetting carried away | An Extinction Rebellion activist is among hundreds taken away by police yesterday as they attempted to bring London to a standstill. Boris Johnson described the climate protesters as \"crusties living in hemp-smelling bivouacs\". Read Judith Woods' piece from inside the police cordon. And click through our gallery of the day's best images.", "description": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here and try our Audio Briefings on WhatsApp.", "authors": ["Danny Boyle", "Macer Gifford", "Madeline Grant"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/08/TELEMMGLPICT000212301811-xlarge_trans_NvBQzQNjv4Bq_scwIHASfl5tTtuT1ntqkt1p0QWwE5aYCV1z9Mky2_4.jpeg?imwidth=1200", "published_at": "2019-10-08"}