{"pub": "politico", "url": "https://politico.com/news/2019/09/29/rudy-giuliani-trump-biden-ukraine-009765", "downloaded_at": "2019-09-29 23:30:25.984500+00:00", "title": "Giuliani says Trump ‘framed by the Democrats’", "language": "en", "text": "Giuliani started his attacks on the Obama White House and Hillary Clinton’s 2016 campaign. He denied ever courting the theory that Ukrainians hacked the Democratic National Committee and then framed the Russian government. Pivoting, he said there was still “a load of evidence that Ukrainians created false information” for the Obama White House. He also alleged “the collusion that they claim happened in Russia happened in the Ukraine with Hillary Clinton.\"\n\n“The Ukrainians came to me,” Giuliani said. “I didn't go to them.”\n\nGiuliani has previously called for Ukraine to investigate to determine if Biden — while he was vice president — threatened to withhold monetary aid for Ukraine and pushed for the firing of a Ukrainian prosecutor in order to help his son, Hunter Biden, who held a board position on a Ukrainian energy company. Giuliani has been at the center of the controversy over Trump’s July 25th phone call with President Volodymyr Zelensky of Ukraine in which Trump discussed a possible investigation of the Bidens.\n\nPOLITICO NEWSLETTERS POLITICO Playbook Sign up today to receive the #1-rated newsletter in politics. Sign Up Loading By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nIf Trump hadn't asked Ukraine to investigate Biden in his July 25 phone call, Giuliani said Sunday, “He would have violated the Article II, Section 3 of the Constitution.”\n\nThe Bidens have long denied wrongdoing, and the vice president’s backers have argued that Biden was pressuring Ukraine’s government as part of an international campaign against corruption. But Giuliani brought allegations of corruption against the Biden to the forefront again Sunday, adding that they received at least $1 billion from China and their work there should be further looked into.\n\nAppearing on CBS later Sunday to push the claims, Giuliani also addressed Kurt Volker's Friday resignation — he was the U.S. envoy to Ukraine — and reiterated he contacted Ukraine officials at the request of the State Department: \"I have all of the text messages to prove it.\"\n\nGiuliani said Volker \"did his job honorably and decently,\" debriefing him on what to ask a top Zelensky aide and setting up meetings for him. Asked if Secretary of State Mike Pomepo knew about those meetings with Ukrainians, however, Giuliani initially said \"he did not.\" He later amended, saying that he talked to Pompeo last week and the secretary said he was \"aware of it.\"\n\nThroughout his ABC interview, Giuliani and host Goerge Stephanopoulos had fiery back-and-forths, disagreeing about media partisanship and the factual accuracy of some of Giuliani's claims.\n\nHeard from Giuliani: “Let’s get on to the point.” “Let me finish.” “George, is it possible for you to ever treat a charge against a Democrat in the same way you treat a charge against a Republican?”\n\nHeard from Stephanopoulos: “Do you accept that’s not true?” “Are you telling me if there was evidence that Barack Obama was calling up the Russians saying, 'I want you to look into Donald Trump,' that you wouldn’t be blowing that up?”\n\nIn a testy end to the interview, Giuliani said he might not cooperate with the House Intelligence Committee, at least until Democrats removed chairman Adam Schiff and put in someone “neutral.”\n\n“I have to be guided by my client. If he wants me to testify, I'll testify,” he said, referring to the president. “Adam, where's the evidence? Ask him to produce the evidence.”\n\nStephanopoulos said, “He's coming up —”\n\nGiuliani cut him off: “Are you going to interrupt him as often as you did me?”", "description": "", "authors": [], "top_image": "https://static.politico.com/3c/5d/3b4c445642a6a948eb274f6d3409/20190929-rudy-file-ap-773.jpg", "published_at": "2019-09-29"}