{"pub": "news24", "url": "https://channel24.co.za/The-Juice/News/Local/kim-kardashian-west-renewed-her-vows-with-kanye-west-after-psalm-was-born-20191021", "downloaded_at": "2019-10-22 13:43:20.450262+00:00", "title": "Kim Kardashian West renewed her vows with Kanye West after Psalm was born", "language": "en", "text": "Kim Kardashian West renewed her vows with Kanye West after Psalm was born\n\nCape Town - Everything done in 'secret' will be revealed – especially if you’re a Kardashian and there’s a new season of Keeping Up with the Kardashians (KUWTK).\n\nThe Daily Mail reported that Kim Kardashian and Kanye West renewed their wedding vows in secret after their youngest son, Psalm, was born.\n\nThe renewal was revealed during the latest Keeping Up with the Kardashians episode.\n\nReality star Kim and Kanye first tied the knot on 24 May 2014. They decided to have their fifth anniversary celebration after Psalm was born on 10 May this year, the Daily Mail reported.\n\nDuring the episode, Kim mentioned she wanted the ceremony to be sweet.\n\n\"It’ll just be really be sweet, and I am excited that everyone is coming over.\" Although the actual ceremony wasn’t shown, Kim shared a line from her speech. It read, \"You are my husband. You are best friend. You are my biggest believer and one true love.\"\n\nAccording to E! News, Kim and Kanye didn’t share personal vows at their wedding but this time, Kim wanted to surprise Kanye by writing her own.\n\nREAD MORE: Kanye West tells Kim K how her sexy look affects him\n\nSpeaking to the KUWTK camera, Kim explained how happy she was to have all of her kids present for their vow renewal.\n\n\"I think it's so special that all four of our kids are here,\" Kim said.\n\nREAD MORE: Kim Kardashian shares never-before-seen wedding photos on 5th anniversary", "description": "Everything done in ‘secret’ will be revealed – especially if you’re a Kardashian.", "authors": ["Fulufhelo Ramotsatsi"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9496/fd1c8d61b745411aa83d07e4cdb32662.jpg", "published_at": "2019-10-21"}