{"pub": "breitbart", "url": "https://breitbart.com/news/hollywood-mogul-robert-evans-dies-at-89-2", "downloaded_at": "2019-10-30 02:25:36.242198+00:00", "title": "Hollywood mogul Robert Evans dies at 89", "language": "en", "text": "Los Angeles (AFP) – Legendary Hollywood movie mogul Robert Evans, who oversaw 1970s classics “The Godfather” and “Chinatown,” has died aged 89.\n\nA larger-than-life figure, Evans was known in Tinseltown both for saving Paramount Pictures by greenlighting a string of hits, and for his tabloid lifestyle including cocaine addiction and seven marriages.\n\nEvans’ death was confirmed to AFP Monday by his publicist, and by a second person close to the producer. No details were immediately available.\n\nEvans took over as Paramount’s head of production in 1966 aged just 36, ushering in a highly successful era for the studio including “Rosemary’s Baby” (1968) with director Roman Polanski, followed by Francis Ford Coppola’s “The Godfather” (1972).\n\nCoppola paid tribute Monday to Evans’ “charm, good looks, enthusiasm, style, and sense of humor.”\n\n“He had strong instincts as evidenced by the long list of great films in his career,” said Coppola in a statement to AFP, also praising Evans’ “ultimate realization that ‘The Godfather’ could be 2 hours and 45 minutes in length.”\n\nEvans earned an Oscar nomination — his only Academy recognition — for personally producing “Chinatown” (1974), again with Polanski.\n\nHe is survived by his only son Joshua.\n\nBorn the son of a New York dentist in 1930, Evans was a partner in a clothing company before moving to Los Angeles where he began his film acting career.\n\nHe appeared in the 1957 movie version of Ernest Hemingway’s “The Sun Also Rises,” despite the author’s protests.\n\nDarryl F. Zanuck, head of 20th Century Fox at the time, reportedly insisted that the handsome Evans remain in the film by declaring “The kid stays in the picture” — later the title of Evans’ autobiography and a documentary about his life.\n\nAfter a string of poorly received acting roles, Evans quickly switched to producing. He left Paramount in 1975, before returning to moderate success in the 1990s.\n\n“May the kid always stay in the picture,” wrote Coppola.", "description": "Los Angeles (AFP) – Legendary Hollywood movie mogul Robert Evans, who oversaw 1970s classics “The Godfather” and", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/29/f25378_larger-life-figure-robert-evans-was-in-tinseltown-saving-paramount-pictures-640x335.jpg", "published_at": "2019-10-29"}