{"pub": "businessinsider", "url": "https://businessinsider.com/founder-frenemies-how-silicon-valleys-magic-startup-formula-is-changing-2019-10", "downloaded_at": "2019-10-14 23:31:38.896178+00:00", "title": "IPO flops and CEO firings have made it clear that Silicon Valley's magic startup formula is about to change: Welcome to the age of Founder Frenemies", "language": "en", "text": "For more than a decade, Silicon Valley's law of the land has rested on one fundamental principle: a startup's founder does whatever they want, unmolested by the rules and constraints governing everyone else, and the investors backing the startup keep their mouths shut and reap big returns.\n\nThis non-aggression pact between startups and investors is known as \"Founder Friendly.\" It's long been touted as the magic recipe that produced smash-hits like Google and Facebook. It's the reason Mark Zuckerberg has complete voting control of Facebook, and why dull SEC registration filings now include flowery \"founder's letters to shareholders.\" And it's the key selling point at the heart of every venture capital firm's pitch.\n\nBut it's also the formula that gave us Adam Neumann, the WeWork founder whose approach to management and proclivity for self-dealing were so egregious that they ultimately scuttled the company's $47 billion IPO. And it's led to Facebook's unprecedented control of the world's information distribution and its troubling lack of accountability for spreading misinformation.\n\nYears of founder friendly business practices in Silicon Valley have created excesses, and the model is showing signs of strain. VC investors have been forced to oust some of the most problematic founders, and a string of IPO flops has provoked anxiety about the future.\n\nIn this special report, Business Insider takes a look at how the cozy arrangement between startup founders and startup investors is evolving, at the forces that created — and now threaten to undo — the founder friendly model and at the many ways the tech industry could be affected from CEOs to IPOs.\n\nRead the full stories on Business Insider Prime here:\n\nBenchmark's role ousting the CEOs of WeWork and Uber could be the end of the 'founder friendly' reputation that\n\n\n\nSilicon Valley's founder-led startups have lost their shine with IPO investors. But the obsession with direct listings won't fix the bigger problem.\n\n\n\nAs founders and VC investors lock horns, startups are on the hunt for 'outside' board directors, Silicon Valley's in-demand job", "description": "The non-aggression pact between startups and investors known as \"Founder Friendly,\" is showing signs of strain. Here's what comes next.", "authors": ["Alexei Oreskovic"], "top_image": "https://image.businessinsider.com/5da4ebd6cc4a0a5a0f3009d5?width=1200&format=jpeg", "published_at": "2019-10-14"}