{"pub": "politico", "url": "https://politico.eu/article/uk-mixed-brexit-messages-brexit-secretary-stephen-barclay", "downloaded_at": "2019-09-19 23:05:05.464216+00:00", "title": "UK sends mixed Brexit messages", "language": "en", "text": "LONDON — Brexit Secretary Stephen Barclay said the U.K. would like to see key decisions on avoiding a hard border in Ireland postponed until after Brexit.\n\nSpeaking in Madrid ahead of a meeting on Friday with EU chief negotiator Michel Barnier, Barclay said an alternative to the Northern Ireland backstop plan \"is not necessary\" until December 2020.\n\nHis comment appear to revive previous calls from Boris Johnson's government to deal with the Irish border question as part of future relationship talks due to take place after the U.K. leaves. The EU has repeatedly said that an acceptable insurance policy against a hard border has to be part of any Brexit deal and discussions between U.K. and EU negotiators have intensified in recent days in pursuit of measures at the border that are acceptable to both.\n\nOn Thursday both sides confirmed the U.K. had shared new documents setting out \"ideas\" on customs, trade in goods, and rules affecting livestock and food.\n\nBarclay's comment suggests the U.K.'s preferred solution would be to leave with a deal on October 31, but with the nature and scope of \"alternative arrangements\" to the backstop yet to be fully defined; a position likely to be viewed dimly by EU negotiators.\n\nOn a day of mixed signals, Johnson’s Brexit negotiators in Brussels submitted documents setting out “ideas” for replacing the Northern Ireland backstop.\n\nSpeaking in the European Parliament on Wednesday, Barnier repeated the EU's insistence upon \"legally operational solutions in the Withdrawal Agreement\" itself; a call, in other words, for firm legal commitments before the U.K. leaves.\n\nBut Barclay said the EU's approach risks \"crystallizing an undesirable result this November,\" by which the U.K. would be forced to leave without a deal.\n\n\"We are told the U.K. must provide legally operative text by the 31st October,\" he said, speaking at an event hosted by Europa Press in Madrid. \"Yet the alternative to the backstop is not necessary until the end of the [post-Brexit] implementation period in December 2020. And this will be shaped by the future relationship — which is still to be determined.\"\n\nBarclay's argument appeared to be a somewhat circular one, as the implementation — or transition — period would only come into force if there is a Brexit deal, and would not happen in the event of no-deal.\n\nEU diplomats have long warned that, for a deal to be struck at October’s European Council summit on October 17-18, the groundwork must have been laid well in advance.\n\nBut the Brexit secretary also challenged the EU not to assume the U.K. would return to the negotiating table in the event of no-deal on October 31 \"from a position of weakness,\" warning that such an outcome would hurt EU countries — in particular Ireland.\n\n\"Two-thirds of Irish medicines come through Great Britain, 40 percent of its exports go through Dover. Its supermarkets are supplied from distribution centers in the Midlands. Yet this is presented as solely a U.K. challenge — it is a mutual challenge, because if indeed there were two and a half days of delays at Calais, then the impact of that would not solely be felt within the U.K., it would be felt in Ireland and indeed in businesses here in Spain,\" he said.\n\nOn a day of mixed signals, Johnson’s Brexit negotiators in Brussels submitted documents setting out “ideas” for replacing the Northern Ireland backstop, the U.K. government and European Commission said.\n\nThe documents will be the subject of technical discussions between U.K. and EU officials on Thursday, Commission spokesperson Mina Andreeva said. Barclay and Barnier will also hold political talks on Friday, Andreeva told reporters in Brussels.\n\nA U.K. government spokesperson described the documents as “a series of confidential technical non-papers which reflect the ideas the UK has been putting forward.” They said that “formal written solutions” would not be submitted until the U.K. is “ready” and not according to “an artificial deadline” — an apparent reference to Finnish Prime Minister Antti Rinne’s reported preference for a September 30 deadline for formal U.K. proposals.\n\nIf no deal is struck by October 19, Boris Johnson is required to seek an extension to the Article 50 process.\n\nEU diplomats have long warned that, for a deal to be struck at October’s European Council summit on October 17-18, the groundwork must have been laid well in advance. However, a senior EU official talked down the idea of September 30 as a make-or-break moment.\n\n“Nobody is going to call it a hard deadline on September 30,” the official said, adding: “Obviously, we are running out of time, that’s a matter of fact.”\n\nDomestically, Johnson may wish to navigate the Conservative Party’s annual conference, which takes place in Manchester from September 29 to October 2, before making a formal proposal to the EU ahead of European Council.\n\nIf no deal is struck by October 19, he is required by a law passed by the U.K. parliament earlier this month to seek an extension to the Article 50 process, but has insisted he will not do so.\n\nAndreeva said the new U.K. papers would be the basis for “technical discussions” on Thursday “on some aspects of customs, manufactured goods and sanitary and phytosanitary rules.”\n\n“Then the discussions will also take place at political level,” she said.\n\nA “non-paper” is a document containing discussion points, rather than formal policy positions, U.K. officials said.\n\nDavid Herszenhorn, Lili Bayer and Emilio Casalicchio contributed reporting.\n\nThis article is part of POLITICO’s premium policy service: Pro Energy and Climate. From climate change, emissions targets, alternative fuels and more, our specialized journalists keep you on top of the topics driving the Energy and Climate policy agenda. Email pro@politico.eu for a complimentary trial.", "description": "Stephen Barclay calls for talks on Irish backstop to be delayed, but London has also presented ‘ideas’ on that same subject.", "authors": ["Charlie Cooper", "Matei Rosca", "Rym Momtaz"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/GettyImages-1168770611-1200x628.jpg", "published_at": "2019-09-19"}