{"pub": "yahoo", "url": "https://finance.yahoo.com/news/cloudflare-net-latest-ipo-disappoint-154503831.html", "downloaded_at": "2019-10-04 13:13:44.948102+00:00", "title": "Cloudflare (NET): Latest IPO To Disappoint Investors", "language": "en", "text": "The enterprise cloud space continues to expand as another player enters the public markets. Cloudflare (NET) just launched its IPO on September 13th for a share price of $15 or a $4.4 billion valuation. Like most IPOs this year, the price immediate jumped 20% with the first public trade being for $18. NET has traded up to $22 and down to $15.50 over the past 2.5 weeks.\n\nThe Business\n\nCloudflare’s product offering leverages cloud technology to create an efficient internet for companies of tomorrow. It provides a scalable cloud network for enterprises that spans over 194 cities in 90 countries. The platform offers embedded security and performance as well as a breadth of functionality that allows customers to reduce the number of cloud services they need. Its product offering is a combination of security, performance, and reliability.\n\nCloudflare’s initial entices customers with its state of the art security software, which blocks 44 billion cyberattacks daily. Once the customer is satisfied with the platform’s performance they begin to add more of Cloudflare’s software.\n\nSoftware like Cloudflare Argo which, “improves Internet performance by intelligently routing end users through the least congested and most reliable paths over the Internet using our network,” according to the firm’s prospectus. More than 70% of Cloudflare’s enterprise customers are utilizing at least four of its products.\n\nCloudflare continues to innovate and add more and more capabilities to its already extensive list of products. Its continued innovation will only further increase the attractiveness of the platform’s “one-stop-shop” offering for all a firm’s enterprise cloud needs. This cloud platform’s scalability makes it a perfect fit for any growing business.\n\nThe company’s customer retention and ability to meet evolving customer needs is impressive. Below is a chart from Cloudflare S-1 filing illustrating revenue and customer retention.\n\nOver 20 million internet properties are currently using Cloudflare, making up 2 million paying and nonpaying customers. 10% of Fortune 1000 companies use this platform, including Walmart (WMT), Adobe (ADBE), IBM (IBM), and Zendesk (ZEN).\n\nThe Financials\n\nStory continues", "description": "Cloudflare (NET): Latest IPO To Disappoint Investors", "authors": ["Daniel Laboe"], "top_image": "https://s.yimg.com/uu/api/res/1.2/IGgNlTqPoUI_q_.xm2rLjg--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/c90d397558e300afa547b11c9fe82be2", "published_at": "2019-10-03"}