{"pub": "news24", "url": "https://traveller24.com/FindYourEscape/Adventure/this-haunted-house-will-pay-you-if-you-can-make-it-to-the-end-but-no-one-ever-has-20191025", "downloaded_at": "2019-10-25 16:13:51.977918+00:00", "title": "This haunted house will pay you if you can make it to the end - but no one ever has!", "language": "en", "text": "YOU MIGHT ALSO LIKE {{item.title}}\n\nThis is way darker than dark tourism. It's a true nightmare come to life!\n\n\n\nHalloween is around the corner, and if there's one thing Americans do right, it's Halloween.\n\nREAD: These tunnels in SA and from around the world will pique your inner explorer's interest\n\nTravel and Leisure reports that there is a haunted house, McKamey Manor in Summertown, Tennessee, that claims to be the world's scariest house of horrors. And that's quite a claim. Why so scary, you ask?\n\nUm...\n\nStuff. Of. Nightmares.\n\nAnd the thing is, people voluntarily do this. To challenge themselves, to push their limits, to prove something, who knows.\n\nRuss McKamey is the mastermind behind this extreme haunted home concept. His house has even been featured on the Netflix show, Dark Tourism and Haunters: The Art of the Scare. He says it's more of a mental game than anything else.\n\nHe films every visitor throughout, as to avoid any false accusations being made afterwards.\n\nIt only costs a bag of dog food to enter the house (the owner has a lot of dogs). But coming out of the house after completing the whole ordeal, is something no one has ever achieved.\n\nREAD:It is a horror fest! Your Halloween plans are sorted with these October events\n\nBecause of the severity of the experience, you need a doctor's note before entering, plus you have to sign a whopper of a contract. This probably means your heart will be racing like a Hummingbird on speed.\n\nMcKamey is so confident is his scare tactics, that he's even offering $20 000 (R293 280) to the person who is able to complete the experience.\n\nUp for this challenge?\n\nFind Your Escape by signing up for the Traveller24 Weekly Newsletter – Subscribe here. Or download the News24 App here, to receive expertly curated travel ideas and deals directly to your mobile.", "description": "This is way darker than dark tourism. It's a true nightmare come to life!", "authors": ["- Marisa Crous"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7841/55d48bad06f347cf9e4f0b83091d26f2.png", "published_at": "2019-10-25"}