{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/10/jerry-falwell-jr-liberty-university-president-call", "downloaded_at": "2019-09-10 23:27:21.216871+00:00", "title": "Liberty University President Jerry Falwell Jr. calls for FBI probe of 'attempted coup'", "language": "en", "text": "RICHMOND, Va. — Liberty University President Jerry Falwell Jr. said Tuesday that he is asking the FBI to investigate what he called a “criminal” smear campaign orchestrated against him by several disgruntled former board members and employees.\n\nFalwell told The Associated Press he has evidence that the group improperly shared emails belonging to the university with reporters in an attempt to discredit him. He said the “attempted coup” was partially motivated by his ardent backing of President Donald Trump.\n\nFalwell, head of the nation’s most high-profile evangelical college, was among the earliest Christian conservatives to endorse Trump’s campaign.\n\nHis allegations come after the publication of a story in Politico Magazine on Monday that alleged Falwell “presides over a culture of self-dealing” at Liberty that has improperly benefited him and his family. The story cited unnamed sources described as current and former officials or Falwell associates.\n\n“I’m not going to dignify the lies that were reported yesterday with a response, but I am going to the authorities and I am going to civil court,” Falwell said, referring to the reporter as a “little boy.”\n\nHe added that Liberty has hired “the meanest lawyer in New York,” whom he declined to identify, to pursue civil cases. Falwell also declined to identify the people he said were spreading the emails.\n\nFalwell is the son of the late evangelist, Liberty founder and Moral Majority leader the Rev. Jerry Falwell. He has come under increased scrutiny recently over his personal life and business investments, including his involvement in a Miami hostel.\n\nThe Hill first reported on Tuesday that Falwell had requested an FBI investigation.\n\nFalwell said he contacted the FBI last week after he learned that reporters were reaching out to Liberty employees about the emails he insists were stolen.\n\n“Liberty owns every single one of those emails. It’s our property. They were working for us when they used our server. And our policies make it clear every email sent on our server is owned by Liberty and if anybody shares it with anybody outside Liberty, it is theft. And so that’s the underlying crime,” Falwell told AP in a phone interview.\n\nAn FBI spokeswoman declined comment.\n\nCybercrime expert Nick Akerman said Falwell’s assertion of a criminal conspiracy is “totally insane.” Akerman said the ex-board members and employees can share emails with reporters as long as they had authorized access to them and didn’t hack into someone else’s account. He said trade secrets are also protected under the law, but Liberty wouldn’t be able to make a case there either.\n\n“I don’t think any law enforcement agency is going to be interested in this one,” said Akerman, a partner at Dorsey & Whitney and former federal prosecutor.\n\nLiberty, based in Lynchburg, Virginia, was founded in 1971 by Falwell’s father with just 154 students. It now boasts an enrollment of more than 100,000, including those in its massive online education program. It has become an influential hub of conservative politics, frequented by candidates courting evangelical voters.\n\nFalwell was an early and ardent Trump supporter, which created a rift on campus during the presidential campaign and has sparked controversy since.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Liberty University President Jerry Falwell Jr. said Tuesday that he is asking the FBI to investigate what he called a \"criminal\" smear campaign orchestrated against him by several disgruntled former board members and employees.", "authors": ["The Washington Times Http", "Sarah Rankin", "Alan Suderman"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2015/12/09/Liberty_University_Guns.JPEG-09d56_c0-0-3555-2072_s1770x1032.jpg?96564adeafe74f5df23adafdf87d2eefa1cd333b", "published_at": "2019-09-10"}