{"pub": "washingtonpost", "url": "https://washingtonpost.com/transportation/2019/10/01/bowser-does-an-end-run-around-dc-council-transfers-speed-red-light-camera-program-ddot", "downloaded_at": "2019-10-02 12:49:09.091868+00:00", "published_at": "2019-10-01", "title": "Bowser does an end run around D.C. Council, transfers traffic camera program to DDOT", "language": "en", "text": "Bowser administration officials said that the mayor did not need the council’s approval to move the team of 20 city employees overseeing the traffic camera program to DDOT. The mayor had proposed the transfer multiple times in recent years, and each time her request was denied by the council. The administration touted the transition as critical to the mayor’s Vision Zero strategy, a plan to create safer streets and lower the number of traffic fatalities and injuries.\n\nAD\n\nAD\n\n“This is a mayoral program because it is operational,” Deputy Mayor Lucinda Babers said. “The mayor did have the ability to make the transfer without legislation. She simply utilized her authority as the mayor to make this transfer.” Bowser signed an executive order Friday authorizing the change.\n\nD.C. Council member Mary M. Cheh (D-Ward 3), who chairs the panel’s transportation committee, said she found Bowser’s decision to go around the council “troubling,” and “disrespectful” to the legislative body.\n\n“The council says no to something and the mayor just goes ahead and does it anyway,” Cheh said. She said Bowser did not inform her, the transportation committee or the council about the move.\n\nAD\n\nWhen council members voted against the transfer as part of the budget process in May, they said they were concerned about short-term inefficiencies that might be caused by it and questioned whether tickets issued by DDOT would carry the same significance for drivers as those issued by police.\n\nAD\n\nCheh said council members would discuss the mayor’s action at a hearing Monday that had already been scheduled to review the proposal as separate legislation.\n\n‘It’s absolutely unacceptable’: Protesters demand safer streets in District\n\nGiving DDOT control of the automated system, which issues hundreds of thousands of citations each year, could help reduce the time it takes to process tickets and expedite the deployment of additional traffic enforcement cameras, administration officials said. Babers said the program is now in the hands of traffic engineers who are well versed on where trouble spots are and can make decisions about where to deploy cameras based on data. Previously, DDOT provided the data to D.C. police to make those placement decisions.\n\nAD\n\nBecause DDOT is leading the city’s traffic safety efforts, Babers said, it makes sense that it oversee automated enforcement.\n\nAD\n\n“It is a safety initiative,” Babers said. “We need to do everything we can to slow these vehicles down. We have many different modes of transportation sharing the streets. We have our cycles, mopeds, scooters and pedestrians, and we need to slow down vehicles so that drivers can see what’s going on and can see that pedestrian walking.”\n\nIn May, Cheryl Cort, policy director for the Coalition for Smarter Growth, wrote that transferring the program to DDOT was one of a number of actions the mayor could take to make city streets safer.\n\nAD\n\n“Traffic cameras can be an effective approach for discouraging dangerous behavior by drivers,” Cort wrote in Greater Greater Washington. “By placing oversight of this tool with the agency responsible for managing our streets, automated traffic enforcement could more effectively improve safety. Traffic cameras are helping now, but they could be used much more strategically if DDOT is able to integrate them into its safety programs.”\n\nAD\n\nThe move, however, is likely to upset drivers and their advocates who have widely criticized the program as a money-generator and a tool the city uses to penalize drivers as it pushes the use of public transit, biking and walking.\n\n“Traffic enforcement is a function of law enforcement agencies, not transportation departments,” said John Townsend, spokesman for AAA Mid-Atlantic. He said the transfer will probably increase the number of traffic citations issued, which he said would undermine the program’s integrity.\n\nAD\n\nCritics say Bowser is making the change to appease a vocal group of advocates who have called for stricter measures to reduce car use in the city. Many of those advocates are calling for changes in street design and policies to reduce traffic crashes and fatalities. But some critics call them part of a larger “war against cars” in the nation’s capital, where parking and driving are becoming more difficult.\n\nAD\n\n“This is only about revenue,” Townsend said. “This is not about traffic safety. This is about scoring political points.”\n\nAs part of the transition, Babers said DDOT will evaluate the program in its entirety, including the possibility of adding cameras and reducing the threshold speed allowed before a citation is issued. Speed cameras issue tickets to motorists caught driving more than 10 mph over the posted speed limit. Drivers should not expect any changes within the next six months, however, Babers said.\n\nAD\n\n“Everything will be on the table as we look at Vision Zero,” Babers said. “It is absolutely critical that we take a stronger stand in terms of what is in our power to control.”\n\nEarlier this year, the city was operating 171 traffic cameras, according to D.C. police: 107 that monitor speed, 48 to catch red-light runners, eight at stop signs and eight to detect vehicles that are above size and weight limits. Babers said she did not know how many cameras are currently in operation.\n\nCheh said she is concerned about the budgetary consequences of the move. Because the council did not authorize funding for the move in the budget, Cheh said, it is unclear how the mayor will fund it at DDOT.\n\nOfficials with the mayor’s office said they anticipate an interagency transfer of funds from D.C. police to DDOT.\n\nAD", "description": "The transfer, effective Tuesday, ramps up an ongoing political fight between the mayor and the D.C. Council over some of the city’s transportation priorities.", "authors": ["Luz Lazo", "Transportation Reporter Covering Washington'S Metro", "Buses", "Capital Bikeshare", "Taxis", "The Region'S Road Network"], "top_image": "https://www.washingtonpost.com/resizer/4ktRVKMprcROtySE5HDyqJ1-fAY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QJWV7DU77QI6RE7DETIXAPJKPI.jpg"}