{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7552381/Former-spy-chief-David-Omand-reveals-internet-giants-information-MI5.html", "downloaded_at": "2019-10-09 01:24:11.671222+00:00", "title": "Former spy chief David Omand reveals internet giants have more information about you than MI5", "language": "en", "text": "Internet giants know more about the general public than ‘any intelligence agency ever could or should’, according to a former director of GCHQ.\n\nDavid Omand said people’s personal information was ‘monetised’ and became ‘feedstock’ for political campaigning.\n\nHe said: ‘This is truly dangerous. It is a major threat to democracy and it is uncontrolled.’\n\nMr Omand contrasted the freedom of big technology companies – such as Facebook, Twitter and Google – with the strict regulatory regime spies must follow.\n\nDavid Omand (right, pictured with John Scarlett, chairman of Britain's Joint Intelligence Committee, left, in London in 2003) said people’s personal information was ‘monetised’ and became ‘feedstock’ for political campaigning\n\nMr Omand, speaking to international security expert Richard Aldrich at the Cheltenham Literature Festival, said: ‘The big revelation over the last couple of years has not been about government intelligence agencies – it has been about the private sector.\n\n‘It’s the fact that the internet companies know more about me, you, Richard, everyone in the hall, than any intelligence agency ever could or should know.’\n\nHe highlighted last year’s Cambridge Analytica scandal – when it was revealed the personal data of millions of Facebook users had been harvested without their consent and used to target them with political advertising. Mr Omand said it showed ‘the way in which our personal data which we freely give over in return for having an internet free at the point of use –so we can do our searches and so on – is monetised.\n\n‘[It] is the feedstock for political campaigning where a political party can send different messages to different groups of people because they already knew what individuals’ likely political preferences are.\n\nMr Omand highlighted last year’s Cambridge Analytica scandal – when it was revealed the personal data of millions of Facebook users had been harvested without their consent and used to target them with political advertising (file image)\n\n‘Over the last few years, particularly [after] the 2016 [Investigatory Powers] Act, the world of GCHQ is extraordinarily strictly regulated. Warrants have to be countersigned by a senior judge... all the apparatus which is necessary and I approve of it, is designed to ensure that, under any future government, we are not going to lapse into authoritarianism.’\n\nBut he added: ‘Nobody has worked out how to control the private use of our information.’\n\nMr Omand, 72, said GCHQ’s licence to operate had been laid down by Parliament, but this had been likened by some insiders to ‘going on a football pitch with eight players and a goalie with their hands tied’.\n\nHe said recent legislation forced GCHQ to admit publicly that it hacked into the computers of cyber criminals and terrorists.\n\nSuch actions were previously never admitted.\n\nMr Omand, who headed GCHQ in 1996 and 1997, said that while there were ‘qualms within the [intelligence] community about whether it was right to admit’ such activities, ‘in a democracy you are entitled to know what kinds of methods are being used to keep us safe’.\n\nIt was a ‘perfectly reasonable request from the public’, he said.", "description": "David Omand (pictured), former director of GCHQ, said personal information became 'feedstock' for political campaigning while speaking at the Cheltenham Literature Festival.", "authors": ["Richard Marsden For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/23/19466142-0-image-a-6_1570574935646.jpg", "published_at": "2019-10-08"}