{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/cintas-to-shut-down-processing-at-granby-quebec-facility-but-will-continue-servicing-customers", "downloaded_at": "2019-10-10 18:28:36.078950+00:00", "title": "Cintas to Shut Down Processing at Granby, Quebec Facility but Will Continue Servicing Customers", "language": "en", "text": "GRANBY, Quebec — Cintas Corporation (NASDAQ: CTAS) announced today plans to shut down the processing of uniforms, floor mats and other products at its Granby, Quebec facility by January 2, 2020. The company will continue to provide service to its customers from the facility and has plans to grow the number of service employees.\n\n“Our strategy is to focus on the optimal infrastructure to facilitate excellent customer service and future growth across the province of Quebec,” said James Dawe, North Atlantic Group Vice President for Cintas. “Cintas made the decision to have the processing for its Granby customers absorbed by some of its other facilities in order to process products of the highest quality in modern, up-to-date facilities using the latest technology.”\n\nThe processing stoppage will impact about 100 employee-partners. Cintas has 3 other facilities in the province and affected employee-partners are encouraged to apply for open positions at those facilities. If the company is unable to offer continuing employment, job placement and other resources will be provided. Cintas will also provide stay bonuses for employee-partners who work through the shut-down. It is a top priority for the company to assist these employee-partners and their families throughout this transition.\n\nAbout Cintas Canada, Ltd.\n\nCintas Canada Ltd, with headquarters in Mississauga, Ontario is a subsidiary of Cintas Corporation. Cintas helps more than 55,000 Canadian businesses of all types and sizes get Ready™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, floor care, restroom supplies, first aid and safety products, Cintas helps customers get Ready for the Workday®. Cintas is a publicly held company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of the Standard & Poor’s 500 Index.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191010005601/en/\n\nContacts\n\nCintas Corporation\n\nJames Dawe\n\nNorth Atlantic Group Vice President\n\n613-389-8474\n\ndawej2@cintas.com", "description": "GRANBY, Quebec — Cintas Corporation (NASDAQ: CTAS) announced today plans to shut down the processing of uniforms, floor mats and other products at its Granby, Quebec facility by January 2, 2020.", "authors": [], "top_image": "https://mms.businesswire.com/media/20191010005601/en/719486/3/1._MOST_RECENT._Cintas_RFTW_Logo_CMYK.jpg", "published_at": "2019-10-10"}