{"pub": "usatoday", "url": "https://usatoday.com/story/news/2019/08/15/michigan-police-investigate-officers-encounter-black-man/2022825001", "downloaded_at": "2019-10-06 13:26:35.312129+00:00", "title": "A black man was looking for parking. A white woman felt threatened and called the cops", "language": "en", "text": "DETROIT – Police have launched an internal investigation after officers stopped and questioned a black man reportedly because a white woman said he looked at her suspiciously.\n\nCritics say the police response was aggressive and over the top. A video of the encounter, which happened Tuesday evening outside a cafe in Royal Oak, a suburb of Detroit, is circulating on social media.\n\nThe man was walking to the restaurant when an officer pulled up and began asking him questions, cafe manager Erin Frey said. Three other officers also responded to the scene.\n\nThe man was questioned for almost an hour before he was told he was free to go, Frey said.\n\nIn a statement issued Wednesday, Royal Oak Mayor Michael Fournier said officials are reviewing what happened. He also said the city strives to provide public safety with the highest level of integrity and transparency.\n\n\"We are passionate about being a city that lives and acts according to our values and one where all people from all walks of life, from all racial and ethnic backgrounds feel not just safe, but welcome and embraced as members of our community,\" he said.\n\n\"We absolutely recognize that racial bias exists and we as a community aspire to be among those working every day to combat it. But, this is not just the work of our officers and public officials alone, but all of us, individually (and) as a community must put in the effort to recognize and come to terms with our own personal prejudices and biases.\n\n\"We are in the process of evaluating what mistakes have been made and we will own them, we will learn from them, and we will continue to strive to be better in everything we do.\"\n\nRoyal Oak Police Lt. Keith Spencer said the department is aware of the video and conducting an internal investigation. He declined to comment further.\n\nFrey said the incident began with the man trying to find a parking spot on the street across from the Inn Season. She said he waited for the woman to pull out of her parking space. When she didn't leave, he eventually drove away and found another spot elsewhere.\n\nFrey said the woman \"felt threatened and thought he was suspicious, and she called the police.\"\n\nAthletics: White Arkansas woman pulls gun on 4 black teens raising money for football team\n\n'Hard to understand': White cops on horseback led a black man by rope in Texas\n\nAfter parking his car, the man was walking to the restaurant, where his girlfriend was waiting inside, after parking his car when the first officer pulled up in a vehicle. The officer parked partially on the sidewalk, exited the vehicle and began asking the man questions, Frey said.\n\nA bystander named Kimiko Adolph recorded the incident and posted the video on Facebook. The video captures only the final minutes of the encounter, Frey said.\n\nIn the video, the man, who says he is 20 years old, can be seen talking to two police officers. After a police supervisor was called, two more officers arrived later on motorcycles, at least one of whom was a supervisor, Frey said.\n\nFrey stayed outside with the man during the incident to show her support, she told the Free Press.\n\nIn the video, the man explained to the supervisor what happened.\n\n\"What makes it feel worse, is I'm pretty sure if she would have did the same thing,\" he said, motioning to Frey, who is white, \"you would have let her go 10 minutes ago.\"\n\nFrey also started talking to the supervisor. He said, \"So if someone calls about someone, we're not supposed to respond?\"\n\nThe man said: \"No you are, but not the way you are.\"\n\nWhen the man was told he could leave, he walked into the restaurant. Frey and the woman who was recording the video continued to talk to the supervisor.\n\nFrey told him the encounter should not have lasted as long as it did.\n\nThe supervisor said, \"All you had to do is say, you know what, 'I'm just parking my car, minding my own business.' Everything checks OK, and you know what? He'd be eating right now, he'd have an hors d' oeuvre right now.\"\n\n\"He did say that,\" both Frey and the woman recording the video responded.\n\nFrey said she thought police handled the situation \"completely inappropriately.\"\n\n\"I understand police have to come and respond\" if someone reports feeling threatened, she said. But, she said there was no reason for the first officer who responded to \"handle it so aggressively right from the get-go.\"\n\nFrey said later that night, the Inn Season picked up the dinner tab for the man and his girlfriend.\n\nFollow Ann Zaniewski on Twitter: @AnnZaniewski.\n\nRead or Share this story: https://www.usatoday.com/story/news/2019/08/15/michigan-police-investigate-officers-encounter-black-man/2022825001/", "description": "Royal Oak, Michigan police are investigating after officers reportedly stopped a black man because a white woman said she felt threatened", "authors": ["Ann Zaniewski", "Published P.M. Et Aug."], "top_image": "https://www.gannett-cdn.com/-mm-/b68f3f6134ff1d4d4f961f69e674209c3cdb9149/c=0-100-358-302/local/-/media/2017/01/28/DetroitFreePress/DetroitFreePress/636211899066366513-B9316366500Z-1-20150223194431-000-G1UA1UJ56-1-0.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-08-15"}