{"pub": "foxnews", "url": "https://foxnews.com/entertainment/hart-to-hart-stefanie-powers-robert-wagner-natalie-wood-william-holden", "downloaded_at": "2019-10-01 09:26:19.279730+00:00", "title": "‘Hart to Hart’ star Stefanie Powers says she and Robert Wagner ‘held each other up’ after partners’ deaths", "language": "en", "text": "Stefanie Powers still has fond memories of working alongside Robert Wagner.\n\nThe pair famously worked together in the popular series “Hart to Hart,” which chronicled the globe-trotting adventures of detectives Jonathan (Wagner) and Jennifer Hart (Powers). The show aired from 1979 until 1984.\n\nROBERT WAGNER GETS CANDID ABOUT HIS STAR-STUDDED LOVE LIFE AND SECRET AFFAIR WITH A HOLLYWOOD STAR\n\n“We chose to be together,” Powers, 76, told The Daily Mail about her on-screen marriage to Wagner, 89.\n\n“We loved each other,” she continued. “We adored everything about each other — I’m talking about Jonathan and Jennifer… It was a fantasy. An escapist romantic comedy adventure. We just had to keep that bubble in the air… You didn’t have to worry about bad language or X-rated [scenes]. The whole family enjoyed it.”\n\nThe outlet shared that the show’s creators originally wanted Wagner’s wife, Natalie Wood, to appear in their series. But Wagner, who previously worked with Powers, felt she was the best choice for the role.\n\n“It was not an overnight success, but once people discovered us, it took off,” said Powers. “I remember the screams of fans when we won the People’s Choice Awards [in 1980] and we suddenly realized: ‘Oh my God, they really like us!’”\n\nJAMIE LEE CURTIS HONORS DAD TONY CURTIS ON 9TH ANNIVERSARY OF HIS DEATH\n\nPowers also shared that she and Wagner have remained very close long after the series came to an end.\n\n“We can push each other’s buttons today,” she said. “We laugh all the time.”\n\nThe actress reveals that while Wagner lives in Aspen with his wife, Bond girl Jill St. John, they still reach out to Powers whenever they’re in Beverly Hills.\n\n“He’s coming in next week, so we’ll get together,” said Powers.\n\nBURT REYNOLDS’ PALS REMEMBER ‘SMOKEY AND THE BANDIT’ STAR A YEAR AFTER HIS DEATH: ‘HE ALWAYS HAD YOUR BACK’\n\nThe star also insisted that while some fans have long believed she and Wagner were really a couple, they have a completely different kind of relationships.\n\n“Siblings who really like each other,” she clarified. “When we were working together, sometimes we would get into laughing fits and they’d have to send us home. In the context of what our personal relationship actually is, that is actually hysterical.”\n\nStill, Powers admitted there was something special about the chemistry she shared with Wagner when cameras were rolling.\n\n“If I knew what the ingredients were, I would bottle it and make a fortune,” she said.\n\nJUDY GARLAND’S DAUGHTER LORNA LUFT SAYS SHE ISN’T WATCHING NEW BIOPIC: ‘I HAVE TO PROTECT HER LEGACY’\n\nAccording to the outlet, both stars were involved in relationships when “Hart to Hart” went on the air. While Wagner was married to Wood, Powers was in a relationship with William Holden.\n\nIn November 1981 both Wood and Holden died. The “Rebel Without a Cause” actress drowned at age 43 while she was on a weekend sailing trip with Wagner. Holden, a known alcoholic, was found dead in his home at age 63 after tripping and gashing his head.\n\nPowers is aware that there continues to be speculation surrounding Wood’s death. In 2018, Wagner was named “a person of interest” by authorities investigating her passing. A rep for Wagner slammed Wood’s younger sister Lana Wood and boat captain Dennis Davern for accusing the actor of being involved in the death of his movie star wife.\n\n“They are despicable human beings, capitalizing on the accidental death of a beloved member of the Wagner family,” Wagner’s rep told Fox News. “They should be ashamed of themselves.”\n\nLUCILLE BALL ENDURED RUTHLESS CRITICISM ON ‘LIFE WITH LUCY,’ SAYS CO-STAR: ‘THEY WERE SO BLOODY’\n\nIn response to the allegations, Powers said: “There are people who, whenever they can, try to make some money off of selling the story. I’m sure it gets to [Wagner].”\n\nPowers admitted the sudden passings that occurred that fateful November was difficult to cope with.\n\n“That was a very, very tragic period,” said a tearful Powers.\n\nThe show, however, had to go on.\n\n'ROOM 222' STAR KAREN VALENTINE RECALLS 'AWFUL' ENCOUNTER AFTER 'THE DATING GAME'\n\n“We had an obligation,” she said. “We didn’t have much choice.”\n\nPowers said she and Wagner relied on each other to make sense of the double tragedy.\n\n“We were very close anyway,” she explained. “We held each other up.”\n\nThe outlet revealed that at the time of Holden’s death, he and Powers had separated but still kept in close contact. They were previously together for nine years.\n\n‘BUCK ROGERS’ STAR ERIN GRAY SAYS SHE WAS INITIALLY ‘SCARED TO DEATH’ OF PLAYING COL. WILMA DEERING\n\n“The middle seven years were brilliant,” she reflected. “They were bookended [by alcoholism]. Alcohol was his mistress. It was inevitable that something bad was going to happen.”\n\nToday, Powers said she’s still proud of her time playing Jennifer Hart and what it offered her both professionally and personally.\n\n“An awful lot of people still hold that show very dearly,” she said. “My contractor said he was channel-surfing last night and he found ‘Hart to Hart.’ He said, ‘I was transfixed. It gave me the nicest nostalgic feeling.’ I thought, ‘Isn’t that lovely.’”\n\nDespite the loyal fan following “Hart to Hart” still has, Powers couldn’t imagine what the show would be like today.\n\nEDIE ADAMS’ SON EXPLAINS WHY HER LATE HUSBAND ERNIE KOVACS IS SEEMINGLY FORGOTTEN IN HOLLYWOOD\n\n“I don’t think RJ [Wagner] would be interested in running after villains now — unless he had a power-wheelchair,” she chuckled. “But we’d still be together. And it would still be a liability to be a friend of ours!”\n\nIn 2010, the Los Angeles Times reported Powers released an autobiography titled “One From the Hart” where she opened up about her affair with Holden that lasted nearly a decade and her friendship with Wagner.\n\nAt the time, Powers said she hoped the book would set the record straight on Holden.\n\n“There was another book about Bill that had ‘direct’ quotes from people that I know the author could never have gotten because they were dead by the time he wrote the book,” she told the outlet. “I thought, 'son of a gun, all that has ever been written about Bill is going to remain the standard by which everybody judges him. Maybe I should write down the truth — the truth about our relationship and the truth about him as I saw it and put him in the light, not the light of a knight in shining armor but in the light of what the real man was.'”\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nPowers also shared the secret behind her show’s lasting success.\n\n“It came at the right time,” she said. “It proselytized a kind of romance and relationship that really were ideal. They were two people who didn’t have to qualify their relationship and didn’t seem to have to in any way sacrifice anything in order to be together. They were on equal footing, and they regarded each other as partners in everything they did.”", "description": "Stefanie Powers still has fond memories of working alongside Robert Wagner.", "authors": ["Stephanie Nolasco"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/GettyImages-93765692.jpg", "published_at": "2019-09-30"}