{"pub": "reuters", "url": "https://reuters.com/article/us-ual-results/united-lifts-2019-profit-target-as-strong-travel-demand-outweighs-max-crisis-idUSKBN1WU2QL", "downloaded_at": "2019-10-15 23:12:39.358409+00:00", "title": "United lifts 2019 profit target as strong travel demand outweighs MAX crisis", "language": "en", "text": "(Reuters) - United Airlines (UAL.O) on Tuesday topped Wall Street estimates for quarterly profit, boosted by higher fares and lower fuel costs, and lifted its 2019 profit target despite the continued grounding of the Boeing 737 MAX.\n\nFILE PHOTO: United Airlines planes, including a Boeing 737 MAX 9 model, are pictured at George Bush Intercontinental Airport in Houston, Texas, U.S., March 18, 2019. REUTERS/Loren Elliott/File Photo\n\nChicago-based United is one of three U.S. airlines that have each had to cancel more than 2,000 monthly flights through the end of the year as Boeing Co’s (BA.N) 737 MAX remains grounded following two deadly crashes in Indonesia and Ethiopia.\n\nThe flight cancellations have weighed on airline profits and costs, but strong travel demand, despite concerns of a global economic slowdown, continued to offset MAX headwinds and disruption in Hong Kong and China.\n\nAs a result, United raised its 2019 adjusted diluted earnings per share guidance to $11.25-$12.25 versus $10.50-$12.00 previously.\n\nUnited shares, which closed up 1% at $87.88 before the earnings release, were about 1% higher in after-hours trading.\n\nTotal operating revenue rose 3.4% to $11.38 billion, underpinned by the airline’s three-year strategy to build up flight connections through its main U.S. hubs.\n\nBut closely watched unit costs excluding fuel and profit-sharing expenses, a concern for investors, rose 2.1%.\n\nThe airline, which is in talks with Boeing over 737 MAX compensation, did not provide any details on the estimated financial impact of the grounding.\n\nAdjusted net income rose to $1.05 billion, or $4.07 per share, in the third quarter, from $834 million or $3.05 per share a year earlier.\n\nAnalysts on average had forecast $3.95 per share, according to IBES data from Refinitiv.\n\nUnited management will host a conference call to discuss results on Wednesday at 10:30 a.m. EDT (1430 GMT).\n\nFellow U.S. MAX operators Southwest Airlines (LUV.N) and American Airlines (AAL.O), which have both warned of a pretax profit hit from the MAX grounding, are due to report quarterly results next week.\n\nUnited, Southwest and American are all scheduling without the MAX until early January.", "description": "United Airlines on Tuesday topped Wall Street estimates for quarterly profit, boosted by higher fares and lower fuel costs, and lifted its 2019 profit target despite the continued grounding of the Boeing 737 MAX.", "authors": ["Tracy Rucinski", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1441229488&w=1200&r=LYNXMPEF9E1UI", "published_at": "2019-10-15"}