{"pub": "independent", "url": "https://independent.co.uk/news/world/middle-east/iran-saudi-arabia-oil-drone-attack-trump-khamanei-unga-a9108636.html", "downloaded_at": "2019-09-17 13:10:56.063254+00:00", "title": "Iran rules out talks with Trump, as US attempts to downplay appetite for war", "language": "en", "text": "Iran’s Supreme Leader Ali Khamenei has ruled out talks with the United States in significantly timed comments that were among his most pessimistic on prospects for relations with Washington, and even the West.\n\nAyatollah Khamenei, the high-ranking cleric who is Iran’s ultimate spiritual and political authority, denounced the policy of “maximum pressure” pursued by the administration of Donald Trump and rejected the possibility of talks with American officials until it returns to the 2015 nuclear deal it abandoned last year.\n\nHe also dismissed the possibility of a speculated meeting between Mr Trump and Iranian president Hassan Rouhani during the annual gathering of the United Nations General Assembly in New York this week.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n\"The maximum pressure policy is worthless in front of the Iranian nation and every official in Iran collectively believes there will be no talks with America at any level,\" he told seminary students, according to state media.\n\nUntil sanctions reimposed following the US withdrawal from the deal last year are lifted, he said \"there will be no talks at any level between officials of the Islamic Republic and Americans, neither in New York, nor elsewhere.”\n\nThe ruling out of talks follows a calamitous attack on crucial Saudi oil facilities on Saturday that took half of the country’s petroleum-producing potential temporary offline.\n\nShape Created with Sketch. Attack on major oil facilities in Saudi Arabia: In pictures Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Attack on major oil facilities in Saudi Arabia: In pictures 1/10 Smoke billows from multiple fires at the Aramco oil processing facility in Abqaiq, Saudi Arabia on 14 September Reuters 2/10 Thick black smoke billows from a fire following drone strikes on major oil facilities in Abqaiq, Saudi Arabia Planet Labs Inc/Reuters 3/10 The Aramco oil processing facility in Abqaiq, Saudi Arabia prior to the drone strikes on 14 September AP 4/10 Damage is seen to the Aramco oil processing facility in Abqaiq, Saudi Arabia following drone strikes on 14 September, the previous day (Image 1 of 2) AP 5/10 Damage is seen to the Aramco oil field in Abqaiq, Saudi Arabia following drone strikes on 14 September, the previous day (Image 2 of 2) AP 6/10 Damage is seen to the Aramco oil field in Khurais, Saudi Arabia following drone strikes on 14 September, the previous day (Image 1 of 2) AP 7/10 Damage is seen to the Aramco oil field in Khurais, Saudi Arabia following drone strikes on 14 September, the previous day (Image 2 of 2) AP 8/10 Smoke billows from multiple fires following drone strikes on major oil facilities in Abqaiq, Saudi Arabia AFP/Getty 9/10 Smoke rises from a fire following a drone strike at the Aramco facility in Abqaiq, Saudi Arabia on 14 September Reuters 10/10 Smoke is seen following a fire at the Aramco oil processing facility in Abqaiq, Saudi Arabia on 14 September Reuters 1/10 Smoke billows from multiple fires at the Aramco oil processing facility in Abqaiq, Saudi Arabia on 14 September Reuters 2/10 Thick black smoke billows from a fire following drone strikes on major oil facilities in Abqaiq, Saudi Arabia Planet Labs Inc/Reuters 3/10 The Aramco oil processing facility in Abqaiq, Saudi Arabia prior to the drone strikes on 14 September AP 4/10 Damage is seen to the Aramco oil processing facility in Abqaiq, Saudi Arabia following drone strikes on 14 September, the previous day (Image 1 of 2) AP 5/10 Damage is seen to the Aramco oil field in Abqaiq, Saudi Arabia following drone strikes on 14 September, the previous day (Image 2 of 2) AP 6/10 Damage is seen to the Aramco oil field in Khurais, Saudi Arabia following drone strikes on 14 September, the previous day (Image 1 of 2) AP 7/10 Damage is seen to the Aramco oil field in Khurais, Saudi Arabia following drone strikes on 14 September, the previous day (Image 2 of 2) AP 8/10 Smoke billows from multiple fires following drone strikes on major oil facilities in Abqaiq, Saudi Arabia AFP/Getty 9/10 Smoke rises from a fire following a drone strike at the Aramco facility in Abqaiq, Saudi Arabia on 14 September Reuters 10/10 Smoke is seen following a fire at the Aramco oil processing facility in Abqaiq, Saudi Arabia on 14 September Reuters\n\nYemen’s Houthi rebels, currently fighting Saudi-led forces in a four year-war for control of their own country, claimed responsibility for the attack, but US officials insist it was Iran’s doing, without providing conclusive evidence.\n\nSaudi Arabia has said its preliminary investigation suggests Iranian-made weapons were used in the attack, which left no injuries, but has been circumspect in assigning blame, calling for an international investigation overseen by the United Nations.\n\nIran has denied it was behind the attack, mocking the US accusations.\n\nBoth the Trump administration and Saudi Arabia’s leadership are contemplating a response, but worry that any military action could ignite a further escalation, potentially leading to damage to even more oil infrastructure and further driving up world oil prices.\n\nArmed conflict with an enemy as unpredictable and steeped in unconventional methods of warfare as Iran could damage both the Saudi economy and that of the US less than 14 months before highly anticipated presidential and legislative elections.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nFacing sanctions that are crippling its economy, the Iranian leadership has repeatedly vowed that it would respond in kind by hurting the economies of its adversaries.\n\nThe Trump administration is considering a deal proposed by French President Emmanuel Macron to grant Iran $15bn in credit to Iran to ease tensions and create breathing space for diplomacy.\n\nBut Ayatollah Khamenei appeared to downplay the possibility that France could broker such a deal, distinguishing Iran from what he described as “the dependents of the rotten system of Western capitalism.”\n\n\"We should not look to foreigners, we should not pin hopes on this or that government,\" he said. \"We're not saying let's close the door to cooperation with the world's government. But it's one thing to rub shoulders with others and another to handle the country's affairs by relying on others. The solution to problems is inside the country.\"", "description": "Iran’s Supreme Leader Ali Khamenei has ruled out talks with the United States in significantly timed comments that were among his most pessimistic on prospects for relations with Washington, and even the West.", "authors": ["Borzou Daragahi"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/17/13/Iran-Khamanei.jpg", "published_at": "2019-09-17"}