{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7622363/MANCHESTER-UNITED-FAN-VIEW-Marcus-Rashford-reaching-50-goal-mark.html", "downloaded_at": "2019-10-29 14:40:54.218607+00:00", "title": "MANCHESTER UNITED FAN VIEW on Marcus Rashford after reaching 50-goal mark", "language": "en", "text": "Manchester United supporters should give Marcus Rashford more credit for already reaching the 50-goal mark in a poor squad, says Scott Patterson, author of The Republik of Mancunia blog\n\nMarcus Rashford scored his 50th Manchester United goal on Sunday afternoon, helping his team beat Norwich 3-1. As the ball hit the back of the net, following a perfect first touch and cool finish, supporters on social media were still in the midst of slating the youngster for his penalty miss moments earlier.\n\nRashford has been thrust in to a more central role this season, following the club's decision not to replace Romelu Lukaku in the summer, even though, as his goal and assist against Norwich showed, he performs much better when he's allowed to play out wide and cut inside.\n\nIf you read supporters on Twitter, it has been a failed experiment from Ole Gunnar Solskjaer, although it's worth taking in to consideration that Rashford's total goals and assists this season in the league equal the tally of Raheem Sterling and Mohamed Salah. He has more than Harry Kane and Sadio Mane. It would be interesting to see if those players are berated as much as United's 21-year-old is at times by their fans.\n\nMarcus Rashford reached the 50-goal mark for Manchester United after netting at Norwich\n\nRashford has become a victim of his own success, with unfair expectations on his shoulders\n\nThe England striker bounced back emphatically from his penalty miss against Norwich\n\nMARCUS RASHFORD'S MAN UNITED CAREER Appearances: 183 Goals: 50 Assists: 29 Minutes: 11,457 Honours FA Cup: 2015-16 Community Shield: 2016 EFL Cup: 2016-17 Europa League: 2016-17\n\nRashford has been in United's first team for so long now, following the injury crisis that meant he learnt he would be making his debut just minutes before kick-off back in 2015, that people may forget he's as young as he is. He's the victim of his own success, with unrealistic and unfair expectations put on his shoulders through the sheer desperation United fans feel to see their club back on top.\n\nIf only they could show Rashford the same patience that was offered to a Portuguese international the club signed in the summer of 2003. Rashford reached the 50-goal landmark in fewer games than Cristiano Ronaldo but is too often dismissed as not being good enough.\n\nWhile Ronaldo played more games out wide than Rashford has, in the early years at least, it's worth remembering the gulf in quality between the teams the two players have represented.\n\nUnited were champions of England when Ronaldo signed, but had finished seventh under David Moyes the summer before Rashford's debut. The day after Ronaldo scored his 50th United goal, a penalty at the Etihad to beat Manchester City, Sir Alex Ferguson's men were crowned champions again. They reached the Champions League semi-finals and FA Cup final that year. It doesn't need spelling out that United's current side falls a long way short of those standards.\n\nRonaldo wasn't expected to be the superstar when he was young. If he made a mistake, which he often did as he was perfecting his trade, he was surrounded by world-class players who could help him make amends, but Rashford hasn't been offered that same luxury. Rival fans would taunt Ronaldo for being a one-trick pony, and United supporters would counter that with tongue in cheek chants of 'there's only one Ronaldo', when the Brazilian namesake was banging in 30 goals a season for Real Madrid.\n\nRashford has more goals and assists this season than Harry Kane (above) and Sadio Mane\n\nRashford reached the 50-goal landmark in fewer games than Cristiano Ronaldo (above)\n\nRonaldo benefited from having just one manager during his United career, someone who happened to arguably be the greatest manager of all time. In contrast, Rashford has had three different permanent managers, all with a totally different outlook on how the game should be played. Pretty much every season something different has been asked of him, yet still he has managed to deliver.\n\nOf the 50 goals he's scored, 10 have come against Liverpool, Manchester City, Chelsea and Arsenal. He doesn't shy away from the big occasion, as his injury-time penalty against PSG last season showed at its best, but even when it doesn't work out for him, he doesn't give up because he is driven by his love for the club to succeed.\n\nHaving supported United all his life and joining the club at seven, he is desperate for the club to do well. When asked in the summer about his greatest moment at the club, he claimed it was the first time he saw his shirt hanging up in the dressing room.\n\n'Seeing my name was emotional, but seeing the badge . . . is an even stronger emotion,' he told The Times. 'It's the badge that drives me.'\n\nIt amazes me that there are fans who are so quick to get on the back of a young striker, who scores in the big games and clearly loves the club.\n\nRashford scores his first senior goal for United against FC Midtjylland in Europa League in 2016\n\nRashford then scored twice against Arsenal in the next game as hype built over his talents\n\nRashford celebrates United's FA Cup triumph after beating Crystal Palace in the final in 2016\n\nRashford and close friend Jesse Lingard hold aloft the Europa League trophy in May 2017\n\nThat's not to say that Rashford doesn't have plenty of support among the fanbase though. The following inside Old Trafford sing his name every week and have far more patience than their social media counterparts. There is the claim that he only gets this support because he's a local lad, which is insulting and dismisses all the valid reasons those fans have for believing in him.\n\nIt would be disingenuous to suggest that his feelings for the club don't factor in to the support he gets though, and quite rightly so. United's greatest teams have been built on a core of players who would do anything for the club, varying in ability. From David Beckham to John O'Shea, George Best to Nicky Butt, or Ryan Giggs to Wes Brown, academy products have more than pulled their weight and written their names in to United's history books. Which fan wouldn't want to see a lifelong supporter banging in goals, winning matches for the team and lifting trophies? You know that it means more to them and as a result they often give more, either in a starring or supporting role.\n\nAt just 21, we don't know which category of player Rashford will fall in to. He's got his first 50 for the club, will he go on to score another 50? Another 100?\n\nBut what is beyond doubt is that Rashford has bags of potential and has achieved so much already. If there's anyone who we should want to succeed at this club, it's him. He deserves wider respect and appreciation from the fans, in his quest to take United back to where they belong.\n\nHere's to the next 50!", "description": "SCOTT PATTERSON - AUTHOR OF REPUBLIK OF MANCUNIA BLOG: Marcus Rashford scored his 50th Manchester United goal on Sunday afternoon, helping his team beat Norwich 3-1.", "authors": ["Scott Patterson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/16/20286414-0-image-a-65_1572278454480.jpg", "published_at": "2019-10-29"}