{"pub": "huffpost", "url": "https://huffpost.com/entry/saudi-crown-prince-mohammed-bin-salman-60-minutes-khashoggi_n_5d91787be4b0e9e7604ee9a5", "downloaded_at": "2019-09-30 05:29:47.390047+00:00", "title": "Crown Prince Mohammed bin Salman Says He 'Absolutely' Did Not Order Khashoggi Murder", "language": "en", "text": "Saudi Crown Prince Mohammed bin Salman again denied ordering the murder of journalist Jamal Khashoggi, but said in a new interview with “60 Minutes” on Sunday that he takes “full responsibility” for the “heinous crime.”\n\nKhashoggi, a U.S. resident and columnist for The Washington Post, was last seen entering the Saudi consulate in Istanbul in October 2018. Turkish investigators said the journalist, a vocal critic of Prince Mohammad’s, was murdered and then dismembered by a team of Saudi agents.\n\n“This was a heinous crime,” bin Salman said, when asked by anchor Norah O’Donnell whether he had a role in the reporter’s grisly slaying. “But I take full responsibility as a leader in Saudi Arabia, especially since it was committed by individuals working for the Saudi government.”\n\nWhen asked to elaborate, the crown prince added: “When a crime is committed against a Saudi citizen by officials, working for the Saudi government, as a leader I must take responsibility. This was a mistake. And I must take all actions to avoid such a thing in the future.”\n\nO'Donnell: Did you order the murder of Jamal Khashoggi?\n\n\n\nCrown Prince Mohammad bin Salman: \"Absolutely not. This was a heinous crime. But I take full responsibility as a leader in Saudi Arabia, especially since it was committed by individuals working for the Saudi government\" pic.twitter.com/Mq793bYi9k — Norah O'Donnell🇺🇸 (@NorahODonnell) September 30, 2019\n\nIn June 2019, a United Nations special rapporteur concluded that Khashoggi had been the “victim of a deliberate, premeditated execution” and said there was “credible evidence” that the crown prince had ordered the killing. The CIA came to a similar conclusion.\n\nSaudi public prosecutors, however, ended up charging 11 men for the murder. Saud al-Qahtani, once the crown prince’s right-hand man, has been accused of helping to plan the killing; but he was not among the 11 charged.\n\nSpeaking to “60 Minutes,” bin Salman reiterated his claim that he’d known nothing about the planned attack.\n\n“Some think that I should know what three million people working for the Saudi government do daily? It’s impossible that the three million would send their daily reports to the leader or the second highest person in the Saudi government,” he said.\n\nThe royal also pushed back against the suggestion that the American government had implicated him in the murder.\n\n“There isn’t an official statement announced by the American government in this regard,” he told O’Donnell, later adding that the Saudi relationship with the U.S. is “much larger” than this one case.\n\n“Our role is to work day and night to overcome this and to make sure our future is much better than anything that happened in the past,” he said.\n\nTwo of the crown prince’s closest advisors are accused of orchestrating the murder of journalist Jamal Khashoggi. “How could you not know [about the murder]?” Norah O’Donnell asks MBS https://t.co/A3GvK7eCCm pic.twitter.com/KpypiDFV4M — 60 Minutes (@60Minutes) September 30, 2019\n\nThough U.S. intelligence officials have stood by their assertion that the crown prince was responsible for Khashoggi’s killing, President Donald Trump has rebuffed their conclusions and has repeatedly expressed his support of the crown prince.\n\n“He’s the leader of Saudi Arabia. They’ve been a very good ally,” Trump said in December.\n\n“I really hope that people aren’t going to suggest that we should not take hundreds of billions of dollars that they’re going to siphon off to Russia and to China,” the president added, referring to lucrative arms deals between the U.S. and Saudi Arabia.\n\nThe Washington Post reported on Sunday that Trump helped rehabilitate Prince Mohammad’s image on the global stage following the Khashoggi killing.\n\n“U.S. and Saudi officials have been playing the same game of hoping the controversy over Jamal’s murder will die with time or be overtaken by other more immediate events,” David Ottaway, a Persian Gulf expert, told the paper.", "description": "\"This was a heinous crime,\" bin Salman told \"60 Minutes\" in a new interview. \"But I take full responsibility as a leader in Saudi Arabia.\"", "authors": ["Senior Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d917d7a2100005b00fdf3bd.jpeg?cache=qpnbbrnrrn&ops=1778_1000", "published_at": "2019-09-30"}