{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/09/candidates-know-anything-immigration-policy", "downloaded_at": "2019-09-15 15:13:27.697473+00:00", "published_at": "2019-09-15", "title": "Do the candidates know anything about immigration policy?", "language": "en", "text": "Unfortunately for Yang’s narrative, legal immigration is at the level it was under the Obama-Biden administration. The number of people granted lawful permanent residence (green cards), which is what we mean by “legal immigration,” averaged 1.06 million from Fiscal Year 2009 to 2016. The total for FY 2017 was 1.13 million, for 2018 was 1.1 million, and annualizing from the first quarter of FY 2019 yields a projected total of 1.03 million. Fluctuation within 100,000 is common (in 2013, the total was only 990,000), so the level is essentially unchanged. It could be that the green-card total will decline next year, because of the smaller number of refugees converting to green cards and, possibly, the new public charge rule leading to a reduction in the number of parents of adult U.S. citizens, but neither of these things has happened yet.\n\nIn fact, like Senator Warren, President Trump has repeatedly called for increased immigration. It’s been reported that the long-promised White House immigration bill will not increase green cards, but it nonetheless is likely to increase overall admissions. The proposal eliminates a variety of immigration categories (the chain migration categories and the visa lottery) and reallocates those numbers to the new merit-based system, thus supposedly leaving the overall level unchanged. But if the current measure bears any resemblance to the RAISE Act or the Goodlatte bill, both of which the White House supported, one of the “eliminated” green card categories, that for parents of adult U.S. citizens, would simply be converted to an indefinitely renewable “temporary” visa, meaning that the number of foreign-born moving here to live would go up – a lot (the number of elderly parents getting green cards has averaged 150,000 a year over the past four years).", "description": "", "authors": ["Mark Krikorian", "Nationalreview.Com Corner Do-The-Candidates-Know-Anything-About-Immigration-Policy"], "top_image": ""}