{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7545273/Urgent-recall-thousands-dangerous-Samsung-loading-washing-machines.html", "downloaded_at": "2019-10-07 09:12:52.111919+00:00", "title": "Urgent recall on thousands of 'dangerous' Samsung top-loading washing machines", "language": "en", "text": "Samsung washing machines have been urgently recalled after a model caught fire in Perth.\n\nFirefighters were called to put out the blaze in Armadale on October 1, when a machine went up in flames due to a manufacturing issue.\n\nThe machines have a fault where condensation is able to reach an electrical connector which has the potential to catch alight.\n\nNo one was injured in the Armadale fire, with more than 6,600 of the affected washing machines still in use in homes in Western Australia alone.\n\nSamsung washing machines have been recalled after a model caught fire (pictured) in a house in Perth\n\nMore than 6,600 of the effected washing machines (pictured) still in use in homes in Western Australia alone\n\nThe affected machines were all made between 2010 and 2013 and include model numbers: SW75V9WIP; SW65V9WIP; SW70SPWIP; SW80SPWIP; WA85GWGIP and WA85FWWIP.\n\nOwners being urged to check the model of their machine as the effected machines should not be used.\n\nCommissioner for Consumer Protection Penny Lipscombe said customers should seek a refund from their retailer.\n\n'As this is regarded as a major fault, repair is not an option so consumers should get their money back and arrange to have the recalled washing machines collected by the supplier who will dispose of them,' Ms Lipscombe said.\n\n'The machines should not be re-sold or placed on the verge for bulk rubbish collection, as we want to remove any possibility that they are purchased or picked up by people who may not realise that they are dangerous.'", "description": "Firefighters were called to put out the blaze in Armadale, Perth on October 1, when a machine went up in flames due to a manufacturing issue.", "authors": ["Jackson Barron For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/08/19383216-0-image-a-2_1570432068520.jpg", "published_at": "2019-10-07"}