{"pub": "yahoo", "url": "https://finance.yahoo.com/news/fortinet-ftnt-report-q3-earnings-133101664.html", "downloaded_at": "2019-10-29 15:12:27.727916+00:00", "title": "Fortinet (FTNT) to Report Q3 Earnings: What Lies Ahead?", "language": "en", "text": "Fortinet, Inc. FTNT is set to report third-quarter 2019 results on Oct 31.\n\n\n\nFor the quarter, the company expects revenues of $525-$540 million. The Zacks Consensus Estimate is pegged at $532.96 million, indicating a 17.4% rise from the prior-year reported figure.\n\n\n\nNon-GAAP earnings per share are anticipated in the band of 55-57 cents by Fortinet. The consensus estimate for earnings stands at 56 cents per share, suggesting 27.3% growth from the year-ago reported number.\n\n\n\nThe company’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average positive surprise being 14.38%.\n\n\n\nIn the last reported quarter, Fortinet’s non-GAAP earnings came in at 58 cents per share, which surpassed the Zacks Consensus Estimate of 50 cents, and also grew 41.5% year over year.\n\n\n\nThe company generated revenues of $521.7 million, up 18% from the year-earlier quarter. It also outpaced the consensus estimate of $511 million, driven by new business wins.\n\nFortinet, Inc. Price and EPS Surprise\n\nFortinet, Inc. Price and EPS Surprise More\n\nFortinet, Inc. price-eps-surprise | Fortinet, Inc. Quote\n\nFactors at Play\n\n\n\nFortinet’s third-quarter performance is expected to have benefited from strong momentum in FortiGate virtual machines, which is driving its private and public cloud billings. The shift in revenue mix to the midrange FortiGates is expected to have been a tailwind for Product revenues in the to-be-reported quarter.\n\n\n\nFortinet’s FortiGate with SSL encryption performance is helping the company grow both on the cloud side and on the edge side. This offering is likely to have been a tailwind in the third quarter.\n\n\n\nThe company might have continued to benefit from its IoT offering with Forti- ASIC SPU technology, which provides a cost and performance advantage over its competitors.\n\n\n\nFortinet expects around 60% of revenues from its existing deferred revenue balance, which was $1.9 billion at the end of the last reported quarter.\n\n\n\nHealthy growth in deal pipeline is expected to have benefited Fortinet’s third-quarter performance.\n\n\n\nFortinet is also expected to have gained from its constant efforts to drive enterprise growth. Moreover, its partnership with the likes of Symantec SYMC and VMWare VMW is helping it secure large enterprise sales, and is expected to be reflected in its third-quarter results.\n\n\n\nHowever, capital expenditures between $40 million and $50 million, including construction spending, are expected to have weighed on margins in the third quarter.\n\n\n\nMoreover, competition from Palo Alto PANW is likely to have posed a key threat.\n\n\n\nFortinet currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\n\n\nLooking for Stocks with Skyrocketing Upside?\n\n\n\nZacks has just released a Special Report on the booming investment opportunities of legal marijuana.\n\n\n\nIgnited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.\n\n\n\nSee the pot trades we're targeting>>\n\n\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n\n\nFortinet, Inc. (FTNT) : Free Stock Analysis Report\n\n\n\nPalo Alto Networks, Inc. (PANW) : Free Stock Analysis Report\n\n\n\nVMware, Inc. (VMW) : Free Stock Analysis Report\n\n\n\nSymantec Corporation (SYMC) : Free Stock Analysis Report\n\n\n\nTo read this article on Zacks.com click here.\n\n\n\nZacks Investment Research", "description": "Fortinet's (FTNT) Q3 results are likely to reflect benefits from its strong product portfolio and deal wins. High capital expenditures are likely to have kept margins under pressure.", "authors": ["Zacks Equity Research"], "top_image": "https://s.yimg.com/uu/api/res/1.2/45jeGiBma7S_3fB1R.4xBA--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/4f433153f8078d93a99e518e55cf12ce", "published_at": "2019-10-28"}