{"pub": "breitbart", "url": "https://breitbart.com/news/new-yorks-museum-of-modern-art-set-to-reopen-bigger-and-better", "downloaded_at": "2019-10-12 00:32:41.563962+00:00", "title": "New York’s Museum of Modern Art set to reopen, bigger and better", "language": "en", "text": "New York (AFP) – New York’s heralded Museum of Modern Art reopens this month after a multi-million-dollar makeover that will allow curators to display hundreds more works every year.\n\nThe museum has been closed for four months but will open again on October 21 following the latest renovations which increase the venerated institution’s capacity.\n\nMoMA, which moved to its current location in 1939, has undergone remodeling in 1950, 1962, 1980 and 2001 to cope with a growing collection and increased footfall.\n\nSpace was expanded by a third this time and director Glenn Lowry says the layout has been reinvented to reflect the philosophy of the museum’s first director, Alfred Barr.\n\n“Barr imagined it as a laboratory to which the public was invited. The public would participate in the experiment of looking at and thinking about modern art,” Lowry said.\n\n“He understood that the museum was to be a work in progress, changing and evolving as modern and contemporary art changes and evolves,” Lowry told reporters at a preview.\n\nThe museum took advantage of a real estate project by selling some land to a developer to build a luxury tower, in which MoMA would make use of the first three floors.\n\nBy also making some tweaks to its existing buildings, MoMA has increased its capacity to 165,000 square feet (15,329 square meters).\n\nThe upgrade, which cost $450 million, means the museum will be able to exhibit around 2,400 works a year, compared to an average of 1,500 previously, Lowry said.\n\nThe most radical change is that for the first time artworks will be presented by theme rather than by time period. The works will also have the benefit of more natural light.\n\n“What makes modern and contemporary art exciting is precisely the debates and arguments that are still taking place,” said Lowry.\n\n“(We want to) make the public aware the questions are more interesting than the answers,” he added.\n\nThemes and artwork will change every six months or so but the major pieces, such as Claude Monet’s “Water Lilies” and Pablo Picasso’s “The Ladies of Avignon” will always be on show.\n\n“For people who come and want to see the icons, they’ll be there,” said Lowry.", "description": "New York (AFP) – New York’s heralded Museum of Modern Art reopens this month after a multi-million-dollar makeover that will allow curators to", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/11/bf3785_new-york-museum-modern-art-reopens-on-21-its-latest-expansion-new-york-museum-640x335.jpg", "published_at": "2019-10-11"}