{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/15/turkey-footballers-defy-uefa-again-by-celebrating-with-military-salute", "downloaded_at": "2019-10-15 11:22:12.989798+00:00", "title": "Turkey footballers defy Uefa again by celebrating with military salute", "language": "en", "text": "Turkey’s players defied Uefa with another military salute in their 1-1 draw with France during a European Championship qualifier on Monday.\n\nUefa was already looking into Turkish players’ salutes during and after Friday’s 1-0 win over Albania. The European football federation prohibits political statements in stadiums.\n\nBut Turkish players lined up again to show a military salute after Kaan Ayhan’s late equaliser in Paris. Captain Burak Yilmaz was joined by goalkeeper Mert Günok and several other outfield players in giving the salute toward the crowd in an apparent support of the Turkish forces involved in the country’s incursion into Kurdish-held regions in northern Syria.\n\nDefender Merih Demiral urged Ayhan to salute, too, leading to what looked like a heated discussion between the pair, but the goalscorer desisted and made his way back to the pitch.\n\nFacebook Twitter Pinterest Turkish football fans in Paris respond to the players with their own military salutes. Photograph: Aurélien Meunier/Getty Images\n\nAyhan and Turkey striker Kenan Karaman both play for German side Fortuna Düsseldorf, which had issued a statement after Friday’s game to distance itself from “politically motivated acts”. Düsseldorf sporting director Lutz Pfannenstiel said: “Both players stand for values that the club lives by.”\n\nThe Everton striker Cenk Tosun was another player who used the military salute on Friday against Albania and, after the game, he posted on Instagram an image of himself and the message: “For our nation, especially for the ones who are risking their lives for our nation.” The Leicester City defender Caglar Soyuncu, who played for Turkey in both games, showed his support for Tosun’s message, replying with heart emojis and the Turkish flag.\n\nQuick guide What is happening in north-eastern Syria? Show Hide Who is in control in north-eastern Syria? Until Turkey launched its offensive there on 9 October, the region was controlled by the Syrian Democratic Forces (SDF), which comprises militia groups representing a range of ethnicities, though its backbone is Kurdish. Since the Turkish incursion, the SDF has lost much of its territory and appears to be losing its grip on key cities. On 13 October, Kurdish leaders agreed to allow Syrian regime forces to enter some cities to protect them from being captured by Turkey and its allies. The deal effectively hands over control of huge swathes of the region to Damascus. That leaves north-eastern Syria divided between Syrian regime forces, Syrian opposition militia and their Turkish allies, and areas still held by the SDF – for now. How did the SDF come to control the region? Before the SDF was formed in 2015, the Kurds had created their own militias who mobilised during the Syrian civil war to defend Kurdish cities and villages and carve out what they hoped would eventually at least become a semi-autonomous province. In late 2014, the Kurds were struggling to fend off an Islamic State siege of Kobani, a major city under their control. With US support, including arms and airstrikes, the Kurds managed to beat back Isis and went on to win a string of victories against the radical militant group. Along the way the fighters absorbed non-Kurdish groups, changed their name to the SDF and grew to include 60,000 soldiers. Why does Turkey oppose the Kurds? For years, Turkey has watched the growing ties between the US and SDF with alarm. Significant numbers of the Kurds in the SDF were also members of the People’s Protection Units (YPG), an offshoot of the Kurdistan Workers’ party (PKK) that has fought an insurgency against the Turkish state for more than 35 years in which as many as 40,000 people have died. The PKK initially called for independence and now demands greater autonomy for Kurds inside Turkey. Turkey claims the PKK has continued to wage war on the Turkish state, even as it has assisted in the fight against Isis. The PKK is listed as a terrorist group by Turkey, the US, the UK, Nato and others and this has proved awkward for the US and its allies, who have chosen to downplay the SDF’s links to the PKK, preferring to focus on their shared objective of defeating Isis.\n\nWhat are Turkey’s objectives on its southern border? Turkey aims firstly to push the SDF away from its border, creating a 20-mile (32km) buffer zone that would have been jointly patrolled by Turkish and US troops until Trump’s recent announcement that American soldiers would withdraw from the region. Erdoğan has also said he would seek to relocate more than 1 million Syrian refugees in this “safe zone”, both removing them from his country (where their presence has started to create a backlash) and complicating the demographic mix in what he fears could become an autonomous Kurdish state on his border. How would a Turkish incursion impact on Isis? Nearly 11,000 Isis fighters, including almost 2,000 foreigners, and tens of thousands of their wives and children, are being held in detention camps and hastily fortified prisons across north-eastern Syria. SDF leaders have warned they cannot guarantee the security of these prisoners if they are forced to redeploy their forces to the frontlines of a war against Turkey. They also fear Isis could use the chaos of war to mount attacks to free their fighters or reclaim territory.\n\nOn 11 October, it was reported that at least five detained Isis fighters had escaped a prison in the region. Two days later, 750 foreign women affiliated to Isis and their children managed to break out of a secure annex in the Ain Issa camp for displaced people, according to SDF officials. It is unclear which detention sites the SDF still controls and the status of the prisoners inside. Michael Safi\n\nThis post was also ‘liked’ by Germany internationals Ilkay Gündogan and Emre Can, who both have Turkish heritage, causing German Football Association director Oliver Bierhoff to say the pair had “made a mistake” on the social media site. Gündogan and Can would later remove their likes, with the pair releasing statements after Germany’s Euro 2020 qualifying win over Estonia on Sunday. “I am absolutely a pacifist and against all forms of war,” said Can, while Gündogan added: “I can only stress again that there was no political intention behind it. I wanted to congratulate a friend [Tosun] for the goal and the victory.”\n\nGerman club St Pauli took more drastic action by releasing one of their players, Cenk Sahin, after the midfielder posted his own message of support for the Turkish military.\n\n“We’re on the side of our heroic military and armies. Our prayers are with you!” Sahin posted on Instagram, prompting St Pauli to release the following statement: “Sahin has been released from his training and playing duties with immediate effect. The prime factors in reaching the decisions were his repeated disregard for the club’s values and the need to protect the player.”", "description": "Turkey’s players defied Uefa with another military salute in their 1-1 draw with France during Monday’s European Championship qualifier", "authors": ["Associated Press"], "top_image": "https://i.guim.co.uk/img/media/286fb7c88bb393749043e23d37e745dd5b5078da/115_472_3939_2364/master/3939.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8dcffdd8a2f0fbd48a23283c8f88115a", "published_at": "2019-10-15"}