{"pub": "afr", "url": "https://afr.com/politics/federal/scott-morrison-orders-ministers-to-visit-drought-affected-communities-20191001-p52wkg", "downloaded_at": "2019-10-05 05:44:01.940697+00:00", "title": "Scott Morrison orders ministers to visit drought affected communities", "language": "en", "text": "\"Obviously being in charge of the budget, it's important the Treasurer gets out, as a key government figure, in order to get a better understanding of the intricate nature our response needs to bring to the drought,\" he told The Australian Financial Review.\n\n\"We've had two years of falling output from the agricultural sector and that's predicated on drought but let me make this clear: the story of agriculture and rural and regional Australia is still a strong one. The story is 'just add rain'.\n\n\"When it does rain, we're going to make a hell of a lot of money and we're going to make a big contribution to the economy. That's why it's important that the Treasurer sees it firsthand and there is an understanding that when it does rain out there we will get back up on our feet.\"\n\nMr Littleproud called on business leaders to do the right thing for the agriculture sector and communities doing it tough.\n\n\"It's important we all play our part. We've seen an increase in food prices and the RBA Governor pointed that out in his speech in Armidale last week, so it's important that farmers get their fair share.\n\n\"They're not asking for charity, they're just asking for the market to be fair and equitable.\"\n\nLabor's agriculture spokesman Joel Fitzgibbon on Tuesday asked the Auditor-General to investigate the Coalition's drought programs, including the veracity of a $7 billion pricetag for “drought support funding”.\n\nHe called for the design, implementation, value and effectiveness of all drought programs and the criteria used for drought funding to be reviewed.\n\nAdvertisement\n\n\"Rural Australians and more particularly farmers will be tiring of drought tours by ministers in the Morrison government,\" Mr Fitzgibbon said.\n\n\"What they are desperately asking for is some action after six years of relative inaction. We still lack an overarching, strategic national drought plan and I think it's time for Scott Morrison to show some contrition, accept that the government has played it badly. It's reasonable for farmers to hope it's not too late for the government to recognise their approach is not helping.\"\n\nMr Fitzgibbon said the government's decision not to release the report of drought coordinator-general Stephen Day made Labor suspicious the review had been critical of the government's approach.\n\nHe called for assistance payments to be extended beyond the current cut-off.\n\n\"The big test on the farm household allowance was to declare they will stop taking farmers who have been on it for four years off that income support payment and they refuse to make that announcement,\" he said.", "description": "Treasurer Josh Frydenberg and Drought Minister David Littleproud start a three-day drought tour of Queensland and northern NSW on Wednesday, set to visit towns including Inverell, Warwick and Stanthorpe.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1751%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/efc7e485bdcd02d2efb15d864b00e67d8a798b7c", "published_at": "2019-10-01"}