{"pub": "foxnews", "url": "https://foxnews.com/travel/disneyland-guest-sues-3-million-space-mountain-concussion", "downloaded_at": "2019-09-06 12:15:11.066192+00:00", "title": "Disneyland guest sues for $3 million after 'violently' striking her head exiting ride", "language": "en", "text": "A woman from Alaska is suing Walt Disney Co., claiming she suffered a serious head injury while exiting Space Mountain at Disneyland in California.\n\nThe woman apparently struck her head while exiting the ride, which had pulled into a maintenance tunnel because of a malfunction. She’s reportedly seeking $3 million in California federal court.\n\nSarah Andrews claims that the incident occurred in Dec. 2017 after the roller coaster malfunctioned and the car was pulled into a dimly lit maintenance tunnel, the Orange County Register reports.. She claims that an attendant told riders to watch their step but failed to warn her about the low ceilings.\n\nAndrews reportedly “violently struck” her head against the concrete ceiling, leaving her feeling dazed and disoriented. She allegedly remained in severe pain even after she left the park.\n\nCONSTRUCTION WORKER AT DISNEYLAND DIES AFTER BEING HIT BY METAL PANEL: REPORT\n\nShe eventually went to a nearby emergency room where she was allegedly diagnosed with a concussion. According to her lawsuit, she was later diagnosed with “traumatic brain injury” and “permanent impairment requiring extensive continuing treatment.”\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\nAndrews and her husband are reportedly seeking $3 million to cover medical expenses and for lost earning capacity. The Orange County Register reports the pair are being represented by the Choate Law Firm of Juneau, Alaska.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nFox News reached out to Disneyland and the Choate Law Firm, but neither immediately responded.", "description": "A woman from Alaska claims that she suffered serious injuries after striking her head against the ceiling after exiting the Space Mountain ride.", "authors": ["Michael Hollan"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Space-Mountain-Disneyland.jpg", "published_at": "2019-09-05"}