{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7604995/Byzantine-church-glorious-martyr-uncovered-Israel.html", "downloaded_at": "2019-10-23 17:21:21.073142+00:00", "title": "Byzantine church of 'glorious martyr' uncovered in Israel", "language": "en", "text": "Archaeologists have revealed the incredibly well-preserved relics of a sixth century church in Israel.\n\nExcavations in the city of Beit Shemesh, to the west of Jerusalem, have turned up a church dedicated to a 'glorious martyr'.\n\nComplete with a crypt, elaborate mosaics and a large collection of lamps, the artefacts have been pictured by the Israel Antiquities Authority.\n\nArchaeologists began working on the church in earnest in 2017, discovering the church dates back to the Byzantine Empire and has a footprint covering about a third of an acre.\n\nIt is thought to have been used by pilgrims travelling through the holy region until it was abandoned in the seventh century.\n\nThe elaborate mosaics in the church depict themes from nature such as leaves, birds and fruit and have been cleared by archaeologists to reveal exquisite detail\n\nThe church and monastery were uncovered at a site in the city of Beit Shemesh, Israel, around 18 miles (30 kilometres) west of Jerusalem\n\nThe mosaics in the church depict themes from nature, such as leaves, birds and fruit, as well as geometrical elements, according to the Israel Antiquities Authority, which carried out the excavation.\n\nMost of the construction of the church began during the reign of Emperor Justinian, who ruled between 527-565, with a chapel added later under Emperor Tiberius II Constantine, with rare financial support from him, the IAA said in a statement.\n\nAn underground burial chamber with two separate staircases leading to and from it was found.\n\nThe discovery of this chamber makes the church one of the few with fully intact crypts to be found in Israel's limits.\n\nThe church is one of the few with fully intact crypts to be found in Israel's limits\n\nMost of the construction of the church began during the reign of Emperor Justinian, who ruled between 527-565, the archaeologists said\n\nAn underground burial chamber with two separate staircases leading to and from it was found\n\nResearchers said the 'exceptional opulence' of the church (pictured is one of its mosaics) suggested it had been dedicated to someone very important, although they don't know who\n\nWHAT DO ARCHAEOLOGISTS KNOW ABOUT THE CHURCH? Excavations at the church began in earnest in 2017, and since then archaeologists have found elaborate mosaics, carved marble walls, lamps, pottery and metal objects. They say the 'opulence' of the church indicates that it was dedicated to a very important person – a martyr – although who that might have been, they don't know. According to leader of the excavations, Benyamin Storchan, the site was likely used by pilgrims passing through the Judean Shephelah. The Shephelah, meaning 'lowlands' in Hebrew, is a transitional region of hills in south-central Israel that stretches six to nine miles (10-15 km) between the Judean Mountains and the Coastal Plain. It is believed to have been abandoned at some time in the seventh century, and was discovered in the Israeli city of Beit Shemesh whle preparations were being made to build a new neighbourhood.\n\nThe church was dedicated to a 'glorious martyr,' whose identity has remained unknown to the researchers working on the find for the past three years.\n\nBut the 'exceptional opulence of the structure and its inscriptions indicate that this person was an important figure,' said the excavation director, Benyamin Storchan.\n\nDiggers also found what they believe to be 'the most complete collection of Byzantine glass windows and lamps ever found at a single site in Israel.'\n\nThe Bible Lands Museum in Jerusalem, which is hosting a display of some of the finds, said that lighting in churches, often perceived as 'the representation of the divine,' enhanced the 'dramatic environment for a powerful religious experiment.'\n\nWith its location near Jerusalem, the Church of the Glorious Martyr was most likely a significant pilgrimage site for Christians en route to the Holy City, the museum said.\n\nAccording to Mr Storchan, the site was likely used by pilgrims passing through the Judean Shephelah.\n\nThe Shephelah, meaning 'lowlands' in Hebrew, is a transitional region of hills in south-central Israel that stretches six to nine miles (10-15 km) between the Judean Mountains and the Coastal Plain.\n\nMr Storchan said in 2017: 'We were surprised by the wonderful state of preservation of the ancient remains, and the richness of the finds being uncovered.\n\nPictured is an oil lamp unearthed during excavations in 2017\n\nThe Israel Antiquities Authority (IAA) is conducting large-scale excavations at the city of Beit Shemesh. Pictured in 2017 are marble (centre left), glass (centre right) and pottery (far left) fragments found during excavations, as well as a number of pieces of metal (right)\n\nA number of well-preserved architectural elements were found in 2017, including a marble pillar base decorated with crosses (pictured centre), and marble window screens\n\n'The artefacts found in the large building, which seems to be a monastic compound, may indicate that the site was important and perhaps a centre for ancient pilgrims in the Judean Shephelah region.'\n\nExcavations conducted by the team uncovered the remains of walls built using large worked stone masonry.\n\nA number of well-preserved architectural structures were found, including a marble pillar base decorated with crosses, and marble window screens.\n\nThe marble artefacts were mined from a region in what is now Turkey and carried further inland by wagon, Mr Storchan said.", "description": "The complex, which spans over a third of an acre, was found during salvage excavations ahead of the construction of a new neighbourhood for the city Beit Shemesh, west of Jerusalem.", "authors": ["Sam Blanchard For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/14/wire-20083892-1571836080-832_636x382.jpg", "published_at": "2019-10-23"}