{"pub": "independent", "url": "https://independent.co.uk/life-style/food-and-drink/casual-dining-crunch-restaurants-close-job-loss-cuts-a9106721.html", "downloaded_at": "2019-09-16 12:00:26.689630+00:00", "title": "More than 1,400 UK restaurants close in a year amid 'casual dining crunch'", "language": "en", "text": "More than 1,400 restaurants in the UK have closed in the last year, new research has claimed.\n\nA new report published by accountancy group UHY Hacker Young has found that there were more than 1,400 insolvencies in the restaurant sector from June 2018 until June 2019.\n\nAccording to the research, several factors may be to blame, including the over-saturation of the casual dining market, reduction in consumer spending and increasing costs.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n\"The crisis in the restaurant sector has been presented as a problem only for the chains that had lost touch with their customers,\" said Peter Kubik, of UHY Hacker Young.\n\n\"That's overlooking the hundreds of small independent restaurants that have become insolvent.\"\n\nKubik said that a \"loyal following\" doesn't necessarily guarantee prosperity for any eatery.\n\n\"Good restaurants and bad have all struggled from over-capacity, weak consumer spending and surging costs,\" the accountancy firm partner said.\n\n\"Having a loyal following is great but if that loyal following stops going out then you have a problem.\"\n\nOver the past couple of years, the restaurant sector has been hit hard by an increasing number of closures.\n\nA study published in October 2017 found that 20 per cent of UK restaurants were at risk of going bust, while the collapse of Jamie Oliver's restaurant chain earlier this year resulted in the loss of around 1,000 jobs.\n\nLast month, Oliver told BBC Radio 4's Food Programme how the impending downfall of his restaurant group negatively impacted his 40th birthday celebrations four years ago.\n\n\"My 40th birthday was ruined because of the cloud of, 'All right what's happening here?',\" the chef said.\n\n\"In a way there was a massive sense of relief because I gave it my best. I thought I was clever enough and big enough to fix it.\"", "description": "More than 1,400 restaurants in the UK have closed in the last year, new research has claimed. A new report published by accountancy group UHY Hacker Young has found that there were more than 1,400 insolvencies in the restaurant sector from June 2018 until June 2019. According to the research, several factors may be to blame, including the over-saturation of the casual dining", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/16/09/jamie-oliver.jpg", "published_at": "2019-09-16"}