{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7548751/Dancing-Stars-Hannah-Brown-unleashes-Hannah-Beast-paso-doble-Alan-Bersten.html", "downloaded_at": "2019-10-08 09:38:59.903691+00:00", "title": "Dancing With The Stars: Hannah Brown unleashes 'Hannah Beast' during paso doble with Alan Bersten", "language": "en", "text": "Hannah Brown unleashed her inner 'Hannah Beast' on Monday's episode of Dancing With The Stars during a focused, passionate paso doble with partner Alan Bersten.\n\nThe 25-yer-old reality star, was still smarting from comments made by judge Carrie Ann Inaba, 51, last week, when she said Hannah's rumba 'looked more like a cheerleading dance.'\n\n'Carrie Ann's comments were hurtful, but there was some truth to it,' admitted Hannah, the former Miss Alabama USA 2018.\n\nBeast mode: Hannah Brown unleashed her 'Hannah Beast' during a passionate paso doble with Alan Bersten on Monday's episode of Dancing With The Stars\n\n'In the pageant world, I was taught to put on this plastic smile. Even when times are tough, I've learned to hide behind a smile,' Hannah said.\n\nAlan, 25, banned smiling during their rehearsals, trying to get her to cultivate the angry, commanding vibe the paso doble required.\n\nHe even took Hannah to a 'rage room' to smash objects with a baseball bat, which drew out her fury and sharpened it into a fine point.\n\n'Call me a cheerleader?' Hannah yelled, smashing wine bottles. 'Paso doble this!'\n\nNo smiling: Alan implemented a no smiling rule for their paso doble dance\n\nHurtful comments: Hannah was hurt by judge Carrie Ann-Inaba last week saying her rumba with Alan 'looked more like a cheerleading dance'\n\nRage room: The Bachelorette star smashed objects in a 'rage room' to draw out her fury\n\nShe whacked a few more, saying: 'These are all my ex-boyfriends!'\n\n'In this dance, Hannah Beast is gonna come out,' she added.\n\nHannah had given herself the nickname during a jungle competition on season 23 of The Bachelor, saying: 'The most ferocious animal in the jungle is Hannah Beast,' and roaring.\n\nComing out: Hannah before her dance said 'Hannah Beast' was going to come out\n\nWearing her 'Beast' necklace, she and Alan performed a masterful, determined paso doble to Icona Pop's I Love It, which proved a hit with the judges.\n\n'The sexy beast is out of the cage and is irresistible!' judge Bruno Tonioli, 63, screamed, praising her lines, shape, intention and choreography. 'It was drop-dead gorgeous.'\n\n'The comments are never intended to be hurtful,' Carrie Ann added. 'My comments are intended to help you get better. And I think my comments worked.'\n\nPassionate dance: The judges praised Hannah and Alan for their paso doble\n\nThey did as Hannah and Alan earned 32 points, entering a four-way tie for the lead spot.\n\nPop star Ally Brooke, 26, country singer Lauren Alaina, 24, and Kel Mitchell, 41, also earned 32 points with their dances on Monday, while former NBA star Lamar Odom came in at 20.\n\nJames Van Der Beek, who scored 28 points, broke some big personal news on the show, announcing that he and wife Kimberly would be having their sixth child.\n\nComments worked: Carrie Ann noted that her comments to Hannah weren't meant to be hurtful and they worked\n\nTop spot: Hannah and Alan earned 32 points and ended in a four-way tie for the lead spot\n\nAs viewers watched, Kimberly underwent an ultrasound at her doctor's office, learning she was pregnant and hearing the baby's heartbeat for the first time.\n\n'Hearing the heartbeat was something you never take for granted,' said James, 42, who stood by Kimberly's side with three of their kids throughout the procedure.\n\nJames and Kimberly are already parents to Olivia, 9, Joshua, 7, Annabel, 5, Emilia, 3, and Gwendolyn, 15 months.\n\nNew addition: James Van Der Beek broke some big personal news on the show announcing that he and wife Kimberly would be having their sixth child\n\nUltrasound session: Kimberly underwent an ultrasound at her doctor's office, learning she was pregnant and hearing the baby's heartbeat for the first time\n\nThe couple last week said they were open to having more children.\n\n'We've had five kids,' James told his partner, Emma Slater, 30, who was thrilled for him.\n\nHe also shared that he and his wife had gone through three miscarriages.\n\nBig news: Emma Slater was told about the pregnancy news by her celebrity partner James\n\n'Miscarriage is something that people really don't talk about, and we wanted to recognize that it happens,' he said. 'We wanted to destigmatize that as much as we possibly could.'\n\nEmma told him their dance would be appropriate for his mood, saying it was the 'very joyous quickstep,' and the song was Katrina and the Waves' Walking On Sunshine.\n\n'And you are!' she thrilled. 'Six babies, James. Is that because she saw you rumba?'\n\nAppropriate dance: After hearing about the pregnancy, Emma told James their dance would be appropriate for his mood, saying it was the 'very joyous quickstep'\n\nJames, 42, had dedicated his rumba last week to Kimberly, and the judges liked it, though Len Goodman, 75, complained that it 'was a little on the passionate side' for him.\n\nBut James wasn't bothered by that, saying that if he wanted to evoke passion for anyone, it was Kimberly.\n\nHis smooth quickstep Monday was fun to watch, and Len called him 'a terrific dancer,' but the judges agreed that both he and Emma were more detached and imprecise than usual.\n\nFun dance: James and Emma performed a fun quickstep routine\n\n'You've been solid the whole show,' countered guest judge, actress Leah Remini, 49. 'I love watching you, and you've been amazing from day one.'\n\nLeah proved to be a feisty judge, testing her mettle when it came to scoring the first dancer of the evening, former White House press secretary Sean Spicer, 48.\n\nSpicer called on the rigorousness of his military training to perform the paso doble to the Gipsy Kings' Bamboleo, directed by his partner, Lindsay Arnold, 25.\n\nGuest judge: Leah Remini served as guest judge as was more lenient than the other judges\n\n'She's tough,' Sean admitted. 'She reminds me of the Gunny the first week I was in the Navy.'\n\nThe judges praised Sean's commitment, if not his dance moves.\n\n'It was the paso doble from Pasadena,' joked Len. 'Technically, it wasn't great, but what I liked? You attacked the dance. You weren't scared to get out there and give it your all.'\n\nMilitary background: Sean Spicer leaned on his military background for his paso doble\n\n'It's not as militant as you were performing it,' noted Carrie Ann Inaba, 51. 'You could have a little more breath, and passion, and humanity…'\n\n'Carrie Ann, if you're not a dancer, you don't know the difference,' Leah interjected.\n\n'Are you fighting with me already?' Carrie Ann asked sharply, laughing.\n\nFight time: Carrie Ann and Leah argued over scoring for the celebrities\n\nSean told co-host Erin Andrews, 41, that the dance taxed his body.\n\nAlly, who hit the top of the leaderboard with Sasha Farber last week, was up next, doing a jive to Creedence Clearwater Revival's Proud Mary.\n\nTo boost her stamina, her partner, 35, enrolled her in 'Sasha's Boot Camp,' taking her to a park to run and do kicks, which gave her performance an intense energy.\n\nStrong effort: Sean was praised for his effort with pro partner Lindsay Arnold\n\n'Totally in command of the stage,' Bruno raved. 'You were an accessory, [Sasha]—she could have done it on her own.'\n\nKel and Witney Carson, 25, who'd been in the bottom two last week, followed her, doing a cha-cha to Shawn Mendes' If I Can't Have You.\n\nTo get her partner in a 'happy' mood for the dance, Witney invited his wife and three kids to rehearsal, where they all talked about what a great father and dancer he was.\n\nGetting ready: Ally Brooke trained with pro partner Sasha Farber for their jive dance\n\nJive dance: Sasha and Ally did a jive to Creedence Clearwater Revival's Proud Mary\n\nIn command: The judges praised Ally for her command of the stage\n\n'I got so much energy now—I'm ready for this cha-cha,' Kel said, performing a fast-paced, fun and seamless routine.\n\nHis family and the cast of his TV show All That, which ran from 1994 to 2005, watched it live.\n\nCarrie Ann praised his suave flair, saying: 'That is what I have been waiting to see from you!'\n\nSurprise visit: Witney Carson invited Kel Mitchell;'s wife and three kids to rehearsal\n\nSuave flair: Kel was praised for his 'suave flair' during their cha-cha routine\n\nPeta Murgatroyd, 33, also flew in two of her partner Lamar's children—Destiny, 21, and Lamar, Jr., 17—to surprise him during rehearsals.\n\nShe hoped it would get Lamar, 39, in the right mood for their dance, as he'd been depressed by his low scores and memory issues that had plagued him since a drug overdose in 2015.\n\nAll of the judges were moved by his Viennese waltz to Seal's Kissed By A Rose, with Carrie Ann commending him for the courage he'd shown by returning despite his setbacks.\n\nShowing support: Peta Murgatroyd, 33, also flew in two of her partner Lamar Odom's children—Destiny, 21, and Lamar, Jr., 17—to surprise him during rehearsals\n\n'What I saw in this dance was true vulnerability,' she said. 'You really touched my heart.'\n\nWhen she gave Lamar a five, Leah offered him a seven to even the score, then screamed when Len and Bruno gave him fours, calling it 'unacceptable.'\n\nActress Kate Flannery felt giddy performing the tango with partner Pasha Pashkov, 34.\n\nViennese waltz: All of the judges were moved by Lamar and Peta's Viennese waltz to Seal's Kissed By A Rose\n\n'I can't believe at 55 I get to dance with a hot Russian,' observed Kate, who noted that she'd also gotten her role on The Office and met her boyfriend later in life.\n\nShe felt good about the high scores she'd been receiving over the past few weeks.\n\n'The old broad is kicking the butts of the 20- and 30-year-olds,' she marveled.\n\nRaised expectations: Kate Flannery felt giddy performing the tango with partner Pasha Pashkov, 34, after getting high scores in recent weeks\n\nUnfortunately, expectations for her performance were high, and the judges noticed that the comedic actress struggled to portray passion.\n\nDuring the routine, performed to Selena Gomez's Hands To Myself, she was 'holding onto Pasha like a cougar holds onto its prey,' Bruno teased, noting she 'lost balance quite a few times.'\n\nSailor Brinkley-Cook, 21, and Valentin Chmerkovskiy, 33, did better, scoring 31 points with their cha-cha to Marvin Gaye and Tammi Terrell's Ain't No Mountain High Enough.\n\nPassion problem: The judges noticed that the comedic actress struggled to portray passion\n\nSailor's friend Rumer Willis, 31, who won the show in 2015 with Val, stopped by rehearsals.\n\nRumer and Sailor grew up together, often going on vacations together with their famous parents, Christie Brinkley, 63, and Bruce Willis, 64, and Demi Moore, 56.\n\nLen called Sailor's dance 'another terrific performance,' saying, 'you've really got yourself on a roll.'\n\nPast champion:R umer Willis, 31, who won the show in 2015 with Val Chmerkovskiy, stopped by rehearsals to visit friend Sailor Brinkley-Cook\n\nFamous families: Sailor explained that she and Rumer grew up together\n\nNice score: Sailor and Val scored 31 points for their cha-cha to Marvin Gaye and Tammi Terrell's Ain't No Mountain High Enough\n\n'Your light is shining brighter every week,' Bruno affirmed. 'It's like seeing a new girl with every dance that you do.'\n\nLauren and Gleb Savchenko, 36, did a foxtrot to Jolene by Dolly Parton, whom Lauren said had influenced her career 'more than any other artist.'\n\nTo give Gleb some insight into the song's origins, she took him to her Nashville hometown, where she sang at Tootsie's and ran into season 27 champion Bobby Bones, 39.\n\nCountry star: Lauren Alaina and Gleb Savchenko did a foxtrot to Jolene by Dolly Parton\n\nThe judges called her foxtrot 'accomplished,' 'elegant,' and 'classy,' with Carrie Ann saying: 'You have arrived. This dance was your dance.'\n\nAfter she performed, Lauren told the crowd that her cousin Holly had experienced a brain bleed earlier that week and she dedicated the dance to her, 'praying for a full recovery.'\n\nQueer Eye star Karamo Brown, 38, and Jenna Johnson, 25, were last to perform, doing a tango to Lil Nas X's Old Town Road.\n\nLast up: Queer Eye star Karamo Brown, 38, and Jenna Johnson, 25, were last to perform, doing a tango to Lil Nas X's Old Town Road\n\nKaramo would 'have to take charge' during the sexy dance, Jenna revealed—so she took him to a farm to find his inner cowboy.\n\n'I am a city boy all the way,' he said, cringing at the thought of pigs and horses.\n\nBut riding horses might have done the trick, as he put in an impressive performance and raised his previously low scores.\n\nInner cowboy: Karamo put in an impressive performance and raised his previously low scores\n\n'You really turned on that kind of leading-man attitude,' Bruno said. 'There were no mistakes tonight.'\n\nLen gently picked him apart, which made Leah apoplectic, and she told him to say something nice.\n\n'Note to the affiliates: This is going to turn into a slugfest any minute,' said co-host Tom Bergeron, 64.\n\nBe nice: Leah urged the judges to be nicer with their critiques and scoring\n\nWhen it came time to give the scores, Len at first showed a five, but had a seven hidden behind it, which made Leah scream, slug him, then hug him.\n\nKaramo and Jenna ended up in the bottom, but the judges voted to save them and Lamar was sent home.\n\nDancing With The Stars will return next week on ABC.\n\nTender moment: Len Goodman got a kiss on the cheek from Leah after raising his score for Karamo\n\nBottom two: Lamar and Karamo ended up in the bottom two", "description": "The  25-yer-old reality star unleashed her inner 'Hannah Beast' on Monday's episode of Dancing With The Stars during a focused, passionate paso doble with partner Alan Bersten.", "authors": ["Dailymail.Com Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/05/19427094-0-image-a-25_1570509651269.jpg", "published_at": "2019-10-08"}