{"pub": "businessinsider", "url": "https://businessinsider.com/early-stage-founders-how-to-hire-first-startup-employees", "downloaded_at": "2019-09-13 00:57:31.933555+00:00", "title": "You started a company — now what? A startup founder's guide to hiring your first employees.", "language": "en", "text": "Hiring people to join your company is a great sign — it means you're growing and ready to accomplish big things.\n\nBut how do you figure out the right roles to fill? Business Insider spoke with six startup founders to understand how they built their teams from scratch.\n\nTheir advice is to find people who are highly adaptable and don't share the same skill sets or perspectives as you.\n\nThey also recommend tapping into your network to find great hires because chances are those individuals trust your vision and work ethic.\n\nClick here for more BI Prime stories.\n\nHiring the first employees to join your startup is an exciting step that indicates your business is growing. But knowing which roles to fill first and where to find the right people can be daunting, as these decisions have the power to propel your company forward — or cripple it.\n\nIn addition to the cost and outlay of time it takes to locate and attract the right employees, there's also an emotional component to consider. As Anna Fader, founder of Mommy Poppins, a leading online resource for family travel and local activities, pointed out, after doing everything yourself, it's hard to relinquish some of the responsibilities.\n\n\"It can feel as emotional as handing your child over to a stranger,\" she told Business Insider.\n\nAs difficult as it may be, making the right first hires is critical to building a strong foundation for success by filling in skill gaps. Onboarding employees frees up founders to delegate so they can focus their attention where it's most advantageous — ultimately, advancing the company to the next level.\n\nWe asked startup founders to share their strategies for making solid first hires.\n\nAddress your most pressing needs first\n\nKarthik Sridharan is the cofounder and CEO of Kinnek, a software company founded in 2012 that connects small- and mid-sized businesses with reputable suppliers, and received $3 million in seed funding after graduating from the AngelPad accelerator program. He explained that he and his cofounder Rui Ma decided to begin expanding their team based on what was most urgent to get done.\n\nPhilip Lang. Courtesy of Philip Lang\n\n\"We based that decision on our most pressing need as a company, which was to expand our product's capabilities and features as quickly as possible,\" Sridharan said. \"Our first three hires were all technical. We hired three people who had engineering/development backgrounds, but who were also proven problem-solvers who had incredible critical-thinking ability and would be able to help us iterate on our product quickly as we learned more about what our users wanted.\"\n\nFor Philip Lang, the cofounder and CEO of Triplemint, a New York City-based, software-powered real estate brokerage founded in 2013, making a tech hire was also a top priority.\n\n\"Our first hire was a CTO,\" Lang told Business Insider. \"As a technology-based company, it was important to start with a technical hire to build the foundation of our company. After that, we hired salespeople to start to generate revenue.\"\n\nOther times, knowing where to begin can be as simple as considering the structure of your business.\n\n\"We knew our core product was content, so hiring an editor-in-chief was the first priority,\" said Michael Rothman, the cofounder and CEO of Fatherly, a leading digital media brand for dads which launched in April 2015 and currently has over 3 million Facebook followers. \"Second priority involved finding the most relevant and widest possible distribution for that content, which meant hiring an audience development resource. Following that, we needed to monetize our audience and our content so we looked to hire a sales lead.\"\n\nHire to fill your skill gap — not to mirror your own talents\n\nSmart entrepreneurs learn to \"hire their weakness\" first, said Fader, who launched her site in 2007. Mommy Poppins, which now attracts over one and a half million users each month and reaches over 10 million people on social media annually, has grown to 20 full-time employees.\n\n\"It takes a certain amount of self-confidence and honesty to identify your flaws, but it can make or break your company,\" she noted. \"When I decided to see if Mommy Poppins would be more than just a hobby, I spent one day making calls to see if I could sell ads for a camp guide that didn't exist, on a site nobody had heard of. I was able to connect with six camps and sold six $250 ads, but the next day I placed ads for salespeople. One of the three people that started with me from that ad is still with me 11 years later.\"\n\nSimilarly, Joanne Domeniconi, cofounder and chief discovery officer of The Grommet, an online marketplace and product discovery platform that launched in 2008, said she and her cofounder Jules Pieri prioritized hiring talent that filled gaps in their own experience.\n\nJoanne Domeniconi. Courtesy of Joanne Domeniconi\n\n\"In our case, that was web design and development, videography, legal, and accounting,\" she said. \"As cofounders, we wore every hat that we could to save resources for hiring talent to do the things we couldn't.\"\n\nSome founders are tempted to hire their mirror image. But instead, Sridharan, who currently has 30 people working full-time in Kinnek's Manhattan office, suggested hiring employees who have complementary skill sets to those of the company's founders.\n\n\"Don't double-down on skill sets and perspectives that are extremely similar to your own,\" he said. \"You need a diversity of thought and a variety of creative minds to solve difficult problems. As a founder, this helps you reduce the company's exposure to your own idiosyncratic weaknesses.\"\n\nLook for 'intellectual athletes' who are adaptable\n\nFor many founders, it isn't always clear where they could benefit most as there are often competing needs in the areas of marketing, engineering, product, and sales.\n\nEntrepreneurs who find themselves facing this challenge should \"hire all-rounders, intellectual athletes who can adapt to different roles and are quick learners,\" said Sridharan.\n\n\"That is what is often needed by early-stage companies for their first several employees: people who can iterate quickly, adapt to changing contexts, and are comfortable with many degrees of freedom,\" he added.\n\nAnna Fader. Courtesy of Anna Fader\n\nLang, who closed a $4.5 million Series A funding round in 2017, said that six years after launching, his company still has a few people who've stuck with them since the beginning, which he attributes to one key trait.\n\n\"The common thread in all of these hires is adaptability,\" he noted. \"It's often said that startups turn over their employee base several times during their lifetime because the people needed to start a company are very different from the people you need when you get to the next stage, and so on. A few members of our team have proven to be highly adaptable and have grown with the company; their roles have changed over the years, but their attitude towards change has remained the same, so they have proven invaluable.\"\n\nHow do you know if a potential candidate embodies that sought-after flexibility? Lang recommended looking at potential hires' resumes to see how they have adapted in previous roles and if they have changed roles or responsibilities within a company.\n\n\"One of the best questions for this is asking a candidate what they were hired to do, and then asking them what they actually did as a follow-up,\" he said.\n\nSridharan said he likes to ask prospective employees: \"Tell me about a recent project or initiative where you had the most all-encompassing impact on all aspects of the project.\"\n\n\"Here, we're looking for situations where the candidate has had to think about several cross-functional aspects — from planning to marketing, from design to execution, from technical aspects of a project to business aspects,\" he explained. \"We want to see evidence of the candidate being hungry to think about all angles, and move out of their comfort zone.\"\n\nSridharan added that he looks for candidates who are leaving their current roles primarily because they want to have more of an impact on the trajectory of the company they work for.\n\n\"It gives us confidence that the candidate will be successful at Kinnek because they are specifically seeking an experience outside of rigid structure and hierarchy,\" he noted.\n\nFind people who believe in the 'big picture'\n\nLarry Kim, founder and CEO of MobileMonkey, a Facebook Messenger marketing platform launched in 2017 and used by over a billion people every day, currently staffs 30 full-time employees. He told Business Insider that, when you're an entrepreneur, the most important thing you can do when building a team is to find people who believe in the vision.\n\n\"I have three unicorn growth marketing principles for growing a business. Number one is be somewhat delusional. This extends to the entire team. Unless you believe in the big picture, you won't be able to persevere through the challenges of creating a unicorn business,\" said Kim, whose first company, Wordstream, was acquired by Gannett for $150 million in 2018.\n\nLarry Kim. Courtesy of Larry Kim\n\nRothman agreed that founders need employees who believe in the shared mission and are \"passionate about the brand to their core.\"\n\n\"There are several people who not only drank the Kool-Aid, they became the Kool-Aid,\" he said about his staff. \"They've become integral parts of the company culture and a through-line to the best parts of the company's legacy.\"\n\nIn addition to believing in the vision, you've got to hire people who have \"the audacity and passion\" to help build it, despite the fact that the odds are against success, said Domeniconi.\n\n\"Candidates who do not exhibit an entrepreneurial mindset tend to have a harder time navigating the uncertainty and constant change in a startup,\" she said. \"Non-believers, especially influential ones in a new business, can kill it.\"\n\nRemember that past experience isn't always an indicator of future success\n\nIt seems reasonable to assume someone who's previously been adept in the role you're looking to fill will be a great hire. But when it comes to the startup environment, all bets are off.\n\nMichael Rothman. Courtesy of Michael Rothman\n\n\"When you're just getting started, it can be tempting to hire the person who you think has done it before,\" said Lang. \"I've found that just because someone has worked for a competitor or has been in a similar position in the past doesn't mean that they're the right fit for your company. The skill set that it takes to build a role or department can be very different from the skills that it takes to manage one that already exists, so it's important to be clear about the requirements for this position.\"\n\nRothman added the best way to mitigate risk is to hire proven assets who understand the stage of the business that you're in and the attendant lifestyle implications.\n\n\"If you're starting a company, you're not going to be working nine to five, so if you worked with someone amazing when you were both at a company with 1,000 people, their amazingness may not translate to a highly demanding environment with five people,\" he noted.\n\nSo you know what you need — how do you find people?\n\nOnce you've determined which role you'd like to fill, how do you go about finding the right person for the job?\n\nThe old saying \"It's who you know,\" holds true, according to Kim.\n\n\"Most success usually comes from tapping into your current network,\" he said. \"MobileMonkey's COO and CTO both worked with me at WordStream.\"\n\nSridharan added that finding the right people when you're a small startup during its nascent stages can be extremely difficult.\n\nKarthik Sridharan. Courtesy of Karthik Sridharan\n\n\"During our first year of operation, my cofounder and I did not have an HR professional on the team to help with recruiting,\" he said. \"We did not have a famous employer brand that would attract incoming applications from candidates. And we had never hired anyone before. So we relied on the candidate pool we knew best — our own personal and professional networks.\"\n\nKinnek's first 10 hires consisted of people Sridharan and Ma went to college with or previously had worked with.\n\n\"This was helpful because during that early stage, there is a lot of inherent risk in the company, and we had very few proof points and very little traction,\" Sridharan said. \"We needed to hire people who had some prior reason to trust us and knew we were competent operators.\"\n\nRather than hire full-time employees initially, Domeniconi explained that they used contract talent — another route you can take if you're low on budget or haven't fully defined your needs.\n\n\"Starting with contractors helps to avoid beginner mistakes and helps you hire better later,\" she added. \"Ultimately, many of our contractors joined us as employees.\"\n\nElizabeth Alterman is a freelance writer with more than 20 years of experience in digital and print media. Her writing has appeared in The New York Times, The Washington Post, Realtor.com, and more.", "description": "The founders of Mommy Poppins, Fatherly, and more explain how they grew their teams and hired the right people for their roles.", "authors": ["Elizabeth Alterman"], "top_image": "https://image.businessinsider.com/5d7a5ab52e22af158f16a7d5?width=1200&format=jpeg", "published_at": "2019-09-12"}