{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/23/WS5daf9388a310cf3e35571fb8.html", "downloaded_at": "2019-10-23 08:36:35.831931+00:00", "title": "Getting in the swing of things", "language": "en", "text": "By Xing Wen | China Daily | Updated: 2019-10-23 07:40\n\nInternational swing dancers are invited to perform at the annual Swingtime Ball in Beijing, which also conducts workshops and master classes for local dancers. [Photo provided to China Daily]\n\nA century-old jazz-dance genre and subculture from the United States has continued to grow in popularity in China over the past decade, Xing Wen reports.\n\nThe heat didn't stop the swing. Indeed, the 30 C temperatures at dusk in the small town outside of Bangkok didn't slow down the hundreds of swing dancers, including a group of around 40 people from Beijing.\n\nThey still grooved to live brass performances on a street illuminated with strand lights near a Buddhist stupa.\n\nThis sweaty scene took place at a weekend camp for swing-dance enthusiasts from around the world.\n\nAttendees participated in workshops during the day and enjoyed outdoor dancing at night.\n\nThey were totally immersed in the subculture that developed with the jazz-dance genre that evolved in the United States in the 1920s.\n\n\"The evening glow in the warm night sky fell over the bustling street and sacred stupa,\" recalls Beijinger Shi Danqing, who started learning swing dance two years ago.\n\n\"People from different countries danced to the same rhythm. It created a fusion of diversity and harmony. I could feel a strong connection among us.\n\n\"It was the most romantic moment I've ever experienced.\"\n\nShi hopes to relive some of that magic during Beijing's Swingtime Ball on Nov 7.\n\nIt claims to be the Chinese mainland's largest swing event. About 600 fans of the genre from home and abroad will enjoy a series of activities, including workshops and competitions.", "description": "A century-old jazz-dance genre and subculture from the United States has continued to grow in popularity in China over the past decade, Xing Wen reports.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/23/5daf9ca3a310cf3e97a2836e.jpeg", "published_at": "2019-10-23"}