{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-politics-49628465", "downloaded_at": "2019-09-09 06:53:11.032021+00:00", "title": "Brexit's big week: Five things that happened this weekend", "language": "en", "text": "It was a week that began with Parliament defeating the prime minister as part of MPs' attempt to block a no-deal Brexit.\n\nThen came a proposal - so far rejected - for an early election, Tory sackings and court battles over the PM's decision to suspend Parliament from next week until mid-October.\n\nThings didn't get much quieter over the weekend.\n\n1) Rudd goes out with a bang\n\nImage copyright Reuters\n\nBoris Johnson had to deal with a cabinet resignation late on Saturday when Amber Rudd announced she was quitting as work and pensions secretary.\n\nIn an explosive resignation letter, she said she no longer felt securing a deal with the EU was the government's \"main objective\", and accused Mr Johnson of \"political vandalism\" for sacking the 21 Tory MPs who rebelled in a bid to stop a no-deal Brexit.\n\nShe continued her attack on Sunday, telling the BBC that she felt 80-90% of government time was being spent preparing for a no-deal Brexit, with \"very little evidence\" that a new agreement was being sought.\n\nWhen she asked No 10 for details of its efforts to strike a new deal, she said, she had only received a \"one-page summary\" in return.\n\nShe will continue as an MP - but will no longer sit as part of the Conservative party in Parliament having resigned the whip, adding her name to a growing list of Tory rebels on the backbenches.\n\n2) Tories target John Bercow\n\nImage copyright UK Parliament/Jessica Taylor\n\nIf there's one thing the past three years has taught us, it's never to trust that long-held parliamentary conventions won't be allowed to fall by the wayside in the struggle to win the Brexit debate.\n\nAnother might soon be broken, after Business Secretary Andrea Leadsom said the Conservatives would defy usual practice and stand a candidate against Speaker John Bercow at the next election.\n\nMr Bercow initially represented his Buckingham seat as a Tory MP, before giving up his party affiliation in 2009 when he took up the role of presiding over MPs' debates.\n\nUsually incumbent speakers standing in elections are unopposed by the main parties, and do not campaign on political issues.\n\nMs Leadsom said Mr Bercow had failed in his duty to be an \"independent umpire of proceedings\" when he allowed opposition MPs and Tory rebels to introduce the bill to delay Brexit, using a parliamentary rule normally only used for urgent debates.\n\nWriting in the Mail on Sunday, she said Mr Bercow \"hasn't just bent the rules, he has broken them\", adding that a general election this autumn would bring an opportunity to \"give us back an impartial Speaker\".\n\n3) Does a legal showdown await?\n\nImage copyright Reuters\n\nSenior ministers have suggested the government could attempt to circumvent the cross-party bill which would force the PM to request another Brexit delay if MPs haven't approved either a new deal or no-deal by 19 October.\n\nThe legislation is expected to gain royal assent on Monday, and Boris Johnson has been warned he could face legal action if he chooses to flout it.\n\nForeign Secretary Dominic Raab said the government would abide by the law, but would \"test to the limit what it actually lawfully requires\".\n\nSpeaking to Sky News, he insisted testing the law's limits was \"the responsible thing to do\" and accused Labour leader Jeremy Corbyn of dragging the country \"into the quicksand\" by backing the legislation.\n\nChancellor Sajid Javid insisted the PM \"absolutely will not\" ask the EU for an extension, adding: \"We will leave on 31 October.\"\n\n\"You will have to wait and see what happens because there is a lot of days between now and 19 October,\" he told the BBC.\n\n4) Election pact proposal\n\nImage copyright Getty Images\n\nWith all the talk of a possible autumn election, another strand to the Brexit story is what might happen to Nigel Farage's Brexit Party, which gained MEP seats in May's European elections, but doesn't have a single seat in the Commons.\n\nThe Sunday Telegraph reported further details of Mr Farage's offer to help the Conservatives in an election if the party decides to embrace a no-deal exit from the EU as its preferred outcome.\n\nAccording to the paper, Mr Farage wants to see Tory candidates stand aside in Labour-supporting areas in the North, South Wales and the Midlands to give his party a chance to pick up votes from Brexit-supporting voters.\n\nIn return, the Brexit Party would campaign for pro-Leave Tory candidates in other seats and agree not to contest them.\n\nAsked about the possibility of an electoral alliance with the former UKIP leader, Chancellor Sajid Javid did not categorically rule out the idea, but said the Conservatives \"don't need an electoral alliance with anyone\".\n\n5) But we didn't find out...\n\nImage copyright Getty Images Image caption How to maintain an open border on the island of Ireland has been a sticking point in Brexit talks\n\n...the government's detailed proposals for replacing the contentious backstop plan.\n\nThe backstop - the insurance policy to avoid a hard border on the island of Ireland - remains a major stumbling block in getting a Brexit deal through Parliament.\n\nOver the summer, Boris Johnson said he accepted the onus was on the UK to come up with alternatives to the existing plan.\n\nMr Javid said the the government has \"many new ideas\" for how the backstop can be replaced but said it would be \"madness\" to talk openly about what ministers have in mind.\n\n\"Anyone who understands how negotiation works, [knows] you would not discuss those in public,\" he added.", "description": "Here's what you need to know as a tumultuous week for Boris Johnson's government draws to a close.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/9A5C/production/_108661593_ruddleavingreuters.jpg", "published_at": "2019-09-08"}