{"pub": "guardian", "url": "https://theguardian.com/technology/2019/oct/16/digital-welfare-state-big-tech-allowed-to-target-and-surveil-the-poor-un-warns", "downloaded_at": "2019-10-16 08:29:37.795398+00:00", "title": "‘Digital welfare state’: Big Tech allowed to target and surveil the poor, UN warns", "language": "en", "text": "UN’s rapporteur on extreme poverty says in devastating account Big Tech companies are being allowed to go unregulated in ‘human right free-zones’ and not held accountable\n\nNations around the world are “stumbling zombie-like into a digital welfare dystopia” in which artificial intelligence and other technologies are used to target, surveil and punish the poorest people, the United Nation’s monitor on poverty has warned.\n\nPhilip Alston, UN rapporteur on extreme poverty, has produced a devastating account of how new digital technologies are revolutionizing the interaction between governments and the most vulnerable in society. In what he calls the rise of the “digital welfare state”, billions of dollars of public money is now being invested in automated systems that are radically changing the nature of social protection.\n\nAlston’s report on the human rights implications of the shift will be presented to the UN general assembly on Friday. It says that AI has the potential to improve dramatically the lives of disadvantaged communities, but warns that such hope is being lost amid the constant drive for cost cutting and “efficiency”.\n\nBig Tech companies are being allowed to go unregulated in “human rights free-zones”, welfare budgets are being decimated and new penalties are being imposed for non-compliance on people who may be digitally illiterate or lack access to the internet. In the UK, he notes, 12 million people, or one in five of the population, do not have essential digital skills needed for modern day-to-day life.\n\nAlston writes that “crucial decisions to go digital have been taken by government ministers without consultation, or even by departmental officials without any significant policy discussions taking place”. As a result of the absence of accountability, “digital technologies are employed in the welfare state to surveil, target, harass and punish beneficiaries, especially the poorest and most vulnerable among them”.\n\nA New York-based lawyer, Alston has become a piercing critic of inequality and disdain for basic human rights. In June 2018 he caused major ructions with the Trump administration by reporting that it was cruelly forcing millions of people into deprivation with its tax cuts for the rich. He went on to anger the British government with his damning report on austerity in the UK.\n\nNow he is likely to displease several governments who will find his report uncomfortable reading. He says that the normal state of affairs whereby governments are accountable to their citizens has been turned upside down by the introduction of automated decision-making and the removal of human discretion from welfare systems.\n\n“In such a world, citizens become ever more visible to their governments, but not the other way around.”\n\nAlston’s report also tears a strip out of Big Tech companies who he says are acting as forces unto themselves. The advent of the digital revolution has allowed the private sector to appropriate huge swathes of welfare state almost without public comment.\n\nHe points to examples from around the globe: Net 1’s subsidiary Cash Paymaster Services together with MasterCard were initially involved in South Africa’s social grant distribution system which raised privacy concerns because of its biometric data collection. In Australia, Indue and Visa helped introduce cashless debit card trials, and IBM was central to the multi-million dollar SAMS system in Canada, the US, Germany and New Zealand.\n\nIn many of these schemes, the role and responsibility of these corporations are opaque, rendering public accountability impossible. “A handful of powerful executives are replacing governments and legislators in determining the directions in which societies will move and the values and assumptions which will drive those developments,” Alston writes.\n\nLooking to the future, the UN monitor calls for Silicon Valley to be made accountable through regulation. The self-regulation that has been permitted in the Big Tech sector, uniquely so among major sectors of the economy, must end and technology companies must “legally be required to respect applicable human rights standards”.\n\nThat includes addressing the increasing use of data matching that is used to punish and criminalize low-income people. It also involves bringing under control the “evermore refined surveillance options that enable around-the-clock monitoring of beneficiaries”.\n\nThe UN report was drawn from Alston’s country visits to the UK, US and elsewhere as well as 60 submissions from 34 countries. He concludes on a rallying note, saying it is not too late to drop the obsession with fraud and the “undeserving poor”.\n\nInstead of inflicting misery on millions, digital technology could be used as a force for good. It could “ensure a higher standard of living for the vulnerable and disadvantaged, devise new ways of caring for those left behind. That would be the real digital welfare state revolution.”", "description": "UN’s rapporteur on extreme poverty says in devastating account Big Tech companies are being allowed to go unregulated in ‘human rights free-zones’", "authors": ["Ed Pilkington"], "top_image": "https://i.guim.co.uk/img/media/3032459f79ab9563f7fc0d815b08d4c024fd672d/0_120_5100_3061/master/5100.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ea3cebd3a69004ea2b7b0574cd5ff8b4", "published_at": "2019-10-16"}