{"pub": "cbc", "url": "https://cbc.ca/radio/checkup/conservatives-will-focus-on-key-domestic-priorities-with-cuts-to-foreign-aid-says-o-toole-1.5320219", "downloaded_at": "2019-10-15 14:59:50.948927+00:00", "title": "CBC Radio", "language": "en", "text": "Conservative Party candidate Erin O'Toole says his party's pledge to cut foreign aid spending will better help Canadians at home.\n\n\"We are going to draw back on the total budget by about 25 per cent and refocus on some priorities in Canada right now,\" he told Cross Country Checkup host Duncan McCue on Sunday.\n\n\"We've heard loud and clear from families struggling with disabilities at home, seniors, a whole range of things that we want to focus on at home.\"\n\nO'Toole, who was the opposition shadow minister for Foreign Affairs, took calls from listeners during the show's recurring Ask Me Anything segment.\n\nDuring the 30-minute call-in, McCue pressed O'Toole on how a Conservative government would cut $1.5 billion in foreign aid, which the party promised in their platform released Friday.\n\nWATCH: Erin O'Toole and Liberal Party candidate Patty Hajdu take listeners' calls on Cross Country Checkup\n\nO'Toole says that the party is focused on doing \"foreign development aid a little bit smarter.\" That includes a cut to Canada's foreign aid budget and reallocating international aid based on a country's ranking on the United Nations Human Development Index.\n\n\"At the end of the, day governing is about choices and Andrew Scheer has indicated that we want to focus on a few key domestic priorities in the short term while also doing a whole range of things internationally,\" O'Toole said.\n\nThat means countries high on the HDI, such as Brazil, Argentina and Italy, would no longer receive funding, he says.\n\nRelations with China\n\nCalling from Ottawa, Matthew Phillips asked O'Toole how the Conservatives would handle Canada's relationship with China after the arrest of Huawei CFO Meng Wanzhou.\n\nO'Toole called the situation \"the most significant diplomatic dispute that we have,\" and pointed fingers at the Liberals for not doing enough when China fought back, placing restrictions on Canadian canola imports.\n\n\"The fact that the Trudeau government didn't bring a [World Trade Organization] challenge when China stopped receiving shipments of our canola, for example, was not the right course of action,\" he said. \"We should use the trade remedies that are there.\"\n\nO'Toole says that Liberal Leader Justin Trudeau should have addressed China directly following the arrest of Meng Wanzhou. (Darryl Dyck/Canadian Press)\n\nHe added that the Trudeau government showed disrespect by not speaking directly with Chinese officials in the days following Wanzhou's arrest.\n\nA Conservative government, he says, will do a \"reset\" on relations.\n\n\"What we need to do is ... make sure that China knows that dealing with Canada will be a peer-to-peer relationship and that we will push back when needed,\" he said.\n\nDeclaring Jerusalem as capital of Israel\n\nThe Conservative Party pledged in their platform to recognize Jerusalem as the capital of Israel and committed to moving Canada's embassy to that city.\n\nThe move comes after President Donald Trump controversially relocated the United States' embassy to Jerusalem from Tel Aviv last year.\n\nAsked why it was part of the Conservative's platform, O'Toole said that Israel should have the right to determine its own capital.\n\n\"The Knesset, which I've visited, is in Jerusalem, as is their foreign affairs, their Supreme Court [and] a number of the institutions of state,\" he said.\n\nConservative leader Andrew Scheer addresses the media following the unveiling of his parties platform Friday, Oct. 11, 2019. Checkup requested Scheer take part in an Ask Me Anything segment. (Jonathan Hayward/Canadian Press)\n\nO'Toole adds that declaring Israel's capital to be Jerusalem is key to a two-state solution, which would see independent states of Israel and Palestine.\n\n\"Recognizing that [Jerusalem as capital] now, which we will do, is not in any way going to hold back a two-state solution,\" O'Toole said.\n\nCross Country Checkup requested the leaders of the Liberal, Conservative, Green and New Democratic parties take part in an Ask Me Anything session. Read and listen to our previous AMA segments with federal election candidates:\n\nWritten by Jason Vermes. Produced by Richard Raycraft. To hear the full Ask Me Anything segment with Conservative Party candidate Erin O'Toole, download our podcast or click Listen above.", "description": "Conservative Party candidate Erin O'Toole took calls from Cross Country Checkup listeners during the show’s recurring Ask Me Anything segment and answered questions on international aid and relations with China and Israel.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.4589360.1521791295!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/question-period-20180302.jpg", "published_at": "2019-10-14"}