{"pub": "yahoo", "url": "https://sports.yahoo.com/referee-patriots-steelers-week-1-185818397.html", "downloaded_at": "2019-09-03 23:44:59.009175+00:00", "title": "Referee for Patriots-Steelers Week 1 game has long history with New England", "language": "en", "published_at": "2019-09-03", "text": "The NFL has made its referee assignment for the Week 1 showdown between the New England Patriots and Pittsburgh Steelers, and Pats fans probably will recognize him.\n\nClete Blakeman and his crew will officiate Sunday night's game at Gillette Stadium. It's his first assignment involving the Patriots since last season's AFC Championship Game against the Kansas City Chiefs.\n\nBlakeman has a long history of working memorable Patriots games this decade. Here's a list of the notable matchups, via The Boston Globe's Ben Volin.\n\nScroll to continue with content Ad\n\nReferee for Patriots-Steelers on Sunday is Clete Blakeman, the Super Bowl 50 ref who has had an interesting history with the Pats pic.twitter.com/S9ER23SFE2 — Ben Volin (@BenVolin) September 3, 2019\n\nBlakeman became a referee in 2010, and the Patriots are 4-5 (including a 2-0 playoff record) in games he's officiated over that span.\n\nClick here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device\n\nReferee for Patriots-Steelers Week 1 game has long history with New England originally appeared on NBC Sports Boston", "description": "The NFL has made its referee assignment for the Week 1 showdown between the New England Patriots and Pittsburgh Steelers on Sunday night, and Pats fans probably will recognize him.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/CNVjQS55FDien624_B5CJQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NjkuMDE4NTY3NjM5MjU3Mw--/https://s.yimg.com/uu/api/res/1.2/NV.Xj_eOVXtAf.jgpbmMdQ--~B/aD00NTM7dz03NTQ7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/csnne.com/0a6f3f7a0a020a56056f4d8fb86c5c41"}