{"pub": "reuters", "url": "https://reuters.com/article/us-usa-stocks/stocks-pause-on-unsettled-trade-deal-earnings-eyed-idUSKBN1WT1IT", "downloaded_at": "2019-10-14 23:32:49.587072+00:00", "title": "Stocks pause on unsettled trade deal; earnings eyed", "language": "en", "text": "NEW YORK (Reuters) - Wall Street edged lower on Monday as uncertainties following recent U.S.-China trade negotiations clouded sentiment and investors turned their focus on the third-quarter earnings season, which begins in earnest on Tuesday.\n\nAll three major U.S. stock averages closed in the red, snapping a three-day winning streak during which the benchmark S&P 500 .SPX gained 2.7%.\n\nHopes dimmed that recent trade negotiations between the United States and China would bear fruit, as China indicated further talks were needed and U.S. Treasury Secretary Steven Mnuchin said the next round of tariffs on Chinese imports are on track to go into effect on Dec. 15 if a deal has not been reached by then.\n\nAnd while U.S. President Donald Trump hailed his phase 1 of the U.S.-China trade deal as “by far, the biggest deal ever made,” no deal was committed to paper and most tariffs on Chinese imports remain in effect.\n\n“There seems to be a softer commitment on the Chinese side than was indicated on Friday,” said Joseph Sroka, chief investment officer at NovaPoint in Atlanta.\n\nThat said, an uneventful day in the markets was to be expected, given the Columbus Day holiday.\n\n“It’s a lighter trading day as the bond market’s closed,” Sroka added. “It’s the calm before the storm of earnings announcements starting on Tuesday.”\n\nThird-quarter reporting season hits the ground running on Tuesday, with major U.S. banks expected to report a 1.2% decline in earnings, their first year-on-year drop in three years, due in part to low interest rates and trade tensions.\n\nJPMorgan Chase & Co (JPM.N), Goldman Sachs Group Inc (GS.N), Citigroup Inc (C.N) and Wells Fargo and Co (WFC.N) are scheduled to post third-quarter results.\n\nOther big names reporting on Tuesday include Johnson & Johnson (JNJ.N) and UnitedHealth Group UHC.N.\n\nAnalysts expect S&P 500 earnings to have contracted in the third quarter by 3.2%, according to Refinitiv data, marking the first decrease since the earnings recession that ended in 2016.\n\nThat is down from the 12.1% gain seen a year ago and the 0.8% advance forecast last quarter.\n\nThe Dow Jones Industrial Average .DJI fell 29.23 points, or 0.11%, to 26,787.36, the S&P 500 .SPX lost 4.09 points, or 0.14%, to 2,966.18 and the Nasdaq Composite .IXIC dropped 8.39 points, or 0.1%, to 8,048.65.\n\nOf the 11 major sectors in the S&P 500, all but real estate .SPLRCR and financials .SPSY lost ground.\n\nHarley-Davidson Inc (HOG.N) said it halted production of its electric bikes after discovering a glitch in final quality checks, and the motorcycle maker’s stock rose 0.3%.\n\nFastenal Co (FAST.O) slid 2.5% after two brokerages downgraded the stock. The company had logged its best day in three decades on Friday after reporting strong results.\n\nNike Inc (NKE.N) advanced 1.1% after Bank of America Merrill Lynch upgraded the sportswear maker’s stock to “neutral” from “underperform.”.\n\nConstruction and engineering company AECOM (ACM.N) gained 6.3% after agreeing to sell its management services unit to private equity firms for about $2.4 billion.\n\nTraders work on the floor at the New York Stock Exchange (NYSE) in New York, U.S., October 9, 2019. REUTERS/Brendan McDermid\n\nDeclining issues outnumbered advancing ones on the NYSE by a 1.32-to-1 ratio; on Nasdaq, a 1.57-to-1 ratio favored decliners.\n\nThe S&P 500 posted 2 new 52-week highs and 3 new lows; the Nasdaq Composite recorded 24 new highs and 123 new lows.\n\nVolume on U.S. exchanges was 4.73 billion shares, compared with the 6.86 billion average over the last 20 trading days.", "description": "Wall Street edged lower on Monday as uncertainties following recent U.S.-China trade negotiations clouded sentiment and investors turned their focus on the third-quarter earnings season, which begins in earnest on Tuesday.", "authors": ["Stephen Culp", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440738875&w=1200&r=LYNXMPEF9D0ZQ", "published_at": "2019-10-14"}