{"pub": "washingtonpost", "url": "https://washingtonpost.com/technology/2019/10/17/facebooks-live-stream-zuckerbergs-free-speech-lecture-got-big-thumbs-up", "downloaded_at": "2019-10-18 01:04:29.802397+00:00", "title": "On Facebook’s live stream, Zuckerberg’s free speech lecture got a big thumbs up", "language": "en", "text": "Facebook does not show all the comments in real time on popular live broadcasts because the volume is too high, said Tucker Bounds, a Facebook spokesperson. To choose what does appear, Facebook relies on a number of “ranking signals” to filter out those that are low-quality. The signals include how much people interact with comments and if something is “engagement-bait,” according to a Facebook post from earlier this year. The system applies to all comments on public pages and posts with large followings. Nothing was unique to Zuckerberg’s speech, Bounds added.\n\nAD\n\nAD\n\nConstant stream of comments on Mark Zuckerberg’s live Facebook / Free Expression talk are, somewhat strangely, almost universally positive. pic.twitter.com/20yICByBbn — Alistair Charlton (@AlistairJ90) October 17, 2019\n\nSome people on Twitter noticed the comments streaming alongside Zuckerberg’s talk were almost universally positive. Viewers left more than 45,000 thoughts on the live stream at the time it ended, and the ones shown during the speech were primarily thanking Zuckerberg and Facebook. However, more negative comments were visible after the talk ended and the option to sort comments by most recent appeared.\n\nSad or angry emoji faces were also rarely shown on Zuckerberg’s public stream, where animated reactions floated by in real time. Thumbs, hearts and laughs appeared. The reason, says Bounds, is that the system shows emoji based on proportion instead of one-for-one — a necessity for a highly watched stream on which more than 80,000 emoji reactions were shared. Angry faces were clicked around 900 times during the broadcast, while the thumbs up was used 77,000 times, according to statistics on the video feed.\n\nDuring the 35-minute talk at Georgetown University, Zuckerberg passionately defended the platform’s approach to free speech, saying “I believe we must continue to stand free expression,” and that the cost of not allowing free speech, in all its messiness, is “too great.”\n\nAD\n\nAD\n\nIt’s not Facebook’s first run-in with confusing moderation. The company has been under fire most recently for its policy of allowing political ads that are misleading or contain lies. It’s also been criticized for helping spread disinformation ahead of elections and allowing hate speech. Facebook has tested out different fixes for its problems, such as using artificial intelligence to identify hate speech, adding fact checks to controversial posts and minimizing how many people see something that’s been identified as untrue.\n\nThe top Facebook comments for Zuckerberg's Georgetown lecture on free expression are entirely positive. He turned off the live stream for the (pre-screened) student question portion. Oh, the irony. pic.twitter.com/ym8IY5PuYX — spooky-li lefcowitz 🎃👻 (@elisponderings) October 17, 2019\n\nThe commenting system is an example of how Facebook uses technology to decrease how many eyeballs see problematic posts while sticking to its free-speech policy. Content is not necessarily removed from the site, unless it’s identified as something that violated Facebook policies, such as a threat of violence or hate speech. In this case, the comments that the automated system identified as being lower quality were simply less visible.\n\nAs for the comments that did surface during the stream, they were mostly grateful for the site and its CEO. “Thank you for Facebook, it is a powerful applications bringing friends and families together,” said Eunice Maku Ayiku-Nartey from Ghana.\n\n“Thanks for creating such an amazing platform that makes it easier and convenient for us to [reach] out to our loved ones and friends without stress,” said Mary Gabby.\n\nAD", "description": "Facebook live stream viewers saw nearly entirely positive comments and emojis during Zuckerberg's speech because of how the algorithms behind a live-stream with tens of thousands of viewers work.", "authors": ["Heather Kelly", "Technology Reporter"], "top_image": "https://www.washingtonpost.com/resizer/S4J1qwN1hwlKsaumfht9KhjTTQ4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GRG2S4XQVBE7TJ7QKOBKTHQ5OU.jpg", "published_at": "2019-10-17"}