{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7537933/Amy-Schumer-shares-snap-sitting-toilet-finding-pregnant.html", "downloaded_at": "2019-10-05 08:50:02.785340+00:00", "title": "Amy Schumer shares snap of herself sitting on the toilet after finding out she was pregnant", "language": "en", "text": "She gave birth to her first child, who is nearly five months, in May.\n\nAnd Amy Schumer has shared a throwback snap of herself sitting on the toilet after finding out she was pregnant with her son Gene.\n\nThe comedian, 38, took to Instagram to post a picture of herself looking shocked on the loo with a pregnancy test stick next to her.\n\nBaby news: Amy Schumer has shared a throwback snap of herself sitting on the toilet at Jess Seinfeld's house after finding out she was pregnant with her son Gene\n\nAmy captioned the post: '#tbt the day I found out I was pregnant in @jessseinfeld bathroom.'\n\nCelebrity facialist, Georgia Louise, commented on the picture with: 'You sent me that photo ❤️ I remember that day ❤️.'\n\nWhile author Jessica Seinfeld, whose bathroom it was where the discovery was made, jokingly posted under the picture: 'And why Gene is actually MY son.'\n\nAmy's post comes after she and Jessica Simpson had some playful banter on each other's Instagrams after welcoming their babies within weeks of one another.\n\nMotherhood: The comedian, 38, took to Instagram to post a picture of herself looking shocked on the loo with a pregnancy test stick next to her (pictured with Gene)\n\nSweet: Celebrity facialist, Georgia Louise, commented on the picture with: 'You sent me that photo ❤️ I remember that day ❤️.'\n\nFunny: While author Jessica Seinfeld, whose bathroom it was where the discovery was made, jokingly posted under the picture: 'And why Gene is actually MY son.'\n\nJessica has boasted of losing 100lbs of pregnancy weight, while Amy has taken things more steadily.\n\nJoking about this fact, the first time mother wrote on Instagram on Monday: 'Ok Simpson! Well ive lost 10 pounds and 100 dollars to my sister playing poker. #norush #givememymoneybackkim.'\n\nThe accompanying picture showed Amy and her writer sister Kim smiling on the beach in their two-piece swimwear.\n\nJessica was quick to respond, with the film star and singer turned fashion designer telling her comedian friend: 'You're hot. Size only matters when it comes to men,' followed by a tongue out emoji.\n\nPostbaby body: Amy, right, with sister Kim, left, recently said she's lost 10lbs instead of Jessica Simpson's 100lbs in a playful Instagram post\n\nIt's not about the number: The two stars engaged in some playful banter after welcoming their babies within weeks of one another\n\nAmy and husband Chris Fischer welcomed their fist child, son Gene Attell, back on May 6, after a difficult pregnancy in which the 38-year-old suffered from 'complications from hyperemesis' right into the third trimester.\n\nMeanwhile Jessica, 39, and husband Eric Johnson welcomed their third child, Birdie Mae, on March 19.\n\nJessica - who has revealed she weighed 240lbs when she welcomed her baby into the world - has been open about her diet changes.\n\nShe recently said: 'It's been a lot of hard work. I have to say that I have worked very hard. Everything that I've been eating is mostly made with cauliflower.'\n\nThe mum-of-three - who also has Ace, six, and Maxwell, seven - admitted she didn't think she'd 'gain as much' as she did during her other two pregnancies.\n\nHowever, she added: 'When you're pregnant, I gain a lot, I mean, a lot. I didn't expect to gain as much with my third. I thought I'd learned my lesson, but apparently that's just the way God made me, very hungry and pregnant.'\n\nThe With You hitmaker previously said she was working 'really hard' on her body by walking lots and eating healthily because she wanted to feel 'good' in her own skin.\n\nShe said at the time: 'I am working really hard right now. It's not easy at all, but I am determined to feel good.\n\n'I have been doing a lot of walking - getting my steps in not only burns calories but it also helps me clear my head and get focused. I am eating healthy too - I discovered I really like cauliflower. Who knew it could be a substitute for almost anything?'", "description": "The comedian, 38, took to Instagram to post a picture of herself looking shocked on the loo with a pregnancy test stick next to her.", "authors": ["Olivia Wheeler For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/14/19297426-0-image-a-90_1570195962617.jpg", "published_at": "2019-10-04"}