{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/millennials-paid-off-student-loans-help-friends-family-2019-10", "downloaded_at": "2019-10-28 23:38:22.999499+00:00", "title": "28% of millennials only paid off their student loans thanks to help from friends and family", "language": "en", "text": "To pay off student-loan debt, some millennials are turning to outside help.\n\nAbout 20% of millennial respondents to a recent survey from Insider and Morning Consult said they've successfully paid off a student loan. Of those respondents, 28% said they've paid off debt with financial help from friends and family.\n\nThe survey polled 2,096 Americans about their financial health, debt, and earnings for a new series, \"The State of Our Money.\" More than 670 respondents were millennials, defined as ages 23 to 38 in 2019.\n\nThey were more likely than other generations in general to say they've received help from family in paying off debt. Given that this survey is self-reported, it's possible that millennials were being more truthful than their elders. However, it's also possible that millennials have needed (and gotten) more help with their massive loan burdens.\n\nThese findings underscore millennials' now-familiar financial picture.\n\nAs of 2019, student-loan debt is at an all-time high with a national total of $1.5 trillion. According to Student Loan Hero, the average student-loan debt per graduating student in 2018 who took out loans was a whopping $29,800.\n\nThe weight of this debt is hindering millennials' ability to save. More than half of indebted millennial respondents in a previous Insider and Morning Consult survey said attending college wasn't worth the student loans.\n\nIt's not surprising, then, that many would take financial assistance from others to get that burden off their plates — especially when they're already used to doing so for other expenses. More than half of Americans (53%) aged 21 to 37 have received financial assistance from a parent, guardian, or family member since turning 21, according to the 2018 Country Financial Security Index.\n\nPaying off student-loan debt is the most significant life milestone millennials think they can achieve, according to a survey by personal finance company SoFi. Thirty-five percent of millennials said so — more than percentage of respondents who thought traditional milestones like buying a home or starting a family were the most important.", "description": "Student-loan debt is a big burden for millennials — the average student-loan debt per graduating student in 2018 who took out loans was $30,000.", "authors": ["Hillary Hoffower"], "top_image": "https://image.businessinsider.com/5db73bf9dee0192bb2350ef4?width=1200&format=jpeg", "published_at": "2019-10-28"}