{"pub": "yahoo", "url": "https://news.yahoo.com/donald-trump-called-her-bad-070009600.html", "downloaded_at": "2019-10-12 00:45:14.775694+00:00", "title": "Donald Trump called her 'bad news.' Now, the ousted Ukraine ambassador is a key impeachment witness", "language": "en", "text": "WASHINGTON – President Donald Trump called her \"bad news.\" And Trump's personal lawyer, Rudy Giuliani, sought her removal as ambassador to Ukraine, suggesting she was undermining the president.\n\nNow, Marie L. Yovanovitch – a career diplomat with decades of overseas experience – is the next witness in the House Democrats' impeachment inquiry. Lawmakers want to question Yovanovitch on what she knew about efforts by Trump and Giuliani to push Ukraine to investigate former Vice President Joe Biden, a leading 2020 Democratic presidential candidate.\n\nHer testimony will be \"very important\" to Democrats' impeachment inquiry of Trump, said Harold Hongju Koh, a professor of international law at Yale University who worked with Yovanovitch at the State Department.\n\nGiuliani has publicly acknowledged that he pressed Ukrainian government officials to open an investigation into Biden and his son, Hunter Biden.\n\n\"He was running a private foreign policy on the behest of Trump,\" which bypassed the U.S. embassy in Kiev and other official government channels, Koh said.\n\nYovanovitch, 60, is one of five State Department officials who Democrats have called to Capitol Hill for depositions as they investigate allegations that Trump used the power of his office to solicit foreign interference in the 2020 presidential election.\n\nOn Thursday, federal prosecutors revealed a plot by two Ukrainian-born business partners to enlist the help of a GOP congressman for the purpose of pressuring the Trump administration to remove Yovanovitch from her post as ambassador to Ukraine.\n\nThe two, Lev Parnas and Igor Fruman, pledged to raise $20,000 for the lawmaker, according to court documents. The congressman was not named in the documents, but a person familiar with the matter identified the lawmaker as former Rep. Pete Sessions, R-Texas.\n\nSessions wrote a letter last year to Secretary of State Mike Pompeo urging Yovanovitch's ouster. The former congressman could not be immediately reached for comment. Yovanovitch was recalled in May.\n\nDeep dive: Trump's conspiracy theories thrive in Ukraine, where a young democracy battles corruption and distrust\n\nParnas and Fruman, who showered Republican campaign committees with nearly $500,000, were charged Thursday in connection with alleged schemes to funnel foreign money to U.S. political campaigns, federal authorities said Thursday.\n\nThe pair also helped Rudy Giuliani meet a Ukrainian prosecutor as the president's personal lawyer pushed for an investigation of Biden. Both of the men are among prospective witnesses House Democrats want to question in their impeachment inquiry.\n\nYovanovitch arrived on Capitol Hill around 10 a.m. Friday for a closed-door session before three House committees – Foreign Affairs, Intelligence, and Oversight and Reform – that are leading the impeachment inquiry.\n\nHere's what you need to know about Yovanovitch, her role in the Ukraine controversy, and Friday's developments on Capitol Hill.\n\nTestifying despite administration concerns\n\nYovanovitch's appearance seems to be in defiance of the White House and Secretary of State Mike Pompeo.\n\nYovanovitch, a State Department employee temporarily serving as a fellow at Georgetown University in Washington, was initially scheduled to be the House Democrats' first witness. But her testimony was delayed – after Pompeo raised questions last week about Democrats' ability to compel State Department officials to appear without a subpoena.\n\nOn Tuesday, the White House broadly condemned the House Democrats' probe as a partisan witch hunt and said it would not cooperate with the inquiry. And the State Department blocked the testimony of Gordon Sondland, the U.S. ambassador to the European Union. House Democrats issued a subpoena to compel Sondland's testimony earlier this week.\n\nDespite those moves, Yovanovitch showed up before the impeachment panel on Friday.\n\nYovanovitch did not return an earlier email seeking comment.\n\nThe State Department has also not returned messages seeking comment.\n\nA Giuliani target: 'Singled out for retribution'?", "description": "In the House impeachment inquiry, three panels are set to hear from former Ukraine ambassador Marie Yovanovitch, who was recalled by President Trump.", "authors": ["Deirdre Shesgreen", "Bart Jansen", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/MM1vYYN0BjLajBC78e9l9A--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/1009217/606eb1f9-044b-4619-9691-747da745c676/8dc35ca1-09a2-52d0-ac7d-45c930ae422f/data_3_0.jpg?s=e08bcdfb748cc25063e1c636989a5b48&c=b7be8f125fa704703cfec11baafa8860&a=tripleplay4us&mr=0", "published_at": "2019-10-11"}