{"pub": "nymag", "url": "https://vulture.com/2019/10/phoebe-waller-bridge-might-make-more-fleabag.html", "downloaded_at": "2019-10-02 15:35:46.071948+00:00", "published_at": "2019-10-02", "title": "Phoebe Waller-Bridge Might Return to Fleabag … When She’s 50", "language": "en", "text": "Ahead of making her Saturday Night Live hosting debut this weekend, Phoebe Waller-Bridge stopped by Late Night on Tuesday and chatted with Seth Meyers about everything from racking up multiple Emmys this year for her hit series Fleabag to the differences between the New York City subway and the London Tube (it mostly has to do with rats vs. mice). But most importantly, Waller-Bridge recaps her incredible night at the Emmys and also offers a drop of hope for Fleabag fans who don’t want the show to be over for good. “I quite like the idea of coming back to her — well, me — when I’m 50, because I feel like she would’ve had, you know, more life then, and God knows what she would’ve gotten up to,” she says. “And actually seeing a character like that in a later stage of life, I think, is exciting. But I think for now, she’s been through enough! We’ve got to let her go!”\n\nMeyers also asks Waller-Bridge about how much she knew about SNL before getting her hosting gig, and she admits that her knowledge of the show was mostly limited to clips of sketches on YouTube. “It was never aired in the U.K., so I didn’t know the madness that it is and how you create it and how it’s written,” she says. “We just thought it was a sketch show that you have time to prepare for. And turns out you don’t, do you?”", "description": "During her appearance on NBC’s ‘Late Night,’ Phoebe Waller-Bridge told host Seth Meyers that she might make more ‘Fleabag’ when she’s 50.", "authors": ["Megh Wright"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/02/02-phoebe-waller-bridge.w1200.h630.jpg"}