{"pub": "reuters", "url": "https://af.reuters.com/article/topNews/idAFKCN1VR1HE-OZATP", "downloaded_at": "2019-09-06 12:25:23.277869+00:00", "title": "Robert Mugabe: death of a liberation \"colossus\" who crushed his foes as Zimbabwe unravelled", "language": "en", "text": "HARARE (Reuters) - Robert Mugabe, the bush war guerrilla who led Zimbabwe to independence in 1980 and crushed his foes during nearly four decades of rule as his country descended into poverty, hyperinflation and unrest, died on Friday. He was 95.\n\nZimbabwe's former president Robert Mugabe looks on during a press conference at his private residence nicknamed \"Blue Roof\" in Harare, Zimbabwe, July 29, 2018. REUTERS/Siphiwe Sibeko\n\nHe was one of the most polarising figures in his continent’s history, a giant of African liberation, whose rule finally ended in ignominy when he was overthrown by his own army. He died in Singapore, where he had long received medical treatment.\n\n“It is with the utmost sadness that I announce the passing on of Zimbabwe’s founding father and former President, Cde (Comrade) Robert Mugabe,” a post on President Emmerson Mnangagwa’s official Twitter account said.\n\nMnangagwa cut short a trip to a World Economic Forum meeting in South Africa to return home, a government official said.\n\nTributes poured in from African leaders. South Africa’s government mourned a “fearless pan-Africanist liberation fighter”. Kenya’s President Uhuru Kenyatta hailed a “man of courage who was never afraid to fight for what he believed in, even when it was not popular”.\n\nAt home, even foes paid respects.\n\n“He was a colossus on the Zimbabwean stage and his enduring positive legacy will be his role in ending white minority rule & expanding a quality education to all Zimbabweans,” tweeted David Coltart, an opposition senator and rights lawyer.\n\nBut others said his legacy was overshadowed by the harm he did to his people.\n\n“We of course express our condolences to those who mourn, but know that for many he was a barrier to a better future,” said a spokeswoman for Boris Johnson, prime minister of Britain, Zimbabwe’s former colonial power.\n\n“Under his rule the people of Zimbabwe suffered greatly as he impoverished their country and sanctioned the use of violence against them.”\n\nOn the streets, the response was mostly more generous.\n\n“He was iconic, he was an African legend. His only mistake was that he overstayed in power. You can’t have somebody that’s 89 and 90 still being the president, you have to give others a chance,” said Harare resident Onwell Samukanya.\n\n“He was a good leader,” said another resident, Sellina Mugadza. “Of course we know that you cannot do good to everyone, but to me he was good.”\n\nCHAMPION OF RECONCILIATION WHO UNLEASHED DEATH SQUADS\n\nMugabe was feted as a champion of racial reconciliation when he first came to power in a nation throwing off white colonial rule. By the time he was toppled, he was viewed by many at home and abroad as a power-obsessed autocrat who unleashed death squads, rigged elections and ruined the economy to keep control.\n\nWhen he was ousted by his own armed forces in November 2017, there were wild celebrations across the country of 13 million.\n\nFor Mugabe, it was an “unconstitutional and humiliating” betrayal by his party and people. Confined to his sprawling “Blue Roof” Harare mansion, he stayed bitter to the end.\n\nMugabe took power in 1980 after seven years of a liberation bush war, with a reputation as “the thinking man’s guerrilla”. He held seven degrees, three earned behind bars as a political prisoner of then-Rhodesia’s white minority rulers. Later, he would boast of another qualification: “a degree in violence”.\n\nJust three years after independence, he sent the army’s North Korean-trained Fifth Brigade into the homeland of the Ndebele people to crush loyalists of his rival, Joshua Nkomo.\n\nOver the next two years, human rights groups estimate as many as 20,000 people died. The purge came to be known in the Shona language as Gukurahundi: “the early rain that washes away the chaff”. The opposition called it genocide.\n\nVictims were executed, forced to dig their own graves or thrown down wells. Rape, torture, mass beatings and wholesale destruction of villages were commonplace, according to “Breaking the Silence”, a 1997 report by the Catholic Commission for Justice and Peace.\n\nThough those killings never raised the international outcry of his later seizure of white-owned farms, they were his rule’s darkest days. Many years later, he acknowledged the episode was “very bad” and blamed it on renegade soldiers. Researchers say the evidence shows he knew what was happening all along.\n\nIn fiery speeches throughout his rule he painted his actions as a just response to a racist colonial legacy that concentrated wealth in white hands. When his followers seized white-owned farms, output cratered and southern Africa’s breadbasket could barely feed itself. He blamed a conspiracy by a hostile West.\n\nAs the economy imploded and his health withered, he trusted fewer people. Foes suspected a plan to pass control to his young wife, who they called “Gucci Grace” for her lavish lifestyle.\n\n“It’s the end of a very painful and sad chapter in the history of a young nation, in which a dictator, as he became old, surrendered his court to a gang of thieves around his wife,” Chris Mutsvangwa, leader of Zimbabwe’s influential liberation war veterans, told Reuters after Mugabe’s removal.\n\nINHERITED A JEWEL\n\nBorn on Feb. 21, 1924, on a Roman Catholic mission near Harare, Mugabe was educated by Jesuit priests and worked as a primary school teacher before going to South Africa’s University of Fort Hare, then a breeding ground for African nationalism.\n\nReturning to then-Rhodesia in 1960, he entered politics and was jailed four years later for a decade for opposing white rule. When his infant son died of malaria in Ghana in 1966, Mugabe was denied parole to attend the funeral, a decision that historians say added to Mugabe’s subsequent bitterness.\n\nAfter his release, he rose to the top of the Zimbabwe African National Liberation Army guerrilla movement.\n\n“You have inherited a jewel in Africa. Don’t tarnish it,” Tanzanian President Julius Nyerere told him during the independence celebrations in Harare.\n\nHis departure from power failed to lift Zimbabwe’s economy, however, which remains in its worst economic crisis in a decade. Triple-digit inflation, rolling power cuts and shortages of U.S. dollars and basic goods have revived memories of the Mugabe era.", "description": "Robert Mugabe, the bush war guerrilla who led Zimbabwe to independence in 1980 and crushed his foes during nearly four decades of rule as his country descended into poverty, hyperinflation and unrest, died on Friday. He was 95.", "authors": ["Macdonald Dzirutwe", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190906&t=2&i=1426902273&w=1200&r=LYNXNPEF85143-OZATP", "published_at": "2019-09-06"}