{"pub": "mirror", "url": "https://mirror.co.uk/travel/news/worlds-creepiest-places-haunted-castles-20721895", "downloaded_at": "2019-10-25 16:36:59.165490+00:00", "title": "World's creepiest places from haunted castles to an island of mutilated dolls", "language": "en", "text": "Get the biggest Weekly Travel stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHalloween is fast approaching, but you don't need to stick to the spooky season if you're looking to give yourself a scare.\n\nThe world has heaps of creepy places that can make for a spine-chilling visit; we're talking everything from an island filled with mutilated dolls (yes, they're believed to be possessed) to haunted castles and unsettling catacombs.\n\nIn fact, the team at My Baggage is on hand to provide some seriously spooky inspiration as its experts have searched out some of the world's spookiest places that need to be on your list if you're looking to go in search of ghosts and paranormal activity.\n\nWe take a look at their picks of the world's top 10 creepiest places and what makes them so terrifying.\n\nCheck out the full list below, if you dare...\n\nDon't want to travel too far? Then you may also want to check out our guide to the spookiest places in Britain .\n\n1. Catacombs of Paris, France\n\n(Image: iStockphoto)\n\nLocated just 20 metres underground, this ossuary contains the remains of several million Parisians.\n\nThe site was created in the late 18th century when Paris faced public health issues linked to the cemeteries, so authorities chose to transfer the bodies to a new underground site, including the Saints-Innocents cemetery.\n\nNowadays visitors can wander through the vast network of tunnels and learn all about the site's history, while taking in the displays of bones.\n\nIt's worth booking ahead if you do want to go exploring - wait times if you turn up on the day can be as long as three hours.\n\n2. Conn Barracks, Germany\n\n(Image: Facebook)\n\nThis site formerly served as a Nazi hospital and asylum, and there have been reported sightings of ghosts in the room above the former drainage room where bodies were stored before being embalmed.\n\nConn Barracks has also been used as the living quarters for US army personnel - it's been claimed that some soldiers reported seeing the ghost of a blood-covered nurse watching those who fell asleep.\n\n3. St. Augustine Lighthouse, Florida, USA\n\n(Image: Getty Images)\n\nThe St Augustine Lighthouse welcomes thousands of visitors every year, but it's proved popular with ghost hunters claiming the surrounding buildings are home to paranormal activity.\n\nSome reported ghostly sightings include a lighthouse keeper fell to his death while painting the tower, as well as three young girls who drowned in the ocean.\n\n4. Edinburgh Castle, Scotland\n\n(Image: iStockphoto)\n\nOne of Edinburgh's most popular attractions, Edinburgh Castle is steeped in history so it's no surprise that some visitors have reported spooky goings-on.\n\nWe're talking sightings of everything from historic war prisoners to a dog wandering around the castle's dog cemetery.\n\nCheck out our Edinburgh city guide for more thrilling things to see and do while you're in the city.\n\n5. Poveglia Island, Venice, Italy\n\n(Image: Getty)\n\nLess than half a mile from the canals of Venice, Poveglia Island once served as a quarantine zone for bubonic plague victims, and was also the site of an early 20th century asylum which was rumoured to carry out horrific medical experiments.\n\nLocals claim to this day that they can hear echoing chimes from the island - despite the bell having been removed years ago.\n\nIt's illegal to visit Poveglia, but you can see it from the beaches of nearby Lido.\n\n6. Isla de la Munecas (Island of the Dolls), Mexico\n\n(Image: isladelasmunecas.com)\n\n\n\nDubbed the Island of Nightmares, this creepy Mexican spot is steeped in spooky myths and legends surrounding the mutilated dolls that fill the island.\n\nThey're nestled everywhere amidst the buildings, the trees and canals - it looks like something out of a horror film.\n\nOh and yes - the dolls are believed to be possessed. Legend has it that the restless spirit of a drowned child lives on through these terrifying toys.\n\n7. Alcatraz, San Francisco, USA\n\n(Image: De Agostini Editorial)\n\nAlcatraz has been home to infamous criminals like Al Capone, but it's also said to have some ghoulish visitors roaming the halls.\n\nLeon ‘Whitey’ Thompson, a former inmate who later conducted tours of the prison, was waiting for a tour group in the 1980s when he claimed he saw a large, looming figure at the end of 'Michigan Avenue', and swore it was the ghost of an inmate he had been friendly with called Johnny Haus.\n\nOther visitors have heard crying and screams, and recently the figure of a woman was snapped through a cell window by holidaymakers in San Francisco.\n\n8. Leap Castle, Ireland\n\n(Image: RTE)\n\nLeap Castle saw plenty of gruesome deaths between the 13th and 15th century having been the site of many a power struggle.\n\nFor example, the castle's 'Bloody Chapel' is said to be haunted by a priest who was stabbed with a sword during mass.\n\nIn the 1900s, workmen discovered a secret dungeon in the chapel filled with human skeletons. The dungeon was designed so that prisoners would fall through a trap door only to be killed by the wooden spikes awaiting below.\n\n9. Aokigahara Forest, Japan\n\n(Image: Getty Images)\n\nAokigahara is the world’s second most popular suicide location (the first being the Golden Gate Bridge with over 500 reported suicides since the 1950s.\n\nSome blame this trend on the forest’s association with demons in Japanese mythology, whilst others blame the rich deposits of magnetic iron in the soil rendering all compasses completely useless - and meaning that people can easily get lost.\n\nThat's why if you are planning to visit, it's best to go with a guided tour.\n\nAs such, many hikers will mark their path with tape or string to make it easier to find their way back out again.\n\n10. Borgvattnet Haunted Vicarage, Sweden\n\n(Image: Getty Images/iStockphoto)\n\nOriginally built in 1876, strange occurrences have been recorded in this parsonage since the 1960s.\n\nThe building now serves as a bed and breakfast in a rural area with snowmobiling and fishing, and guests have claimed to hear footsteps, music, and the sound of three crying ladies coming from the inn.", "description": "Inside the world's creepiest places from haunted castles with torture chambers to an island of possessed dolls", "authors": ["Julie Delahaye", "Image", "Istockphoto", "Facebook", "Getty Images", "Getty", "Isladelasmunecas.Com", "De Agostini Editorial", "Rte", "Getty Images Istockphoto"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article13383435.ece/ALTERNATES/s1200/1_Catacombs-burials-of-Paris-France.jpg", "published_at": "2019-10-25"}