{"pub": "nytimes", "url": "https://nytimes.com/2019/10/11/opinion/china-trade.html", "downloaded_at": "2019-10-11 12:30:27.611285+00:00", "title": "Opinion | Why We Worry About the U.S.-China Trade War", "language": "en", "text": "We recognize, as countries with longstanding economic relationships with China, the real difficulties regarding a number of Beijing’s trade and economic practices. We understand, for example, the challenges which arise from Chinese policies on intellectual property and technology transfer, its restrictions on access to its markets, and its subsidization of private and public firms that are active in the global marketplace. We believe these practices need to change in whichever countries may use them. But it is particularly important in China, because it is the world’s second-largest economy.\n\nAt the same time, as countries long committed to the principles of free trade, we do not see the ever-widening tariff war, launched initially by the United States, as an effective way to resolve international trade and economic disputes. Tariffs, by definition, are the enemy of free trade. Their cumulative impact, particularly combined with the current resurgence of protectionism worldwide, only depresses economic growth, employment and living standards. Tariffs raise the cost of living for working families as consumer prices are driven up.\n\nThis tariff war is also creating economic uncertainty, which is depressing international investor confidence, compounding downward pressure on growth and increasing the risk of recession. The disruption of global supply chains is already profound. Therefore, we believe the World Trade Organization, despite its limitations, is best positioned to address China’s trade practices. We also believe the W.T.O. is the most appropriate forum to resolve trade disputes. So we urge the United States and China — which on Thursday restarted their stalled trade talks in Washington — to work with other member states to strengthen the W.T.O.’s institutional capacity.\n\nOur group of former prime ministers and presidents includes François Fillon of France, Joe Clark of Canada, Enrico Letta of Italy, Jan Peter Balkenende of the Netherlands, Felipe Calderón and Ernesto Zedillo of Mexico and Han Seung-soo of South Korea. Given our collective experience, we are not naïve about the inherent complexities in negotiating international trade agreements. Many of us have actually negotiated free-trade pacts with both the United States and China. We are therefore deeply familiar with the concerns of each country, including powerful domestic political constituencies that may argue for continued protection.\n\nMany of those domestic concerns have focused on the long-term enforcement of any agreement. On this point, we argue that it is in China’s own long-term economic interest to ensure the effective implementation of any new trade deal — whether involving intellectual property, technology transfer, state subsidies or market access. Such policies would also need to apply to all of China’s trading partners, just as they would need to apply to its relationship with the United States.", "description": "Global prosperity and peace are at risk if Beijing and Washington do not resolve their conflict soon.", "authors": ["Kevin Rudd", "Helen Clark", "Carl Bildt"], "top_image": "https://static01.nyt.com/images/2019/10/11/opinion/11Rudd/11Rudd-facebookJumbo.jpg", "published_at": "2019-10-11"}