{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/10/16/watch-buttigieg-slams-democrats-for-having-a-litmus-test-on-one-particular-issue-n2554821", "downloaded_at": "2019-10-16 13:36:01.291934+00:00", "title": "WATCH: Buttigieg Slams Democrats For Having a Litmus Test on One Particular Issue", "language": "en", "text": "Following Tuesday night's Democratic debate, Mayor Pete Buttigieg told CNN panelists he believed the party is pushing Medicare for All as a litmus test for 2020 candidates. In particular, he believes Sen. Elizabeth Warren (D-MA) is spearheading that effort.\n\n\"You mentioned a purity test is not something you think the Democratic Party should be applying to itself. What purity test do you think Senator Warren is applying in this race right now?\" one panelist asked.\n\n\"Certainly the idea that Medicare for All doesn't count unless it obliterates private plans. I think that's a purity test that is the wrong policy and is also going to turn off a lot of American voters when we have an opportunity to do something huge,\" Buttigieg replied. \"Again, if we can deliver a public alternative where every American gets public coverage or private coverage but no one gets left behind, that is the biggest thing we will have done in U.S. health care since the invention in Medicare itself.\"\n\nAccording to Buttigieg, his proposal isn't a \"half measure\" simply because he doesn't want to \"obliterate the private plans,\" a clear punch at those advocating for Medicare for All.\n\n\"It's like the idea that major immigration reform doesn't count unless we decriminalize border crossings or a major package of reforms on gun law doesn't count unless we're going even further,\" the mayor explained. \"This is the kind of thing that gets us trapped to where we can get nothing at all.\"\n\nRecommended Different Sexes John Stossel\n\nSens. Elizabeth Warren (D-MA), Bernie Sanders (I-VT), Kamala Harris (D-CA), Cory Booker (D-NJ) and Rep. Tulsi Gabbard (D-HI) have been outspoken supporters of Medicare for All. Others, like former Vice President Joe Biden and Sen. Amy Klobuchar (D-MN), oppose Medicare for All because it would eliminate private plans provided by employers.\n\n\n\n", "description": ".10/16/2019 9:32:15AM EST.", "authors": ["Beth Baumann", "Leah Barkoukis", "Julio Rosas", "Matt Vespa", "Timothy Meads"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/255/e15c7fdc-5437-4ff7-bcd2-457cdeca00e1.png", "published_at": "2019-10-16"}