{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-england-vs-australia-teams-jordan-petaia-eddie-jones-pressure-michael-cheika-a9159741.html", "downloaded_at": "2019-10-17 11:36:28.571254+00:00", "title": "Rugby World Cup 2019: Jordan Petaia backed by Michael Cheika to deliver for Australia against England", "language": "en", "text": "Jordan Petaia will become just the fourth teenager to play in a Rugby World Cup knockout match after Michael Cheika trusted the young centre to start against England this Saturday.\n\nThe 19-year-old was a surprise inclusion in Cheika’s Wallabies side that will face Jones’s side in Saturday’s quarter-final in Oita, with the head coach electing to replace James O’Connor at outside centre in what will only be Petaia’s fifth professional match of 2019, with a serious foot injury ruling him out of the bulk of the Super Rugby season and the Rugby Championship as well as Australia’s warm-up match with Samoa.\n\nBut despite making his debut on the wing earlier in the tournament, the Queensland Reds back has been given the nod ahead of the more experienced O’Connor to try and inspire Australia into the semi-finals after impressing his coach in Japan.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n\"We didn’t sit back and earmark this game for him to come and play at 13. We just watched the games and made the assessments of each player as they went along and there were things that we liked and what we've seen from Jordan both on the field in games and also at training and we felt that this would be a game that would suit him.\n\n\"The guy's been in around the squad for a while now even though he's young, he's more than ready to do this. The way his demeanour is you wouldn't think he was picked, he was just loping around as per normal so it’s going to be great. I trust him infinitely and that’s why he's been chosen.\n\nShape Created with Sketch. Team of the pool stage: Rugby World Cup 2019 Show all 16 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Team of the pool stage: Rugby World Cup 2019 1/16 Rugby World Cup team of the pool stage With the 40 pool matches of the Rugby World Cup in the bag, who makes our best team of the pool stage? Click through the gallery to see each player. AFP via Getty Images 2/16 1. Joe Marler (England) Not so long ago the loosehead was in international retirement, yet now he finds himself as one of just five players to have started all three of England’s pool games. Marler stood up to take on responsibility in the absence of first-choice Mako Vunipola, and ensured that his absence did not become a weakness. AFP via Getty Images 3/16 2. Shota Horie (Japan) Arguably the player of the pool stage. Horie’s familiar locks have made him famous for more than just his rugby skills, but it is what he is doing on the field that he deserves praise for. Standout performances against Ireland and Scotland tell you all you need to know about his form so far. Getty Images 4/16 3. Tadhg Furlong (Ireland) Furlong was outstanding against Samoa and has provided strong consistency across the pool stage to help Ireland get back on their feet. With most tighthead props being rotated game by game, it makes selection rather tricky to look for standout moments, but Furlong’s two crunching runs in his most recent outing see him stand out from the rest. EPA 5/16 4. Luke Thompson (Japan) The 38-year-old is defying Father Time at this year’s World Cup and has been one of their standout players so far. His defensive effort has been supreme with the numbers to back it up, while he is also a key reason why Japan now have a strong set-piece. AFP/Getty Images 6/16 5. Lood de Jager (South Africa) Has stood out from the shadow of Eben Etzebeth to be South Africa’s leading second row so far this tournament. Finally looks to be delivering on the potential that he’s been earmarked as having for some time, and is learning how to make the most of his towering frame. PA 7/16 6. Michael Leitch (Japan) Captain fantastic and a hero to the Japanese people, who bello “LEITCH!” every time he gets the ball. Carries ferociously like it’s his last chance to touch the ball, and has led Japan’s defensive effort with honour. AFP via Getty Images 8/16 7. Justin Tipuric (Wales) The flanker was brilliant against Australia to help them to victory and was trusted to lead the team against Uruguay in order to provide his nous and intelligence to help see Wales to top spot. AFP/Getty Images 9/16 8. Kazuki Himeno (Japan) Is emerging into one of the most impactful forwards at the World Cup with a lovely blend of raw power and gifted handling making him a handful for opponents to stop, as both Samoa and Scotland discovered. Getty Images 10/16 9. Yutaka Nagare (Japan) A lot of what Japan have achieved at this World Cup is down to the speed in delivering the ball that Nagare is able to provide. Slow him down and teams will work out how to beat Japan, but so far no one has managed to do that and Nagare has punished them for it. AP 11/16 10. George Ford (England) A bright light in what has not been a shimmering campaign so far for England, but the way he has surged back into the mix after losing his place to Owen Farrell last year has been impressive. Captain on occasion, leading fly-half on the rest, Ford has even crossed the whitewash twice to get his account off to a strong start. AP 12/16 11. Semi Radradra (Fiji) The man pushing Leitch as the player of the tournament. Radradra was unstoppable against Wales and battered the Wallabies defence with his power running on the opening weekend. The biggest shame is that he is going home from the tournament already, but his impact has been felt by many a defender already in Japan, REUTERS 13/16 12. Ryoto Nakamura (Japan) The centre has made a name for himself at the World Cup, with his ability to blast through tackles standing out as a key reason why Japan are able to get over the gain line so often. Getty Images 14/16 13. Anton Lienert-Brown (New Zealand) There are not as many New Zealanders on this list as you’d usually expect, but then the All Blacks have been going through the motion since the victory over South Africa three weeks ago. Not Lienert-Brown though, as he has stood out as one of the best performers of the tournament so far. Getty Images 15/16 14. Kotaro Matsushima (Japan) Five-try Kotro leads the way at the Rugby World Cup, with only Wales’s Josh Adams able to match his haul at the tournament so far. Matsushima brings a huge work rate to the back-field and has an incredible ability to bounce off much bigger tacklers than he is, which says a lot about his skills and strength in the tackle. Getty Images 16/16 15. Beauden Barrett (New Zealand) Barrett may not have played for a few weeks after being rested against Nambia and having the final game with Canada cancelled, but the brilliant display against the Springboks at the strat of the tournament should be forgotten. AFP/Getty Images 1/16 Rugby World Cup team of the pool stage With the 40 pool matches of the Rugby World Cup in the bag, who makes our best team of the pool stage? Click through the gallery to see each player. AFP via Getty Images 2/16 1. Joe Marler (England) Not so long ago the loosehead was in international retirement, yet now he finds himself as one of just five players to have started all three of England’s pool games. Marler stood up to take on responsibility in the absence of first-choice Mako Vunipola, and ensured that his absence did not become a weakness. AFP via Getty Images 3/16 2. Shota Horie (Japan) Arguably the player of the pool stage. Horie’s familiar locks have made him famous for more than just his rugby skills, but it is what he is doing on the field that he deserves praise for. Standout performances against Ireland and Scotland tell you all you need to know about his form so far. Getty Images 4/16 3. Tadhg Furlong (Ireland) Furlong was outstanding against Samoa and has provided strong consistency across the pool stage to help Ireland get back on their feet. With most tighthead props being rotated game by game, it makes selection rather tricky to look for standout moments, but Furlong’s two crunching runs in his most recent outing see him stand out from the rest. EPA 5/16 4. Luke Thompson (Japan) The 38-year-old is defying Father Time at this year’s World Cup and has been one of their standout players so far. His defensive effort has been supreme with the numbers to back it up, while he is also a key reason why Japan now have a strong set-piece. AFP/Getty Images 6/16 5. Lood de Jager (South Africa) Has stood out from the shadow of Eben Etzebeth to be South Africa’s leading second row so far this tournament. Finally looks to be delivering on the potential that he’s been earmarked as having for some time, and is learning how to make the most of his towering frame. PA 7/16 6. Michael Leitch (Japan) Captain fantastic and a hero to the Japanese people, who bello “LEITCH!” every time he gets the ball. Carries ferociously like it’s his last chance to touch the ball, and has led Japan’s defensive effort with honour. AFP via Getty Images 8/16 7. Justin Tipuric (Wales) The flanker was brilliant against Australia to help them to victory and was trusted to lead the team against Uruguay in order to provide his nous and intelligence to help see Wales to top spot. AFP/Getty Images 9/16 8. Kazuki Himeno (Japan) Is emerging into one of the most impactful forwards at the World Cup with a lovely blend of raw power and gifted handling making him a handful for opponents to stop, as both Samoa and Scotland discovered. Getty Images 10/16 9. Yutaka Nagare (Japan) A lot of what Japan have achieved at this World Cup is down to the speed in delivering the ball that Nagare is able to provide. Slow him down and teams will work out how to beat Japan, but so far no one has managed to do that and Nagare has punished them for it. AP 11/16 10. George Ford (England) A bright light in what has not been a shimmering campaign so far for England, but the way he has surged back into the mix after losing his place to Owen Farrell last year has been impressive. Captain on occasion, leading fly-half on the rest, Ford has even crossed the whitewash twice to get his account off to a strong start. AP 12/16 11. Semi Radradra (Fiji) The man pushing Leitch as the player of the tournament. Radradra was unstoppable against Wales and battered the Wallabies defence with his power running on the opening weekend. The biggest shame is that he is going home from the tournament already, but his impact has been felt by many a defender already in Japan, REUTERS 13/16 12. Ryoto Nakamura (Japan) The centre has made a name for himself at the World Cup, with his ability to blast through tackles standing out as a key reason why Japan are able to get over the gain line so often. Getty Images 14/16 13. Anton Lienert-Brown (New Zealand) There are not as many New Zealanders on this list as you’d usually expect, but then the All Blacks have been going through the motion since the victory over South Africa three weeks ago. Not Lienert-Brown though, as he has stood out as one of the best performers of the tournament so far. Getty Images 15/16 14. Kotaro Matsushima (Japan) Five-try Kotro leads the way at the Rugby World Cup, with only Wales’s Josh Adams able to match his haul at the tournament so far. Matsushima brings a huge work rate to the back-field and has an incredible ability to bounce off much bigger tacklers than he is, which says a lot about his skills and strength in the tackle. Getty Images 16/16 15. Beauden Barrett (New Zealand) Barrett may not have played for a few weeks after being rested against Nambia and having the final game with Canada cancelled, but the brilliant display against the Springboks at the strat of the tournament should be forgotten. AFP/Getty Images\n\n\"He’s pretty relaxed but he's very well prepared. That’s the one thing I’ve noticed about him, he gives off a demeanour of talking pretty cool and chill, but he’s very well prepared both off the field in getting ready tactically and physically.\n\n\"He’s been able to build good relationships within the team and is very well-liked and I think he's very consistent in that way. He's got a great demeanour and I really like it.\n\n\"I wouldn’t be looking at the age of players at either end of the spectrum ... yes, it’s going to be fast and aggressive and all that type of stuff and I know that lad will rise up to that challenge. I know it. I've seen it in him, so I know he will on Saturday.”\n\nPetaia will become the youngest Wallaby Test centre since Jason Little made his debut 30 years ago, having been hailed as a potential wonderkid by those that have seen his early progress.\n\nPetaia’s positional switch is combined with five changes to the side that beat Uruguay last time out, with prop Allan Ala'alatoa, scrum-half Will Genia, fly-half Christian Lealiifano and the returning Reece Hodge joining captain Michael Hooper in the side, with the skipper incredibly winning his 99th cap for the Wallabies at just 27 years old. Hodge goes straight back into the side after serving a three-week ban for a high tackle on Fiji’s Peceli Yato in Australia’s opening match in Japan, with Dane Haylett-Petty missing out on the squad completely as Kurtley Beale has recovered from a concussion to start at full-back and Marika Koroibete occupies the left wing.\n\nLeallifano beats Matt Toomua and Bernard Foley to the No 10 shirt – with the latter left out of the matchday squad – but there is a surprise at scrum-half with Genia preferred to Nic White.\n\nSamu Kerevi joins Petaia in the centres, while in the pack young Scott Sio and Tolu Latu are joined by Alaalatoa, with Izack Rodda and Rory Arnold continuing in the second row and Hooper joining David Pocock and Isi Naisarani in the back row.\n\nAustralia team to face England\n\nKurtley Beale; Reece Hodge, Jordan Petaia, Samu Kerevi, Marika Koroibete; Christian Lealiifano, Will Genia; Scott Sio, Tolu Latu, Allan Alaalatoa; Izack Rodda, Rory Arnold; David Pocock, Michael Hooper, Isi Naisarani.\n\nReplacements: Jordan Uelese, James Slipper, Taniela Tupou, Adam Coleman, Lukhan Salakaia-Loto, Nic White, Matt Toomua, James O’Connor.", "description": "Jordan Petaia will become just the fourth teenager to play in a Rugby World Cup knockout match after Michael Cheika trusted the young centre to start against England this Saturday.", "authors": ["Jack De Menezes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/17/11/jordan-petaia.jpg", "published_at": "2019-10-17"}