{"pub": "cnbc", "url": "https://cnbc.com/2019/10/10/can-you-get-sued-over-a-negative-yelp-review.html", "downloaded_at": "2019-10-11 00:15:45.731342+00:00", "title": "Can you get sued over a negative Yelp review? Here's what you need to know", "language": "en", "text": "Small businesses often live or die by word-of-mouth, as roughly 86% of U.S. consumers consult online reviews before patronizing a local business, according to a BrightLocal survey. So what happens if you post a negative review of a business and the business-owner tries to fight back, or even tries to silence you with a lawsuit? It's a trend that's become more common as more and more people share their opinions in online forums and discussion boards, from Yelp (which features over 100 million reviews from users) to the comments sections of businesses' social media pages. In July, a Yelp user in Florida named Tom Lloyd told \"CBS This Morning\" that he was left with more than $25,000 in legal bills after a veterinary practice sued him for defamation over a negative Yelp review. In the review, Lloyd recounted how his dog died at the animal hospital waiting for a surgeon who never showed up. And Lloyd is not alone. In 2018, a tourist attraction in Branson, Missouri called Bigfoot on the Strip sued a Kansas man and his daughter over a relatively tepid review posted on TripAdvisor (the man initially gave the business a rating of three out of five stars). The lawsuit sought at least $25,000 and legal costs from the Kansas man, but he was granted a summary judgement in August 2019, which terminated the lawsuit, according to court records. And in 2015, a Colorado couple reportedly racked up $65,000 in legal fees (including a $15,000 settlement payment) fighting a defamation lawsuit brought by a flooring company the couple negatively reviewed on Yelp. \"Most Americans don't realize they can be sued for writing an online review,\" says Evan Mascagni, an attorney who currently serves as Policy Director at the Public Participation Project, a nonprofit group that advocates for First Amendment rights. \"With the rise of user-generated [review] content sites like Yelp, TripAdvisor, Google, we've really seen a shift where folks are being sued for their speech online,\" Mascagni tells CNBC Make It. With so many consumers posting online reviews of businesses, it's not surprising that some business-owners might take exception to the occasional negative review, says Carl Settlemeyer, an attorney in the Federal Trade Commission's bureau of consumer protection. \"Sometimes [a consumer's review] may go too far, sometimes a business may be trying to throw its weight around and trying to silence a consumer,\" Settlemeyer tells CNBC Make It. Mascagani goes as far as to say some people are trying to \"hijack our judicial system to silence, intimidate and harass critics of theirs.\"\n\nAre reviewers protected?\n\nWhile Settlemeyer notes that businesses suing consumers over negative online reviews is far from an everyday occurrence across the country, it's become enough of an issue that Congress felt the need to pass a law in 2016, called the Consumer Review Fairness Act (CRFA), to protect consumers' ability to leave an honest online review of a business without being punished. The CRFA banned the use by businesses of non-disparagement clauses in any contracts that aren't reasonably open to negotiation. It's opened the door for the government to crack down on businesses trying to use the threat of a lawsuit, and the associated legal fees, to strong-arm consumers into either avoiding writing negative reviews or taking them down after they've been written. The FTC has used the law to issue complaints against businesses (from an HVAC repair company to a vacation rental business) that the agency alleged have used non-disparagement clauses in contracts to sue consumers who left honest reviews online, \"with different language that ranged from a strong confidentiality restriction that would cover posting reviews to outright 'Don't leave me any review less than five stars or I'm going to sue you for $25,000,'\" Settlemeyer says. \"The bottom line is the businesses aren't allowed to use those provisions … and they have to notify customers that those non-disparagement provisions are void and that they can't enforce them and that they're free to post their honest reviews of their interactions with the business.\" If you are sued by a business that claims to have a non-disparagement provision, you can report the lawsuit on the FTC website, says Settlemeyer, who adds that each state's attorney general also has the power to enforce the CRFA. And there are other laws on the books in most U.S. states aimed at protecting people from frivolous lawsuits that infringe on their First Amendment rights. As Mascagni points out, 29 states currently have anti-SLAPP statutes, which aim to make it easier for defendants to seek dismissal of a meritless lawsuit (such as a business suing a consumer over an honest review) and can even impose financial penalties on plaintiffs who lose an anti-SLAPP motion. But in states without anti-SLAPP laws, consumers may be more exposed, Mascagni says. \"Oftentimes, in those states, what you'll see is people just censoring themselves: taking the review down, apologizing, editing the review, retracting, those sorts of things,\" he says. If a consumer finds themselves hit with a lawsuit stemming from an honest review, Mascagni recommends contacting an attorney. He says his organization, the Public Participation Project, and other First Amendment advocates, can help consumers find attorneys with anti-SLAPP experience in their area. Some review websites also take steps to make sure users know their First Amendment rights, and a Yelp spokesperson tells CNBC Make It the site issues \"legal threat alerts\" to warn against businesses that have potentially tried to stifle users' free speech online. \"Yelp regularly engages in advocacy work to protect the First Amendment rights of consumers because we believe in the ability for consumers to share their experiences online,\" the Yelp spokesperson tells CNBC Make It.\n\nCould it still cost you money to fight?\n\nIf a business sues you for an honest review and loses due to anti-SLAPP laws, you could be due reimbursement for legal fees. However, in states without anti-SLAPP statutes, even if you successfully get a lawsuit dismissed, there could still be attorney's fees you have to pay. \"This being America, and anybody can file a lawsuit, and legal costs are not cheap even if you do have strong footing, I don't want to encourage anybody to go broke fighting over this. And, I can understand why somebody would decide they don't want to fight,\" Settlemeyer says.\n\nWhat you need to remember when reviewing", "description": "Lawsuits from businesses suing consumers over negative online reviews have been popping up across the country, with defendants potentially racking up legal fees worth five figures. Attorneys weigh in on what you need to know before posting a negative review.", "authors": ["Tom Huddleston Jr."], "top_image": "https://image.cnbcfm.com/api/v1/image/105761734-1551194095589laptop-mustache-beard-designer-movember-using-laptop-business-professional-people-using-laptop_t20_kyvj1e.jpg?v=1551194159", "published_at": "2019-10-10"}