{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7537917/Jason-Donovan-51-goes-shopping-insisting-hes-no-hero-rushing-fire.html", "downloaded_at": "2019-10-05 06:08:50.139670+00:00", "title": "Jason Donovan, 51, goes shopping after insisting he's 'no hero' for rushing to put out a fire", "language": "en", "text": "He recently rushed out of his home in his underpants armed with a fire extinguisher to help put out a blaze near his London home.\n\nAnd after insisting he's 'no hero' for the feat, Jason Donovan, 51, played it a little cooler on Friday as he went food shopping.\n\nThe Neighbours actor, 51, cut a casual figure in a grey jumper, blue shorts and trainers as he headed on a low-key food shopping trip in Notting Hill.\n\nGood neighbour: After insisting he's 'no hero' for helping to put out a fire while dressed only in his underpants, actor Jason Donovan, 51, played it cooler while shopping in Notting Hill\n\nStrolling along in a pair of comfortable trainers, the actor carried his phone and appeared to be deep in thought.\n\nIn the fire, which broke out in the £21.5million mansion opposite his home in the early hours of September 22, Donovan jumped out of bed to help while wearing nothing but his underpants.\n\nGrateful residents had told how the iconic Eighties actor and singer, who shot to fame as Scott Robinson in the soap, ran to the rescue 'like a superhero'.\n\nAlluding to his role in the Australian soap, the blazing home's owners said his actions were 'the perfect example of when good neighbours become good friends.'\n\nShocker: The Neighbours actor cut a casual figure in a grey jumper, blue shorts and trainers as he carried a Sainsbury's shopping bag near his West London home on Friday\n\nThe property which caught fire appears to have been extended and had a shiny black Mercedes 4x4 on the drive.\n\nThe owners, in their mid forties were woken by neighbours banging on the door and ringing the doorbell when the fire broke out.\n\nThey were standing outside their house with their two children aged ten and 12 when Jason came running across the road bare foot, armed with two fire extinguishers and single-handedly hosed down the blaze.\n\nThe family, who did not want to be named, said Jason spotted the fire from the window of his five storey house just after 4am and hailed him as the 'best neighbour in the history of the world.'\n\nWow! The singer is pictured in his underwear racing to help his neighbours during the blaze\n\nThe man said: 'This is the perfect example of when good neighbours become good friends. It was awesome. It's brilliant, fantastic. He is the best neighbour in the history of the world.\n\n'He literally saw the fire from that window at 4.30 in the morning and ran out that door. He came across the road and literally put the fire out bare foot.'\n\nThe man was seen leaving his home in a suit with his partner on Wednesday.\n\nShe said: 'We had a fire and we were woken up by our neighbours banging on the door and ringing the doorbell.\n\nBack again: The fire service confirmed there had been a blaze at the star's home in Notting Hill, West London\n\nHonoured: The singer thanked the emergency services for getting there so quickly after he'd raced to help his neighbour\n\n'I was standing outside with my kids and Jason Donavon came running like a superhero. He came bare foot just running across the street. 'Then he came and he hosed down the fire.\n\n'He called the fire department for us. He gave me a hug and made sure I was okay and left. I think he is heroic.'\n\nQuick move: Jason (pictured on Neighbours with co-star Kylie Minogue in 1988) raced into the street in his underwear\n\nHer partner added: 'Jason Donavon ran across the road in his shorts looking fit with two fire extinguishers. He put the fire out before the fire department arrived.\n\n'The neighbours had just woken us but he called the fire department. It wasn't in the house, it was adjacent to the house.'\n\nThe fire service confirmed there had been a blaze at the star's home in Notting Hill, West London, tweeting: 'Everyone needs good neighbours - Jason Donovan surprises firefighters at \"NottingHill fire.\"'\n\nHowever, Donovan insisted: 'There are no heroes apart from the emergency services and the fact that everybody was safe.'\n\nOn Twitter, Donovan thanked the emergency services for getting there so quickly after he'd raced to help his neighbour.\n\nHe tweeted: 'Thank you to the @LondonFire for getting to the situation so quickly, glad no one was hurt. This is a good reason to always wear PJs to bed (in case of emergencies) but much more importantly to have fire extinguishers at hand in the home.'\n\nWatch Manager Thomas Wolfe said: 'The fire was located in the side passage next to a house and when we arrived a gentleman was tackling the fire using a fire extinguisher. We took over from him and quickly dealt with the blaze.\n\nIncredible! He proved he is a Good Samaritan after comforting a woman that has collapsed in the street near his London home\n\n'It soon transpired that it was Jason Donovan who noticed the fire from his property over the road. The fire is believed to have been caused by a fault in electrical cabling.'\n\nIt's not the first time this year that Donovan has offered a helping hand in an emergency. In May, he saw that a woman had collapsed in the street near his home and his first thought was to help.\n\nThe Australian star had been out for a jog when he spotted the woman unconscious on the pavement in Notting Hill.\n\nWow! Jason, who was seen taking directions from a 999 operator on his phone before paramedics arrived, holds the woman's hand\n\nInstead of carrying on with his run, the Australian actor went to her aid and was seen taking directions from a 999 operator on his phone.\n\nHe stayed with her after paramedics arrived, holding her hand while she was assessed.\n\nWhen she came round, the woman recognised her helper. The former soap star grinned as she shook his hand before she was taken to hospital by ambulance.", "description": "Jason Donovan, 51, played it a little cooler on Friday as he went food shopping near his West London home in a grey jumper, blue shorts and trainers.", "authors": ["Harry Howard For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/14/19298236-0-image-a-79_1570196007800.jpg", "published_at": "2019-10-04"}