{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7577807/Qantas-CEO-Alan-Joyce-blasted-helping-government-deport-asylum-seekers.html", "downloaded_at": "2019-10-16 05:10:33.130631+00:00", "title": "Qantas CEO Alan Joyce is blasted for helping government to deport asylum seekers", "language": "en", "text": "Qantas CEO Alan Joyce has been blasted for being outspoken on some social issues while helping the government deport asylum seekers.\n\nIn the lead-up to the Qantas annual general meeting being held in Adelaide next Friday, multiple organisations have criticised the airline for its stance on the controversial issue.\n\nDuring Joyce's tenure the airline has been vocal on a number of topics including same-sex marriage, climate change, and Indigenous reconciliation.\n\nIn regards to refugees and asylum seekers, on the other hand, Qantas has previously said it is not the place of the airline to interfere with government policy.\n\nQantas CEO Alan Joyce (pictured) has been blasted for hypocrisy, having been outspoken on some social issues while simultaneously helping the government deport asylum seekers\n\nIn regards to refugees and asylum seekers, on the other hand, Qantas has previously said it is not the place of the airline to interfere with government policy (file image of Manus Island)\n\n'It is not the role of airlines to adjudicate on complex immigration decisions,' Joyce has said.\n\nThe Australasian Centre for Corporate Responsibility (ACCR) has filed a resolution for Joyce and the Qantas board to cease the 'involuntary transportation of refugees and asylum seekers' for the Department of Home Affairs.\n\nACCR argues that Qantas made a commitment to the United Nations' Guiding Principles on Business and Human Rights in 2017 that it would avoid operations that present human rights risks.\n\nAdvocacy organisation Refugee Advice and Casework Service (RACS) has also called on Qantas to address the issue.\n\n'It is grossly hypocritical that Qantas continues to be complicit in the execution of the Australian government's policy, by undertaking forced deportations and domestic transfers between detention prisons,' the group's website says.\n\nA petition by SumofUs, a global organisation to promote corporate ethics, has amassed nearly 5,000 signatures calling on the airline to 'stop flying refugees back to harm'.\n\nA similar petition being run by Getup is calling on Qantas and also Virgin to take a stance on the issue.\n\n'If Qantas and Virgin stand up to (Home Affairs Minister) Peter Dutton, like American airlines stood up to Trump – we deal a real blow to the system of deportations and family separation that Dutton has enshrined,' GetUp! said.\n\nSeveral airlines in the United States have opted to speak out following President Trump's crackdown on immigrants crossing the Mexican border.\n\nAmerican, Southwest, United and Frontier Airlines are among the carriers who said they would not transport children separated from their parents due to White House immigration policy.\n\nVirgin Atlantic similarly announced they would not assist in the deportation of those deemed illegal immigrants by the UK government.\n\n'These are very complex and emotive matters but it's not for airlines to adjudicate on who should and shouldn't get to stay in Australia after the government and courts have made their decisions.' Qantas told Daily Mail Australia.\n\n", "description": "Qantas CEO Alan Joyce has been blasted for hypocrisy, having been outspoken on some social issues while helping the Australian government deport asylum seekers.", "authors": ["Brett Lackey For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/02/19767932-0-image-a-4_1571190211304.jpg", "published_at": "2019-10-16"}