{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/28/1936324/0/en/Canada-s-Largest-Foodservice-Tradeshow-Shows-You-How-to-Diversify-and-Thrive.html", "downloaded_at": "2019-10-28 13:20:24.843890+00:00", "title": "Canada’s Largest Foodservice Tradeshow Shows You How to “Diversify and Thrive”", "language": "en", "text": "TORONTO, Oct. 28, 2019 (GLOBE NEWSWIRE) -- Ghost kitchens, future food and equipment trends, the food is medicine movement, and what role cannabis can play in foodservice’s future are all topics the RC Show 2020 is tackling. This year’s RC Show celebrates its 75th anniversary, while also weighing in on how to “Diversify and Thrive” in an industry that accounts for $89 billion a year.\n\nMarch 1-3, 2019 Restaurants Canada invites chefs, baristas, bartenders, sommeliers, foodservice operators, distributors, brokers, retailers and buyers to experience the foodservice and hospitality event of the year. Learn from the biggest brands and innovators from around the world who have all found success in diversifying their business model and menus in order to stay ahead of the competition. In addition, attendees will find cutting-edge products, meet pioneering people, and be inspired by transformative ideas that will set their business up for success. Furthermore, the industry is invited to take part in RC Hospitality Week events including the RC Leadership Conference, Breakfast With Champions, and Industry Night Out. There are so many opportunities to network with industry professionals and be inspired by the talented individuals that attend the Hospitality Event of the Year!\n\nHere’s a taste of what’s to come:\n\nEducational sessions on diverse profit avenues, from ghost kitchens to catering to retail — and how to make the right move for your business.\n\nInformative panel discussions from the industry’s top CEOs of Canada’s biggest restaurant, liquor and distribution brands.\n\nEye-opening presentations on Canada's changing demographics and the economics of delivery.\n\nA lively exploration of the future opportunities with cannabis in foodservice.\n\nTips for capitalizing on the health food movement and future food trends.\n\nInsights on how to grow your business through culinary tourism.\n\nA constructive seminar on how to attract and retain talent with solutions addressing the foodservice labour shortage crisis.\n\nAttendees will also have the opportunity to:\n\nGrow their business by building their relationships with suppliers and distributors who exhibit at the Show.\n\nby building their relationships with suppliers and distributors who exhibit at the Show. Mix and mingle with their peers at RC Show's premium networking events during RC Hospitality Week.\n\nwith their peers at RC Show's premium networking events during RC Hospitality Week. Witness baristas, bartenders, sommeliers and chefs face-off like never before in annual competitions such as Beyond the Rail, Garland Discovered Culinary Competition, National Latte Art & Coffee in Good Spirits, and the new Sommelier Service Competition.\n\nbaristas, bartenders, sommeliers and chefs face-off like never before in annual competitions such as Beyond the Rail, Garland Discovered Culinary Competition, National Latte Art & Coffee in Good Spirits, and the new Sommelier Service Competition. Explore and experience complimentary tastings and chef-inspired cuisines in the Pop Up Resto & Bar.\n\ncomplimentary tastings and chef-inspired cuisines in the Pop Up Resto & Bar. Support the next generation of talent at the Canadian Hospitality Foundation Fundraising gala kicking off RC Hospitality Week on Saturday, February 29, 2020.\n\nAttendees are invited to shop, taste, learn, connect, and grow their business. Register at rcshow.com now for early-bird ticket pricing available until December 31, 2019.\n\nFollow us and join the conversation on social: #RCShow20 @RestaurantsCA @RestaurantsCanada\n\nTo sign up for media accreditation, arrange an interview or RSVP for media events, please contact:\n\nTianna Goguen | 647 725 9740 | tianna@punchcanada.com\n\nLisa Raffaele │647-837-1265│lisa@punchcanada.com\n\nAbout RC Show\n\nCanada’s largest foodservice and hospitality event. RC Show showcases cutting-edge products, pioneering people and transformative ideas. Attendees will find 3 days of programming to learn from and network with Canada's top foodservice professionals, product and service innovations included in 8 curated pavilions across a 250,000 sq. ft. show floor and on-the-floor feature activations that bring the latest business concepts to life.\n\nAbout Restaurants Canada\n\nRestaurants Canada is a national, not-for-profit association advancing the potential of Canada’s diverse and dynamic foodservice industry through member programs, research, advocacy, resources and events. Canada’s foodservice sector is an $89 billion industry that directly employs 1.2 million workers, is Canada’s number one source of first jobs and serves 22 million customers across the country every day.\n\nMarlee Wasser Restaurants Canada 416-649-4254 media@restaurantscanada.org Tianna Goguen PUNCH Canada 647 725 9740 tianna@punchcanada.com", "description": "#RCShow20 shares a sneak peek at programming highlights; Save the date March 1-3, 2020", "authors": ["Restaurants Canada"], "top_image": "", "published_at": "2019-10-28"}