{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/chinese-stocks-tumble-on-report-of-us-investment-limits-2019-10-1028583743", "downloaded_at": "2019-10-08 15:21:47.948668+00:00", "title": "Chinese stocks slide on report the White House is considering limits to US investment in China (BABA, BIDU, JD)", "language": "en", "text": "Reuters\n\nShares of US-listed Chinese firms including Alibaba, Baidu, and JD.com traded as much as 2.3% lower on Tuesday morning on a report that the White House is considering limits on US investment in China.\n\nThe Trump administration is advancing talks about potential restrictions on investments made by US government pension funds into Chinese companies, according to a report from Bloomberg.\n\nThe news follows another report from Bloomberg last month that the Trump administration began reviewing a variety of options for curbing US investors' flows into China.\n\nVisit the Markets Insider homepage for more stories.\n\nUS-listed Chinese stocks sunk Tuesday on a report that the Trump administration is considering limits on US investment in China.\n\nHere are some of the Chinese firms trading lower on Tuesday morning:\n\nThe White House is reportedly continuing discussions around potential restrictions on investments made by US government pension funds into Chinese companies, according to Bloomberg.\n\nThe news follows another report from Bloomberg last month that the Trump administration was exploring a variety of limits to capital flows into China including delisting Chinese firms from US stock exchanges. According to Bloomberg, any plan to de-list Chinese companies from US exchanges has been put on hold for the time being.\n\nThe discussions are now more focused on reviewing index fund provider's decision to include Chinese companies that could pose a significant risk to American investors, Bloomberg reported.\n\nMajor index providers including BlackRock, Vanguard, and Invesco are among the largest shareholders in Alibaba, Baidu, and JD.com.\n\nThe effort comes just a few days before the US and China are set to resume high-level trade negotiations in Washington, D.C. later this week.\n\nRead more: The world's most accurate economic forecaster sees a 'prolonged global slowdown' on the horizon — and warns it can only be narrowly avoided", "description": "Shares of US-listed Chinese firms including Alibaba, Baidu, and JD.com traded as much as 2.3% lower on Tuesday morning on a report that the White House is...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d9c7fbfd831b247ad23ccb7-2400/2019-10-07t132640z1lynxmpef960u7rtroptp4usa-trade-china.jpg", "published_at": "2019-10-08"}