{"pub": "indiatimes", "url": "https://indiatimes.com/trending/environment/world-s-oldest-pearl-8000-years-old-378233.html", "downloaded_at": "2019-10-21 07:37:54.704803+00:00", "title": "8,000-Year-Old, World's Oldest Pearl Will Be Displayed In An Exhibition In Abu Dhabi", "language": "en", "text": "The world’s oldest pearl has been found by archaeologists, who say that it is the world’s oldest which is 8,000-years-old. It will be displayed in Abu Dhabi, according to the authorities. The authorities also said that the oldest pearl is the proof that “the objects were traded since Neolithic times”.\n\nDuring excavations, the natural pearl was found in the floor of a room at Marawah Island, which is off the capital of the United Arab Emirates, which is also the earliest structure in the country. \"The layers from which the pearl came have been carbon dated to 5800-5600 BC, during the Neolithic period,\" Abu Dhabi's Department of Culture and Tourism said.\n\n\"The discovery of the oldest pearl in the world in Abu Dhabi makes it clear that so much of our recent economic and cultural history has deep roots that stretch back to the dawn of prehistory,\" said its chairman, Mohamed Al-Muabarak.\n\nAFP\n\nThe pearl will be displayed in an exhibition - ‘10,000 years of Luxury’ which is opening on October 30, at the Louvre Abu Dhabi. Talking about the pearl, the experts believe that the pearls were traded with Mesopotamia in exchange for ceramics and other goods.\n\nDon't Miss 2.8 K SHARES 182 SHARES 3.7 K SHARES 127 SHARES 186 SHARES\n\n\"The Venetian jewel merchant Gasparo Balbi, who travelled through the region, mentions the islands off the coast of Abu Dhabi as a source of pearls in the 16th century,\" the culture department said.\n\nAre you excited to see the oldest pearl at the exhibition?", "description": "The world’s oldest pearl has been found by archaeologists, who say that it is the world’s oldest which is 8,000-years-old. It will be displayed in Abu Dhabi, according to the authorities. The authorities also said that the oldest pearl is the proof that “the objects were traded since Neolithic times”.", "authors": ["Priyanshi Mathur"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/oldest_pearl_1571640583_800x420.jpg", "published_at": "2019-10-21"}