{"pub": "thenextweb", "url": "https://thenextweb.com/plugged/2019/10/06/just-putting-it-out-there-i-will-not-be-phablet-shamed", "downloaded_at": "2019-10-07 00:06:45.515112+00:00", "title": "Just putting it out there: I will not be phablet-shamed", "language": "en", "text": "In this column, “Just putting this out there…,” we write about the odd ways we engage with tech and the unpopular opinions we form about it. You can read the rest of the articles in this series here.\n\nMy phone is massive. If this were 2014, it would go mostly unnoticed. But today, people treat me like I’m a freak.\n\nThe phone I’m talking about is the Lenovo Phab 2 Pro. It proudly carries the name “phablet” — a term most of us haven’t used for the better part of a decade. With a size of 179.8 x 88.6 x 10.7mm (that’s almost seven inches long) and a weight of 259g (over a half-pound) it certainly deserves that label. Lenovo Phab 2 Pro is an absolute unit, and I love every single gram.\n\nTo be fair, this wasn’t always the case. I started using the Lenovo as a temporary replacement for a normal-sized, broken Google Pixel phone. The phablet was meant to be short term, damn it! But then I discovered its wonderful quirks and, most importantly, its everlasting battery life.\n\nBecause my huge phone is specifically made to run AR apps — a function I never need — ‘just’ using it for things like texting, browsing social media, and streaming Spotify means my Lenovo never dies. When I first started using it, it would run for two full days without needing to charge. For someone like me, who never thinks to bring a charger, this was life-changing.\n\nAlso, it’s a great conversation starter. Whenever I’m alone and feel like socializing but aren’t quite sure what to say, all I need to do is take it out. Almost instantly, total strangers will start marveling at its size. Here are some of my Lenovo’s Greatest Hits:\n\n“OMG is that your phone? It’s HUGE! I’ve never seen a phone that big. Do you carry an extra bag?”\n\n“What type of tablet is that? It’s a phone? Really? So you can make calls with that thing?”\n\n“Can I hold it?” * holds Lenovo up to ear while holding a fake phone conversation, and bursts into hysterical laughter*\n\nOh, and then there’s its entertainment value. With a screen just inches shy of an in-seat airplane monitor, guess who’s binge-watching Fleabag the whole flight? That’s right, me.\n\nSo why aren’t more people using phones the size of their heads? How come I’m still met with ridicule every time I overstretch my tiny lady thumbs in an attempt to text?\n\nPhablets have been mainstream ever since the Samsung Galaxy Note II’s arrival in 2012, and they were subject to criticism instantly: ‘Too big,’ ‘too clunky,’ ‘can’t fit them in my skinny jeans’ pockets.’ Well guess what: smaller-sized bulges don’t flatter your figure either, my friend. Stop whining about jamming your phone in your denim slits, and just get yourself a purse or backpack.\n\nAnd then there’s the mockery. In this 2014 Telegraph article, the author describes how her HTC became known as the ‘clown phone’ in her house because, “like a clowns’ giant shoes, it somehow makes the rest of you look smaller.” She’s right — and the way I see it, that makes Lenovo the ultimate wingman. Who doesn’t want to own a phone that’s both slimming as well as practical?\n\nSo here’s my advice to all of you: rethink your phone size. You don’t necessarily need to get a Lenovo Phab Pro — the Samsung Galaxy S10+ requires equally massive hands. But trust me, once you go phablet, you’ll never want to go back to that ant-sized phone in your pocket again. Large devices mean big phone energy, and we could all use a little more of that.\n\nThis post includes affiliate links to products that you can buy online. If you purchase them through our links, we get a small cut of the revenue.\n\nFor more gear, gadget, and hardware news and reviews, follow Plugged on Twitter and Flipboard.", "description": "", "authors": ["Anouk Vleugels", "October"], "top_image": "https://img-cdn.tnwcdn.com/image/plugged?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2FUntitled-design-70.jpg&signature=0f5b77764bb5c9df7d58e9f463849fc7", "published_at": "2019-10-06"}