{"pub": "townhall", "url": "https://redstate.com/alexparker/2019/09/29/portland-bans-urinals-respect-shared-values-charges-taxpayers-200m.-plus-mind-bending-history-gender-rules", "downloaded_at": "2019-09-29 23:29:38.668301+00:00", "title": "Portland Bans Urinals to Respect ‘Shared Values,’ Charges Taxpayers $200M. Plus: A Mind-Bending History of Gender Rules", "language": "en", "text": "I’m confused.\n\nI can’t quite make out what’s happening.\n\nFirst, we were told calling out someone’s gender is wrong — waitress, waiter, etc. Then we were told gender doesn’t exist — it’s a social construct. Then we were told gender is inherent, therefore people can legally change theirs with medical confirmation. Then we were told that gender isn’t really gender at all — despite the antiquated notion of female and male — and despite the fact that the very notion of gender comes from the existence of binary biological sex — there are actually limitless genders (here).\n\nAnd though gender was initially described as a social construct and eventually fluid — therefore, meaningless — then we were told it’s punishingly important. Literally punishingly — California passed a law doling out fines and/or jail time to senior care workers who “misgender” their patients. In New York, you can be fined up to $250,000 in the misgendering department.\n\nNow here’s something even more confusing: If you strip everybody nekkid, then suddenly we’re back to just men and women.\n\nWill there ever be a transgender nudist colony? How will you know?\n\nAnd all of the above edicts, though listed serially, are somehow concurrently true.\n\nHere’s another thing: While it’s wrong for a restaurant to force women to wear skirts and men to wear pants…and while, because gender is a social construct, who’s to say a man wears slacks and a woman dresses…at the core of someone declaring themselves transgender — a medical idea — is the changing of clothing to that gender’s “socially constructed” version.\n\nSo the people who are no slaves to society are slaves to society.\n\nThough a bra isn’t for girls and a jock strap isn’t for guys, a guy identifying as a girl will put on a bra to live his truth. But if you combine all the rules, it should be true for a man to identify as a woman who doesn’t conform to the social construct. So you should be able to be a naturally-born guy and change literally nothing about your clothes or body or appearance…you should be able to still have a hairy chest and a penis and wear men’s clothes and sport a beard…and now be a woman.\n\nTo be clear, none of this is meant to be at all humorous; I’m genuinely confused, because it’s extremely complicated.\n\nAnd how does all that play into Portland doing away with urinals? And what does that have to do with gender vs. sex?\n\n“I’m not a man; I’m a woman.” “I’m not a woman or a man; I’m a banana slug.” Okay, but speaking words doesn’t change the way your pee comes out.\n\nNevertheless, the hipster town sent out an email to city employees last February regarding the remodeled public Portland Building:\n\nWe will continue to have gender-specific (male and female) multi-stall restrooms that are readily available to any employee that prefers to use one. But, there will be no urinals in any restroom in the building. This will give us the flexibility we need for any future changes in signage.\n\nTherefore, urinals are banned, even in the Men’s room. (Paris has the opposite idea — see here.)\n\nIt shouldn’t be so, but we all know it’s true: Prepare to have a whoooole lot more urine on the toilet seats.\n\nAnd how’s that lookin’ for the impending destruction of the world, and the woke fight against it (here)?\n\nAs noted by talk show host Lars Larson:\n\nFinally, in a place constantly lecturing us about protecting the environment (you know, plastic straws etc) this will waste a tremendous amount of water I checked and most urinals take as little as a pint of water per flush (1/8 gallon). Even “modern” toilets flush with more than a gallon of water. Some “no flush” urinals use no water at all. Multiply this by hundreds of thousands of flushes a year. Figure out how this makes sense.\n\nHere’s more on the Portland Building: As reported by KGW 8, every floor will have at least one any-gender restroom.\n\nThe 1st, 34th, and 15th floors will sport multi-stall bathrooms so men and women can take dumps together.\n\n‘Cause that’s what everybody wants, apparently.\n\nChief Administrative Officer Tom Rinehart, who wrote the February email, is convinced:\n\nI am convinced that this is the right way to ensure success as your employer, remove arbitrary barriers in our community, and provide leadership that is reflective of our shared values.\n\nThe total remodel will cost taxpayers $195,000,000.\n\n-ALEX\n\nRelevant RedState links in this article: here, here, and here.\n\nSee 3 more pieces from me:\n\nThe Far Left Is Making Teens Miserable Over The Imminent Destruction Of The World\n\nThink You’ve Heard The Stupidest Thing Ever? I Disagree. Witness The Woke’s New Condemnation Of IKEA\n\nA Hit-Making Music Star Announces He’s No Longer A Man\n\nFind all my RedState work here.\n\nAnd please follow Alex Parker on Twitter and Facebook.\n\nThank you for reading! Please sound off in the Comments section below.\n\nIf you have an iPhone and want to comment, select the box with the upward arrow at the bottom of your screen; swipe left and choose “Request Desktop Site.” If it fails to automatically refresh, manually reload the page. Scroll down to the red horizontal bar that says “Show Comments.”", "description": "Portland Bans Urinals to Respect ‘Shared Values,’ Charges Taxpayers $200M. Plus: A Mind-Bending History of Gender Rules", "authors": ["Alex Parker", "Elizabeth Vaughn", "Nick Arama", "Sister Toldjah", "Brad Slager", "Amelia Hamilton", "Stu Cvrk", "Brandon Morse", "Posted At Pm On September"], "top_image": "https://www.redstate.com/wp-content/uploads/2019/09/bathroom-453420_1280.png", "published_at": "2019-09-29"}