{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/hacking-hackers-russian-group-hijacked-iran-spy-operation-191021041816789.html", "downloaded_at": "2019-10-21 05:36:58.135281+00:00", "title": "Hacking the hackers: Russian group 'hijacked' Iran spy operation", "language": "en", "text": "Russian hackers piggy-backed on an Iranian cyber-espionage operation to attack government and industry organisations in dozens of countries while masquerading as attackers from the Islamic Republic, British and US officials said on Monday.\n\nThe Russian group, known as \"Turla\" and accused by Estonian and Czech authorities of operating on behalf of Russia's FSB security service, has used Iranian tools and computer infrastructure to successfully hack organisations in at least 20 different countries over the last 18 months, British security officials said.\n\nThe hacking campaign, the extent of which has not been previously revealed, was most active in the Middle East but also targeted organisations in Britain, they said.\n\nPaul Chichester, a senior official at Britain's GCHQ intelligence agency, said the operation showed state-backed hackers were working in a \"very crowded space\" and developing new attacks and methods to better cover their tracks.\n\nIn a statement accompanying a joint advisory with the National Security Agency (NSA) in the United States, GCHQ's National Cyber Security Centre said it wanted to raise industry awareness about the activity and make attacks more difficult for its adversaries.\n\n\"We want to send a clear message that even when cyber actors seek to mask their identity, our capabilities will ultimately identify them,\" said Chichester, who serves as the NCSC's director of operations.\n\nOfficials in Russia and Iran did not immediately respond to requests for comment sent on Sunday. Moscow and Tehran have both repeatedly denied Western allegations over hacking.\n\nGlobal hacking campaigns\n\nWestern officials rank Russia and Iran as two of the most dangerous threats in cyberspace, alongside China and North Korea, with both governments accused of conducting hacking operations against countries around the world.\n\nIntelligence officials said there was no evidence of collusion between Turla and its Iranian victim, a hacking group known as \"APT34\" which cybersecurity researchers at firms including FireEye say works for the Iranian government.\n\nRather, the Russian hackers infiltrated the Iranian group's infrastructure in order to \"masquerade as an adversary which victims would expect to target them,\" said GCHQ's Chichester.\n\nTurla's actions show the dangers of wrongly attributing cyberattacks, British officials said, but added that they were not aware of any public incidents that had been incorrectly blamed on Iran as a result of the Russian operation.\n\nThe United States and its Western allies have also used foreign cyberattacks to facilitate their own spying operations, a practice referred to as \"fourth party collection,\" according to documents released by former US intelligence contractor Edward Snowden and reporting by Der Spiegel, a German magazine.\n\nGCHQ declined to comment on Western operations.\n\nBy gaining access to the Iranian infrastructure, Turla was able to use APT34's \"command and control\" systems to deploy its own malicious code, GCHQ and the NSA said in a public advisory.\n\nThe Russian group was also able to access the networks of existing APT34 victims and even access the code needed to build its own \"Iranian\" hacking tools.", "description": "Western intelligence officials said no evidence of collusion between Russia group Turla and its Iranian victim.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/21/486fd83d1cdd405cbda46c8cda9f3bbf_18.jpg", "published_at": "2019-10-21"}