{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/12/lions-and-chargers-hope-to-learn-how-to-maintain-l", "downloaded_at": "2019-09-13 01:06:08.177081+00:00", "title": "Lions and Chargers hope to learn how to maintain late leads", "language": "en", "text": "DETROIT (AP) - The Los Angeles Chargers and Detroit Lions got off to solid starts in their openers, building double-digit leads in the second half before blowing them and going to overtime.\n\nLos Angeles led Indianapolis by 15 points midway through the third quarter and salvaged a victory on Austin Ekeler’s third touchdown with 5:01 left in the extra period.\n\n“You won, but there’s a still a feeling that we weren’t at our best and that’s a heavy feeling,” Chargers defensive coordinator Gus Bradley said. “In some ways it could be a good thing. I think our guys will be very focused this week.”\n\nDetroit, meanwhile, failed to keep an 18-point lead in the fourth quarter at Arizona and wound up in a tie.\n\nTo make the setback sting even more for the Lions, they made an ill-timed decision with 2:47 left. With the play clock winding down, Matthew Stafford snapped the ball just after a timeout was called and completed a third-and-5 pass that would have picked up a first down and put Detroit in a favorable position to win.\n\nStafford appeared to scream, “trust me,” on the sideline because the 11-year veteran wanted the coaches to let him manage the game.\n\n“I’m not too worried about that,” Stafford insisted days later, surrounded by reporters. “We’ve moved past it, probably better than you guys.”\n\nHere are some other things to watch when the Lions (0-0-1) host Los Angeles (1-0) on Sunday at Ford Field:\n\nON THE RUN\n\nDespite the absence of holdout Melvin Gordon, the Chargers averaged 6 yards per carry in Week 1. Justin Jackson gained 9-plus yards each time he was handed the ball, and Ekeler had 58 yards rushing. Ekeler finished with career highs in yards receiving (96), yards from scrimmage (154) and touchdowns (three) against the Colts, giving him a relative measure of fame.\n\nChargers running backs coach Alfredo Roberts had a little talk with Ekeler, trying to keep him grounded.\n\n“He said you have that cologne on,” Ekeler recalled Roberts saying. “It smells good right away, but it fades. Don’t drink it because it’s poison.”\n\nDOMINATED DT\n\nDetroit’s Damon “Snacks” Harrison, a run-stuffing defensive tackle, took the season-opening tie personally. Harrison tweeted that he was dominated at Arizona after he made only one tackle.\n\n“Anytime we don’t come out with a win and we have the type of defensive performance we had, I feel like it’s on me,” he said. “I got broad shoulders. I can take the blame.”\n\nPOSSIBLY PIVOTAL\n\nLions offensive tackle Taylor Decker is coming off a lackluster game, giving up two sacks and getting called for four penalties, and he’s on the injury report this week with a back injury. The timing isn’t good for the player who protects Stafford’s blind side because defensive ends Melvin Ingram and Joey Bosa have combined for more than 70 career sacks.\n\nROAD WARRIORS\n\nLos Angeles won its last six road games in 2018 in the regular season, including second-half comebacks at Pittsburgh and Kansas City, and eight of nine away from home dating to the 2017 season. The Chargers also won at Baltimore in the playoffs before losing on the road to New England.\n\n“That’s why you try to keep your group together because you hope to carry that over, but you just don’t know until you do it,” coach Anthony Lynn said. “When we went on the road, at least last year, it was an, ‘Us against the world,’ mentality. That’s kind of what you want.”\n\nBALANCING ACT\n\nDetroit is determined to run the ball more often, and successfully, with new offensive coordinator Darrell Bevell. He’s counting on running backs Kerryon Johnson and C.J. Anderson to control the game, taking pressure off Stafford and the passing game. Johnson and Anderson combined to run for 84 yards on 27 carries against the Cardinals, but may find more room to run in Week 2. The Chargers gave up 203 yards rushing, the second-highest total in Week 1, and allowed Marlon Mack to run for a career-high 174 yards for the Colts.\n\n___\n\nAP Sports Writer Joe Reedy in Los Angeles contributed to this report.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Los Angeles Chargers and Detroit Lions got off to solid starts in their openers, building double-digit leads in the second half before blowing them and going to overtime.", "authors": ["The Washington Times Http", "Larry Lage"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/08/lions_cardinals_football_16863_c0-152-3649-2279_s1770x1032.jpg?0bdcd4e7975d7c87b34bee20119e15a265e746e8", "published_at": "2019-09-12"}