{"pub": "yahoo", "url": "https://news.yahoo.com/three-dead-4-hospitalized-event-130016779.html", "downloaded_at": "2019-09-22 15:19:56.327080+00:00", "title": "3 dead, 4 hospitalized after event in Pittsburgh's trendy South Side Flats. All were wearing orange wrist bands", "language": "en", "text": "Three people are dead and four hospitalized after police were called to an event in Pittsburgh's trendy South Side Flats area, Public Safety Director Wendell Hissrich said Sunday.\n\nPolice earlier confirmed \"multiple hospitalizations and deaths\" after responding to a medical situation early Sunday.\n\n\"All of the victims are wearing orange paper bands on their wrists,\" Hissrich said in a statement. Police asked for information from anyone who attended or knew about a party or event where guests were given orange wrist bands.\n\nFew details on the event or the cause of the deaths were immediately available. Five of the victims were found in an apartment, one in elevator outside the apartment and one on a nearby street, police said.\n\nThose hospitalized were conditions ranging from critical to serious, police said.\n\nThe incident began about 2 a.m. with a 911 call for an unresponsive man in and apartment building, Hissrich told the Pittsburgh Tribune-Review. A short time later, another man found semi-conscious on a nearby street was traced back to the same building, where police found five more victims.\n\nIn a statement released to the Pittsburgh Post-Gazette, a public relations firm representing the apartments said the victims didn't live there.\n\n“These were acquaintances of a good standing resident, who apparently was not in the apartment at the time the individuals were found,\" the statement said. “It is our understanding that the group had attended an outside event where they may have consumed a toxic substance before returning to the apartment.”\n\nThe South Side Flats area includes a bevy of bars, restaurants and eclectic stores. East Carson Street, where the person on the street was found, runs through the heart of the district.\n\nThe investigation was continuing.\n\nThis article originally appeared on USA TODAY: Pittsburgh South Side Flats: Three dead, 4 hospitalized after event", "description": "All the victims are wearing orange paper bands on their wrists, police said. Those hospitalized were conditions ranging from critical to serious.", "authors": ["John Bacon", "Usa Today"], "top_image": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "published_at": "2019-09-22"}