{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7570043/Piers-Morgan-laughs-face-petition-sacked-transgender-100-identities-comments.html", "downloaded_at": "2019-10-14 10:16:48.615509+00:00", "title": "Piers Morgan laughs in face of petition to get him sacked over transgender 100 identities comments", "language": "en", "text": "Piers Morgan has laughed in the face of a petition calling him to be sacked from Good Morning Britain over comments he made about the transgender community\n\nPiers Morgan has laughed in the face of a petition calling him to be sacked from Good Morning Britain over comments he made about the transgender community.\n\nMusician Kennedy called for the presenter to be sacked for his 'dangerous dehumanisation of transgender and non-binary individuals'.\n\nHis petition, which now has more than 12,000 signatures, was started in response to Piers's claim he is identifying as a 'two-spirit penguin' in a debate about non-binary gender.\n\nBut despite gaining traction on social media, a counter-petition demanding Piers remain in post for his 'common sense approach to life' has now surpassed it with 25,000 signatories.\n\nGMB has also launched a poll asking whether Piers should be sacked from the programme this morning.\n\nPiers's original comments were made in September in response to a BBC film that claims there are more than 100 genders.\n\nThe GMB anchor was further infuriated by a report staff at the London Aquarium have decided the baby of a lesbian penguin couple should be raised gender neutral.\n\nMusician Kennedy called for the presenter to be sacked for his 'dangerous dehumanisation of transgender and non-binary individuals'\n\nA counter-petition demanding Piers remain in post for his 'common sense approach to life' has now surpassed it with 25,000 signatories\n\nHe responded to calls for him to be sacked on Twitter, posting: 'You can't remove me, I'm currently identifying as a penguin so it would be animal cruelty.'\n\nOn today's programme he asked: 'Why can't I be a two-spirit penguin, why can't I just decide that's what I identity as?'\n\nCo-host Susanna Reid asked if that was how is currently identifying, to which he replied: Yes, I've been a penguin for a week now.'\n\nBut he joked: 'Now I'm a penguin, I don't want anyone to be called he, she, they or them.\n\n'Because you become exclusionary to me as a penguin. I want all the language around this programme to be changed now to reflect the fact I am now identifying as a penguin.'\n\nContinuing on a more serious note he said: I'm not remotely transphobic.\n\n'I do think however having 100 genders is utter nonsense. I think it's going to be extremely dangerous to teach kids this. And I speak as a father-of-four.'\n\nTransgender broadcaster India Willoughby weighed in on the debate, quipping: ''If the petition succeeds, @PiersMorgan should be replaced by a trans woman #NoLoyaltyInThisBiz #PiersMorgan.'\n\nThe Remove Piers Morgan from Good Morning Britain petition states: 'In being an award-winning breakfast programme with a worldwide reach, one could presume that Good Morning Britain would act as an effective platform to educate the masses on these issues.\n\n'In keeping Piers Morgan as the programme's main draw, however, ITV are actively choosing to promote an insidious agenda against transgender people (and minorities in general), as through his choice of language he regularly berates and mocks those who do not identify in a way he is willing to comprehend.'\n\nBut GMB viewer Margaret Lowry decided to launch a counter petition, writing: 'Keep Piers Morgan for his common sense approach to life. He's also funny!!\n\n'He's not afraid to speak out and says what a lot of us are thinking.'\n\nPiers thanked Margaret for her support on Twitter, writing: 'Please sign it if you wish to repel the snivelling snowflakes & keep me in my job.'\n\nHe later urged his millions of followers: 'Save me as your voice against the shriekingly illiberal liberals who want to cancel everyone who dares challenge them...'", "description": "Musician Kennedy called for Piers Morgan to be sacked from Good Morning Britain for his 'dangerous dehumanisation of transgender and non-binary individuals'.", "authors": ["Lara Keay For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/06/19678780-0-image-a-27_1571032548574.jpg", "published_at": "2019-10-14"}