{"pub": "mirror", "url": "https://mirror.co.uk/news/technology-science/science/climate-change-facts-mean-must-20718994", "downloaded_at": "2019-10-25 00:47:18.367241+00:00", "title": "Climate change facts that mean we must act now to avoid devastating consequences", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nClimate change is the defining issue of our age. The world is heating up and – unless this trend is reversed – it is going to have devastating consequences.\n\nSpecies are threatened with extinction and huge areas of the world could be come uninhabitable.\n\nTackling it is going to require major changes to the way we live.\n\nThe Daily Mirror has established a special panel of experts, chaired by television presenter Chris Packham it includes Doug Parr, of Greenpeace, Dr Tamsin Edwards, of King’s College, London and science author Dr Emily Grossman and others.\n\nThey are going to help guide the Mirror’s coverage on this crucial issue and you are invited to attend a special climate session we are holding in London on November 4.\n\nEmail questions to features@mirror.co.uk with “Climate Crisis Question” in the subject.\n\n(Image: Dr Emily Grossman)\n\n(Image: PA)\n\nMirror leads fight for nature\n\nThe Daily Mirror has proud tradition of highlighting the damage humans are causing.\n\nIn 1961 our front page headline read “DOOMED” as we warned rhinos face extinction because of “man’s folly, greed and neglect.”\n\nIn 1973 we launched a campaign called “Operation Survival” to save wildlife in Great Britain. This year we reported from the Arctic Circle on impact of the melting of the ice cap.\n\nFacts that mean we must act\n\n1. The increase in ocean temperatures means that we are set to lose between 70% and 90% of the world’s coral reefs.\n\n2. Floods in the UK have become more frequent. In 2000, we had the highest level of rainfall since records began at 337.3mm, topping the 330.7mm of 2012.\n\n(Image: Adam Gerrard/Daily Mirror)\n\n(Image: Getty)\n\n3. Globally, the six warmest years on record were notched in the last seven years – and it is predicted that by 2050, the UK is facing a trebling of deaths caused by heat.\n\n4. This year saw the UK experience the hottest temperature since records began. It was 38.7C at the Cambridge University Botanic Garden on Thursday, July 25.\n\n5. A study found 68% of all extreme weather events, including droughts, flooding, hurricanes and tropical storms, were either made more likely to occur or more severe.\n\n6. Our cities are getting hotter. A rise in global temperatures of only 1.5 degrees centigrade will leave 350 million people at the risk of heat stress.\n\n7. The Arctic ice cap has shrunk in every successive decade since 1979.\n\n(Image: Getty)\n\n8. Glaciers in Central Europe, Caucasus, North Asia, Scandinavia, the Andes, eastern Africa and Indonesia are expected to lose 80% of their mass by 2100.\n\n9. More than 1.1 billion people – 17% of the population – could face life with severe shortages of water.\n\n10. Farming will suffer. If global temperatures rise by another two degrees centigrade this will see a fall in livestock production by between 7% and 10%.\n\n11. There has been a 60% decline in wildlife populations in 40 years. A report found that of 976 species, 47% of extinctions could be blamed on the effects of climate change.\n\n12. Experts predict that climate change could force between three and 16 million people into extreme poverty because of rising food prices and crop failures.\n\n13. Illegal logging, fires and deforestation have led to 20% of the Amazon rainforest vanishing in the past 50 years.\n\n(Image: Getty)\n\n(Image: North Wales Live)\n\n14. Over the past 100 years, some 50% of wetlands have been lost – with warmer climates and more severe weather believed to be primarily to blame.\n\n15. Oceans are dying, with 30% of sharks and rays and 27% of crustaceans on the brink. Rising temperatures and pollution have created 500 dead zones – areas without oxygen and life.\n\n16. According to a 2016 report by the Joseph Rowntree Foundation, climate change will cause global food prices to rise 20%.\n\n17. 800 coastal homes in the UK could be lost by 2034 says The Environment Agency. Sea levels are set to rise by 80cm by the end of the century.\n\n(Image: John Gladwin)\n\n18. The World Bank has estimated there could be 140million climate change migrants by 2050 because of high temperatures, crop failures and flooding.\n\n20. Crop failures and the increased risk of flooding could lead to mass migration across the globe.\n\n21. The World Bank has warned there could 140million climate change migrants by 2050.", "description": "TV presenter Chris Packham will lead a special panel of experts launched by the Daily Mirror as we vow to help fight climate change - and here's why it's vital we do so...", "authors": ["Jason Beattie", "Naimah Archibald-Powell", "Image", "Dr Emily Grossman", "Pa", "Adam Gerrard Daily Mirror", "Getty", "North Wales Live", "John Gladwin"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20717879.ece/ALTERNATES/s1200/1_A-huge-Iceberg-close-to-Qaanaaq.jpg", "published_at": "2019-10-24"}