{"pub": "atlantic", "url": "https://theatlantic.com/entertainment/archive/2019/10/parasite-and-curse-closeness/600385", "downloaded_at": "2019-10-22 14:01:55.091517+00:00", "title": "Parasite and the Curse of Closeness", "language": "en", "text": "In the film, the economic gap between two people becomes clearest in the moments of greatest intimacy. When the Parks first hire Kim Ki-woo (Choi Woo-shik) as an English tutor for their daughter, he is welcomed into her bedroom. As a maid, Ki-woo’s mother, Chung-sook (Jang Hye-jin), is allowed within earshot of the family’s quarrels and gossip. The rich outsource their most basic needs to the poor, who need the income, and the tight connections created by this exchange tend to be self-reinforcing. Because Mrs. Park hires only through recommendations, Ki-woo is able to smuggle his sister, Ki-jung (Park So-dam), into the Park household as an art tutor; Ki-jung then secures a job as a driver for their father, Ki-taek (Song Kang-ho), who brings in his wife as a housekeeper. “I don’t trust anyone anymore,” Mrs. Park confesses at one point, though her fear only makes her more vulnerable to the Kims’ deception.\n\nAfter Bong’s successful foray into English-language films with Snowpiercer and Okja, many critics have called Parasite, shot entirely in South Korea, a “homecoming.” Indeed, his portrayal of universal economic themes draws specifically from this setting. The city of Seoul is home to some 10 million people, and its greater metropolitan area houses 25 million—or half of the country’s population. Seoul’s density at more than 40,000 people per square mile ranks among the highest in the world, which means that while some corners of the city afford anonymity, few offer privacy. In Parasite, as in Bong’s greater cinematic universe, subterranean spaces such as basements and bunkers make for critical settings. In a city where land is scarce and much of life is vertically stacked, people have to find ways of inhabiting the spaces in between.\n\nRead: How Bong Joon-ho invented the weird world of ‘Parasite’\n\nWhen I spoke to Bong earlier this year, he mentioned two stories to illustrate his fascination with the underground. The first was about Josef Fritzl, an Austrian man who was discovered to have locked up and abused his daughter in a basement for 24 years; the second was about English civilians surviving German air-raids during World War II by hiding out in bunkers. “Both feelings—life and death—are present in basements,” Bong told me. The most important twist in Parasite hinges on what dwells in the cavernous space below the Parks’ home. When this hidden place is revealed, the two feelings that Bong identified with basements are exposed to the light. And the suspicion of the rich—that they will never fully elude the poverty and violence of their society—is proven true.\n\nThe anxieties of proximity explored in Parasite are rooted in South Korea’s past. The first half of the 20th century in the country was marked by brutal Japanese occupation and the devastation of the Korean War. But since the 1960s, the gross national income per capita in South Korea has risen from $120 to $30,600. This rapid economic growth, which was driven by a handful of family-owned companies known as chaebol, relied on extensive government support for enterprises deemed most likely to succeed. The development strategy of rewarding the moneymakers has neither the scholarly propriety of supposed meritocracies based on exams nor the implied inescapability of heredity and, after nearly 60 years, this approach remains embedded in the country’s economic policy.", "description": "Bong Joon-ho’s film depicts a class system in which the most profound harms result from the relationships of interdependence between rich and poor.", "authors": ["Bo Seo"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/The_Kim_Family_Woo_sik_Choi_Kang_ho_Song_Hye_jin_Jang_So_dam_Park_in_Parasite._Courtesy_of_NEON_CJ_Entertainment_1/facebook.jpg?1571602380", "published_at": "2019-10-22"}