{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/wales-south-africa-team-news-semi-final-rugby-world-cup-2019-leigh-halfpenny-liam-williams-a9170351.html", "downloaded_at": "2019-10-25 16:10:33.292411+00:00", "title": "Rugby World Cup 2019: No cause for concern as Leigh Halfpenny steps in to fill Liam Williams’ shoes", "language": "en", "text": "On a wet and sodden Friday morning in Tokyo, it seemed only natural that the news coming out of the Welsh camp was as miserable in nature: Liam Williams’ Rugby World Cup was over.\n\nThe full-back, who has been the embodiment of consistency and reliability here in Japan, will now miss Sunday’s semi-final showdown with South Africa as well as the final or third-place play-off that follows.\n\nConfirmation of Williams’ unavailability will have hit hard, the Saracens man sustaining an ankle injury in “an accidental collision” during training. “His prognosis will be established in the forthcoming days,” the Welsh Rugby Union said in a statement on Friday morning. “No replacement has been called up at this stage.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn Williams, the Welsh have lost a crucial component to their kick-and-chase game. The 28-year-old is assured as they come under the high ball, a towering presence with a safe pair of hands to match. His absence will surely enforce a change in tact from Warren Gatland, who may be less willing to adopt the aerial approach in exploiting the Springboks’ backline and attempting to pin them back deep in their own territory.\n\nBut more than this, Wales have also lost a penetrative attacking edge from their midfield. Williams brings a creative spark to the Welsh backline that enables the side to break the game line, with the full-back exceptional in surging from deep, gliding past defenders and making vital gains on the front foot.\n\nShape Created with Sketch. Wales vs South Africa: Warren Gatland's starting XV Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Wales vs South Africa: Warren Gatland's starting XV 1/15 Wyn Jones AFP via Getty Images 2/15 Ken Owens AFP via Getty Images 3/15 Tomas Francis AFP via Getty Images 4/15 Jake Ball Getty Images 5/15 Alun Wyn Jones Getty Images 6/15 Aaron Wainwright AFP via Getty Images 7/15 Justin Tipuric Getty Images 8/15 Ross Moriarty Getty Images 9/15 Gareth Davies AFP via Getty Images 10/15 Dan Biggar AFP via Getty Images 11/15 Josh Adams AFP via Getty Images 12/15 Hadleigh Parkes AFP via Getty Images 13/15 Jonathan Davies AFP via Getty Images 14/15 George North Getty Images 15/15 Leigh Halfpenny PA 1/15 Wyn Jones AFP via Getty Images 2/15 Ken Owens AFP via Getty Images 3/15 Tomas Francis AFP via Getty Images 4/15 Jake Ball Getty Images 5/15 Alun Wyn Jones Getty Images 6/15 Aaron Wainwright AFP via Getty Images 7/15 Justin Tipuric Getty Images 8/15 Ross Moriarty Getty Images 9/15 Gareth Davies AFP via Getty Images 10/15 Dan Biggar AFP via Getty Images 11/15 Josh Adams AFP via Getty Images 12/15 Hadleigh Parkes AFP via Getty Images 13/15 Jonathan Davies AFP via Getty Images 14/15 George North Getty Images 15/15 Leigh Halfpenny PA\n\n“He’s undoubtedly a big loss from an attacking perspective and what he’s achieved in the last year,” Gatland said in his press conference ahead of the clash in Yokohama. Williams has enjoyed a stellar 12 months on the pitch, securing the Grand Slam with Wales before later lifting the European and Premiership crowns with Saracens. The full-back has been in the form of his life, and there’s no doubt he’ll be sorely missed.\n\nBut with Leigh Halfpenny stepping into the fray, Wales can rest assured that they will not head into Sunday’s match vulnerable. “Defensively, he’s the best full back in the world in his aerial game and coverage,” Gatland said of the Scarlets player. “It is a change, but we don’t think that we are weakening the side in any way with the changes we have made.”\n\nThe Kiwi also revealed that serious consideration had been given to starting Halfpenny at 15 for the match anyway and moving Williams to the wing. “We had a long debate about whether we started Leigh in the first place and move Liam to the wing,” said Gatland.\n\nHalfpenny’s defensive qualities will undoubtedly strengthen Wales’ hand when under pressure from the Springboks and the boot of Handre Pollard. The 30-year-old reads the game superbly, in anticipating the high ball and providing sweeping cover, and for all his size packs a punch in the air.\n\nHis point kicking brings another dimension to Sunday’s match, though Gatland said Dan Biggar would continue to lead on this front. “Dan Biggar will be kicking,” he said. “He was originally in the side so we’ll continue to that. If anything comes at around 50 or 55 metres then Leigh will step up for that.”\n\nIndeed, fans will remember the sight of Halfpenny’s long-distance kick in the 2011 semi-final, one that would have secured victory, falling agonisingly short against the French. Perhaps, in a strange twist of fate, Sunday can offer the full-back the chane to make amends for such heartbreak.\n\nHowever, given Halfpenny’s limitations on the counter-attack, the emphasis now falls on Jonathan Davies and Hadleigh Parkes to step up to the mark in making those puncturing runs through the channels – no easy feat when faced with Lukhanyo Am and Damian de Allende on the other side of the tape. Questions have lingered for a while over the creativity of the Welsh midfield, though Gatland’s men will be able to draw confidence from that opening 20-minute spell against Australia last month when the backs were ruthlessly incisive.\n\nThey key, now, is making the most of Halfpenny in those spells of attacking verve and vim. As a player who started his international career on the wing, scoring seven tries in his first 13 Tests, the full-back remains a threatening force – just a different one to that of Williams.\n\nBut for all the drama of the past few days, with Josh Navidi another to be ruled out for the remainder of the World Cup, Gatland remains overwhelmingly optimistic of taking the Welsh to a first-ever final. “I’ll always believe something is possible,” he added on Friday. “If you don’t have that attitude and portray it, then it’ll never happen.\n\n“That’s probably been a big part of the success. You have to have the desire and belief you can do something special.”", "description": "On a wet and sodden Friday morning in Tokyo, it seemed only natural that the news coming out of the Welsh camp was as miserable in nature: Liam Williams’ Rugby World Cup was over. The full-back, who has been the embodiment of consistency and reliability here in Japan, will now miss Sunday’s semi-final showdown with South Africa as well as the final or third-place play-off that", "authors": ["Samuel Lovett"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/25/03/halfpenny.jpg", "published_at": "2019-10-25"}