{"pub": "yahoo", "url": "https://finance.yahoo.com/news/nike-air-force-1-comeback-143414125.html", "downloaded_at": "2019-10-22 14:02:51.693351+00:00", "title": "Behind the massive comeback of Nike's iconic Air Force 1", "language": "en", "text": "If sneakerheads had to pick a shoe that most represented the essence of the sneaker game — Nike’s (NKE) Air Force 1 would arguably be that shoe. The sneaker, named after the presidential plane, has been immortalized in TV, film, and music for years. In 2002, it even got its own song, courtesy of multi-platinum recording artist Nelly. Not only is the shoe iconic, but it’s also profitable — and its recent resurgence is now boosting sales for the swoosh brand.\n\nBank of America Merrill Lynch recently upgraded its rating for Nike from Underperform to Neutral. The bank says that Nike’s F1Q20 EPS upside was led by the brand’s non-technical “sportswear” businesses, which includes the Tech Fleece and the Air Force 1 franchise.\n\nCalling the Air Force 1 a flop might sound blasphemous to sneakerheads today — but there was, in fact, a time when the Nike icon sat on shelves. The Air Force 1 is classified as an athleisure shoe, but when it debuted in 1982, it was actually a basketball sneaker worn by some of the NBA’s best big men. However, success among NBA players did not translate to sales success. Just two years after its release, the Air Force 1 was slated to be discontinued. That’s when the city of Baltimore came to the Air Force 1s rescue.\n\nGraphic: David Foster/Yahoo Finance More\n\n\n\n\n\nThe sneakers were so popular there that the owners of three shoe stores convinced Nike to keep making them. Nike returned the favor in 2017 when it released a limited-edition Special Field Air Force 1 Mid “For Baltimore” and placed a commemorative plaque outside one of the stores.\n\nNike Air Force 1 Baltimore More\n\nNike plaque More\n\nHarlem is another region where the Air Force gained legendary status. So much so that the shoe would be tagged with one of its more popular nicknames — the “Uptowns,” paying homage to the neighborhood’s northern location in the Big Apple.\n\nStepping up production\n\nAccording to BofAML, Nike is stepping up its production of the Air Force 1s. Its popularity is apparent online, as BofAML notes it’s the fastest-growing sneaker style according to social media posts. The model also ranks No. 4 when it comes to most Instagrammed shoes.\n\nGraphic: David Foster/Yahoo Finance More", "description": "Nike's iconic Air Force 1 sneakers continue to play a key role in the swoosh brand's success.", "authors": ["Reggie Wade"], "top_image": "https://s.yimg.com/uu/api/res/1.2/anapfPZck4DJcJA_NajEdQ--~B/aD0zNjExO3c9NTI0NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/a0500250-efc3-11e9-bf7f-5bf08509d479", "published_at": "2019-10-19"}