{"pub": "breitbart", "url": "https://breitbart.com/news/arab-foreign-ministers-slam-turkish-aggression-in-syria", "downloaded_at": "2019-10-12 16:06:51.858782+00:00", "title": "Arab foreign ministers slam Turkish ‘aggression’ in Syria", "language": "en", "text": "Cairo (AFP) – Arab foreign ministers on Saturday condemned Turkey’s “aggression” in Syria where it is pressing an offensive against Kurdish forces, calling for an immediate withdrawal of Ankara’s troops.\n\nThe statement came after an emergency session of the Arab League in Cairo called for by Egypt to discuss Turkey’s assault on the Kurds, who have carved out a fragile semi-autonomy in Syria’s northeast.\n\nThe deadly offensive launched Wednesday has sparked broad international condemnation and threats of sanctions.\n\nArab League chief Ahmed Aboul Gheit slammed the Turkish attack as an “invasion of an Arab land”.\n\nThe ministers called for “ending the aggression and the immediate and unconditional withdrawal of Turkey from all of Syria’s land”, the statement said.\n\nThe group said Ankara’s offensive was a “direct threat to Arab national security”, adding they would consider “urgent measures to confront the Turkish aggression”.\n\nThe potential responses included diplomatic and economic actions, as well as “military cooperation to confront the Turkish aggression”, the statement said.\n\nThe foreign ministers of Iraq and Lebanon also called for Syria’s Arab League membership to be unfrozen.\n\nDamascus has been suspended from the pan-Arab bloc since 2011 over its bloody crackdown on protestors.\n\nThe Kurds served as the main ground partner in the US-led fight against the Islamic State group in Syria, where they overran the last scrap of the jihadists’ “caliphate” in March.\n\nTurkey says the main Kurdish militia in Syria is a “terrorist” group with links to its own Kurdish insurgency.\n\nAnkara’s military campaign appeared almost inevitable after President Donald Trump announced Sunday that US troops deployed in northern Syria were pulling back from the border.", "description": "Cairo (AFP) – Arab foreign ministers on Saturday condemned Turkey’s “aggression” in Syria where it is pressing an offensive", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/12/cc1552_arab-league-holds-an-emergency-meeting-turkish-offensive-in-syria-on-12-640x335.jpg", "published_at": "2019-10-12"}