{"pub": "cnn", "url": "https://bleacherreport.com/articles/2855386-melvin-gordons-financial-cost-of-contract-holdout-revealed-amid-return-rumors?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-09-26 14:57:04.485972+00:00", "title": "Melvin Gordon's Financial Cost of Contract Holdout Revealed amid Return Rumors", "language": "en", "text": "Kelvin Kuo/Associated Press\n\nWith running back Melvin Gordon reportedly set to return to the Los Angeles Chargers, ESPN's Adam Schefter revealed the financial implications of his holdout.\n\nSchefter noted that Gordon will lose over $2 million between fines and missed game checks:\n\nOn Wednesday, Schefter reported that Gordon had contacted the Chargers and informed them he would report to the team Thursday.\n\nGordon is in the final year of his contract and can become a free agent at the conclusion of the 2019 season.\n\nThe 26-year-old is coming off arguably his best NFL season, as he rushed for 885 yards and 10 touchdowns while catching 50 passes for 490 yards and four touchdowns in 12 games. He also averaged a career-high 5.1 yards per carry after failing to reach the 4.0 mark in any of his first three seasons.\n\nAlthough the Bolts are off to a somewhat disappointing 1-2 start, running back play hasn't been the issue.\n\nAustin Ekeler has moved into a featured role with Gordon out and has thrived with 160 rushing yards and two touchdowns as well as 19 receptions for 208 yards and two additional scores.\n\nChargers head coach Anthony Lynn said Wednesday that Gordon will not play against the Miami Dolphins in Week 4 even if he does return this week, meaning Ekeler would have one more week as the clear No. 1 back, with Justin Jackson lending support.\n\nGiven how much success Ekeler has enjoyed during Gordon's absence and the fact that he may be L.A.'s featured back next season if Gordon leaves via free agency, the 24-year-old still figures to have a big role even with Gordon in the fold.\n\nSince Gordon is a bigger and more powerful back, the 6'1\", 215-pounder should be used in short-yardage and goal-line situations, but the 5'10\", 200-pound Ekeler is an elite pass-catcher out of the backfield and should still receive his fair share of snaps in all situations, especially on third downs.\n\nIt can be argued that Ekeler's presence is among the reasons for L.A.'s reluctance to make Gordon one of the NFL's highest-paid running backs, but if he can put up big numbers upon his return, he will have a chance to land a big contract elsewhere on the open market.", "description": "With running back  Melvin Gordon  reportedly set to return to the  Los Angeles Chargers , ESPN's Adam Schefter revealed the financial implications of his holdout...", "authors": ["Mike"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/830/084/hi-res-f721695307b0908d224322ff038527ce_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-09-26"}