{"pub": "washingtonpost", "url": "https://washingtonpost.com/history/2019/10/08/tulsa-searches-mass-graves-race-massacre-that-left-hundreds-black-people-dead", "downloaded_at": "2019-10-08 11:39:10.029056+00:00", "title": "Tulsa searches for graves from 1921 race massacre that left hundreds of black people dead", "language": "en", "text": "The cemetery, which is owned by the city, is just a few blocks from what is known as Black Wall Street. It is also the site where, in 1999, renowned forensic anthropologist Clyde Snow led a team of scientists who discovered an anomaly bearing “all the characteristics of a dug pit or trench with vertical walls and an undefined object within the approximate center of the feature,” the Tulsa Race Riot Commission concluded in its 2001 report.\n\nAD\n\nAD\n\nAlong with testimony from a witness of the massacre, the report said, “this trench-like feature takes on the properties of a mass grave.” The commission recommended excavation, but the city decided not to dig for physical evidence.\n\nLast year, Mayor G.T. Bynum (R) announced that he would reopen the investigation into mass graves, calling it a murder investigation. The announcement followed a Washington Post story about the unresolved questions surrounding the massacre.\n\n“We owe it to the community to determine if there are mass graves in our city,” Bynum told The Post at the time. “We owe it to the victims and their family members.”\n\nThe city is obligated to find out what happened in 1921 as Tulsa prepares to mark the 100th anniversary of the rampage, he said.\n\nAD\n\nTulsa mayor reopens investigation into possible mass graves from 1921 race massacre\n\n“If you get murdered in Tulsa, we have a contract with you that we will do everything we can to find out what happened and render justice,” he said. “That’s why we are treating this as a homicide investigation for Tulsans who we believe were murdered in 1921.”\n\nFor decades, few people in Tulsa spoke about the massacre, which began May 31, 1921, when a white mob descended on Greenwood, a prosperous business district often called Black Wall Street.\n\nAD\n\nIn 48 hours, the mob burned hundreds of black-owned businesses and homes, killing more than 300 black people and leaving more than 10,000 homeless. Men, women and children were gunned down in the street. Some black people were shot while trying to escape burning houses.\n\nAD\n\n‘They was killing black people’: A century-old race massacre still haunts Tulsa\n\nBlack and white survivors of the massacre recounted seeing bodies tossed into mass graves.\n\nThe city said in a statement that it would use ground-penetrating radar to investigate Oaklawn Cemetery, Newblock Park, and Rolling Oaks Memorial Gardens, which was once known as Booker T. Washington Cemetery.\n\nDeputy Mayor Amy Brown said the city had established a public oversight committee to oversee the investigation. It is made up of historians and scholars, including Scott Ellsworth, author of “Death in a Promised Land: The Tulsa Race Riot of 1921.”\n\nAD\n\nThe investigation team consists of archaeological geophysicists and archaeologists. The city hopes to finish the ground-penetration radar investigation by December or January.\n\nAD\n\nIf the city finds evidence of mass graves, city officials and the oversight committee will decide whether to excavate. The Oklahoma medical examiner’s office would lead the investigation into determining the cause of death.\n\n“The cause of death determination would be an important step in the investigation as remains will be close to 100 years old and a Spanish influenza outbreak occurred in Tulsa in 1919 prior to the race massacre in 1921,” the city said in a statement.\n\nIf there are mass graves linked to the massacre, the city plans to work with the oversight committee to decide the “next steps as it relates to storing remains, DNA testing and genealogical research, and commemorating the grave sites and honoring the remains.”\n\nOn Monday, Kristi Williams, an activist and oversight committee member, watched as the radar investigation in Oaklawn Cemetery got underway. “We want full transparency, reparations and justice,” she said.\n\nAD\n\nAD\n\nTulsa City Councilor Vanessa Hall-Harper was also on site for the start of the investigation, which she repeatedly demanded.\n\n“I hope they find what we know is there,” Hall-Harper said. “I hope they find the mass graves. We know hundreds of people, perhaps thousands, were murdered. Something was done with their bodies. We hope to get to the truth of where some victims of the massacre were dumped, and ultimately, we will lay them to rest.”\n\nRead more Retropolis:\n\nWhen Portland banned blacks: Oregon’s shameful history as an ‘all-white’ state\n\nThey were once America’s cruelest, richest slave traders. Why does no one know their names?\n\nThe day 30,000 white supremacists in KKK robes marched in the nation’s capital\n\nDeath of ‘a devil’: The white supremacist got hit by a car. His victims celebrated.\n\nAD", "description": "The rampage was one of the worst episodes of racial violence in U.S. history, and there have long been reports that bodies were dumped in mass graves", "authors": ["Deneen L. Brown", "Local Enterprise Reporter"], "top_image": "https://www.washingtonpost.com/resizer/VvvOtgf3maGeyNYe0odAm672ebQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WMQMTUHJJYI6TEYGI7FQGJH5IQ.jpg", "published_at": "2019-10-08"}