{"pub": "rt", "url": "https://rt.com/russia/470709-plane-gun-russia-emergency-landing", "downloaded_at": "2019-10-11 19:50:41.765327+00:00", "title": "Russian man forgets to check in his gun & brings it on plane unhindered", "language": "en", "text": "Sheremetyevo, Moscow’s largest airport, is carrying out an internal probe after a passenger was able to bring a gun on a plane. Luckily, the man had no ill intent, but just forgot to leave the weapon with his other luggage.\n\nA stewardess of Russia’s flagship carrier Aeroflot must have been quite shocked when a passenger called her over and handed her a gun and two pieces of ammunition as the plane was flying 8,000 meters above ground.\n\nThe man, who suffers from asthma, opened his bag to get out his meds, and to his surprise discovered his gun there. He hurried to inform the crew that he forgot to leave the weapon at check-in.\n\nWhen the captain was told, he immediately decided to make an emergency landing to “assure the safety of air transportation.”\n\nAlso on rt.com Submerged cars & barefoot airline crews as rain hits doorstep of Moscow’s largest airport\n\nThe plane, which was traveling from Moscow to the Bulgarian resort of Burgos, landed in the city of Rostov-on-Don in southern Russia on Thursday.\n\nThe gun owner was escorted to the police station where his weapon was seized pending an enquiry. It turned out that the man had all the papers needed to carry a Russian-made two-charge Strazhnik non-lethal handgun.\n\nHowever, an administrative case regarding violation of weapon transportation rules was launched against him. The plane was able to continue its flight after a delay.\n\nAeroflot pointed out that it was not to blame for the incident, and that preflight inspections are the responsibility of the airport of departure – Sheremetyevo.\n\nSheremetyevo International Airport is one of four air hubs servicing the Russian capital. The largest airport in the country, it serviced 48.5 million passengers in 2018.\n\nIn August, it was ranked best airport in the world by UK-based luggage service provider Stasher, beating the likes of London’s Heathrow, Amsterdam’s Schiphol, and New York’s JFK in terms of accessibility, food and lodging quality, parking costs, and waiting time.\n\nAlso on rt.com Moscow’s Sheremetyevo rated world’s best airport; New York’s JFK, one of the worst\n\nThink your friends would be interested? Share this story!", "description": "Sheremetyevo, Moscow’s largest airport, is carrying out an internal probe after a passenger was able to bring a gun on a plane. Luckily, the man had no ill intent, but just forgot to leave the weapon with his other luggage.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5da083ab2030271b8a2f0300.jpg", "published_at": "2019-10-11"}