{"pub": "wsj", "url": "https://wsj.com/articles/tunisians-cast-votes-for-president-11568567280?mod=rsswn", "downloaded_at": "2019-09-15 23:10:31.773177+00:00", "title": "Tunisians Cast Votes for President", "language": "en", "text": "TUNIS—Tunisians voted Sunday in their second free presidential election since the uprising that toppled an autocratic regime in 2011, consolidating the country’s position as the only democracy to survive the years of revolution and war following the Arab Spring.\n\nVoters are choosing among some two dozen candidates in a wide-open contest that comes at a moment of resurgent democratic movements across North Africa. Months of protests forced the removal of the authoritarian leaders of Sudan and Algeria earlier this year.\n\nTunisians went to the polls knowing their democratic system had survived when their neighbors’ had fallen. In the years since the 2011 revolts, countries like Syria, Libya and Yemen have been consumed by war. Egypt’s brief experiment with democracy ended with a military coup in 2013.\n\n“For all Tunisians, elections are a dream that came true. It’s still a dream for other Arab countries,” said Moez Bouzouita, 32 years old, a math teacher in the capital Tunis who cast his vote at a school on Sunday morning.\n\nThe election results are expected by Tuesday. If no candidate wins a majority, the top two candidates will stand in a runoff in the coming weeks.\n\nThe voting follows a wild presidential campaign after the death in July of former President Beiji Caid Essebsi, a former member of the old autocratic regime who nonetheless guided the transition to democracy in the years following the ouster of former President Zine Abidine Ben Ali in 2011.\n\nFormer President Essebsi hadn’t planned on seeking re-election before his death. His widow, Chadlia Caid Essebsi, died on Sunday, election day, the Tunisian president’s office said.\n\nAmong those running in the election are Prime Minister Youssef Chahed, moderate Islamist leader Abdel-Fattah Mourou and media mogul Nabil Karoui who is campaigning from prison after he was arrested in August on tax-evasion and money-laundering charges that his campaign rejects, accusing the government of using the justice system to sideline him from the election.\n\nMr. Karoui claimed the largest share in some opinion polls before the election, but no single candidate has managed to dominate the campaign, making the race one of the Middle East’s most unpredictable elections in the years since the 2011 protests. The lively campaign, including televised debates and boisterous rallies by various candidates, captured the public’s attention in recent weeks.\n\nMr. Karoui’s arrest in August thrust the campaign into chaos, and Tunisian officials haven’t said what would happen if he were to win the election while still in detention.\n\nIn Tunisia’s system of government, executive power is split between the president and prime minister, with the president in charge of signing laws, setting foreign policy and making key appointments such as the head of the central bank.\n\nThough Tunisia emerged from the 2010-2011 uprising with freedom of expression and some democratic institutions, the country’s economy has struggled. Fiscal and political reforms have been slow to materialize.\n\nFollowing years of budget cuts called for under an International Monetary Fund loan program, the economy is growing at a stagnant 1.2%. Job creation has failed to meet the needs of the population, and nearly 35% of Tunisian young people are unemployed, with many choosing to leave for Europe, North America and elsewhere.\n\n“I’m not optimistic about the next 10 years. We’re not going to be Singapore,” said Nassim Safi, 32, a construction-company employee in Tunis.\n\nBut many Tunisians are proud of their right to vote and refuse to compromise on democratic rights despite recent economic hardships, said Les Campbell, a co-leader of an election observer mission by the National Democratic Institute and the International Republican Institute, two nongovernmental groups based in Washington.\n\n“There is still a strong belief that by exercising their hard-fought right to vote they can realize the change they want,” Mr. Campbell said.\n\nWrite to Jared Malsin at jared.malsin@wsj.com", "description": "Tunisians voted Sunday in their second free presidential election since the uprising that toppled an autocratic regime in 2011, consolidating the country’s position as the only democracy to survive the years of revolution and war following the Arab Spring.", "authors": ["Jared Malsin", "Jared.Malsin Wsj.Com"], "top_image": "https://images.wsj.net/im-107275/social", "published_at": "2019-09-15"}