{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/9/elizabeth-warren-vows-no-big-dollar-fundraisers-or", "downloaded_at": "2019-10-09 22:11:51.593506+00:00", "title": "Elizabeth Warren vows no 'big-dollar fundraisers' or 'bazillionaire' bucks to defeat Trump", "language": "en", "text": "“Bazillionaires” be warned — Sen. Elizabeth Warren says she doesn’t want your campaign cash in 2020.\n\nThe Massachusetts Democrat told CBS this week that she will shun fundraisers and deep-pocketed donors in a head-to-head match-up with President Trump should she win the party’s nomination.\n\nMrs. Warren made the remark Wednesday after the network’s Zak Hudak asked her about a strategic “pivot” in the general election.\n\n“No, I will not be forced to make changes in how I raise money,” she replied. “Look, for me, this is pretty straightforward. Either you think democracy works and electing a president is all about going behind closed doors with bazillionaires and corporate executives and lobbyists and scooping up as much money as possible. Or you think it’s about a grass-roots, let’s build this from the ground up.”\n\nMr. Hudak was skeptical of the campaign promise.\n\n“Can you guarantee your supporters that under no circumstances, no matter how much money Donald Trump is raising, you will not take big dollar,” he began.\n\n“Yeah, I’m not going to go do the big-dollar fundraisers,” Mrs. Warren interjected, Mediaite reported. “I’m just not going to do it.”\n\nRecent polls show the senator edging former Vice President Joseph R. Biden in the race to represent Democrats on the national stage.\n\nMrs. Warren leads Mr. Biden 29% to 26% in a Quinnipiac University poll released Tuesday.\n\nShe also comes out on top in a Real Clear Politics average by .2% for the first time since the site began tracking candidates in December 2018.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "\"Bazillionaires\" be warned -- Sen. Elizabeth Warren says she doesn't want your campaign cash in 2020.", "authors": ["The Washington Times Http", "Douglas"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/04/Election_2020_Warren_77348.jpg-3404a_c0-125-3000-1874_s1770x1032.jpg?f52fad753beb582a85b1710fc9f6c2ec1ddbd99f", "published_at": "2019-10-09"}