{"pub": "washingtontimes", "title": "Trump officials rip reporters for misinformation on citizenship story", "url": "https://washingtontimes.com/news/2019/aug/29/department-of-homeland-security-officials-slam-rep", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:21:55.742359+00:00", "text": "Department of Homeland Security officials chided reporters Thursday for bungling a story on changes to the definition of residence in citizenship guidelines, leaving many Americans wrongly convinced the Trump administration was tweaking birthright citizenship.\n\nThe new guidance, issued Wednesday, applies to an estimated 20 to 25 cases a year of children born outside the U.S. whose parents aren’t citizens at the time, and therefore aren’t automatic citizens. It applies to cases in which the children later end up with a citizen parent — possibly through the children’s adoption or naturalization of the parents.\n\nThose children used to be deemed citizens through one part of immigration law. Now they’ll have to certify citizenship through another part of the law, which officials said requires different paperwork — though they insisted nobody is being stripped of rights.\n\n“This update does not affect birthright citizenship to the military or to anyone else,” an official at U.S. Citizenship and Immigration Services told reporters Thursday, a day after the guidance caused a stir.\n\nNews reports on Wednesday suggested the change was much broader, denying automatic citizenship to children born to U.S. troops stationed abroad.\n\nThat’s just not true, the USCIS official said.\n\n“A former Marine myself, I know the sacrifices our military service members endure,” said the official, whom the agency insisted not be named as he briefed reporters on the changes. “The idea this policy negatively impacts or takes anything away from them is incorrect.”\n\nAnother USCIS official chided those who got it wrong.\n\n“It’s easy to distort what’s actually happening here, which I think has happened in the last day or so,” he said.\n\nThe officials acknowledged the 11-page policy was complicated, and USCIS was slow to explain the intricacies of the change, leaving a media industry already skeptical of the Trump administration’s motives to overstate what was happening.\n\nOne reporter tweeted out a key quote from the USCIS announcement but cut it off before the critical portion where the agency detailed the alternate route available to obtain citizenship for the couple dozen children a year who might be affected.\n\nThat reporter’s tweet ignited a fury of follow-ups from other reporters who also misconstrued matters.\n\nMany of them later clarified or deleted their tweets, and story headlines were changed — but the misinterpretation had already traveled halfway around the globe while the accurate information was still putting on its shoes.\n\nThe hashtag #TRUMPHATESMILITARYFAMILIES trended on some websites and on Reddit.com, which bills itself at the front page of the internet, speculation on the administration’s decision-making ran wild after someone posted a Military.com story headlined “Children of U.S. troops born overseas will no longer get automatic American citizenship.”\n\n“I hope Trump voters are happy. As a service member this is APPALLING,” wrote one poster.\n\n“I don’t understand what his purpose is here, or who he’s trying to appeal to,” another wrote.\n\nThe USCIS officials said they had no choice.\n\nThey said the State Department has long held the other interpretation of which section of law must be used — and it was refusing to issue passports in those cases.\n\nUSCIS said also it concluded the State Department’s interpretation was more correct, so the agency had to switch.\n\nOne of the USCIS officials who briefed reporters said he would have preferred to keep their version, but that wouldn’t withstand scrutiny.\n\n“If I could change the law to our interpretation I would happily do so. The fact of the matter is it’s just not what the statute says,” he said.\n\nThe changes could apply in a few cases, such as when a child is born to non-citizen parents overseas, then adopted by U.S. citizen government employees. Another case could involve parents who are legal permanent residents working for the U.S. government at the time of a child’s birth, but they naturalize after the child was born or they had naturalized beforehand but hadn’t accrued enough residency.\n\nOfficials could not say how many of the 20-25 cases a year that may fall under the new guidelines applied to each case.\n\nReporters who changed their stories to correct their misinterpretations seemed to blame the government agency for their confusion, saying the administration needed to clarify its guidance after the erroneous news reports came out.\n\n“The firestorm was created by the confusion you all created,” CNN anchor Dana Bash told USCIS acting chief Ken Cuccinelli as she interviewed him Thursday.\n\nMr. Cuccinelli acknowledged the situation is complicated, but said that’s the nature of immigration law in this area, and the confusion was born out of reporting, not the policy.\n\n“Congress set these rules, we didn’t set the rules. We’ve been breaking the rules to make it easier for people, and then they couldn’t get their passport,” he said.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Department of Homeland Security officials chided reporters Thursday for bungling a story on changes to the definition of residence in citizenship guidelines, leaving many Americans wrongly convinced the Trump administration was tweaking birthright citizenship.", "authors": ["The Washington Times Http", "Stephen Dinan"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/29/8_292019_immigration-citizenship8201_c0-105-2517-1572_s1770x1032.jpg?7d77e72f084abdb38e07cde0f45ccad8be8c82ef"}