{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7613761/Google-finally-explains-glitch-bricked-Home-Home-Mini-devices.html", "downloaded_at": "2019-10-25 17:11:32.977841+00:00", "title": "Google finally explains glitch that bricked Home and Home Mini devices", "language": "en", "text": "Users have complained of bricked Home devices since the end of last month\n\nThe tech giant says it will replace affected units regardless of warranty\n\nGoogle has apologised to its customers after a 'firmware update' broke many Google Home and Google Home Mini devices.\n\nThe tech giant has said that it is working on a fix, and will replace all devices that have been affected by the issue.\n\n‘We are aware that a small number of Google Home and Google Home Mini devices are affected by an issue that causes the device to stop working,’ Google said in a statement provided to 9to5Google.\n\nGoogle has said that it is working on a fix, and will replace all devices that have been affected by the issue\n\nGoogle will be replacing all units of the smart home devices regardless of whether they are covered under warranty.\n\nThe company will also start rolling out a fix 'soon' that will prevent the issue from happening on other devices in the future, it said on Tuesday.\n\nGoogle Home owners have taken to forums over the last month to complain about the lack of responsiveness from their devices, which were stuck with all four lights showing.\n\nA Google community specialist responded to customers at the end of September, apologising for the issue and offering troubleshooting steps, with users advised to proceed with a factory reset if the steps were ineffective.\n\nGoogle will be replacing all units of the smart home devices regardless of whether they are covered under warranty\n\nGoogle Home users were waiting for nearly a month before the company provided another update that a firmware update was responsible for the issue.\n\nGoogle is yet to provide a response to the issue via its official channels.\n\nGoogle Home and Google Home Mini smart devices are the predecessors to the company's new and improved Nest Hub and Nest Mini.\n\nAt a media event last week, while announcing an update to its Nest-branded line, Google’s Rick Osterloh admitted he tells visitors to his home that it is populated with smart home devices, because of immense audio and video surveillance abilities.\n\nGoogle also released an upgraded version of the Home Hub last month, known as the Nest Hub Max.", "description": "Google will be replacing all units of the Google Home and Google Home Mini smart home devices regardless of whether they are covered under warranty.", "authors": ["Mailonline Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/14/20057492-0-image-a-10_1572008747923.jpg", "published_at": "2019-10-25"}