{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/4/editorial-its-been-1-year-since-the-i-am-part-of-t", "downloaded_at": "2019-09-04 23:48:12.509067+00:00", "published_at": "2019-09-04", "title": "An anniversary of anonymity", "language": "en", "text": "ANALYSIS/OPINION:\n\nSeptember 5 marks the first anniversary of an unprecedented opinion column in The New York Times, “I Am Part of the Resistance Inside the Trump Administration,” written anonymously, that left Washington tongues wagging for weeks after its publication.\n\nWith Democrats and much of the mainstream media hailing the column — and unnamed columnist — as courageous, speculation ran wild as to the identity of the author of the 965-word screed, which carried the subheadline: “I work for the president but like-minded colleagues and I have vowed to thwart parts of his agenda and his worst inclinations.”\n\nThis “save Trump from himself” op-ed essay eventually fell off Washington’s radar, but the speculation resumed this week with the approach of the anniversary of the publication of the column, written by someone who the paper characterized as “a senior official” in the administration. (We’re going to presume, if only to simplify the grammatical issues here, that said “senior official” was/is a “he.”)\n\nAlthough the author’s identity reportedly is known only to three top editors at The New York Times, speculation has run the gamut from Mike Pence or Mike Pompeo to Kellyanne Conway or Nikki Haley. At the risk of playing this parlor game ourselves, we would have guessed Rex Tillerson, but he was forced out as secretary of State at the end of March 2018, more than five months before the column appeared.\n\nThe column ran less than 20 months into the Trump presidency, and it’s not clear, now 12 months later, whether its author is still in the administration and still toiling to “thwart” the parts of the president’s agenda he doesn’t approve of.\n\n“Anonymous” didn’t have the courage of his convictions to put a byline on the piece and to let the chips fall where they surely would have; namely, in his firing by the president. (A column in the Gray Lady admitting to seeking to subvert President Trump’s agenda is surely more of a firing offense than gossipy remarks about the president’s children made by White House aide Madeleine Westerhout in what was supposed to be an off-the-record chat with a Washington Post reporter, which got her fired last week.)\n\nApparently, the “payroll patriot” behind The New York Times column wasn’t willing to sacrifice his high-dollar sinecure “to put country first,” which is how he sanctimoniously characterized his actions.\n\nAnonymous insisted, however, that he should not be confused with “the popular ‘resistance’ of the left.” Nor is this “the work of the so-called deep state,” he averred.\n\nTo the contrary, “We want the administration to succeed and think that many of its policies have already made America safer and more prosperous,” citing “effective deregulation, historic tax reform, a more robust military, and more.”\n\nBut those genuine Trump achievements were given short shrift, rendering their mention little more than a fig leaf in defense of his sub-rosa actions, which are, in Anonymous’ telling, a justifiable attempt to thwart Mr. Trump’s “amorality” and “impulsiveness.” Those traits supposedly have resulted in “half-baked, ill-informed, and occasionally reckless decisions that have to be walked back.” But who elected Anonymous?\n\nFor all the posturing and preening in the column, one is left to wonder: Which, if any, of President Trump’s policies, programs and initiatives have the clandestine Anonymous’ efforts actually prevented, reversed or undermined?\n\nThe column was silent on that point, presumably because such specificity would have “outed” the author, who vowed to continue to thwart Mr. Trump’s “more misguided impulses until he is out of office.”\n\nIf Anonymous and others like him in the administration can’t in good conscience carry out the president’s decisions, the honorable thing to do would be to resign and explain why they can no longer do so.\n\nMore to the point, the American public deserves to know whether Anonymous is still trying to thwart the president, and on what issues and in what ways? And is he acting as a “lone gunman” or still part of that purported “like-minded” cabal out to sabotage Mr. Trump?\n\nThis sordid episode was, and is, regrettably representative of the Washington Swamp at its most tenacious and intractable. That’s disturbing, because it was Mr. Trump’s vow to “drain the Swamp” that got him elected in the first place. The Swamp will not be drained, at least not if Anonymous and the other Swamp dwellers have anything to say about it.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "September 5 marks the first anniversary of an unprecedented opinion column in The New York Times, \"I Am Part of the Resistance Inside the Trump Administration,\" written anonymously, that left Washington tongues wagging for weeks after its publication.", "authors": ["The Washington Times Http", "The Washington Times"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/21/Trump_51578.jpg-8ee03_c0-107-2562-1600_s1770x1032.jpg?d6a412f824b6d3973c3284184aad027a01926038"}