{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7586345/County-lines-crackdown-police-save-300-CHILDREN-drugs-gangs.html", "downloaded_at": "2019-10-18 01:22:47.891508+00:00", "title": "County lines crackdown as police save 300 CHILDREN from drugs gangs", "language": "en", "text": "Police have rescued almost 300 children from the grip of county lines gangs during a week-long, nationwide crackdown.\n\nMore than 700 men and women were arrested in this month’s operation aimed at disrupting the drug gangs blighting towns and cities.\n\nOfficers seized almost half a million pounds worth of drugs, as well as almost £200,000 in cash and 169 weapons including 12 firearms, samurai swords, an axe, knives and a crossbow.\n\nThe blitz was organised by the National County Lines Coordination Centre – the unit set up to tackle city gangs expanding their operations into small towns, often using violence to drive out local dealers and children to sell drugs.\n\nIn the week-long blitz organised by the National County Lines Coordination Centre officers seized almost half a million pounds worth of drugs (file image)\n\nChildren as young as eight have been recruited and they are often lured by the offer of cash or designer clothes. Sometimes they are trafficked to towns miles away from their homes.\n\nThe week of action between October 7 and 13 was the fourth since the unit was launched last year. In the latest crackdown, 652 men and 91 women were arrested, 389 vulnerable adults and 292 children were safeguarded and 49 ‘deal lines’ were seized.\n\nMore than 3,000 vulnerable people have been rescued across the four weeks, police said.\n\nThe National Crime Agency’s Nikki Holland said: ‘Criminal networks rely on the flow of money to further their drug trafficking operations and conceal their assets. Over the last year of county lines intensification, we have seized more than a million pounds – hitting them where it hurts so they don’t benefit from their crimes.’\n\nPolice said dealers were now being told they will be treated as child traffickers, not just drug dealers, as law enforcement increasingly uses modern slavery legislation to prevent young people being exploited.\n\nOfficers seized 169 weapons including 12 firearms, samurai swords, an axe, knives and a crossbow (file image)\n\nIn Hampshire, where 52 people were arrested, police said it was not only ‘obviously vulnerable’ children who were targeted, but also those from more stable backgrounds.\n\nDet Supt Scott Mackechnie, from Hampshire Constabulary, said: ‘Youngsters who suddenly have new and unaffordable belongings, go missing a lot, have friendships with older people or have unexplained injuries are all said to be possible victims.’\n\nEarlier this week, a report exposed disturbing gaps in the way county lines gangs and knife criminals are handled by authorities. HM Inspectorate of Probation found some councils’ youth offending teams in England and Wales are ‘struggling’ to deal with children and young people caught up in drug operations.\n\nIn some cases, hospitals and schools are failing to alert police when they suspect a child is involved.\n\nLucy Dacey, of The Children’s Society, welcomed the crackdown but said more still needs to be done. She said: ‘We urge the Government to introduce a national strategy, backed by the financial resources needed, to help end the current postcode lottery and ensure more is done to keep children caught up in this horrific crime safe.’", "description": "In a week-long blitz, organised by the National County Lines Coordination Centre, officers seized £500,000 of drugs, and 169 weapons including 12 firearms, samurai swords, an axe and knives.", "authors": ["Claire Duffin For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/00/19862316-0-image-a-84_1571354672792.jpg", "published_at": "2019-10-17"}