{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7585861/Rick-Perry-QUITS-revealing-Trump-told-talk-Giuliani-Ukraine-corruption.html", "downloaded_at": "2019-10-18 01:20:35.325434+00:00", "title": "Rick Perry QUITS after revealing Trump told him to talk to Giuliani about Ukraine 'corruption'", "language": "en", "text": "Rick Perry formally informed Donald Trump Thursday that he would soon be stepping down from his post as Energy secretary.\n\nHe sent a written notification to the president as Trump was traveling aboard Air Force One, two people familiar with the matter told Bloomberg.\n\nTrump confirmed Perry's departure and said he was planning to announce the move at his rally Thursday night in Dallas, Texas.\n\n'We already have his replacement. Rick has done a fantastic job. But it was time,' Trump told reporters in Texas, adding that his departure would come 'at the end of the year.'\n\nThe president said that he has already has picked Perry's replacement and will be announcing the new Energy secretary shortly.\n\n'We have the man that we're going – in this case it's a man – that we're going to be putting in Rick's place. We'll be announcing it very shortly,' he said.\n\nTrump said he wasn't surprised by Perry's departure as the Energy secretary had informed him months ago that he was planning to leave the administration to pursue something else.\n\n'I knew six months ago. He told me at the end of the year he'd like to go and he's got some ideas about doing something else. He's a terrific guy,' Trump lauded Perry.\n\n'Rick and I have been talking for six months. In fact I thought he might go a bit sooner. But he's got some very big plans. He's going to be very successful. We have his successor we'll announce it pretty soon,' he continued.\n\nRick Perry said Donald Trump told him to 'talk to Rudy' Giuliani about his concerns regarding Ukrainian corruption before he would agree to a sit down with his new counterpart\n\nTRUMP'S HIGH-PROFILE DEPARTURE LOUNGE Here are just some of the top officials who have left Trump's administration and when their departures were announced 2017 Inauguration Day was January 20 January 31: Acting Attorney General Sally Yates February 13: National Security Adviser Michael Flynn March 30: Deputy Chief of Staff Katie Walsh April 9: Deputy National Security Adviser K.T. McFarland May 9: FBI Director James Comey May 30: Communications Director Michael Dubke July 21: Press Secretary Sean Spicer July 28: Chief of Staff Reince Priebus July 31: Communications Director Anthony Scaramucci August 18: Chief Strategist Steve Bannon August 25: National security aide Sebastian Gorka September 1: Director of Oval Office Operations Keith Schiller September 29: Health and Human Services Secretary Tom Price December 8: Deputy National Security adviser Dina Powell December 13: Communications director for the White House Office of Public Liaison Omarosa Manigault Newman 2018 February 7: Staff Secretary Rob Porter February 28: Communications Director Hope Hicks March 6: Director of the National Economic Council Gary Cohn March 12: Special assistant and personal aide to the president John McEntee March 13: Secretary of State Rex Tillerson March 22: National Security Adviser H.R. McMaster March 28: Veterans Affairs Secretary David Shulkin April 10: Homeland Security Adviser Tom Bossert April 11: Deputy National Security Adviser Nadia Schadlow April 12: Deputy National Security adviser Ricky Waddell May 2: White House attorney Ty Cobb June 5: Communications aide Kelly Sadler July 5: Environmental Protection Agency Administrator Scott Pruitt August 29: White House Counsel Don McGahn October 9: U.N. Ambassador Nikki Haley November 7: Attorney General Jeff Sessions December 9: Chief of Staff John Kelly December 15: Interior Secretary Ryan Zinke December 20: Defense Secretary Jim Mattis 2019 March 8: Communications Director Bill Shine April 8: Homeland Security Secretary Kirstjen Nielsen June 13: White House Press Secretary Sarah Sanders June 18: Acting Defense Secretary Patrick Shanahan June 25: Acting Customs and Border Patrol Commissioner John Sanders July 12: Labor Secretary Alex Acosta July 28: Director of National Intelligence Dan Coats August 6: Ambassador to Russia, Jon Huntsman August 8: Deputy Director of National Intelligence, Sue Gordon August 29: President's personal assistant, Madeleine Westerhout September 5: Lead Middle East peace negotiator, Jason Greenblatt September 10: National Security Advisor, John Bolton October 11: Acting Homeland Security Secretary Kevin McAleenan October 17: Energy Secretary Rick Perry\n\nThe news come just 10 days after Perry, who has been with Trump since March 2017, denied that he was planning to resign his position in the immediate future.\n\nTrump denied that Perry's replacement would be Texas Governor Greg Abbott or Alaska Governor Mike Dunleavy.\n\nPerry has found himself at the center of the Ukraine scandal engulfing the presidency after he became one of the top liaisons between Trump and his new Ukrainian counterpart.\n\nThe former Texas governor announced earlier this month he was staying with the administration despite the controversy, although he did not rule out leaving at a later date.\n\n'They've been writing the story for at least nine months now,' he said at the time of the media and his rumored departure. 'One of these days they will probably get it right, but it's not today, it's not tomorrow, it's not next month,' Perry said while traveling in Lithuania.\n\nPolitico had reported last week that he was planning to resign at the end of November, citing three anonymous sources.\n\nHis departure will add to the extensive and ever-growing list of Trump administration officials who have left the White House.\n\nPerry revealed in an interview published Wednesday night that he was directed by Trump to approach Rudy Giuliani to address the president's concerns about corruption in Ukraine.\n\nHe told The Wall Street Journal that he contacted Giuliani in the spring to help clear the way for a meeting between the president and his newly elected Ukrainian counterpart.\n\nAlthough Perry admitted that during his phone call earlier this year Giuliani outlined several potential instances of interference by Ukraine in the 2016 presidential elections, he said the president's personal attorney never brought up Joe Biden or his family.\n\nHe also said he didn't hear Trump, any of his appointees or the Ukrainian government ever mention probing the former vice president and his son, Hunter Biden's business dealings there.\n\n'As I recall the conversation, he said, 'Look, the president is really concerned that there are people in Ukraine that tried to beat him during this presidential election,' Perry said. ''He thinks they're corrupt and…that there are still people over there engaged that are absolutely corrupt.''\n\nPerry said Giuliani didn't make any explicit demands on the call.\n\n'Rudy didn't say they gotta do X, Y and Z,' Perry continued in his interview. 'He just said, 'You want to know why he ain't comfortable about letting this guy come in? Here's the reason.'\n\nThe House opened an impeachment inquiry into the president following revelations of a July 25 phone call where Trump urged Ukrainian President Volodymyr Zelensky to dig up dirt on his political rival.\n\nDemocrats allege the president set a quid pro quo in freezing millions in military aid in exchange for the Ukrainian regime's investigation into the Bidens.\n\nPerry's talks and coordination with Giuliani show the widespread reach of the president's attorney's involvement in foreign policy. Giuliani is currently being investigation for potential foreign lobbying violations.\n\nGiuliani confirmed his call with Perry and said he was telling the president's energy secretary to be careful in dealing with Zelensky, who took office in May.\n\n'Everything I said there I probably said on television 50 times,' Giuliani told the Journal.\n\nThe former New York City Republican mayor has accused Ukraine, under then-President Petro Poroshenko, of interfering in the U.S. elections on Hillary Clinton's behalf.\n\nSince Zelensky was elected, U.S. officials have been attempting to facilitate a meeting between and his new Ukrainian counterpart.\n\nPerry and Giuliani's call followed a White House meeting, which included Perry and then-U.S. envoy for Ukraine negotiations Kurt Volker, who resigned last month after revelations of Trump's call with Zelensky.\n\nIn the meeting, Trump's advisers urged him to meet with Zelensky, but people familiar with the matter said the president told them they needed to resolve Giuliani's concerns before he would agree to the meeting.\n\n'Visit with Rudy,' Perry said the president told him at the time.\n\nPerry has been one of the administration's top liaisons with the new Ukrainian president, which has put him under intense scrutiny as the president faces impeachment proceedings into whether he abused his power as president to dig up dirt on Biden.\n\nTrump claims his call with Zelensky this summer was 'perfect,' and insists it was an attempt to help weed out corruption from the European nation. He also claims he has a duty, as president, to stop corruption, including from the Bidens.\n\n\n\nGiuliani, the president's personal attorney, is being investigated in relation to his role in U.S.-Ukraine relations – especially his claims of corruption and election interference by the previous administration there\n\nPerry has acted as a top liaison between Trump and the new Ukrainian administration since Ukrainian President Volodymyr Zelensky took office in May. Trump and Perry have a generally good rapport, which has helped the Energy secretary steer clear of problems other officials have run into with the president\n\nHunter Biden accepted a board position with Ukrainian natural gas firm Burisma Holdings in 2014 – while his father was still serving as Obama's vice president. He reportedly was paid $50,000 per month in his post at Burisma.\n\nThe attorney and lobbyist stepped down from Burisma's board earlier this year and also announced over the weekend he was leaving his position on the board of a Chinese-backed equity firm where he made millions.\n\nPerry said Trump has dismissed his requests to meet with Zelensky in an effort to show U.S. support for the new administration – which Intelligence Committee Chairman Adam Schiff, who is leading the impeachment inquiry, said is another potential of a quid pro quo.\n\nSchiff said if Trump were to set an investigation into the Bidens as a condition for meeting with Zelensky, it could be another instance of him using his presidency to attempt to better his chances in 2020.\n\nPerry revealed that Giuliani was also in contact with Secretary of State Mike Pompeo, Volker and U.S. ambassador to the European Union Gordon Sondland.", "description": "Rick Perry informed Donald Trump that he will be stepping down from his post as Energy secretary. He sent a written notification to the president as Trump was traveling on Thursday.", "authors": ["Katelyn Caralle", "U.S. Political Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/14/19839940-0-image-a-9_1571320166973.jpg", "published_at": "2019-10-17"}