{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/10/china-trump-trade-war-talks", "downloaded_at": "2019-10-10 18:37:13.707229+00:00", "title": "Trump to meet with China for talks aimed at ending trade war", "language": "en", "text": "China’s vice-premier, Liu He, to lead delegation in 13th round of talks as Trump tweets: ‘They want to make a deal, but do I?’\n\nDonald Trump will meet China’s negotiating team at the White House on Friday for the latest round of talks aimed at ending a 15-month trade battle that is weighing on the global economy.\n\n“Big day of negotiations with China. They want to make a deal, but do I?” the president tweeted. On Wall Street stocks moved higher on hopes that there would be a breakthrough in the dispute.\n\nDonald J. Trump (@realDonaldTrump) Big day of negotiations with China. They want to make a deal, but do I? I meet with the Vice Premier tomorrow at The White House.\n\nChina’s vice-premier, Liu He, is leading the delegation in negotiations with the US trade representative, Robert Lighthizer, and the treasury secretary, Steven Mnuchin.\n\nThis is the 13th round of talks between the two sides and the world’s two biggest economies are deadlocked over US allegations that China steals technology and pressures foreign companies to hand over trade secrets as part of a sharp-elbowed drive to become a world leader in advanced industries such as robotics and self-driving cars.\n\nAhead of the meeting a Chinese official told Bloomberg that China was open to a “partial trade deal” but talks have been further complicated by the US decision to blacklist 28 Chinese tech firms over Beijing’s treatment of Uighur Muslims and other predominantly Muslim ethnic minorities. That decision came just days before the latest talks were due to start.\n\nUS-China relations have been further strained by a tweet from Daryl Morey, the general manager of the Houston Rockets basketball team, in support of the Hong Kong democracy movement. The tweet, since deleted, led to the cancellation of NBA events in China this week.\n\nUnder Trump, the US has slapped tariffs on more than $360bn worth of Chinese imports and is planning to hit another $160bn 15 December. That would extend import taxes to virtually everything China ships to the United States. China has hit back by targeting about $120bn in US goods, focusing on farm products.\n\nThe high cost of the tariffs and uncertainty over when and how the trade war will end have taken an economic toll, especially on manufacturing companies. A private survey last week found that US factory output had dropped to its lowest level since 2009, when the economy was in the grips of a deep recession.\n\n“Both sides have been losing, and so has the global economy,” said Myron Brilliant, head of international affairs at the US Chamber of Commerce.\n\nBrilliant, who spoke with both delegations before the meetings, sounded optimistic about the chances of progress, noting that Beijing has stepped up purchases of US soybeans in a goodwill gesture. He said he hoped a productive meeting would persuade the Trump administration to call off or postpone plans next Tuesday to hike tariffs on $250bn of Chinese imports from 25% to 30%.\n\n“We all know we can’t afford a further escalation of the trade war,” Brilliant said.\n\nStill, Beijing has been reluctant to make the kind of substantive policy reforms that would satisfy Washington. Doing so would probably require scaling back the Chinese leaders’ aspirations to technological dominance they see as crucial to their country’s future prosperity.\n\nThe news came amid the chaos of the impeachment inquiry engulfing US politics, which is examining Trump’s phone call in July where he asked the president of Ukraine, Volodymyr Zelenskiy, to investigate Joe Biden, a leading Democratic rival in the 2020 US presidential election.\n\nTrump also last week brazenly asked China in public to investigate Biden and his son Hunter Biden over their international business dealings, despite no evidence of illicit activity and despite conspiracy theories about the Bidens and Ukraine having been debunked.", "description": "China’s vice-premier, Liu He, to lead delegation in 13th round of talks as Trump tweets ‘They want to make a deal, but do I?’", "authors": ["Dominic Rushe", "Rebecca Solnit", "Katie Herzog"], "top_image": "https://i.guim.co.uk/img/media/4cb8e78bd8b2ac55271a69959fb16498ac7c65f3/0_141_5568_3341/master/5568.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a51c68f028372c1814a29970c41f8171", "published_at": "2019-10-10"}