{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/strictlys-dianne-buswell-breaks-silence-20464331", "downloaded_at": "2019-10-05 10:29:38.302731+00:00", "title": "Strictly's Dianne Buswell breaks silence after hospital dash with clip of Dev rehearsing alone", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nDevastated Strictly Come Dancing star Dev Griffin has been seen rehearsing alone after his partner Dianne Buswell was rushed to hospital.\n\nThe dancer suffered a nasty fall in training when the radio DJ reportedly dropped her on her head.\n\nShe escaped serious injury, and Mirror Online exclusively revealed she's now feeling \"absolutely fine\" and still plans to perform with Dev on Saturday night's show.\n\nAfter all the drama, Dianne returned to Instagram to share a video clip showing Dev in the dance studio going over his moves without her.\n\nShe captioned the video: \"He does not stop even if I'm not there.\"\n\nDianne is believed to have returned to rehearsals this evening and was seen looking tired in a taxi on the way home.\n\n(Image: Instagram)\n\n(Image: diannebuswell /Instagram)\n\nThe Radio 1 DJ is said to have lost his grip on the dancer during a lift in rehearsals and she went crashing to the floor.\n\nDev \"doubled over in panic\" as medical staff rushed to her aid, according to The Su n.\n\nDianne is believed to have been admitted to A&E amid fears she'd suffered a concussion.\n\nA source said: \"Dev let her slip from his grasp and Dianne fell and landed on her head. It couldn’t have been worse.\n\n\"It was horrible to watch Dianne lying prostrate on the floor...\n\n(Image: BBC/Ray Burmiston)\n\n\"Dev... was praying that there was no serious damage — the worst case scenario was that she had some internal head injuries.\n\n“She plunged a long way and he couldn’t help but panic about what he’d done. Dev insisted on going to hospital and looked in total shock.\"\n\nHowever, there was no serious damage and doctors at North London’s Barnet Hospital hospital discharged her after diagnosing her with whiplash.\n\nDespite reports suggesting Dianne is an injury doubt fir Saturday night, Mirror Online revealed Dianne bounced back and will hit the dance floor as planned on Saturday night.\n\nAn insider told us: \"There was an incident and Dianne went to get checked over.\n\n\"She’s absolutely fine and performing tomorrow night.\"\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033", "description": "Strictly Come Dancing contestant star Dev Griffin was seen training by himself after his partner Dianne Buswell was rushed to hospital after a fall during rehearsals", "authors": ["Louise Randell", "Image", "Instagram", "Diannebuswell", "Bbc Ray Burmiston"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article16186514.ece/ALTERNATES/s1200/1_Dianne-Buswell.jpg", "published_at": "2019-10-04"}