{"pub": "news24", "url": "https://news24.com/World/News/police-shooting-suspect-tried-to-access-black-church-20181026", "downloaded_at": "2019-10-13 00:22:40.844533+00:00", "title": "US police: Shooting suspect tried to access black church", "language": "en", "text": "Gregory Bush is arraigned on two counts of murder and 10 counts of wanton endangerment in Louisville. (Scott Utterback, Courier Journal via AP, Pool)\n\nA white man with a history of violence and mental illness was recorded on surveillance video apparently trying to get inside a predominantly black church in Kentucky before he went to a grocery store and fatally shot two African-Americans, police said.\n\nAfter releasing a photo of the suspect, authorities received a tip from an employee of the city of Jeffersontown who said he thought he saw Gregory Bush outside the First Baptist church prior to Wednesday's shooting, city police chief Sam Rogers said. The video confirmed Bush's presence, Rogers said. The church is headed by a black pastor and has a large African-American membership.\n\nBush \"appeared to try to gain access to the church\", Rogers said.\n\nThe information came as news media outlets reported that Bush made a racial comment after the deadly shooting at a Kroger in Jeffersontown, a city of about 26 600 people on the outskirts of Louisville.\n\nRogers said it was too soon, however, to say whether the shooting was racially motivated.\n\n\"I can't speculate on motive at this time,\" the chief said at a news conference on Thursday. \"We are pursuing all avenues of the investigation no matter where that takes us or what it involves.\"\n\nThe FBI announced that it \"is evaluating the evidence to determine if there were any violations of federal law\". Hate crimes are prosecuted under federal law.\n\nRogers also said Bush apparently does have a history of mental illness, as news outlets have reported.\n\nThe suspect 'began firing wildly'\n\nAn arrest report says Bush walked into the Kroger, pulled a gun from his waist and shot a man in the back of the head, then kept shooting him multiple times \"as he was down on the floor\". The report says Bush then reholstered his gun, walked outside and killed a woman in the parking lot. Each victim died of multiple gunshot wounds, Rogers said.\n\nA man carrying a concealed weapon who happened to be in the parking lot challenged Bush, and police say the suspect then \"began firing wildly\" at him, putting other shoppers in the parking lot in danger. Neither man was hurt in that confrontation, Rogers said.\n\nBystander video shows a white man in a distinctive neon-yellow shirt trying to drive away while an officer chases after him on foot. Many more officers converged on the scene and made the arrest just a few hundred meters from the store on Wednesday afternoon.\n\nBush was jailed on $5m bond on Thursday on two counts of murder and 10 counts of felony wanton endangerment.\n\nEd Harrell was quoted by the Courier Journal of Louisville as saying he was waiting on his wife in the parking lot when he heard gunshots and grabbed his revolver. As he crouched down, he said he saw the gunman walk \"nonchalantly\" by with a gun by his side. Harrell said he called out to ask what was going on, and the gunman replied: \"Don't shoot me. I won't shoot you. Whites don't shoot whites.\"\n\nRogers said police \"are aware of that statement and are evaluating any factors that may come into play with\" it.\n\nHe said he had \"no direct knowledge\" of whether there was more than one armed bystander at the scene.\n\nGun violence\n\nThe local coroner's office identified the victims as Maurice Stallard, 69, and Vicki Lee Jones, 67. Police said there didn't appear to be any connection between Bush and the victims, or any link between Bush and the Kroger store.\n\nStallard's 12-year-old grandson was shopping with him in the store when he was gunned down, Jeffersontown Mayor Bill Dieruf said Thursday. The boy was physically unharmed, but most certainly traumatized, the mayor said, adding, \"He was there and cannot unsee what he has seen\".\n\nStallard was the father of Kellie Watson, the chief racial equity officer for Louisville Mayor Greg Fischer.\n\nThe mayor shared his outrage on Thursday over what he called an \"epidemic of gun violence\" that \"hit close to home\".\n\n\"People getting shot at a grocery store, a school, outside a church. Can't we all agree that that is unacceptable?\" said Fischer, a Democrat running for re-election.\n\nAuthorities removed computers and cellphones from the house where Bush lived with his parents.\n\nBush's criminal record shows he threatened his ex-wife and punched a deputy sheriff during a family court hearing years ago. He also was charged with assaulting his elderly parents in January 2009.\n\nAn arrest citation said Bush's parents were punched and choked, and they told police they were \"terrified of (his) unpredictable behaviour\".\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "US police say the white man accused of fatally shooting two African-American grocery store patrons in Kentucky was recorded on surveillance video as first trying to get inside a predominantly black church.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8111/3f6cb78b3dc54640b9b8093dbfb4d2ae.jpg", "published_at": "2018-10-26"}