{"pub": "businessinsider", "url": "https://businessinsider.my/china-viral-glass-bridge-travel-tips-zhangjiajie-grand-canyon-2019-4", "downloaded_at": "2019-10-26 06:45:36.468046+00:00", "title": "I paid $22 to walk across the famous glass bridge that spans China’s ‘Grand Canyon,’ and it was the worst experience I had in a year of traveling the world for work", "language": "en", "text": "caption It was a disappointing lesson in booking trips based on viral videos. source Harrison Jacobs/Business Insider\n\nI left New York a year ago to travel around the world as Business Insider’s international correspondent. While I’ve had some epic adventures, some bucket-list attractions were overpriced, uninspiring, overcrowded, or just plain boring.\n\nThe worst offender was the Zhangjiajie Grand Canyon Glass Bridge in China, the longest and highest glass bridge in the world.\n\nWhile the scenery was beautiful, the site was overrun with tourists, the tickets were overpriced, the glass was so scuffed that it was difficult to see to the floor below, and it was hard to see any point to the visit except for taking a selfie.\n\nVisit Business Insider’s homepage for more stories.\n\nWhen I left a year ago to travel as Business Insider’s international correspondent, I knew there would be amazing adventures along the way. I also knew there would be more than a few duds.\n\nThe worst offender of the bunch was my visit the Zhangjiajie Grand Canyon Glass Bridge in China’s Hunan province. Opened in 2016 and considered the tallest and longest glass bridge in the world, the bridge has inspired viral video after viral video of terrified tourists crawling over a futuristic glass bridge spanning a verdant gorge.\n\nAfter seeing a few too many of the videos, I decided I had to check it out during my six weeks in China. It was a textbook lesson in the difference between the internet and reality.\n\nViral videos versus reality\n\nThough the viral videos and selfies of people on the bridge make it seem like a thrilling experience, actually visiting is anything but. The only thrilling thing about the bridge is the number of people on it at any given time and feeling my knuckles whiten as I wondered whether the glass would crack from the weight.\n\nFor a little context, the Zhangjiajie Grand Canyon Glass Bridge is near the stunning Wuling Mountains. The region is known for its 3,000 quartzite sandstone pillars that look like floating mountains on a misty day. The glass bridge, however, isn’t near those pillars – it’s a 45-minute bus ride away, at a gorge known as China’s “Grand Canyon.”\n\nSitting 980 feet above the canyon floor and costing $74.6 million to build, the bridge is meant to be an architectural marvel. At more than 1,400 feet long and beautifully designed by the Israeli architect Haim Dotan, it lives up to that status.\n\nThe experience of actually seeing and walking on it – for a foreign tourist at least – is a nightmare.\n\nThe experience was a far cry from what I expected it to be\n\nTo start with, no one at the tourist center speaks English, few signs are in English, and the ticketing center accepts only cash, WePay/Alipay (which foreigners can’t use), or UnionPay (China’s national debit card). There is an ATM, but when I visited – two years after its opening – it still wasn’t hooked up.\n\nThe ticket for the glass bridge alone costs 138 yuan ($22), while a ticket to explore the hiking trails in the canyon on the other side costs an additional 118 yuan. Keep in mind that a meal in the area probably runs about 15 to 30 yuan.\n\nBecause so many tour groups and tourists visit the bridge, the center has extremely strict rules on ticketing and when you can go on it. I knew this only because my partner speaks Mandarin.\n\nEssentially, if you buy the combined bridge/canyon ticket, you can go on the bridge at any of the designated times throughout the day (roughly every half-hour). But if you want to buy only the bridge ticket, you have to wait until 3:30 p.m. to buy it, and then you are allowed on the bridge only at 4:30 p.m.\n\nI got there around 1 p.m. and wanted to buy tickets for the hikes, but I was short on cash. I tried ATMs, but, as I said, they weren’t even plugged in.\n\nWhen 3:30 p.m. rolled around, the ticketing center was a madhouse. Even though I stood in front of a ticket window the entire time, I almost didn’t get a ticket. Tour guides were cutting the line and buying dozens at a time.\n\nAfter finally securing a ticket, I had to go through a series of lines – a word I use generously, given the frantic scrambling that ensued over the next hour or so of walking – to get to the bridge. It was mayhem.\n\ncaption It was mayhem. source Harrison Jacobs/Business Insider\n\nThe bridge allows only 800 people at a time – but it was so crowded that I could barely move\n\nThough the bridge caps the number of people allowed in at 800 at a time, it was still crowded to the point where it was hard to not get bumped by other people constantly.\n\nFew people are simply walking on the bridge or taking in the view. Just about everyone is trying to do the same thing: take a selfie on the glass-bottomed floor.\n\nPlus, the glass panels were so scuffed up that I was mostly looking at scratches and reflections when I looked down anyways.\n\ncaption Everyone seemed to have the same goal: to take a selfie. source Harrison Jacobs/Business Insider\n\nOn the flip side, the view was gorgeous, and the weather was perfect – breezy, sunny, and around 72 degrees. But we were there in April, and peak season for Zhangjiajie is during the hot, humid summer months when the temperature picks up to 83 degrees or higher.\n\nBy the time I left, I couldn’t have been more relieved to get out of there. It felt like a colossal waste of a day. That feeling was doubled the next day when I visited the breathtaking mountains of Zhangjiajie National Forest Park.\n\nThe scene at the park was far more relaxed and the scenery even more spectacular than what I saw at the glass bridge. I was cursing myself for not spending an extra day exploring the magical stone pillars and green landscape.\n\nVisiting the glass bridge was the first and last time I decided to visit a site because a viral video told me to.", "description": "Business Insider - While the scenery was beautiful, the glass bridge was overrun with tourists, and it was hard to see any point except for taking a selfie.. Read more at businessinsider.my", "authors": ["Harrison Jacobs", "Business Insider Us"], "top_image": "https://static.businessinsider.my/sites/3/2019/04/5c6d78aa1631a3621d0671a2.png", "published_at": "2019-04-25"}