{"pub": "fox", "url": "https://foxnews.com/entertainment/meghan-markle-without-engagement-ring-royal-tour-africa", "downloaded_at": "2019-09-25 04:40:00.083890+00:00", "title": "Meghan Markle goes without her engagement ring during royal tour of Africa", "language": "en", "text": "Meghan Markle and Prince Harry began their first official tour as a family on Monday, accompanied by their 4-month-old son, Archie.\n\nHowever, while many eyes were on the royals' outing, some eagle-eyed observers couldn't help but notice that the Duchess of Sussex forewent her engagement ring for the trip.\n\nAccording to Page Six, the 38-year-old former actress left her three-diamond ring (reportedly valued at around $295,000) and matching eternity band at home, opting instead to wear her gold Welsh wedding band along with another dainty gold ring (worth $250).\n\nMEGHAN MARKLE WEARS $85 DRESS DURING ROYAL TOUR OF AFRICA\n\nMEGHAN MARKLE APPLAUDS PRINCE HARRY FOR BEING THE 'BEST DAD'\n\nA source told Hello! that Markle stepped out without her ring because she wants to be \"low key\" while doing meet and greets with the public.\n\nRoyal expert and writer Daniela Elser further explained in an article for news.com.au that \"Meghan’s choice to forgo this expensive item reflects the inherent tension in being a member of the royal family.\n\n\"That is, you might be a member of an obscenely rich clan, but you are never meant to flaunt that wealth,\" wrote Elser, adding that \"appearing humble is a key job requirement for any working royal, even though you live in a castle and your family has a vault stuffed with priceless jewels.\"\n\nTHE QUEEN WON'T DISCUSS MEGHAN MARKLE, PRINCE HARRY: REPORT\n\n\"The very fact Meghan was adroit enough to realize that and quietly left her rock elsewhere, I think, is a powerful signal,\" added Elser. \"Firstly, of just how conscious she is about making others comfortable, secondly, that she is sensationally savvy image-wise and third, that she is more than happy to rewrite the rule book.\"\n\nGET THE FOX NEWS APP\n\nOn Tuesday, the Duke and Duchess of Sussex visited South Africa's oldest mosque -- the 225-year-old Auwal Mosque in Cape Town. The royal couple kicked off their tour on Monday with visits to girls' empowerment projects that teach rights and self-defense.\n\nMeghan and Harry's 10-day tour includes scheduled stops in Botswana, Angola and Malawi with a focus on wildlife protection, mental health and mine clearance.\n\nThe Associated Press contributed to this report", "description": "Meghan Markle and Prince Harry began their first official tour as a family on Monday, accompanied by their 4-month-old son, Archie.", "authors": ["Mariah Haas"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/GettyImages-1170783598.jpg", "published_at": "2019-09-24"}