{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/tech-savvy-teens-should-conscripted-20709475", "downloaded_at": "2019-10-24 00:36:52.488974+00:00", "title": "Tech-savvy teens 'should be conscripted into armed forces to boost our defences'", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nTech-savvy teens should be ­conscripted into the armed forces and security services to boost our defences, a report urges.\n\nThink-tank the Royal United Services Institute is calling for a “highly targeted” Scandinavian-style scheme to tackle a recruitment crisis in the Army.\n\nAnd it said the process – from blue-sky thinking rather than a report ordered by the Government – would begin with a mandatory online test for teens.\n\nResults would go to the armed forces and intelligence services MI6, MI6 and GCHQ, which would invite top candidates for interviews and further tests.\n\nElisabeth Braw, head of the RUSI’s Modern Deterrence project, said: “A year before they leave school they receive an invitation for an online assessment. The Government selects the most promising for mental and physical aptitude tests.\n\n(Image: Getty)\n\n“If someone really doesn’t want to do it – on grounds of religion and so forth – they can be exempted.\n\n“But if it’s just because they don’t want to do it, the Government could theoretically force them to do it anyway.”\n\nHer report adds: “Acceptance to the programme brings with it the prestige of having been selected over the rest of the year group and the armed forces have the complete cohort for selection, which gives them access to a far wider talent pool than an all-­volunteer system.”\n\nThe focus could be on recruiting teens with advanced computer skills to units working on cyber-threats, as well as pushing youngsters into the infantry.\n\n(Image: Getty)\n\nIt is expected 5% to 10% of 18-year-olds would be selected for service.\n\nBut Ms Braw admitted: “Given the importance of individual rights in society and the fact that two generations have not been asked to contribute to national security, the concept of service would likely encounter a certain degree of bafflement and opposition.”\n\nNATO Parliamentary Assembly President Madeleine Moon, a Labour MP who is on the Commons Defence Committee, welcomed the study.\n\nShe said: “This paper represents a solution to the disconnected relationship between defence and our general public.\n\n\"It would install within future generations an understanding of the threats but also deepen the understanding that the defence of our islands is now the responsibility of all of us.”", "description": "The focus could be on recruiting teens with advanced computer skills to tackle cyber threats", "authors": ["Ben Glaze", "Image", "Getty"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20707502.ece/ALTERNATES/s1200/1_Female-working-on-a-laptop-and-holding-a-wireless-mouse-on-a-wooden-desk.jpg", "published_at": "2019-10-23"}