{"pub": "independent", "url": "https://independent.co.uk/arts-entertainment/tv/news/strictly-come-dancing-week-six-catherine-tyldesley-eliminated-mike-bushell-katya-jones-a9173491.html", "downloaded_at": "2019-10-28 00:26:23.747045+00:00", "title": "Strictly Come Dancing: Catherine Tyldesley eliminated from BBC competition as Shirley Ballas saves Mike Bushell", "language": "en", "text": "The latest celebrity to be voted off this year’s Strictly Come Dancing has been revealed.\n\nFormer Coronation Street star Catherine Tyldesley is the fifth contestant to leave the BBC competition after scoring the lowest number of votes alongside sports presenter Mike Bushell, who found himself in the dance off with professional dancer Katya Jones.\n\nBoth Motsi Mabuse and Bruno Tonioli opted to save Tyldesley from elimination, but it was Shirley Ballas’s deciding vote as head judge that sent her home after Craig Revel Horwood opted to save Bushell.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSpeaking about her time on the show, Tyldesley said: “I never thought I’d say this, [but] I’m going to keep it up because I fell in love with it. I’ve loved every second.”\n\nReferring to Johannes Radebe, the professional she was paired with, the actor added: “This man has changed my life.”\n\nThis year’s series was South African dancer Radebe’s first appearance on the UK version of the show.\n\nShape Created with Sketch. Strictly Come Dancing 2019 – Meet the couples Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Strictly Come Dancing 2019 – Meet the couples 1/15 Emma Barton and Anton Du Beke PA 2/15 Michelle Visage and Giovanni Pernice PA 3/15 Viscountess Emma Weymouth and Aljaz Skorjanec PA 4/15 James Cracknell OBE and Luba Mushtuk PA 5/15 Chris Ramsey and Karen Clifton PA 6/15 David James and Nadiya Bychkova PA 7/15 Anneka Rice and Kevin Clifton PA 8/15 Dev Griffin and Dianne Buswell PA 9/15 Karim Zeroual and Amy Dowden PA 10/15 Will Bayley and Janette Manrara PA 11/15 Mike Bushell and Katya Jones PA 12/15 Catherine Tyldesley and Johannes Radebe PA 13/15 Alex Scott MBE and Neil Jones PA 14/15 Saffron Barker and AJ Pritchard PA 15/15 Kelvin Fletcher and Oti Mabuse Kelvin Fletcher replaces Jaime Laing on Strictly Come Dancing 2019 and will dance with Oti Mabuse BBC 1/15 Emma Barton and Anton Du Beke PA 2/15 Michelle Visage and Giovanni Pernice PA 3/15 Viscountess Emma Weymouth and Aljaz Skorjanec PA 4/15 James Cracknell OBE and Luba Mushtuk PA 5/15 Chris Ramsey and Karen Clifton PA 6/15 David James and Nadiya Bychkova PA 7/15 Anneka Rice and Kevin Clifton PA 8/15 Dev Griffin and Dianne Buswell PA 9/15 Karim Zeroual and Amy Dowden PA 10/15 Will Bayley and Janette Manrara PA 11/15 Mike Bushell and Katya Jones PA 12/15 Catherine Tyldesley and Johannes Radebe PA 13/15 Alex Scott MBE and Neil Jones PA 14/15 Saffron Barker and AJ Pritchard PA 15/15 Kelvin Fletcher and Oti Mabuse Kelvin Fletcher replaces Jaime Laing on Strictly Come Dancing 2019 and will dance with Oti Mabuse BBC\n\nLast night’s episode saw RuPaul’s Drag Race star Michelle Visage top the leaderboard, with Kelvin Fletcher following close behind.\n\nBottom of the leaderboard was Chris Ramsey and his dance partner Karen Hauer.\n\nSailing through to next week was Viscountess Emma Weymouth, who was “devastated” after finding herself at the centre of a voting scandal.\n\nStrictly Come Dancing continues next Saturday on BBC One at 7.15pm", "description": "The latest celebrity to be voted off this year’s Strictly Come Dancing has been revealed.", "authors": ["Jacob Stolworthy"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/27/16/strictly-2019-catherine-tyldesley.png", "published_at": "2019-10-27"}