{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/06/folklore-dying-due-rise-social-media-national-trust-warns", "downloaded_at": "2019-10-07 00:07:12.106476+00:00", "title": "Folklore is dying out due to rise of social media, National Trust warns", "language": "en", "text": "Ms Monagahan said some tales were unique to particular parts of the country, reflecting local character, whilst others showed how much the nation shares in common.\n\nMany come from the same basic human needs, such as shelter, food, companionship and adventure.\n\n“Through these tales – whether they’re about white harts, mirrors, water spirits or magpies – we can explore and celebrate what makes communities around the UK unique, but also the threads that tie us together, and have done for generations,” she added.\n\nDee Dee Chainey, author of the National Trust’s A Treasury of British Folklore, said: “In the Doctrine of Signatures of the 16th century, the walnut was seen to cure diseases of the brain, purely because it resembles it.\n\n“Few people today would believe this as we now have advanced medical knowledge and scientific methods through which to evaluate the success of medical treatments.\n\n“It’s interesting though, that new folklore is being created all the time – often specifically in the internet.”\n\nShe said internet memes were a type of folklore, passed through online communities in the same way that old superstitions and tales were passed on by word of mouth in the past.\n\n“This new lore reflects modern needs,” she added. “The things we dream about, and the fears that haunt us in the darkest nights today.\n\n“Slenderman is an example of this. Some say he is a bogey man; tall, thin, faceless, and wearing a non-descript suit - very similar to the way the ‘men in black’ reputedly\n\nvisit to quash rumours of aliens.”\n\nMs Chainey insisted there was “still hope” though with folklore seeing a resurgence as many attempt to unearth old tales, efforts she said were common in times of turmoil and unrest, when people look to the past for stability and comfort.\n\n“Many of the old fairy tales are now being rewritten and retold in new ways: with new heroes, heroines, and new lessons that are relevant to the modern day,” she said.\n\n“And that’s what folklore is about: taking the old wisdom and traditions, and redefining them for who we are, and the lives we now have.”\n\nThe public can share their folk wisdom online via the National Trust online.\n\nTales of local folklore\n\nIn Somerset, the seventh child of a seventh child is said to have special healing powers of touch, usually attributed only to kings.\n\nIn Digby, Lincs, it was believed well into the twentieth century that once you have seen a white dog, you should not speak until you then see a white horse\n\nIn Gloucestershire, it was believed mushrooms did not grow after they had been seen and rosemary only grew at a house ruled by a woman.\n\nThe Diamond Stone at Avebury, Wilts, is said to cross the road when the clock strikes 12.\n\nIn Northamptonshire it was said that bees could not thrive if living within an argumentative household and no one should never swear in front of a hive\n\nIt was said to be impossible for someone to die on a mattress or pillow containing pigeon feathers in both Cumbria and Northumberland\n\nTo begin anything on a Friday, from a journey to a business deal, was deemed bad luck in Devon", "description": "Mythical tales about mermaids, warriors and hidden treasure, walnuts to cure brain disease, dead beetles causing rain.", "authors": ["Victoria Ward", "Nick Timothy", "Sara Khan", "Tim Stanley"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/06/TELEMMGLPICT000212170836-xlarge_trans_NvBQzQNjv4BqZ_JcPYgesQnahAq0MEErmUtFcEGo2u39IGeve0n32Zs.jpeg?imwidth=1200", "published_at": "2019-10-06"}