{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/man-paid-137k-year-not-20716018", "downloaded_at": "2019-10-25 00:46:16.590626+00:00", "title": "Man paid £137k-a-year not to work for six years now says he's owed holiday pay", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA sacked council chief executive who had been on fully paid \"special leave\" for more than six years has sent the authority that dismissed him a bill for more than £300,000.\n\nAnthony O’Sullivan claims he should be paid for holidays he couldn’t take, for elections he couldn’t run, for a pay rise he wasn’t awarded and for legal fees he incurred when he faced a criminal charge that was dropped. It therefore appears that O'Sullivan was innocent of any suspected criminal conduct\n\nHe was deemed by the Assistant Auditor General for Wales to have acted unlawfully when recommending himself for a secret salary increase of £26,000 in 2012, Wales Online reports.\n\nMr O'Sullivan was initially suspended from Caerphilly council in March 2013 and was later put on “special leave”.\n\nUntil his dismissal earlier this month, he continued to receive his full £137,000 salary despite not having to turn up for work.\n\nCaerphilly council delayed appointing an independent expert to look into the matter and recommend what course of action to take.\n\n(Image: D Legakis Photography/Athena)\n\nNext week the council is holding a special meeting to discuss a claim submitted by Mr O’Sullivan that, if paid in full, would cost the authority at least £319,337.\n\nHe wants £159,772 in holiday pay; £22,930 in unpaid salary increases; £79,68 in Returning Officer election fees and £41,841 in legal fees.\n\nMr O’Sullivan argues that he was unable to take holidays because he was on special leave, that he should have received the salary increase awarded to other staff who were working, that he would have been entitled to the election fees if he had not been on special leave, and that he should have been indemnified for his costs in defending himself against the criminal charge which was dropped.\n\nA report to next week’s council meeting states: “The former chief executive has indicated that he incurred considerable expense in the defence of the criminal proceedings and is seeking reimbursement of these costs from the council.”\n\nThe report sets out details of the 2006 Welsh Assembly Order that makes provision for such reimbursement.\n\n(Image: D Legakis Photography/Athena)\n\nCommenting on Mr O’Sullivan’s demand for more than £300,000, a council insider said: “The people of Caerphilly county will be absolutely staggered at the cheek of these claims, when Anthony O’Sullivan has already received more than £1m in pay and pension payments while sitting at home for the past six years.\n\n“Claiming £159,000 in lieu of leave beggars belief – he’s effectively been on holiday for the past six years.\n\n\"Anthony O’Sullivan has no shame and he’s clearly determined to take council taxpayers to the cleaners.”\n\nA councillor who did not wish to be identified said: “I have never heard anything like this in my life.\n\n\"The council is already a laughing stock after paying him not to work for so long.\n\n“This absolutely takes the biscuit.”\n\nSpeaking to the BBC after he was dismissed, he said he had \"nothing to apologise to anybody for\".", "description": "Anthony O’Sullivan wants taxpayers to fund his £300,000 bill after he was sacked from Caerphilly council", "authors": ["Martin Shipton", "Kelly-Ann Mills", "Image", "Aled Llywelyn Athena", "D Legakis Photography Athena"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20716113.ece/ALTERNATES/s1200/0_PAY-athn_041019_caerphilly_council_1739JPG.jpg", "published_at": "2019-10-24"}