{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7595871/Mother-living-New-Jersey-horror-house-admits-pouring-boiling-water-three-year-old-boy.html", "downloaded_at": "2019-10-21 11:30:55.420302+00:00", "title": "Mother living at a New Jersey horror house admits pouring boiling water over a three-year-old boy", "language": "en", "text": "Patricia Buchan, 29, confessed on Friday to grievously injuring a boy under her care by pouring boiling water on his lower body as 'punishment' for urinating on her son's floor in Newark, New Jersey\n\nA mother-of-four has admitted to scalding a three-year-old boy with boiling water at a New Jersey home called a 'house of horrors' by prosecutors.\n\nPatricia Buchan, 29, admitted Friday to ordering the child to undress, placing him in a bath and pouring a pot of boiling water over his lower body.\n\nThe abuse was a 'punishment' for urinating on her son's bedroom floor, according to the Essex County Prosecutor's office.\n\n'This child lived his first three years in a house of horrors,' Essex County Assistant Prosecutor Michael Morris said in a statement.\n\n'Today’s plea resolves the case without the ordeal of the children having to testify.'\n\nBuchan lived with five other adults, including her mother Mary, 55, and sister Bridget, 23, in a property on Clinton Place where they systematically began to abuse the child from July 2018.\n\nThe boy's mother, Natacha Smith, 44, Patricia Gamarra, 62, and Homer Searcy, 39, all faced similar charges for aggravated assault and child endangerment.\n\nProsecutors said the abuse included a 'systematic and coordinated beating' of the boy with a belt and fists and the use of scalding water to punish him.\n\nThe Clinton Place apartment, pictured, was referred to as a 'house of horrors' by prosecutors\n\nBuchan, (bottom left), lived with five other adults in the property. Natacha Smith, 44, pictured top left, was the boy's mother who also lived at the 'squalid' apartment. Patricia Gamarra, 62 (top centre), and Homer Searcy, 39 (bottom centre), all faced similar charges for aggravated assault and child endangerment. Buchan's mother, Mary, 56, (bottom right), and sister, Bridget, 24, (top right), were also charged for the systematic beatings with a belt and fist\n\nThe three-year-old boy was treated for his injuries before being taken into protective custody.\n\nPolice said that his preschool's nurse discovered burns and blisters on the boy's legs, leading to the school notifying authorities, NBC New York reported.\n\nPolice said that the boy's preschool's nurse discovered burns and blisters on his legs, leading to the school notifying authorities about the alleged abuse. His mother, Natacha Smith, 44 (pictured), has also been charged with aggravated assault and child endangerment\n\nThe boy was also said to have had bruises on his stomach, back and face.\n\nFive other children lived in the same apartment, all of who are now in child protective services custody as well. It's unclear who the parents of these children are.\n\nNeighbors told WPIX that they didn't notice any excessive traffic in and out of the home. It's speculated that that could imply that there was drug activity.\n\nPatricia Buchan is the sister of Bridget and daughter of Mary. Gomarra is Buchan's sister.\n\nSearcy, who is not the boy's father, was already in custody on an unrelated issue when he was charged for abusing the boy.\n\nThe boy was one of six children who lived in the apartment, ranging in age from one to seven.\n\nAll children were removed to protective custody, according to officials.", "description": "A New Jersey mother-of-four has admitted to scalding a three-year-old boy under her care with boiling water at a home  referred to as a 'house of horrors' (pictured) by prosecutors.", "authors": ["Ryan Fahey For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/10/19984848-0-image-a-18_1571651932102.jpg", "published_at": "2019-10-21"}