{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/fortnite-end-season-event-sunday-servers-switch-off-straight-10875583", "downloaded_at": "2019-10-07 12:20:11.224061+00:00", "title": "Fortnite end of season event is this Sunday, servers switch off straight after", "language": "en", "text": "Fortnite is getting ready for some big changes\n\nSeason X has a new end date and it sounds like there’s going to be major change to the Fortnite map as soon as it’s over.\n\nThe current season of Fortnite will end on Sunday, 13 October at 7pm BST, but the big question on every fan’s lips is what happens afterwards.\n\nThe start of Season 11 was recently put back by a week, which is unusual in itself, but it comes amid rampant speculation that Fortnite is going to get a major revamp and perhaps even a completely new map.\n\nEpic Games has not commented on any of the speculation but there’s something weird going on with the usual end of season live event as well.\n\nNormally the end of season event happens a day or two before the season ends, but this time Epic Games will be switching off the servers the second it’s over – in order to get Season 11 ready to work afterwards.\n\nAdvertisement\n\nAdvertisement\n\nUnderlining the fact that something major is about to happen the TV screens in the game all have a countdown clock on them, making it all feel very apocalyptic.\n\nWhat exactly is going to happen is anyone’s guess, but it seems to have something to do with the rocket launchpad at Dusty Depot.\n\nWhether it’s a completely new map or simply a significantly revamped one we’ll have to wait and see but one possible change is that Fortnite will finally stop describing itself as Early Access, which has been its official status for two years now.\n\nEmail gamecentral@ukmetro.co.uk, leave a comment below, and follow us on Twitter\n\nMORE: Parents sue Fortnite for being too addictive\n\nMORE: Fortnite season 11 start date delayed, as Fortnite sales drop 52% in a year\n\nMORE: Fortnite looks like it’s getting a new map for Season 11", "description": "Season X has a new end date and it sounds like there’s going to be major change to the Fortnite map as soon as it’s over.", "authors": [], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/Screenshot_2-f286_1570446388.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}