{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7626723/Terrifying-moment-possessed-woman-tasered-trying-perform-EXORCISM-cop.html", "downloaded_at": "2019-10-30 00:11:47.556339+00:00", "title": "Terrifying moment a 'possessed' woman is tasered after trying to perform an EXORCISM on a cop", "language": "en", "text": "Stunned bystanders filmed the terrifying moment a woman was tasered as she tried to perform an 'exorcism' on a Wisconsin police officer.\n\nIn bizarre footage posted to Reddit, the distressed woman is seen charging towards the cop, screaming at him with her hand outstretched.\n\nThe officer appears to warn the woman as he backs away from her with his taser drawn and pointed towards her.\n\nThe woman ignores the officer's inaudible warning and starts running towards him, still screaming and holding her hand towards his face.\n\nThe uniformed cop is left with no option but to fire his weapon, sending the woman to the ground, convulsing from the electric shock.\n\nA woman approaches police trying to conduct an exorcism , but instead he tased her\n\nA woman puts an odd scene, screaming and calling for an exorcism of a cop, who sends her to the ground with his taser\n\nWhen a woman gets too close and too loud for a police officer in Wisconsin, she is forced to the ground by a taser\n\nA crowd gathered outside the Ultimart convenience store in Wisconsin as the alarming incident unfolded.\n\nThe footage was posted online where it has been viewed thousands of times.\n\n'She could have conducted herself a little better,' one person commented on Reddit.\n\nAnother viewer made fun of religious-themed tirade.\n\n'The power of 50,000 volts compelled her to collapse onto the ground.'\n\nIt's not known where exactly in the state the incident took place, but it the video was posted online Monday.", "description": "In bizarre footage posted to Reddit, the distressed woman is seen charging towards the cop, screaming at him with her hand outstretched as he points his weapon at her outside an Ultimart store.", "authors": ["Jerry Barmash For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/17/20337524-0-image-a-20_1572369350080.jpg", "published_at": "2019-10-29"}