{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/catherine-full-bodys-successes-make-its-reductive-gender-tropes-sting-so-much-more", "downloaded_at": "2019-09-06 12:18:21.708702+00:00", "title": "Catherine: Full Body's Successes Make Its Reductive Gender Tropes Sting So Much More", "language": "en", "text": "“It’s aged nicely, with a sensual flavour, not unlike a fine wine,” purrs Trisha in Atlus’ Catherine: Full Body while sipping a glass of red, describing the “program” on the analogue TV on the bar next to her.\n\nA gentle haze of golden sparkles twinkle around the gigantic red afro puffs bouncing on either side of her face. She’s “the Midnight Venus,” our “guide for the night” through the Golden Playhouse Special Feature. That special feature is the story of Vincent Brooks, Catherine’s protagonist.\n\nThe opening scene is the first in a parade of aesthetic flourishes and unwavering camp that made this game stand out. It’s disappointing, then, that Catherine: Full Body — the 2019 remix of the game that first came out in 2011 — not only fails to fix some of the narrative issues with Catherine but also adds to some of them.\n\nIn both the original and updated versions of Catherine, protagonist Vincent Brooks is a 32-year-old man who’s fallen into a comfortable routine with his longtime girlfriend, Katherine McBride. He’s shaken out of his complacency when Katherine brings up the subject of marriage, which deeply freaks him out.\n\nOn top of that, another woman named Catherine suddenly appears in his life; he meets her at his local hangout, the Stray Sheep bar. After a night of drinking, he wakes up in bed next to her but has no idea what happened.\n\nAround that time, he also begins having nightmares during which he has to climb a gigantic tower of blocks, nightmares that he forgets every morning but which seem to be connected to a growing trend in his waking life of other men dying suddenly and gruesomely in their sleep.\n\nThe game is split between these nightmares and Vincent’s time at the Stray Sheep, where he can drink, text the women in his life, and talk with other patrons, some of whom appear in his nightmares in sheep form. The choices you make during these interactions, particularly the text messages, move the dial on a metre that affects some of Vincent’s interactions in the short term and determines the game’s several possible endings in the long term. It’s a dating sim with puzzles, basically.\n\nThe original 2011 version of Catherine is a cult classic, but it doesn’t go down without a few eye rolls. While the game halfheartedly tries to make its characters more complex, Katherine is often portrayed as a shrewish would-be wife to Vincent’s clueless sitcom spouse archetype, and Catherine is all titties and giggles when she’s not showing her violently threatening jealous streak.\n\nCatherine’s mood swings are made even worse when you remember that the entire game takes place over the course of about a week. Side characters range from wildly sexist pigs to men with mummy issues, often played for laughs. “Men who want to control women tend to have a desire to be controlled by them. It’s the truth,” one character opines.\n\nThe game became a cult hit because the core gameplay of puzzling and decision-making is compelling, but also, it’s hard not to get caught up in the campiness and surreality of its narrative style at moments.\n\nIt’s full of predictable tropes based in reductive assumptions about the supposedly wide gulf between men and women, but it’s also got some moments that are actually funny and relatable. This new remix of Catherine keeps in all of the good and bad from the original. It also adds in new narrative paths, which — similar to the original — have their good and bad moments.\n\nThe game still works surprisingly well, a testament to Atlus’ talent for making games greater than the sum of their parts thanks to aesthetic flourishes and attention to detail. Throughout the game, for example, a “Golden Playhouse” logo appears during cutscenes, reminding you that you’re watching a program.\n\nWhenever you finish a drink at the bar, a smooth voice chimes in to give you real, actual fun facts about alcohol. There’s a text message Vincent receives from his phone carrier about online storage with the subject “Attachment Issues.” Loading screens feature quotes from all sorts of real-life artists about love and dating and life.\n\nVincent looking at his phone in a bar and trying to open a photo that turns out to be an unexpected nude leads to the familiar reflex of having to quickly and shamefully hide the screen from others; you can only actually open it in the bathroom.\n\nUsing the framing device of the “Golden Playhouse” program, Atlus has seamlessly incorporated Full Body’s new additions as though they are also part of the show. The most notable difference is that there’s now a third woman to expand Vincent’s messy love life, Rin (thankfully she doesn’t go by her other name, Qatherine).\n\nThe story is told with a mixture of smooth, late-night-jazz-radio-style narration, dialogue, and anime cutscenes, drawing on influences from romance, horror, sitcoms and even literature. As Vincent drinks and dreams his way through a whirlwind week of women, wine, and wumbo-size trouble, I find myself wondering how a game could at once be so out-there and charming while also bafflingly leaning on some of the worst tropes of the discourse it draws upon.\n\nCatherine presents ideas about men and women and dating through the lens of a bunch of hapless adults trying to figure their shit out. The game is full of stories that delve into the complexities of adulthood and gender, and its moments of cleverness in this area make its missteps feel all the more frustrating.\n\nWhile there are some pretty ridiculous views about gender in the game, many of them are very clearly framed as the asinine ramblings of men navigating a sexist society. There are worthwhile conversations to find in the game, and the general interrogation of monogamy was refreshing. Full Body more prominently introduces the idea of love transcending societal boundaries like gender, which was also pretty cool at first.\n\nUltimately, though, Full Body failed to do these topics justice.\n\nIn both its original form and its remix, Catherine attaches the idea of polyamory to a maniacal succubus. The True ending to the storyline in which Vincent chooses Catherine, the blond bombshell who shakes Vincent’s life up, involves him becoming a demon and leading a life of wild sexual escapades. And there’s nothing wrong with becoming a demon if that’s what you’re into, or whatever, but in a broader thematic sense, the ending is an extremely flat and sex-obsessed way to think about polyamory.\n\nOn the game’s choice metre, which is presented as Freedom vs. Order, it’s the Freedom option. Despite the fact that in real life, polyamory often introduces yet more moving pieces to manage, the game treats it like a disordered free-for-all and frames monogamy as a sure shot for stability. Neither is true.\n\nFull Body continues Catherine’s trend of trying to meaningfully interrogate social taboos but falling short. First, there’s Rin, whose storyline gets folded into the narrative smoothly but still has a host of its own issues.\n\nFirst off, there’s a strange white knight vibe between her and Vincent that’s supposed to be sweet but comes off sort of creepy. In their first meeting, Vincent saves her from a stalker, then learns that Rin has amnesia. He then helps her get a job and an apartment… right next door to his.\n\nShe appears young and innocent, and while I don’t get straight up underage love affair vibes from the situation, her sheer naiveté makes moments like Vincent noticing her bare skin and zipping up her hoodie while blushing feel a little gross.\n\nThen there’s Rin’s central conflict. Late in the story, Vincent sees her naked; the player doesn’t see what Vincent sees, but he reacts with shock when looking at her genitals. He freaks out, slaps her hand away, and runs out the door. After this, other characters arbitrarily start calling Rin a man and using he/him pronouns to refer to her.\n\nLater, Vincent explains that he doesn’t know whether Rin even thinks about gender in such a binary way, which may be true, since in an earlier scene she explains that she doesn’t see what the big deal is with the gender of people in love. But for some reason, Vincent still finds issue with calling her a woman, despite the fact that one of his closest friends, Erica, is trans.\n\nHe also doesn’t go so far out of his way to correct other characters when they call Rin a man. “Woman might not be the best word,” Vincent explains to Katherine in an ending where he chooses Rin. “They must be really special,” Katherine responds.\n\nErica, who is clearly hurt by Vincent’s behaviour, scolds Vincent for reacting to Rin so poorly. After this conversation, Vincent gets over himself and decides to apologise to Rin.\n\nSpeaking of Erica, her and Vincent’s old high school friends, Orlando and Chief, constantly make snide comments about Erica’s womanhood and continually warn their younger friend Toby not to date her (he does anyway). Toby notes that when they eventually have sex — Toby’s first time, by the way — “there’s something weird about it.”\n\nIn one ending, Toby even asks for his “v-card” back after finding out Erica is trans. These depictions play with dangerous ideas about disclosure and the idea of trans women “trapping” men, which is a nasty stereotype.\n\nAlso, the moments when Vincent’s friends are being transphobic douchebags aren’t really pushed back on by other characters in the same way that a lot of other silly dating ideas get debated and pushed back on in characters’ conversations in the game. Vincent’s bigoted friends don’t get any flack for comments like this: “No matter how cute, the kid’s packin’ heat, man.”\n\nFor a game that’s about conflicting opinions and learning and growing, the transmisogynistic moments are given a lot of breathing room and seem to be played for laughs at trans women’s expense.\n\nIt’s unfortunate, because Erica is otherwise written as a plucky, interesting woman with a lot of empathy for her friends. But a reasonable character in an absurd story can easily end up looking like more of a footstool for other characters’ growth than a real person.\n\nSome of the new additions to Catherine work better than others. The new ending for Katherine shows her coming into her own in an awesome way and leaving Vincent in the dust, which I found refreshing. The new ending for Catherine bafflingly erases the transition of Erica, its first trans character, with no explanation, which I found infuriating.\n\nThe addition of Rin excited me as a nonbinary person until they handled the language around her so poorly — not to mention, she ultimately ends up revealing that she is an alien. This reveal meant to be a fun upturning of the fact that Vincent thought her whole “secret” deal was being trans, but it’s kind of a silly way to address that for a game that started off so deeply entrenched in banal gender essentialism.\n\nIn the end, Rin’s addition made Vincent much more compelling than he seemed in the original. Preceding his blowup in Rin’s apartment, he isn’t a ball of speechless nerves around her like he is with the other [-]atherines, instead showing an actual gentle side that makes it less baffling for Katherine and Catherine to have liked him in the first place.\n\nBetween his irresponsible binge-drinking and superhuman displays of indecision, it’s pleasant to see Vincent be a functional person for once. Some of the newly added scenes have made the rest of the game stronger as well. Sweet, early glimpses of Katherine and Vincent’s relationship make her seem far more relatable and less cartoonishly shrewish.\n\nBut the game continues to hamstring itself with the way it balances Vincent’s supporting characters, especially the ridiculous portrayal of Catherine. Full Body is certainly less flat than its source, but for a game so lovingly detailed in its weird, sexy execution, its missteps are hard to ignore.\n\n“Men and women. They’re more complicated than you think!” a triumphant Vincent exclaims toward the end of the game as he surmounts dream-world obstacles to reach self-actualisation.\n\nIt’s hilariously on the nose, and at some point, maybe in 2011 when the game came out, it probably seemed like a good thesis for an edgy game about sex and lust and love. But it also encapsulates the game’s issues: Gender is more complicated than just men and women, just like human relationships are more complicated than the binary of freedom and order.\n\nFor all its navel gazing, Catherine never quite breaks out of those restraints.", "description": "“It’s aged nicely, with a sensual flavour, not unlike a fine wine,” purrs Trisha in Atlus’ Catherine: Full Body while sipping a glass of red, describing the “program” on the analogue TV on the bar next to her....", "authors": ["Nathan Grayson", "Alex Walker"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/ihhodksffdaqrrkr0tdg.jpg", "published_at": "2019-09-06"}