{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7608297/David-Beckham-enjoys-lads-night-sons.html", "downloaded_at": "2019-10-24 16:18:01.034369+00:00", "title": "David Beckham enjoys a lads' night out with his sons", "language": "en", "text": "Wednesday evening gave David Beckham another opportunity to bond with his three sons as they made their annual pilgrimage to the Haunted Hayride in Los Angeles.\n\nWith Halloween looming the Beckham lads ensured they did not miss the Griffith Park event and its array of seasonal attractions - among them a Trick-or-Treat haunted maze and Midnight Mortuary haunted house.\n\nAnd taking to Instagram, David, 44, kept fans updated on their night out at the venue, a firm favourite with the former Manchester United midfielder and his children.\n\nSpooky: Wednesday evening gave David Beckham another opportunity to bond with his three sons, Brooklyn, Romeo, and Cruz, as they made their annual pilgrimage to the Haunted Hayride in Los Angeles\n\nWith Victoria and Harper nowhere to be seen, the boys let their hair down as they made their way through the labyrinthine maze of Halloween themed scares.\n\nAmong the obligatory images of intricately carved pumpkins, David also shared clips of 'zombies' lurching through the fog, 'psychopaths' bursting through trailer doors and decomposing 'dead bodies' slumped lifelessly in wooden shacks.\n\nWhile it only takes a modest 25-minutes to get from one side of the Hayride to the other, it was enough to get the best of 14-year old Cruz, whose apparent terror clearly amused his famous father.\n\nScary: While it only takes a modest 25-minutes to get from one side of the Hayride to the other, it was enough to get the best of Cruz, whose apparent terror clearly amused his father\n\nWatch out: David included clips of 'zombies' lurching through the fog among his many Instagram stories (L), while Brooklyn appeared to enjoy himself at the annual Halloween event (R)\n\nStandard: As always, there were plenty of intricately carved pumpkins on display\n\nThe Hayride is however familiar ground for the Beckham clan who have been regular visitors in the years following David's move to Los Angeles Galaxy in 2007.\n\nThe family, who divide their time between America's west coast and their native UK, have been spending the half term break in LA - where the family still own property.\n\nWhile there were white faces all round after Wednesday's appearance at the Halloween venue, David's wife Victoria Beckham almost left him red-faced by revealing that he often steals her beauty products for himself.\n\nHere we go: 'Psychopaths' bursting through trailer doors (L) and decomposing 'dead bodies' slumped lifelessly in wooden shacks (R) also featured in David's Instagram stories\n\nOld times: The Hayride is however familiar ground for the Beckham family, who have been regular visitors in the years following David's move to Los Angeles Galaxy in 2007 (pictured at the venue in 2017)\n\nSpeaking about her husband's fondness for her products on This Morning, the designer said: 'David one hundred percent steals my beauty products. We share beauty products.'\n\nThe former singer discussed her family further in the interview, telling how make-up is one of the ways she bonds with her daughter Harper, eight.\n\nShe said: 'Harper’s really girly so we do enjoy make up at home. I mean, she wouldn’t go out of the house with make up on obviously, but I think it’s a really nice thing you can do with your daughter, you know. Play with make up and have fun.'\n\nIt comes after David recently revealed he insists on instilling work ethic in his children, telling them: 'You'll never get anywhere without making sacrifices.'\n\nAsked what advice he gives Brooklyn, Romeo, Cruz and Harper, the former England captain told GQ magazine: 'To work hard, simple as that.'", "description": "With Halloween looming the Beckham lads ensured they did not miss the Griffith Park event and its array of seasonal attractions - among them a Trick-or-Treat haunted maze.", "authors": ["Jason Chester For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/09/20122096-0-image-a-22_1571906453464.jpg", "published_at": "2019-10-24"}