{"pub": "townhall", "title": "Making Recession Constructive", "url": "https://finance.townhall.com/columnists/markminnella/2019/08/28/making-recession-constructive-n2552309", "language": "en", "published_at": "2019-08-28", "downloaded_at": "2019-09-02 07:04:32.675465+00:00", "text": "For the past 18 months or more, we have been inflicted with the screeching warning cries of a soon-to-come economic recession. Every chance and every possible indicator have been scrutinized to find some weakness in this strong economy. It seems the doomsayers won’t be happy until they see a downturn. Still, the economy keeps pushing forward with strength and vigor.\n\nNow don’t get me wrong, someday we will see a recession again. Eventually, our economy will pause and even slow down. But truth be told, no one can predict when such a change will occur. Only God has the power to know the future. Everyone else is just guessing or projecting—maybe a sophisticated guess, but a guess just the same.\n\nThe motives for those rooting for a recession may be political or possibly well-intentioned. Either way, we just don’t know what, how or when an economic downturn will occur. The good news is that the concern about such a recession could be a catalyst for some positive impact in our lives. Whether or not a recession materializes, we can use this moment as a wake-up call to review our personal finances and shore up our lives to ensure we are prepared for both good times and bad.\n\nDuring good times, it is easy to get comfortable with and pay less attention to our finances. This behavior could lead to us drifting outside the safety of a well-kept financial path.\n\nLet's take a look at three key financial areas that seem to drift the most and have the potential to put us at risk when economic shifts occur.\n\nOf all the categories, debt may be the biggest culprit to financial instability. It starts out harmless, but can quickly grow into a cash-consuming overlord. When times are good, making those monthly payments is doable. When the economy contracts, causing layoffs or downgrades of some sort to your take-home pay, those easy monthly payments aren’t so easy anymore. The solution: start reducing debt and moving toward being debt-free as quickly as possible.\n\nThe second area of mischief worth visiting is the concept of building a moat around your castle—not a liquid-filled trench as in the days of old, but a moat of liquidity. Cash reserves protect your wealth from being plundered by the necessity of falling into debt when the unexpected occurs.\n\nThe old rule of thumb of having three to six months of overhead is a good start, but also saving and preparing for those normally unaccounted-for occasional expenses, such as home and car repairs, birthday and wedding gifts, taxes and health care needs, is wise. By doing so, you not only prepare for financial disturbance but may just eradicate the possible debt saga mentioned above.\n\nA third category is lifestyle. Make sure you haven’t drifted into a lifestyle that is only sustainable under perfect conditions. It is all too easy to adapt upward when things are improving, and so incredibly hard to adjust downward when finances begin to decay. Avoid the pain by adjusting your lifestyle now to include upside margin that could also act as a downside buffer.\n\nOne bonus category to consider is your retirement and other investments. Now might be a good time to review your portfolio holdings. A flight to quality can often occur as a recession slips in, so check to see if there are any speculative, fundamentally weak holdings that might be ravaged by an economic downturn.\n\nBecause you may be making moves anyway, it might also be an excellent time to consider how your investments might be profiting from or promoting things that are in direct conflict with your personal values and beliefs. A quick way to do this is to utilize the free biblically responsible screening tool at nacfc.org.", "description": "For the past 18 months or more, we have been .09/02/2019 3:04:29AM EST.", "authors": ["Mark", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/235/bb2d0f2f-5b32-434f-903e-a6f0867db76d.jpg"}