{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/us-sec-rejects-bitwise-bitcoin-etf-proposal", "downloaded_at": "2019-10-10 00:04:04.949430+00:00", "title": "US SEC Rejects Bitwise Bitcoin ETF Proposal", "language": "en", "text": "The United States Securities and Exchange Commission (SEC) has rejected a proposal to list a Bitcoin (BTC) exchange-traded fund (ETF).\n\nIn an announcement on Oct. 9, the Commission stated that the ETF filing from Bitwise Asset Management and NYSE Arca did not meet the necessary requirements.\n\nSpecifically, regulators stated that the applicants did not meet the necessary requirements regarding possible market manipulation and illicit activities. The SEC wrote:\n\n\"Rather, theCommission is disapproving this proposed rule change because, as discussed below, NYSE Arcahas not met its burden under the Exchange Act and the Commission’s Rules of Practice todemonstrate that its proposal is consistent with the requirements of Exchange Act Section6(b)(5), and, in particular, the requirement that the rules of a national securities exchange be'designed to prevent fraudulent and manipulative acts and practices.'\"\n\nBitcoin ETF \"closer than ever?\"\n\nToday's decision by the SEC seems to fly in the face of recent comments from Matt Hougan, managing director and global head of research at Bitwise, who on CNBC on Oct. 7 said, “We’re closer than we’ve ever been before to getting a Bitcoin ETF approved.”\n\nHougan had been optimistic about the firm's chances to land approval for a physically-held Bitcoin ETF. He noted the significant growth that has transpired in the crypto space in recent years, stating:\n\n“Two years ago, there were no regulated, insured custodians in the Bitcoin market. Today, ... there are big names like Fidelity and CoinBase [with] hundreds of millions of dollars of insurance from firms like Lloyd’s of London.”\n\nThe rejection of Bitwise's proposal follows a circuitous series of delays and requests for comment from the SEC. In August, the regulator postponed its decision on the proposal — together with two other crypto ETF applications — until Oct. 13.\n\nBitwise initially filed its application for a rule change to U.S. securities laws in January.", "description": "US SEC Rejects Bitwise Bitcoin ETF Proposal | News by Cointelegraph", "authors": ["Aaron Wood"], "top_image": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5ldS1jZW50cmFsLTEuYW1hem9uYXdzLmNvbS9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMTktMTAvZjI1Y2QyZjAtZTliYS00YjQ5LWFmZTUtYTg3ZWM4NzExZDc3LmpwZw==.jpg", "published_at": "2019-10-09"}