{"pub": "yahoo", "url": "https://news.yahoo.com/russia-releases-damning-evidence-u-173000250.html", "downloaded_at": "2019-10-29 23:57:27.343901+00:00", "title": "Russia Releases Damning Evidence Of The U.S. Smuggling Syrian Oil", "language": "en", "text": "MOSCOW, October 26, 2019 – RIA Novosti – The Russian Ministry of Defense has published satellite intelligence images, showing American oil smuggling from Syria.\n\n(Click to enlarge)\n\nImage 1: Situation in the Syrian Arab Republic as of October 26, 2019.\n\nAccording to the ministry, the photos confirm that “Syrian oil, both before and after the routing defeat of the Islamic State terrorists in land beyond the Euphrates river, under the reliable protection by US military servicemen, oil was actively being extracted and then the fuel trucks were massively being sent for processing outside of Syria.”\n\n(Click to enlarge)\n\nImage 2: Daman oil gathering station, Syria, Deir ez-Zor province, 42 km east of Deir ez-Zor, August 23, 2019.\n\nHere, in a picture of the Daman oil gathering station (42 kilometers east of the Deir-ez-Zor province), taken on August 23, a large amount of trucks were spotted. “There were 90 automotive vehicles, including 23 fuel trucks,” the caption to the image said.\n\nIn addition, on September 5, there were 25 vehicles in the Al-Hasakah province, including 22 fuel trucks. Three days later, on September 8, in the vicinity of Der Ez-Zor, 36 more vehicles were recorded (32 of them were fuel trucks). On the same day, 41 vehicles, including 34 fuel trucks, were in the Mayadin onshore area.\n\n(Click to enlarge)\n\nImage 3: Gathering of vehicles in Syria, Al-Hasakah province, 8 km west of Al-Shaddadi, September 5, 2019.\n\nAs the official representative of the Defense Ministry Igor Konashenkov noted, the Americans are extracting oil in Syria with the help of equipment, bypassing their own sanctions.\n\nRelated: Tesla’s Tipping Point: Breaking Into China\n\nIgor Konashenkov:\n\n“Under the protection of American military servicemen and employees of American PMCs, fuel trucks from the oil fields of Eastern Syria are smuggling to other states. In the event of any attack on such a caravan, special operations forces and US military aircraft are immediately called in to protect it,” he said. According to Konashenkov, the US-controlled company Sadcab, established under the so-called Autonomous Administration of Eastern Syria, is engaged in the export of oil, and the income of smuggling goes to the personal accounts of US PMCs and special forces. The Major General added that as of right now, a barrel of smuggled Syrian oil is valued at $38, therefore the monthly revenue of US governmental agencies exceeds $30 million.\n\n(Click to enlarge)\n\nImage 4: Gathering of vehicles in Syria, Deir ez-Zor province, 10 km east of Mayadin, September 8, 2019.", "description": "The Russian military just dropped a geopolitical bomb, with satellite imagery supposedly showing the United States smuggling oil from Syria", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/QW6ubzSXU4GyuKHPh5wa2Q--~B/aD05MDA7dz0xMjcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/oilprice.com/24f5101378b422e516ab0ca32cd339e6", "published_at": "2019-10-29"}