{"pub": "financialpost", "url": "https://business.financialpost.com/personal-finance/family-finance/following-a-lay-off-its-tackling-a-hefty-mortgage-that-is-this-couples-biggest-hurdle-to-retirement", "downloaded_at": "2019-10-05 05:48:00.296435+00:00", "title": "Following a layoff, it’s tackling a hefty mortgage that is this couple’s biggest hurdle to retirement", "language": "en", "text": "Situation: Laid off four years ago, consultant has big mortgage but wants to plan retirement\n\nSolution: Invest more efficiently by adding to RRSPs and using tax refunds to pay down the mortgage\n\nIn British Columbia, a couple we’ll call Burt, 52, and Lucy, 50, are headed toward retirement. It’s still a decade or more in the future, but they have become more concerned about their plans since Burt was laid off by a local advertising business in 2015. Resilient, he created his own business and they are still able to live comfortably on a combined $10,120 in monthly take-home income. But it’s the future that worries them.\n\n(E-mail andrew.allentuck@gmail.com for a free Family Finance analysis.)\n\nBurt’s company does management consulting, while Lucy works for a local government and is part of its pension plan. Together, the couple has $2.45 million in assets, the largest parts of which are their $1.8-million house — a typical valuation in the Lower Mainland — and $417,832 in locked-in retirement accounts (LIRAs). They worry that their $447,925 outstanding mortgage will limit their retirement options. Moreover, Burt’s business is small and could become a victim of the up-and-down B.C. economy.\n\n“We are concerned that, at our age, we still carry a large mortgage,” Burt said. “Our goal is to keep our home, retiring as early as we can, while ensuring that we have enough money to enjoy travelling and entertaining.” Their goal: a $6,000 monthly after-tax income when they retire.\n\nA very big mortgage\n\nFamily Finance asked Derek Moran, head of Smarter Financial Planning Ltd. in Kelowna, B.C., to weigh the couple’s options. Their $1.8-million house is a huge part of their net worth of approximately $2 million, he notes. Servicing the mortgage costs them $3,840 per month, 44 per cent of their $8,790 monthly spend.\n\n“The mortgage is the anchor they are tied to,” Moran said. “They want to get that paid off before they can retire with financial security. The way to do it is to mobilize almost $500,000 in investment assets. There is $90,000 in cash in Burt’s private corporation account. It can be used more productively than earning trifling bank interest. But they can also leave the mortgage as is and boost retirement income.”\n\nThe couple will have Lucy’s $25,920 annual pension at 65 and two Canada Pension Plan benefits that should be about $12,000 each per year in 2019 dollars. Each will have full Old Age Security benefits, currently $7,290 per person.\n\nBoosting retirement income means getting capital invested to produce higher returns than low-interest cash, keeping investment fees down, and putting the shares of one large telco that pays a hefty, dependable dividend along with the corporate cash into RRSPs, in which they have significant contribution room.\n\nRetirement savings\n\nThe couple is putting $150 per month into an RESP for their 21-year-old child, who is too old to receive Canada Education Savings Grants, which stop at 17. It barely pays to continue with the contributions. Moreover, the child is in fourth year and almost done with a first degree. Add that annual $1,800 to the money going to RRSPs, too.\n\nThe couple can make a one-time RRSP contribution of $84,270, using money currently held in two taxable investment accounts plus $18,000 in corporate cash, and get a hefty refund of about 35 per cent, or about $30,000 that could be put toward dropping their mortgage to $417,925. With no change in mortgage payments, totalling $46,080 per year, they would cut the amortization by about a year and save $6,500 of interest. Alternatively, they could leave the mortgage as is and boost their retirement savings.\n\nBurt and Lucy have $428,706 in combined RRSPs and LIRAs. If they transfer in assets of $151,270 from the balance of corporate cash, as well as $72,000 and $66,000 in taxable securities accounts, the sum of their registered assets would rise to $579,976.\n\nIf they add $10,000 currently saved in Burt’s corporation each year and the $150 per month going to the RESP, and if these funds, all within the RRSP, grow at three per cent per year after inflation, it would become $1,048,900 when Burt is 65. If that capital continued to grow at three per cent and was evenly paid out, it would support annual taxable income of $49,600 for the following 32 years until Lucy is 95, Moran calculates. The enhanced income paid over three decades would more than equal the mortgage cost reduction, Moran adds.\n\nRetirement income\n\nLooking ahead to retirement when Burt is 65 and Lucy is 63, they would have her $25,920 work pension, Burt’s approximately $12,000 in CPP benefits, his $7,290 OAS benefit, and $49,500 in combined RRSP/LIRA payouts. That’s a total of $94,710. Split and taxed at an average rate of 15 per cent, they would have $6,700 per month to spend. That’s more than their $6,000 monthly retirement after-tax income target.\n\nAfter Lucy turns 65 and her CPP and OAS start, family income would rise by $19,220 per year to $113,930. After 18-per-cent average income tax, they would have $7,785 per month to spend.\n\nThe present mortgage balance of $447,925 with 12 years to run will have been paid off when Burt is 64, or a year earlier if RRSP refunds are applied to take a year off the amortization. Family expenses, without further RESP savings, will have declined to about $4,800 per month, leaving a good deal of cash for discretionary spending or perhaps donations to good causes.\n\nMost of the suggested income increase comes from more efficient use of the money currently invested inefficiently for retirement purposes in fully taxable accounts. There would be taxes to pay when money is shifted to the RRSPs, but the gains in investment returns over cash and immediate tax savings would outweigh the costs. The timing of any shifts would, of course, affect the taxes to be paid and time to realize investment gains, Moran notes.\n\nThere are risks in this plan. During the next decade, a one per cent increase in the present mortgage interest rate would add $190 to monthly payments and a two per cent rise would add $380. Just ending RESP contributions, as suggested, would cover some of that possible increase, which Moran notes would probably not happen for years and would apply to a much reduced mortgage balance.\n\n“These folks can be better off by making idle cash productive,” Moran said.\n\nRetirement stars: 4 **** out of 5\n\nFinancial Post\n\nFor a free Family Finance analysis, e-mail andrew.allentuck@gmail.com.", "description": "The key for this couple is to make all that idle cash they have productive", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2019/08/family-finance-march-9.png", "published_at": "2019-08-23"}