{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/7/ilhan-omar-seeks-divorce-husband-ahmed-hirsi", "downloaded_at": "2019-10-07 23:33:13.848545+00:00", "title": "Ilhan Omar files for divorce", "language": "en", "text": "MINNEAPOLIS — U.S. Rep. Ilhan Omar has filed for divorce from her husband, citing an “irretrievable breakdown” of her marriage.\n\nThe freshman Democrat filed for divorce from Ahmed Hirsi on Friday in Minnesota’s Hennepin County District Court. Omar and Hirsi have been legally married since 2018 but have been together for years.\n\nThe petition, which Omar signed Friday while in Burkina Faso, does not elaborate on what caused the marriage to break down. It comes more than a month after a Washington, D.C., woman accused Omar of having an affair with her husband.\n\nWhen Omar was asked at the time whether she was separated from her husband or dating someone, she told WCCO-TV, “No, I am not.” She has since declined to discuss her personal life.\n\nOmar’s attorney, Jaime Driggs, issued a statement Monday saying: “As with all marriages, this is intensely personal and a difficult time for their family. For years, Ilhan and Ahmed have been the object of speculation and innuendo from political opponents and the media.”\n\nDriggs said this has taken a toll on the family, and that Omar wished for privacy and would have no further comment.\n\nWhen asked specifically whether Omar had an affair, Driggs did not answer but referred back to his statement. Omar’s office said it would only discuss official matters.\n\nThe court case does not list an attorney for Hirsi. A working phone number for Hirsi was not immediately available and he did not return emailed requests for comment.\n\nOmar has been dogged by questions about her personal life since she first ran for state representative in 2016, with some conservatives alleging she was married to two men at once and that one of them was her brother - claims she called “disgusting lies.”\n\nThe claim that Omar married her brother was repeated by President Donald Trump, who has made Omar a frequent target of attacks on Twitter and in public, including at a rally in which he said Omar and three other Democratic congresswomen of color should “go back” to their home countries. All four women are U.S. citizens, and Omar is the only one who wasn’t born in the U.S.\n\nAside from a period of separation during which Omar was married to Ahmed Nur Said Elmi, Omar has been with Hirsi for years and she says he is the father of her three children.\n\nMarriage license and divorce records show Omar legally married Hirsi last year after her divorce from Elmi was finalized.\n\nBeth Mynett, the Washington woman who filed for a divorce in August, claimed Omar had an affair with her husband, Tim Mynett, who has worked as a political consultant for Omar.\n\nIn his own court papers, Tim Mynett denied his wife’s assertion that he told her he was in love with Omar and that he was ending his marriage for the congresswoman. Mynett and his attorney did not immediately reply to messages left Monday by the AP.\n\nOmar’s divorce petition was first reported by TMZ.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "U.S. Rep. Ilhan Omar has filed for divorce from her husband, citing an \"irretrievable breakdown\" of her marriage.", "authors": ["The Washington Times Http", "Amy Forliti"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/07/Congress_Omar_Divorce_12111.jpg-500cc_c0-272-3269-2177_s1770x1032.jpg?8a3e399a2177e67972b75b5d93292b147c7622e0", "published_at": "2019-10-07"}