{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7553715/College-drop-23-claims-hes-millionaire-learning-trade-Forex-YouTube.html", "downloaded_at": "2019-10-09 11:00:57.467526+00:00", "title": "College drop out, 23, claims he's become a millionaire after learning to trade Forex on YouTube", "language": "en", "text": "A college drop out, with four GCSEs, who was told he would never amount to anything has become a millionaire after learning to trade Forex on YouTube.\n\nLuke Blackburn, 23, from Brough, East Riding of Yorkshire, says he now owns three houses, expensive cars and enjoys six jet-setting holidays a year after he amassed a fortune trading on the foreign exchange market.\n\nLuke Blackburn, 23, from Brough, East Riding of Yorkshire (pictured) says he has amassed a fortune trading on the foreign exchange market\n\nLuke said he was told by lecturers that he would struggle to find a job with his few qualifications when he dropped out of college in December 2013.\n\nAfter dropping out he secured an apprenticeship at an IT company which is when he began to trade Forex.\n\nHe said: 'I started with a small loan of £1,000 when I was just 18.\n\n'A few of my friends traded at the time and I thought 'why not, let's give it a go'.\n\n'As I was trading people were asking for help and I realised that I could make money that way too.\n\n'All the while I was still working as an apprentice. I never thought it would take off to what it has done.\n\n'My original goal was just to earn a few extra hundred pounds each month.'\n\nLuke now charges people hundreds of pounds to learn his trading tips.\n\nHe frequently posts snaps from his glamorous lifestyle, including piles of cash and champagne, but says money doesn't mean anything to him.\n\nAfter dropping out of college, Luke (pictured) secured an apprenticeship at an IT company, which is when he began to trade Forex\n\nHe has four GCSEs and says he was told by lecturers that he would struggle to get a job. Now he says he owns three houses and expensive cars like the Mercedes pictured above\n\nHe said: 'I'm a working class guy from Hull.\n\n'I'm a pretty down to earth person, I've come from a normal family with normal jobs.\n\n'I've worked hard and as far as I'm concerned I can spend my money on whatever I like.\n\n'I never wanted to worry about paying for anything. I saw how much my mum struggled when we were growing up and I knew I didn't want to do that.\n\nHe said: 'My parents worked very hard to support our three brothers and always gave us whatever we needed.\n\nHe frequently posts snaps from his glamorous lifestyle, including piles of cash (pictured above) and champagne, but says money doesn't mean anything to him\n\nHe now charges people hundreds of pounds to learn his trading tips. Designer gear owned by Luke includes a Gucci wallet (pictured above)\n\n'My mum always said 'you need to do well' and definitely instilled a strong work ethic in me.'\n\nLuke began to trade with his business partner and left his apprenticeship after one year to trade Forex full time.\n\nHe said: 'It was getting too much to balance trading and a full-time job.\n\n'My parents thought I was mad to leave but I told them I would make a success of it.'\n\nLuke has now built a small business empire of rental properties, investments and claims to rake in between £15,000 - £50,000 a month through his trading and teaching business.\n\nLuke has now built a small business empire of rental properties, investments and claims to rake in between £15,000 - £50,000 a month through his trading and teaching business (pictured in New York above)\n\nHe claims to own three buy-to-let properties, four luxury watches and frequently picks up bills for his parents and other family members.\n\nHe said: 'It's a difficult question to answer but once you add all of my assets up I'm worth about £1,000,000.\n\n'Despite the money though the goal was never to become a millionaire. I just want to be stress free and comfortable. I don't want to worry about bills or anything like that.\n\n'I can work wherever and whenever I want to. I don't need an office. All I need is a laptop and an internet connection.'\n\nLuke said his main tip to any wannabe trader is not to get too stressed out when things are going badly.\n\nHe said: 'I'm a working class guy from Hull' (pictured enjoying one of his jet-set holidays)\n\nHe said: 'It's great when things are going well but the crucial thing is how you react when things aren't going the way you planned.\n\n'Don't rush, don't try and have a specific goal, just let it flow and don't put stress on yourself, don't take it too seriously.\n\n'If it happens, it happens, if it doesn't it doesn't.'", "description": "Luke Blackburn from Brough, East Riding of Yorkshire, now owns three houses and enjoys six jet-setting holidays a year after he amassed a fortune trading on the foreign exchange market.", "authors": ["Chantalle Edmunds For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/10/19483530-0-image-a-2_1570613508039.jpg", "published_at": "2019-10-09"}