{"pub": "realclearpolitics", "url": "https://fivethirtyeight.com/features/whats-behind-warrens-rise-in-the-polls", "downloaded_at": "2019-10-07 19:46:34.720111+00:00", "title": "What’s Behind Elizabeth Warren’s Rise In The Polls?", "language": "en", "text": "Sen. Elizabeth Warren has come a long way in the polls since the early days of her 2020 presidential campaign. Back in April, she was polling in the mid single digits nationally, but she now leads a number of national and early-state polls. And based on polls from September and August, Warren has expanded her support in a few overlapping directions — making inroads with groups and categories of voters she was previously struggling with. The result is that she is now positioned as the leading alternative to former Vice President Joe Biden. Here’s a look at where Warren has made inroads, so far:\n\nWarren is appealing to more moderate voters now, too\n\nAlong with Sen. Bernie Sanders, Warren has long been a favorite among more liberal voters. And since June, she’s actually been the top choice among very liberal voters, according to polling from Quinnipiac University. Now, however, there’s evidence she’s picking up support from more moderate voters, too. In the latest Quinnipiac national survey, Warren not only inched ahead of Biden in overall support from Democratic voters and Democratic-leaning independents, 27 percent to 25 percent, but she also beat him for the first time in Quinnipiac’s polling among somewhat liberal voters, capturing 30 percent of that group to Biden’s 19 percent. (She was also the clear second choice among moderate or conservative voters, although Biden still had a 10-point lead there.)\n\nEarlier in September, I wrote that it was good for Warren that she was doing so well among very liberal voters, but that it probably wasn’t enough to carve out a path to the nomination as the Democratic Party is roughly evenly split between liberals and moderates. But now, it seems as if Warren’s appeal is broadening beyond her ideological base of very liberal supporters.\n\nQuinnipiac isn’t the only pollster who found this, either. Monmouth University’s September national survey found that Warren led with 37 percent of the vote from liberal voters and was also in second place among moderate or conservative respondents with 20 percent support — 10 points behind Biden’s 30 percent. This marked an uptick of 4 percentage points among these moderate or conservative voters since Monmouth’s August poll. Additionally, the latest YouGov/Economist national poll pegged Warren as the first choice for 15 percent of moderates — some distance behind Biden’s 30 percent, though still in second place. But this was still about twice the level of Warren’s support among moderates in late August.\n\nWarren is finally starting to make inroads with voters without a college degree\n\nFor the past couple of months, Warren has been the leading candidate for college-educated voters, particularly white ones, but there are now signs she’s garnering support from voters who aren’t college educated, too. This is important for Warren because a plurality of Democratic voters are white voters without a college degree, and they currently form a key constituency for Biden and Sanders. And in Quinnipiac’s latest survey, Warren had 26 percent support among non-college whites, which put her in a near-tie with Biden at 27 percent and ahead of Sanders’s 19 percent. By comparison, in Quinnipiac’s late-August survey, Warren had 20 percent to Biden’s 30 percent among non-college whites and was roughly tied with Sanders, who had 19 percent support among that group.\n\nFox News also found a slight improvement in Warren’s support among white voters without a college degree in its September survey: 19 percent support, compared to 15 percent in August, and she now sits just 5 percentage points behind Biden. Granted, these aren’t huge shifts we’re talking about — and we should be cautious with reading too much into the crosstabs because they have larger margins of error than the overall sample — but the trend has been consistent across a number of recent polls. Monmouth also found Warren’s support among voters (of all races) without a four-year degree went up from 17 percent in August to 24 percent in late September.\n\nAnd if Warren is gaining among white voters who don’t have a college degree, it’s likely to the detriment of Biden and Sanders, who are the only other candidates who get at least double-digit support from this group. This is especially important in light of the fact that Iowa and New Hampshire, the first two states to vote in the Democratic primary, are predominantly white and, as a result, have a large share of white voters without a college degree. In fact, if we look at Democratic primary exit polls from 2016, half of Iowa caucus-goers weren’t college graduates, and 40 percent of New Hampshire primary voters fell into that category as well. So if Warren can keep improving her standing among whites without a college degree, it could help her chances in the first two contests, which could potentially catapult her to outright front-runner status early in 2020.\n\nWarren is also winning over voters who aren’t white\n\nArguably the biggest threat to Warren’s chances at the nomination has been just how white her support is. She has consistently had low support among nonwhite voters, especially African Americans, who make up anywhere from 20 to 25 percent of the Democratic electorate. But polls now suggest Warren may be, at last, gaining traction. Quinnipiac’s past two national polls showed Warren’s support among black voters nearly doubled from 10 to 19 percent, and the most recent YouGov/Economist survey found her at 15 percent among African Americans compared to 9 percent in its final August poll. And Monmouth’s late September survey found her at 20 percent among nonwhites more broadly, up from 14 percent in August.\n\nIt’s worth noting, however, that Fox News’s August (13 percent) and September (11 percent) surveys showed virtually no change in Warren’s support among nonwhites. And though she might be eating into Biden’s support elsewhere, two new polls in South Carolina show Biden doing far, far better than Warren among black voters. A Winthrop University poll found Biden winning 46 percent of black voters to Warren’s 9 percent, while a Fox News survey had Biden at 50 percent compared to Warren’s 8 percent among that group. So while Warren has started to make inroads among nonwhite voters, we shouldn’t rush to overstate her improvement. She still has plenty of work to do to expand her support.\n\nWarren is also maybe winning over some former Harris backers\n\nThis theory may be on less solid footing than the other ones I’ve floated so far, but I venture that at least some of Warren’s gains have come at the expense of Sen. Kamala Harris’s support, too. If we look at the last two months of national polls and split them into three different periods (each spanning three weeks) and calculate the polling average for Warren and Harris using polls from pollsters with at least a B- rating, according to FiveThirtyEight’s pollster ratings, you can see Warren and Harris have pretty clearly moved in opposite directions. Warren has moved from the mid-teens to the low 20s, while Harris has fallen from the high single digits to just the mid single digits.\n\nAnd one reason to think that some of Harris’s supporters have moved into Warren’s camp is that they have tended to name Warren as their top second-choice candidate. In part, this is probably because there is some demographic overlap in their support — both candidates have a fair amount of backing from college-educated voters and more progressive voters.\n\nTo be clear, Biden is still leading in the polls, but the distance between him and Warren has narrowed considerably. And so while we’ll be keeping an eye on how things develop, it does seem like Warren has improved her position from where it was in April. She has done this, in part, by starting to build support from a broader coalition that includes more moderate voters, less-educated voters and some nonwhite voters, as well as some voters who supported Harris earlier in the campaign. There’s still a lot of progress left for Warren to make, particularly among voters of color, but for now, her trajectory for the 2020 Democratic nomination is moving in the right direction — up.", "description": "It seems as if Warren’s appeal is broadening beyond her ideological base of very liberal supporters.", "authors": ["Geoffrey Skelley"], "top_image": "https://fivethirtyeight.com/wp-content/uploads/2019/10/GettyImages-1171198260_16x9.jpg?w=575", "published_at": "2019-10-07"}