{"pub": "mirror", "url": "https://mirror.co.uk/money/man-gets-big-break-broadcasting-20380172", "downloaded_at": "2019-10-07 00:19:58.934477+00:00", "title": "Man gets his big break in broadcasting thanks to some DIY on his wardrobe", "language": "en", "text": "Get the biggest money stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nPlenty of us may dream of talking for a living, but Jordan Reader has done just that by ditching his day job and moving into voiceover work.\n\nUntil July this year Jordan was working at his local cinema, but having converted his wardrobe into a recording booth, he is now pursuing the dream of narrating audiobooks.\n\nJordan dropped out of college, where he had been studying software development, and on the suggestion of his dad started looking into audio-based work.\n\nIt was something of a natural route for Jordan, who had previously produced YouTube and Twitch videos as a hobby.\n\n“I looked into radio and dug further and further until I found voiceover,” Jordan said.\n\nGetting started\n\nOne of the first steps for Jordan was signing up for a course on getting started in voiceover, which he says was incredibly useful.\n\nConscious that he needed to build up some experience, he turned to the website Fiverr , which connects freelancers with businesses that might need their services, whether that’s help with social media, illustration or voiceover work.\n\nJordan says this was useful as a means of starting to charge for his work, even though the initial sums were small, as well as getting used to the workflow involved with voiceover projects.\n\nA study in soundproofing\n\nOf course, if you want to do audio work you’ll need to have somewhere in which to record your work.\n\nAnd for Jordan, that didn’t mean a professional studio, but rather using some of the funds from working his day job in order to sound-treat his wardrobe and turn it into a booth.\n\nHe did this himself with acoustic foam and a curtain to cover the hard wood doors, which helps to “stop sound waves from bouncing all around and back into the mic.\n\n\"I installed a coat hanger at one end of the wardrobe, and placed all my coats on it to further help sound absorption.”\n\nSpreading the word\n\nHaving somewhere to work is all well and good, but how do you go about reaching potential clients?\n\nJordan says that he has had to be proactive online, particularly on social media, as a way of spreading the word about his business.\n\n“I attend networking events monthly, and I’ve found them great for meeting new people and making new connections.”\n\nSo far much of the work that has come in has been on audiobooks, particularly on self-help and non-fiction titles, such as Millionaire Mindset , High Performance Habits and a beginner’s guide to blockchain .\n\nJordan explains that potential clients will post voiceover roles they are looking for, which you can then audition for, but suggests that directly contacting firms with a professional demo is also an effective way to drum up business.\n\n“As far as what people want, the industry has seen a shift from big presenter voices telling you to buy something, to a more natural read ‒ commonly referred to as the person next door ‒ almost as if they’re giving you a recommendation, not telling you to buy something. People inherently don’t like to be told what to buy.”\n\nDon’t give up\n\nPersistence has been a big factor in Jordan getting enough work, he explains.\n\nHe’s also a keen advocate of taking time away from the business so that you can ensure that when you are working, you’re at your best.\n\n“Seven business hours working at 80% productivity is far better than 15 hour days at 30% efficiency and not feeling rested in the slightest. It’s not the greatest schedule in terms of longevity.”\n\nExpanding the business\n\nJordan’s voiceover business has taken off to the point that he can now devote all of his efforts towards it.\n\n“Going full-time was a big step, being able to support myself. I can’t describe how brilliant it was.”\n\nKeen to avoid standing still, he now wants to look at how to move into other areas of voiceover work, from bigger clients to diversifying into documentary voiceovers and animation.\n\n“Mainly I want to try to maintain and keep doing what I love for a living.\"\n\nAnd that means the chances of voicing The Lion, The Witch and the Wardrobe from his home-made studio are increasing by the day.", "description": "When we dream of making it big, coat hangers don't often feature - but for Jordan Reader, they did make an appearance in the reality of his career switch", "authors": ["John Fitzsimons"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20380473.ece/ALTERNATES/s1200/0_JordanReader5.jpg", "published_at": "2019-10-06"}