{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/25/WS5db2b36ca310cf3e35573aec.html", "downloaded_at": "2019-10-25 16:04:31.049338+00:00", "title": "Chinese company celebrates making its 3,000th electric black cab", "language": "en", "text": "By Wang Mingjie in Coventry,England | China Daily Global | Updated: 2019-10-25 16:33\n\nThe production of the 3,000th electric TX is witnessed by Gao Yunlong (6th from right), vice-chairman of the CPPCC and Li Shufu(8th from left), chairman of Geely. [Photo provided to China Daily]\n\nChinese vehicle maker Geely says it has made a giant stride in supporting green mobility and reducing urban emissions with the production of the 3,000th TX electric vehicle at its London Electric Vehicle Company factory in Ansty, near Coventry.\n\nThe TX, which is LEVC's newest model and is also known as the TX5 electric taxi, was launched in 2017. It uses range-extending technology and lightweight materials while retaining the look of the iconic London taxi.\n\nThe vehicle is powered by a full-electric hybrid drivetrain and also has a small petrol generator and an advanced-battery electric powertrain that together give drivers a range of up to 607 kilometers.\n\nThe company says the TX can travel 130 kilometers in pure electric mode and has been well received by drivers and passengers because of its environmentally friendly credentials, its low-operating cost, and its in-vehicle connectivity.\n\nLEVC says the average cab driver can save 110 pounds ($141) a week by using the new vehicle instead of its diesel predecessor, based on driving an average of 193 kilometers a day.\n\nThe milestone of producing the 3,000th electric TX was witnessed by a delegation led by GaoYunlong, vice-chairman of the Chinese People's Political Consultative Conference and chairman of the All-China Federation of Industry and Commerce. Gao was accompanied by Zhejiang Geely Holding Group Chairman Li Shufu.\n\nDuring the visit, Gao praised Geely's progress in the United Kingdom, saying: \"Geely's innovative development in the UK is a model for Chinese companies to go global.\"\n\nHe said, through the transfusion of capital to the synergetic development of technology, Geely has promoted the integration and development of enterprises and made significant contributions to Sino-British business relations.\n\nAnd he added that he hopes Geely will continue to grasp opportunities and develop globally, through scientific and technological innovation.\n\nGeely first invested in London Taxi Company in 2006, later renaming it London Electric Vehicle Company. It took the company out of administration in 2013 and the enterprise has since become a major player in the global electric vehicle market.\n\nIn 2015, Geely built a new 250-million-poundfacility at LEVC's Coventry base, where London's iconic black cabs had been made since 1948. The new plant is focused on the production of electric and low-emission taxis.\n\nLi, the chairman of Geely Group, said: \"The deepening of trade between China and the United Kingdom has driven further exchange and the development of enterprises within the two countries. As a member of the Chinese manufacturing industry, we have experienced this first-hand.\"\n\nHe said Geely hopes to continue integrating global resources in the future and \"give full play to the UK's strengths in the fields of new energy and lightweight technologies\".\n\nAnd he added that the company also aims to \"provide more diverse solutions to urban mobility around the world, and contribute to growing Sino-British trade and technological development\".\n\nThe delegation also visited an exhibition of Lotus models, including the Evija, which is the renowned British sports car maker's first new model since Geely took a majority 51 percent stake in Lotus Groupin 2017.", "description": "Chinese vehicle maker Geely says it has made a giant stride in supporting green mobility and reducing urban emissions with the production of the 3,000th TX electric vehicle at its London Electric Vehicle Company factory in Ansty, near Coventry.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/25/5db2b36ca310cf3e97a2fe55.jpeg", "published_at": "2019-10-25"}