{"pub": "hotair", "url": "https://hotair.com/archives/jazz-shaw/2019/09/28/nyc-now-ban-saying-illegal-alien", "downloaded_at": "2019-09-28 21:28:30.406609+00:00", "title": "NYC now has a ban on saying “illegal alien”", "language": "en", "text": "The craziness in New York City continues unabated. In the municipal government’s endless war against the insufficiently woke, a new weapon has been added to the social justice warriors’ arsenal. The City Hall Commission on Human Rights has now issued an edict saying that it will henceforth be illegal to use the phrase “illegal alien” if it’s directed at someone in a way that is “motivated by hate.” You will also be in violation of the law if you threaten to call immigration enforcement on an illegal alien. And the fines you can be hit with are jaw dropping. (NY Post)\n\nIt’s now against the law in New York City to threaten someone with a call to immigration authorities or refer to them as an “illegal alien” when motivated by hate. The restrictions — violations of which are punishable by fines of up to $250,000 per offense — are outlined in a 29-page directive released by City Hall’s Commission on Human Rights. “‘Alien’ — used in many laws to refer to a ‘noncitizen’ person — is a term that may carry negative connotations and dehumanize immigrants, marking them as ‘other,’” reads one passage of the memo. “The use of certain language, including ‘illegal alien’ and ‘illegals,’ with the intent to demean, humiliate, or offend a person or persons constitutes discrimination.”\n\nSo using the same phrase that appears all through Title 8 of federal law to identify an illegal alien in New York City can now land you in hot water. And if you inform the illegal alien that you are going to report their unlawful presence in the country to Immigration and Customs Enforcement (ICE), not only will the police not assist the feds in taking the illegal into custody, but they may be dispatched to take you in if the person files a complaint.\n\nThen you may have to cough up a quarter-million dollars in fines to the city. (And given how badly the budget has been mismanaged under the de Blasio administration, they could probably use the money.) Isn’t that just lovely?\n\nThe ironic thing here is that it’s still technically legal (though very messed up) to use a racial epithet against a citizen, provided it’s not in the workplace, it’s against the law to identify a criminal based on their illegal status. And while you are encouraged to report virtually any other crime you observe to the police for investigation, suggesting that you might report this particular crime can wind up bankrupting you in municipal court.\n\nOh, and there’s even more good news for illegal aliens in the Big Apple. The Mayor is going to try to order bars and restaurants to accept city ID cards (which illegal aliens in New York City can now sign up for, along with driver’s licenses). And he’s doing it despite the fact that it’s a violation of state law to accept that ID for the sale of alcohol. (They can only accept a driver’s license, a non-driver ID card issued by the DMV, a U.S. military ID, a valid passport or a visa from any country.)\n\nIn New York City the patients are now running the mental asylum. Flee while you can, folks. Somebody is eventually going to wise up and just build a huge wall around Gotham and trap you all there.", "description": "Watch your tongue", "authors": ["Jazz Shaw", "John Sexton", "Karen Townsend", "Ed Morrissey"], "top_image": "https://hotair.com/wp/wp-content/uploads/2017/09/deBlasio.jpg", "published_at": "2019-09-28"}