{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/31/a-league-club-perth-glory-confirm-ambitious-zlatan-ibrahimovic-bid", "downloaded_at": "2019-10-30 23:21:40.927243+00:00", "title": "A-League club Perth Glory confirm ambitious Zlatan Ibrahimovic bid", "language": "en", "text": "Perth Glory have launched an audacious bid to sign striker Zlatan Ibrahimovic. The reigning A-League premiers have approached the 38-year-old Swedish star’s agent Mino Raiola about a guest player deal, which would reportedly see him play up to six games for them.\n\nIbrahimovic’s contract at LA Galaxy, who were beaten 5-3 by local rivals Los Angeles FC in the MLS Cup Western Conference semi-final last week, is set to expire at the end of the year. He has scored 30 goals in 29 matches this season for Galaxy, earning a place in the MLS Best XI for 2019.\n\nHow Ibrahimovic and Rooney became advocates for MLS players' rights Read more\n\n“An approach has been made to his agent,” Perth chief executive Tony Pignata told Fairfax. “We’ve asked the question firstly about his availability and secondly of his interest.”\n\nIf successful, signing Ibrahimovic would constitute one of the biggest marketing coups in A-League history. However he posted an Instagram video on Wednesday night suggesting he will return to Spain following the expiration of his contract.\n\n“Hola Espana, guess what? I am coming back,” he said.\n\nThe former Malmo, Ajax, Juventus, Inter, Barcelona, AC Milan, Paris Saint-Germain and Manchester United forward has also been linked with South American teams Boca Juniors and Flamengo.", "description": "Perth Glory have launched an audacious bid to sign striker Zlatan Ibrahimovic", "authors": ["Australian Associated Press"], "top_image": "https://i.guim.co.uk/img/media/48365976b83d6294e84368328ecd65bf148022a0/0_204_4561_2737/master/4561.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e2f62cec435fca0269194f8690aa29c4", "published_at": "2019-10-30"}