{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/12/democratic-debate-fiery-exchanges-over-costs-of-he", "downloaded_at": "2019-09-13 07:26:38.907231+00:00", "title": "Democratic debate: Fiery exchanges over costs of health care", "language": "en", "text": "HOUSTON (AP) - The three leading Democratic presidential candidates clashed over health care, immigration and President Barack Obama’s legacy on Thursday in a fierce debate that pitted an aggressive Joe Biden against liberal rivals Elizabeth Warren and Bernie Sanders.\n\n“This is America,” said Biden, his party’s early front-runner, before calling Sanders “a socialist.” He later declared, “I stand with Barack Obama all eight years, good bad and indifferent.”\n\nThe top White House hopefuls faced off for the first time alongside seven other candidates who are under increasing pressure to break out of the pack. All assailed Trump without mercy.\n\nNew Jersey Sen. Cory Booker called Trump a racist. Former Texas Rep. Beto O’Rourke called him a white supremacist. And Kamala Harris, a California senator, said Trump’s hateful social media messages provided “the ammunition” for recent mass shootings.\n\n“President Trump, you have spent the last two-and-a-half years full time trying to sow hate and vision among us, and that’s why we’ve gotten nothing done,” Harris declared.\n\nThe Democrats primary contest has been remarkably stable, but the debate comes at a pivotal point in the campaign as more voters move past their summer vacations and begin to pay closer attention to politics.\n\nPolls show that a strong majority of all voters believe the country is headed in the wrong direction under the first-term president’s leadership. But nine months into their nomination fight, divided Democrats have yet to answer fundamental questions about who or what the party stands for beyond simply opposing Trump.\n\nThe debate is shaped by evolving issues of race, gender, generation and ideology that again exploded into public view on the debate stage Thursday night.\n\nObama himself emerged as a hot point as the discussion shifted to health care and immigration in particular.\n\nSanders said Biden, Obama’s two-term vice president, bears responsibility for millions of Americans going bankrupt under the “Obamacare” health care system.\n\nBiden slapped back at both Sanders and Warren and contended they haven’t yet explained how they would pay for Sanders’ government-backed “Medicare for All” health care plan.\n\nCastro, who served as Obama’s housing chief, kept the pressure on the front-runner.\n\nThe 44-year-old Texan appeared to touch on concerns about Biden’s age when he accused the former vice president of forgetting a detail about his own health care plan. At 76, Biden would be the oldest president ever elected to a first term.\n\n“Are you forgetting what you said two minutes ago?” Castro asked. “I can’t believe that you said two minutes ago that you have to buy in and now you’re forgetting that.”\n\nHe added: “I’m fulfilling the legacy of Barack Obama and you’re not.”\n\nThe ABC News debate was the first limited to one night after several candidates dropped out and others failed to meet new qualification standards. A handful more candidates qualified for next month’s debate, which will again be divided over two nights.\n\nBesides the infighting, viewers saw the diversity of the modern Democratic Party.\n\nThe debate, held on the campus of historically black Texas Southern University, includes women, people of color and a gay man, a striking contrast to the Republicans. It unfolded in a rapidly changing state that Democrats hope to eventually bring into their column.\n\nThe debate shifted to gun violence in a state shaken by a mass shooting last month that left 22 people dead and two dozen more wounded.\n\nIn an emotional moment, O’Rourke said that there weren’t enough ambulances at times to take all the wounded to the hospital.\n\n“Hell yes, we’re gonna take your AR-15, your AK-47,” he said, as the crowd cheered.\n\nMinnesota Sen. Amy Klobuchar noted that all the candidates on stage favor a ban on assault weapons and high-capacity magazines. She favors a voluntary buy-back program on assault weapons, however.\n\nMeanwhile, Trump noted he’d be in Baltimore at a Republican retreat during the debate and wasn’t sure he’d get a chance to watch. But he predicted the Democratic nominee would ultimately be Biden, Warren or Sanders.\n\n“It’s going to be very interesting,” Trump said. “I’m going to have to watch it as a re-run.”\n\nThe leading Democratic candidates may not have another chance to face off for quite some time.\n\nThe Democratic field may be divided into two groups when they meet in October because more than 10 candidates qualified for the next round.\n\n___\n\nPeoples reported from Washington.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The three leading Democratic presidential candidates clashed over health care, immigration and President Barack Obama's legacy on Thursday in a fierce debate that pitted an aggressive Joe Biden against liberal rivals Elizabeth Warren and Bernie Sanders.", "authors": ["The Washington Times Http", "Bill Barrow", "Steve Peoples"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/12/election_2020_debate_63790_c0-158-3794-2370_s1770x1032.jpg?23d59563da3935a99902906cfcb30551535e07c4", "published_at": "2019-09-12"}