{"pub": "guardian", "url": "https://theguardian.com/film/2019/oct/16/zombieland-double-tap-film-review-emma-stone", "downloaded_at": "2019-10-16 20:38:25.785629+00:00", "title": "Zombieland: Double Tap review – a fan service sequel for fans who barely exist", "language": "en", "text": "A belated sequel to the 2009 sleeper hit brings back the main cast but can’t quite conjure up enough humour or charm to justify its existence\n\nAt a relatively brief 99 minutes, Zombieland: Double Tap doesn’t provide one with anywhere near enough time to figure out exactly why Zombieland: Double Tap exists. The closest I could manage was sheer greed, but even that explanation would require a strongly held belief that a substantial fanbase cared about or even remembered the original. It was a decently reviewed sleeper success which provided a much-hankered-for eyeroll at the influx of zombie films flooding cinemas at the time – but it was that and little else. A smile of a movie that turned into more of a shrug over time.\n\nMaleficent: Mistress of Evil review – panto fun is missing in action Read more\n\nA decade wait later, the result of a tortuous development process, and here it comes, lumbering into cinemas thirsty for coins, missing the boat and all other available transport. It’s not entirely without merit, but it is utterly devoid of necessity, a release date filler that, despite the long gestation period, feels like a worthless quickie, 10 years’ worth of foreplay resulting in an underwhelming splurge. Since the first film, those involved have graduated to better things. Woody Harrelson scored two more Oscar nominations; Emma Stone won an Oscar and was nominated for another; Jesse Eisenberg secured himself a career as a playwright; screenwriters Rhett Reese and Paul Wernick moved on to the Deadpool franchise; and director Ruben Fleischer landed Venom, the biggest hit of his career to date. Which makes the whole thing even more of a head-scratcher.\n\nCrafted with the sort of fan service one might expect from a sequel to a much-loved fan favourite, Zombieland: Double Tap doubles down on what the original provided for those apparently eagerly waiting for more. We’re reunited with the ragtag team from the first film as they come across an extravagant new home: the White House. For a while, there’s a fragile sense of contentment – for the men at least – but their attempts to force their female companions into traditional gender roles (the makeshift daughter and the loyal wife) force the women to flee the nest.\n\nWhat follows, what vaguely, if one squints, passes for a plot, includes a hippie commune, a pilgrimage to Graceland, a candle shop meet-cute and a lacklustre Luke Wilson cameo. Zombie groan.\n\nAs dated as its slow-mo zombie-killing opening credits, at times Zombieland: Double Tap feels like it was made directly after the original yet carelessly forgotten about. It’s rushed and dusty, a film more belonging on Crackle than the big screen, more expensively budgeted than the first yet mostly creatively bankrupt. The film’s major addition is a dumb, one-note Valley Girl stereotype, played buoyantly by a game Zoey Deutch, who resembles a character from an early 00s sitcom, with every poorly written punchline landing the same – she’s an airhead, end of joke. The script’s potshots at hippies feel equally rusty: they love weed and hate guns. Cool.\n\nThe returning actors replay the same beats with about as much effort and investment as one might expect, with Stone looking particularly bored, while Fleischer’s stylistic flourishes feel mostly regurgitated. The script’s interesting initial exploration of women eschewing traditional gender roles is soon replaced with a predictable string of women throwing themselves at undeserving men. It’s watchable in an undemanding way, thanks to a snappy pace, but there’s an ingenuity missing, a purpose, a spark that made the first film so much fun. A lot has changed since the first one came out, to the actors, to the genre, to the world, but Zombieland: Double Tap is hopelessly stuck in the past. It’s a corpse of a franchise that shows no sign of coming back to life.", "description": "A belated sequel to the 2009 sleeper hit brings back the main cast but can’t quite conjure up enough humour or charm to justify its existence", "authors": ["Benjamin Lee"], "top_image": "https://i.guim.co.uk/img/media/af5a5a2006e66d9e913aa548f378d25bd15274d4/0_50_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTIucG5n&enable=upscale&s=d0fd256e2722ee39fdc1866f609eb040", "published_at": "2019-10-16"}