{"pub": "yahoo", "url": "https://news.yahoo.com/brexit-vote-latest-boris-johnson-023800461.html", "downloaded_at": "2019-10-29 07:46:39.842647+00:00", "title": "Brexit vote latest: Boris Johnson to ditch withdrawal bill in final push for early election after three defeats", "language": "en", "text": "The PM will today make one last effort to send Britain to the polls before Christmas: AP\n\nBoris Johnson will today try one more time to force a general election before Christmas despite his bid being rejected in the Commons three times already.\n\nThe Prime Minister is to abandon his attempts to push his Brexit bill through Parliament in a move aimed at securing the support of the Liberal Democrats and SNP for the early poll.\n\nMr Johnson said he would table a short bill on Tuesday that would change the law in order to hold a snap election on December 12, and will only need a regular majority for this plan.\n\nAn election could be achieved with the backing of the Lib Dems and SNP in the Commons in the fresh vote later, and there had been suggestions the PM could achieve the support if the date of the poll is changed.\n\nBoris Johnson suffered another defeat in the Commons on Monday night (REUTERS) More\n\nHe suffered a defeat in the Commons last night when MPs rejected his third attempt to go to the country. Some 299 MPs voted in favour of a general election, while 70 voted against it – falling short of the “super majority” needed.\n\nMr Johnson's election bid, which was made under the Fixed-Term Parliaments Act (FTPA), required a two-thirds Commons majority of 434 MPs to pass.\n\nThe division list showed 280 Tory MPs voted for the snap election motion along with 18 Independents and Labour MP Kate Hoey.\n\nThose who voted against the motion included 38 Labour MPs, four Independents, 18 Liberal Democrats, four Plaid Cymru, five Independent Group for Change and Green Party MP Caroline Lucas\n\nBoris Johnson speaks during the election debate on Monday (PA) More\n\nStraight after the defeat, Mr Johnson told MPs the Government will give notice of a short Bill for an election in December.\n\nHe said he would continue to press for a December 12 polling day - even though the Liberal Democrats and the SNP suggested at the weekend they could support a slightly earlier date of December 9.\n\nThe Prime Minister said: “The leader of the Opposition literally and figuratively has run away from the judgment of the people.”\n\nMr Johnson continued: “But as I said when moving the motion, we will not allow this paralysis to continue, and one way or another we must proceed straight to an election.\n\n“So later on this evening, the Government will give notice of presentation for a short Bill for an election on December 12 so we can finally get Brexit done. This House cannot any longer keep this country hostage.”\n\nMr Johnson concluded: “Now that no deal is off the table, we have a great new deal, and it’s time for the voters to have a chance to pronounce on that deal and to replace this dysfunctional Parliament with a new Parliament that can get Brexit done so the country can move on.”", "description": "Boris Johnson will today try one more time to force a general election before Christmas despite his bid being rejected in the Commons three times already.The Prime Minister is to abandon his attempts to push his Brexit bill through Parliament in a move aimed at securing the support of the Liberal Democrats", "authors": ["Sean Morrison"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Kqx.t7tv6QkfF24SR72vgQ--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/evening_standard_239/6b9f444bc0d83f2c00c7c3d2cac88185", "published_at": "2019-10-29"}