{"pub": "theverge", "url": "https://theverge.com/2019/8/16/20807264/motorola-one-action-camera-gopro-smartphone-budget-release-date-pricing-features", "downloaded_at": "2019-10-05 14:16:59.096166+00:00", "title": "Motorola’s One Action tries to stuff a GoPro into a smartphone", "language": "en", "text": "Motorola introduced its line of “One” budget phones last year, and today it’s announcing the latest model: the Motorola One Action, which (per the name) looks to stand out from the crowd by offering action-camera-like video quality on a smartphone.\n\nThe “Action” in the name refers to the third rear camera: a dedicated ultra-wide video camera with a 117-degree field of view that’s designed to shoot video just like a GoPro. Motorola is doing a few things here to make the Action different from regular cellphone video, starting with the lens itself.\n\nThere’s the super-wide field of view, but Motorola has also physically rotated the sensor, meaning that when you hold the One Action vertically, the camera’s frame records video horizontally (and vice versa). It’s a small change, but a clever one that should help customers maximize the unique hardware here. Motorola is also pushing some software-side algorithms to offer what it calls “Enhanced Video Stabilization” to reduce shakiness while you’re shooting. We’ll have to actually see how all that holds up in the real world, but it’s an interesting idea for a smartphone.\n\nThe rest of the specs for the One Action are more in line with what you’d expect from a budget Android phone, with a 6.3-inch FHD+ panel that has a hole-punch cutout for a 12-megapixel camera. The other two rear cameras are also similarly ordinary: a 12-megapixel main lens, and a 5-megapixel depth sensor for portrait effects.\n\nIn a break from the norm, the Motorola One Action is powered by a Samsung Exynos 9609 processor, not one of Qualcomm’s Snapdragon chipsets. Rounding things out is 4GB of RAM, 128GB of onboard storage, a USB-C port (and a headphone jack), and a 3,500mAh battery\n\nThe software side is also seeing some changes. Despite the “One” branding in the name, the One Action will only ship with Android One internationally — the North American version set to go on sale in the US and Canada sometime in October will have regular Android 9 Pie, and it won’t have the guarantee of future OS updates that Android One phones do.\n\nUnlike the Moto E, G, and Z lines, which have pretty clear expectations attached to them, the Motorola One brand is a little harder to pin down. The specs are toward the upper end of the budget phone spectrum, similar to the Moto G or Z, but the hardware — at least so far — has tended to be a bit more experimental than the standard Moto-branded phones.\n\nThe Motorola One Action will be available starting today in Brazil, Mexico, and “various European countries” starting at €259 (roughly $288), followed by launches in Latin America, Europe, and Asia Pacific. It’ll also be heading to the US and Canada (without Android One software) sometime in early October, although the price in North America has yet to be announced.\n\nCorrection: The Motorola One Action has a 117-degree wide angle camera, not a 177-degree lens. It also has a headphone jack, which this article original said it did not.\n\nPhotography by Chaim Gartenberg / The Verge.", "description": "Motorola introduced its line of \"One\" budget phones last year, and today it’s announcing the latest model: the Motorola One Action, which (per the name) looks to stand out from the crowd by offering action-camera-like video quality on a smartphone.", "authors": ["Chaim Gartenberg", "Aug"], "top_image": "https://cdn.vox-cdn.com/thumbor/Z4_cp8TdnNp-W91AuMq8A7DGJaU=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18992218/cgartenberg_190723_3608_0004.jpg", "published_at": "2019-08-16"}