{"pub": "fox", "url": "https://foxnews.com/sports/new-orleans-saints-demario-davis-wont-be-fined-for-man-of-god-headband-plans-to-donate-cash-to-hospital", "downloaded_at": "2019-10-10 02:46:28.585271+00:00", "title": "New Orleans Saints' Demario Davis won't be fined for 'Man of God' headband, plans to donate cash to hospital", "language": "en", "text": "New Orleans Saints linebacker Demario Davis won an appeal over a $7,000 fine from the NFL for wearing a religious headband and said he would give the fine money to a hospital in his home state of Mississippi.\n\nDavis was fined for wearing a headband that read, “Man of God” during a Sept. 22 game against the Seahawks in Seattle.\n\nDavis said he wore the headband the first three games, and he thought he might have been fined after the third game after he was in the spotlight for leading the Saints pregame chant in the absence of quarterback Drew Brees.\n\nTRUMP MOCKS NBA COACH STEVE KERR, CALLS HIM 'LITTLE BOY'\n\nBefore Davis’ appeal was approved, he wanted to turn the situation into a positive, so he decided to start selling the headbands with 100 percent of the “Man of God” and “Woman of God” proceeds donated to St. Dominic Hospital in Jackson, Miss. The headbands, priced at $25 apiece, have raised more than $30,000 for the hospital, according to Davis.\n\n\"We've been able to turn it into a positive and use it to raise funds for a hospital that's trying to rebuild this emergency room. And just to have the support of the community -- and pretty much nationwide -- it's been amazing,” Davis said, according to ESPN. “And then on top of that, being blessed to win the appeal and be able to take those funds that I was already counting as a loss and further contribute to the cause, it's just a major blessing. And I don't take it for granted.\"\n\nLOS ANGELES RAMS' CLAY MATTHEWS HAS JAW WIRED SHUT AS HE RECOVERS FROM INJURY\n\nDavis said he didn’t know why the NFL rescinded his fine. “I didn't get the specific reason why it was overturned. I mean, when you get something like that overturned and you get $7,000 coming back to you, you ain't asking too many questions,” he said.\n\nThe NFL fines players for wearing “personal messages” on their uniforms, except during the “My Cause, My Cleats” program, in which players can promote causes important to them with decorated cleats during Game Weeks 13-15. In his appeal, Davis said his agents had included “not knowing about it [the rule], it not being something that was offensive, that I wasn't going to wear it again and that I was going to use it for charity.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"No matter the case, whether I'm wearing a headband, or whether I'm not wearing a headband, whether I'm talking about a headband, I'm not talking about a headband, I'm always using my platform to glorify God,\" Davis said. \"And that's never going to change. Because I believe he's the one who gave me this platform for that purpose to make his name known. So I'll always be about that.\"", "description": "New Orleans Saints linebacker Demario Davis won an appeal for a $7,000 fine from the NFL for wearing a religious headband and said he would give the fine money to a hospital in his home state of Mississippi.", "authors": ["Morgan Phillips"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/DeMario-Davis.jpg", "published_at": "2019-10-10"}