{"pub": "cbs", "url": "https://cbsnews.com/news/2020-daily-trail-markers-elizabeth-warren-continues-her-rise-in-early-states", "downloaded_at": "2019-10-25 22:01:37.112792+00:00", "title": "2020 Daily Trail Markers: Elizabeth Warren continues her rise in early states", "language": "en", "text": "Former Texas Congressman Beto O'Rourke said Friday that he's open to the idea of letting places such as hunting lodges and gun ranges keep AR-15s and AK-47s, despite proposing a mandatory buyback of those weapons. \"Perhaps a way to address a legitimate concern or need is to ensure that those who have or want to use an AR-15 are able to keep it at a hunting club or at a gun range so that there is some control,\" O'Rourke said in response to a student at North High School in Des Moines.\n\nThe student made a case for using an AR-15 to hunt deer, something O'Rourke said he had not heard before. CBS News campaign reporter Adam Brewster says O'Rourke stood by the remarks speaking to reporters after his events at the high school. \"I'm open to the idea, actually as proposed originally by Congressman Eric Swalwell, that in a mandatory buyback there would be places like a gun range or a hunting lodge where you could securely keep an AR-15 or an AK-47,\" he said, when asked if those would be the only venues that could keep the weapons and whether he was beginning to think the proposed mandatory buyback went too far.\n\nOn Thursday evening, talked spoke with CBS News campaign reporter Tim Perry in a wide-ranging interview in which he spoke of fellow Democratic candidate former Vice President Joe Biden decision to accept PAC money. \"By taking PAC money, by organizing a super PAC, it's going to be hard for the American people to know whose side that candidate is on,\" O'Rourke said.\n\nHe also spoke about his sister, Erin, who has an intellectual disability. O'Rourke released part of his plan for disabled Americans last week and plans to release a full plan soon. O'Rourke told CBS News that his sister's story \"makes clear to me we need to make that investment in our fellow Americans who have disabilities.\"\n\nFROM THE CANDIDATES\n\nMICHAEL BENNET\n\nIn response to Joe Biden campaign's newfound openness toward accepting super PAC money, Senator Michael Bennet told reporters this morning, \"I don't think people should unilaterally disarm in a situation like this because we have to beat Donald Trump and he's raising all kinds of dark money.\" The senator, added, \"It is a terrible system and it's one we need to change.\"\n\nThe move comes after several other candidates — including business entrepreneur Andrew Yang — expressed their willingness to accept outside help this cycle in an effort compete against the incumbent president. In the wake of President Donald Trump's decision to pull back troops in northern Syria, Bennet told CBS News campaign reporter Nicole Sganga Republican lawmakers are privately voicing concerns about President Donald Trump.\n\n\"There's a lot of worry about just the record of the call that he had with the Ukrainian president and then the suggestion that he may have done the same thing with China so people are worried,\" Bennet said. \"The Syria stuff this week has created a real sense among Republicans that there's a huge cost to having this guy as president.\"\n\nJOE BIDEN\n\nOn the campaign trail Joe Biden regularly touts the strength of the working class in America. \"Wall Street didn't build America, the middle class built America — and unions built the middle class!\" he says. On Friday the former vice president put his words to paper in a new union-focused plan.\n\nIn addition to advocating for less barriers when it comes to unionizing, CBS News campaign reporter Bo Erickson says Biden's plan sticks up for agriculture and domestic workers, many of whom the plan notes are immigrants, and promises to effort codifying federal worker protections for these millions of workers. From ride-share drivers to factory floor workers, the Biden campaign also addresses the impact of industry re-labeling working as \"independent contractors\" in order to allegedly pay these workers less.\n\nIn Washington, a cabinet-level working group would be organized in order to advocate for workers' rights, and a future Biden administration promises to restore any limitations the National Labor Relations Board faces regarding holding industry and managers accountable for labor violations.\n\nTULSI GABBARD\n\nHawaii Representative Tulsi Gabbard announced she will focus solely on her 2020 presidential campaign, and will forego her congressional re-election. \"Throughout my life, I've been motivated by a desire to serve the people of Hawaii and our country, and have made my decisions based upon where I felt I could do the most good,\" Gabbard said in a statement. A representative of Hawaii's 2nd Congressional district since 2012, Gabbard was facing a serious primary challenger in State Senator Kai Kahele, who raised more than $100,000 in Q3 for his election and has raised $501,282.19 since January 1 says CBS News political unit broadcast associate Aaron Navarro.\n\nKahele has criticized Gabbard in the past, going after her for not showing up to Congressional matters due to her presidential race. During Gabbard's spat with former Secretary of State and Presidential Candidate Hillary Clinton, Kahele criticized Gabbard's tone, Tweeting \"Enough with the Trumpian vitriol! @hillaryclinton served as Secretary of State under @barackobama - are you calling him a disaster and saying he is responsible for millions of lives lost too? Btw...exactly how is this helping Hawaii?\" In a statement today, Kahele supported the decision to not seek House re-election.\n\n\"Since announcing her Presidential candidacy in January 2019, Congresswoman Gabbard has worked hard visiting towns and cities across the United States. This dedication, while worthy of admiration, meant that her congressional district was often left without a voice in Washington, D.C.\" Kahele said in the statement, \"I thank her for her service, and I wish her and her family the best going forward.\"\n\nOnly five different people have served Hawaii's 2nd district since its creation in 1971, when the state established it would have two district representatives instead of a statewide one.\n\nBERNIE SANDERS\n\nLinn County Supervisor, Stacey Walker, endorsed Senator Bernie Sanders this afternoon in Dubuque, Iowa. Walker was on the most recent list of the Des Moines Register's \"50 Most Wanted Democrats\". The campaign has billed him as the Alexandria Ocasio-Cortez (AOC) of Iowa. Walker, they believe, will represent multi-generational, multi-racial working class Iowans. In an interview with CBS News campaign reporter Cara Korte, Walker said that Sanders was the most bold and progressive candidate in the race. The county supervisor said that he was taking the lead AOC and Ilhan Omar set before him. \"They have signaled that Sanders is the people's choice,\" Walker said. \"And the best choice to go against Donald Trump. Senator Sanders has inspired people to stand up and be counted.\" When asked if he believed his Hawkeye constituents have already made up their minds nearly 100 days before the caucuses, Walker said that the race is still \"fluid.\"\n\n\"It's an open race at this point,\" he told CBS News. \"Iowans have a history of surprising folks with who they end up caucusing for on caucus day […] That's a good thing. We need all of these ideas to be put forth, put under microscope, so people have time to make good decisions. I'm convinced when all is said and done they'll know what I know -- that Sen. Sanders is best person to beat Donald Trump.\" Walker will be the campaign's first Iowa Campaign Co-Chair.\n\nSTATE-BY-STATE\n\nCALIFORNIA\n\nWhile not officially a member of \"the Squad,\" CBS News campaign reporter Alex Tin says freshman Congresswoman Katie Porter has made waves since seizing California's 45th Congressional District from Republican hands in the 2018 midterms. Long an ally of fellow Californian Kamala Harris, the Orange County Democrat and former law professor is now endorsing Elizabeth Warren, who once taught Porter at Harvard.\n\nNEVADA\n\nJulián Castro, Bernie Sanders, and Kamala Harris are among those on Twitter celebrating Las Vegas police's decision this week to suspend participation in the controversial 287(g) program. Citing \"uncertainty in the law,\" jails in southern Nevada have ceased their formal partnership with federal immigration authorities pending a ruling from an appeals court. But regardless of the case's outcome, CBS News campaign reporter Alex Tin says all three candidates have pledged to shutter the program as president.\n\nNEW HAMPSHIRE\n\nCBS News campaign reporter Nicole Sganga confirms New Hampshire State Director for Senator Elizabeth Warren's presidential campaign, Liz Wester, filed an affidavit this week to the U.S. District Court in Concord, expressing her concerns that campaign staff are struggling to interpret a new state law without clear instructions from the state.\n\nNew Hampshire's new voter residency law requires anyone who registers to vote to declare residency in the state of New Hampshire, effectively calling for voters to obtain a New Hampshire ID. This change could trigger laws for motor vehicle registration, mandating new residents obtain a New Hampshire license within a 60 day window or face a penalty.\n\nThe case, Casey v. Garder, brought forth the American Civil Liberties Union of New Hampshire, aims to overturn the new law, arguing the new legislation establishes unfair requirements for out-of-state New Hampshire college students seeking to vote in the \"first-in-the-nation\" primary and ultimately risks suppressing the vote. \"The lack of clarity from the Secretary of State's office has left a lot of confusion in college campuses across the state,\" Wester wrote in the affidavit. She later added, \"Without guidance from the state, we are left in the position of being unable to answer voters, especially students, questions.\"\n\nSOUTH CAROLINA\n\nWhile nearly 200 protesters and supporters faced off at the entrance of historically black Benedict College, attendees chanted \"four more years\" inside the criminal justice forum where President Trump gave remarks today. The president spent time discussing the bipartisan criminal justice legislation — First Step Act — which he calls a \"transformative\" rollback of \"unjust provisions of the 1994 Clinton crime law.\" During his remarks he called two guests to the stage — Alice Johnson, whose life sentenced he commuted, and an African-American woman who was released from prison as a result of the First Step Act.\n\nHe also noted that while criminal justice reform was not an initial theme of his campaign that he intends to stand up for those who have been \"forgotten, neglected, overlooked, and ignored.\" Referring to his signing of the First Step Act, Mr. Trump said, \"I knew criminal justice reform was not about politics [and] I'm — to this day — not sure that what I did was a popular thing or an unpopular thing but I know it was the right thing to do.\"\n\nIt's been reported that of the approximately 300 tickets that were distributed, only 10 tickets were given to Benedict College students. CBS News campaign reporter LaCrai Mitchell spoke with Trump supporters who traveled more than an hour to attend the event but were told they couldn't enter once arriving. Students have weighed in on the visit throughout the week giving mixed reviews. Benedict freshman Norah St. Jean told CBS News that she thought it was \"surreal\" for the president to be visiting her HBCU and that although he's made \"controversial\" remarks regarding race, that if she showed respect while on campus that he should be given that same respect.\n\nHowever other students like Elise Cornelison, a freshman Biology pre-med student from California, said she thought it was \"disrespectful\" for the president to visit and was brought to tears while sharing how she felt about the anti-protesters being on her campus. Cornelison also gave her thoughts about the president's use of the word \"lynching\" earlier this week to describe the House impeachment inquiry. \"You're incorrectly using the word and it's not OK. You will never experience that and you don't know,\" said Cornelius. \"Your ancestors lynched other people. You will never feel that pain and the extremity.\"\n\nBY THE NUMBERS\n\nPALMETTO POLLING\n\nA new South Carolina state poll shows that while the state's frontrunner Joe Biden has slipped a bit, Elizabeth Warren continues to inch up as likely state Democratic voters' first choice.\n\nThe latest Post & Courier – Change Research survey cites that Biden's 6-point drop is due in part to declining support amongst women, especially African-American women. CBS News campaign reporter LaCrai Mitchell says Warren rose two percentage points, cutting Biden's lead to 11% from 19% in the last poll by this group.\n\nSouth Carolina representative and Warren surrogate Kambrell Garvin says Warren's rise in an indicator that her strategy is beginning to resonate with voters and that he's not surprised. \"When this process was getting started a lot of South Carolinians maybe knew the name but didn't know a lot about her,\" said Garvin. \"What we see happening here in South Carolina is the same thing we see happening nationally, and that's the message of big structural change is beginning to resonate.\"\n\nMeanwhile in California, CBS News campaign reporter Alex Tin says another poll from the group shows Warren in a narrow lead over Bernie Sanders in the Super Tuesday state. Sanders leads among Latinx voters and those under 50. Warren tops the pack among white voters and those over 50.\n\nUP FOR DEBATE\n\nMAKING THE CUT\n\nThe Democratic National Committee (DNC) announced a higher threshold for candidates to qualify for the sixth Democratic primary debate in December. The debate will be co-hosted by PBS NewsHour and Politico the UCLA Luskin School of Public Affairs in California on December 19.\n\nIn order to qualify for the debate, CBS News digital political reporter Grace Segers says candidates will need donations from 200,000 unique donors, with a minimum of 800 unique donors per state in at least 20 states. They will also have to reach a national polling threshold or a state polling threshold.\n\nCandidates may qualify by receiving 4% support or more in at least four polls, which may be national polls or early-state polls. Otherwise, candidates may qualify by receiving 6% support or more in two single-state polls in Iowa, New Hampshire, South Carolina and/or Nevada. The qualifying polls must be publicly released between October 16 and December 12.\n\nIN CASE YOU MISSED IT…\n\nHere is a roundup of the Political Unit's reporting for CBSN and CBSNews.com this week:\n\nTRAIL MARKERS\n\n· Monday Daily Trail Markers Segment // By Zak Hudak\n\n· Tuesday Daily Trail Markers Segment // By Tim Perry\n\n· Thursday Daily Trail Markers Segment // By Cara Korte\n\nRED & BLUE\n\n· Thursday Red & Blue Segment – Trump 2020 Democrats head to South Carolina // By LaCrai Mitchell\n\nCBSN AM\n\n· Friday CBSN AM Segment – Beto O'Rourke talks gun control plans // By Tim Perry\n\nCBSNews.com\n\n· Beto O'Rourke says he expects Americans to surrender their guns // By Tim Perry\n\n· Beto O'Rourke unveils plan to stem opioid abuse // By Tim Perry\n\n· Buttigieg calls Facebook's ad policy a \"mistake\" and backs the breakup of big tech // By Nicole Sganga\n\n· Julian Castro says he'll drop out unless he raises $800,000 by the end of the month // By Tim Perry\n\n· The inside scoop on two original Bernie Sanders surrogates: Ben & Jerry // By Nicole Sganga", "description": "\"What we see happening here in South Carolina is the same thing we see happening nationally, and that's the message of big structural change is beginning to resonate\"", "authors": ["Caitlin Conant"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/14/0458c21c-c9e7-478c-9478-413eed67a1e5/thumbnail/1200x630/383f6ada006b2ab9baf5b7ff249c7262/trail-markers-newsletter-620x254-v2.jpg", "published_at": "2019-10-25"}