{"pub": "metro", "url": "https://metro.co.uk/2019/10/06/emotional-moment-daughter-8-told-dad-cancer-free-10870904", "downloaded_at": "2019-10-07 00:12:31.890112+00:00", "title": "Emotional moment daughter, 8, is told her dad is cancer-free", "language": "en", "text": "Maisy Dickson was surprised by her dad Chris (Picture: SWNS)\n\nA father filmed the emotional moment his little girl burst into tears when he delivered the news he was now cancer-free.\n\nMaisy Dickson, eight, believed her dad Chris, 43, would be in hospital for two weeks for surgery after being diagnosed with bladder cancer.\n\nInstead, Chris was out of hospital in nine days following a nine-hour operation to remove his bladder.\n\nBut he wanted to keep his homecoming a surprise, so didn’t tell Maisy he would be waiting on the sofa when she got home from school on Thursday, 3 October.\n\nMum Sharon was in on the surprise too, and told Maisy to go upstairs and check her phone for a Snapchat update from her dad.\n\nWhen Maisy opened the picture, it was a selfie of Chris laying on the sofa in the family’s living room, asking for a hug.\n\nAdvertisement\n\nAdvertisement\n\nChris filmed as Maisy ran into the room to greet her dad and was overcome with emotion.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nHe said: ‘I have never been away from my daughter for even a night.\n\n‘She flew down the stairs and screamed when she saw me.\n\n‘She completely broke down, I had never seen her like that before.\n\n‘I broke down as well, I had never ever felt anyone show so much love towards me.’\n\nDad-of-three Chris was first diagnosed with bladder cancer six years ago and has undergone numerous rounds of chemotherapy in the years since.\n\nIn July, doctors told him two more tumours had been found, so Chris decided to opt for a cystectomy to remove his bladder entirely.\n\nMaisy burst into tears after hearing her dad is cancer-free (Picture: SWNS)\n\nMaisy was expecting Chris to be in hospital for two weeks but he came home early (Picture: SWNS)\n\nSurgeons also removed his prostate, lymph nodes, vesical veins and sperm sacks to prevent the disease coming back.\n\nChris, from Morecambe, Lancashire, said: ‘I was in agony after the operation. I still am but at least my children can wake up every day their father is going to live.\n\nAdvertisement\n\nAdvertisement\n\n‘Maisy has seen me battling cancer for six years, it has affected her too.\n\n‘It was very traumatic for her. She visited me while I was in hospital and was distraught when she left. She completely broke down.\n\nChris said his hospital stay was the first time he had spent a night away from his daughter (Picture: SWNS)\n\n‘She’s only eight, so we didn’t go into too much detail but we felt like we couldn’t lie to her either.\n\n‘For an eight-year-old to deal with all that, it’s incredible.’\n\nMaisy said she was the ‘happiest girl in the world’ to have her dad back it home.\n\nShe said: ‘My daddy is my best friend and I hated him being in hospital, now I’ve got him back cancer-free for the rest of my life.’\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "A father filmed the emotional moment his little girl burst into tears when he delivered the news he was now cancer-free. Maisy Dickson, eight, believed her dad Chris, 43, would...", "authors": ["Zoe Drewett"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88669222_1570373228.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-06"}