{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/oct/29/portland-strippers-sex-workers-labor-rights-food", "downloaded_at": "2019-10-30 23:18:47.731727+00:00", "title": "America's strip club capital sees push for fair terms, labor rights … and food", "language": "en", "text": "Meals 4 Heels is offering healthy late-night takeout for sex workers and strippers, and it’s just part of a discussion on wellness and working conditions in the industry\n\nNikeisah Newton has cornered a market in her hometown of Portland, Oregon, which she calls “strip city”.\n\n‘I make tagliatelle with them’: will acorns become the next ‘superfood’? Read more\n\nShortly before 10pm on a Friday, Newton bounces around her kitchen, steaming kale and packing take-out boxes into a tote bag. Newton is working for herself in a business she created called Meals 4 Heels, a one-of-a-kind food service that delivers fresh, nutritious bowls to sex workers and strippers during late-night hours.\n\nAfter 13 years of living in Portland and hustling in food service, Newton launched Meals 4 Heels in January. Her ex-girlfriend is a stripper and she has several friends who work in the industry. She quickly noticed that no one was looking out for their basic health needs – like sustenance.\n\n“We’re known for our food carts and strip clubs, but yet the human aspect is missing,” said Newton. “It doesn’t make sense why there hasn’t been something like this.”\n\nBetter eating is just a part of a wider discussion on wellness and labor rights and conditions taking place in some of the country’s strip clubs. Just as in more conventional workspaces, there is now a debate over workers’ rights, the complex pros and cons of contract work and a struggle to wrest better terms from employers.\n\nFacebook Twitter Pinterest Cha Cha plus chicken sausage, a dish produced by Meals 4 Heels. Photograph: Nikeisah C Newton\n\nPortland is home to the most strip clubs per capita in the US. According to research by Priceonomics, the city boasts 54 and has more than twice as many strip clubs as it has public restrooms. That is largely because Oregon’s constitution protects “obscenity” under the first amendment. Moreover, zoning laws state that businesses cannot be denied locations based on their sexual content or nature.\n\nYet despite their numbers, strippers and sex workers are rarely free from disparagement – in many instances their industry is the first to face harassment and the last to be protected.\n\nFor Newton, Meals 4 Heels is her way of putting a diverse and caring face on Portland’s sex industry, while nourishing its workers.\n\nFrom an online menu, clients can choose from several south-western and Mediterranean-inspired bowls, like the GTP ($Gettin That Paper$), a gluten-free and vegan dish that includes roasted cauliflower and sweet potato noodles; or the Freegan Vegan, piled with roasted yams, apples, sautéed mushrooms and brown rice. Almost all ingredients are organic and locally sourced.\n\n“The menu is curated for dancers,” said Newton. “No legumes, low on nightshades, low garlic, onions and acids, so they’re not gassy or breathing garlic. I keep that in mind.”\n\nNewton does all the prepping and cooking herself and delivers to about 20 clubs. She’s also running a GoFundMe campaign to help cover costs and wants Meals 4 Heels to be recognized as a business of color in America’s whitest city.\n\nAt Riverside Corral, a strip club in Portland’s south-east neighborhood, a dancer who uses the stage name Plum ordered the Verbal Tipper, which comes with lemon pepper couscous, massaged kale, pickled veggies and marinated artichokes.\n\nWhat she likes most about Meals 4 Heels, said Plum, is “the delivery, number one. And it’s so nice to have food that’s healthy that’s not going to make me fart or shit my pants. And it’s just made with love.”\n\nJulie Flores, a stripper at Club Rogue, said her favorite was the Cha Cha Cha, which blends brown rice, citrus slaw, black olives, avocado and tortilla chips.\n\nSexual revolution: the underseen art and activism of queer sex work Read more\n\n“It’s just a really good, clean option for us,” said Flores. “Where I work, we just have fried shit, like wings. So [Meals 4 Heels] provides wholesome meals that fuel our bodies, because every time I come home I feel like I just did a workout.”\n\nLate-night employees would be hard pressed to find food options that are open at 2am and not teeming with trans fats and cholesterol.\n\nBut a healthy diet is just one of the issues facing Portland’s sex workers and strippers.\n\nMatilda Bickers, a former stripper, and Amy Pitts, another dancer, sued Portland’s Casa Diablo strip club in 2015, citing unpaid wages and harassment, on the part of the customers and employees. They settled out of court.\n\nFacebook Twitter Pinterest A strip club in Portland, Oregon, which has more strip clubs per capita than any other US city. Photograph: Melanie Sevcenko/The Guardian\n\nSince then, Bickers, who now works as an escort, has been a vocal proponent of sex workers’ rights in the city. One of her most publicized platforms is lobbying for strippers to be classified as employees in Oregon.\n\nMost strippers in the US are deemed independent contractors. They’re paid in tips, rather than an hourly wage or salary.\n\n“Many of them prefer the freedom to schedule their own shifts, wear whatever they want, do the job in the way they want, work for competitors even,” said the labor lawyer Rich Meneghello. “Now if they became employees, a lot of that freedom goes away.”\n\nBut freedom also means contractors don’t pay into social security or Medicare, are not eligible for sick leave, overtime or unemployment benefits and are not protected in the same way as employees from workplace harassment.\n\nIn addition, as contractors, strippers essentially have to pay to work, through what are called stage or house fees. They can range anywhere from five dollars to well over a hundred. It’s a “pay for the pole” policy that is typically meant to cover expenses like advertising and club maintenance.\n\nIf they’re late to a shift, get sick or don’t make enough in a night to pay those fees, the stripper then owes “back rent” to the club.\n\nIn January this year, a Democratic state senator, Kathleen Taylor, introduced a bill that would have classified strippers as employees. The bill was eventually laid to rest, marking the third attempt to get this type of legislation passed.\n\nAccording to a study by Portland State University, because Portland strippers don’t require a permit, can perform fully nude, allow clients to touch them with consent during private dances, and, as contractors, lack protection from workplace agencies, “the research suggests that exotic dancers are at risk of experiencing various forms of violence while at work with limited resources to turn to for help”.\n\nOf 33 strippers who participated in the study, 32 reported experiencing some form of violence while at work, while 84% reported they had experienced “unwanted groping, rape, forced or coerced unwanted sexual acts”.\n\nElle Stanger, who dances at Portland’s Lucky Devil Lounge, is fiercely committed to maintaining her independent contractor status. She makes good money, has control over her performances and schedule, and keeps all her earnings from private dances.\n\nBut she recognizes that her club is not all clubs, which means there’s no silver bullet solution.\n\n“I just want to caution people to be wary of a quick fix approach to labor problems, when the issues tend to be so different in some cases,” said Stanger.\n\nFacebook Twitter Pinterest Elle Stanger has been co-organizing the Portland Slutwalk since 2014. It’s a demonstration against sexual violence and victim-blaming. Photograph: Courtesy Elle Stanger\n\nIn neighboring California, a bill passed the legislature in September that designates independent contractors in several industries as employees, including strippers. At first sight, it sounds good.\n\nBut Stanger, who co-hosts the sex worker industry podcast Strange Bedfellows, has been asking for feedback from strippers in California who have recently become employees. According to Stanger, the majority say the bill is damaging to their industry, claiming lower earnings and fewer bookings.\n\nStanger foresees clubs forced to fire dancers, simply because they won’t be able to afford their wages.\n\n“I heard from dancers who said: ‘I was deemed too fat for my club.’ Or due to racist management practices, they cut a lot of dancers of color,” said Stanger.\n\nAaliyah Topps, who danced in Seattle, said she believed club managers and owners favored Caucasian strippers. “I know multiple girls who aren’t allowed back to the club due to back rent and most of these are women of color. They don’t advertise women of color on any flyers, posters or websites,” she said.\n\nTopps is part of a coalition called Strippers Are Workers, which formed in the summer of 2018 through the not-for-profit Working Washington. It was co-founded by the dancer Angelique, who declined to offer her last name. She works at one of the only clubs in Seattle that is not owned by Déjà Vu, which runs roughly 132 strip clubs in 41 states. It owns 11 of Washington’s 14 strip clubs.\n\n“More and more customers were becoming aggressive, they were starting to not pay for services,” said Angelique of why she started the coalition. “[The clubs] were treating us like employees in terms of scheduling us, having control over our work and setting our prices, which is illegal.”\n\nThe coalition took its complaints to the Washington legislature last October. Topps, who stripped at Déjà Vu, testified about the lack of running water at the club, having to use a portable toilet as a restroom, harassment from management, and the $140 to $200 stage fees the dancers had to pay the club per night, which can quickly become back rent.\n\nThis May, Strippers Are Workers succeeded in getting House Bill 1756 passed. It’s a landslide piece of legislation for the sex worker industry that requires Washington strip clubs to install panic buttons in VIP rooms; offers a Know Your Rights training for dancers who apply for a business license; creates a record and “blacklist” of violent customers; and establishes an advisory committee to help implement and enforce the bill.\n\nMake yourselves at home: the meaning of hospitality in a divided world Read more\n\nThe efforts in Washington echo another reform movement in Minneapolis. In August, its city council unanimously voted in a new ordinance that mandates adult entertainment workers receive a copy of their contracts, prohibits retaliation against those who report violations and requires businesses to post customer conduct and workers’ rights information.\n\nBack in Portland, Nikeisah Newton knows the importance of lifting up those who are sidelined – as a gay, black woman working for the sex worker industry: “It’s all about marginalized groups. We’ve got to take care of each other.”", "description": "Meals 4 Heels is offering healthy late-night takeout for sex workers and strippers, and it’s just part of a discussion on wellness and working conditions in the industry", "authors": ["Melanie Sevcenko"], "top_image": "https://i.guim.co.uk/img/media/07778749811d7418adb054b80a2058b0efe9f846/40_0_1200_720/master/1200.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=de6f51dd0112981974d93233462946d6", "published_at": "2019-10-29"}