{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/kate-wright-feeling-flat-after-wedding-excitement-dies-down-and-rio-ferdinand-returns-to-work-10883155", "downloaded_at": "2019-10-08 15:50:11.168422+00:00", "title": "Kate Wright 'feeling flat' after wedding as Rio Ferdinand is back to work", "language": "en", "text": "The newly weds looked so happy during their celebration (Picture: Instagram)\n\nKate Wright has been left feeling a bit ‘flat’ after her wedding to former footballer Rio Ferdinand was over so quickly.\n\nThe now Mrs Ferdinand was left ‘feeling flat’ after her new husband had to jet back to he UK just three days after they tied the knot.\n\nKate and Rio had a blissful wedding at a luxury resort in Turkey but the entire celebration and honeymoon only lasted for 72 hours as unfortunately Rio, 40, had to return to his job as a football commentator with BT Sport.\n\nAnd it’s left Kate feeling a bit rubbish.\n\nThe new Mr and Mrs Ferdinand have been melting our hearts ever since they were first rumored to be dating in January 2017 so we expected them to have a massive wedding and a hefty honeymoon to enjoy some quality time together after getting hitched.\n\nAdvertisement\n\nAdvertisement\n\nYou can imagine our shock when former England footballer Rio suddenly appeared to be back to commentating on the football just three days after he tied the knot.\n\nKate, 28, seems to be pushing through but we’re not surprised she’s feeling a bit flat after such a wonderful celebration had to end so quickly.\n\nThe insider told Heat the wedding was ‘a magical, beautiful, three-day affair and Kate can’t believe its already over’.\n\nThey added: ‘There wasn’t a dry eye in the house when Kate walked in, and Rio said he felt like the luckiest man in the world.\n\n‘Partying continued into the next day and no-one wanted to leave, which made it even harder when Rio returned to work so quickly – Kate can’t help but feel a little flat.’\n\nWhen host Gary Lineker asked Rio on air ‘shouldn’t you be on your honeymoon?’ the former football champion agreed that ‘football is the priority’.\n\nThe pair started dating in 2017 (Picture: Getty Images for FENDI)\n\nHe added that Kate ‘knows that’.\n\nLuckily, it seems Kate has new dreams to turn her attention to and help her get over post-wedding blues.\n\nThe newlyweds have made it no secret that they want to have children together.\n\nAdvertisement\n\nAdvertisement\n\nHeat’s insider said: ‘Kate is up for having a big family, and is excited about Rio’s kids having a new brother or sister within a year.’\n\nThe former Towie star became stepmum to Rio’s three children, Lorenzo, 13, Tate, 11 and Tia, seven, after their mother, Rebecca, died in 2015.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Newlyweds Kate and Rio Ferdinand look happy in love in new behind-the-scenes of lavish wedding\n\nMORE: Kate Wright’s dad ‘proudly’ walks her down the aisle at Rio Ferdinand wedding after strained relationship", "description": "Kate Ferdinand is feeling a bit flat seeing as husband Rio Ferdinand had to go back to his football pundit job three days after the pair got married.", "authors": ["Lucy Skoulding"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/kate-rio-904e_1570546647.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-08"}