{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/14/catalan-independence-what-is-the-story-what-happens-next", "downloaded_at": "2019-10-14 10:11:02.920692+00:00", "title": "What is the story of Catalan independence – and what happens next?", "language": "en", "text": "On day that Spain’s supreme court announced verdicts in trial of 12 separatist leaders, we look at how the movement has evolved\n\nWhat is the story of Catalan independence – and what happens next?\n\nOn Monday, Spain’s supreme court announced its verdict in the landmark trial of 12 Catalan leaders accused of rebellion, sedition and misuse of public funds over their roles in the failed push for regional independence two years ago.\n\nNine of them were cleared of violent rebellion but convicted of the lesser charges of sedition and misuse of public funds.\n\nHow has the independence movement evolved over recent years and why have some of its key figures ended up in the dock?\n\nWhy do some Catalans want independence?\n\nThere has been a growing clamour in the past decade for independence from those Catalans who believe their wealthy region has a moral, cultural and political right to self-determination, and that it has long put more into Spain economically than it has received in return.\n\nBut even though successive pro-independence Catalan governments have purported to speak for all Catalans, polls have consistently shown the region is evenly split on the independence issue.\n\nPro-independence parties have never managed to take 50% of the vote in regional elections. Meanwhile, popular support for seceding from Spain – which reached a record high of 48.7% in October 2017 – is currently at 44%, with 48.3% of Catalans in opposition.\n\nHas independence always been a key issue in Catalan politics?\n\nWhile some Catalans have long dreamed of independence, the issue has only risen to the fore in recent years. In 2010, support for secession hovered at about 20%.\n\nCalls for independence grew as Spain endured a painful and protracted economic crisis. Artur Mas, the then Catalan president, switched to supporting independence in 2011 at a time of widespread anger over his centre-right Convergence and Union (CiU) party’s austerity policies. Critics have accused him of a cynical manoeuvre to redirect that fury against the central government in Madrid.\n\nMany people in the region were also angered by the Spanish constitutional court’s decision in 2010 to annul or reinterpret parts of the 2006 Catalan statute of autonomy, which would have afforded the region greater independence.\n\nHow have successive Catalan governments tried to achieve independence?\n\nIn short, by holding two referendums in contravention of Spain’s 1978 constitution, which is founded on the “indissoluble unity of the Spanish nation”.\n\nIn November 2014, Mas’s government held a symbolic, non-binding independence referendum in defiance of Spain’s constitutional court, which had ruled the vote illegal. More than 80% of participants opted for independence, but only 2.3 million of Catalonia’s 5.4 million eligible voters took part. Mas was subsequently barred from holding public office for two years.\n\nThree years later, the government of Mas’s successor, Carles Puigdemont, ignored warnings from the Spanish government and the country’s constitutional court and pushed ahead with a unilateral referendum.\n\nPro-independence parties managed to get a law for the referendum passed in the regional parliament in early September 2017, despite furious objections from opposition MPs, who said usual procedures had been disregarded. The law was eventually struck down by Spain’s constitutional court.\n\nThe Spanish government of the then prime minister, Mariano Rajoy, also insisted the vote would not go ahead and deployed thousands of police officers to Catalonia.\n\nThe poll, held on 1 October 2017, was marred by violence after Spanish police used force to try to stop the referendum. According to the Catalan government, 90% of participants opted for independence on a turnout of 42%.\n\nThe police action made front-page news across the world, damaging Spain’s reputation, while the referendum plunged the country into the worst political and constitutional crisis since its return to democracy.\n\nWhat happened next?\n\nPuigdemont signed a declaration of independence nine days later but proposed its effects be suspended for two months to allow for dialogue. Pro-independence Catalan MPs nevertheless voted on 27 October 2017 to unilaterally declare independence from Spain in a session boycotted by dozens of opposition MPs.\n\nLess than an hour later, the Spanish senate approved the use of article 155 of the constitution, which allowed Rajoy’s government to assume direct rule of Catalonia, sack Puigdemont and his cabinet, and call a snap regional election.\n\nThree Catalan pro-independence parties won 47.7% of the vote and 70 seats in the 135-seat regional parliament at the election in December 2017. But the single biggest winner was the centre-right, pro-unionist Citizens party, which took 37 seats.\n\nDirect rule was lifted in June 2018 when the new Catalan government was sworn in.\n\nWhat was the legal fallout of the referendum?\n\nKey members of Puigdemont’s government and two leading grassroots pro-independence activists, Jordi Cuixart and Jordi Sànchez, were arrested and charged.\n\nNine of the 12 defendants – who include Cuixart, Sànchez, the former Catalan vice-president Oriol Junqueras and the former Catalan parliament speaker Carme Forcadell – are accused of rebellion, which carries a prison sentence of up to 25 years.\n\nPuigdemont and three of his former cabinet ministers fled into self-imposed exile in Belgium before they could be arrested.\n\nWhat will happen next?\n\nThat’s the big question. The Catalan independence movement has always been characterised by its peaceful nature. The regional president, Quim Torra, has called on Catalans to greet guilty verdicts with “a huge show of non-violent civil disobedience”.\n\nHowever, direct action – including the blocking of roads and railway lines – is expected from the so-called Committees for the Defence of the Republic.\n\nIn late September, police in Barcelona arrested nine people associated with the CDR who were allegedly planning to sabotage Catalan infrastructure. Seven of them have been remanded in custody and are accused of belonging to a terrorist organisation and possessing explosives.\n\nSpain’s acting prime minister, Pedro Sánchez, has shown a more conciliatory approach to the independence issue than Rajoy, but has ruled out a referendum and stressed any negotiations will have to adhere to the constitution.\n\nSánchez has warned his caretaker government could apply article 155 if necessary, but he has also spoken of the need for coexistence in the region.\n\nThe independence movement, meanwhile, has lost momentum since the referendum. While Puigdemont, Torra and others favour maintaining the pressure on Madrid by following a unilateral path towards independence, Junqueras’s party, the Catalan Republican Left, is pushing for a less confrontational and more practical approach.\n\nWhatever the supreme court verdict, any answers to the Catalan question are likely to remain as elusive as ever.", "description": "On day that Spain’s supreme court announced verdicts in trial of 12 separatist leaders, we look at how the movement has evolved", "authors": ["Sam Jones"], "top_image": "https://i.guim.co.uk/img/media/153752665c55552f152e5523975f1f73e0f29a8b/0_142_2487_1492/master/2487.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5009d6473d9b19d7ad0122f7b89938cf", "published_at": "2019-10-14"}