{"pub": "yahoo", "url": "https://news.yahoo.com/merck-ceo-on-why-he-stepped-down-from-trump-council-145352058.html", "downloaded_at": "2019-10-10 18:38:36.593876+00:00", "title": "Merck CEO: Stepping down from Trump council was 'not a political issue'", "language": "en", "text": "Kenneth Frazier, the CEO of pharmaceutical giant Merck (MRK), said on Thursday he decided to publicly resign from one of President Trump’s councils in the summer of 2017 because he felt “very strongly” that the president’s rhetoric around violence in Charlottesville, Virginia, was “totally inconsistent” with the country’s “core values.”\n\n“[As] a country, no matter what political persuasion we have, we all aspire to be a rational, tolerant, hopefully, enlightened collection of free people, and we have certain values. That’s what brings us together,” Frazier said in a conversation with Yahoo Finance’s Editor-in-Chief Andy Serwer at the Yahoo Finance All Markets Summit. “We come from different countries, different places... I felt, as a matter of conscience, I should step down. I had a responsibility to my company.”\n\nThe board unanimously agreed to support him speaking to the issue, not just as an individual, but as the CEO of Merck.\n\nOn August 14, 2017, Frazier became a visible public figure when he publicly resigned from American Manufacturing Council following Trump’s polarizing response to a white supremacist rally in Charlottesville, Virginia, that became violent amid clashes between protesters and counter-protesters. At the time, Trump said there were “very fine people, on both sides.”\n\nIn a strongly worded statement at the time, Frazier embraced diversity while calling on leaders to “honor our fundamental values by clearly rejecting expressions of hatred, bigotry and group supremacy, which run counter to the American ideal that all people are created equal.”\n\nKenneth C. Frazier, chairman and CEO of Merck & Co. Inc., testifies before the Senate Finance Committee on \"Drug Pricing in America: A Prescription for Change, Part II\" February 26, 2019 in Washington, DC. (Photo by Win McNamee/Getty Images) More\n\nLess than an hour later, Trump blasted Merck, adding that Frazier should now have \"more time to LOWER RIPOFF DRUG PRICES!\"\n\nFrazier made his decision in spite of the president’s inevitable Twitter tirade. And by doing so, he paved the way for other CEOs to follow his example, and resign from their respective councils.\n\n“Beyond that, I think most of our employees, no matter where they stood politically, supported what we did because we didn’t see it as a political issue. We thought this was an issue that goes against our basic values as a country,” Frazier said at AMS.\n\nHe noted that some CEOs may have had “mixed views” about staying in the council and engaging with the administration.\n\n“I happen to feel just that as a personal matter of conscience that I couldn’t remain.”\n\nMore recently, the president has placed blame on the impeachment proceedings on the pharmaceutical industry. To that, Frazier responded, “I read that. Hmm.”\n\n“You know, Mark Twain had a quote in the 1800s, he said, and I’m not relating this to any particular person’s comment, but back in the 1800s, Mark Twain said: ‘A lie can travel halfway around the world, while the truth is putting on its shoes.’ And there were no social media in the 1800s. So, I think it’s really important for us as citizens in this country to think deeply about the issues that we face. We have major issues in our country today. And, I think the fact that we are often looking at Tweets or social media comments, I would hope that we would try to come together as a nation and try to see where our commonality is.”\n\nMore from the All Markets Summit:\n\nPharma industry is ‘right in the crosshairs,’ Merck CEO Kenneth Frazier\n\nBig data and AI will probably keep you alive longer\n\nCFTC says ether is a commodity, and ether futures are next\n\nAll Markets Summit More\n\n\n\nJulia La Roche is a finance reporter at Yahoo Finance. Follow her on Twitter.\n\n\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "Kenneth Frazier, the CEO of pharmaceutical giant Merck, explains in a new interview why he decided to publicly resign from one of President Trump’s councils in the summer of 2017.", "authors": ["Julia La Roche"], "top_image": "https://s.yimg.com/uu/api/res/1.2/FyB3sK86f8_rpp14zaJGBw--~B/aD0zMjY0O3c9NDg5NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/ea8d5460-e935-11e9-beff-535d7d11e721", "published_at": "2019-10-10"}