{"pub": "investing.com", "url": "https://ca.investing.com/news/commodities-news/oil-prices-slide-after-report-trump-weighed-easing-iran-sanctions-1965199", "downloaded_at": "2019-09-12 11:53:16.467869+00:00", "title": "Oil prices slide 2% after report Trump weighed easing Iran sanctions", "language": "en", "text": "© Reuters. UPDATE 8-Oil prices slide 2% after report Trump weighed easing Iran sanctions\n\n* OPEC cuts oil demand forecasts, following EIA\n\n* Trump discussed easing Iran sanctions -report\n\n* U.S. crude inventories drop to lowest in nearly a year -EIA\n\n* Graphic on inventories: https://tmsnrt.rs/2ZYH9NT\n\nBy Devika Krishna Kumar\n\nNEW YORK, Sept 11 (Reuters) - Oil prices tumbled more than 2% on Wednesday after a report that U.S. President Donald Trump weighed easing sanctions on Iran, which could boost global crude supply at a time of lingering worries about global energy demand.\n\nMarket participants cited a report from Bloomberg that Trump discussed easing sanctions on Iran to help secure a meeting with Iranian President Hassan Rouhani later this month.\n\nThe Bloomberg report, attributed to three unnamed sources, said then-National Security Advisor John Bolton argued against such a step. (https://tinyurl.com/y4wcevfp)\n\nBrent crude settled $1.57, or 2.5% lower, at $60.81 after hitting a session low of $60.52, while U.S. West Texas Intermediate fell $1.65, or 2.9% to end the session at $55.75 a barrel after sliding as low as $55.61.\n\nBolton's departure removes one of the strongest advocates of a hard line towards Iran from Trump's White House. reason the market reacted so dramatically is that the biggest bearish overhang on the market is the possible re-entry of Iranian oil,\" said Phil Flynn, an analyst at Price Futures Group in Chicago. \"We realized what a great impact it had on the market late last year when Trump granted waivers to the biggest buyers of Iranian oil.\"\n\n\"Bolton leaving suggests that there could be a return to the market of that oil, perhaps by the end of the year.\"\n\nIran will not negotiate with the United States while sanctions on Tehran are still enforced by Washington, Rouhani told his French counterpart Emmanuel Macron in a phone call on Wednesday, Iranian state media reported. prices are down on concern that the U.S. administration could ease its stance versus Iran, which could see disrupted Iranian oil barrels returning to the market if US sanctions against Iran get eased.\" UBS oil analyst Giovanni Staunovo said.\n\n\"This outcome would make OPEC+ target to keep the oil market in balance even more challenging in 2020.\"\n\nOil prices have eked out gains so far this month, supported by declines in global inventories and signs of easing trade tensions between the United States and China. rose this week after Prince Abdulaziz bin Salman, Saudi Arabia's new energy minister, said oil policy would not change and said the OPEC+ output cut deal would be maintained. the U.S. Energy Information Administration said domestic gasoline stocks decreased less than expected last week while crude stocks fell to the lowest in nearly a year. stocks fell by 682,000 barrels, slightly less than expected, whilst distillate stocks increased unexpectedly by 2.7 million barrels,\" said Carsten Fritsch, oil analyst at Commerzbank AG (DE: ) in Frankfurt, Germany.\n\n\"It seems that the market finally focuses more on bearish product stocks than on bullish crude stocks.\"\n\nOPEC cut its forecast for growth in world oil demand in 2020 due to an economic slowdown. OPEC/M The U.S Energy Information Administration (EIA) also slashed demand forecasts this week, and growing signs of slowdown were flagged by oil traders and executives attending industry gatherings in Singapore and Abu Dhabi. has pointed to rising global production next year. Weekly U.S. crude production has surged to a record at 12.4 million bpd while a monthly report from the EIA forecast output to average 13.23 million bpd in 2020. the downside to oil prices, Iraqi Oil Minister Thamer Ghadhban said OPEC would discuss whether to deepen output cuts, when ministers meet on Thursday. Energy Minister Alexander Novak said the alliance of OPEC and other producers, known as OPEC+, would discuss global oil demand, but there were no fresh proposals to change production cut. CHART: Brent oil still targets $64.57\n\nL3N2620D1 GRAPHIC: U.S. crude inventories weekly changes\n\nhttps://tmsnrt.rs/2y7mC9g CHART: U.S. oil may retest resistance at $58.59\n\nL3N2620SG GRAPHIC: U.S. crude inventories\n\nhttps://tmsnrt.rs/2ZYH9NT\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>", "description": "Oil prices slide 2% after report Trump weighed easing Iran sanctions", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEF0F1NE_L.jpg", "published_at": "2019-09-11"}