{"pub": "thestreet", "url": "https://realmoney.thestreet.com/investing/us-equity/u-s-china-mini-deal-removes-key-distraction-for-markets-15123835", "downloaded_at": "2019-10-12 00:58:38.742400+00:00", "title": "U.S.-China 'Mini Deal' Removes Key Distraction for Markets", "language": "en", "text": "All week long the market has been anxiously anticipating some progress on a deal with China. It started poorly on Monday morning when China indicated it was looking for a 'limited' deal, but the market came to embrace that idea as the week proceeded. There were a few rumors that the negotiations were faltering again, but hopes of a mini-deal brought in buyers the last couple days as it was obvious that some sort of progress was being made.\n\nThe deal was finally announced about 20 minutes before the close and was quickly greeted with jokes and sarcasm. It was indeed a 'mini-deal' with the Chinese agreeing to buy some additional agricultural products and the U.S. agreeing to postpone some tariffs. There was some agreement on intellectual property but no details were issued. An enforcement mechanism has yet to be designed and it would take up to five weeks to put the deal in writing. President Trump called it 'Phase One' and indicated there could be several more phases.\n\nThe indices were set up perfectly for a 'sell the news' reaction to a vague deal with limited substance. However, the selling was limited to just the intraday gains in the S&P500 ETF (SPY) . The SPY ended up closing almost exactly where it opened, but left a gap on the charts that technical traders will be watching closely.\n\nThe good news is that this distraction will come to an end at least for a little while. Market players have been handcuffed as they have had to wait for the next headline on China trade all week. With that over, we may be able to focus more on individual stock picking just as earnings season is about to begin.\n\nI am looking for a little more 'sell the news' action next week but I expect support to be found fairly fast. While the trade deal isn't very substantive the important thing for the market is that there is a temporary truce and that the issue isn't going to be a constant distraction. We can now focus more on the economy, central banks and the merits of individual stocks.\n\nI'm looking forward to more 'normal' trading next week and will be working hard on some new stock picks.\n\nHave a great weekend. I'll see you on Monday.", "description": "The &quot;mini-deal' announced Friday drew immidiate scorn, but it removes an important distraction for the markets ahead of earnings season....SPY", "authors": ["James", "Rev Shark", "U.S.-China 'Mini Deal' Removes Key Distraction For Markets", "The", "Mini-Deal' Announced Friday Drew Immidiate Scorn", "But It Removes An Important Distraction For The Markets Ahead Of Earnings Season.", "Stocks Quotes In This Article", "Timothy Collins", "Jim Cramer", "Maleeha Bengali"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/e39b7ebc-d65a-11e9-822b-6370f69b2059.png", "published_at": "2019-10-12"}