{"pub": "usatoday", "url": "https://usatoday.com/story/sports/ncaaf/2019/10/20/coaches-poll-alabama-still-no-1-while-wisconsin-boise-state-tumble/4045072002", "downloaded_at": "2019-10-20 16:54:45.488272+00:00", "title": "Wisconsin, Boise State takes major tumbles in latest Amway Coaches Poll", "language": "en", "text": "The upset bug found its way into the Amway Coaches Poll this weekend, though the top five teams were able to avoid it in the Week 8 slate.\n\nAlabama strengthened its hold on the No. 1 spot. The Crimson Tide received 43 of 65 first-place votes this week. Alabama was able to pull away from Tennessee in the second half despite quarterback Tua Tagovailoa leaving the game in the first half with an ankle injury.\n\nClemson retained the No. 2 spot with 10 first-place nods this week. The Tigers overcame a slow start to subdue Louisville and keep control of the ACC race.\n\nWisconsin players walk off the field as Illinois celebrates their 24-21 win at Memorial Stadium. (Photo: Holly Hart, AP)\n\nLSU held on to the No. 3 spot after handling Mississippi State. The Bayou Bengals received three first-place votes. Ohio State remained No. 4, though the Buckeyes doubled their first-place vote total to eight this week after another dominant performance against Northwestern. Oklahoma, a big winner against West Virginia, held steady at No. 5.\n\nTOP 25: Complete Amway Coaches Poll rankings\n\nWINNERS AND LOSERS: Highs and lows from Week 8 in college football\n\nFOOTBALL FOUR: Will Tua Tagovailoa injury have impact in playoff race?\n\nSome key results in the Big Ten caused the most movement in the poll. Penn State inherited the No. 6 position vacation by Wisconsin following the Badgers’ stunning loss to Illinois. The Nittany Lions held off then-No. 16 Michigan in a prime-time spotlight game to remain on a collision course with Ohio State. Wisconsin tumbled seven places to No. 13 while Michigan dropped to No. 20.\n\nNotre Dame, which had the weekend off, moved up to No. 7. Following are Florida, Georgia and Auburn, once again giving the SEC half the spots in the top 10. No. 11 Oregon and No. 12 Utah lead the Pac-12 representatives.\n\nNo. 17 SMU kept its record clean with a solid win against Temple. The Mustangs now have the highest ranking among group-of-five conference members after Boise State’s upset loss at BYU knocked the Broncos eight places down to No. 21.\n\nNo. 23 Wake Forest and No. 25 Memphis rejoin the top 25 as Washington and Temple fall out.", "description": "The first loss of the season for both Wisconsin and Boise State saw each team fall back in the Amway Coaches Poll. Alabama remains No. 1 ahead of Clemson.", "authors": ["Eddie Timanus", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/19/USAT/d25bb7ea-004f-4f39-8709-9645fa95aadc-AP_Wisconsin_Illinois_Football.JPG?crop=3299,1856,x1,y292&width=3200&height=1680&fit=bounds", "published_at": "2019-10-20"}