{"pub": "businessinsider", "url": "https://businesstimes.com.sg/garage/propertyguru-lodges-prospectus-for-australia-listing-to-raise-up-to-a380m ", "downloaded_at": "2019-10-07 04:41:58.334814+00:00", "title": "PropertyGuru lodges prospectus for Australia listing to raise up to A$380m", "language": "en", "text": "SOUTH-EAST Asian real estate portal PropertyGuru, which counts buyout firms TPG Capital and KKR among its backers, has announced its intention to list on the Australian Securities Exchange (ASX), which will fund potential expansion plans such as an online mortgage marketplace and data offerings.\n\nIn a prospectus lodged on Monday, the Singapore-based property technology (proptech) firm gave an indicative price range of A$3.70 to A$4.50 per share for the initial public offering (IPO).\n\nAssuming the final price is at the midpoint of the indicative range and the offer is successful, the IPO will raise about A$362.6 million (S$338.1 million), PropertyGuru said in a media statement on Monday.\n\nMeanwhile, the low end of the price range works out to a total of A$345 million, while the high end translates to A$380.2 million.\n\nThe retail offer is expected to open on Oct 16 and close on Oct 22. The final price will be announced to the market on Oct 24.\n\nGet the latest on startups\n\nand business news Terms & conditions Sign up\n\nAbout 30.1 to 32.2 per cent of the company will be held by new investors plus existing investors who are not subject to voluntary escrow deeds, at the completion of the offer, according to the prospectus seen by The Business Times (BT).\n\nBased on the midpoint of the indicative price range, TPG and KKR are expected to hold 26 per cent and 23.3 per cent of shares in PropertyGuru respectively on issue at the completion of the IPO. TPG and KKR currently hold 30.4 per cent and 27.25 per cent respectively.\n\nThe indicative market capitalisation will be within the range of A$1.16 billion to A$1.36 billion, according to the prospectus.\n\nPropertyGuru runs digital property classifieds marketplaces in five countries across South-east Asia: Singapore, Vietnam, Malaysia, Thailand and Indonesia. The group has an average 60 per cent market share across these five core markets, and more than 23 million property seekers visit its portals every month, it said on Monday.\n\nAsked why PropertyGuru decided to list on the ASX despite not having businesses in Australia, a company spokesman declined to comment. The company has made a filing with the US Securities and Exchange Commission (SEC) and thus entered a quiet period, the spokesman told BT. The quiet period is an SEC-mandated embargo on promotional publicity before an IPO.\n\nPropertyGuru did not announce any plans to expand into Australia. In the prospectus, Australia and the UK are cited as examples of developed markets, in contrast to its South-east Asian core market which lags behind in terms of Internet penetration and is still in the early stages of offline-to-online migration for real estate advertising.\n\nIn its media statement, the company said its pro forma revenue has grown at a 26 per cent compound annual rate over the last three years. In 2018, PropertyGuru also became Ebitda (earnings before interest, tax, depreciation and amortisation) positive and also free cash flow positive.\n\nPart of the IPO proceeds will be used to pursue the company’s growth strategy, which includes potentially developing data offerings to customers, as well as creating an online mortgage marketplace to provide property seekers in its core markets with convenient access to mortgage financing, said chief executive officer Hari Krishnan.\n\nThe prospectus states that PropertyGuru will likely start with developing online mortgage marketplace products in Singapore and Malaysia, through one of three strategies: build organically, partner other industry players such as financial and fintech institutions, or potentially acquire suitable targets.\n\nPropertyGuru also identified other growth opportunities such as refinancing, transaction, insurance and home services such as connections and repairs.\n\nChairman Olivier Lim said that the market opportunity for online property advertising in its core markets is underpinned by trends such as strong population growth, urbanisation, increasing Internet penetration, greater access to mobile phones especially smartphones, and rising wealth levels leading to the expansion of the middle classes – which is a key driver of housing demand.\n\n“Online property advertising on our digital platforms offers agents and developers more cost-effective solutions than traditional print channels, and allows them to target a broader audience,” Mr Lim said.\n\n“We expect these trends to shift property advertising away from print and other offline channels in our core markets to online, as property seekers increasing use digital channels to conduct their searches,” he added.\n\nMr Krishnan said PropertyGuru has established a strong market position in the South-east Asian property ecosystem, largely thanks to its strategic significant investment in technology and digital innovation.\n\nThe company has developed proprietary scalable technology platforms using artificial intelligence and augmented reality, which enabled it to provide a “differentiated” digital offering, according to Mr Lim.\n\nIn the past 12 years, PropertyGuru has grown from a single-market startup to a diversified proptech company.\n\nIts portfolio of products includes the online classifieds marketplaces as well as a regional property awards business. It also provides a sales automation solution, PropertyGuru FastKey, used by property developers to enable end-to-end project management from launch to sales conversion.\n\nFollowing a reshuffle last month, the company’s board of directors now comprises independent non-executive chairman Mr Lim; independent non-executive directors Jenny Macdonald and Melanie Wilson; CEO and managing director Mr Krishnan; co-founder and executive director Steve Melhuish; and non-executive directors Dominic Picone, Terence Lee and Paul Bassat.\n\nFor the IPO, Gilbert & Tobin is the Australian legal adviser, while Allen & Gledhill is the Singaporean legal adviser.\n\nThe joint lead managers are Credit Suisse, UBS, KKR Capital Markets and TPG Capital BD. The offer is not underwritten.", "description": ": THE BUSINESS TIMES Garage - SOUTH-EAST Asian real estate portal PropertyGuru, which counts buyout firms TPG Capital and KKR among its backers, has announced its intention to list on the Australian Securities Exchange (ASX), which will fund potential expansion plans such as an online mortgage marketplace and data offerings. . Read more at The Business Times.", "authors": ["Fiona Lam"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/garage/images/BTGaragedefault600.jpg", "published_at": "2019-10-07"}