{"pub": "thehill", "url": "https://thehill.com/policy/international/467612-isis-leader-believed-killed-in-us-raid", "downloaded_at": "2019-10-27 11:52:27.236268+00:00", "title": "ISIS leader believed dead after US raid", "language": "en", "text": "Officials believe ISIS leader Abu Bakr al-Baghdadi is dead after a U.S. military raid in Syria, according to multiple reports.\n\nA senior U.S. defense official told CNN that Baghdadi apparently detonated a suicide vest as Special Operations forces approached his location in northwest Syria on Saturday.\n\nADVERTISEMENT\n\nThe official added that DNA and biometric testing is being conducted, according to the network.\n\nThe White House announced late Saturday that President Trump Donald John Trump Comey: Mueller 'didn't succeed in his mission because there was inadequate transparency' During deposition, official says he made several efforts to advocate for Marie Yovanovitch Bolton looms large as impeachment inquiry accelerates MORE would be making a “major statement” on Sunday morning at 9 a.m.\n\nTrump tweeted Saturday night that something “very big” had just happened.\n\nSomething very big has just happened! — Donald J. Trump (@realDonaldTrump) October 27, 2019\n\nThe Associated Press noted that a Syria war monitor reported an attack including eight helicopters and a warplane from the international coalition fighting the terror organization targeted a group linked to al Qaeda, Hurras al-Deen, in Idlib Province on Saturday.\n\nThe Syrian Observatory for Human Rights added that ISIS operatives were thought to be hiding in the area, according to the AP, which reported that the group documented the deaths of 9 people in the attack.\n\nISIS last April released a video showing al-Baghdadi in good health, speaking with three men whose faces were blurred, according to multiple reports.\n\nAl-Baghdadi in the video acknowledged the end of the battle of Baghouz, Syria, which marked ISIS’s territorial defeat, but vowed that the fight was not over.\n\nThe U.S. and its coalition partners declared victory against ISIS in March after the Syrian Democratic Forces (SDF) retook its last pocket of land in Baghouz.\n\nThe U.S. military relied on the Syrian Democratic Forces, which is led by the Kurds, as the local ground force fighting ISIS. Trump earlier this month withdrew U.S. forces from northern Syria ahead of a Turkish assault on the area, sparking criticism. Ankara considers the Syrian Kurds to terrorists who are an extension of a Kurdish insurgency within Turkey.\n\nThe SDF said Sunday that it worked with the U.S. on a \"historic, successful\" mission against ISIS, according to Reuters, but did not provide details.\n\nThe news service added that Iraqi state TV aired footage of the raid, with footage showing an explosion, a crater and blood-stained clothes.\n\nAn Iraqi intelligence official told Reuters that Tehran’s intelligence service discovered al-Baghdadi’s location and gave it to the U.S.-led coalition.\n\nAl-Baghdadi announced the formation of a self-styled caliphate in a 2014 speech at the Great Mosque of al-Nuri in Mosul, Iraq.\n\nRumors of his death have emerged periodically.\n\nIn June 2017, Russia claimed to have killed him in airstrikes on a meeting of ISIS leaders outside Raqqa, Syria. While the claim was met with much skepticism at the time, it did lead to widespread speculation about his whereabouts.\n\n--This breaking news report was last updated at 7:46 a.m.", "description": "Officials believe ISIS leader Abu Bakr al-Baghdadi is dead after a U.S. military raid in Syria, according to multiple reports.", "authors": [], "top_image": "https://thehill.com/sites/default/files/isis_2_0.jpg", "published_at": "2019-10-27"}