{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/23/WS5dafbbb2a310cf3e355720dc.html", "downloaded_at": "2019-10-23 08:29:29.343283+00:00", "title": "London gathering celebrates close China-UK business ties", "language": "en", "text": "By ZHANG YUNBI | China Daily Global | Updated: 2019-10-23 10:32\n\nThe 15th World Chinese Entrepreneurs Convention opens on Oct 21 in London. [Photo/Agencies]\n\n15th entrepreneur event a platform for deals, connections and opportunities\n\nProminent figures from both China and the United Kingdom have voiced their confidence in the potential of Chinese entrepreneurs and in joints efforts to build the Belt and Road Initiative during a grand business gathering that began in London on Tuesday.\n\nWang Yang, chairman of the National Committee of the Chinese People's Political Consultative Conference, sent a congratulatory message to the 15th World Chinese Entrepreneurs Convention, which is continuing at ExCel London.\n\nThe Belt and Road Initiative, which was first proposed by President Xi Jinping six years ago, breaks new ground for world economic growth, builds a new venue for global trade and investment, and \"offers fresh opportunities\" for Chinese entrepreneurs, Wang said in his message.\n\nHe called on Chinese businesses to jointly promote high-quality development within the region covered by the Belt and Road Initiative, improve livelihoods, and bolster the building of a community of shared future for mankind.\n\nIt is the first time the convention has been held in Europe. Wang said it will surely boost wide-ranging exchanges and cooperation between Chinese business people and their European counterparts and contribute more to economic globalization and trade internationalization.\n\nLiu Xiaoming, China's ambassador to the UK, noted at the convention that Chinese entrepreneurs around the world have invested in 80 percent of the countries and regions of the world, and are involved in a wide range of areas, including science and technology innovation, trade and investment, culture, and education.\n\nLiu said Chinese entrepreneurs are expected to bring global partners together to take part in China's development, and together they will create new opportunities and share the benefits of China's development.\n\nHe said many Chinese companies are investing in the UK and casting a vote of confidence in the future of China-UK economic cooperation.\n\nBritain's Prince Andrew, the duke of York, said at the convention's opening ceremony that \"we are witnessing a once-in-a-half-millennium change in the world order-the paradigm shift in the global economy that stems from the rapid growth of the emerging markets; the fundamental challenge and resistance to the profound changes in global governance; and the technological innovations in AI and 5G that is transforming the world around us,\" he said.\n\nHe called for the exploration of ways to apply these technologies in education and healthcare, and said the Belt and Road Initiative is another opportunity for the UK and China to collaborate.\n\n\"I can see opportunities arising all over the world,\" he added.\n\nJohn Peace, co-chair of the World Chinese Entrepreneurs Convention's steering committee and former chairman of Standard Chartered, said deals between China and the UK \"are not just one-way\" because while Chinese investment flows into the UK, British companies are also investing in China.\n\n\"I hope the event will bring you many new deals, new connections and new opportunities,\" he said.", "description": "Prominent figures from both China and the United Kingdom have voiced their confidence in the potential of Chinese entrepreneurs and in joints efforts to build the Belt and Road Initiative during a grand business gathering that began in London on Tuesday.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/23/5dafbbb2a310cf3e97a28e9f.jpeg", "published_at": "2019-10-23"}