{"pub": "fox", "url": "https://foxnews.com/sports/nba-adam-silver-china-row-hong-kong", "downloaded_at": "2019-10-08 12:09:32.568927+00:00", "title": "Adam Silver addresses NBA's China, Hong Kong controversy and says league won't regulate free speech", "language": "en", "text": "Amid growing backlash against NBA owners for siding with deep-pocketed Beijing powerbrokers over one of their own employees – who was rebuked for a pro-Hong Kong protest tweet – the league's commissioner released a statement Tuesday morning seeking to clarify the NBA's relationship with the communist country.\n\nThe statement from Adam Silver, released before a news conference in Tokyo, said the league “will not put itself in a position of regulating what players, employees and team owners say or will not say on these issues” — a popular sentiment, but one that appeared at odds with the actions of high-ranking NBA leaders in the aftermath of Houston Rockets General Manager Daryl Morey tweeting about Hong Kong, the autonomous Chinese territory in the middle of contentious demonstrations over a host of human rights issues.\n\nCHINESE GOVERNMENT CANCELS NETS EVENT, WON'T BROADCAST NBA PRESEASON GAMES AFTER TWEET FALLOUT: REPORT\n\n“It is inevitable that people around the world – including from America and China – will have different viewpoints over different issues,” Silver said in the statement. “It is not the role of the NBA to adjudicate those differences.”\n\nSilver added: “This is about far more than growing our business...Values of equality, respect and freedom of expression have long defined the NBA -- and will continue to do so. As an American-based basketball league operating globally, among our greatest contributions are these values of the game.”\n\nSilver, who's previously been lauded for his progressive stewardship of the NBA, said he still plans to go to China on Wednesday in advance of preseason games there between the Los Angeles Lakers and Brooklyn Nets.\n\nNBA'S CONTROVERSY WITH CHINA IS ALL ABOUT MONEY, SHOULDN'T BE SURPRISING TO ANYONE, JESSE WATTERS SAYS\n\nThe current flap arose after Morey tweeted a picture of a slogan reading “Fight for Freedom. Stand with Hong Kong.” But Morey deleted the tweet after significant blowback — including a tweet from Rockets owner Tillman Fertitta saying Morey \"does NOT speak for\" the team. Morey later backtracked on his advocacy.\n\n“I did not intend my tweet to cause any offense to Rockets fans and friends of mine in China,” he wrote. “I was merely voicing one thought, based on one interpretation, of one complicated event. I have had a lot of opportunity since that tweet to hear and consider other perspectives.”\n\nHe added: “I have always appreciated the significant support our Chinese fans and sponsors have provided and I would hope that those who are upset will know that offending or misunderstanding them was not my intention. My tweets are my own and in no way represent the Rockets or the NBA.”\n\nTED CRUZ KNOCKS NBA IN TWEET DEFENDING 'SOUTH PARK' IN CHINA\n\nMorey's initial tweet led to several Chinese sportswear brands suspending ties with the Rockets. The Chinese Basketball Association also canceled a preseason event involving the Rockets’ G-League affiliate, according to The Athletic.\n\nSilver said later at a press conference the league was “apologetic” over the outcome, but was “not apologizing for Daryl exercising his freedom of speech,\" though Morey appeared to do that himself in his damage-control tweet. Silver added that he “regrets” how so many Chinese people and NBA fans were upset by Morey's message.\n\nGeng Shuang, a Chinese Foreign Ministry spokesman, said ordinary people have already expressed their position over the tweet.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\n“How can it be possible to carry out exchanges and cooperation with China without knowing China's public opinion?” Geng asked. “[The] NBA's cooperation with China has been going on for quite a long time, so what should be said and what should be done, they know best.”\n\nThe Associated Press contributed to this report.", "description": "Amid growing backlash against NBA owners for siding with deep-pocketed Beijing powerbrokers over one of their own employees -- who was rebuked for a pro-Hong Kong protest tweet -- the league's commissioner released a statement Tuesday morning seeking to clarify the NBA's relationship with the controversial communist country.", "authors": ["Ryan Gaydos", "Ryan Gaydos Is A Sports Reporter For Foxnews.Com", "Foxbusiness.Com. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/NBA-Adam-Silver4.jpg", "published_at": "2019-10-08"}