{"pub": "bbc", "title": "Two boys in need of a home, two parents mourning lost children", "url": "https://bbc.com/news/stories-49557993", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:15:29.640513+00:00", "text": "Image copyright Jack Losh\n\nTwo children who walked into a village in the north-west of the Central African Republic earlier this year, after a long trek through forest and savannah, are symbolic of a growing problem: after years of civil war, thousands of children in the country have been orphaned. Could recruiting large numbers of foster parents be the answer?\n\nLate one morning at the height of the dry season, Henriette Idjara was heading home to her village when she spotted two boys slumped by a parched riverbed. Clothes torn, caked in dust, the teenagers were in dire need.\n\nHenriette couldn't turn away. As a mother who had lost five of her own children, the 53-year-old felt a strong maternal instinct telling her to help.\n\n\"What are you doing here?\" she asked.\n\nThe brothers, Guy and Nelson, told her that rebel soldiers had raided their village and executed their father in cold blood, several months earlier. Their mother had left long ago. Living in fear of further attacks and unable to make ends meet, the boys eventually decided to leave, setting off on foot to find work. By the time Henriette found them, a week later, they had walked about 150 miles.\n\n\"They were trying to get to a gold mine,\" says Henriette. \"I told them, 'Listen, that place is dangerous. There is much violence there.'\" Instead, she took them back to her home.\n\nIt was a moment for which she and her husband, Jean-Philippe, were prepared. The couple have a son and three daughters, but five other children had succumbed to fatal bouts of malaria, meningitis and other diseases. In the wake of these tragic deaths, they had registered last year as foster parents and were waiting to be assigned children.\n\n\"This is our calling,\" says Jean-Philippe, a church deacon. \"All children should be cared for, so they can grow up and build a better society than the one we have now.\"\n\nImage copyright Jack Losh Image caption Nelson and Guy with Jean-Philippe and Henriette, and another child\n\nThe Central African Republic was plunged into chaos in 2013 when Muslim rebels of the Seleka alliance seized power, triggering the mobilisation of mostly Christian \"anti-balaka\" militias.\n\nHundreds of thousands were displaced in the violence that followed and an unknown number of children orphaned or separated from their parents. Chaotic attacks have continued across the country ever since.\n\nA peace deal agreed in February has raised hopes of a permanent end to the conflict, but it has not always translated into a palpable sense of security on the ground. Guy and Nelson set off on their journey weeks after it was signed.\n\nHenriette and Jean-Philippe learned more of the horrors they had endured in the days after the meeting on the riverbank.\n\nAccording to the boys, militants armed with grenades and AK47s stormed their quiet village by motorbike, shooting civilians indiscriminately and setting fire to houses. Some of the inhabitants fled into the bush but their father stayed to defend their home. He shot three of the attackers with a hunting rifle but was eventually captured and hacked to death with a machete.\n\nGuy and Nelson escaped capture by hiding in a bush. \"We saw everything,\" says Guy, the younger of the two.\n\nAfterwards, once the militants had dispersed, leaving the village in smouldering ruins, they emerged from their hiding place and buried their father's body.\n\nSince taking the boys under their wing, Henriette and Jean-Philippe have been employing a combination of love and discipline to create the semblance of a normal childhood.\n\n\"We support them as much as possible,\" says Henriette.\n\n\"We tell them that they should not think too much about what has happened, that so many people here have experienced tragedy, that life is full of difficulties. We remind them about the importance of education and we give them rules: not to go out late or misbehave with their friends.\"\n\nImage copyright Jack Losh Image caption A camp for displaced people in Kaga-Bandoro, east of Bossangoa\n\nSo far this year a handful of humanitarian organisations, under the leadership of the UN children's agency, Unicef, have registered and supported 1,500 orphaned or separated children. The goal is to reach more than 4,000 by the end of December.\n\nBut only 1,000 families nationwide are registered as foster carers, so an urgent search is on for more. Word is spread via community leaders, social workers, town-hall-style meetings and radio broadcasts. Carers must be at least 25 years old, have experience of raising children and live in a secure community as the head of a household.\n\nIf not enough can be found, the risk is that a volatile underclass will find itself at the mercy of armed groups, which still control most of the country.\n\n\"Family-based care is essential to promote the wellbeing of those vulnerable children traumatised by the conflict,\" says Therese Mansan, a Unicef child protection specialist in CAR.\n\nWhen Henriette and Jean-Philippe first registered last year as would-be foster parents, the humanitarian organisation SOS Children's Villages gave them training in children's rights and the responsibilities of carers.\n\nThen, when they took Guy and Nelson in, it sent child psychologists to assess the teenagers. Like other foster parents, Henriette and Jean-Philippe signed a contract and will now be subject to unannounced visits to ensure the boys are cared for properly.\n\nThe family is also receiving help to ease the pressure of taking on more dependants. SOS Children's Villages provides useful household items, such as foam mattresses and mosquito nets, toothbrushes and towels, clothing, cutlery and soap.\n\nSeparated children at risk\n\nYoung people who have been separated from their parents and informally absorbed into other families on the move can face high levels of abuse, exploitation and neglect.\n\nPoverty and desperation can drive caregivers to prioritise their biological children and regard adopted ones as a free source of labour.\n\n\"The international community needs to give more thought to the ways in which it can sufficiently track and monitor separated and orphaned children during times of conflict,\" says Sophie Bray-Watkins, who oversees youth advocacy at War Child UK.\n\n\"These are huge challenges but they really are priorities in terms of protection.\"\n\nHaving seen much violence since 2013, the area around Bossangoa is now calm but some children have been deeply affected says Melly Gael, a child psychologist with SOS Children's Villages.\n\n\"Some of them have become violent as this is all they've known,\" she says.\n\nNot far from Guy and Nelson's new home, the charity runs a \"child-friendly space\" where children affected by the war can enjoy drawing, learning and playing.\n\nAs children aged between four and five burst into song beneath a tin roof, on mats covering the bare earth, the faces of some light up with beaming, toothy smiles, but others remain withdrawn. The most traumatised children are easily upset and may lash out at others; there is a child psychologist in the next room ready to assist.\n\n\"This place helps the children forget what they have experienced,\" says Narcisse Ngalibele, a child-protection specialist. \"It helps them to be children again.\"\n\nFor Guy and Nelson that opportunity may have passed.\n\nPain remains etched on the boys' faces. Guy, the younger of the two, often looks sad and lost, while Nelson appears to be smouldering with anger. Both have regular nightmares. \"We never want to go back,\" says Guy, staring at the ground.\n\nBut under Henriette and Jean-Philippe's care, they are beginning to look towards the future. Guy wants to become a mechanic. Nelson is keen to return to school and finish his studies. Staff from SOS Children's Villages continue to search for their missing mother in the hope of one day reuniting them.\n\n\"I often see my father in my dreams,\" says Nelson.\n\n\"He tells me not to go back to our village. This is my home now. We have to start a new life.\"\n\nYou may also be interested in:", "description": "Two boys walked 150 miles across central Africa after their father was killed. Then they met a woman who'd lost five children.", "authors": ["Jack Losh", "Bossangoa", "Central African Republic"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/E3C5/production/_108590385_nelson_guy976650.jpg"}