{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/obsessed-miley-cyrus-fan-detained-104500843.html", "downloaded_at": "2019-09-25 13:43:02.949976+00:00", "title": "An Obsessed Miley Cyrus Fan Was Detained and Arrested at Her Concert for a Highly Creepy Threat", "language": "en", "text": "From Cosmopolitan\n\nAn obsessed Miley Cyrus fan was reportedly detained and arrested at her recent Las Vegas concert.\n\nThe fan made some alarming threats against Miley on Twitter, hence being on her security team's radar.\n\nToday in incredibly creepy and alarming news, an obsessed Miley Cyrus fan seems to have found his way into the audience at her iHeartRadio show in Las Vegas. According to TMZ, the 42-year-old man was spotted in the crowd by Miley's body guards, who detained him and called the police. He ended up being arrested and booked into Clark County Jail on a \"felony charge of making threats\" and is still in custody as of September 24.\n\nThis dude was reportedly already was on Miley's security \"watch list\" because of previous threats made against the singer that are highly disturbing. According to TMZ's sources, the fan told Miley's team that \"It's my life's mission to impregnate Miley,\" which is obviously highly concerning and upsetting. Apparently he also expressed an interest in \"raising Michael Jackson and Prince from the dead so they could party with him and Miley.\"\n\n\n\nView photos Photo credit: Matt Winkelmeyer - Getty Images More\n\nMiley's team found out about the fan after stumbling across his Twitter feed, where he made it clear he hoped to meet her in Vegas. They ended up distributing his photo to staff inside the iHeartRadio venue, who were told to keep a lookout during the show.\n\nMiley is coming off a difficult couple of months thanks to her split from Liam Hemsworth after less than a year of marriage, as well as a recent breakup with Kaitlynn Carter—who she briefly dated post-Liam. In other words, the last thing she needs right now is a stalker.\n\nYou Might Also Like", "description": "Nope, nope, nope, nope.", "authors": ["Mehera"], "top_image": "https://s.yimg.com/uu/api/res/1.2/uVwBqMiwX1_zrpfn4KJrAg--~B/aD0xMjc4O3c9MjU1NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/cosmopolitan_438/92207011379bcb147b1800b4963b2619", "published_at": "2019-09-24"}