{"pub": "reuters", "url": "https://in.reuters.com/article/uk-athletics-world-obiri/kenyas-obiri-defends-5000m-world-title-idINKCN1WK0IM", "downloaded_at": "2019-10-05 23:02:09.576470+00:00", "title": "Kenya's Obiri defends 5,000m world title", "language": "en", "text": "DOHA (Reuters) - Hellen Obiri of Kenya displayed her dominance of the 5,000 metres at the world athletics championships on Saturday by winning a second consecutive world title in a tight race at Khalifa International Stadium.\n\nAthletics - World Athletics Championships - Doha 2019 - Women's 5000 Metres Final - Khalifa International Stadium, Doha, Qatar - October 5, 2019 Kenya's Hellen Obiri celebrates winning gold REUTERS/Dylan Martinez\n\nThe 29-year-old, who had entered the competition with the fastest time of the season, ran the first kilometre in less than three minutes and stayed ahead of the pack for most of the race.\n\nWith four laps remaining, Germany’s Konstanze Klosterhalfen and Margaret Kipkemboi of Kenya were a stride behind Obiri but she resisted the pressure and stayed in front.\n\nObiri’s lead came under threat again at the bell but the Kenyan kept her composure, sprinting to increase the gap between herself and the pack to cross the finish line in 14 minutes 26.72 seconds, a championship record.\n\n“We have such great runners in Kenya,” Obiri said. “I worked hard to prove that we can win.”\n\nKipkemboi won silver, finishing less than one second after Obiri, drawing applause and cheers from flag-waving Kenyan supporters.\n\nKlosterhalfen took the bronze with 14:28.43.\n\nKlosterhalfen is part of the Nike Oregon Project (NOP), an elite long-distance running training centre led by American coach Alberto Salazar who earlier this week was banned for four years for doping violations.\n\nThe 22-year-old German joins other NOP athletes to step on to the podium in Doha, including Sifan Hassan of the Netherlands, who won gold in the 1,500m and 10,000m.\n\nKlosterhalfen said the scandal around Salazar had not disrupted her preparations for the race.\n\n“It’s really nice to see the whole team performing well,” she said. “It showed how good we trained.”\n\nObiri had finished a disappointing fifth in the 10,000m last Saturday but refocused in time to redeem herself in the shorter race.\n\n“I just told my coach to let me focus on the 5,000m and I will do my best,” said Obiri, who added she might try the 10,000m again at next year’s Tokyo Olympics.", "description": "Hellen Obiri of Kenya displayed her dominance of the 5,000 metres at the world athletics championships on Saturday by winning a second consecutive world title in a tight race at Khalifa International Stadium.", "authors": ["Gabrielle Tétrault-Farber", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191005&t=2&i=1437478024&w=1200&r=LYNXNPEF940IQ", "published_at": "2019-10-05"}