{"pub": "nytimes", "url": "https://nytimes.com/2019/10/15/opinion/democrats-debate-republicans.html", "downloaded_at": "2019-10-15 11:20:47.696229+00:00", "title": "Opinion | Why Are Democrats Jilting G.O.P. Voters Who Want to Like Them?", "language": "en", "text": "The best example of how candidates botch their approach is on the issue of abortion. A majority of Americans want to uphold Roe v. Wade, but a longstanding 80 percent of them support restrictions of some kind (according to 2019 Gallup polling), most notably in the third trimester (as of 2018 Gallup polling, 65 percent support restrictions in second trimester as well). Only Senator Amy Klobuchar and Ms. Gabbard have admitted to supporting third-trimester restrictions. The rest, including the current front-runners Senator Elizabeth Warren and the former vice president Joe Biden, have offered rare consideration for restrictions or conversation around why such large portions of the country support them.\n\nAbortion and reproductive rights may not be a “deal breaker” vote for swing voters, as a recent Fox News poll revealed, but it is an issue that matters deeply to them, especially those who hold faith in high regard. More to the point, it’s curious that so many Democratic candidates hold a view consistent with so few voters. No one should swap genuine beliefs about abortion to appease polling numbers, but if these candidates represent the American people, they are statistically divergent from them in a dramatic way. This may mean a few of them are hiding their authentic beliefs about abortion for political safety — but that’s to their detriment.\n\nThe answer for candidates isn’t necessarily changing policy positions but offering room for conversation with those who support restrictions and respect for an alternative position that is rooted in genuine beliefs about the origins of life.\n\nEven Mr. Biden, viewed as a moderate, has disappointed on the issue, reversing his long-held position on banning federal funds for abortion. This has damaged his “moderate” brand slightly. He has also given into relentless badgering from progressives, endorsing the Green New Deal and bowing to liberal sexual politics with his recent announcement that he would support men who identify as women being housed with females in prison.\n\nAll of this leftward marching, for Mr. Biden and others, moves candidates further from potential voters it’s necessary to win over. These folks may not vote for Mr. Trump (or vote at all), but Democrats stand to lose this opening with them for good. Now is the time to put formerly Republican voters on notice, as Ms. Gabbard has done with her distinctive approach.\n\nThey crave the anti-Trump, not a hypocritical Kamala Harris and her indefensible record on criminal justice. Ms. Harris describes herself as a “progressive prosecutor,” but infamously upheld multiple wrongful conviction cases and failed to support a ballot initiative that would reduce penalties for nonviolent crimes. These voters also have little interest in an opportunistic Mayor Pete Buttigieg: For years in Indiana politics, he worked “cordially” with Mike Pence, then the governor, but only since becoming a rising star in the Democratic Party has the mayor chosen to demean Mr. Pence’s religious beliefs.\n\nMs. Gabbard and Ms. Klobuchar — who also tends to focus on winnable, bipartisan issues like lowering the price of prescription drugs — appear to be the only two candidates to understand this opportunity for new votes.", "description": "Candidates are leaving potential Republican converts without options.", "authors": ["Ericka Andersen"], "top_image": "https://static01.nyt.com/images/2019/10/15/opinion/15Anderson/15Anderson-facebookJumbo.jpg", "published_at": "2019-10-15"}