{"pub": "reuters", "url": "https://reuters.com/article/us-israel-politics-scenarios/israels-netanyahu-down-but-not-out-after-failing-to-form-government-idUSKBN1X11WM", "downloaded_at": "2019-10-22 16:05:18.605122+00:00", "title": "Israel's Netanyahu down but not out after failing to form government", "language": "en", "text": "JERUSALEM (Reuters) - For the first time in a decade, someone other than Benjamin Netanyahu will be asked to form a government in Israel.\n\nIsraeli Prime Minister Benjamin Netanyahu speaks during a memorial ceremony held at the supreme court honouring former Supreme Court president Meir Shamgar who died on Saturday in Jerusalem October 22, 2019. REUTERS/Ronen Zvulun\n\nThe 70-year-old prime minister has called two elections this year, has twice been given the chance by the president to put together a ruling coalition, and has twice failed.\n\nThe fact that President Reuven Rivlin will now turn to someone else leaves Netanyahu even more vulnerable in his fight for political survival.\n\nBut although he has failed, the man now set to try his hand, centrist general-turned-politician Benny Gantz, also has no clear path to success.\n\nHere are some of the possible scenarios, including even a third parliamentary election in less than a year, following two inconclusive elections in April and September.\n\nWHY IS ISRAELI POLITICS IN DEADLOCK?\n\nShortly after the Sept. 17 election ended in stalemate, Rivlin gave Netanyahu 28 days to put together a governing coalition.\n\nDuring that period, which expires on Wednesday, Israel’s longest-serving prime minister persuaded only 55 of parliament’s 120 members, including his traditional far-right and ultra-Orthodox Jewish allies, to join his right-wing Likud Party in a government.\n\nHaving fallen six seats short of a ruling majority, Netanyahu “returned” his mandate to the president on Tuesday, and a spokesman for Rivlin said Gantz would now get his chance.\n\nOne way out of the stalemate would be for the two largest parties, Likud and Gantz’s new Blue and White party, to form a “national unity” government.\n\nEarly talks centered on the possibility of a rotating premiership but led nowhere. Gantz, a former armed forces chief, refused to join a government led by Netanyahu, citing looming indictments against the prime minister in three corruption cases in which Netanyahu has denied any wrongdoing.\n\nGantz also said he wants a “liberal” government, shorthand for one that does not include Netanyahu’s religious partners.\n\nHAS THIS HAPPENED BEFORE?\n\nThe last time anyone other than Netanyahu was asked to form a government in Israel was in 2008 when Tzipi Livni, of the now-defunct Kadima party, was given the chance and failed.\n\nThat led to an election in 2009 which was won by Netanyahu. Livni never returned to front-line politics, a precedent that is not lost on Netanyahu.\n\nWHAT HAPPENS NEXT?\n\nAfter receiving the formal nomination from Rivlin, on Wednesday or Thursday, Gantz will have 28 days to build a coalition. As things stand now, he has the endorsement of 54 lawmakers, seven short of a parliamentary majority.\n\nBut 10 of the those 54 legislators belong to a four-party Arab alliance. No party drawn from Israel’s 21% Arab minority has ever been invited to join an Israeli government or has sought to serve in one.\n\nWithout a deal with Netanyahu, Gantz could seek to form a minority government, with Arab lawmakers’ backing from the sidelines. But that is a big political risk in a country where Arab citizens’ loyalty has been hotly debated.\n\nArab lawmakers would be likely to face criticism from within their own community for propping up an Israeli government’s policies toward what many regard as their fellow Palestinians in the West Bank and Gaza.\n\nAND IF GANTZ ALSO COMES UP SHORT?\n\nA three-week period would ensue in which 61 lawmakers can ask the president to assign the coalition-building task to any legislator — Netanyahu, Gantz or another. If no such request is made in that time, parliament dissolves itself and an election is called — political pundits say March 17 is a possible date.\n\nThat could give Netanyahu another chance at the ballot box, barring a Likud rebellion against him.\n\nWHAT ABOUT NETANYAHU’S LEGAL TROUBLES?\n\nThe deck could be reshuffled once Attorney-General Avichai Mandelblit announces whether he will follow through with his plan to indict Netanyahu in three graft investigations. His final decision is widely expected by the end of the year.\n\nNetanyahu faces no legal requirement to leave government if indicted, but criminal charges against him - and their degree of severity - could further weaken him politically.\n\nNetanyahu could face fraud and breach of trust charges in all three cases, and bribery charges in one.\n\nARE THERE ANY WILDCARDS?\n\nAvigdor Lieberman, a former Netanyahu ally and ex-defense minister, heads the ultranationalist Yisrael Beitenu which won eight parliamentary seats in last month’s election. He has remained on the fence so far, citing policy differences with Likud’s ultra-Orthodox backers and Blue and White’s left-wing allies.\n\nHe effectively prevented Netanyahu from building a ruling coalition after this year’s first election, boosted his standing in the second and could be a kingmaker in the third.", "description": "For the first time in a decade, someone other than Benjamin Netanyahu will be asked to form a government in Israel.", "authors": ["Jeffrey Heller", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191022&t=2&i=1443780099&w=1200&r=LYNXMPEF9L1D9", "published_at": "2019-10-22"}