{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7559659/Kim-Kardashian-flies-home-private-jet-praising-Greta-Thunberg.html", "downloaded_at": "2019-10-10 19:03:25.238503+00:00", "title": "Kim Kardashian flies home on private jet after praising Greta Thunberg", "language": "en", "text": "She has spoken warmly of climate activist Greta Thunberg, saying she would love to have dinner with the teen.\n\nBut while Kim Kardashian might be impressed by Greta's obviously heartfelt concern for the environment, it clearly isn't curtailing her own use of private jets.\n\nThe reality star shared videos of her extravagant ride home from Armenia to Instagram Stories on Thursday, her glee obvious as she showed fans around the 'amazing plane'.\n\n'Knocked out': Kim Kardashian snoozes in her bed alongside son Saint as she flies home on luxury private jet after praising teen climate activist Greta Thunberg\n\n'Amazing experience': Kim tagged private jet provider Jetex in her social media post\n\nEvery little luxury: Kim shared a view of the robes and towels in her bedroom\n\n'We had an amazing trip,' she told fans, as she stepped aboard the large jet and was met by smartly uniformed flight crew.\n\n'This is an amazing plane,' she continued, panning past huge spacious seats, to head into a large private bedroom.\n\nKim then showed fans the fresh white linen robes hanging beside a pile of inviting towels, outside her private bathroom.\n\nNo expense spared: Kim tagged Dubai-based aircraft management and charter company Jetex, which specialises in luxury private jets\n\nSettle in: The plane's seating area is designed with comfort in mind\n\nFirst class: Kim gave her fans a tour of the aircraft\n\n'This is where I'll be sleeping on the plane tonight,' she said, later sharing a picture of herself sleeping in the bed beside Kim's son Saint. She captioned the shot 'knocked out'.\n\n'Thank you Jetex or the amazing experience,' Kim captioned her pictures, tagging the Dubai-based aircraft management and charter company, which specialises in luxury private jets.\n\nThunberg told world leaders at the opening of a United Nations conference last month that they had stolen her childhood with 'empty words.'\n\nInviting: The bedroom looked worthy of a five star hotel\n\nGiving the tour: Smartly dressed flight attendants showed Kim around\n\nRoom to spare: The large space offered a wide screen television\n\nBuilt for comfort: The spacious jet was carefully designed with luxury in mind\n\nIn contrast to Kim's use of private jets, Greta spent two weeks sailing across the Atlantic from England to New York for the UN conference. The schoolgirl deliberately avoids airplanes, one of the worst causes of carbon emissions.\n\nBut while she isn't the most obvious environmentalist, Kim has admitted to being a big supporter of the 'brave and amazing' activist.\n\nImpressed: While still in Armenia Kim told Reuters she was a big supporter of the 'brave and amazing' activist Great Thunberg\n\nImpressed: Kim said Greta, seen here addressing the Climate Action Summit in the United Nations General Assembly last week, was 'brave'\n\nAlong with claiming she'd love to have dinner with the Swedish 16-year-old, while still in Armenia Kim told Reuters she herself did what she could to save the environment - from recycling to buying compostable garbage bags and using glass containers in her pantry.\n\n'Absolutely, I would [love] my children, I would love everyone to meet her,' Kim said.\n\n'I think she's such a brave and strong young woman that has really stood up for what she believes in,' said the 38-year-old.\n\n'[Thunberg] is such an amazing young girl, and so brave and courageous to stand up to these grown-ups that can be very scary and for her to be so open and honest is exactly what we need.'\n\nUnlikely environmentalist: Despite her love for private jets, Kim claims to do her bit to stop climate change, including recycling and choosing compostable trash bags\n\nMaking changes: Kim said she was raising her four children to care about the world\n\n'Climate change is a serious problem,' said Kardashian, who was attending the World Congress on Information Technology (WCIT) in the Armenian capital Yerevan.\n\nKim said she was raising her four children to care about the world around them.\n\n'My kids are extremely cautious. We took out all the plastic in our home, and we make specific decisions that are based on the environment. Just even to teach them, like, why are all of the plastic containers in our home and our pantry gone and its now all glass. And how do we recycle.'\n\nShe said she also wanted to talk to Thunberg's parents to understand how they support the teen, and how they have helped Greta navigate social media.\n\n'I would really love to speak to her parents and to see how they've encouraged her. Did she always have that in her?'\n\n'Speaking on a big platform invites a lot of different opinions and personalities and how they [Greta's parents] manage that.'\n\nEnvironmentalists: Kim's sister Khloe was pictured on a beach cleanup in Malibu Wednesday\n\nHelping out: Kendall joined Khloe on the Heal The Bay cleanup jaunt\n\nKim said that all members of her family were very cautious about the environment and she defended other famous people like Britain's Prince Harry and his wife Meghan, who have been criticized for using private jets.\n\nThey were 'very passionate about decisions that change the world,' Kardashian said of the royal couple.\n\n'I still love and value the fact that they bring such attention to such important movements that need to happen and they are really passionate about, because they are still changing the world,' she said.\n\nPrivate jets: Greta would surely not approve of Kim's love of private jets; here the reality star flies with her children in March of this year\n\nConsumer: Kim and daughter North are seen on a private jet, surrounded by the trappings of their consumer-focused celebrity lifestyle, in July\n\nIs that an ad? Kim even promoted a private plane charter company back in 2017\n\nMother-of-three Kim regularly takes private jets when she travels for both work and pleasure - once even infamously taking over an entire private Boeing 747 for a 'long flight' with husband Kanye West and a handful of his employees", "description": "She has spoken warmly of climate activist Greta Thunberg, saying she would love to have dinner with the teen.", "authors": ["Dailymail.Com Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/19/19552656-0-image-a-9_1570730856588.jpg", "published_at": "2019-10-10"}