{"pub": "metro", "url": "https://metro.co.uk/2019/10/09/rihannas-new-album-r9-will-reggae-inspired-reggae-always-feels-right-10890229", "downloaded_at": "2019-10-09 18:31:22.471586+00:00", "title": "Rihanna's new album R9 will be reggae-inspired", "language": "en", "text": "RiRi’s not giving anything away (Picture: Getty)\n\nRihanna has revealed that her new album will be reggae-inspired, admitting that the genre ‘always feels right’ to her.\n\nThe star has been teasing her new album for months and seemingly releasing everything under the sun except for new music as she takes over the makeup and clothing industries.\n\nNot that we’re mad about it.\n\nHowever, she has revealed some little details about her ninth studio album and we’re already obsessed.\n\n‘I like to look at it as a reggae-inspired or reggae-infused album,’ she explained to Vogue. ‘It’s not gonna be typical of what you know as reggae. But you’re going to feel the elements in all of the tracks.’\n\nThe 31-year-old went on to say: ‘Reggae always feels right to me. It’s in my blood. It doesn’t matter how far or long removed I am from that culture, or my environment that I grew up in; it never leaves.\n\nAdvertisement\n\nAdvertisement\n\n‘It’s always the same high. Even though I’ve explored other genres of music, it was time to go back to something that I haven’t really homed in on completely for a body of work.’\n\nHowever, she’s keeping tight-lipped about the new project as she refused to confirm a release date.\n\nWe can but dream, right?\n\nShe’s not giving too much away about R9 (Picture: WireImage)\n\nAlthough RiRi has had R9 in the making for years, she’s taking her time with it as she confirmed back in September that no new music is dropping just yet.\n\nAsked when she will release an album, she said: ‘Whatever I do is gonna be confident whether it’s the album, perfume, lingerie, make-up, or fashion. Y’all gonna have to wait. Navy, I’m so sorry.’\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nWe’ll just be over here sobbing.\n\nHowever, she definitely hasn’t forgotten about it as she dismissed suggestions about performing at the Super Bowl.\n\nShe told Entertainment Tonight: ‘I still got an album to finish. You gonna ask me about Super Bowl? My fans about to have my neck.’\n\nAdvertisement\n\nAdvertisement\n\nMeanwhile, she’s keeping herself busy after she announced a new ‘visual autobiography’, revealing she’s been spending the past half-decade working on it.\n\nWe won’t blame her if we don’t get new music right away then – she’s a busy lady to say the least.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Rihanna takes us behind the scenes at carnival and reminds us what she was like recording new music\n\nMORE: Aaron Carter’s tattoo artist stopped him from getting Rihanna inking in the middle of his face", "description": "Rihanna's new album R9 will be reggae-inspired as she teas", "authors": ["Louise Griffin"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1174331344_1570635634.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-09"}