{"pub": "reuters", "url": "https://reuters.com/article/us-britain-eu-mcdonnell/uk-labour-party-seeking-compromise-timetable-for-brexit-law-mcdonnell-idUSKBN1X31QQ", "downloaded_at": "2019-10-24 14:15:41.182692+00:00", "title": "UK Labour Party seeking compromise timetable for Brexit law: McDonnell", "language": "en", "text": "FILE PHOTO: Britain's Labour Party's shadow chancellor John McDonnell talks with a journalist outside Westminster as parliament discusses Brexit, sitting on a Saturday for the first time since the 1982 Falklands War, in London, Britain, October 19, 2019. REUTERS/Tom Nicholson/File Photo\n\nLONDON (Reuters) - Britain’s opposition Labour Party is focused on finding a compromise timetable to consider Prime Minister Boris Johnson’s Brexit deal in parliament, but remains opposed to the divorce agreement, finance policy chief John McDonnell said on Thursday.\n\n“We’re in the process at the moment of trying to see whether or not this compromise we’ve offered to Boris Johnson will enable him to bring forward a proper program motion (timetable),” McDonnell told reporters.\n\nParliament rejected Johnson’s attempt on Tuesday to fast track the legislation before an Oct. 31 exit deadline, with opponents saying it needed more scrutiny than the government had offered.\n\nThat leaves Johnson with the choice of agreeing a longer timetable that would mean missing his Oct. 31 deadline but could see Brexit delivered this year, or pushing for an early general election that would mean a longer delay to Brexit but could give him the outright majority in parliament he currently lacks.\n\nMcDonnell, Labour leader Jeremy Corbyn’s most senior ally, said the party was offering a timetable only “days” longer than the one Johnson proposed.\n\n“It isn’t a matter of weeks, it is a matter of days,” he said.\n\nHowever, he reiterated that Labour would not support the deal as it currently stands and, if parliament resumed the process of passing the law needed to implement it, they would seek to make its passage conditional on a second referendum.\n\n“We’re being accused all the time of trying to prevent the Brexit process happening. We’re not, we’re just saying we want a proper process,” he said.\n\n“That must include the ability to put amendments up and that must include the ability to put an amendment up that enables it to go back to the people.”", "description": "Britain's opposition Labour Party is focused on finding a compromise timetable to consider Prime Minister Boris Johnson's Brexit deal in parliament, but remains opposed to the divorce agreement, finance policy chief John McDonnell said on Thursday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191024&t=2&i=1444506998&w=1200&r=LYNXMPEF9N162", "published_at": "2019-10-24"}