{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/woman-lost-hand-toes-five-20703648", "downloaded_at": "2019-10-23 09:45:31.664785+00:00", "title": "Woman lost hand, toes and five fingers after 'bug' turned out to be meningitis", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA teaching assistant lost a hand, toes and five fingers after contracting bacterial meningitis after first thinking it was a sickness bug.\n\nMum-of-two Jo Arnold now uses a prosthetic hand after her life changed forever.\n\nThe 49-year-old, from Stratford-upon-Avon, Warwickshire, says she can't even perform simple tasks at home after contracting the killer disase.\n\nShe even had to relearn how to walk and talk again but has decided to speak out to raise awareness about the vulnerability of healthy adults - and not just children - to developing meningitis.\n\nShe said: \"It totally turned my life upside down.\n\n(Image: Caters News)\n\n(Image: Caters News)\n\n\"The actual reality of what's happened doesn't hit home until you leave hospital.\n\n\"I came home and was reminded of my life now and my life before. I couldn't do anything for myself anymore.\n\n\"It's been hard work, I've had to completely rebuild my life and relearn how to do things in a different way. I had to relearn how to walk and talk again.\n\n\"Going shopping, packing things up from shelves became a trial. I have to think about every single thing I do.\n\n(Image: Caters News)\n\n\"The hardest thing was coming out of hospital and not being able to help my children.\"\n\nJo's illness began after she developed what she thought was a sickness bug.\n\nShe said: \"I went to school like any other day, I started to get a headache and by break time it was really bad.\n\n\"I stayed for the day, went to bed and then I woke up in the early hours of Tuesday morning and had sickness and diarrhoea. I phoned a colleague who said one of the children had had a sickness bug so I thought I'd got it.\n\n(Image: Caters News)\n\n\"I still had it the following day and asked my mum to take the kids to school.\n\n\"Katie wouldn't go to school because she was worried about me. The sickness and diarrhoea continued, then stiffness and photophobia. I thought these were possible signs of meningitis.\"\n\nJo was rushed to hospital by paramedics after her mother Josephine thought she was deteriorating and was placed in an induced coma.\n\n(Image: Caters News)\n\n\n\nFive years on she says she wished she knew more about the disease when she was struck down\n\nShe said: \"I'm lucky to have survived. People associate meningitis with children but it's adults too. I was aware of the symptoms for children but not for me.\n\n\"It could be you that has meningitis as an adult, when I was lying in hospital I never thought I'd get it.\"", "description": "The deadly disease started off 'like a sickness bug' but Jo Arnold, 49, had to learn how to talk and walk again", "authors": ["James Somper", "Sam Elliott", "Image", "Caters News"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20703863.ece/ALTERNATES/s1200/1_PAY-MENINGITIS-HAND-LOSS.jpg", "published_at": "2019-10-23"}