{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/09/04/julian-castro-explains-how-he-would-use-executive-action-to-address-climate-change-and-its-a-doozy-n2552622", "downloaded_at": "2019-09-04 23:48:15.070963+00:00", "published_at": "2019-09-04", "title": "Julian Castro Explains How He Would Use Executive Action To Address Climate Change – And It's A Doozy", "language": "en", "text": "One of the things 2020 Democrats have repeatedly talked about is their desire to use executive action to accomplish their legislative goals. In particular, Sen. Kamala Harris (D-CA) and former Housing and Urban Development (HUD) Secretary Julian Castro have both said they would use executive action to deal with gun violence in America. But apparently that's not the only thing Castro would use executive action for. During Wednesday night's CNN town hall on climate change, he talked about how his first executive order would be to rejoin the Paris Climate Accord.\n\n\"What would your first step be in dealing with this crisis?\" CNN host Wolf Blitzer asked Castro.\n\n\"So, I believe that on the afternoon of January 20, 2021 at 12:01 p.m. that we're going to have a Democratic president, a Democratic House and a Democratic Senate,\" Castro explained. \"My first executive order that afternoon will be to rejoin the Paris Climate Accord so that we lead again on sustainability, but it's actually what comes next after that that is the most important: a series of other executive actions and legislation.\"\n\nAccording to Castro, on Tuesday he released a plan called \"People First, Planet First.\"\n\n\"We would make investments to make the United States to net zero by 2045. We would incentivize wind energy production, solar energy production, invest in renewables. We would challenge the rest of the world, at the latest, to get to net zero by 2050,\" he explained. \"We would institute a carbon pollution fee to help make the investments that we need to make. We would also take executive orders. For instance, prohibiting fossil fuels exploration, permitting of it, and extraction on federal lands.\"\n\n“My first executive order… will be to rejoin the Paris climate accord,” says Julián Castro on how he would address the climate crisis if elected president. “We would incentivize wind energy production, solar energy production, invest in renewables.\" #ClimateTownHall pic.twitter.com/V37MQDPhcv — CNN (@CNN) September 4, 2019\n\nThe 2020 Democrats have made it very clear that if we don't agree with their agenda that, if elected, they would take executive action to make their vision a reality. We saw it with gun laws and we're seeing it again with their climate change agenda.", "description": "Facepalm..10/02/2019 13:06:04PM EST.", "authors": ["Beth Baumann", "Katie Pavlich", "Cortney O'Brien", "Julio Rosas", "Guy Benson", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/247/63b18e9c-7178-4a22-95ea-50352029685f.png"}