{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/man-utd-star-jesse-lingards-20744841", "downloaded_at": "2019-10-28 23:32:27.488602+00:00", "title": "Man Utd star Jesse Lingard's clothing brand loses £200,000 in its first year", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJesse Lingard's clothing brand JLingz lost more than £200,000 in its first year.\n\nManchester United and England star Lingard launched the brand in the summer of 2018, with the help of Marcus Rashford, Paul Pogba and Raheem Sterling.\n\nJLingz, has a logo based on the midfielder's goal celebration, and sells a range of clothes and accessories from t-shirts to hats.\n\nThe first set of accounts for the company, of which Lingard is one of three directors, had a loss of £211,688, due to the amount it owes creditors.\n\n(Image: JLingz)\n\nThe Manchester Evening News reports the business had only been selling products for the second half of the year the accounts relate to, up to January this year.\n\n(Image: Eamonn and James Clarke/PA Images)\n\nIt was reported earlier this year that boss Ole Gunnar Solskjaer had warned Lingard and teammate Rashford to focus on football - rather than fashion.\n\nLast season, Gary Neville criticised Lingard for launching a line of clothing ahead of the defeat to Liverpool at Anfield.\n\n\"I've got no problem with him launching a clothes range to be honest with you, but before Liverpool away, the biggest match of the season, don't launch a clothes brand,\" Neville said on Sky Sports.\n\n(Image: EMPICS Sport)\n\n\"Not this week. Do it before Fulham , do it before Fulham. I'm not having a go at him for his character because players should obviously have other careers, they should do other things, but I just saw that little thing this week and I thought, 'not this week. Not this week. It's Liverpool.'\n\n\"Concentrate on Liverpool, no distractions, no disruptions.\"\n\nThe 26-year-old came on as a substitute in the victory over Norwich on Sunday, which saw United climb to seventh in the Premier League.\n\nMirror Sport has contacted representatives of the company for comment.", "description": "Manchester United and England star Jesse Lingard launched clothing brand JLingz in the summer of 2018", "authors": ["Liam Prenderville", "Image", "Jlingz", "Eamonn", "James Clarke Pa Images", "Empics Sport"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20744849.ece/ALTERNATES/s1200/0_Manchester-United-star-Jesse-Lingards-JLingz-clothing-range-loses-over-£200000-in-its-first-year.jpg", "published_at": "2019-10-28"}