{"pub": "afr", "url": "https://afr.com/companies/financial-services/graham-tuckwell-savages-pe-lawsuit-as-extortion-20191021-p532td", "downloaded_at": "2019-10-22 13:32:43.335798+00:00", "title": "Graham Tuckwell savages PE lawsuit as 'extortion'", "language": "en", "text": "After spending the last decade in Jersey and London, Mr Tuckwell and his wife Louise returned to Australia this month. The Tuckwell's donated $50 million to the Australian National University in 2013 and followed it up with another $100 million donation in 2016.\n\nThese guys are just throwing mud and hoping some will stick. — Graham Tuckwell, ETFS Securities founder\n\nThe shareholders who are a party to the action include investors SIG Growth Equity Fund, FTV Capital and Millennium Technology Partners. They say he is investing the proceeds in areas where he has no expertise, want him to wind up the company and disperse the proceeds equally.\n\n“They are not entitled to it, it’s as simple as that, if they were entitled, I would offer to pay them. They negotiated badly,” Mr Tuckwell said.\n\n'It's just nonsense'\n\nThe funds claim they invested on the understanding ETFS would be taken public or sold in a trade sale that would deliver a billion-dollar-plus payday. Mr Tuckwell says investors exchanged preference shares for ordinary shares and lost their rights to be bought out at a premium.\n\n“It was one or the other, you can’t have both,” Mr Tuckwell said. “These guys are just throwing mud and hoping some will stick, it’s just nonsense and an abuse of the court process.”\n\nIn the years since the transaction, Mr Tuckwell has acquired a series of businesses adjacent to the ETF sector including an index manufacturer and an online industry publication.\n\nAdvertisement\n\nLast year he launched a battery technology themed ETF with the ASX code ACDC in a nod to the famous hard rock band.\n\nETFS Securities' private equity backers also allege he tried to claim a $6.5 million finder’s fee after selling the assets and attempted to railroad the board into paying him $19 million in shares.\n\nThe firm did not hire bankers to complete the series of trade sales and Mr Tuckwell says the executives running the process were entitled to a share in the spoils.\n\n“We worked out that I personally added around $150 million to the value of the sale process.”\n\nMr Tuckwell said he doesn’t need the money and is defending the allegations as a matter of principle.\n\nHe said all of this could have been prevented if a sensible proposition was put to him, and noted that minority shareholdings always attracted a discount.\n\n\"This is a bad day for PE firms because it exposes weakness in their business model. They argue they try to create value and what you have here is a few firms trying to destroy a company by winding it up for their own benefit.\"\n\nLess than two months ago the gold ETF started by Mr Tuckwell soared through the $1 billion mark as investors sought the relative safety of the precious metal amid a bout of market volatility.\n\nMr Tuckwell’s personal wealth was estimated at $575 million by the Financial Review Rich List in June.", "description": "The Rich Lister says he doesn't need the money but has vowed to fight in court against claims he used ETFS Securities as a personal piggybank.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3878%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_613%2C$y_114/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/52c8294955ebdfaade602ab676b37380fdeffc48", "published_at": "2019-10-21"}