{"pub": "atlantic", "url": "https://theatlantic.com/science/archive/2019/09/noaa-trump-hurricane-dorian-alabama/597628", "downloaded_at": "2019-09-07 02:11:53.230766+00:00", "title": "NOAA Politicized the Weather Report", "language": "en", "text": "Read: Hurricane Dorian is not a freak storm\n\nBut as my colleague David Graham has written, Trump has spent the last five days bizarrely explaining why he was correct to warn its residents. On Thursday, he presented a National Hurricane Center map that was obviously doctored by Sharpie to journalists in the Oval Office.\n\nYet NOAA has now sided with the president. “From Wednesday, August 28, through Monday, September 2, the information provided by NOAA and the National Hurricane Center to President Trump and the wider public demonstrated that tropical-storm-force winds from Hurricane Dorian could impact Alabama,” its statement said. “The Birmingham National Weather Service’s Sunday morning tweet spoke in absolute terms that were inconsistent with probabilities from the best forecast products available at the time.”\n\nThis statement is extremely closely written. And NOAA leadership did find a single forecast tool that indicated a small part of southeastern Alabama faced a 5 to 10 percent chance of experiencing 40 mile per hour winds.\n\nYet this is beside the point, because Alabama never actually experienced those winds. In the course of this week, winds in Alaga, Alabama—a town in the state’s southeastern-most corner—never exceeded 9 miles per hour, according to the weather-almanac database Dark Sky.\n\nPhotos: The wreckage left by Hurricane Dorian\n\nAnd if NOAA is in a mood to nitpick: President Trump’s statements disagreed far more with “probabilities from the best forecast products available” than the Birmingham office’s did. At no point was Alabama “most likely [to] be hit (much) harder than anticipated.” And this is not even the most egregious example. “They actually gave that a 95 percent chance probability. It turned out that that was not what happened,” Trump said on Thursday. The National Weather Service never forecast that Dorian had a 95 percent chance of hitting Alabama.\n\nI have ignored this story for the last few days, figuring that the president’s bizarre behavior should not distract from the U.S. government’s overall skilled preparation and handling of a historically dangerous hurricane. But this statement has turned what has become a routine type of political story (the President has said something misleading!) into one that’s slightly more Soviet—and much more worrying. Americans have gotten used to living in a country where partisanship is unavoidable. But living in a country where weather report is sometimes partisan and untrustworthy—that’s something new.\n\nWe want to hear what you think about this article. Submit a letter to the editor or write to letters@theatlantic.com.", "description": "The scientific agency sided with the president’s inaccurate forecast over the work of its professional staff.", "authors": ["Robinson Meyer"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTS2P6C8/facebook.jpg?1567820659", "published_at": "2019-09-07"}