{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/trump-syria-decision-who-is-involved-kurds-turkey-2019-10", "downloaded_at": "2019-10-08 05:14:15.688708+00:00", "title": "Here are the 5 major players that will feel the impact from Trump's decision to withdraw troops from Syria", "language": "en", "text": "Syrian Democratic Forces, led by the Kurds\n\nSyrian Democratic Forces (SDF) fighters sit on a vehicle in the north of Raqqa city, Syria. Thomson Reuters\n\nThe Syrian Democratic Forces, also known as the SFD, are the United States' main allies in the region and have been fending off Islamic State militants for years.\n\nThe partnership began in 2014, after ISIS militants surrounded the Kurdish town of Kobani in northern Syria, which lies along the Turkish border. Seeking to prevent the attack, the US began arming and training secular Syrian Kurdish militia while providing aerial support, which proved to be a successful strategy.\n\nThe group at the time called itself the YPG and was tied to the Kurdistan Workers Party, the PKK, which have long fought an armed conflict for Kurdish independence against Turkey. The party has been listed as a terrorist organization by NATO, the US, UK, Japan, and the EU, and Turkey has expressed concern for the US decision to arm a longstanding enemy.\n\nAt the suggestion of the US, the YPG rebranded itself as the Syrian Democratic Forces (SDF), teaming up with other Arab and minority militias in the region. The SDF, led by Kurdish forces, now controls a sizeable swath of land in northeastern Syria.\n\nIt says it lost more than 10,000 of its own fighters over the course of the conflict. It currently has roughly 60,000 members in the northeast.\n\nThe group has fought alongside the US for several years in the fight against Islamic extremism in the region. It now says it feels betrayed by Trump's decision to withdraw its troops.\n\n\"This military operation in northeast Syria will have a great negative effect on our war against the ISIS organization and will destroy all that has been achieved in terms of stability over the past years,\" the group said in a statement, according to The New York Times.\n\nThe group added that it would \"not hesitate for one instant to defend ourselves,\" against what it called \"Turkish aggression\" on its homeland.\n\nMustafa Bali, a spokesman for the SDF, wrote on Twitter on Monday that Trump's decision would \"ruin the trust and cooperation\" built between the group and US troops.\n\n\"#SDF is committed to the security mechanism framework and has been taking necessary steps to preserve stability in the region,\" he wrote. \"However we will not hesitate to turn any unprovoked attack by Turkey into an all-out war on the entire border to DEFEND ourselves and our people.\"\n\nWhat lies ahead for the SDF remains unclear, as the rest of Syria is controlled by either hostile Syrian government forces, other opposition groups, or Turkish forces. Last month, a UN committee tasked with rewriting the Syrian constitution excluded meaningful input from Kurdish forces.\n\nAnd while the US has supported the movement militarily, it has avoided supporting the group politically in order to quell tension with Turkey.", "description": "Observers say Trump's move to withdraw US troops could put the US' Kurdish allies in jeopardy and pave the way for a major Turkish assault.", "authors": ["Rosie Perper"], "top_image": "https://image.businessinsider.com/5c39007bbd77301e15260c66?width=1200&format=jpeg", "published_at": "2019-10-08"}