{"pub": "atlantic", "url": "https://theatlantic.com/international/archive/2019/10/turkey-kurds-syria-trump/600388", "downloaded_at": "2019-10-21 09:46:41.133614+00:00", "title": "America Can Still Fight ISIS in Syria", "language": "en", "text": "The number one U.S. priority in Syria is to maintain the detention facilities and encampments and keep pressure on ISIS. This will be difficult given the Turkish assault, as well as the deal the SDF has struck with the Syrian regime in the wake of the U.S. withdrawal announcement. There is only so much America can do with no troop presence as other powers rush in to fill the void.\n\nJoseph Votel and Elizabeth Dent: The danger of abandoning our partners\n\nIndeed, Turkish President Recep Tayyip Erdogan is set to meet with Russian President Vladimir Putin in the coming days, likely further solidifying their own spheres of influence in Syria, without the United States. For the part it can control, the U.S.-led coalition should work with Turkey, Jordan, and Iraq to reinforce their borders and ensure no escaped ISIS fighters or family members are able to cross. With the small presence remaining at Syria’s At Tanf Garrison as well as other bases in the region, the U.S. can still use its intelligence assets along the Iraq-Syria, Jordan-Syria, and Turkey-Syria borders to monitor ISIS movements. The U.S. will also need to maintain its battlefield communications channel with Russia, the Syrian government’s ally, to ensure that, when necessary, it has the ability to strike ISIS or extremist targets from Syrian airspace.\n\nPresident Donald Trump has made clear that Turkey and other countries now bear the responsibility for the detention of ISIS fighters, but with the regime likely coming into the greater northeast at large—not just towns affected by the offensive—it is probable that a mixture of SDF and regime security forces will continue the security of camps and prison facilities. Both will need to keep dangerous ISIS fighters off the battlefield, as well as work to facilitate aid access into encampments—something that will remain difficult as many aid groups are often unwilling to enter regime territory.\n\nIt’s still unclear what sort of punishment the Assad regime will impose upon the SDF for partnering with the U.S., and whether any such repercussions will affect the SDF’s ability to maintain the camps and detention facilities and continue pressuring ISIS. Syria’s Bashar al-Assad has reportedly been known to release jihadists to stir chaos when his regime wants to have reason to clamp down on unrest. We also know from our 2003-2011 experience, when extremist forces crossed into Syria from Iraq and set up what ultimately became ISIS, that the regime often turns a blind eye to foreign fighters operating in its territory. To ensure the success of the SDF and whatever elements of the regime end up managing this problem, the U.S.-led coalition against ISIS may need to open a limited window of rapprochement with the Syrian regime or the Russians, who will surely use the detention issue as leverage against the West.", "description": "But it will be a lot more difficult than it was two weeks ago.", "authors": ["Joseph Votel", "Elizabeth Dent"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/RTS2RINK/facebook.jpg?1571603962", "published_at": "2019-10-21"}