{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/main-pillars-revised-brexit-deal-191017111245923.html", "downloaded_at": "2019-10-17 11:59:28.227969+00:00", "title": "The main pillars of the revised Brexit deal", "language": "en", "text": "London, UK - Boris Johnson’s deal with Brussels addresses four key sticking points that have so far obstructed a Brexit agreement.\n\nThe deal, announced on Thursday, is unlikely to be accepted by the Democratic Unionist Party (DUP) which Johnson's government is relying on for support in Parliament.\n\nA re-packaged backstop\n\nThe sticking point over two years of failed efforts to secure a Brexit deal has been Conservative Party's opposition to the controversial \"backstop\" - a solution negotiated between former prime minister Theresa May and the EU to solve issues around the Irish border after UK's exit from the EU.\n\nThis would have continued UK's membership of the EU customs union in an effort to avoid the creation of a “hard” border that would have created infrastructure to ensure customs checks between Northern Ireland and the Republic of Ireland.\n\nThe DUP was furiously opposed to any backstop arrangements that would treat the status of Northern Ireland differently to mainland \"Great Britain\", fearing this to be the thin end of the wedge ultimately leading to Irish reunification.\n\n191017102131992\n\nAt the same time, hardline Brexiter Conservative MPs who supported the DUP’s position were not in favour of the backstop because there was no mechanism by which it could be brought to an end, implying the UK’s permanent membership of an EU customs union after Brexit.\n\nWithout a backstop, the creation of border infrastructure would violate the terms of the Good Friday peace agreement – a treaty between the UK and Ireland to end decades of paramilitary conflict in the region that stipulates there will be no return to a hard border of any kind.\n\nDespite Johnson’s insistence that he would not capitulate to EU demands for some form of deal by which Northern Ireland diverges from the rest of the UK, this is in effect what he has done.\n\nIt is not the backstop as originally envisaged, but under the new deal now agreed by Brussels, Northern Ireland will be treated differently from mainland Great Britain.\n\nThis is a major diplomatic victory for Dublin, which has maintained a consistent position that this is the only way for the UK to avoid a “no deal” Brexit.\n\nCustoms\n\nUnder the agreement, Northern Ireland will officially remain in the UK’s customs territory and will benefit from the independent trade policy that the UK pursues thereafter. However, it will be treated as an entry point into the European single market.\n\nBritish authorities will apply UK tariffs to products from countries outside the EU as long as those goods entering Northern Ireland do not enter the single market, but EU tariffs will apply if those goods do head for the single market.\n\nBoth sides have agreed a mechanism overseen by a joint committee to assess the risk that goods entering Northern Ireland either from other countries outside the EU or from mainland Great Britain will then enter the EU via Ireland.\n\n191017094418680\n\nVAT\n\nAmong other things, negotiations have centred on the need to maintain the consistency on VAT rates in order to maintain the integrity of the EU single market for goods while providing certainty for business.\n\nUnder the new deal, a mechanism has been agreed to ensure consistency on VAT within Northern Ireland, while respecting the UK’s ambitions to diverge in the digital market.\n\nThe role of the Northern Ireland Assembly\n\nA key demand of the DUP has been for the Northern Ireland Assembly in Stormont to have a mechanism by which it can continue to consent to the arrangement after the transition period following Brexit – in effect giving it a veto over the new arrangements.\n\nThe DUP’s anti-Brexit arrangements argued that this would not only put too much power in the hands of pro-British unionists in the assembly, but was unrealistic given that the assembly has not convened for more than two years.\n\nUnder Johnson’s new deal, there will be a consent mechanism that enables the Northern Ireland Assembly to decide by a simple majority if the arrangements stay four years after the end of the Brexit transition period – in effect removing the automatic veto from the DUP.", "description": "Boris Johnson and the EU have released a new withdrawal agreement that addresses four key sticking points.", "authors": ["Gavin O'Toole"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/8/6e7e9475a5ba49248786c135341277c8_18.jpg", "published_at": "2019-10-17"}