{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/x-factor-stars-who-become-20547447", "downloaded_at": "2019-10-12 07:29:41.786994+00:00", "title": "X Factor stars who have become celebrities away from the microphone", "language": "en", "text": "Get the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nMany famous faces began their journey as hopeful singers on The X Factor - which was originally created to give normal people a chance at breaking the music industry.\n\nAs The X Factor: Celebrity starts this weekend - which will see established stars take to the stage in a bid to impress Simon Cowell , Louis Walsh and Nicole Scherzinger - here is a look at household names who used their exposure on the talent show to become actors, presenters and DJs.\n\nStacey Solomon\n\n(Image: Getty Images)\n\nDagenham native Stacey signed up to The X Factor in 2009 with hopes of securing her dream as a hitmaker.\n\nThe beauty placed third in the series under the mentorship of Dannii Minogue with Olly Murrs placing second and Joe McElderry first.\n\nStacey then appeared on I’m A Celebrity.. Get Me Out Of Here where she was no longer a runner-up as she scooped up first place.\n\nAfter her success she went on to be the face of Iceland supermarket which was followed on by her branching into presenting.\n\nThe mother-of-three first began her hosting career alongside big names such as Chris Moyles and Keith Lemon before going back onto a few more reality jobs such as The Jump and The Chase.\n\nNow Stacey is a fan favourite as a panelist on Loose Women and boasts 2.3 million and has her own clothing range at high street retailer Primark.\n\nRylan Clark-Neal\n\n(Image: Getty)\n\nRylan started his X Factor journey in 2012 in the ninth series of the talent show.\n\nThe singer made it to the quarter finals with the publics support but was not such a favourite of judge Gary Barlow who blasted him as “talentless.”\n\nAfter his stint singing Rylan went onto the eleventh series of Celebrity Big Brother in 2013 - which he went on to win with his dazzling personality.\n\nRylan then went on to begin his presenting career on Big Brother spin-off show Big Brother’s Bit on the Side.\n\nAfter being such a hit, he went on to bagging hosting gigs on This Morning, Most Haunted Live and in 2016 he fronted own chat show called Up Late with Rylan.\n\nHe is currently hosting the revamp of Supermarket Sweep and co-hosting Strictly Come Dancing : It Takes Two with Zoe Ball.\n\nMarvin Humes\n\n(Image: PA)\n\nMarvin began his career in the public eye as one fourth of boyband JLS in 2008 on the fifth series of The X Factor.\n\nThe Beat Again hitmakers placed second in the competition behind Alexandra Burke who reigned champion.\n\nMarvin and his bandmates Aston Merrygold, Oritsé Williams and JB Gill went on to have a successful pop career and scooped up a number of awards.\n\nIn 2013 the band split and Marvin went on to explore other career avenues away from singing.\n\nThe same year Marvin became a radio DJ on Capital FM on Friday nights, he then hooked up the role of hosting the top 40 chart show on Sundays which reached over 100 commercial stations in the UK.\n\nThree years later the star was named as the new frontman for the Capital Late Show, which runs Monday-Thursday 10pm-1am and he still presents the show today.\n\nMarvin has also won a few presenting slots with his wife Rochelle on This Morning and the married couple now host their own show The Hit List on BBC One.\n\nRay Quinn\n\n(Image: FameFlynet)\n\nRay Quinn placed second on the singing show in 2006 on the third series behind Leona Lewis.\n\nIt was not Ray first taste of the limelight as prior he had a role on soap Brookside from 2000-2003 as a child actor.\n\nQuinn became a well known name after singing his way to the nations hearts on The X Factor and then showed off his ice-skating skills as a celebrity contestant on Dancing on Ice in 2009.\n\nRay has had a number of roles on stage but his most prominent acting role is as a regular character in Channel 4 soap Hollyoaks.\n\nThe actor and singer portrays Jonny Baxter in the series but his time on the show is set to come to and end later this year.\n\nJake Quickenden\n\n(Image: ITV Picture Publicity)\n\nJake was a contestant on two series of The X Factor - in 2012 and 2014.\n\nHis first attempt to make it to the live shows ended when he did not make it past the judges houses in the ninth series of the talent show.\n\nThe star was more successful when he tried his luck again in the eleventh series but was later booted off in week three.\n\nJake then did a few reality TV stints by signing up for I’m A Celeb in 2014 and placed second.\n\nFour years later he took to the ice on Dancing on Ice and ended up winning.\n\nIn August this year Jake transitioned from reality TV star to soap actor as he secured a role in Hollyoaks as hunky builder Woody.\n\nShayne Ward\n\n(Image: S Meddle/ITV/REX/Shutterstock)\n\nShayne Ward rose to fame as the winner of the second series of The X Factor in 2005.\n\nFollowing his victory on the talent show Shayne went on a successful debut tour and released a number of singles.\n\nHowever, Shayne really came into his own when he managed to bag a part on Coronation Street in 2015.\n\nThe star was initially given a one-year contract to play Aiden Connor.\n\nHe was such a hit with viewers that his contract was extended until 2018.\n\nDuring his time in soap land he won a massive ten awards including an Inside Soap Award for Best Newcomer and British Soap Award for Best Actor.\n\nCasey Johnson\n\n(Image: Rex Features)\n\nCasey Johnson auditioned for the X Factor in 2014 and failed to get through as a solo act and he then became a member of eight-piece band Stereo Kicks. The band split a month later.\n\nIn 2016 he joined another boyband Union J, who formed on The X Factor in 2012, when one of their original line-up left.\n\nHe didn’t last long in the group and stepped away less than a year after.\n\nCasey went on to appear on MTV’s Ex on The Beach and Single AF where he met his Geordie Shore girlfriend Marnie Simpson.\n\nThe couple are soon to be welcoming a baby into the world which has been documented with them both appearing on Geordie OG’s.", "description": "They had hopes to be chart toppers but some X Factor contestants managed to carve a career in the public eye away from the recording studio", "authors": ["Sara-Aisha Kent", "Image", "Getty Images", "Getty", "Pa", "Fameflynet", "Itv Picture Publicity", "S Meddle Itv Rex Shutterstock", "Rex Features"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20548977.ece/ALTERNATES/s1200/2_MAIN-X-Factor.jpg", "published_at": "2019-10-12"}