{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7629191/Elyse-Knowles-shows-inner-gymnast-insane-outdoor-workout-Byron-Bay.html", "downloaded_at": "2019-10-30 10:49:39.123534+00:00", "title": "Elyse Knowles shows off her inner gymnast in an insane outdoor workout in Byron Bay", "language": "en", "text": "Model Elyse Knowles has shown she puts in the hard yards for her gym-honed body.\n\nThe Myer ambassador posted a brutal workout routine at her Byron Bay home on Instagram that showed her utilising some incredible core strength.\n\nThe 27-year-old used a metal frame for a series of exercises from gruelling chin-ups to more gymnastic movements.\n\nDressed in skin-tight exercise shorts and a matching crop top, the model was ready for business on the outside apparatus.\n\nIn one of the exercises she shifted her body above her hands in an upside-down chin up formation that would burn more for even greater results.\n\nElyse first gained attention on The Block back in 2017 with boyfriend Josh Barker and has gone on to be one of Australia's best known models.\n\nNo pain no gain: Elyse Knowles (pictured) puts in a serious upper body and core workout routine near her Byron Bay home\n\nThe couple have since moved to their new home in Byron Bay earlier this year and and have soaked up the celebrity lifestyle.\n\nThe Instagram star has also been keen to show off her unorthodox workout routines against the gorgeous beach backdrop.\n\nElyse recently demonstrated how she incorporates a skateboard into her stretching and aerobic routine.\n\nTaking it to another level: The model shifts her body above her hands in an upside-down chin up formation for even greater burn\n\nIn a series of videos and photos, the model showed fans how they can use the board to lean against while doing leg extensions.\n\nElyse wrote in the caption: 'Summer favourite toy, for a summer bod bod. Link in website to see more of the workout and my hints and tricks to feel your best'.\n\nShe also used the board for push-ups, and held onto it while doing star jumps before diving down onto her arms, still holding the board.", "description": "Elyse Knowles has shown off another unorthodox workout routine on Instagram outside of her Byron Bay home. Using a metal frame she performs some challenging core exercises.", "authors": ["Tom Place For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/06/20362600-0-image-a-2_1572418538549.jpg", "published_at": "2019-10-30"}