{"pub": "breitbart", "url": "https://breitbart.com/news/canada-posts-lower-trade-deficit-in-august-2", "downloaded_at": "2019-10-07 03:38:28.570255+00:00", "title": "Canada posts lower trade deficit in August", "language": "en", "text": "Ottawa (AFP) – Canada’s trade deficit narrowed to Can $955 million (US $718 million) in August, according to government data released Friday, with exports picking up after two months of decline.\n\nThe figure was slightly better than what economists had expected, following an upwardly revised $1.4 billion shortfall the previous month.\n\nCanada’s surplus with its biggest trading partner, the United States, meanwhile, widened from $4.4 billion in July to $4.9 billion in August.\n\n“Canada’s trade balance looked better than at last check, but not by much,” CIBC economist Royce Mendes commented in a research note.\n\n“There’s little reason to believe that the deficit will swing back into surplus anytime soon.”\n\nExports rose 1.8 percent to $50.6 billion on the back of stronger shipments of energy products and aircraft, while imports climbed 1.0 percent to $51.5 billion, mostly on higher gold and crude oil imports, Statistics Canada said.\n\nExports of nuclear fuel and refined petroleum products increased in the month, and more business jets were sold to buyers in the United States.\n\nMetal and non-metallic mineral exports also rose as a result of purchases of higher-priced gold.\n\nThose gains were partially offset by fewer exports of vehicles and auto parts as a result of prolonged assembly plant shutdowns.\n\nImports of gold, meanwhile, reached their highest level in more than two years as Canadian companies stocked up.\n\nThere were also increased imports of crude oil from the United States, Nigeria and Ivory Coast, amid production disruptions at North Atlantic oil platforms that supply refineries in eastern Canada.\n\nImports of consumer goods, however, decreased. Pharmaceutical imports, which hit a record high in July, were down 15.8 percent in August, nearly reversing the gain from the previous month.", "description": "Ottawa (AFP) – Canada’s trade deficit narrowed to Can $955 million (US $718 million) in August, according to government data released Friday,", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/06/99b990_canadian-exports-jumped-on-strong-aircraft-shipments-including-business-640x335.jpg", "published_at": "2019-10-06"}