{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/economy/trumps-trade-deal-with-japan-hits-snag-amid-auto-tariff-fears/2019/09/23/bcb92be0-de36-11e9-be96-6adb81821e90_story.html", "downloaded_at": "2019-09-24 01:05:25.879843+00:00", "title": "Trump’s trade deal with Japan hits snag amid auto tariff fears", "language": "en", "text": "This concern has emerged as the principal substantive issue before a formal pact can be signed, said the people, who weren’t authorized to discuss the private deliberations. Trump had wanted to ink the deal during the U.N. General Assembly session in New York, but that now appears unlikely.\n\nThe finishing touches now are unlikely to be completed in time for Wednesday’s scheduled meeting between Trump and Japanese Prime Minister Shinzo Abe. But the leaders may sign a nonbinding statement, according to Japanese news reports.\n\nThe United States has sought a new trade deal with Japan, the world’s third-largest economy, since Trump withdrew from an earlier pact, the Trans-Pacific Partnership, on his fourth day in office.\n\nThe president criticized that 12-nation Obama administration product as harmful to American manufacturers and promised to negotiate better deals in direct talks with individual trading partners “to promote American industry, protect American workers, and raise American wages.”\n\nBut quitting TPP left American farmers at a disadvantage in Japanese beef and wheat markets compared to Canadian and Australian rivals. Previewing the new deal in remarks to reporters last month at the Group of Seven summit in France, Trump said it was “a very big transaction” that would be “tremendous for the farmers.”\n\nFor more than a year, Trump has threatened to slap tariffs on automobiles imported to the United States from Japan and Europe. He has said that Japan, for example, should make it cheaper for U.S. companies to send cars there, but an agreement has never been reached. Even throughout the recent discussions, Trump has refused publicly to withdraw his threat. He has continued to keep the option alive, saying last month that he could revive the auto tariff idea if he wanted to.\n\nNegotiators have discussed various ways to resolve Japan’s concerns about Trump’s future actions, including having the United States promise not to impose new levies while talks on a broader second trade deal continue. The suggestion of a “sunset clause” that would explicitly terminate the more limited initial accord if the president slapped 25 percent tariffs on imported autos and auto parts would provide Japan greater protection, analysts said.\n\n“It seems like the reality has set in on how tough trade negotiations are in practice,” said Wendy Cutler, who negotiated TPP as a U.S. diplomat and is now vice president of the Asia Society Policy Institute. “Hopefully, the mini deal with Japan is the first step towards a more comprehensive agreement so our farmers and others can secure the full benefits we negotiated with Japan in TPP.”\n\nIf the Japanese demand is accepted by Trump, it would probably set a precedent that would be cited by other trading partners he has threatened with tariffs, such as the European Union.\n\n“It’s a smart move by the Japanese,” said one person who spoke on the condition of anonymity to discuss confidential negotiations.\n\nIn May, the Commerce Department concluded that rising levels of foreign-made cars threatened national security by eroding the capacity of American automakers to invest in cutting-edge research. Trump at the time delayed any tariff response for six months while talks with Japan and the E.U. proceeded.\n\nThe president last month said he had no plans “at this moment” to hit Japan with the controversial import taxes, but added: “It’s something I could do at a later date if I wanted to.”\n\nJapan last year shipped more than $40 billion worth of vehicles to the United States, making it the country’s second-largest source of imports. It ranks sixth as a source of auto parts, with sales to American customers of more than $1.8 billion.\n\nThe deal now being finalized would grant American farmers better access to Japan’s agricultural markets, including for beef and pork, while the United States would lower some tariffs on Japanese industrial goods. Trump told Congress earlier this month that he also intends to reach an “executive agreement” with Japan on digital trade, which would benefit major industries such as financial services.\n\nNegotiators for the two sides continue to iron out unresolved technical details as they prepare formal legal texts in English and Japanese. U.S. Trade Representative Robert E. Lighthizer and Japanese Foreign Minister Toshimitsu Motegi may meet as soon as Monday evening in New York to continue the bargaining.\n\n“We’re sympathetic and understand why governments are trying to find greater ways to ensure they’re not subject to tariffs,” said Myron Brilliant, executive vice president of the U.S. Chamber of Commerce. “How the two sides work it out is up to them.”\n\nLighthizer’s office did not respond to a request for comment. The Japanese Embassy declined to comment.", "description": "The White House has twice insisted the trade deal was complete, but Japanese officials have signaled caution.", "authors": ["David J. Lynch", "Financial Writer Covering Trade"], "top_image": "https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7I3JVQW6HEI6TMMZ6Y4L6LBUB4.jpg", "published_at": "2019-09-23"}