{"pub": "americanconservative", "url": "https://thehill.com/opinion/civil-rights/391439-democrats-do-no-harm-act-makes-attacking-religious-liberty-an-election", "downloaded_at": "2019-10-15 04:25:18.361137+00:00", "title": "Democrats’ 'Do No Harm Act' makes attacking religious liberty an election issue", "language": "en", "text": "The Religious Freedom Restoration Act (RFRA) protects people of faith. Democrats in the House and Senate are pushing the Do Not Harm Act that would strip away the rights of millions of Americans who, because of their faith, are pro-life or support traditional marriage, making this an election issue for 2018.\n\nMore than 100 House Democrats have signed onto H.R. 3222, the misleadingly named \"Do No Harm Act\". A dozen senators — including likely presidential hopefuls Sens. Elizabeth Warren Elizabeth Ann WarrenSanders can gain ground by zeroing in on corruption Biden praises Buttigieg for criticizing GOP attacks: 'That's a good man' Warren enters crucial debate with big momentum MORE (D-Mass.), Kamala Harris Kamala Devi HarrisRepublicans wrestle with impeachment strategy Klobuchar takes shots at health and education plans supported by Sanders and Warren Kamala Harris to Trump Jr.: 'You wouldn't know a joke if one raised you' MORE (D-Calif.), and Bernie Sanders Bernie SandersSanders wishes Ocasio-Cortez happy birthday Video of fake Trump shooting members of media shown at his Miami resort: report Sanders can gain ground by zeroing in on corruption MORE (I-Vt.) —have introduced this measure which would strip away RFRA faith-based rights pertaining to abortion, LGBT issues, and marriage.\n\nADVERTISEMENT\n\nThe First Amendment to the Constitution provides multiple protections for religious freedom. The Free Speech Clause protects the right to express beliefs and opinions, including religious ones. The Free Exercise Clause protects living your life according to the teachings of your faith.\n\nFor two centuries, government burdens on exercising faith were subject to “strict scrutiny,” meaning they were presumed by courts to be unconstitutional and were sustained only if absolutely necessary and carefully tailored to achieve a truly compelling public interest. But in 1990, the Supreme Court in Employment Division, Department of Human Resources of Oregon v. Smith wrongly narrowed the scope of the Free Exercise Clause to protect only against government actions that directly or indirectly target religion, lowering the bar for government interference with religious liberty.\n\nCongress responded by enacting RFRA in 1993, restoring “strict scrutiny” protection to exercising faith. The House passed RFRA unanimously — not a single vote against it among 435 members of Congress — and the Senate passed it by an overwhelming vote of 97-3. The ACLU supported RFRA. President Bill Clinton William (Bill) Jefferson ClintonA Republican Watergate veteran's perspective on a Trump impeachment Beware the 34th month of Trump's presidency How to survive an impeachment MORE, a Democrat, signed RFRA into law.\n\nRFRA has been vitally important to protecting religious freedom in the years since it was enacted. When the Obama administration imposed its “contraceptive mandate” through ObamaCare regulations, Hobby Lobby Stores — owned by an Evangelical Christian family — faced $475 million per year in penalties for not providing abortion-causing drugs to employees.\n\nKyle Duncan — now a judge on the federal Fifth Circuit appeals court — and former Solicitor General Paul Clement, argued the Supreme Court case Burwell v. Hobby Lobby (2014), which struck down ObamaCare’s contraceptive mandate because it violated RFRA. But Hobby Lobby was a 5-4 decision. A single vote separated this faith-driven company from a financial catastrophe.\n\nGovernment has been increasingly willing to infringe upon religious freedom as American society has become more secular. Often, these violations pit conscientious beliefs about abortion, human sexuality and marriage against secular progressivism.\n\nPoliticians and bureaucrats often mask infringements on applying ones beliefs about controversial issues in the public square by redefining religious liberty to mean only “freedom of worship.” In other words, people are free to believe whatever they want when within the four corners of their house of worship but cannot carry those beliefs into the workplace to inform how they can run their business or conduct their lives.\n\nThe reality is that most of the current threats to religious liberty concern rights of conscience on the matters that would be specifically exempted by the Do Not Harm Act. This bill targets countless faithful Christians and adherents of other faiths who turned out for President Trump Donald John TrumpWHCA calls on Trump to denounce video depicting him shooting media outlets Video of fake Trump shooting members of media shown at his Miami resort: report Trump hits Fox News's Chris Wallace over Ukraine coverage MORE because they believed his promise to protect religious liberty — a promise he continues to faithfully keep.\n\nIt does not matter if people of faith are sincere in their love for people who disagree with them on those issues or go the extra mile to avoid causing offense. The political elites have decided that everyone must adhere to the government-approved orthodoxy on these social issues, and therefore legal protections that shield people of faith must be stripped away.\n\nThat is not American. This country was founded on religious liberty. The Do Not Harm Act strikes at the heart of that freedom and should be an issue in the upcoming election. It gives voters a clear choice regarding the nation’s future.\n\nKen Klukowski is senior counsel for First Liberty Institute, the largest organization exclusively dedicated to protecting religious liberty for all Americans.", "description": "\"Government has been increasingly willing to infringe upon religious freedom as American society has become more secular.\"", "authors": [], "top_image": "https://thehill.com/sites/default/files/pray_032318gn_0.jpg", "published_at": "2018-06-08"}