{"pub": "reuters", "url": "https://reuters.com/article/us-usa-election-gabbard/gabbard-calls-clinton-personification-of-the-rot-as-war-of-words-heats-up-idUSKBN1WY003", "downloaded_at": "2019-10-19 11:46:14.935149+00:00", "title": "Gabbard calls Clinton 'personification of the rot' as war of words heats up", "language": "en", "text": "(Reuters) - An ugly war of words broke out among Democrats on Friday, as Representative Tulsi Gabbard responded angrily to broad hints by Hillary Clinton, the party’s 2016 presidential nominee, that Gabbard was being “groomed” to disrupt the 2020 election as a third-party candidate.\n\nFILE PHOTO: Democratic presidential candidate Rep. Tulsi Gabbard speaks during the fourth U.S. Democratic presidential candidates 2020 election debate in Westerville, Ohio, U.S., October 15, 2019. REUTERS/Shannon Stapleton\n\nGabbard, one of 19 Democrats seeking the party’s nomination to run against Republican Donald Trump, on Friday accused Clinton of trying to destroy her reputation and called the former secretary of state the “embodiment of corruption.”\n\n“You, the queen of warmongers, embodiment of corruption, and personification of the rot that has sickened the Democratic Party for so long, have finally come out from behind the curtain,” said Gabbard, a congresswoman from Hawaii who is a favorite of Russian state media as well as many liberals.\n\nGabbard has said she will not run as a third-party candidate.\n\nClinton did not name Gabbard in a podcast interview with Democratic operative David Plouffe dated Thursday but said that Trump’s backers would attempt to persuade some voters to choose a third-party candidate, a move that would dilute support for Democrats.\n\n“I’m not making any predictions, but think they’ve got their eye on somebody who’s currently in the Democratic primary and they’re grooming her to be the third-party candidate,” Clinton said. “She’s the favorite of the Russians. They have a bunch of sites and bots and other ways of supporting her so far.”\n\nOn Friday, Clinton spokesman Nick Merrill told Politico that she was referring to the Gabbard.\n\nMerrill did not respond to a request for comment but has published negative tweets about Gabbard in recent days.\n\n“Assad day for your candidacy,” he wrote snidely in a retweet of her comments slamming Clinton, referring to a controversial meeting Gabbard said she held with Syrian President Bashar al-Assad during a trip to that country.\n\nOn Oct. 10, after Gabbard suggested that she might boycott the party’s Ohio debate, Merrill tweeted, “I’m seriously considering watching if you promise you won’t be there.”\n\nGabbard, who is a veteran, has not polled above single digits in the race for the Democrats’ nomination. Despite her liberal views on most issues, she has won praise from some Trump supporters and conservative Fox News hosts, as well as Russian state media and its online surrogates.\n\nShe is a fierce opponent of what she calls “forever wars,” and her candidacy has also been praised by liberals including some supporters of Vermont Senator Bernie Sanders.", "description": "An ugly war of words broke out among Democrats on Friday, as Representative Tulsi Gabbard responded angrily to broad hints by Hillary Clinton, the party's 2016 presidential nominee, that Gabbard was being \"groomed\" to disrupt the 2020 election as a third-party candidate.", "authors": ["Sharon Bernstein", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191019&t=2&i=1442487389&w=1200&r=LYNXMPEF9I001", "published_at": "2019-10-19"}