{"pub": "nymag", "url": "https://vulture.com/2019/09/charli-xcx-charli-album-review.html", "downloaded_at": "2019-09-13 20:07:53.510897+00:00", "title": "Charli XCX Is Making Pop for Our Doomed Future", "language": "en", "text": "XCX’s third album, Charli, is fishscale anxiety-pop. Photo: Kieran Frost/Redferns\n\nCharli XCX is a trailblazer, a songwriter to the stars and a pop soothsayer holding the necessary skills to scale the top of the charts, the reach to get booked for tours with the likes of Taylor Swift, and the taste to know what great music is bubbling on the horizon. She gave Iggy Azalea’s “Fancy” its wings. She co-wrote the Camila Cabello and Shawn Mendes single that’s got the pair acting out online (as well as inescapable tunes like Madison Beer’s “Hurts Like Hell,” Icona Pop’s “I Love It,” and Iggy’s “Beg for It”). She gave The Fault in Our Stars its signature tune. Charli helped map out musical blueprints that would be adopted by all of the dance-pop closers of this era; one wonders whether Taylor having her open on the Reputation trek was paying it forward for the influence of songs like “You (Ha Ha)” on the architecture of 1989. Charli is a risk-taker and a serial early adopter of trends that go supernova in her wake; naming 2017’s late-year sidewinder Pop 2 is surely a wink at the obvious, a preening notice to the competition to catch up.\n\nCharli’s engaged in a precarious juggling act, tracking pop’s mainstream while courting the favor of the gifted oddballs dragging the music leftward and being truly present online whether things are going great for her or not. You might see her post a Brat-doll version of her album artwork, and you might hear about how she sometimes wishes she could write songs without the burden of performing them. Getting any good at writing these days means fostering the necessary introversion to spell out what’s going on inside your head and then summoning the gall to show your work to others and the reserve to explain and defend yourself afterward. It is emotionally expensive behavior. You can hear pop stars working out the costs of fame in songs like Bebe Rexha’s “I’m a Mess,” Ariana Grande’s “Fake Smile,” and Shawn Mendes’s “In My Blood.” You can see hip-hop artists bristle at the expectation of omnipresence in interviews and in songs like Post Malone’s “Internet.” Post and Kanye moving from industry-adjacent homes in the Los Angeles area to rustic Midwest expanses while Lana Del Rey muses on record about wanting to disappear into middle age in the comfort of the valley is proof positive that the girls are tired.\n\nXCX’s third album, Charli, is fishscale anxiety-pop. It’s music for the party and for the internal dialogue happening in your head while you shuffle through the masses trying to keep up appearances. “Gone” is the most euphoric song about stress-drinking to get over feeling alone in a crowd in a year chock-full of them. “I Don’t Wanna Know” is a love song about worrying that you’re losing someone, but rather than taking the accusatory tone that a tune about the decay of trust in a relationship would normally occupy, it lists its fears and ultimately decides not to bring them up. “Thoughts” spirals on the road out west, like Kanye’s “No More Parties in L.A.”: “Did I lose it all? Did I fuck it up? / Are my friends really friends now? / Or are they far gone?” Charli’s specific magic is making these missives soar. The singer glides into her upper register with the effortless ease of early Rihanna. You nearly forget “Cross You Out” is about a breakup as the vocal skips around octaves in the chorus. The upbeat stuff’s just as solid. Charli splits the difference between beguilingly catchy songs about sadness and elite dance-floor fodder where the singer plays Words With Friends with a Who’s Who of modern oddball pop and electronic music.\n\nHelming the majority of the production on Charli is PC Music label founder A.G. Cook, with assistance from a worldwide network of talent, including French producer Nömak, Swedish songwriter and beat-maker Lotus IV, pop session whiz watt, and Dylan Brady of noise-pop freaks 100 Gecs. Together, they gift Charli a sound that’s catchy but also confrontational. Like rock candy, these songs are sweet but sharp around the edges. The synth hits from “Gone” are percussive enough to fill out spaces in the drum pattern in the chorus. The braying keys buttressing Charli’s flights in “Thoughts” are what the fanfare at a robot’s funeral might sound like. “Click” could pass for a Space Invaders arcade cabinet tumbling down a flight of stairs. “I Don’t Wanna Know” introduces an ’80s feel with a dollop of gated reverb. Fun-house vocal effects keep Charli and her rotating cast of friends sounding freshly outrageous on each song. A dab of Auto-Tune turns the killer Kim Petras verse in “Click” into a mindfuck. The Troye Sivan appearance in “2099” doubles down on the natural ghostly wispiness of his voice; bookending the confectionary “1999,” you can almost imagine “2099” as an artifact unearthed in a distant future.\n\nThese are all ideas you could hear coming together in a succession of envelope-pushing albums like Sophie’s Oil of Every Pearl’s Un-Sides, 100 Gecs’s 1000 Gecs (and by extension, Sleigh Bells’ Treats), Flume’s Skin, Rustie’s Glass Swords, and even Charli’s own Pop 2, but the audacity to present this stuff as straight-up pop music — and to go get Lizzo, Haim, Sky Ferreira, Troye Sivan, and Big Freedia to sing over the stuff — is a new and noble enterprise. Charli is a Trojan horse. The weird kids are crashing the party, and making great music about how the party sucks. That’s a delightful change of pace.", "description": "Charli is a Trojan horse. The weird kids are crashing the party, and making great music about how the party sucks. That’s a delightful change of pace.", "authors": ["Craig Jenkins"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/13/13-charli-xcx-review.w1200.h630.jpg", "published_at": "2019-09-13"}