{"pub": "cbs", "url": "https://cbsnews.com/news/samford-college-football-player-changes-name-to-honor-stepdad-surprises-parents-with-new-jersey-grimwade-musto", "downloaded_at": "2019-10-15 16:24:58.490342+00:00", "title": "College football player changes name to honor stepdad, surprises parents with new jersey", "language": "en", "text": "Football players are usually seen as tough, but one college athlete's sideline surprise is melting hearts across the U.S.\n\n\"My name is formerly known as George Grimwade. But now it's George Grimwade-Musto,\" the Samford University football player said in a viral video produced by the school's football program. In the poignant video, the name Grimwade on the back of his jersey is stripped off, and a new name, Musto, is sewn on.\n\n\"I decided to change my last name because my stepdad — which sounds weird calling him my stepdad, because he's always been my dad to me — he doesn't have anyone to carry on his last name. And he raised me ever since I was in second grade. And I feel like I owe it to him to carry on his last name, when I hopefully have kids,\" he says.\n\nFor one 🐶, Family Weekend meant just a bit more.#AllForSAMford🐶🐾 pic.twitter.com/urRXQAEF6V — Samford Football (@SamfordFootball) October 7, 2019\n\nThe player says he wants his dad's legacy to live on forever, so on September 26, he legally changed his last name to Grimwade-Musto.\n\n\"I love you so much and you really do mean the world to me. Without you I don't know who I am, nor would I know where I'm at,\" Grimwade-Musto says in the video to his parents. \"I'm really happy I get to carry on that last name for you. And I hope I treat it well. Thank you.\"\n\nGrimwade-Musto came up with the perfect way to break the news to his parents by showing them the new name on the back of his jersey. He ran up to them on the sidelines, took off his football helmet and told his dad how much he loved him. \"Look at my jersey,\" he said.\n\nHe then explained he legally changed his name, handing over the official documents to prove it. His dad was overwhelmed with emotion and his mother immediately started tearing up. \"You're my son,\" the dad said through tears.\n\nThe father and son embraced, and then Grimwade-Musto ran back onto the field. The emotional moment, which took place during Samford's family weekend on the Birmingham, Alabama, campus, was posted on the football team's Twitter page. The video quickly went viral, with hundreds of thousands of people touched by the son's sweet gesture.", "description": "\"He raised me ever since I was in second grade. And I feel like I owe it to him to carry on his last name,\" the player said", "authors": ["Caitlin O'Kane"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/15/dc31d319-3a1d-4ab5-a51a-68bcd21a8641/thumbnail/1200x630/e26dfd99bcd08bfc8acbd5558346bdbb/football.jpg", "published_at": "2019-10-15"}