{"pub": "yahoo", "url": "https://finance.yahoo.com/news/investors-nordic-american-tankers-limited-134619074.html", "downloaded_at": "2019-10-15 15:19:28.044002+00:00", "title": "Investors In Nordic American Tankers Limited (NYSE:NAT) Should Consider This, First", "language": "en", "text": "Could Nordic American Tankers Limited (NYSE:NAT) be an attractive dividend share to own for the long haul? Investors are often drawn to strong companies with the idea of reinvesting the dividends. On the other hand, investors have been known to buy a stock because of its yield, and then lose money if the company's dividend doesn't live up to expectations.\n\nA slim 1.9% yield is hard to get excited about, but the long payment history is respectable. At the right price, or with strong growth opportunities, Nordic American Tankers could have potential. Remember though, due to the recent spike in its share price, Nordic American Tankers's yield will look lower, even though the market may now be factoring in an improvement in its long-term prospects. Some simple analysis can reduce the risk of holding Nordic American Tankers for its dividend, and we'll focus on the most important aspects below.\n\nClick the interactive chart for our full dividend analysis\n\nNYSE:NAT Historical Dividend Yield, October 15th 2019 More\n\nPayout ratios\n\nDividends are usually paid out of company earnings. If a company is paying more than it earns, then the dividend might become unsustainable - hardly an ideal situation. As a result, we should always investigate whether a company can afford its dividend, measured as a percentage of a company's net income after tax. Although Nordic American Tankers pays a dividend, it was loss-making during the past year. When a company recently reported a loss, we should investigate if its cash flows covered the dividend.\n\nOf the free cash flow it generated last year, Nordic American Tankers paid out 40% as dividends, suggesting the dividend is affordable.\n\nIs Nordic American Tankers's Balance Sheet Risky?\n\nGiven Nordic American Tankers is paying a dividend but reported a loss over the past year, we need to check its balance sheet for signs of financial distress. A quick check of its financial situation can be done with two ratios: net debt divided by EBITDA (earnings before interest, tax, depreciation and amortisation), and net interest cover. Net debt to EBITDA measures total debt load relative to company earnings (lower = less debt), while net interest cover measures the ability to pay interest on the debt (higher = greater ability to pay interest costs). With net debt of 5.18 times its EBITDA, Nordic American Tankers could be described as a highly leveraged company. While some companies can handle this level of leverage, we'd be concerned about the dividend sustainability if there was any risk of an earnings downturn.\n\nWe calculated its interest cover by measuring its earnings before interest and tax (EBIT), and dividing this by the company's net interest expense. With EBIT of less than 1 times its interest expense, Nordic American Tankers's financial situation is potentially quite concerning. Readers should investigate whether it might be at risk of breaching the minimum requirements on its loans. Low interest cover and high debt can create problems right when the investor least needs them, and we're reluctant to rely on the dividend of companies with these traits.\n\nWe update our data on Nordic American Tankers every 24 hours, so you can always get our latest analysis of its financial health, here.\n\nDividend Volatility\n\nOne of the major risks of relying on dividend income, is the potential for a company to struggle financially and cut its dividend. Not only is your income cut, but the value of your investment declines as well - nasty. For the purpose of this article, we only scrutinise the last decade of Nordic American Tankers's dividend payments. The dividend has been cut by more than 20% on at least one occasion historically. During the past ten-year period, the first annual payment was US$6.44 in 2009, compared to US$0.08 last year. Dividend payments have fallen sharply, down 99% over that time.\n\nStory continues", "description": "Could Nordic American Tankers Limited (NYSE:NAT) be an attractive dividend share to own for the long haul? Investors...", "authors": ["Simply Wall St"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3FSnXkYigIIT0LUtNvEsaQ--~B/aD00MzI7dz0xMTk0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/simply_wall_st__316/73c9f6d5198d90f2113aa39fbab0d56c", "published_at": "2019-10-15"}