{"pub": "businessinsider", "url": "https://businessinsider.com/what-to-do-when-you-hate-work-job-microsoft-hr-2019-9", "downloaded_at": "2019-09-15 15:13:19.750019+00:00", "title": "Microsoft's HR chief says take these 2 steps when you hate your job but feel stuck", "language": "en", "text": "Leaving an unfulfilling job isn't always an option.\n\nSometimes quitting is financially unfeasible. And if you've got a safety net but don't have another gig lined up, the prospect of fielding friends' questions about why you're unemployed can be daunting.\n\nSo it helps to have tools for tweaking your current role to be (even slightly) more palatable.\n\nStep 1: Think about how you're contributing to the company's mission\n\nAs Microsoft's chief human resources officer, Kathleen Hogan aims to provide all 100,000-plus employees with purpose. Think of purpose as a sense that you're helping fulfill the company's mission, or a compelling reason to get out of bed in the morning.\n\nBut Hogan knows too well that not every employee feels that way all the time.\n\nFor those who find themselves in that situation, Hogan told Business Insider she recommends \"zooming out\" to make sure you're looking at the \"broader picture.\"\n\nHogan said that often people get \"stuck,\" focusing on whatever tedious meeting they're in right now. (It happens to her, too, she said.)\n\nBut \"when you zoom out and you look at this incredible opportunity we have [at Microsoft] and the people that you get to work with and the impact that you really are having,\" she added, you might instead feel grateful and reinvigorated.\n\nRead more: A former Netflix exec shares 3 simple questions to ask yourself if you're thinking about leaving your job\n\nHogan's advice applies beyond Microsoft, to most any company in any industry. It can help simply to remember why you were moved to join your organization in the first place.\n\nIn fact, when you revisit your commitment to that mission, you might find that the source of your disengagement is something more easily addressable.\n\nThat's what happened to Shannon Sullivan, senior vice president of talent and organization at Hulu. Sullivan previously told Business Insider that she'd been frustrated in her role because she was consumed by a bunch of tedious administrative processes — not because she disliked the substantive work. Once she fixed those, Sullivan said, she started to feel more empowered.\n\nStep 2: Have an honest conversation with your boss about your disengagement\n\nIt's possible that you might take a step back and still feel uninspired. In that case, Hogan said, it might be time to have a discussion with your manager, while you \"do your own soul searching on what really gives you joy, what gives you purpose.\"\n\nAs intimidating as it might be to initiate that discussion, your boss may be able to help you make a change, even if that's simply moving you to another role or team. Internal mobility (letting employees try out different positions within the organization) is a growing trend, especially at tech companies, largely because it helps retain top talent who might otherwise take a job at another company.\n\nInternal mobility is, ideally, a win-win. If you're in a role that brings you joy and purpose, Hogan said, you'll perform at your best, which in turn will benefit the overall organization.\n\nConsider that you might need a different type of manager\n\nSome top employers, including Netflix and LinkedIn, say they encourage employees to speak candidly with their managers when they're interviewing elsewhere.\n\nHogan said an employee's ability to have that conversation depends heavily on their relationship with their manager. Still, she said, if you feel that you couldn't have a productive conversation with your manager about your engagement level, then you might want to look for a manager who would be open to these honest discussions.\n\n\"I'm not being cavalier\" and advising people who are having a hard time at work to immediately jump ship, Hogan added.\n\nBut her own experience in people management has taught her that managers play a key role in an employee's experience at work. Indeed, a recent survey found that people are likely to leave their companies when they feel their manager isn't helping promote their career development.\n\nHogan said it's worth at least thinking about how you could change your job to be more satisfying. She said, \"Life is too short to be in a job that doesn't give you purpose and deep meaning and joy.\"", "description": "Microsoft HR chief Kathleen Hogan says that, if you feel unfulfilled at work, take a step back and have an honest conversation with your boss.", "authors": ["Shana Lebowitz"], "top_image": "https://amp.businessinsider.com/images/5d55daf2cd9784070821ec26-1334-667.jpg", "published_at": "2019-09-15"}