{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/24/health-officials-expect-more-vaping-illnesses-caus", "downloaded_at": "2019-09-25 04:36:06.521741+00:00", "title": "Health officials expect more vaping illnesses; cause still unknown", "language": "en", "text": "The Centers for Disease Control and Prevention on Tuesday told Congress that they expect to see much higher numbers of vaping-related illnesses and deaths, as Kansas reported its second vaping-related death this week.\n\nDr. Anne Schuchat, principal deputy director of the CDC, described the spread of the vaping-related illnesses as a “fast moving and very serious outbreak” primarily among young people in her testimony at a House Oversight and Government Reform Committee hearing.\n\n“There are challenges with this response, including the nature of the outbreak itself,” Dr. Schuchat said. “In many states, some of the cases report using illicit products and may not be fully forthcoming. The marketplace for e-cigarettes is wide and diverse with a multitude of products, and it may be very complicated to tease out the problematic exposures.”\n\n“We have a need to address the epidemic of youth use of e-cigarettes. And this current outbreak reinforces the need to address the broader youth e-cigarette epidemic,” she said.\n\nKansas Gov. Laura Kelly issued a statement saying a man over the age of 50 has become the state’s second vaping-related death. His death brings the total number of vaping deaths reported in Kansas, California, Minnesota, Illinois, Oregon, Indiana and Missouri to nine. More than 530 vaping illnesses have been reported nationwide.\n\nNo specific product, brand or substance has been identified as the cause of the severe lung injuries.\n\nPreliminary data from the 2019 National Youth Tobacco Survey show that more than a quarter of high school students reported using electronic cigarettes within the preceding 30 days, according to the Department of Health and Human Services.\n\nDr. Schuchat noted that the CDC has warned against the use of all vaping products, commenting on how the lung injuries might not be due to nicotine or THC but other chemicals found in e-cigarettes.\n\nMost of the cases have involved products with THC, the psychoactive chemical in marijuana, or both THC and nicotine. Some patients have reported vaping only nicotine.\n\nAmid the outbreak, the United States and other countries are taking steps to remove or regulate e-cigarette products, which arrived in the domestic market in 2007. President Trump proposed this month a federal ban on non-tobacco flavored e-cigarettes to help combat the youth vaping epidemic.\n\nIn response, more than 50 advocacy groups Tuesday sent a letter to Mr. Trump urging the administration to promptly follow through with its plan to clear the market of flavored vaping products.\n\n“Our organizations commend and fully support your plan to remove all non-tobacco flavored e-cigarettes from the market, including mint and menthol flavors. If this plan is swiftly and fully implemented, it will play a critical role in reversing the youth e-cigarette epidemic,” the 56 advocacy groups said in the letter to the president.\n\nOfficials from Michigan and New York also have initiated plans to ban flavored e-cigarettes.\n\nMeanwhile, Canadian health officials are investigating four potential cases of severe lung injuries tied to vaping in two provinces, according to The Globe and Mail.\n\nIndia announced last week a complete ban on the sale of e-cigarettes. And China, the birthplace of the e-cigarette market, announced plans Monday to regulate electronic cigarettes, introducing national standards possibly next month, due to concerns over the harmful effects of vaping products.\n\n“What is clear is that there is nothing healthy about vaping,” said Ngozi Ezike, director of the Illinois Department of Public Health, at Tuesday’s congressional hearing.\n\nIllinois reported the first vaping-related death, and has recorded 69 cases of lung illnesses connected to e-cigarettes as of Sept. 20.\n\nVicki Porter, a witness for Republican lawmakers at Tuesday’s hearing, testified that vaping products helped her quit smoking traditional cigarettes.\n\n“Vaping is a health miracle to me,” she said.\n\nThe vaping industry has argued that a federal ban of flavored e-cigarettes would remove “life-changing options” from the market for millions of American adults who are trying to quit smoking. Vaping companies also have said a ban would help create a black market.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The Centers for Disease Control and Prevention on Tuesday told Congress that they expect to see much higher numbers of vaping-related illnesses and deaths, as Kansas reported its second vaping-related death this week.", "authors": ["The Washington Times Http", "Shen", "Wu Tan"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/24/9_242019_vaping-illness-congress-58201_c0-210-5024-3139_s1770x1032.jpg?d5c227052e59e635bf2f90634455d06687a08f8f", "published_at": "2019-09-24"}