{"pub": "yahoo", "url": "https://finance.yahoo.com/news/shareowners-approve-raytheon-united-technologies-125200396.html", "downloaded_at": "2019-10-13 11:38:04.451296+00:00", "title": "Shareowners Approve Raytheon and United Technologies Merger of Equals", "language": "en", "text": "WALTHAM, Mass. and FARMINGTON, Conn., Oct. 11, 2019 /PRNewswire/ -- Raytheon Company (RTN) and United Technologies Corp. (UTX) announced that, at their respective special meetings of shareowners held today, Raytheon and United Technologies shareowners voted overwhelmingly to approve all of the proposals necessary to complete the merger of equals transaction combining United Technologies' aerospace businesses, comprised of Collins Aerospace and Pratt & Whitney, with Raytheon. The merger would create Raytheon Technologies Corporation, a premier systems provider with advanced technologies to address rapidly growing segments within aerospace and defense.\n\nThe transaction is expected to close in the first half of 2020, subject to the satisfaction of customary closing conditions, including receipt of required regulatory approvals, as well as completion by United Technologies of the separation of its Otis and Carrier businesses.\n\n\"I am pleased that the shareowners of Raytheon and UTC voted in favor of our powerful strategic combination,\" said Tom Kennedy, Raytheon Chairman and CEO. \"Today's vote reflects a significant step on our path to unite two world-class companies with complementary technologies and supports our view that this merger of equals will create additional growth opportunities while delivering benefits to our shareowners, customers and employees.\"\n\n\"Today is an important milestone in our transformational merger, which will define the future of aerospace and defense. With our technological and R&D capabilities, Raytheon Technologies will deliver innovative and cost-effective solutions aligned with the highest customer priorities for decades to come,\" said Greg Hayes, United Technologies Chairman and CEO.\n\nThe final vote results on the proposals voted on at the special meetings will be set forth in the companies' separate Form 8-Ks filed with the SEC after certification by each company's inspector of elections.\n\nTransaction Website\n\nAdditional information on the merger and related materials can be found on a joint transaction website at www.futureofaerospacedefense.com.\n\nAbout Raytheon\n\nRaytheon Company is a technology and innovation leader specializing in defense, civil government and cybersecurity solutions. With a history of innovation, Raytheon provides state-of-the-art electronics, mission systems integration, C5I® products and services, sensing, effects and mission support for customers in more than 80 countries. Raytheon is headquartered in Waltham, Massachusetts. Follow us on Twitter.\n\nAbout United Technologies\n\nUnited Technologies Corp., based in Farmington, Connecticut, provides high technology products and services to the building and aerospace industries. By combining a passion for science with precision engineering, the company is creating smart, sustainable solutions the world needs. For more information about the company, visit our website at www.utc.com or on Twitter @UTC.\n\nCautionary Statement Regarding Forward-Looking Statements\n\nThis communication contains statements which, to the extent they are not statements of historical or present fact, constitute \"forward-looking statements\" under the securities laws. From time to time, oral or written forward-looking statements may also be included in other information released to the public. These forward-looking statements are intended to provide Raytheon Company's (\"Raytheon\") and United Technologies Corporation's (\"UTC\") respective management's current expectations or plans for our future operating and financial performance, based on assumptions currently believed to be valid. Forward-looking statements can be identified by the use of words such as \"believe,\" \"expect,\" \"expectations,\" \"plans,\" \"strategy,\" \"prospects,\" \"estimate,\" \"project,\" \"target,\" \"anticipate,\" \"will,\" \"should,\" \"see,\" \"guidance,\" \"outlook,\" \"confident,\" \"on track\" and other words of similar meaning. Forward-looking statements may include, among other things, statements relating to future sales, earnings, cash flow, results of operations, uses of cash, share repurchases, tax rates, R&D spend, other measures of financial performance, potential future plans, strategies or transactions, credit ratings and net indebtedness, other anticipated benefits of the Rockwell Collins acquisition, the proposed merger or the spin-offs by UTC of Otis and Carrier into separate independent companies (the \"separation transactions\"), including estimated synergies and customer cost savings resulting from the proposed merger, the expected timing of completion of the proposed merger and the separation transactions, estimated costs associated with such transactions and other statements that are not historical facts. All forward-looking statements involve risks, uncertainties and other factors that may cause actual results to differ materially from those expressed or implied in the forward-looking statements. For those statements, we claim the protection of the safe harbor for forward-looking statements contained in the U.S. Private Securities Litigation Reform Act of 1995. Such risks, uncertainties and other factors include, without limitation: (1) the effect of economic conditions in the industries and markets in which UTC and Raytheon operate in the U.S. and globally and any changes therein, including financial market conditions, fluctuations in commodity prices, interest rates and foreign currency exchange rates, levels of end market demand in construction and in both the commercial and defense segments of the aerospace industry, levels of air travel, financial condition of commercial airlines, the impact of weather conditions and natural disasters, the financial condition of our customers and suppliers, and the risks associated with U.S. government sales (including changes or shifts in defense spending due to budgetary constraints, spending cuts resulting from sequestration, a government shutdown, or otherwise, and uncertain funding of programs); (2) challenges in the development, production, delivery, support, performance and realization of the anticipated benefits (including our expected returns under customer contracts) of advanced technologies and new products and services; (3) the scope, nature, impact or timing of the proposed merger and the separation transactions and other merger, acquisition and divestiture activity, including among other things the integration of or with other businesses and realization of synergies and opportunities for growth and innovation and incurrence of related costs and expenses; (4) future levels of indebtedness, including indebtedness that may be incurred in connection with the proposed merger and the separation transactions, and capital spending and research and development spending; (5) future availability of credit and factors that may affect such availability, including credit market conditions and our capital structure; (6) the timing and scope of future repurchases by the combined company of its common stock, which may be suspended at any time due to various factors, including market conditions and the level of other investing activities and uses of cash; (7) delays and disruption in delivery of materials and services from suppliers; (8) company and customer-directed cost reduction efforts and restructuring costs and savings and other consequences thereof (including the potential termination of U.S. government contracts and performance under undefinitized contract awards and the potential inability to recover termination costs); (9) new business and investment opportunities; (10) the ability to realize the intended benefits of organizational changes; (11) the anticipated benefits of diversification and balance of operations across product lines, regions and industries; (12) the outcome of legal proceedings, investigations and other contingencies; (13) pension plan assumptions and future contributions; (14) the impact of the negotiation of collective bargaining agreements and labor disputes; (15) the effect of changes in political conditions in the U.S. and other countries in which UTC, Raytheon and the businesses of each operate, including the effect of changes in U.S. trade policies or the U.K.'s pending withdrawal from the European Union, on general market conditions, global trade policies and currency exchange rates in the near term and beyond; (16) the effect of changes in tax (including U.S. tax reform enacted on December 22, 2017, which is commonly referred to as the Tax Cuts and Jobs Act of 2017), environmental, regulatory and other laws and regulations (including, among other things, export and import requirements such as the International Traffic in Arms Regulations and the Export Administration Regulations, anti-bribery and anti-corruption requirements, including the Foreign Corrupt Practices Act, industrial cooperation agreement obligations, and procurement and other regulations) in the U.S. and other countries in which UTC, Raytheon and the businesses of each operate; (17) negative effects of the announcement or pendency of the proposed merger or the separation transactions on the market price of UTC's and/or Raytheon's respective common stock and/or on their respective financial performance; (18) the ability of the parties to receive the required regulatory approvals for the proposed merger (and the risk that such approvals may result in the imposition of conditions that could adversely affect the combined company or the expected benefits of the transaction) and to satisfy the other conditions to the closing of the merger on a timely basis or at all; (19) the occurrence of events that may give rise to a right of one or both of the parties to terminate the merger agreement; (20) risks relating to the value of the UTC shares to be issued in the proposed merger, significant transaction costs and/or unknown liabilities; (21) the possibility that the anticipated benefits from the proposed merger cannot be realized in full or at all or may take longer to realize than expected, including risks associated with third party contracts containing consent and/or other provisions that may be triggered by the proposed transaction; (22) risks associated with transaction-related litigation; (23) the possibility that costs or difficulties related to the integration of UTC's and Raytheon's operations will be greater than expected; (24) risks relating to completed merger, acquisition and divestiture activity, including UTC's integration of Rockwell Collins, including the risk that the integration may be more difficult, time-consuming or costly than expected or may not result in the achievement of estimated synergies within the contemplated time frame or at all; (25) the ability of each of Raytheon, UTC, the companies resulting from the separation transactions and the combined company to retain and hire key personnel; (26) the expected benefits and timing of the separation transactions, and the risk that conditions to the separation transactions will not be satisfied and/or that the separation transactions will not be completed within the expected time frame, on the expected terms or at all; (27) the intended qualification of (i) the merger as a tax-free reorganization and (ii) the separation transactions as tax-free to UTC and UTC's shareowners, in each case, for U.S. federal income tax purposes; (28) the possibility that any opinions, consents, approvals or rulings required in connection with the separation transactions will not be received or obtained within the expected time frame, on the expected terms or at all; (29) expected financing transactions undertaken in connection with the proposed merger and the separation transactions and risks associated with additional indebtedness; (30) the risk that dissynergy costs, costs of restructuring transactions and other costs incurred in connection with the separation transactions will exceed UTC's estimates; and (31) the impact of the proposed merger and the separation transactions on the respective businesses of Raytheon and UTC and the risk that the separation transactions may be more difficult, time-consuming or costly than expected, including the impact on UTC's resources, systems, procedures and controls, diversion of its management's attention and the impact on relationships with customers, suppliers, employees and other business counterparties. There can be no assurance that the proposed merger, the separation transactions or any other transaction described above will in fact be consummated in the manner described or at all. For additional information on identifying factors that may cause actual results to vary materially from those stated in forward-looking statements, see the joint proxy statement/prospectus (defined below) and the reports of UTC and Raytheon on Forms 10-K, 10-Q and 8-K filed with or furnished to the Securities and Exchange Commission (the \"SEC\") from time to time. Any forward-looking statement speaks only as of the date on which it is made, and UTC and Raytheon assume no obligation to update or revise such statement, whether as a result of new information, future events or otherwise, except as required by applicable law.\n\nStory continues", "description": "WALTHAM, Mass. and FARMINGTON, Conn., Oct. 11, 2019 /PRNewswire/ -- Raytheon Company (RTN) and United Technologies Corp. (UTX) announced that, at their respective special meetings of shareowners held today, Raytheon and United Technologies shareowners voted overwhelmingly to approve all of the proposals", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-11"}