{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/2019/09/24/trump-thinks-biden-pulled-scam-ukraine-because-its-what-trump-would-have-done", "downloaded_at": "2019-09-25 04:35:12.534482+00:00", "title": "Trump thinks Biden pulled a scam in Ukraine because it’s what Trump would have done", "language": "en", "text": "\n\nPresident Trump attends a meeting at the United Nations on Tuesday. (Saul Loeb/AFP/Getty Images)\n\nElizabeth Spiers is the chief executive of the Insurrection , a progressive digital messaging firm.\n\nEverything President Trump accuses his opponents of doing can be understood in one of two ways: as projection or a confession.\n\nWhen he accuses Democrats of manipulating the last election (an election where more Americans voted for his rival than for him, which still rankles Trump), like he did last month, saying, “Wow, Report Just Out! Google manipulated from 2.6 million to 16 million votes for Hillary Clinton in 2016 Election!” that’s the confession of someone who has been accused of trying to manipulate the last election himself. When he calls any number of intelligent Democrats (usually women) “low IQ,” that’s projection and a manifestation of the kind of intellectual insecurity that would lead someone to go to epic lengths to ensure his college transcripts are never released while also spouting easily refutable lies that he graduated at the top of his class at Wharton.\n\nAnd when he suggests, baselessly, that Joe Biden threatened Ukraine on behalf of his son Hunter Biden’s business and that this ridiculous lie is evidence of systemic corruption on the part of the Biden family, it manages to be both — a confession and projection. Trump is projecting his own faults onto Biden and accusing him of abusing public office to enrich his family business.\n\nWanton corruption and pursuit of personal enrichment at the expense of Americans appear to be the two dominant modes of operation for the Trump family, so this should come as no surprise. No first family in modern history has so gleefully flouted the emoluments clause of the Constitution while cozying up to hostile foreign powers at the expense of American lives and for the benefit of their private businesses. It is easy to see why Trump thinks Biden must have been pulling a scam in Ukraine: It is exactly what Trump would have done.\n\n[Trump hasn't solved any of his conflicts of interest]\n\nTrump’s extreme solipsism means he cannot really conceive of anyone who’d behave any differently than he does. He has accused public servants of pursuing personal vendettas against him, even as he threatened to fire them in retaliation for perceived slights; accused the FBI, the media and Democrats at large of treason, even as he betrays the country in ways large and small; and referred to Chrissy Teigen as “filthy-mouthed” after bragging about sexually assaulting women in language that isn’t printable in a family newspaper. On some level, he believes it because he cannot conceive of anyone acting in good faith — with regard to anything. Unlike prior occupants of the Oval Office, he has no meaningful concept of public service because it involves a duty to others and sacrificing for the good of the whole. Trump sees no point in personally doing anything that does not directly benefit anyone who is not Donald Trump. His idea of sacrifice is, as he told the parents of a fallen soldier, employing people who work for him and even that he finds galling, routinely stiffing contractors on payments.\n\nStill, Trump’s lies about the Biden family will probably gain traction with a certain constituency of Trump supporters who view the president’s feigned outrage about the imaginary misdeeds of other people as an articulation of something ineffable that they already believe about elites: that all of them are corrupt to some extent. This is also why even the supporters who will acknowledge Trump is corrupt give him a pass. They believed most of government was corrupt before Trump entered office, anyway. He may be getting rich from public office, but he is on their side, and so he cannot be any worse than what Fox News tells them Democrats are.\n\nBut of course he is. Surely he knows it on some level, so his simple messaging playbook is just the rhetorical version of a thoughtless playground taunt: I know you are, but what am I. Some part of Trump is aware he is a liar, that he is corrupt, that he clumsily tried to manipulate the last election (“Russia, if you’re listening …”) and that he and his family are presently and unabatedly abusing their positions in the White House to gain access to capital they would not have otherwise from sources hostile to U.S. interests. And he admits it via the overwrought, subliterate accusations he hurls at others.\n\n[How Trump silenced the people who could have exposed his business failures]\n\nThat’s what drives Trump to suggest, with zero evidence, that former president Barack Obama should be criminally investigated for unspecified wrongdoing (or for getting a Netflix deal) or that Hillary Clinton should be locked up for having the temerity to continue to exist. Somewhere in the recesses of his consciousness, perhaps he is afraid he will be held accountable and the result will be criminal investigation and potentially, incarceration. Projection and confession. As calls for impeachment grow louder and more evidence is uncovered that Trump has done and is doing things that may or do cross any number of legal and ethical lines, the number of supposed criminals he’s identified among his opponents keep multiplying.\n\nThe whistleblower scandal he is embroiled in now may be his undoing, if it really does prompt House Democrats to take up impeachment, so the accusations are louder and more vocal. Trump has to convince himself and his supporters that his worst qualities and misdeeds are somehow eclipsed by the faults and misdeeds of others, however fictional, implausible or easily refuted by readily available evidence. He knows he can continue to be evil, as long as he is the lesser evil. To be the lesser evil, greater demons must be conjured up from thin air.\n\nBut the weakness of this particular tactic is it demonstrates how shallow Trump’s imagination is. His “everybody does it!” nihilism is not indicative of a complex and cynical worldview. Trump simply assumes everyone else does it because it is what he would do.\n\nSo if he wakes up tomorrow and accuses Joe Biden of trying to act like a tough guy, of selling out America in exchange for small-stakes business advantages and being “low IQ” — all of which Trump has already done — it will not be any reflection on Biden. (Coming soon, no doubt: Joe Biden cheats at golf!) It will just be another contour in the cartography of Trump’s own guilt and self-loathing. Projection, again, and a confession.\n\nRead more:\n\nTrump is getting payments from foreign governments. We have no idea what they are.\n\nHow President Trump could use the White House to enrich himself and his family\n\nIvanka Trump ignores rules because she doesn’t see the White House as a real job", "description": "The projector-in-chief seeks new targets.", "authors": ["Elizabeth Spiers", "Elizabeth Spiers Is The Chief Executive Of", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/FHK0-EA3RsRHL91fpcMfDFKRVO0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6IPOX3W65II6TPT7JTEFAF6DN4.jpg", "published_at": "2019-09-24"}