{"pub": "businessinsider", "url": "https://businessinsider.co.za/new-2020-coin-designs-natura-dinosaur-and-kruger-rand-2019-10", "downloaded_at": "2019-10-11 20:05:42.074036+00:00", "title": "SA is getting a new dinosaur-themed R25 coin next year – and a less angry leopard on other coins", "language": "en", "text": "Finance minister Tito Mboweni on Friday finalised the designs for the 2020 silver Kruger Rand and the R25 Natura Series collectable coin due next year.\n\nHe also gazetted an update to a coin design that makes a leopard featured in a Big 5 collectable coin series somewhat less angry.\n\nHere's what the coins will look like.\n\nFor more stories go to www.businessinsider.co.za.\n\nSouth Africa's next dinosaur-themed collectable coin will feature Coelophysis rhodesiensis, a two-legged carnivore that grew to a relatively diminutive 3 metres tall, finance minister Tito Mboweni confirmed on Friday.\n\nMboweni formalised the design by publication in the Government Gazette, declaring the 1 ounce fine silver coin will be legal tender, worth R25, from 1 January 2020.\n\n\n\nThe coin is the latest in the collectible – and popular – Natura series from the SA Mint, which has been making the range in gold since 1994. The first silver coin was announced last November.\n\nIt is due to be released in a run limited to 50,000 coins.\n\nMboweni simultaneously finalised the design for the 2020 edition of the fine-silver R2 Kruger Rand, which sticks to the standard look of the Kruger coins.\n\nIn a related update, the Reserve Bank announced a small change to an upcoming series of coins featuring a leopard – which will now be considerably less angry.\n\nIn March Mboweni gazetted the designs for a \"Big 5\" series of coins in gold, silver, and platinum, with designs featuring leopards and rhinos due to be issued on 1 January 2020.\n\nThe leopard coin featured an animal with its ears pulled back sharply.\n\nBut the design had been adjusted, the Reserve Bank said on Friday – to one with a leopard that seems less likely to pounce on prey.\n\n(Compiled by Phillip de Wet)\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "The new 2020 Natura collectable silver coin will feature the Coelophysis rhodesiensis dinosaur.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9466/5d84d65ee0b14481879ab685a22fc59d.png", "published_at": "2019-10-11"}