{"pub": "guardian", "url": "https://theguardian.com/culture/2019/oct/10/jimmy-kimmel-trump-impeachment", "downloaded_at": "2019-10-10 18:30:09.112781+00:00", "title": "Jimmy Kimmel: Trump handling impeachment 'about as well as you expect, which is badly'", "language": "en", "text": "Jimmy Kimmel: Trump handling impeachment 'about as well as you expect, which is badly'\n\nJimmy Kimmel\n\nWednesday was “another action-packed day”, said Jimmy Kimmel. “The whistles are blowing, the witches are hunting, but the president keeps on going,” with just two official plans for his Wednesday: a 9am in-house pool call, and a 3.15pm signing of an executive order on transparency in federal guidance and enforcement.\n\n“That was all he had,” Kimmel chuckled. “Otherwise it was just yelling and tweeting and touching himself to Sean Hannity, I guess.”\n\nOverall, “Trump is handling this impeachment crisis about as well as you expect, which is badly,” said Kimmel. “Very, very badly.”\n\nThe president continued to rave frequently on Twitter, including a tweet in which he urged his followers to “read the transcript!” released by the White House of his 25 July phone call with Ukrainian president Volodymyr Zelenskiy. “We did read the transcript, and that’s why you’re in this mess in the first place,” Kimmel responded.\n\nTrump also responded to Turkey’s invasion of northern Syria – the predictable outcome of Trump’s surprise removal of US troops over the weekend, abandoning Kurdish allies – by calling the military advance “a bad idea”.\n\nTrevor Noah: 'Trump can't decline to participate – this isn't the Vietnam war' Read more\n\nKimmel took issue with the description. “The emoji movie was a bad idea,” he said. “This is the beginning of a massacre that he caused. Even his Republican sycophants are furious that he would do this to our allies.”\n\nIn other news Wednesday, former vice-president and Democratic candidate Joe Biden explicitly called for Trump’s impeachment. “Joe Biden let the world know that if you come after his family, he will wait three weeks, formulate a response, and then he will come after you with guns a-blazin,’” said Kimmel.\n\nStill, it’s a “weird” place for the country to be, where “politicians have to call for Trump’s impeachment”, Kimmel continued. “He’s drawing in Sharpie on weather maps, he’s extorting our allies, he’s in bed with Putin, he’s obstructing Congress – calling for him to be impeached, it’s like if there was a rat sitting in the middle of your pizza and you call for it to be removed.”\n\nStephen Colbert\n\nOn the Late Show, Stephen Colbert discussed Trump’s penchant for damaging phone calls, from the one with Zelenskiy to his call with Turkish strongman Recep Tayyip Erdoğan that preceded US withdrawal from northern Syria. “In the end, Trump may be defeated by his greatest weakness: his Achilles mouth,” said Colbert. The spiral is “all detailed in the epic poem: the Idiod.”\n\n“But that’s just the tip of the dumb-berg,” Colbert continued. Trump’s phone calls with foreign aides have long worried aides, leaving them “genuinely horrified”, according to the Washington Post.\n\n“So, these aides were horrified, but they’re just telling us now?” Colbert marveled. “Well it’s like the signs say, if you see something, say something two years after we could do anything about it.” The report characterized one call with Vladimir Putin as “obsequious and fawning”, and revealed another with Chinese President Xi Jinping in which he incessantly discussed chocolate cake.\n\nOne former aide said that during the Obama years, preparation for the calls was taken seriously; under Trump, “it appears to be freestyle and ad-libbed”. Trump is making it up as he goes – “basically doing diplomacy like an improv team,” said Colbert, imitating the process: “I’m about to call a foreign leader – I need a suggestion of a country and something to tariff. Anybody? I heard Switzerland and cuckoo clocks.”\n\nSeth Meyers\n\nOn Late Night, Seth Meyers took a closer look at the Trump administration’s continued stonewalling of the House impeachment inquiry. The inquiry isn’t just an investigation into President Trump, Meyers said. “It’s also a test of our system in which Congress is supposed to be a co-equal branch of the government. And yesterday, the Trump administration did its best to undermine that system by declaring itself above the law.”\n\nTrump submitted a scathing letter to Congress in which he questioned the constitutionality of impeachment and refused to comply with the investigation. “That’s right, President Trump is calling impeachment – a process which is laid out in the constitution – unconstitutional,” said Meyers. “He’s going to be so shocked if he ever reads the constitution one day.”\n\nMeanwhile, on Fox News, a Trump ally told host Jeanine Pirro that in order to stall impeachment, Senate majority leader Mitch McConnell should just change the Senate rules so they’re not required to hold an impeachment trial, regardless of the House investigation’s outcome.\n\n“They literally want to change the rules because they’re losing,” Meyers said. “It’s like if the Jets were down 45-0 at halftime and said: we want to change the rules to let running backs have SUVs.”", "description": "Late-night hosts examined the Trump administration’s stonewalling and Turkey’s invasion of northern Syria", "authors": ["Adrian Horton"], "top_image": "https://i.guim.co.uk/img/media/c560caec727823c859e3fb79b056aa8d478c10ef/109_0_1478_887/master/1478.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=df662c042e2e73a5080dc74ab781a11e", "published_at": "2019-10-10"}