{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/8/davis-helps-weber-state-run-past-cal-poly-41-24", "downloaded_at": "2019-09-08 11:56:46.701610+00:00", "title": "Davis helps Weber State run past Cal Poly 41-24", "language": "en", "text": "OGDEN, Utah (AP) - Josh Davis ran for 129 yards and two touchdowns and Kris Jackson added two short scoring runs to power Weber State to a 41-24 victory over Cal Poly on Saturday night in a nonconference matchup between Big Sky Conference teams.\n\nAfter both teams managed only a first-quarter field goal, Jalen Hamler ripped off a 47-yard TD run to give Cal Poly (1-1) a 10-3 lead with 6:24 left in the second quarter. Jake Constantine connected with Rashid Shaheed for a 20-yard score to pull the Wildcats (1-1) even and Davis scored on a 22-yard run with 26 seconds left in the half to put Weber State up 17-10.\n\nThe Wildcats took the opening possession of the second half and went 75 yards in nine plays with Jackson scoring on a 3-yard run for a 24-10 lead. The Mustangs pulled within 24-17 with 4:12 left in the third quarter when punter Doug Lloyd fumbled in his own end zone and Brandon Davis recovered for the TD. But Josh Davis delivered again with an 18-yard TD run with 24 seconds left in the quarter to stretch the Wildcats’ lead to 14.\n\nJackson’s 1-yard run midway through the final quarter put the game away for Weber State.\n\nKevin Smith rushed for 114 yards on 13 carries as the Wildcats amassed 275 yards on the ground. Constantine completed 17 of 23 passes for 137 yards. Weber State outgained Cal Poly 457-346. Cal Poly’s Hamler was 11-of-14 passing for 182 yards and he rushed for 53 yards and a score on 19 carries.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Josh Davis ran for 129 yards and two touchdowns and Kris Jackson added two short scoring runs to power Weber State to a 41-24 victory over Cal Poly on Saturday night in a nonconference matchup between Big Sky Conference teams.", "authors": ["The Washington Times Http", "Associated Press"], "top_image": "", "published_at": "2019-09-08"}