{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/20190921146/walmart-set-to-stop-sales-of-e-cigarettes-wsj", "downloaded_at": "2019-09-21 07:13:01.042793+00:00", "title": "Walmart Set to Stop Sales of E-Cigarettes — WSJ", "language": "en", "text": "By Daniela Hernandez\n\nThis article is being republished as part of our daily reproduction of WSJ.com articles that also appeared in the U.S. print edition of The Wall Street Journal (September 21, 2019).\n\nAs concerns about the health hazards of vaping mount, a market for illicit cannabis-vaping products and the tools to create counterfeits is thriving online.\n\nOn Instagram, users offer products ranging from cannabis oils to vaping devices and packaging materials. On Amazon.com Inc., third-party sellers hawk empty packaging for vape products, and on Facebook Inc.'s Marketplace, sellers offer vaping products containing tetrahydrocannabinol, or THC, the mind-altering ingredient in cannabis.\n\nThese and other tech companies say they have policies against any illegal or inappropriate sales and do remove offenders from their sites. They say they invest in technology and people to sleuth out illegitimate products.\n\nWeb sales of products used to make cannabis-containing vape cartridges are legal under certain circumstances, but doctors and industry experts warn about the potential health risks from buying such items online, particularly those that end up being counterfeit.\n\nThe federal Centers for Disease Control and Prevention has warned against buying products off the street.\n\nThese days, the street has morphed into a global digital marketplace packed with materials used to manufacture cartridges, also called pods, as well as filled cartridges themselves. This marketplace is increasingly difficult for law enforcement and tech companies to police because of the geographic distribution of users, the number of posts promoting vaping wares and the use of private accounts and messaging apps to sell illicit products, according to licensed sellers and tech companies.\n\nVaping involves inhaling fumes from e-cigarettes or pen-like devices that heat cartridges filled with ingredients including nicotine and THC. Health officials are investigating hundreds of lung ailments linked to vaping in recent weeks. They haven't identified the precise cause, but most of the patients have reported vaping THC. Others say they have only vaped nicotine products.\n\nSo far, the CDC has identified 530 confirmed or probable cases of vaping-associated pulmonary illnesses. There have been eight deaths, with the announcement Thursday of a death in Missouri. The Food and Drug Administration Office of Criminal Investigations is conducting a federal probe, which involves a look into the product-supply chain. An FDA spokesman declined to say whether regulators were looking specifically at online purveyors.\n\nSeveral states, including California, Colorado and Washington, allow licensed retailers to sell THC-containing products for medical or recreational use. But such sales are a federal crime in the U.S., and it is illegal to sell THC-containing products online and to ship these across state lines or internationally.\n\nLicensed THC products in states where sales are legal must go through quality testing. Knockoffs may contain ingredients whose impact is unclear, including pesticides and vitamin E acetate, according to industry experts. Vitamin E acetate, a common additive in lotions, is sometimes used as a filler in THC vape products, and public-health officials have identified it as a potential culprit behind the illnesses.\n\n\"We don't know what the exact ingredients are on the online, unregulated sources,\" said University of Miami School of Nursing and Health Studies epidemiologist Denise Vidot, who studies the health effects of cannabis. People can use fillers that can be harmful, she said.\n\nTests performed by California-based testing lab CannaSafe showed that black-market THC cartridges -- those that don't adhere to any state regulations -- in some cases contained more than 35% vitamin E acetate and tested positive for pesticides, said Aaron Riley, CannaSafe's president. None of the licensed brands tested contained vitamin E acetate or exceeded California's limit for pesticides, he said.\n\nEmpty packaging and vape pods, sold by the thousands, are available on e-commerce platforms including Amazon and China-based Alibaba and DHGate, according to an examination of the sites. Black-market dealers can then fill these with home-brewed THC oils whose ingredients haven't been tested, according to industry officials and testing-lab operators.\n\n\"The resources to make it look like you have a legitimate product are easier to get\" thanks to the internet, said Vlad Valme of Portland, Ore.-based Thompson Duke Industrial, which manufactures vape-pod-filling machines.\n\nMr. Riley said he receives messages on Microsoft Corp.'s LinkedIn offering packaging for THC vape pods and pens. Many accounts list their location as China, a prominent source of counterfeit cannabis-related goods, according to Mr. Riley and other cannabis-industry experts. One such message dated April 12 reviewed by the Journal offered a vape kit that \"can fit Nicsalt/CBD/THC.\" Nicsalt refers to nicotine salts. CBD, or cannabidiol, doesn't create a high, unlike THC.\n\n\"We encourage members to report any message they believe to be inappropriate, illegal or in violation of our policies,\" said Madhu Gupta, LinkedIn's director for product management. The company doesn't monitor private messages, according to a LinkedIn spokeswoman. LinkedIn's advertising policies prohibit ads related to illegal or recreational drugs including e-cigarettes or vaping products.\n\nThe LinkedIn user who offered Mr. Riley the vape kit had multiple public posts and listed a location in China. Posts by other users, also listing locations in China, uploaded photos promoting THC and nicotine pods, plus links to vape pens sold through DHGate and Alibaba, according to a review by the Journal.\n\nAlibaba has long banned the sale of nicotine and other e-liquids, the company said in a statement. \"When such prohibited items are identified, the listings are taken down. The same goes for listings which violate intellectual-property rights,\" the statement said. The company took down listings featuring items that promoted e-liquids and drug-smoking paraphernalia after the Journal inquired about them.\n\nDHGate didn't respond to requests for comment.\n\nOn Instagram, owned by Facebook, users hawk vape pens, empty and filled vaped cartridges, diluting agents and so-called filling guns that can be used to quickly fill cartridges with oils. Some sellers offer world-wide shipping and link to off-platform websites where illicit goods can be purchased, according to a review by the Journal. Direct messaging is used to contact potential customers and providers, according to interviews with licensed sellers who have received offers via Instagram's messaging function.\n\nInstagram's community guidelines prohibit users from \"buying or selling illegal or prescription drugs even if legal in [their] region.\"\n\nOn Facebook, THC-containing vape pods and marijuana have been offered through Marketplace, the social network's online flea market. A recent listing by user Lean Gawd was labeled \"Apple air pods,\" but the photo featured vape cartridges. The seller, who didn't respond to a request for comment via Facebook Messenger, had 10 listings as of Sept. 12 in locations throughout New York state. All were labeled as technology products. One labeled \"GoPro Hero 6\" displayed 13 canisters of different marijuana varieties; another with three THC-containing pods was labeled \"Xbox 1.\" GoPros are portable video cameras. Xbox One is a gaming console.\n\nFacebook took these products down after the Journal's inquiry.\n\nFacebook prohibits \"attempts by individuals, manufacturers, and retailers to purchase, sell, or trade non-medical drugs, pharmaceutical drugs and marijuana,\" according to its community standards. The curation of such content is an issue Facebook takes seriously, though the efforts aren't perfect, a company spokeswoman said.\n\nThe company recently prohibited the sale of alcohol and tobacco products between private individuals through individual posts. In Marketplace or shop sections of Facebook, users can't promote the sale of vaporized delivery devices and e-cigarettes.\n\nOn Amazon.com, third-party sellers sell empty packaging in bulk for vape pods. The boxes sometimes claim the cannabis contents are \"100% lab tested,\" are all natural and don't have fillers. Some are labeled for medicinal use only. During the course of the Journal's review, some products were taken off the site. Others remained but were removed after the Journal flagged those listings.\n\nAmazon doesn't allow \"e-cigarettes or drug paraphernalia in our store and our policy has been in place for many years,\" said an Amazon spokesman. \"We take action on those who violate our policies, including removal of selling privileges and withholding of funds.\" The company uses machine learning to keep prohibited products off the platform, he said.\n\nPortland, Ore.-based True Terpenes, which manufactures terpene blends for cannabis products, said it has been trying to get Amazon to take down copycat versions of its products. Terpenes are the compounds that give cannabis strains their unique flavors. The knockoffs, sold by several sellers, have similar packaging and use some of the same product names as legitimate True Terpenes products. Under the product name, some listings displayed a link that says \"by True Terpenes.\"\n\n\"These are not our products,\" said Ben Disinger, marketing manager for True Terpenes, which doesn't sell on Amazon. \"If it's not sold by us, we can't verify what's inside them.\"\n\nAmazon has removed the look-a-like items. A spokesman said the company prohibits the sale of counterfeit products and investigates claims thoroughly \"including removing the item, permanently removing the bad actor, pursuing legal action or working with law enforcement as appropriate.\"\n\nFanfan Wang contributed to this article.\n\nWrite to Daniela Hernandez at daniela.hernandez@wsj.com\n\n(END) Dow Jones Newswires\n\nSeptember 21, 2019 02:47 ET (06:47 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-21"}