{"pub": "wsj", "url": "https://wsj.com/articles/u-s-stock-futures-retreat-as-oil-prices-jump-11568603822?mod=rsswn", "downloaded_at": "2019-09-16 05:36:35.670187+00:00", "title": "U.S. Stock Futures Retreat as Oil Prices Jump", "language": "en", "text": "U.S. stock futures fell and haven assets like gold and the Japanese yen gained after a weekend attack on Saudi Arabian oil facilities sent crude prices surging.\n\nBrent crude, the global gauge of oil prices, jumped as much as 19.5% to $71.95 a barrel, one of its largest intraday gains in years. By midmorning in Asia on Monday, it was trading up 10.9% at $66.71 a barrel. On Sunday, President Trump said he authorized the release of oil from the Strategic Petroleum Reserve.\n\nS&P 500 futures fell 0.6%. Gold and the Japanese yen, which are often considered haven assets during times of turmoil, edged up.\n\n“If oil prices are out of control, it’s obviously a negative for equities,” said Weiqi Zhu, a fund manager at Gao Zheng Asset Management in Hong Kong. Mr. Zhu said higher oil prices could push up inflation and prompt the Federal Reserve to think twice before cutting rates again. However, he said Mr. Trump’s oil-release authorization helped calm other markets in the short term. A family passes a poster of Saudi Crown Prince Mohammed bin Salman in Jiddah, Saudi Arabia, on Sunday. Photo: Amr Nabil/Associated Press A sustained increase in fuel prices could be the latest threat to a world economy that is already under pressure from the U.S.-China trade war. It could weigh on consumer spending as higher energy prices can raise gas and heating bills, cutting into available incomes. However, regional equity markets proved relatively resilient in early trading. Australia’s S&P/ASX 200 declined 0.2%, while South Korea’s Kospi and the Shanghai Composite Index rose slightly. The Japanese stock market is closed for a holiday. Hao Zhou, a foreign-exchange and emerging markets analyst at Commerzbank in Singapore, said growing optimism over the U.S.-China trade war helped offset the effect of oil market disruption. “In general, the trade talk hope has helped the markets,” he said. “It’s very difficult to project the impact from oil and any short term supply shock.” In Hong Kong, the Hang Seng Index fell 1.1% after another weekend of violent protests, although shares in Chinese oil companies such as Cnooc Ltd. and PetroChina Co. rallied. Kerry Craig, a global market strategist at J.P. Morgan Asset Management, said oil producers could dip into stockpiles, which would help stabilize prices. “The bigger issue is what premium markets will build in to reflect the risk of further attacks,” he said in a note to clients. Related Coverage Crude Prices Soar After Saudi Oil Disruption, Threatening Global Growth\n\nSaudi Arabia Aims to Restore a Third of Lost Oil Output Monday\n\nIran Rejects U.S. Accusations Over Saudi Oil-Facility Attacks The Fed is scheduled to meet this week and markets are pricing in another rate cut of a quarter point. “Central banks are likely to look through the inflationary impacts of higher oil prices but the added geopolitical risk to an already fragile backdrop will not go without notice,” Mr. Craig said. The yield on the 10-year U.S. Treasury note was steady at about 1.9%. Last week it rose the most since June 2013. —Frances Yoon contributed to this article. Write to Steven Russolillo at steven.russolillo@wsj.com\n\nCopyright ©2019 Dow Jones & Company, Inc. All Rights Reserved. 87990cbe856818d5eddac44c7b1cdeb8", "description": "U.S. stock futures fell and haven assets like gold and the Japanese yen gained after a weekend attack on Saudi Arabian oil facilities sent crude prices surging.", "authors": ["Steven Russolillo", "Steven.Russolillo Wsj.Com"], "top_image": "https://images.wsj.net/im-107333/social", "published_at": "2019-09-16"}