{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/27/hernandez-says-farewell-playoff-chasing-as-top-mar", "downloaded_at": "2019-09-27 05:39:35.965060+00:00", "title": "Hernández says farewell, playoff-chasing A's top Mariners", "language": "en", "text": "SEATTLE (AP) - Félix Hernández pitched 5 1/3 innings in likely his final start with the Seattle Mariners after 15 seasons, but it was the Oakland Athletics moving to the brink of clinching an AL wild-card berth with a 3-1 win on Thursday night.\n\nHernández walked off the mound as a Mariner probably for the last time with tears in his eyes. It was a farewell and thank you all wrapped into one as Hernandez’s contract with the Mariners ends after the season and both sides appear ready for a separation.\n\nHe wasn’t the “King Felix” of his dominant years on this night. He was a 33-year-old pitcher looking for one more magical outing to thrill the thousands of fans who turned out for his farewell.\n\nUnfortunately for Hernández, the A’s have something to play for and weren’t willing to go along with festivities. Oakland can clinch one of the two wild-card spots in the AL with a win or Cleveland loss on Friday.\n\nMatt Olson had an RBI single in the first inning and Matt Chapman hit a two-run homer in the second. Sean Manaea (4-1) allowed one run in six innings and Liam Hendriks got his 25th save.\n\nFrom the start, this night was a tribute to one of the Mariners‘ greats, who will be remembered in the same regard as Hall of Famer Edgar Martinez for his loyalty to the franchise and performance on the mound during his best seasons. He brought Seattle a Cy Young Award and a perfect game.\n\nMore so, Hernández had chances to leave and never did, which made the night so emotional.\n\nThe 10,000 fans of the “King’s Court,” clad in yellow on three levels down the left-field line rose with every two-strike count, chanting, willing, hoping for a Hernández strikeout. It happened for the first time in the second inning when Sean Murphy went down swinging and Hernandez immediately pointed to his court, acknowledging their influence.\n\nHe repeated the act in the third inning on Chad Pinder’s swinging strikeout to end the inning, and he got Seth Brown swinging for the second out of the fifth with two runners on.\n\nHernández walked Jurickson Profar on his 100th pitch of the night to load the bases. Manager Scott Servais made a quick visit to the mound to a chorus of boos hoping to see Hernández at least finish the inning. Hernandez stayed but his 101st pitch was a deep line drive off the bat of Pinder. Left fielder Dylan Moore raced back and made a leaping, sprawling grab to end the inning.\n\nIt didn’t change the final outcome. But it made Hernández’s final line look better and gave everyone in the ballpark an extra highlight to a memorable night.\n\nHernández took the mound for the sixth and got Robbie Grossman to fly out to center field. That was it. Servais came to the mound and gave Hernández a hug. He exchanged a long hug with Kyle Seager, his longest teammate with the Mariners, gave a round of hugs to the rest of the infielders and walked off with tears in his eyes.\n\nHe pointed around the stadium, came out for a curtain call took a bow and tapped his heart.\n\nAfter the final out, he put on one of the yellow “King’s Court” shirts and went down to shake hands, wave to fans in “his” cheering section and pose for pictures.\n\nKINGLY NUMBERS\n\nHernández is Seattle’s all-time leader in wins (169), strikeouts (2,524), innings (2,729 2/3), quality starts (258) and games started (418). He’s also one of two players to have played at least 15 seasons with the Mariners, joining Martinez who spent 18 seasons with Seattle. He made his debut at 19 and, despite his brilliance, never made it to the postseason.\n\nTRAINER’S ROOM\n\nAthletics: Oakland got a boost by activating OF Stephen Piscotty off the 10-day injured list on Thursday after missing more than a month with an ankle injury. The A’s hope to get Piscotty a handful of at-bats this weekend. … Manager Bob Melvin said Mark Canha was feeling better after leaving Wednesday’s game against the Angels early due to a groin strain. Canha did some running before the game and was day-to-day.\n\nUP NEXT\n\nAthletics: RHP Mike Fiers (15-4, 3.91) makes his final start before a potential wild-card game. Fiers already has a career-high in wins, but has a 6.68 ERA in his past seven starts.\n\nMariners: LHP Justus Sheffield (0-1, 6.10) makes his seventh and final start. He’s lasted only 4 1/3 innings in each of his past two starts.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Félix Hernández pitched 5 1/3 innings in likely his final start with the Seattle Mariners after 15 seasons, but it was the Oakland Athletics moving to the brink of clinching an AL wild-card berth with a 3-1 win on Thursday night.", "authors": ["The Washington Times Http", "Tim Booth"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/27/aptopix_athletics_mariners_baseball_48386_c0-208-4971-3106_s1770x1032.jpg?0aa2061bd09fdd4776efb4ddaf81f2476a3e0224", "published_at": "2019-09-27"}