{"pub": "businessinsider", "url": "https://businessinsider.com/ipg-ceo-michael-roth-says-company-will-beat-wpp-publicis-2019-9", "downloaded_at": "2019-09-10 23:33:44.631368+00:00", "title": "Why IPG CEO Michael Roth thinks his holding company is better positioned than bigger rivals to withstand the assault on ad agencies", "language": "en", "text": "As the world's top advertisers continue to cut their budgets and take marketing in-house while seeking cheaper alternatives to the bloated agencies of decades past, Michael Roth, chairman and CEO of holding company giant IPG, said his organization is more prepared than its larger rivals to weather the storm.\n\nIn his first interview since shaking up company leadership this week, Roth also spoke to Business Insider about the benefits of promoting from within in an apparent dig at competitors like WPP and Publicis, both of which have had negative organic revenue growth in recent quarters.\n\nRead more: Accenture Interactive just bought Droga5, right after a top exec at the firm said it's 'just getting started' in its plan to disrupt advertising\n\nRoth said IPG got a head start on its rivals in restructuring\n\nIPG, currently the world's fourth largest advertising holding group, named 17-year veteran Philippe Krakowsky to the newly-created chief operating officer role, putting him on track to succeed Roth. It also promoted two executives, Daryl Lee and Eileen Kiernan, to lead IPG Mediabrands, the media planning and buying network that has become its most important division.\n\nKrakowsky has long been seen as the favorite to step into Roth's role, and the CEO spoke with unusual candor to support that claim. Roth, who at 73 is less than two years away from reaching the retirement age suggested by the board's guidelines, told Business Insider \"there's no question\" that the promotion \"certainly puts [Philippe] in a favorable position.\"\n\nHolding companies are struggling to adjust to clients' demands for faster, cheaper work. Roth suggested IPG is better positioned than its bigger competitors because it got its house in order after 2005, when it faced negative margins and an SEC investigation into allegations of fraudulent accounting that led to a $12 million fine.\n\n\"We had to take a look at the entire company,\" Roth said. \"A number of the CEOs had to be replaced; we disposed of over 50 locations and businesses in the first year.\"\n\nAround the same time, IPG developed an \"open architecture\" strategy that has multiple agencies working on one account. Roth said this approach gives the company an advantage over WPP and Publicis Groupe, which often combine organizations to form a single unit dedicated to clients like Ford and Walmart.\n\nRoth said IPG had an advantage in promoting from within\n\nWPP recently responded to shrinking ad budgets and investor uncertainty by merging digital agencies VML and Wunderman with traditional creative shops Y&R and JWT to form VMLY&R and Wunderman Thompson. Two IPG executives told Business Insider that they've heard rumors of similar unions at IPG, but Roth wouldn't directly address those claims.\n\nRoth also took an indirect jab at his rivals in discussing his support for promoting Krakowsky from within.\n\nOn the risks of leadership changes, Roth said, \"I think you've seen it in our sector. You either bring in someone from the inside who's just been put through the ringer, or you bring in someone who's not familiar with the company — and that's a more difficult task.\"\n\nWPP's former CEO Martin Sorrell resigned after The Wall Street Journal and The Financial Times reported on allegations that he created a \"toxic environment\" and used company money to solicit a prostitute, while MDC Partners appointed former political strategist Mark Penn as chief executive when his firm Stagwell Partners acquired a $100 million minority stake in the business last year. (Sorrell has repeatedly denied those claims.)\n\nKrakowsky's trajectory dates back to 2005\n\nRoth said succession planning has been a key part of his leadership strategy, which began right after he took charge in 2005. Krakowsky played a key role in the talent reviews that determined which executives got promotions and which were let go, and he also helped IPG's agencies grow their digital chops as he moved into the chief strategy and talent officer role. To give him more operating experience, Roth said he put his mentee in charge of Mediabrands in 2016.\n\nRoth and Krakowsky's relationship deepened over the years as they worked to reconstruct a nearly broken business. As of 2018, IPG brought in an estimated $9.7 billion from clients such as Amazon, Microsoft, and Taco Bell, and the challenger group has outperformed rivals in recent quarters, even after losing several major accounts including U.S. Army and Fiat Chrysler.\n\nKrakowsky's trajectory became clearer over the past 12-18 months as he oversaw the $2.3 billion acquisition of consumer database company Acxiom, current and former execs said. Roth has credited that move with helping the company win new business and said it proved Krakowsky's worth.\n\nOther executives including Harris Diamond, CEO of McCann Worldgroup, reportedly vied to be Roth's heir apparent. A McCann spokesperson declined to comment.\n\nMore strategic shifts to come\n\nSeveral sources said they expected Krakowsky to become CEO in the next year, describing him as a networking expert with greater insight into agency operations than anyone other than Roth himself.\n\nAsked if he has any regrets about leadership decisions over the past decade and a half, Roth said, \"I replaced 70% of the management in the company, and I've made a few mistakes in picking people to run businesses. The best thing I can do if I make a mistake is [to] change it.\"", "description": "IPG chairman and CEO Michael Roth announced new leadership this week and made the case for why his company can beat larger holding companies like WPP.", "authors": ["Patrick Coffee"], "top_image": "https://amp.businessinsider.com/images/5d77d51a2e22af01fd21bfb8-1136-568.jpg", "published_at": "2019-09-10"}