{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7566887/Baroness-Hale-unlikely-star-new-childrens-book.html", "downloaded_at": "2019-10-13 00:30:47.444563+00:00", "title": "Baroness Hale becomes the unlikely star of new children's book", "language": "en", "text": "Baroness Brenda Hale has become the unlikely star of a new children's book\n\nAt first glance, it has all the makings of a modern children's classic.\n\nA plucky heroine from a little-known backwater battles against the odds to right injustice, attracting universal acclaim.\n\nShe is wise, she is good and, importantly, she is always right.\n\nAnd no wonder.\n\nFor the crusading protagonist putting the world to rights in this bedtime tale is none other than Britain's most senior judge, Baroness Brenda Hale, president of the Supreme Court.\n\nLady Hale, of course, is one of the most controversial figures in the Brexit crisis after ruling last month that Prime Minister Boris Johnson's prorogation of Parliament was unlawful.\n\nBut here, in a new book, the 74-year-old is drawn in rather more cuddly fashion – as a twinkly-eyed, indulgent grandmother figure whose legendary status means awestruck children regard meeting her as a treat 'better than chocolate cake'.\n\nAs anyone with children will know, this stretches the bounds of credibility.\n\nYet the message of the book is clear: Lady Hale is to be viewed as an inspirational role model by children who barely understand the concept of a law court, let alone aspire to a career in one.\n\nLady Hale has tended to enjoy the spotlight throughout her career. And after the prorogation decision that humiliated Boris Johnson, she was turned into a poster girl for Remainers overnight.\n\nIt is titled Equal To Everything as a reference to the Latin motto Lady Hale chose for her coat of arms when she was appointed the country's first female Law Lord in 2004\n\nIn the ensuing marketing frenzy, merchandisers began branding T-shirts and caps with the unusual spider brooch she had worn on her shoulder to make the judgment.\n\nWhile she insisted at the time she was 'above politics' and 'only focused on the law', she has since been accused of anti-Boris bias after appearing at a schools' conference to deliver a speech in which she hailed 'girly swots' in front of a backdrop that read 'Spider woman takes down Hulk'.\n\nThe book – which had her co-operation and which was launched at the Supreme Court this week – suggests she is eager to enhance her public reputation still further.\n\nPublished by the Left-wing charity Legal Action Group (LAG) and written by Guardian columnist and former barrister Afua Hirsch, the book is set to be distributed to all schools in Derbyshire by Christmas thanks to a local law firm, and a crowdfunding campaign hopes to ensure it ends up in every primary school in the country.\n\nLAG has said it wants to 'maximise' coverage.\n\nThe book's title, Equal To Everything, is a reference to the Latin motto Lady Hale chose for her coat of arms when she was appointed the country's first female Law Lord in 2004: 'omnia feminae aequissima', or 'women are equal to everything'.\n\nThe book release, which enjoyed the Baroness's co-operation, suggests she is eager to enhance her public reputation still further\n\nThe target audience of seven-year-olds who may not be used to the earnest, cloying style\n\nBut her opponents have greeted the book's publication with dismay, suggesting that it is crude propaganda reminiscent of the old Soviet Union.\n\nThe latest decision of the Supreme Court on Brexit is not included, but it will not escape Baroness Hale's critics that neither Ms Hirsh, nor the book's illustrator Henny Beaumont, have made any secret of their pro-Remain views.\n\nThe real test, however, will be the response of the target audience of seven-year-olds who may not be used to the earnest, cloying style.\n\nThe story begins in Baroness Hale's well-heeled North Yorkshire home town of Richmond.\n\nThere a little girl, Ama, is starting at a new school where her teacher announces that the class will visit London's landmarks. These will include the Supreme Court, 'led by a woman called Brenda Hale, who's from Richmond just like you!'\n\nThe book is impeccably diverse, featuring children from different ethnic backgrounds – even though the population of Richmond is more than 95 per cent white.\n\nShe was recently accused of an anti-Boris bias after appearing at a schools' conference to deliver a speech which she delivered in front of a backdrop that read 'Spider woman takes down Hulk'\n\nAfter Ama rushes home full of excitement, her mother describes her own encounter with Lady Hale – a real 2007 case when dinner ladies fought for equal pay with male colleagues.\n\nThe local council in St Helens, Merseyside, warned the women involved of 'dire consequences' if they continued their legal fight.\n\nLady Hale, part of a panel of judges, upheld an employment tribunal ruling that the woman, apparently including Ama's fictional mother, had been victimised.\n\nThis might seem dusty fare for the average primary-school child, but Ama seems impressed.\n\nDuring their visit to the capital a few weeks later, the children are told to expect 'a treat' – which turns out to be the arrival of the septuagenarian judge.\n\nThe authors explain in breathless rhyming couplets: 'Just then, a kind-looking lady walked in, lifting Miss Evans' frown / It was Lady Hale herself! Come to meet the kids from her home town.\n\n'The children had heard so much of her and the decisions that she makes / Meeting her in real life was even better than chocolate cake.'\n\nThe book continues with an indulgent and patient Lady Hale, whose eyes 'sparkle', describing her career trajectory, with a nod to some of her most high-profile successes.\n\nThese include the implementation of the 1989 Children Act she helped draft, 'that says when adults row/it's children's health and happiness that matters most now' and an immigration case in which a Tanzanian woman, a mother of two British-born children, was not deported because, Lady Hale tells the class, 'children shouldn't suffer for adults' mistakes'.\n\nThe pupils are shown listening intently to her tales of professional triumph, apparently without boredom or complaint – even when the narrative moves to a case involving incontinence pads.\n\nThe book later contains an illustration of Lady Hale in a boxing ring, landing a punch to the chin of a fellow male judge.\n\nNext to it, Lady Hale sets out her feminist views, saying: 'I've seen women held back by unfairness in their lives and their careers / I was the first woman on this court, the only one for many years.\n\n'I see things a bit differently, and I'm not afraid to say / If more girls become judges, the law will improve along the way.'\n\nThe book was made in collaboration with Lady Hale. Acknowledgements not only confirm her 'support and encouragement' for the story, but that she gave her time 'willingly' during its production.\n\nShe said: 'It's been an amazing life and I'm thrilled at the idea of making it into a picture book to entertain and inspire young people.'\n\nBut not everyone agrees. Former Tory leader Iain Duncan Smith described the book as nothing short of 'propaganda'.\n\nHe told The Mail on Sunday: 'The more that it becomes evident that the support group for Baroness Hale is mostly made up of people who are mad for Remain and people way out on the Left, it makes you question the independence of her judgment, particularly given the last case.\n\n'This looks like deliberate propaganda to bend the minds of children, which is quite wrong. It is almost laughable this kind of adulation takes place – but also dangerous.'\n\nTory MP Andrew Rosindell accused Lady Hale of 'relishing the publicity' and questioned her position on the 'intensely political' Supreme Court.\n\n'It is absolutely inappropriate for someone in her position to behave in this way,' he said. 'I think it is sinister. She is being painted into some kind of superhero in this book aimed at children – which is completely and utterly wrong.'\n\nLeft-wing writer Hirsch has made no secret of her disdain for Brexit and Mr Johnson, while illustrator Beaumont also tweets in support of Remain. One of her cartoons showing the Prime Minister being breast-fed by Donald Trump was published by the Communist Morning Star newspaper\n\nThe Supreme Court insisted that the book is not designed to portray Lady Hale as a 'superhero' but to 'introduce important concepts of justice, fairness, equality and decision-making to children in a fun and interesting way.\n\nIt also aims to encourage children to believe they can reach the top of whatever profession they choose'.\n\nThe LAG, an independent charity, says its purpose 'is to promote equal access to justice for all members of society who are socially, economically or otherwise disadvantaged.'\n\nOne of its patrons is Labour Baroness Helena Kennedy, while a sponsor is Matrix Chambers, the law firm co-founded by former Prime Minister Tony Blair's wife Cherie.\n\nBaroness Kennedy last year described Brexit as 'a disaster for the law and a disaster for women'. She also described Brexiters as 'fundamentalists' and added: 'The mad Brexiters have common things about them, almost invariably: they don't like homosexuals, they don't like foreigners and they hate human rights.'\n\nThere is little doubt that Baroness Hale has become one of the LAG's heroes.\n\nIn a tweet, its interim director, Carol Storer, implied the Supreme Court ruling was 'stunning', writing: 'Gasps here at Legal Action Group as Lady Hale reads out the unanimous judgment in [the] Supreme Court – eleven nil.'\n\nThe book was funded by donations from individuals and a grant from a trust run by Swedish philanthropist Sigrid Rausing, owner of Granta literary magazine and daughter of the late billionaire Hans Rausing, who ran the packaging company Tetra Pak.\n\nToby Young, who founded several free schools, said: 'If school libraries are going to stock a book about Lady Hale, they should also stock one by her equivalent on the other side of the Brexit debate, Nigel Farage.'", "description": "The new book, Equal to Everything, refers to the Latin motto on Lady's Hale's coat of arms which says 'women are equal to everything'. Lady Hale is portrayed as a tender figure that children love.", "authors": ["Ben Lazarus For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/23/19638386-0-image-a-170_1570919675803.jpg", "published_at": "2019-10-12"}