{"pub": "breitbart", "url": "https://breitbart.com/2020-election/2019/10/23/pete-buttigieg-ive-smoked-marijuana-a-handful-of-times", "downloaded_at": "2019-10-24 02:29:33.415916+00:00", "title": "Pete Buttigieg: I’ve Smoked Marijuana ‘a Handful of Times’", "language": "en", "text": "LAS VEGAS (AP) — Democratic presidential candidate Pete Buttigieg said Wednesday that he’s used marijuana “a handful of times a long time ago,” and that it’s time for the U.S. to legalize marijuana.\n\nButtigieg, speaking to reporters after touring a legal pot dispensary in suburban Las Vegas, was asked about whether he’d ever used marijuana.\n\n“I have. A handful of times a long time ago,” he said. He added that he knows people whose lives have been “shaken” by its criminalization and the so-called “war on drugs.”\n\nButtigieg said people still have an image of the marijuana industry and dispensaries that’s based on outdated stereotypes.\n\n“When you go into a place like this, it almost reminds you of an Apple store how tidy and carefully it’s laid out, knowledgeable employees and a legitimate business that still struggles because federal policy hasn’t caught up,” he said.\n\nThe mayor of South Bend, Indiana walked through the dispensary with the shop’s owners and shook the hands of several employees.\n\nAs a pungent, herbal scent hung in the air and three workers nearby bundled and labeled pairs of joints, Buttigieg asked about the testing of products and difficulty of banking.\n\nNevada, which legalized marijuana in 2017, is among the states that’s struggled to find a way to process pot business transactions. Most banks won’t do business with the cash-heavy industry because the drug is still considered illegal by the federal government.\n\n“They have to do so much with cash that doesn’t really make sense,” Buttigieg said.\n\nHe said the criminalization of drugs, particularly marijuana, has failed. He said the U.S. also needs to expunge marijuana convictions, especially because they’ve disproportionately affected minorities and ruined lives.\n\nThe mayor, a military veteran, said he’s met a lot of other veterans who rely on cannabis for treating issues connected to their service like post-traumatic stress disorder. He said any “legitimate medical use” of cannabis should be covered by health insurance like any other therapy.\n\nButtigieg did not purchase any products at the shop, joking “I’m on the clock and it’s going to be a long work day for me.”", "description": "LAS VEGAS (AP) — Pete Buttigieg said he’s used marijuana “a handful of times a long time ago,” and that it’s time to legalize marijuana.", "authors": ["Breitbart News"], "top_image": "https://media.breitbart.com/media/2019/05/GettyImages-1149616734-640x335.jpg", "published_at": "2019-10-23"}