{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-news-boris-johnson-deal-dup-nigel-dodds-ireland-a9153631.html", "downloaded_at": "2019-10-13 00:22:52.672773+00:00", "title": "Boris Johnson’s hopes of Brexit deal dealt blow after DUP deputy leader warns proposal ‘cannot work’", "language": "en", "text": "Boris Johnson‘s hopes of securing a Brexit deal have been dealt a blow after the DUP‘s deputy leader warned that the plan reportedly being considered by UK and EU officials “cannot work”.\n\nNigel Dodds, who also serves as the party’s Westminster leader, dismissed any suggestion that Northern Ireland could in effect remain in the EU’s customs union when the rest of the UK leaves.\n\nSuch an outcome is reported to be a key part of the plan being discussed during intense talks in Brussels over the weekend.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt emerged following talks between Mr Johnson and his Irish counterpart, Leo Varadkar, on Thursday, after which the EU agreed to intensify negotiations.\n\nMr Johnson is reported to have made significant concessions on the issue of customs after Brexit, most likely by resurrecting Theresa May’s proposal for a “customs partnership” between the UK and EU as an alternative to the controversial Northern Ireland backstop.\n\nThis would involve Northern Ireland applying the same customs as the EU, thus removing the need for customs checks on the Irish border, but with the collection of tariffs being managed by the UK. Northern Ireland would also be part of any trade deals the UK signed with other countries.\n\nMr Johnson is almost certain to need the DUP’s ten votes in the House of Commons to get any deal through parliament, and a number of Tory Eurosceptics are likely to take their lead from the Northern Irish party.\n\nBut Mr Dodds told Italian newspaper La Repubblica: “Northern Ireland must stay in a full UK customs union, full stop.\n\n“There is a lot of stuff coming from Brussels, pushed by the Europeans in the last hours, but one thing is sure: Northern Ireland must remain fully part of the UK customs union. And Boris Johnson knows it very well.”\n\nHe added: “It cannot work because Northern Ireland has to remain fully part of the UK customs union.”\n\nShape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty\n\nMr Dodds also said a tweet posted on Friday by Tory Brexiteer Owen Paterson was “absolutely right”.\n\nThe tweet read: “Northern Ireland being held in the customs union without Great Britain is an obvious breach of the principle of consent in the Belfast Agreement. This would stir up problems in Northern Ireland long after Brexit is resolved.”\n\nUK and EU officials are locked in a talks in a last-ditch bid to secure a deal before the 31 October Brexit deadline. If an agreement is reached, it would likely be finalised at a crunch European Council summit on Thursday and Friday.", "description": "Boris Johnson‘s hopes of securing a Brexit deal have been dealt a blow after the DUP‘s deputy leader warned that the plan reportedly being considered by UK and EU officials “cannot work”. Nigel Dodds, who also serves as the party’s Westminster leader, dismissed any suggestion that Northern Ireland could in effect remain in the EU’s customs union when the rest of the UK leaves.", "authors": ["Benjamin Kentish"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/03/15/17/Nigel-Dodds.jpg", "published_at": "2019-10-12"}