{"pub": "cnn", "url": "https://cnn.com/2019/09/23/politics/us-oas-venezuela-pressure/index.html", "downloaded_at": "2019-09-24 01:09:11.192427+00:00", "title": "US and Latin America move to keep spotlight and pressure on Venezuela", "language": "en", "text": "Washington (CNN) The US is making a push for new international sanctions against Venezuela, a senior State Department official said Monday, as Latin American states voted to pursue and possibly extradite regime leaders.\n\nThe US wants to get more countries, and the European Union in particular, to impose sanctions on the embattled regime of President Nicolas Maduro and keep Venezuela in the spotlight as the world gathers for the United Nations General Assembly , the State Department official said.\n\n\"We want to make sure the issue of a transition in Venezuela remains very high on the international agenda,\" a State Department official said Monday. \"There have been moments ... in the last six months, where people have said, 'Oh, the (administration) isn't paying attention to Venezuela.' That's wrong, that is always wrong. ... On the contrary, it is going to come up a lot this week.\"\n\n\"We're also asking the EU to impose the kind of sanctions that we have, that Brazil has, that Canada has,\" said the official, who spoke on background.\n\nThe official spoke shortly before the Organization of American States voted to invoke a treaty of mutual assistance that hasn't been triggered since the terrorist attacks of September 11, 2001, part of the effort to increase pressure on the Maduro regime. A Wednesday meeting of heads of government will also focus on Venezuela, the State Department official said.\n\n'Concerted action'\n\nThe Trump administration's overall goal at the UN General Assembly \"is to get concerted action,\" said the State Department official, who added that the prospect of talks with the Maduro regime seemed remote.\n\n\"Could people get back to the table? My answer is yes, but only if there's a clear signal on the part of the regime that there's a clear interest in getting back\" to a political transition, which to date, hasn't been seen, the official said.\n\nThe Organization of American States met later Monday to invoke the Rio Treaty, which includes an article that states an attack against one is to be considered an attack against all. The State Department official said the treaty functions as \"a very useful coordinating mechanism for the economic and diplomatic pressures and sanctions we'd like to see more countries impose.\"\n\nIn a 16-1 vote, the OAS agreed it would work to pursue, prosecute and extradite officials in the Maduro government guilty of corruption, egregious human rights abuse, drug trafficking and belonging to transnational criminal organizations.\n\nUnder the agreement, they could be pursued and prosecuted in all 16 countries. Uruguay was the sole vote against, while Cuba was absent and Trinidad and Tobago abstained.\n\n'Bellicose moves'\n\nSecretary of State Mike Pompeo laid the groundwork for invoking the Rio Treaty on September 11, when he made the case that Venezuela is a regional threat.\n\n\"Recent bellicose moves by the Venezuelan military to deploy along the border with Colombia as well as the presence of illegal armed groups and terrorist organizations in Venezuelan territory demonstrate that Nicolas Maduro not only poses a threat to the Venezuelan people, his actions threaten the peace and security of Venezuela's neighbors,\" Pompeo said. \"Catastrophic economic policies and political repression continue to drive this unprecedented refugee crisis, straining the ability of governments to respond.\"\n\nThe State Department official said Monday that the Rio Treaty would help countries establish the legal basis to impose sanctions against the Maduro regime.\n\nA number of countries don't have the domestic laws in place to justify the imposition of sanctions, the official said. Signing the treaty would give those countries the legal authority to do so. \"They'll be able to say they're bound by the Rio Treaty. Once you sign a treaty it becomes the binding law of the land,\" the official said.\n\n'Narco-terrorists'\n\n\"If the meeting of ministers adopts a proposal to restrict travel by regime big shots ... then they would have a legal basis for implementing that in each of the countries that is a signatory. ... it's likely to lead to a wider imposition of sanctions,\" the official said.\n\n\"Our goal is to move more countries to the imposition of sanctions, which we think has a really significant economic and psychological effect on the regime,\" the State Department official added.\n\nSpeaking at the OAS meeting later Monday, Colombian Foreign Minister Carlos Trujillo said invoking the treaty would make any action or sanction decided on in the gathering \"legitimate under international law.\" It is the \"only inter-American instrument that gives us the legal instrument to take actions ... to protect democracy, peace and stability in the region,\" Trujillo said.\n\nBrazil's Foreign Minister Ernesto Araújo said that Maduro has made the country a haven \"for all types of organized and transnational crime\" and \"narco-terrorists.\"\n\n\"They transformed the nation on the part of crime,\" Araújo said through a translator, calling it \"another aspect of the nightmare Venezuelans are going through.\" Brazil has opened its doors to Venezuelan refugees, Araújo said, but \"it is clear that the final solution for the Venezuelan tragedy necessarily means Venezuela returns to democracy.\"\n\nThe State Department official emphasized that the battle against Maduro is broader than a US-Venezuela standoff.\n\n'Very unseemly'\n\n\"Some people cast this struggle as a struggle between the United States and the Maduro regime, which it is not, it's really a struggle between the people of Venezuela and the Maduro regime,\" the official said.\n\nThe official refused to say whether the OAS move would result in the closing of Venezuela's air space or to discuss other potential steps the group could take, but said that the Trump administration is committed to increasing the pressure on Maduro.\n\nPart of that is having Europe step up, the official said.\n\nThe EU has prepared and could impose a set of sanctions directly related to the torture and death of Venezuelan Navy Captain Rafael Acosta , who was allegedly tortured to death after being imprisoned for conspiring to overthrow Maduro.\n\n\"Then we would like to see sanctions that affect broader targets in the regime,\" said the State Department official.\n\nSpeaking of Europe, the official added that, \"I think we all agree their mechanisms are slow,\" but the US hopes to \"see movement in October\" against Maduro.\n\nAs part of that, the US would like to see the EU ensure that Venezuelans political elites can't use the continent as a place to hide or keep their families and wealth. \"We think there's something very unseemly about allowing Europe to become a resort\" for the country's bigwigs and their families, the official said.", "description": "The US is making a push for new international sanctions against Venezuela, a senior State Department official said Monday, as Latin American states voted to pursue and possibly extradite regime leaders.", "authors": ["Nicole Gaouette"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190806070320-juan-guaido-super-tease.jpg", "published_at": "2019-09-23"}