{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/nurmagomedov-calls-mcgregor-an-alcoholic-and-a-rapist-2019-10", "downloaded_at": "2019-10-20 12:34:30.995069+00:00", "title": "Khabib Nurmagomedov calls Conor McGregor an alcoholic and a rapist, reigniting an ugly UFC feud on Twitter", "language": "en", "text": "Conor McGregor and Khabib Nurmagomedov have reignited their ugly feud on Twitter.\n\nThe Irish striker told the Dagestan wrestler he'd see him in Moscow, calling him a \"p----,\" to which Nurmagomedov replied saying the city does not welcome \"rapists.\"\n\nThe war of words follows a New York Times article published Saturday, in which it was said McGregor was facing a second sexual assault investigation in Dublin.\n\nThe former UFC champion's publicist says the fighter denies any report accusing him of sexual assault.\n\nIt is not the first time their trash talk has escalated.\n\nVisit Business Insider's homepage for more stories.\n\nConor McGregor told Khabib Nurmagomedov that he would see him in Moscow, calling him a \"p----,\" to which the Dagestan wrestler replied on Twitter saying the city does not welcome \"rapists.\"\n\nThe tweets reignite one of the UFC's ugliest feuds and follows a New York Times article published Saturday, in which it was said McGregor was facing a second sexual assault investigation in Dublin. The former UFC champion's publicist has said the fighter denies any report accusing him of sexual assault.\n\nIt social media feud began when the UFC president Dana White told the Boston Globe that McGregor \"isn't the man anymore.\"\n\nWhite said Nurmagomedov, the lightweight champion, \"is the man\" and therefore the one who gets to call the shots in that division.\n\nMcGregor subtweeted White on Saturday, asking: \"Who's not the man? Your man had that marquee event did he?\" — a reference to his own landmark crossover boxing rules bout against Floyd Mayweather in 2017.\n\nMcGregor then tried to ridicule Nurmagomedov's last fight, his UFC 242 victory over Dustin Poirier in Abu Dhabi last month. \"More like an event in a marquee. A tent in the f------ sand it was.\"\n\nThe post sparked a series a tweets between McGregor and Nurmagomedov, as the Dagestan wrestler replied to McGregor to call him an alcoholic, according to a translation of the post by the state propaganda outlet, Russia Today.\n\n\"This is a fiasco, alky [alcoholic],\" Nurmagomedov said.\n\nThe translation was also reported by the British tabloid the Mirror.\n\nIn Russian, McGregor reportedly said, \"See you in Moscow, p----,\" according to RT and the Mirror.\n\nTo which Nurmagomedov responded by saying, \"In Moscow they aren't waiting for rapists.\"\n\nMcGregor ended the communication by posting a photograph of himself apparently at a Russian Visa center.\n\nIt is not the first time their trash-talk has escalated\n\nNurmagomedov conclusively defeated McGregor by fourth round submission at UFC 229, last year. But the victory did nothing to end their rivalry, as Nurmagomedov refused to celebrate and instead jumped over the fence and charged at McGregor's cageside friend Dillon Danis.\n\nWhile that was going on, members of Nurmagomedov's entourage invaded the Octagon and exchanged punches with McGregor. Nurmagomedov and McGregor were both subsequently slapped with suspensions.\n\nThey also engaged in another Twitter feud earlier this year, when McGregor tweeted then deleted a photograph of Nurmagomedov on his wedding day, calling his wife \"a towel.\" Nurmagomedov responded by calling him a \"rapist.\"\n\nThe UFC boss Dana White slammed the war of words, calling it \"unacceptable.\"\n\nRead more: 'Somebody's going to end up hurt or shot' if the Khabib Nurmagomedov and Conor McGregor rivalry escalates, UFC fighter says\n\nNurmagomedov later said McGregor was a \"lowlife\" who was loud on social media but silent when he gets punched in the face.\n\nMcGregor is desperate to fight Nurmagomedov again\n\nMcGregor has not won a UFC bout since 2016 but is desperate to rematch Nurmagomedov, according to White.\n\nNeither fighter currently has an opponent lined up, though Nurmagomedov is supposedly set to return to the UFC Octagon in March or April next year, probably against Tony Ferguson.\n\nMcGregor, meanwhile, has been linked with a UFC return against the American wrestler Frankie Edgar.\n\nRead more:\n\nConor McGregor's coach still thinks he's the best fighter in the world despite his heavy beating by Khabib Nurmagomedov\n\nKhabib Nurmagomedov doesn't even have a fight scheduled but is keeping fit by swimming against the tide in a cold river in Dagestan\n\nConor McGregor is linked with comeback bouts against 4 fighters only weeks after being considered an 'irrelevant' has-been\n\nAn Irish boxer is challenging Conor McGregor to 'stay sober' long enough so they can end their war of words and fight for a world title\n\nTake a look inside the new and improved Straight Blast Gym where John Kavanagh trains Conor McGregor and James Gallagher", "description": "Conor McGregor tweeted, 'See you in Moscow, p----' to Khabib Nurmagomedov, who replied: 'Moscow doesn't wait for rapists.'", "authors": ["Alan Dawson"], "top_image": "https://image.businessinsider.com/5bd18dc29e1e110f8318d6c6?width=1200&format=jpeg", "published_at": "2019-10-20"}