{"pub": "cbc", "url": "https://cbc.ca/news/canada/edmonton/greta-thunberg-edmonton-alberta-counterprotest-1.5324949", "downloaded_at": "2019-10-18 01:07:08.910932+00:00", "title": "Alberta truck convoy plans counter-protest to climate rally with Greta Thunberg | CBC News", "language": "en", "text": "A group of oil and gas supporters is planning a counter-rally when Swedish climate activist Greta Thunberg shows up at the Alberta legislature in Edmonton on Friday.\n\nGlen Carritt, who organized the United We Roll convoy that travelled to Ottawa in February, said a similar convoy will start in Red Deer, Alta., on Friday morning and make its way to Edmonton.\n\nCarritt said the trucks are expected to arrive at the legislature at noon MT, when a climate rally is to begin with Thunberg, 16, who founded the Fridays For Future climate strikes that have galvanized young people around the world.\n\nHe said Albertans in the oil and gas sector are frustrated with celebrities visiting the province and telling them how to run their business.\n\n'Tired of celebrities'\n\n\"We in the province of Alberta are tired of celebrities coming into our province and trying to tell us how to run our oil and gas sector,\" read a post on the United We Roll Facebook page.\n\n\"I am asking everyone connected to the oil and gas industry to come out in unity to show Greta we do not need her yelling at us.\"\n\nThunberg has been making international headlines, meeting with politicians and leading protests demanding governments take action to address climate change.\n\nThe Swedish teen was spotted on Stephen Avenue in downtown Calgary on Wednesday morning.\n\nShe told a Radio-Canada reporter who saw her that she had no public events planned in Calgary and would travel to Edmonton within hours.\n\nAlberta Premier Jason Kenney said Thunberg has not asked for a meeting. He has scheduled a visit Friday to a power plant near Edmonton that is switching from coal to cleaner natural gas.\n\nKenney said he hopes Thunberg recognizes efforts made by the province's oil and gas industry to reduce its emissions.\n\nHe said the world continues to depend on fossil fuel energy, and it's better that Canada supply it rather than countries such as Saudi Arabia or Russia.\n\n\"I'd hold out hope that anybody would be willing to look at the objective data, which is that Alberta has the highest environment, human rights and labour standards of any other major energy producer on Earth,\" Kenney said.\n\nPro-oil signs on legislature windows\n\nOpposition NDP Leader Rachel Notley said members of her caucus were at another climate rally at the legislature last month, and it's possible they will be there on Friday as well.\n\n\"I think it's quite ridiculous that the minister of environment wouldn't be there,\" she said. \"I think that whether they agree or not, they should be there to talk to them.\"\n\nNotley said she was \"appalled\" to see pro-oil signs placed in legislature windows at the last climate rally as a means of \"trolling\" protesters.\n\nEdmonton climate strike organizer Olivier Adkin-Kaya said there's a lot of excitement among environmentalists about Thunberg's visit, but he recognizes many in Alberta don't embrace her views.\n\n\"People are saying hopefully she's going to China, hopefully she'll go to Saudi Arabia, where the human rights are being violated,\" he said.\n\n\"But it's really important we take a place of leadership globally and show that yes, it can be done. We can reduce greenhouse gas emissions and prevent the irreversible catastrophe of the climate crisis.\"", "description": "A group of oil and gas supporters is planning a counter-rally when Swedish climate activist Greta Thunberg shows up at the Alberta legislature tomorrow.", "authors": ["The Canadian Press"], "top_image": "https://i.cbc.ca/1.5301655.1569702033!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/climate-change-strike-canada.JPG", "published_at": "2019-10-17"}