{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201908/30/WS5d686b18a310cf3e35568b2d.html", "downloaded_at": "2019-10-05 13:28:36.574460+00:00", "title": "G7 Summit once again displays faked unity", "language": "en", "text": "French President Emmanuel Macron and President Donald Trump participate in a G-7 Working Session on the Global Economy, Foreign Policy, and Security Affairs at the G-7 summit with German Chancellor Angela Merkel, Canadian Prime Minister Justin Trudeau, British Prime Minister Boris Johnson, President of the European Council Donald Tusk, Italian Prime Minister Giuseppe Conte and Japanese Prime Minister Shinzo Abe in Biarritz, France Aug 25, 2019. [Photo/Agencies]\n\nThe G7 Summit that ended in the French seaside city of Biarritz on Monday is the latest proof of how irrelevant the forum has become.\n\nThat was not a secret even before the summit when French President Emmanuel Macron decided to abandon the idea of having a joint communiqué for the first time in the G7 Summit's 45-year history. The memory of US President Donald Trump on Air Force One ordering his representative in Canada not to sign the joint communiqué last year must still be fresh.\n\nThe sharp differences among the leaders, especially between the US president and the rest, on everything from climate change and the Iran nuclear deal to trade and multilateralism, are known to all.\n\nWhat's worse is a faked unity that the G7 leaders tried hard to present to the world, including a 260-word declaration. There was unity, though, when the G7 leaders chose to turn a blind eye to many critical issues in the world and not to challenge the US leader on major issues they strongly disagree on.\n\nThe declaration says that the G7 is committed to stabilizing the global economy, and promoting opening-up and fair trade. It does not mention the US administration's protectionism, unilateralism and disruptive behavior which are the real threat to global trade and economy today.\n\nMacron did not touch upon that at all at the joint press conference with the US leader after the conclusion of the summit, perhaps in a bid to please the latter. But appeasing and pleasing the US leader is no guarantee that he won't slap punitive tariffs on European and Japanese cars and French wines.\n\nOn Iran, the declaration says the G7 leaders fully share two objectives: ensuring Iran never acquires nuclear weapons, and fostering peace and stability in the region. It does not say that the US withdrawing from the landmark 2015 Iran nuclear deal and re-imposing sanctions on Iran are a major cause of the tensions in the Persian Gulf, rather the entire Middle East.\n\nIt is ironical that the countries which threw Libya into chaos in 2011 pretend in the declaration that they are the saviors, not the cause of the chaos in the country. There is no confession.\n\nWith nothing relevant to agree on, the declaration even reaffirms the existence and importance of the Sino-British Joint Declaration of 1984 on Hong Kong, a reflection that some G7 countries still live in their colonial past. The declaration also says violence in Hong Kong should be avoided. But what we have seen so far is the excessive restraint exercised by Hong Kong police compared with the heavy-handedness and brutality exhibited by French and US police in cracking down on the \"Yellow Vest\" and Occupy Wall Street protesters.\n\nIt's a shame that there is no mention in the declaration of the environment or climate change and growing inequality, two major issues that Macron enlisted as key topics for the summit. There is absolutely no mention of the Paris climate accord. There was a pledge of a meager $20 million to support Brazil to fight the Amazon fires. But it was rejected by Brazilian President Jair Bolsonaro.\n\nMeanwhile, the US president has sparked controversy in the US by suggesting his own Miami resort as the venue for next year's G7 Summit. But with no substance coming out of the Biarritz G7 Summit, there is really no need to keep the G7 alive, which has been on life support for some time now. G20 is a much more viable forum for the world today.\n\nThe author is chief of China Daily EU Bureau based in Brussels.", "description": "", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201908/30/5d686b18a310cf3e9799c2d3.png", "published_at": "2019-08-30"}