{"pub": "fox", "url": "https://foxnews.com/auto/new-u-s-postal-service-truck-billion", "downloaded_at": "2019-10-02 15:30:54.634555+00:00", "published_at": "2019-10-02", "title": "New U.S. Postal Service truck contract worth $6.3 billion may be awarded in 2020", "language": "en", "text": "The new mail trucks are going to arrive a little later than expected.\n\nThe U. S. Postal Service has “modified” its timeline to pick a replacement for the iconic Grumman LLV delivery truck, an agency spokeswoman said.\n\nThe initial announcement for the contract to build the Next Generation Delivery Vehicle (NGDV) indicated that a winning bid would be chosen by 2018. However, prototype testing and evaluation stretched into 2019 and the Postal Service now says it will be requesting final proposals from the remaining candidates this year in anticipation of issuing a production contract -- or contracts -- in 2020.\n\nThe Grumman LLV, or “Long Life Vehicle,” was produced from 1987 to 1994 and had a projected 24-year lifespan. It lacks air conditioning, anti-lock brakes, traction control and other modern technologies. Along with ongoing challenges of maintaining a fleet of aging vehicles, there has been a spate of fires in recent years, the cause of which remains unclear.\n\nThe roughly $6.3 billion NGDV project calls for up to 180,000 trucks to be built over five to seven years that feature right-hand drive, separate sliding doors for the driver and cargo area, a payload of 1,500 pounds and an all-wheel-drive option, among other features. A specific powertrain is not specified, but the Postal Service said it will be choosing the vehicle that offers the best overall value.\n\nThe Postal Service is now considering splitting the contract among multiple manufacturers, according to Trucks.com, but the agency would not confirm that to Fox News Autos. Details on the proposals are secret, but prototypes of five have been spotted during field tests this year. They include collaborations from Ford and Oshkosh, Karsan and Morgan Olsen, VT Hackney and Workhorse, along with individual efforts by Mahindra and AM General. An electric drive supplier that had been working with AM General announced it was dropping out of the process last year, but AM General has not responded to requests from Fox News Autos about the status of its project.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM", "description": "Long time coming.", "authors": ["Gary Gastelu", "Gary Gastelu Is Foxnews.Com'S Automotive Editor. Follow Him"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/mail-karsan.jpg"}