{"pub": "foxnews", "url": "https://foxnews.com/media/hillary-clinton-impeachment-2020", "downloaded_at": "2019-10-01 15:29:10.321682+00:00", "title": "Clinton calls for caution on impeachment, tells Democrats not to 'jump to any conclusions'", "language": "en", "text": "Former 2016 Democratic presidential candidate Hillary Clinton weighed in on President Trump's impeachment fight Tuesday and cautioned House Democrats against moving too fast and jumping to conclusions.\n\n\"I think the evidence concerning Ukraine is so dramatic and irrefutable because it came right out of the White House. So let the impeachment inquiry proceed,\" she said on ABC's \"Good Morning America.\" \"I know that they will do a thoughtful, thorough job. Nobody should jump to any conclusions.\"\n\nClinton also criticized Trump's calls to unmask the Ukraine whistleblower and claimed his actions could put the leaker at risk.\n\n\"I think that's really dangerous,\" she said. \"From everything we know and we don't know much, this is an experienced person who saw things that bothered him. That's what the whole whistle-blower statute is for. And it is to protect their identity. And I understand he's going to testify and we'll let the process unfold.\"\n\nHILLARY CLINTON SAYS SHE ADMIRES ELEANOR ROOSEVELT FOR STICKING BY FDR AFTER HIS AFFAIR\n\nClinton discussed the impact of the probe on the upcoming 2020 election and defended House Speaker Nancy Pelosi for escalating the partisan battle that has gripped the nation's capital for several years.\n\n\"I don't know [the impact on 2020] yet. But I think there was no choice,\" she said. \"Speaker Pelosi was reluctant as we all know, but what I hope the Democrats will do is not only proceed in a very deliberative way on the impeachment inquiry but tell the American people what they've accomplished.\n\n\"They've passed legislation on gun safety, improving health, lowering prescription drug costs, doing so many things that the American people really want and need and it goes to the Senate and dies. So I think the Democrats have to go on two tracks here, but they will do that.\"\n\nClinton also fielded a question about her now-infamous email server scandal and said she has yet to be approached by the government for an interivew, despite dozens of State Department officials being called in for questioning.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Can you believe that?\" she asked about the investigation. \"No [I haven't been questioned], and, look, I think it's an unfortunate diversion,\" she said.\n\n\"You go and you talk to people who've been experienced diplomats for many years and then you retroactively classify what they said ten years ago, I think it's really a shame that they're doing that and hopefully people will not be distracted.\"", "description": "Former 2016 Democratic presidential candidate Hillary Clinton weighed in on President Trump's impeachment fight during an interview with ABC Tuesday and cautioned House Democrats against moving too fast and jumping to conclusions.", "authors": ["Nick Givas", "Nick Givas Is A Reporter With Fox News. You Can Find Him On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/hilary-clinton.jpg", "published_at": "2019-10-01"}