{"pub": "yahoo", "url": "https://news.yahoo.com/sean-connery-says-hes-lucky-193016812.html", "downloaded_at": "2019-09-07 15:27:58.903205+00:00", "title": "Sean Connery says he's 'lucky' to have escaped Hurricane Dorian unharmed", "language": "en", "text": "Sean Connery, famous for evading danger as suave spy James Bond, considers himself lucky to have survived one real-life disaster.\n\nThe actor, who turned 89 last month, told the Daily Mail he and his wife Micheline Roquebrune rode out Hurricane Dorian from their home in the Bahamas.\n\nThe devastating hurricane left the former 007 agent shaken, but still alive.\n\n\"We are both fine,\" he said. \"We were lucky compared to many others and the damage here was not great.\"\n\nThough the tabloid reports Connery's island of New Providence saw torrential rain, heavy winds and fallen trees, the actor's mansion was spared.\n\n\"We had been prepared for the storm, everything was ready in advance – we weren’t taking any chances and knew what to do,\" he said.\n\nAccording to the New York Post and Yahoo News, Connery moved to the Bahamas in the 1990s.\n\nCategory 5 Dorian slammed into the island chain Sunday, the strongest hurricane to make landfall in the Atlantic basin since 1935.\n\nMore: Incredible before and after images reveal Hurricane Dorian's destruction in the Bahamas\n\nThough Connery is still alive and his mansion is still standing, the death toll in the Bahamas has jumped to 30 and is expected to rise significantly. Property losses could hit $7 billion, not including infrastructure and autos.\n\nUSA TODAY has reached out to Connery's rep for comment.\n\nMore: No way in, or out: Dorian's damage to Bahamas leaves survivors and rescue teams frustrated\n\nMore: Daniel Craig's next James Bond film finally gets its official (and deadly) title\n\nContributing: Trevor Hughes and Joey Garrison\n\nThis article originally appeared on USA TODAY: Hurricane Dorian ravages Bahamas but spares Sean Connery's mansion", "description": "Sean Connery revealed he rode out the Category 5 Hurricane Dorian from his Bahamas mansion with his wife.", "authors": ["Charles Trepany", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/1kdhv87L_lJsWgtL435RiA--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/1009217/5adb8239-aed0-42a1-bad5-3708522a84ae/8917b2f4-e71f-5356-a7cf-4ece891a4500/data_3_0.jpg?s=7cf32fc4659aa0a4331ff05472e50ca2&c=e24021d25a72eba2f064b2c984b4c7b1&a=tripleplay4us&mr=0", "published_at": "2019-09-06"}