{"pub": "thehill", "url": "https://thehill.com/policy/healthcare/467569-900-children-test-positive-for-hiv-in-pakistani-city", "downloaded_at": "2019-10-27 00:01:27.927194+00:00", "title": "900 children test positive for HIV in Pakistani city", "language": "en", "text": "Nearly 900 children in the Pakistani city of Ratodero tested positive for HIV this year and suffered from fevers that resisted treatment, according to a New York Times report released Saturday.\n\nAfter the disease was on its heels in April, the city became the epicenter of a new outbreak that disproportionally impacted children. Health officials initially said a single pediatrician who was accused of reusing syringes was to blame, according to The Times.\n\nADVERTISEMENT\n\nSince April, about 1,100 citizens have tested positive for HIV, including 900 patients under 12 years old. Health officials suspect the real numbers could be much higher.\n\nOfficials arriving to the city discovered that many of the infected children were patients of the same pediatrician, Muzaffar Ghanghro, who served many of the city’s poorest families.\n\n“It was devastating,” Gulbahar Shaikh, a local journalist who broke the news of the epidemic in April and whose children are patients of Ghanghro’s, told The Times.\n\n“He said, ‘If you don’t want my treatment, go to another doctor’,” added Imtiaz Jalbani, a laborer who had his six children treated by Ghanghro. “My wife and I had to starve ourselves to pay for the medicine.\"\n\nFour of his children contracted HIV and two have already died.\n\nGhanghro was ultimately arrested and charged with negligence, manslaughter and causing unintentional harm. He has yet to be convicted and has maintained his innocence, saying he never reuses syringes.\n\nHealth officials say that Ghanghro is not likely to be the sole cause of the outbreak, noting that visiting health workers saw many other doctors reuse syringes, barbers use the same razors to shave customers, and roadside dentists use unsterilized tools.\n\nThe uptick in the number of HIV-positive people in Ratodero is part of a nationwide trend; according to estimates by UNAIDS, the United Nations task force that specializes in HIV and AIDS, the number of HIV-positive people in Packistan has nearly doubled to about 160,000 since 2010.", "description": "Nearly 900 children in the Pakistani city of Ratodero tested positive for HIV this year and suffered from fevers that resisted treatment, according to a New York Times report.", "authors": [], "top_image": "https://thehill.com/sites/default/files/blogs/hiv.jpg", "published_at": "2019-10-26"}