{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nascar/2019/10/27/martin-truex-jr-wins-first-data-500-martinsville-playoff-race/2479004001", "downloaded_at": "2019-10-28 00:29:05.990160+00:00", "title": "Martin Truex Jr. clinches spot in Championship 4 with dominating win at Martinsville", "language": "en", "text": "CLOSE\n\nMARTINSVILLE, Va. – Martin Truex Jr. was celebrating the victory that locked him into NASCAR’s title race when he heard the crowd roar, looked up at the big screen and saw two championship contenders jawing at each other on pit road.\n\n“Oh, look, a fight,” the winner said.\n\nIndeed, Denny Hamlin was knocked to the ground in a confrontation with Joey Logano in the most intense action of an otherwise lackluster playoff Sunday at Martinsville Speedway.\n\nTruex earned a spot in NASCAR’s championship race for the third consecutive year by leading 464 of the 500 laps. He’s the first driver to claim one of the four spots in the Nov. 17 title race at Homestead-Miami Speedway while leading the most laps in a win since Kyle Petty led 484 laps in 1992 at Rockingham.\n\nThere were just three lead changes, and Truex controlled the event from the first round of pit stops, when he beat Joe Gibbs Racing teammate Hamlin back onto the track for the lead. He was hardly challenged at all and his Toyota coasted to his first career victory at NASCAR’s shortest track.\n\n“We’re going to Homestead again and that was what we tried to accomplish this weekend,” Truex said. “We don’t have to worry about points anymore. We can just get to work on our Homestead car.”\n\nMartinsville marked the first of three races in the round of eight of the playoffs, where the field will be trimmed to a winner-take-all final four for the finale. Truex is locked in, while Hamlin, Kyle Busch and Logano are above the cutline. Kevin Harvick, Ryan Blaney, Chase Elliott and Kyle Larson are the bottom four.\n\nThe next two rounds will be must-win situations for Elliott, NASCAR’s most popular driver, who suffered a catastrophic mechanical failure and finished 36th in the 38-car field. A victory earns a playoff driver an automatic berth into the final four.\n\nFor Truex, the win was redemption from a year ago at Martinsville when he raced Logano cleanly over the closing laps and Logano snatched the win away from Truex. Logano then won the championship.\n\n“After last year, everybody wants to keep talking about last year, and I’m like ‘We’ve got work to do,’” said Truex, the 2018 champion who will race for the title for the fourth time in five years.\n\nBut as he celebrated, the crowd focus turned to pit road where Hamlin and Logano were having what appeared to be a civil conversation. Hamlin wagged his finger at Logano, then Logano placed his hand on Hamlin’s shoulder somewhat flippantly as he walked away. Hamlin chased after him, crew members got into the way and Hamlin was knocked to the ground.\n\nMore: Denny Hamlin, Joey Logano get into scuffle after NASCAR playoff race at Martinsville\n\nHamlin said after it was how Logano typically handles confrontation.\n\n“It was a discussion. I understand him coming over and talking, standing there and having a discussion with him, everything was fine,” Hamlin said. “I think he didn’t get me agitated enough. So he said something and then pokes a little bit and then runs away trying to get me to come so he could hide behind his guys. He’s just not that tough. And he won’t stand face to face. That’s just his style.\n\n“It was civil and then like Joey does, he does a little push and then runs away. He said, ‘Do you want to go?’ I said ‘Yes, I’m here’ and then he runs away.”\n\nFor good measure, Hamlin did an imitation of Logano picked up on the big screen that brought the crowd to its feet in approval.\n\nLogano said the incident stemmed from on-track contact when Hamlin shoved Logano into the wall and caused a cut tire.\n\n“I just wanted to talk to him about it and was pretty frustrated. He just kind of came off the corner like there wasn’t another car on the outside of him and ruined our day. A shot at the win for sure,” Logano said. “Maybe shouldn’t have shoved him there at the end. I honestly just wanted to see what he was going to say, and he really wasn’t apologetic at all. That’s more frustrating when someone is like that, isn’t it? When someone wrecks you and he’s like, ‘Meh.’ That’s not really what I was going for there. I just wanted to see what his thoughts were, and wasn’t quite the answer I was looking for.”\n\nWilliam Byron and Brad Keselowski, both already eliminated from the playoffs, finished second and third.\n\nHamlin was fourth, followed by Blaney, another playoff contender.\n\nKurt Busch, eliminated from the playoffs in the first round, was sixth and followed by title contenders Harvick, Logano and Larson at his worst track in this round.\n\nKyle Busch had a really rough day and finished 18th, which would have been worst of the title contenders if not for Elliott’s issues.\n\nElliott had to start at the back of the field because of an engine change but worked his way inside the top-five until he stopped for a routine service. His Chevrolet lurched as he pulled away and he radioed in to his Hendrick Motorsports crew that he believed he had a broken axle.\n\nElliott returned to pit road for lengthy attempts at a repair before he finally drove his car to the garage for more intense work. It dropped him to last in the field by the end of the second stage.\n\nElliott returned to the track down 52 laps from the leaders and in a must-win situation either next week at Texas or in the elimination race of the third round of the playoffs at ISM Raceway outside Phoenix.\n\nTruex meanwhile, won all three stages of the race. He took control of the race coming off pit road during service stops under yellow in the first stage and quickly went to work lapping most of the field. Hamlin started from the pole but had a below-average first pit stop under caution after leading the first 31 laps. He restarted fifth, with teammate Truex the new leader and Truex was never challenged in winning his third race of these playoffs.\n\nMartin Truex Jr. celebrates his victory at Martinsville. (Photo: Jared C. Tilton, Getty Images)\n\nTWO STAGES, TWO WINS: Martin Truex Jr. won both the first and second stages of the race. He passed Kyle Larson right before the checkered flag to win the second stage after Larson had cycled into the lead by not pitting under a late caution.\n\nTruex took the lead coming off pit road during service stops under yellow in the first stage and quickly went to work lapping most of the field. He led 224 of the 260 laps through the first two stages.\n\nDenny Hamlin started from the pole but had a below-average first pit stop under caution after leading the first 31 laps. He restarted fifth, with teammate Truex the new leader.\n\nHamlin later lost about four positions on a pit stop during the second stage.\n\nELLIOTT'S ISSUES: Chase Elliott’s title hopes took a massive hit when his car suffered a catastrophic mechanical problem during a pit stop Sunday at Martinsville Speedway.\n\nElliott had worked his way from the back of the field inside the top-five until he stopped for a routine service. His Chevrolet lurched as he pulled away and he radioed in to his Hendrick Motorsports crew that he believed he had a broken axle.\n\nElliott returned to pit road for lengthy attempts at a repair before he finally drove his car to the garage for more intense work. It dropped him to last in the field by the end of the second stage.\n\nMajor problems for Chase Elliott!\n\n\n\nHe believes he has a broken axle. Take a look at the pit stop on the right rear. #NASCARPlayoffspic.twitter.com/h5VXLkrEBl — NASCAR on NBC (@NASCARonNBC) October 27, 2019\n\nAlthough Elliott qualified second, he had to drop to the back of the field at the start because his engine failed just five laps into the first practice session Saturday. His car was clearly fast enough to recover for a solid finish until the mechanical issue.\n\nElliott returned to the track down 52 laps from the leaders and in a must-win situation either next week at Texas or in the elimination race of the third round of the playoffs at ISM Raceway outside Phoenix. Only four drivers will advance to the Nov. 17 title-deciding race at Homestead-Miami Speedway.\n\nNO TIFFT: Matt Crafton raced Sunday at Martinsville for Matt Tifft, who fell ill before Saturday’s practice sessions and was treated at a hospital.\n\nCrafton practiced and qualified the No. 36 for Front Row Motorsports while Tifft was at the hospital. Tifft was sent home and posted on social media he’s “still learning more of what exactly happened” and he is “resting at home now and have follow ups soon to get back to full health and back in the car soon.”\n\nTifft had a brain tumor removed in 2016 but returned to race the next year. He said in January he had been stabilized to the point he only needed annual checkups.\n\nResults\n\nSunday At Martinsville Speedway, Martinsville, Va.\n\nLap length: 0.562 miles Pole posiotion in parentheses\n\n1. (3) Martin Truex Jr, Toyota, 500.\n\n2. (11) William Byron, Chevrolet, 500.\n\n3. (15) Brad Keselowski, Ford, 500.\n\n4. (1) Denny Hamlin, Toyota, 500.\n\n5. (6) Ryan Blaney, Ford, 500.\n\n6. (25) Kurt Busch, Chevrolet, 500.\n\n7. (22) Kevin Harvick, Ford, 500.\n\n8. (10) Joey Logano, Ford, 500.\n\n9. (14) Kyle Larson, Chevrolet, 500.\n\n10. (35) Ryan Newman, Ford, 500.\n\n11. (17) David Ragan, Ford, 500.\n\n12. (20) Chris Buescher, Chevrolet, 500.\n\n13. (26) Bubba Wallace, Chevrolet, 500.\n\n14. (13) Kyle Busch, Toyota, 500.\n\n15. (16) Ricky Stenhouse Jr, Ford, 500.\n\n16. (12) Matt DiBenedetto, Toyota, 500.\n\n17. (18) Daniel Hemric, Chevrolet, 500.\n\n18. (36) Corey LaJoie, Ford, 500.\n\n19. (21) Ryan Preece, Chevrolet, 500.\n\n20. (8) Erik Jones, Toyota, 499.\n\n21. (28) Paul Menard, Ford, 499.\n\n22. (23) Austin Dillon, Chevrolet, 499.\n\n23. (5) Michael McDowell, Ford, 499.\n\n24. (27) Ty Dillon, Chevrolet, 498.\n\n25. (29) Matt Crafton, Ford, 495.\n\n26. (30) Landon Cassill, Chevrolet, 495.\n\n27. (38) BJ McLeod, Chevrolet, 494.\n\n28. (32) JJ Yeley, Chevrolet, 494.\n\n29. (33) Ross Chastain, Chevrolet, 494.\n\n30. (19) Alex Bowman, Chevrolet, 494.\n\n31. (9) Daniel Suarez, Ford, 488.\n\n32. (34) Garrett Smithley, Chevrolet, 487.\n\n33. (31) Reed Sorenson, Chevrolet, Rear Gear, 452.\n\n34. (37) Timmy Hill, Chevrolet, Transmission, 450.\n\n35. (7) Clint Bowyer, Ford, Track Bar, 449.\n\n36. (2) Chase Elliott, Chevrolet, 445.\n\n37. (4) Aric Almirola, Ford, Accident, 363.\n\n38. (24) Jimmie Johnson, Chevrolet, Accident, 361.", "description": "Martin Truex Jr. became the first driver to clinch a spot in NASCAR's championship race by leading 464 of 500 laps in a dominant win at Martinsville.", "authors": ["Jenna Fryer", "Associated Press", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/27/USAT/540768d1-ce41-476c-96c0-5e33d4a4fbae-GTY_1183840103.JPG?crop=3514,1977,x1,y135&width=3200&height=1680&fit=bounds", "published_at": "2019-10-27"}