{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7546033/Nigeria-target-Chelseas-Ike-Ugbo-failing-convince-Tammy-Abraham-switch-allegiance.html", "downloaded_at": "2019-10-07 23:35:10.907206+00:00", "title": "Nigeria target Chelsea's Ike Ugbo after failing to convince Tammy Abraham to switch allegiance", "language": "en", "text": "Chelsea youngster Ike Ugbo has become the latest England prospect to be targeted by Nigeria.\n\nNigeria have been running the rule over 21-year-old hotshot Ugbo who has caught the eye after making a prolific start to his loan spell at Roda JC this season.\n\nUgbo scored his fifth goal in just eight appearances, six of which have been starts, for the Dutch side at Telstar on Friday night and Nigeria had officials at the game to watch him having stepped up their interest.\n\nThe 21-year-old forward Ike Ugbo is yet to make a competitive appearance for Chelsea\n\nUgbo has flown out the blocks this season on loan at Dutch second division side Telstar\n\nStriker Ugbo was born in Lewisham, south London and is eligible for Nigeria through his parents.\n\nHe has played for England at Under-17 and Under-20 level, helping the latter squad win the 2017 Toulon Tournament.\n\nNigeria were dealt a blow last week when Ugbo’s Stamford Bridge team-mate Tammy Abraham was recalled to the England squad when they were hoping to persuade him to switch allegiance.\n\nThe Premier League's joint top scorer Abraham has featured twice for England in friendlies against Germany and Brazil but will not be tied down until he earns a competitive cap, which could come in either of the upcoming Euro 2020 qualifiers against Czech Republic or Bulgaria.\n\nTammy Abraham was on the scoresheet again in Chelsea's 4-1 win at Southampton on Sunday\n\nNigeria's attempts to swoop for eligible youngsters with dual nationality show no sign of slowing down and could now continue with Ugbo, having recently persuaded the likes of Alex Iwobi, Ola Aina and Chuba Akpom, who all represented England at youth level, to make the switch.\n\nUgbo has shown admirable maturity by refusing to let a bizarre pay dispute disrupt his scoring form and is determined to continue making his mark in Holland.\n\nIt emerged last week that Roda had been used money sent by Chelsea to cover their portion of Ugbo’s wages to instead pay the rest of their squad last month.\n\nChelsea manager Frank Lampard played Ugbo in pre-season but allowed him to leave on-loan\n\nThe situation has now been resolved and Ugbo, whose Chelsea contract expires in 2021, said: ‘I didn’t really let it affect me. I was just focusing on the [Telstar] match because it was a big game and we needed the three points so I forgot about the other stuff going on.\n\n‘The aim is to finish the season, a strong season, and hopefully get as high as possible with the team and push for the next level.\n\n‘Chelsea came out to the last game to watch me and see how I’m doing. They are really happy with me out here scoring goals and getting back to what I’m good at.’", "description": "EXCLUSIVE BY ADRIAN KAJUMBA: Nigeria have been running the rule over 21 year-old hotshot Ugbo who has caught the eye after making a prolific start to his loan spell at Roda JC this season.", "authors": ["Adrian Kajumba For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/11/19391028-0-image-a-69_1570445386982.jpg", "published_at": "2019-10-07"}