{"pub": "wsj", "url": "https://wsj.com/articles/connecticut-governor-ned-lamont-plans-to-end-religious-exemption-for-vaccinations-11568670685?mod=rsswn", "downloaded_at": "2019-09-17 08:25:18.839389+00:00", "title": "Connecticut Governor Ned Lamont Plans to End Religious Exemption For Vaccinations", "language": "en", "text": "Connecticut Gov. Ned Lamont said on Monday that the state should join a handful of others that require minors to receive vaccinations for preventable diseases, eliminating most exceptions to vaccination.\n\n“The more children who receive their vaccinations, the safer it is for everyone, especially those who may be at risk to catch serious diseases,” Mr. Lamont said in a statement. But if a parent decides not to vaccinate “then alternate decisions must be made about where to educate your children,” he said.\n\nDuring a Monday press conference, Mr. Lamont, a Democrat, stressed that ending the state’s religious exemption would be done through legislation and in a respectful way, allowing parents time to plan and comment at public hearings.\n\n“I want parents to know that their kids can go to school and feel safe. That we’ve done everything we can to protect the public health,” Mr. Lamont said. He said that legislative action such as this is “not always an easy vote.”\n\nThe recommendation comes after New York implemented a new law that eliminates religious exemptions for school vaccinations for minors attending any school and, separately, tightened the process for receiving a medical exemption to vaccination. The change in New York’s law, which happened in June, has prompted some families to consider pulling their children out of school in favor of home schooling.\n\nConnecticut is one of 31 states that have had reported measles cases this year, part of the worst measles outbreak in the U.S. since 1992. Connecticut had three confirmed cases of measles, while New York has had more than 1,000 cases.\n\nWSJ’s Lorie Hirose takes a look at state vaccination laws and what the Centers for Disease Control and Prevention is doing to fight measles. Photo Illustration: Laura Kammermann\n\nThe Centers for Disease Control and Prevention, as well as other health authorities and leading scientists, say vaccines are safe and effective. Public health experts say there is a growing, aggressive and vocal antivaccination movement in the U.S. and elsewhere. Some parents say they believe vaccinations can cause injuries and other harm.\n\nConnecticut’s Commissioner for the Department of Public Health, Renée D. Coleman-Mitchell, wrote in a letter to Connecticut lawmakers on Monday that they should eliminate the religious exemption for vaccination beginning in the 2021-2022 school year.\n\nConnecticut has allowed religious exemption to vaccination for 60 years. Giving plenty of time to implement the change in vaccination requirements will allow school districts and parents “time to prepare for the new reality in our state, making whatever arrangements necessary if they choose not to vaccinate their children for non-medical reasons,” wrote Ms. Coleman-Mitchell.\n\nData released from the Connecticut Department of Health showed there were more than 100 schools that had immunization rates for measles-mumps-rubella below the federal guideline of 95% vaccinated.\n\n“The immunization rates for MMR are decreasing,” she said.\n\nConnecticut State Representative Vincent Candelora, a Republican, said lawmakers expected this move from the governor after an effort to end vaccine exemptions stalled during the last legislative session.\n\n“It’s not a partisan issue by any means,” he said. “The leadership on the Public Health Committee will be working toward getting a consensus.”\n\nConnecticut State Sen. Martin Looney, a Democrat, said during a press conference Monday that the change in law “is not a religious issue, it is a public health issue.”\n\n“There is no valid reason for children not to be vaccinated, except for a health-related reason,” he said.\n\nWrite to Melanie Grayce West at melanie.west@wsj.com", "description": "Connecticut is one of 31 states that have had reported measles cases this year, and now Gov. Ned Lamont wants legislation to require minors to be vaccinated, with few exceptions.", "authors": ["Melanie Grayce West", "Melanie.West Wsj.Com"], "top_image": "https://images.wsj.net/im-107477/social", "published_at": "2019-09-16"}