{"pub": "guardian", "url": "https://theguardian.com/global-development/2019/sep/09/how-snakebites-became-an-invisible-health-crisis-in-congo", "downloaded_at": "2019-09-09 06:51:46.683685+00:00", "title": "How snakebites became an invisible health crisis in Congo", "language": "en", "text": "In the vast jungles that cover the Democratic Republic of the Congo, one of the world’s most invisible health crises burns on. The country’s extensive equatorial forests are home to numerous species of venomous snakes, but their habitat is shared by secluded communities that are being forced to look further and further afield for their resources due to poverty and the pressures of conflict and climate change.\n\nIt puts DRC at the centre of an issue Médecins Sans Frontières has called a “neglected crisis”: death by snake bite.\n\nGlobally, about 5m snake bites occur worldwide each year, according to the World Health Organization, resulting in between 81,000 and 138,000 deaths. A bite from a viper, cobra or mamba can kill in a matter of hours or leave a victim suffering life-changing injury. Symptoms of snakebite envenomation commonly include tissue necrosis, intense pain and nausea. Beyond treatments that provide symptomatic relief, specialised antidotes are vital in counteracting the venom.\n\nSince the deadliest snakes often share habitats with rural populations that lack adequate healthcare, the victims of this crisis are often underprivileged people with no access to anti-venoms. DRC’s remote tropical forests provide the perfect habitat for the country’s venomous species, but they also make essential medical intervention nearly impossible.\n\n“The river is the gateway to finding many of them,” explains François Nsingi, a technical assistant with the University of Kinshasa’s centre for anti-venom. The Congo river and its tributaries are a key habitat for venomous species, he says, as snakes hunt for fish and birds along the banks.\n\nNsingi keeps snakes for use in DRC’s severely underfunded anti-venom programme. Snakes are rare around Kinshasa, he says, but heading down to the waters of the Congo and deeper into the bush, interactions between snakes and humans are far more common – as are problems.\n\nWhile death after a snakebite is not inevitable, lack of knowledge regarding basic treatments and poor access to anti-venom means that venomous snakes pose a severe threat to remote communities, especially those whose daily work by rivers and fields places them in snake habitats.\n\nDRC’s crumbling infrastructure and lack of funding is the biggest obstacle to adequate in-country anti-venom production, with extremely limited stocks of anti-venom imported from Mexico available in the capital, but totally inaccessible in the rest of the huge nation.\n\nIn the office of the anti-venom centre, Sophie Bokuta, the secretary of operations, explains the reality of local scientific work: “At this time we don’t have the money to produce serums or to distribute them around the country … we are researching some international funds to get work back ahead and raise the Congo office up”.\n\nIn comparison, countries such as Costa Rica and India, with comparable dangerous snake species in their ecosystems, have advanced programmes for studying venom and producing antidotes.\n\nIn DRC’s north-western Équateur province, characterised by winding rivers and dense, lush jungle, rural lifestyles put inhabitants at constant risk of snakebites. Fishermen frequently come into contact with venomous snakes. Patrick Atelo, who has fished in Équateur province’s Ruki river for years, says that he meets snakes every day, but that they are not aggressive towards people: “They don’t attack unless they feel in danger … you get bitten by accident if you step on his tail [or you find] them in your nets.”\n\n“The poison affected my whole body,” Monique Dongo recounts, “I could barely remember who I was.” Dongo, bitten while inspecting her rural property, is a survivor of envenomation. While she was lucky, she has seen snakebites kill others, including members of her own family.\n\nHer young nephew began to vomit and faint after he was bitten while playing outdoors, and passed away just hours later.\n\nScientists pursue universal snakebite cure using HIV antibody techniques Read more\n\nDue to the inaccessibility of anti-venom, many people in DRC rely on traditional healers. The remedies provided by these healers include making cuts, using charred powders and constricting wounds. These practices can be harmful.\n\nFunctional infrastructure is the first step to a solution, but a more realistic sense of the scale of the problem is also required. “We don’t have any [local] data on snakebites,” says Dr Guy Kalambayi of the World Health Organization’s Équateur office. “If we had facts … then we could resolve the situation”. The logistics and terrain of much of DRC means snakebites often go unrecorded. Given the ultra-specialised medicines required, template methods for dealing with a tropical health crisis can’t simply be deployed here.\n\nDRC, with it’s barely functional state system, is an extreme example. But with national and international health aid overstretched, this issue is a global one, found wherever tropical forests and rural communities overlap.\n\nThis story was supported by the Pulitzer Center on Crisis Reporting", "description": "Daily life is fraught with danger for people living in remote areas of a country where health funding is as scarce as specialist medicine", "authors": [], "top_image": "https://i.guim.co.uk/img/media/af341c08a9924fb3bfcb9d32ea78f252cbda470a/0_374_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6d3c8a21e88ce58314544bccee8ebb73", "published_at": "2019-09-09"}