{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/couple-share-horror-photos-after-20707731", "downloaded_at": "2019-10-23 15:56:19.806046+00:00", "title": "Couple share horror photos after rubber toy almost splits dog's tongue in two", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA couple have issued a desperate warning after a rubber toy ball almost split their dog's tongue in two.\n\nHelen and James Hartley, from Lincoln, were traumatised when they discovered pooch Poppy's tongue dangling by a thread of flesh.\n\nThey had left the pooch alone as she played with a rubber ball toy when she got her tongue stuck.\n\nThe tissue then turned necrotic due to restricted blood flow and Poppy was unable to eat or drink properly.\n\nAs the injury developed, Helen and James took Poppy to the vets to stitch her tongue back up.\n\nHelen wrote: \"[It was] really traumatic for us all.\n\n(Image: Kennedy News/Foxhall Veterinary)\n\n\"Thank you from the bottom of our hearts for looking after Poppy.\n\n\"She's been so well loved by everybody at the surgery and we couldn't have asked for a more dedicated team.\n\n\"Well done to you all, Poppy sends sloppy kisses.\"\n\nWith Poppy now firmly on the road to recovery, a month after the ordeal, the vets are now sharing what happened to highlight the dangers of leaving any pet unattended with toys.\n\n(Image: Kennedy News/Foxhall Veterinary)\n\nThe couple had returned home from work to discover Poppy had got her tongue stuck in the air hole of a rubber dog ball.\n\nAfter wrestling the ball from her mouth and tongue, they noticed despite seeming bright she was acting strangely so took her to the vets.\n\nThere, nurses spotted that the front half of Poppy's tongue was very swollen and there was a red line showing where the ball had affected the blood flow.\n\nAside from the marking, her tongue was pink and warm to the touch and Poppy was happy to eat treats so was given medication to manage the swelling and booked in for daily check-ups.\n\n(Image: Kennedy News/Foxhall Veterinary)\n\nOver the course of the week the red line gradually changed into bruising, which started to smell foul and form white plaques on top.\n\nThis eventually turned necrotic and died, leaving Poppy with two giant slits on either side of her tongue where the ball had been.\n\nDuring surgery all the dead tissue was removed and Poppy's tongue was stitched back together.\n\nA Foxhall Veterinary Clinic spokesperson said: \"The surgery was successful and our nurses couldn't believe it when Poppy ate and drank as soon as she woke up.\n\n(Image: Kennedy News/Foxhall Veterinary)\n\n\"We're happy to report that Poppy's tongue has pretty much healed now, she is using her tongue normally to drink and can still give plenty of kisses.\n\n\"The stitches are in place but will eventually dissolve.\n\n\"We've all grown very attached to Poppy here at Foxhall and we will miss her daily visits.\n\n\"Poppy's owners wanted us to share her story to highlight the dangers of leaving your dog unattended with toys, no matter how innocent they seem.\"", "description": "WARNING: GRAPHIC IMAGES Helen and James Hartley, from Lincoln, were traumatised when they discovered Poppy's injuries", "authors": ["Helen Le Caplain", "Amber Hicks", "Image", "Kennedy News Foxhall Veterinary"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20707891.ece/ALTERNATES/s1200/0_PAY-Kennedy-NewsFoxhall-Veterinary-Clinic.jpg", "published_at": "2019-10-23"}