{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/the_americas/honduras-is-poor-violent-and-unstable--and-the-trump-administration-wants-it-to-accept-more-asylum-seekers/2019/09/12/7e7101f6-d340-11e9-8924-1db7dac797fb_story.html", "downloaded_at": "2019-09-12 23:46:29.518642+00:00", "title": "Honduras is poor, violent and unstable. The Trump administration wants it to accept more asylum seekers", "language": "en", "text": "\n\nSoldiers patrol in Tegucigalpa, the Honduran capital. (Eduardo Verdugo/AP)\n\nHow dire are conditions in Honduras?\n\nIt’s one of the poorest and most violent nations in the hemisphere. Anti-government protests have swept the capital. Its president is fending off allegations by U.S. prosecutors that he financed his campaign with narco cash. Hundreds of thousands of citizens have fled.\n\nAnd now, the Trump administration wants it to sign a migration deal that could require it to take in U.S.-bound asylum seekers.\n\nAmerican officials are seeking to establish “safe third country” deals throughout the region, to diminish the crush of asylum seekers at the U.S. border. Authorities already have pressed Panama and Guatemala to reach such accords. Honduran officials have confirmed talks on migration but have been guarded about the details.\n\n“Honduras and the United States have still not arrived at an agreement,” Deputy Foreign Minister José Isaías Barahona told HRN radio in Honduras on Wednesday. “What we can say is that there are negotiations.”\n\nThe closed-door talks have alarmed activists, analysts and opposition politicians in this Central American nation.\n\n“Honduras isn’t a safe country when the levels of violence and impunity are as high as if the country were at war,” said Karla Rivas, coordinator of the Jesuit Migration Network of Central America. “Even Hondurans don’t want to stay here. Why would anyone else?”\n\nNot long ago, Honduras was known as one of the most dangerous nations on the planet. Homicides dropped by nearly half from 2013 to 2017, but the homicide rate is still eight times higher than the U.S. average, according to the Association for a More Just Society, a Honduran nonprofit group. And gang violence is rife.\n\nAround two-thirds of the population lives in poverty, according to the World Bank. The country was the leading source of migrants apprehended at the U.S. border last month.\n\n[As Trump tightens the U.S. border, asylum applicants seek refuge in Mexico, elsewhere]\n\nMeanwhile, in a possible sign of the deep inroads made by organized crime, the president’s brother is facing trial in federal court in New York on charges he is a major drug trafficker.\n\nIn a revelation that stunned Hondurans, U.S. prosecutors alleged in court documents made public last month that President Juan Orlando Hernández had knowingly benefited from $1.5 million in drug money spent on his 2013 election. The president has denied the allegations and pointed to his record of working with U.S. authorities against narcotrafficking.\n\n\n\nPeople wait on a bus in Tegucigalpa bound for the U.S. border. (Eduardo Verdugo/AP)\n\nLocal news media have reported that Hernández had agreed during a recent trip to Washington to accept the equivalent of a “safe third country” pact, under a different name.\n\nThe deal, as described by the newspaper La Prensa, would require U.S.-bound asylum seekers fleeing neighboring Nicaragua — and the growing number of Cubans arriving on easy-to-obtain Nicaraguan visas — to seek asylum in Honduras instead of continuing on to the United States.\n\nForeign Minister Lisandro Rosales said this week that discussions with Washington “aren’t aimed at making Honduras a ‘safe third country.’ ” The agenda, he said, was focused on security, investment and temporary employment programs.\n\nA Trump administration official said no agreement has been signed with Honduras.\n\n“But we did agree to discuss and negotiate with them over the next few weeks additional bilateral agreements on law enforcement information-sharing and regional asylum cooperation,” said the official, who spoke on the condition of anonymity because the official was not authorized to speak on the record about the talks.\n\nA Honduran delegation led by Rosales flew to Washington on Wednesday to continue the discussions.\n\nAnalysts and critics say Hernández is trying to reach the asylum accord to improve his standing with Washington at a difficult moment.\n\n“Señor Hernández is utilizing the country for eminently personal interests,” said Jary Dixon Herrera, a congressional deputy from the leftist Libre party.\n\nThe president has already faced months of protests over his attempts to privatize some health and education functions. On top of that, he’s been weakened among his supporters by some of his anti-corruption efforts — “a lot of people in his own party believe he went too far,” said James D. Nealon, a former U.S. ambassador to Honduras.\n\nHernández is widely perceived to have U.S. support. If he loses that, analysts said, it could be easier for his opponents to bring him down.\n\n[When they filed their asylum claim, they were told to wait in Mexico. There, they say, they were kidnapped.]\n\nAdding to the tension in Honduras is the secrecy surrounding the negotiations.\n\n“I can’t disguise the fact that I’m worried” about the possible accord, given that the government has not shared details, H. Roberto Herrera Caceres, the national human rights commissioner, told journalists.\n\nCubans make up the biggest group of “irregular migrants” that have crossed the country this year in an effort to reach the United States, according Honduran government data. Officials have counted more than 16,000.\n\nHonduran officials say they’ve cracked down on unauthorized migrants. Their numbers dropped from nearly 4,000 in June to 1,562 in August.\n\nSo far, the Trump administration’s efforts to secure “safe third country” deals in Latin America have been frustrated. Mexico and Panama have balked at signing such accords; Guatemala’s president agreed to a deal, but it will need approval by that country’s legislature to take effect.\n\nAs a Honduras agreement was being negotiated, the U.S. Supreme Court allowed the Trump administration to temporarily enact a policy to close the asylum system to most migrants applying at the U.S. border. That could prove an even more powerful deterrent than the “safe third country” pacts.\n\nSheridan reported from Mexico City. Nick Miroff in Washington contributed to this report.\n\nRead more\n\nU.S. officials press Mexico to take more steps to stem migrant surge\n\nTrump wants border-bound asylum seekers to find refuge in Guatemala instead. Guatemala isn’t ready.\n\nA 19-year-old Salvadoran woman wanted to reunite with her father in California. She was shot dead in Mexico.\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "The United States is pushing for “safe third country” agreements throughout Central America.", "authors": ["Claudia Mendoza", "Mary Beth Sheridan", "Correspondent Covering Mexico", "Central America", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/zXtmbxe6oWEdFElRNZydHnDs9eM=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/W7HKPAGVOII6TE2DIDNVPT3KXU.jpg", "published_at": "2019-09-12"}