{"pub": "afr", "url": "https://afr.com/companies/financial-services/salesforce-anz-back-valiant-to-grow-sme-lending-20191018-p5322c", "downloaded_at": "2019-10-20 13:26:14.746376+00:00", "title": "Salesforce, ANZ back Valiant to grow SME lending", "language": "en", "text": "Banks have issued about $230 billion in small-business loans but have been losing ground to a broad range of providers that the Valiant platform is directing loans to, including Pepper, Prospa, Moula, Timelio, Lumi, Scottish Pacific, Liberty Financial, RedZed, FlexiRent and Judo (which is now a bank). Judo last year found SMEs have unsatisfied demand for capital worth $83 billion.\n\nValiant has funded more than $330 million of loans with 75 lenders; about $200 million of this has been done this calendar year. “We are seeing more traction in new partnerships, with customers looking for demonstrated credibility in a post royal commission environment. We are also experiencing significant growth from existing customers, given we can support them across multiple needs during the life-cycle of their business,” said Valiant CEO Alex Molloy.\n\nThe likeability advantage\n\nThe banks still dominate SME lending, but it is a huge market and there is both the room and need for the non-bank lenders, said SME advocate Neil Slonim, who blogs as The Bank Doctor and last week produced detailed analysis on the state of SME lending.\n\n“Non-bank lenders have one hugely significant advantage in that customers actually like them much more than they like the banks. The other big advantage non-bank lenders have is that they can and do move quickly. They are not constrained by legacy systems, convoluted organisational structures and an aversion to change.\"\n\nRob Keith, head of Australia at Salesforce Ventures, said the company is seeking to invest in start-ups innovating in digitising processes, open banking, regulatory technology and application programming interfaces (APIs).\n\n“We want to support our ecosystem, our customers and our partners, to help them become successful and to get more developers excited about building on our platform,” he said.\n\nMr Molloy said Valiant can help credit growth in the economy by accelerating the funding process and professionalising discussions with lenders.\n\n“Businesses are missing opportunities because they leave funding too late and miss the boat. It’s not creating new demand for credit, but it is helping to get more appropriate credit to businesses earlier, which benefits the business and the broader economy,\" Mr Molloy said.", "description": "Valiant sends 80 per cent of funding applications to non-bank lenders such as Pepper, Prospa, Moula, Timelio, Lumi and Liberty Financial.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.8308%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_8%2C$y_39/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/2715a8a19ab5722ced6df65861be689c29542935", "published_at": "2019-10-18"}