{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/elizabeth-warren-shows-contempt-for-legal-constitutional-boundaries", "downloaded_at": "2019-10-11 12:32:27.612734+00:00", "title": "Elizabeth Warren Shows Contempt for Legal & Constitutional Boundaries", "language": "en", "text": "Sen. Elizabeth Warren responds to a question during a forum held by the Giffords group and March For Our Lives in Las Vegas, Nev., October 2, 2019. (Steve Marcus/Reuters)\n\nShe exhibits an open contempt for legal and constitutional boundaries.\n\nThere’s a brewing constitutional crisis, and it is the Elizabeth Warren surge in the Democratic primaries.\n\nShould the Massachusetts senator become president of the United States, she will undertake a historic bout of federal activism unmoored from any serious consideration of constitutional constraints.\n\nThis would far exceed the current “constitutional crisis” over the Ukraine controversy. Impeachment involves the House of Representatives exercising a responsibility clearly bestowed on it with broad latitude by the U.S. Constitution, to punish an act by President Donald Trump that was foolish and improper, but also squarely within his constitutional powers.\n\nAdvertisement\n\nAdvertisement\n\nHouse Speaker Nancy Pelosi likes to say Trump violated the Constitution on his call with the Ukrainian president, but there’s no serious argument for this. The conduct of foreign policy — and horse-trading with foreign leaders — is a core presidential duty.\n\nThe problem was mingling personal political priorities with actions in his official capacity, a symptom of one of the worst aspects of Trump’s presidency, namely his inability or unwillingness to distinguish between himself and his office. Trump doesn’t think institutionally or constitutionally.\n\nAdvertisement\n\nIn contrast to his carelessness and highly personalized view of the presidency, Warren offers a carefully thought-out agenda of open contempt for legal and constitutional boundaries. It’s not that she, a former Harvard Law professor, doesn’t know that they exist; it’s that she doesn’t care.\n\nHer broad approach is if she doesn’t like something about America, she’ll act as president to ban it or curtail it, whether she has the legal or constitutional authority or not. This isn’t a trait personal to her. Instead, it is inherent to progressive government, which from its beginnings in the early 20th century strained against constitutional limits it considered antiquated and unnecessary.\n\nAdvertisement\n\nOne of Warren’s signature domestic proposals is her wealth tax. Without dwelling on the complex legal arguments, her plan is constitutionally dubious, at best, and would instantly end up in the Supreme Court if it ever passed.\n\nAdvertisement\n\nSomeone scrupulously committed to the Constitution would want to steer clear on this basis alone, but “constitutionally or legally suspect” is the unifying thread of much of the Warren agenda.\n\nAs David French points out, her proposed executive order prohibiting fracking obviously runs afoul of a 2005 federal law protecting it from federal regulation. She is promising to do something illegal, pure and simple.\n\nAnd on it goes. She says she would act unilaterally to expand background checks for gun purchases, circumventing Congress. She wants to tax lobbying, an activity protected under the First Amendment, in yet another constitutionally fraught initiative. She wants to break up Big Tech, although it’s not clear under what authority.\n\nAdvertisement\n\nTellingly, almost no one on her side says, “I appreciate what you’re getting at Liz, but you can’t do that.”\n\nTo their credit, a couple of CNN panelists pressed her in July on the constitutional basis of her wealth tax, and she just waved them off. Needless to say, the op-ed pages and airwaves weren’t thick with denunciations of her casual dismissal of the Constitution.\n\nThis gets to a marked, and annoying, hypocrisy in the reaction to Trump’s Ukraine call. The same people who are most convinced that it is somehow unconstitutional or illegal didn’t raise a peep when President Barack Obama rewrote immigration law on his own after repeatedly, and correctly, saying he didn’t have the power to do it.\n\nTo be sure, the reliable, consistent constituency for strictly bounded executive action is vanishingly small. It amounts to about a dozen senators, those Republicans brave enough to oppose Trump’s emergency declaration to repurpose military funding for the border wall, the most problematic of his executive actions.\n\nAdvertisement\n\nAll you need to know about how seriously most of the Left takes the Constitution is that at the same time it’s freaking out about Trump, it’s boosting the prospects of Elizabeth Warren, who is promising to ignore it as a matter of policy.\n\n© 2019 by King Features Syndicate", "description": "All you need to know about how seriously most of the Left takes the Constitution is that at the same time it’s freaking out about Trump, it’s boosting the prospects of Elizabeth Warren, who is promising to ignore it as a matter of policy.", "authors": ["Rich Lowry", "Victor Davis Hanson", "Kevin D. Williamson", "Jim Geraghty", "A. G. Hamilton", "Zachary Evans", "Alexandra Desanctis", "Jonah Goldberg", "Read More", "The American Conservative"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/elizabeth-warren.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-11"}