{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/massive-climate-strikes-erupt-worldwide-for-the-second-week-in-a-row", "downloaded_at": "2019-09-28 01:25:39.089594+00:00", "title": "Massive Climate Strikes Erupt Worldwide For The Second Week In A Row", "language": "en", "text": "Last Friday, an estimated four million people turned out for a global climate strike. This week, millions more are at it again.\n\nWhat began last August with 16-year-old Greta Thunberg striking alone in front of the Swedish parliament has ballooned into a worldwide jolt of unrest. Young adults have mobilised, telling leaders that now is a pivotal moment in climate action history, and the youth are watching to see what they do.\n\nThe past seven days have been particularly momentous for the youth climate movement. First, there was a global strike on Friday last week. Then on Tuesday, a group of 16 children, including Thunberg, filed a landmark international complaint against five nations for violating their rights by not acting on climate change.\n\nThe United Nations Climate Action Summit that same day turned out to be a dud and frustrations in the climate movement have built since.\n\nThis Friday, the kids exploded in huge protests for a second week in a row. Thunberg will be in Montreal to lead a strike later today. The city’s mayor announced they’re making public transit free for the day as they anticipate a massive turnout (previous strikes in March brought out 150,000 students).\n\nBut Friday’s sun first rose in New Zealand where swarms of students and adult supporters took over the streets in cities across the country. Organisers estimate that 3.5 per cent of the country’s population turned out to strike — a key threshold that, research suggests, can lead to major political changes.\n\nThe strikes in New Zealand were particular poignant. When students joined a global strike in March, the Christchurch protest was shut down because of the deadly mass shooting targeting Muslims. The accused shooter was a proponent of ecofascism, a grotesque ideology that mashes up racism and misguided environmental that has popped up elsewhere, most recently with the El Paso shooting last month.\n\nSmaller strikes took place in developing countries from Bangladesh to India to Uganda.\n\nThose countries will be among the most impacted by climate change, with Bangladesh particularly prone to its impacts as the majority of the country is extremely low-lying and vulnerable to sea level rise and storms. The country also hosts massive Rohingya refugee camps that are prone to flooding during monsoon rains and cyclones.\n\nStrikes across Europe also saw young adults overrun streets and plazas. In Vienna, multiple marches took place to accommodate the strikers. In Rome, organisers estimate that 200,000 people showed up to strike.\n\nThough Thunberg is overseas, strikes also continued in Sweden with Greta delivering a video message to Stockholm. Even pop star Robyn tweeted she was going to the Stockholm strike (insert cheesy joke about Greta no longer dancing on her own).\n\nVienna: It's 5 before 12. Already thousands of mainly young people at Praterstern, one of the starting points for today's climate strike in Vienna! #ClimateStrikes#ClimateStrike #EarthStrike #FridayForFuture #FridaysForFuture pic.twitter.com/VpQeMhDcaN — Michael Bonvalot (@MichaelBonvalot) September 27, 2019\n\nThe strike in Stockholm has ended. We were over 10 000 youths and it was amazing. Absolutely exhausted now. Hopefully getting some photos soon! But in the meantime here is a video of @GretaThunberg and everyone else chanting! #FridaysForFuture #GlobalClimateStrikes pic.twitter.com/lMq8ogAOao — Isabelle Axelsson???? (@isabelle_ax) September 20, 2019\n\nIn her speech at the United Nations earlier this week, Thunberg called out the broken economic and political system that’s leveraging her future for short term profit.\n\n“We will let you not get away with this,” Thunberg said.\n\nWith the sustained and growing pressure from the strike movement crashing against the gates of power and inaction like a battering ram, people in power may very well not.", "description": "Last Friday, an estimated four million people turned out for a global climate strike. This week, millions more are at it again....", "authors": ["James Whitbrook", "Gordon Jackson"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/imdijyrsqyhlm6pmrqfw.jpg", "published_at": "2019-09-28"}