{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/callan-potter-globetrot-after-ufc-243-home-win-melbourne-video", "downloaded_at": "2019-10-08 04:11:21.137221+00:00", "title": "Callan Potter ready to globetrot after UFC 243 home win in Australia", "language": "en", "text": "MELBOURNE, Australia – Callan Potter beat Maki Pitolo with a unanimous decision Saturday (Sunday locally) on the preliminary card at UFC 243 at Marvel Stadium in Melbourne, Australia.\n\nTake a look inside the fight with Potter, who at 35 picked up his first UFC win after a 53-second loss in his promotional debut.\n\nResult: Callan Potter def. Maki Pitolo via unanimous decision (29-28, 29-28, 29-28)\n\nUpdated records: Potter (18-8 MMA, 1-1 UFC), Pitolo (12-5 MMA, 0-1 UFC)\n\nKey stat: Pitolo won the striking battle 115-91, but Potter landed three takedowns en route to the win column.\n\nPotter on the fight’s key moment\n\n“Keeping the pressure on him was definitely part of the game plan. If I had to describe that performance, it would be Dan Kelly-esque. Normally, if I get on top of people, it’s usually over. He did a good job of defending.”\n\nPotter on emulating coach Dan Kelly\n\n“The last time UFC was in this stadium, Dan Kelly got a win in almost the same style. That’s huge to me, especially after what I’ve gone through. I’ve had a lot of downs in my career. Even though I’m getting older, I’m showing I have the skills to fight at the top level.”\n\nPotter on what he wants next\n\n“I’d like to have a bit of a rest, but my last two fights have been in Melbourne. I’d like to travel the world and maybe get that Vegas experience in my next fight.”\n\nTo hear more from Potter, check out the video of the full post-fight interview above.\n\nGallery Callan Potter def. Maki Pitolo at UFC 243: Best photos view 14 images", "description": "Take a look inside Callan Potter's win over Maki Pitolo at UFC 243 at Marvel Stadium in Melbourne, Australia.", "authors": ["Matt Erickson", "Ken Hathaway", "Nolan King", "Simon Head", "George Garcia", "Farah Hannoun", "The Blue Corner"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/10/callan-potter-ufc-243-post-fight-interview.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-08"}