{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu-varadkar/irelands-varadkar-says-no-brexit-agreement-reached-in-meeting-with-pm-johnson-idUKKBN1W92GM", "downloaded_at": "2019-09-25 08:44:37.268193+00:00", "title": "Ireland's Varadkar says no Brexit agreement reached in meeting with PM Johnson", "language": "en", "text": "Ireland's Prime Minister Leo Varadkar speaks during the 2019 United Nations Climate Action Summit at U.N. headquarters in New York City, New York, U.S., September 23, 2019.\n\nUNITED NATIONS (Reuters) - Irish Prime Minister Leo Varadkar said on Tuesday he had held a good meeting with Britain’s Boris Johnson but they had not reached an agreement on how to resolve their differences over Brexit.\n\n“It was a good meeting. No agreements by any means, but we got into some more details,” Varadkar told reporters following the meeting with his British counterpart on the sidelines of the United Nations General Assembly in New York.\n\nA UK government official said the pair spent some time discussing the issue of consent for Northern Ireland in any solution to the contentious issue of dealing with the UK-EU border on the island of Ireland.\n\nLondon has signalled it is willing to agree to an alignment of rules in Northern Ireland with the EU after Brexit for animals and food products but wants to include a mechanism of consent for “institutions and parties” in Northern Ireland about which EU rules they would have to implement.\n\n“They did also have a discussion specifically around the issue of consent and from the prime minister’s (Johnson’s) point of view the importance of consent if we are going to get a deal which parliament can support,” the UK official said.\n\n“They had a good and detailed discussion. I think it is clearer they are going to be talking more within the coming days.”", "description": "Irish Prime Minister Leo Varadkar said on Tuesday he had held a good meeting with Britain's Boris Johnson but they had not reached an agreement on how to resolve their differences over Brexit.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190924&t=2&i=1433481744&w=1200&r=LYNXMPEF8N1RM", "published_at": "2019-09-24"}