{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7608993/Two-far-right-extremists-aged-20-26-jailed-total-ten-years.html", "downloaded_at": "2019-10-24 16:07:22.384390+00:00", "title": "Two far-right extremists, aged 20 and 26, are jailed for total of ten years", "language": "en", "text": "Two far-right extremists who encouraged copycat terror attacks in the aftermath of the New Zealand mosque shootings have been jailed.\n\nMorgan Seales, 20, and Gabriele Longo, 26, communicated on a WhatsApp group set up shortly after the attacks in the city of Christchurch on March 15 which left 51 people dead.\n\nThe purpose of the group chat was to encourage users to emulate the accused gunman, Brenton Tarrant, with further attacks on Muslims, Leeds Crown Court heard.\n\nWithin 90 minutes of joining the group, Longo was offering to post files from his online library of bomb-making instructions, which he then did the following day.\n\nMorgan Seales, (right) 20, and Gabriele Longo, (left) 26, communicated on a WhatsApp group set up shortly after the attacks in the city of Christchurch on March 15 which left 51 people dead\n\nWhen one contributor wrote 'let's kill some Muslims', Longo replied: 'Or Jews.'\n\nIn a separate post, Seales wrote: 'The best time to attack a mosque is Friday prayers or a wedding. Everyone there at once.'\n\nThe court heard Seales, from South Shields, had first come to the notice of authorities in 2017 with a Twitter post which displayed the flag of banned neo-Nazi terror group National Action.\n\nHe was then arrested in February 2018 on suspicion of taking screenshots of recipes for explosives. However, police decided not to prosecute Seales, described as 'vulnerable and socially isolated', and tried to deradicalise him through the voluntary Prevent counter-terror programme.\n\nPolice and ambulance staff help a wounded man after the Christchurch shootings on March 15\n\nSupport workers were allocated and he was even treated to a trip to the seaside, the court was told.\n\nSentencing, Judge Tom Bayliss QC said that in reality the progamme had little or no effect as Seales was arrested for the Christchurch messages and the recovery of his mobile phone led to officers tracing Longo.\n\nThe court was told Seales suffered from a personality disorder and had a 'very difficult childhood' in which he battled anxiety and depression with the aid of children's services but had 'fallen through the net' of adult support services.\n\nJudge Bayliss said Longo, from Crawley, West Sussex, was 'something of an enigma' as little was known about him but he was satisfied he was 'deeply radicalised'.\n\nBoth defendants were convicted by a jury of encouraging terrorism, possessing material for terrorist purposes and collecting or making a record of information useful to a terrorist.\n\nFlowers and tributes are placed around the Botanic Gardens in Christchurch on March 17\n\nLongo was also found guilty of disseminating terrorist publications.\n\nHe was jailed for six years and must serve an extended licence period of 12 months.\n\nSeales, was jailed for four years and will be on extended licence for two years when released.\n\nJudge Bayliss told both men that their 'personal inadequacies and isolation' explained to some extent why they engaged in the group chats.\n\nHe added: 'Both of you were in danger of indoctrinating others in that group chat. There were some very young people, some as young as 14.\n\n'Your activity posed not only a threat to Muslims who were your potential victims but also a threat to everyone in our democratic society.'", "description": "Morgan Seales, 20, and Gabriele Longo, 26, (pictured) communicated on a WhatsApp group set up shortly after the attacks in the city of Christchurch on March 15, Leeds Crown Court heard.", "authors": ["Joe Middleton For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/12/20128712-0-image-a-62_1571916468953.jpg", "published_at": "2019-10-24"}