{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/breaking-man-found-guilty-murdering-20755462", "downloaded_at": "2019-10-30 16:05:43.903709+00:00", "title": "Man found guilty of murdering pregnant wife in 1999 jailed for life", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA sailor who was convicted of murdering his pregnant wife has been jailed for life with a minimum of 20 years.\n\nMum-of-three Debbie Griggs was pregnant with her fourth child when she disappeared without a trace from her home in Deal, Kent in 1999.\n\nAndrew Griggs, 57, of Saint Leonards, Dorset, was found guilty of her murder on Monday following a five-day trial at Canterbury Crown Court.\n\nProsecutor Duncan Atkinson QC said Debbie's body was disposed of and her car was found dumped streets away from her home in Deal, Kent.\n\n(Image: Police handout)\n\n(Image: SWNS)\n\nMs Grigg's father has said her mother \"died of a broken heart\".\n\nGriggs had denied murder and claimed to be asleep when his wife left home for the last time.\n\nMr Justice Robin Spencer, sentencing Griggs, said: \"Her body has never been found, only you know how you killed her and where you disposed of her body.\n\n\"You told lie after lie in the witness box, just as you did at the time of Debbie's disappearance.\n\n\"In murdering your wife you destroyed the life of that unborn child as well.\n\n\"I strongly suspect that you dumped her body at sea.\n\n\"You knew that stretch of coast like the back of your hand. It would not have been difficult to weigh her body down so that it sank.\"\n\n(Image: PA)\n\nThe judge said the length of time Ms Grigg's body has been concealed for - 20 years - and the fact that Griggs has still not revealed its location, was an aggravating factor in sentencing.\n\n\"You robbed the mother of her children and her family of the very thing you have enjoyed over those 20 years.\n\nMr Justice Spencer paid tribute to Ms Griggs, of whom he said \"caring was her very nature\".\n\nHe said he had \"no doubt whatsoever\" that Andrew Griggs had been in a \"full sexual relationship\" with a teenage girl in the months before his wife disappeared.\n\nHe said he had \"no doubt whatsoever\" that Andrew Griggs had been in a \"full sexual relationship\" with a teenage girl in the months before his wife disappeared.\n\n(Image: PA)\n\nMr Justice Spencer told the court that he had to sentence Griggs in line with the law that was in place at the time of the killing.\n\nDet Chief Insp Kaye Braybrook of the Kent and Essex serious crime directorate said: \"Debbie Griggs was a loving mother of three young sons and with a fourth child on the way.\n\n\"The jury heard from a number of witnesses who all agreed she would have never abandoned them, and was not the depressed, unstable and violent person Andrew Griggs has gone to great lengths to paint her as.\n\n(Image: Police handout)\n\n\"While Debbie’s body has never been found, we are certain she died at the hands of her husband.\n\n\"There is no other plausible explanation as to what happened to her, nor any other person who is likely to have been responsible for her disappearance.\n\n\"Andrew Griggs has proven himself to be a callous and manipulative individual who has gone to great lengths to destroy his wife’s reputation.\"", "description": "Andrew Griggs, 57, was convicted of murdering mum-of-three Debbie Griggs - despite her body never being found", "authors": ["Neil Murphy", "Image", "Kentlive", "Police Handout", "Swns", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20743487.ece/ALTERNATES/s1200/0_Griggs.jpg", "published_at": "2019-10-30"}