{"pub": "foxnews", "url": "https://foxbusiness.com/real-estate/wework-halts-new-leases-in-bid-to-cut-losses", "downloaded_at": "2019-09-27 05:39:31.286936+00:00", "title": "WeWork halts new leases in bid to cut losses", "language": "en", "text": "WeWork is halting all new lease agreements with property owners as the company - which is bleeding money - tries to rapidly rein in its costs, according to people briefed on the matter.\n\nContinue Reading Below\n\nThe move will rattle commercial property owners across the globe who rented to WeWork, and landlords have been bracing for the possibility that WeWork - which has become the biggest tenant in New York and one of the largest in London - could suspend its expansion.\n\nThe decision to stop all new leases comes as WeWork’s parent group - the We Company - is planning to lay off thousands of its 12,000-plus employees in the coming weeks.\n\nOn Thursday, the company also planned to cut the jobs of roughly 20 employees with close ties to co-founder – and former chief executive - Adam Neumann, including some of its top managers, those who had been briefed said.\n\nAmong the senior figures under pressure are vice-chairman Michael Gross and Chris Hill, a brother-in-law of Neumann’s wife, Rebekah. Gross was among the most senior executives and accompanied Artie Minson -who was elevated to co-chief executive of WeWork this week, alongside Sebastian Gunningham - on investor roadshows last year.\n\nAdvertisement\n\nOthers, in what one insider described as “Adam’s posse,” caught up in the cuts include a company driver for Neumann’s Maybach. The new co-CEOs have also put up for sale a Gulfstream G-650 jet which WeWork bought new for more than $60 million last year.\n\nHill rose quickly through the company ranks, holding titles including “chief We officer” of its Japanese operations, and was most recently chief product officer of the whole group.\n\nJennifer Berrent - the chief legal officer who was seen as having been sidelined by the promotion of Minson and Gunningham to co-CEOs - was expected to remain at the company, some of the people added. Berrent was co-president alongside Minson before he stepped up this week.\n\nFormer staff said the cost cuts indicated that Minson and Gunningham were sending a signal to Wall Street that they were serious about changing a culture known for its excesses. The looming departures of the employees with close ties to Neumann was earlier reported by The Wall Street Journal.\n\nThe co-CEOs have made the decision to sell three of the acquisitions made under Neumann — Conductor, Managed by Q and Meetup — for which they have already received tentative expressions of interest in recent days, two people briefed on the matter said.\n\nHowever, the company is expected to retain Flatiron School, a coding education business it purchased two years ago.\n\nWeWork’s Chelsea headquarters has been in crisis since Neumann was pushed out as chief executive on Tuesday in the wake of the dramatic collapse of its initial public offering, which had been expected to be a highlight in a banner year for IPOs. Instead, the company is now trying to secure a new financing lifeline.\n\nThe group burned through capital with its expansion to more than 500 offices in 111 cities, and last year it reported a loss of $1.6 billion on sales of $1.8 billion.\n\nThe company will get a short-term boost as it is due to receive a $1.5 billion capital injection next year from its largest backer, Japan’s SoftBank. The two sides have been in talks over an increase to SoftBank’s planned injection of at least $1 billion, with negotiations centered on the valuation cut WeWork would be dealt in the transaction.\n\nFresh capital is critical for WeWork, which is also seeking to clinch a much-reduced $3-$4 billion loan from a group of Wall Street banks. The lenders are refusing to bankroll a deal of that size unless WeWork first raises new equity, according to multiple sources.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nCreditors have raised concerns over its capital reserves, which stood at roughly $2.5 billion at the end of June, and on Thursday analysts S&P Global cut the company’s credit rating deeper into junk territory. The yield on WeWork’s debt surged above 10 per cent on the downgrade, in a sign of the financial strain on the group.", "description": "See the steps WeWork is taking to cut costs in wake of Adam Neumann's departure.", "authors": ["Jason Schott"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/WeWork-grab.jpg?ve=1&tl=1", "published_at": "2019-09-27"}