{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/26/devin-nunes-rips-adam-schiffs-hunt-naked-trump-pho", "downloaded_at": "2019-09-26 16:50:42.506368+00:00", "title": "Devin Nunes rips Adam Schiff's hunt for naked Trump photos in whistleblower hearing", "language": "en", "text": "Rep. Devin Nunes took a jab at rival Rep. Adam Schiff on Thursday by bringing up the time the Democrat thought he was talking to a Ukraine official who could get him Moscow-provided photos of a naked Trump.\n\nIt is believed to be the first time member of the House Permanent Select Committee on Intelligence, which Mr. Schiff chairs, referred to what has become the brunt of conservative joy on social media.\n\nThe 2017 phone call was a prank by Russian comedians Vladmire Kyzetsov and Alexei Stolyarov who convinced to Mr. Schiff, then the ranking member, they could obtained the damning photos.\n\nMr. Schiff was a big proponent of the discredited Democrat Party dossier. It contained an allegation of Mr. Trump romping with prostitutes in a Moscow hotel room in 2013.\n\nConservatives says it was an example of Mr. Schiff colluding with what he thought was a Russian-linked politician to try to influence American politics––his exact charge against Mr. Trump.\n\nMr. Schiff thought he was speaking with the chairman of the Ukraine parliament.\n\nSEE ALSO: Whistleblower’s complaint cites ‘multiple’ White House employees sounding alarm about Trump\n\n“I would caution that our Russian friends may be listening to the conversation so I wouldn’t share anything over the phone that you wouldn’t want them to hear,” Mr. Schiff says during the eight-minute call which is posted on YouTube and other sites.\n\n“Ok, Mr. Schiff says, “and what’s the nature of the kompromat,” using the Russian word for blackmail material.\n\nThe comedian replies, “Well, there were pictures of naked Trump.”\n\n“Obviously we would welcome the chance to get copies,” Mr. Schiff says.\n\n‘I’ll be in touch with the FBI about this. And we’ll make arrangements with your staff. I think it probably would be best to provide these materials both to our committee and to the FBI,” Mr. Schiff says.\n\nMr. Nunes, California Republican, brought up the prank at Thursday’s hearing with acting Director of National Intelligent Joseph Maguire. He did not mention Mr. Schiff by name.\n\n“Democrats on this very committee negotiated with people they thought were Ukrainians in order to obtain nude pictures of Trump,” Mr. Nunes said.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Rep. Devin Nunes took a jab at rival Rep. Adam Schiff on Thursday by bringing up the time the Democrat thought he was talking to a Ukraine official who could get him Moscow-provided photos of a naked Trump.", "authors": ["The Washington Times Http", "Rowan Scarborough"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/House_Intelligence_98199.jpg-b4ae5_c0-195-4661-2912_s1770x1032.jpg?2b193ce067b0b40a24c9b8ee5e559436b726541b", "published_at": "2019-09-26"}