{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/unai-emery-says-granit-xhaka-20753081", "downloaded_at": "2019-10-30 00:07:29.159972+00:00", "title": "Unai Emery says Granit Xhaka will apologise to Arsenal fans", "language": "en", "text": "Get the biggest Arsenal FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nUnai Emery has told Granit Xhaka to apologise for telling his own supporters to “f*** off.”\n\nBut the Gunners manager claims it is too soon to strip Xhaka of the Arsenal captaincy, saying: “He is not ready (to say sorry) because he is feeling down.”\n\nThe Swiss skipper has been left out of the squad for tonight's Carabao Cup tie at Liverpool , where £350,000-a-week Mesut Ozil will feature for the first time after six games in exile.\n\nBut more than 48 hours since his monumental strop after being hauled off in the 2-2 draw with Crystal Palace , Xhaka has NOT been disciplined by the club, has NOT had the armband taken away – and has NOT said sorry to the fans.\n\n(Image: Action Images via Reuters)\n\nXhaka responded to being hooked by tossing the armband towards deputy Pierre-Emerick Aubameyang, sarcastically conducting the fans' jeers and decorating his exit with an F-word towards his critics and tearing off his shirt in frustration.\n\nAsked if his captain should apologise, Emery agreed: “Yes – when we make individually some mistakes, we need to make some apologies. I prefer to do that and we have suggested he do that.\n\n“We can suggest to give his apology, but he is not ready, not in his mind with that situation.\n\n“Now he is devastated, he is upset, he is down, and right now the most important thing is how he is feeling.”\n\nXhaka, Calum Chambers and Pierre-Emerick Aubameyang are among the players Emery has left at home for tonight's League Cup tie at Anfield.\n\nMesut Ozil, who has not featured since the win over Nottingham Forest in last round, is in the frame to make his first appearance in a month.", "description": "Xhaka will not play for Arsenal at Liverpool in Wednesday night's Carabao Cup clash at Anfield", "authors": ["Mike Walters", "Image", "Action Images Via Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20753287.ece/ALTERNATES/s1200/0_Arsenal-FC-v-Crystal-Palace-Premier-League.jpg", "published_at": "2019-10-29"}