{"pub": "theverge", "url": "https://theverge.com/2019/10/17/20919026/samsung-galaxy-s10-ultrasonic-fingerprint-sensor-security-flaw-screen-cover-protector", "downloaded_at": "2019-10-18 01:07:58.602377+00:00", "title": "Samsung to patch the Galaxy S10’s fingerprint sensor over screen protector concerns", "language": "en", "text": "Earlier this week, a report published in The Sun claimed that the Samsung Galaxy S10’s in-display fingerprint sensor has a security flaw. Apparently, certain “gel cover”-style screen protectors can confuse the ultrasonic sensor, and if you register a fingerprint while the cover is applied, then the phone can start unlocking itself for anyone’s fingerprint, not just those you’ve registered.\n\nAfter initially issuing a statement saying that customers should only use “Samsung authorized accessories” with their device, Samsung now says it’s going to fix the issue. The company told BBC News that it is “aware of the case of S10’s malfunctioning fingerprint recognition and will soon issue a software patch.” One Twitter user claimed that the Note 10, which uses a similar sensor, is also susceptible to the same issue.\n\nGlass screen protectors can also cause problems\n\nSince the S10 was announced, we’ve known that it doesn’t work well with certain kinds of screen protectors. In a video posted back in February, Marques Brownlee demonstrated how the phone will struggle to identify a previously registered fingerprint after you apply a thick glass screen protector. However, he didn’t try registering a fingerprint after this screen protector was applied, which is what seems to have happened here. A regular plastic protector tested by Brownlee appeared to work just fine.\n\nSamsung’s official support site admits that certain screen protectors can be a problem for the phone, noting that “unofficial, scratched or dirty screen protectors may cause the fingerprint sensor to malfunction.” The company has also said that some screen protectors that come with silicone phone cases can be recognized alongside fingerprints by the phone’s sensor, according to a message in Samsung’s support app, Reuters notes.\n\nIf you’re worried about the apparent security risks here, but you absolutely need to have a screen protector on your phone, then the simplest solution is to use the screen protector that comes pre-applied to the device. It might be a basic sheet of plastic that’s unlikely to last you a lifetime, but you can always replace it when it inevitably gets scratched. When that happens, you probably don’t need to go for Samsung’s official $29.99 screen protector, but maybe you can buy something a little better than a £2.70 gel cover from eBay.", "description": "A new report has claimed that the Samsung Galaxy S10’s in-display fingerprint sensor has a security flaw. Apparently, certain screen protectors can confuse the ultrasonic sensor, causing it to unlock for anyone’s fingerprint.", "authors": ["Jon Porter", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/W423krKhdyu-_PYeMv0lWyWEhpQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14843658/akrales_190228_3255_0100.jpg", "published_at": "2019-10-17"}