{"pub": "yahoo", "url": "https://finance.yahoo.com/news/m-tropole-t-l-vision-053834663.html", "downloaded_at": "2019-10-08 09:40:57.758300+00:00", "title": "Should Métropole Télévision S.A. (EPA:MMT) Be Part Of Your Dividend Portfolio?", "language": "en", "text": "Today we'll take a closer look at Métropole Télévision S.A. (EPA:MMT) from a dividend investor's perspective. Owning a strong business and reinvesting the dividends is widely seen as an attractive way of growing your wealth. Unfortunately, it's common for investors to be enticed in by the seemingly attractive yield, and lose money when the company has to cut its dividend payments.\n\nWith Métropole Télévision yielding 6.5% and having paid a dividend for over 10 years, many investors likely find the company quite interesting. It would not be a surprise to discover that many investors buy it for the dividends. The company also returned around 0.9% of its market capitalisation to shareholders in the form of stock buybacks over the past year. Some simple research can reduce the risk of buying Métropole Télévision for its dividend - read on to learn more.\n\nExplore this interactive chart for our latest analysis on Métropole Télévision!\n\nENXTPA:MMT Historical Dividend Yield, October 8th 2019 More\n\nPayout ratios\n\nCompanies (usually) pay dividends out of their earnings. If a company is paying more than it earns, the dividend might have to be cut. So we need to form a view on if a company's dividend is sustainable, relative to its net profit after tax. Métropole Télévision paid out 73% of its profit as dividends, over the trailing twelve month period. This is a healthy payout ratio, and while it does limit the amount of earnings that can be reinvested in the business, there is also some room to lift the payout ratio over time.\n\nAnother important check we do is to see if the free cash flow generated is sufficient to pay the dividend. Métropole Télévision paid out 61% of its cash flow as dividends last year, which is within a reasonable range for the average corporation. It's positive to see that Métropole Télévision's dividend is covered by both profits and cash flow, since this is generally a sign that the dividend is sustainable, and a lower payout ratio usually suggests a greater margin of safety before the dividend gets cut.\n\nWhile the above analysis focuses on dividends relative to a company's earnings, we do note Métropole Télévision's strong net cash position, which will let it pay larger dividends for a time, should it choose.\n\nConsider getting our latest analysis on Métropole Télévision's financial position here.\n\nDividend Volatility\n\nFrom the perspective of an income investor who wants to earn dividends for many years, there is not much point buying a stock if its dividend is regularly cut or is not reliable. For the purpose of this article, we only scrutinise the last decade of Métropole Télévision's dividend payments. The dividend has been stable over the past 10 years, which is great. We think this could suggest some resilience to the business and its dividends. During the past ten-year period, the first annual payment was €0.85 in 2009, compared to €1.00 last year. Dividends per share have grown at approximately 1.6% per year over this time.\n\nDividends have grown relatively slowly, which is not great, but some investors may value the relative consistency of the dividend.\n\nDividend Growth Potential\n\nWhile dividend payments have been relatively reliable, it would also be nice if earnings per share (EPS) were growing, as this is essential to maintaining the dividend's purchasing power over the long term. Earnings have grown at around 5.5% a year for the past five years, which is better than seeing them shrink! Earnings per share are growing at an acceptable rate, although the company is paying out more than half of its profits, which we think could constrain its ability to reinvest in its business.\n\nStory continues", "description": "Today we'll take a closer look at Métropole Télévision S.A. (EPA:MMT) from a dividend investor's perspective. Owning a...", "authors": ["Simply Wall St"], "top_image": "https://s.yimg.com/uu/api/res/1.2/kg.o5NHH4fLFwdxidnAqVw--~B/aD00MzI7dz0xMTk0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/simply_wall_st__316/b4d671ffa100ad8f81cd5cb9b65f1585", "published_at": "2019-10-08"}