{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7624127/Kanye-West-claims-Democrats-make-black-Americans-abort-children.html", "downloaded_at": "2019-10-29 02:52:09.989463+00:00", "title": "Kanye West claims Democrats make black Americans 'abort their children'", "language": "en", "text": "Kanye West claims black Americans have been 'brainwashed' into voting for the Democratic Party despite the fact they promote policies that may be harmful to them.\n\nThe controversial rapper, 42, made the declaration in an explosive interview with radio host Big Boy on Friday while promoting his new Christian-themed album, Jesus Is King.\n\nWhen asked about his support for President Donald Trump, West explained that he doesn't believe it is smart for black Americans to bloc vote for Democrats, claiming: 'You are quite easily controlled if they know everybody gonna be blue [Democrat]. If you go to a white [person] bar, you gonna hear people talking Independent, you gonna hear people talking Democrat, you gonna hear people talking Republican'.\n\nIn the 2016 Presidential Election, 88% of black Americans voted Democrat, while only 8% of that same demographic voted Republican.\n\nWest went on to take a swipe at Democratic lawmakers, saying: ''We're [black Americans] brainwashed out here, bro. Come on, man. This is a free man talking.\n\n'Democrats had us voting for Democrats with food stamps for years. What are you talking about guns in the 80s, taking the fathers out the home, Plan B, lowering our votes, making us abort children.'\n\nKanye West claimed black Americans have been 'brainwashed' into voting for the Democratic Party in an explosive interview with Big Boy on Friday\n\nWest infamously expressed his support for Trump last year, visiting the Republican President at the White House and donning a red Make America Great Again cap.\n\nWhen asked if he was tacitly endorsing racism with his support for Trump, West flipped the question around, saying: 'The most racist thing a person can tell me is that I'm supposed to choose something based on my race'.\n\nWest also clarified in the interview that he would not tell any black American how to vote, bizarrely stating: ''I'm not telling nobody to not vote Democrat, I love Obama, I love lemonade, I love Wingstop, I love polos, I love Jordans'.\n\nWest went on to to take a swipe at Democratic lawmakers, saying: ''We're [black Americans] brainwashed out here, bro. Come on, man. This is a free man talking.'\n\nElsewhere in the interview, the Gold Digger hitmaker insisted he wasn't worried about being 'cancelled' over his controversial opinions.\n\nThe born-again Christian remarked: 'I'm only afraid of my daddy, God. I done been 15 years. I'm telling you that God is showing you that you can have your own thoughts, bro. I been canceled before there was cancel culture.\"\n\nWest also expressed his disdain for social media, despite being married to Kim Kardashain - one of Instagram's most popular stars.\n\n'Instagram got your b*tch... social media [is] doing more to hurt families and families are the key to health,' he proclaimed.\n\nHis interview with Big Boy was just the latest in a series of headline-hitting interviews West has conducted in the past week.\n\nWest caused controversy when he donned a Make America Great Again cap last October and visited President Trump in the White House\n\nWest is pictured in the Oval Office with Trump on October 11 2018\n\nSpeaking with Zane Lowe on Beats 1 on Friday, West revealed he asked producers to abstain from sex while they worked on his new religious album.\n\n'There were times where I was asking people not to have premarital sex while they were working on the album,' Kanye revealed to\n\n'I know that's one where The Shade Room gonna be like: 'What you mean, don't have premarital sex? You better turn that Meg Thee Stallion on right now.' But seriously there's times where I went to people that were working on other projects and said: 'Could you just work and focus on this?''\n\nIn the bombshell interview, he also recalled an addiction to pornography that he says began when he came upon a copy of Playboy as a child.\n\n'Playboy was my gateway into full-on pornography addiction. My dad had a Playboy left out at age five, and it's affected almost every choice I made for the rest of my life from age five to now, having to kick the habit,' he revealed.\n\nWest's album, Jesus Is King, was released on October 25\n\nWest's album, Jesus Is King, was released on October 25.\n\nReligious song titles on the 11-track album include Closed On Sunday, Jesus Is Lord, God Is, On God and Use This Gospel.\n\nMeanwhile, it appears his wife is also following in his devout footsteps.\n\nKardashian had her and West's four children baptized this month during a family trip to Armenia, where she has roots on her father's side.", "description": "The controversial rapper, 42, made the declaration in an explosive interview with radio host Big Boy on Friday while promoting his new Christian-themed album, Jesus Is King.", "authors": ["Andrew Court For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/01/20307788-0-image-a-15_1572313638957.jpg", "published_at": "2019-10-29"}