{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/29/pollak-5-problems-with-the-democrats-impeachment-inquiry-resolution", "downloaded_at": "2019-10-30 02:25:19.746075+00:00", "title": "Pollak: 5 Problems with the Democrats’ Impeachment Inquiry Resolution", "language": "en", "text": "Democrats released the text Tuesday of their resolution to authorize an impeachment inquiry into President Donald Trump, with the vote to be held on Thursday.\n\nSpeaker of the House Nancy Pelosi (D-CA), who argued for weeks that the House had no constitutional obligation to vote to authorize a inquiry, finally relented, which Republicans cited as an admission that the process has been a sham.\n\nThere are additional problems with the resolution — which Democrats never opened to negotiation with Republicans:\n\n1. The resolution gives authority to the House Intelligence Committee that it has never had before. Prior impeachments have been handled by the House Judiciary Committee. The new resolution directs several other committees — Intelligence, Foreign Affairs, Oversight, and Ways and Means — to continue ongoing inquiries as impeachment inquiries, creating a giant net encompassing everything from Trump’s tax returns to his private businesses. Moreover, the resolution seems unclear about whether the Intelligence committee an continue with secret hearings — a power that Rep. Adam Shciff (D-CA) has arguably abused thus far to disseminate pro-impeachment propaganda. (The text says that the chair shall conduct “an open hearing or hearings,” which lends itself to multiple interpretations.)\n\n2. The resolution does not provide the minority with equal subpoena power, as in the past. When the House authorized the impeachment inquiry into President Bill Clinton in 1998, its resolution allowed the (Republican) chair and the (Democrat) ranking member on the House Judiciary Committee to call witnesses. In the case of disagreement from either side, the full committee would vote. Under the new proposal for the Trump inquiry, the (Democratic) chairs of the Intelligence and the Judiciary Committees do not have to submit witnesses to the full committee for approval if the (Republican) ranking members disapprove. Only the ranking member has to do so.\n\nCompare the text of the 1998 resolution with the new one.\n\nIn the Clinton inquiry, subpoenas could be issued\n\nby the chairman and the ranking minority member acting jointly, or, if either declines to act, by the other acting alone, except that in the event either so declines, either shall have the right to refer to the committee for decision the question whether such authority shall be so exercised and the committee shall be convened promptly to render that decision [emphasis added]\n\nIn the Democrats’ new proposal, the chair has a veto over the ranking member — but not vice versa:\n\nIn the case that the chair declines to concur in a proposed action of the ranking minority member … the ranking minority member shall have the right to refer to the committee for decision the question whether such authority shall be so exercised and the chair shall convene the committee promptly to render that decision, subject to the notice procedures for a committee meeting …\n\n3. The resolution waters down minority powers over the release of Intelligence transcripts. As attorney Samuel Dewey pointed out to Neil Cavuto on Tuesday on Fox News, the new rules actually give Schiff more power over the release of transcripts, even allowing him to release transcripts of interviews that have been edited — unilaterally.\n\n4. The resolution does not compel the release of past testimony. Given the secretive and one-sided nature of the process thus far, basic fairness would suggest that the transcripts of previous testimony be released. The resolution does nothing of the sort, allowing the negative spin produced by the Democrats’ previous abuses to go uncorrected.\n\n5. The resolution restricts the president’s right to be represented. The resolution refers to “procedures as to allow for the participation of the President and his counsel,” but these do not seem to kick in until the process reaches the Judiciary Committee, meaning that the president will not be represented in other committees. It is not clear whether earlier witnesses, whom the president’s counsel could not cross-examine, would later be recalled.\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.\n\nThis post has been updated for clarity.", "description": "Democrats released the text Tuesday of their resolution to authorize an impeachment inquiry. But it is deeply -- perhaps fatally -- flawed.", "authors": ["Joel B. Pollak"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1178586441-640x335.png", "published_at": "2019-10-29"}