{"pub": "reuters", "url": "https://reuters.com/article/us-mbank-m-a-stocks/polands-mbank-rises-on-speculation-about-commerzbank-sale-plans-idUSKBN1W91GR", "downloaded_at": "2019-09-24 14:06:23.944875+00:00", "title": "Poland's mBank rises on speculation about Commerzbank sale plans", "language": "en", "text": "WARSAW (Reuters) - Shares in mBank (MBK.WA) hit their highest level since early August on Tuesday, partly in response to speculation that Poland’s fourth largest lender by assets is up for sale.\n\nFILE PHOTO: The headquarters of the Commerzbank are pictured before the bank's annual news conference in Frankfurt, Germany, February 8, 2018. REUTERS/Ralph Orlowski/File Photo\n\nmBank shares rose 5.7% to 346.4 zloty ($86.90) by 1053 GMT.\n\nLast week, Commerzbank (CBKG.DE), partly owned by the German government after a bailout and struggling to generate profits, said it aims to sell a stake in mBank in which it has a 69.3% shareholding worth about $2.56 billion.\n\n“I expect there will be a significant interest in mBank. Among local favorites would name state-run PKO BP and Pekao,” Kamil Stolarski, banking analyst at Santander in Warsaw said.\n\n“Other banks that have ambitions to increase market share could (also) engage in the transaction, for example BNP Paribas, ING, or even maybe Bank Millennium.”\n\nMarta Czajkowska-Baldyga, banking analyst at Haitong Bank in Warsaw, said the share price rise was connected with speculation about the mBank sale.\n\n“Both state-run banks and other smaller lenders interested in increasing their market share might be interested in mBank.”\n\nPoland’s Prime Minister, Mateusz Morawiecki, said on Tuesday that any decision to buy mBank should be taken on business grounds, commenting on speculation about potential interest in the bank from state-run banks.\n\nAnalysts expected that Poland’s financial sector authority KNF would require Commerzbank to sell mBank without a portfolio of around 3.7 billion Swiss franc mortgages as the regulator did in number of previous transactions.\n\nKNF was not immediately available for comment.\n\nThe Swiss franc mortgage problems date back to the early 2000s when people in Poland took out loans denominated in Swiss francs, attracted by interest rates far below those available in the local currency.\n\nBut more recently the Swiss franc has risen in value so that many borrowers are having to pay far more than they expected. Many borrowers in Poland have taken their banks to court over these loans.", "description": "Shares in mBank hit their highest level since early August on Tuesday, partly in response to speculation that Poland's fourth largest lender by assets is up for sale.", "authors": ["Marcin Goclowski", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190924&t=2&i=1433323111&w=1200&r=LYNXMPEF8N10J", "published_at": "2019-09-24"}