{"pub": "yahoo", "url": "https://sports.yahoo.com/dave-roberts-takes-jab-at-orioles-pitcher-whose-epic-mishap-helped-dodgers-win-033645640.html", "downloaded_at": "2019-09-13 07:53:32.874885+00:00", "title": "Dodgers turn strikeout into goldmine thanks to Orioles' blunders", "language": "en", "text": "There are almost no words to describe how the Baltimore Orioles turned a bases loaded strikeout that should have ended an inning into two runs for the Los Angeles Dodgers.\n\nWe'll do our best anyhow.\n\nThat's the exact scenario that played out during Thursday's game at Orioles Park at Camden Yards. The Dodgers not surprisingly won the game, 4-2. But it's possible they might not have — at least not in nine innings — had the play we're talking about not happened.\n\nScroll to continue with content Ad\n\nIt was a play so absurd, even Dodgers manager Dave Roberts couldn't help but throw shade at the Orioles. But we'll get to that later.\n\nWhat happened\n\nWith the game tied and two outs in the sixth inning, Martin came to bat with the bases loaded. Bundy technically won the battle by striking out Martin with a high fastball. However, catcher Pedro Severino was unable to corral the pitch, and instead deflected it all the way to the backstop.\n\nSince Severino didn’t secure the ball, Martin had to be thrown out at first base to complete the out.\n\nThat throw never came.\n\nIn fact, no throw came.\n\nAs Cody Bellinger ran in from third base and Corey Seager raced all around the way around from second base, Dylan Bundy never bothered to cover home plate.\n\nWell, that about sums up the year its been for Dylan Bundy. He strikes out Russell Martin to strand the bases loaded -- but TWO runs score when the ball gets past Pedro Severino.\n\n\n\nHow. — Joe Trezza (@JoeTrezz) September 13, 2019\n\nFor what it’s worth, Severino was charged with a passed ball on the play. That means both runs will be unearned and won’t count against Bundy’s ERA.\n\nWhat Dave Roberts said\n\nStory continues\n\nAfter the game, Orioles manager Brandon Hyde explained that Bundy thought Martin foul-tipped the pitch, which would continue the at-bat.\n\nRoberts saw it differently.\n\nBrandon Hyde said Dylan Bundy didn't cover home on tonight's passed ball because he thought it was foul.\n\n\n\nDave Roberts was a bit harsher:\n\n\n\n\"Bundy threw the ball well, got frustrated and, to be quite honest, quit on the play,\" Roberts said. \"To take advantage of it was big.\" — Joe Trezza (@JoeTrezz) September 13, 2019\n\nIt’s not often you hear a manager accuse another team’s player of quitting on a play, but Roberts obviously felt comfortable doing so here.\n\nWhether that’s true is something only Bundy knows. But Bundy has to know it wasn’t a good look to not make an effort regardless of what he was thinking. His one job once the ball gets by the catcher is to cover home plate, and he never took one step in that direction.\n\nDifferent directions\n\nIf ever there was a play that could accurately illustrate the current state of these two teams, this would be it.\n\nThe heads up Dodgers improved to 96-51, which is the best mark in the National League. In fact, they’ve already clinched the NL West for the seventh straight season.\n\nThe bumbling, stumbling and rebuilding Orioles are closing in on their second straight 100-loss season.\n\nThe direction each team is traveling couldn’t be any different, and a play like this gives us startling evidence of just how far apart they really are.\n\nMore from Yahoo Sports:", "description": "The Dodgers turned an inning-ending strikeout into two game-decided runs thanks to the Orioles being the Orioles.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/I0LXsWqW1pvoRKZXPE7etA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuMjY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/qTW3DK8O2r7EXDezLVVYyQ--~B/aD0zMjgwO3c9NDkyODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/a8a111b0-d5f6-11e9-ae67-a7eb1770fac2", "published_at": "2019-09-13"}