{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7631831/We-just-want-bring-brave-girls-body-home.html", "downloaded_at": "2019-10-30 23:25:32.197805+00:00", "title": "We just want to bring our brave girl's body home", "language": "en", "text": "There is a place ready for Anna Campbell, next to where her mother’s ashes were scattered, in St John’s churchyard on the same Sussex street where she grew up.\n\nBut her grieving family, crushed by the sorrow of losing 26-year-old Anna to a missile strike in northern Syria last year, can’t even lay her to rest — because they have not been allowed to reclaim her body.\n\nHer elder sister, Hester, a yoga teacher with three young children, says that because they have not had a death certificate, nor been able to bury Anna, she can find no end to her profound grief.\n\nWeeping, Hester explains: ‘I had this fantasy for ages that Anna was hiding, that she was only missing but wasn’t gone. I really wanted that to be true.\n\n‘I would be looking for her and I would think I saw her some place; catch the back of someone’s head that looked a bit like Anna.\n\nThe family of Anna Campbell, 26, (pictured) revealed the pain of being unable to lay her body to rest, 19 months after she was killed in Syria\n\n‘I understand what it must be like for a family when they have a missing person, because they can never give up hope that they might be found.’\n\nBut there is, sadly, no doubt at all that Anna is dead. Hester and her father, Dirk, are speaking out now because the family has just launched a legal battle to bring Anna’s remains back home, and hope to ‘crowdfund’ enough money to pay for it.\n\nIt’s a position they could never have imagined themselves in. Indeed, the story of Anna’s life is almost worthy of a Hollywood film script — a privately educated Sussex schoolgirl, raised in comfort, surrounded by love and encouraged to stand up for her convictions, she became consumed by a desire to help Kurds in Syria fight for a land of their own against Isis.\n\nIt was a quest that saw her make a secret 2,500-mile journey to fight, wielding AK-47s in a dusty battlefield, only to die in a terrible manner her family still struggle to comprehend. The fracture her death has left is still very much apparent as Hester plays with her infant son Marlowe, the nephew Anna never met.\n\n‘If you had been a girl you would definitely have been called Anna,’ Hester, now 39, tells the gurgling four-month-old.\n\nIn fact, it was only when Hester became pregnant, eight months after Anna’s death, that she was able to stop crying near constantly. Her almost unbearable feeling of loss, she says, was briefly elevated by a surge of happy hormones in the weeks following conception.\n\n‘It brings you into the present, having a tiny baby,’ she says, adding: ‘It is devastating for me that he won’t know his auntie.’\n\nShe pauses, gazing down at Marlowe, her third child after daughter Wren, nine, and son Drake, three.\n\nWhile theirs is undoubtedly a privileged family — Dirk is a folk musician and renowned composer, whose work has appeared in films including Aladdin and Harry Potter And The Goblet Of Fire — it is notable how close-knit the Campbells are; how idyllic the girls’ childhood sounds.\n\nHester recounts how, on Anna’s 13th birthday, the sisters played in the woods behind their home and sang about Anna not wanting to be a teenager.\n\nHester recalls Anna (pictured second from left with her dad Dirk and late mum Adrienne, and three of her siblings, Sophia, Rose and Adam) wanting the world to be better than it is\n\n‘She wanted to be a little kid for ever,’ she says, telling me Anna was the bravest and most bookish of the siblings — six sisters and one brother — and loved playing outdoors. Photos show a happy, fair-haired little girl, surrounded by her siblings and playing in the garden or local woodlands.\n\nHester pulls out a tatty volume, The Yellow Fairy Book, from her father’s bookshelf.\n\nHester says: ‘Dad’s got this collection of amazing fairy tales. I remember him reading them to me, but Anna read every single one herself.\n\n‘Anna was a romantic because she thought the world should be better than it is. She thought people should be better than they are.’\n\nThe family have one prized memento of Anna’s time in Syria: a diary she kept while there that Dirk, 68, managed to recover during a trip he made to the war-torn nation earlier this year as part of a BBC documentary.\n\nHe takes it out carefully from an old, emerald-green briefcase where he keeps reminders of his daughter, and reads out the part that has stayed with him the most — where Anna contemplates death.\n\n‘I thought about how it would be to not mind to die, and how it was when I was convinced that I wouldn’t make it back from this trip,’ she wrote. ‘I would never again see the sunlight shining through the new beech leaves in the forests of my childhood.’\n\nThere’s a silence as we absorb her words, broken only by baby Marlowe cooing on the sofa.\n\nFor those who knew Anna, her journey to a foreign battlefield seems, now, almost to have been fated.\n\nGrowing up in a matriarchal household, she was surrounded by outspoken women — her mother, Adrienne, most of all.\n\nI think what we have to realise is Anna lived very fully and very actively. She packed into her 26 years more than most people pack into 80 years - Dirk\n\nDirk recounts an exchange captured on home video between Adrienne and Anna when she was aged just six. Blonde and cherubic, Anna is sitting on the carpet with her sister, Rose, then four, playing with Barbie dolls and Sylvanian Family toy figures. Some of the toys are holding flags.\n\n‘Her mum was videoing her and they were playing with Sylvanian Families. Anna said, “The Sylvanians are going to have a war with the Barbies. They are always fighting the Barbies.” Adrienne said, “And do the women and children fight as well?” And Anna replied, “Unfortunately they do,”’ Dirk says. Hester, who has also watched the video enough times to know it verbatim, corrects her father: ‘Sadly they do.’\n\nAnna, it seems, always fought for the underdog in real life as well as in play. Aged 11, she saw some children tormenting a bee on the school playground.\n\n‘She went to defend this bumblebee. They laughed at her, but it was kind of emblematic of who she was,’ he says. ‘She just did not care what other people thought, her main motive in life was to protect the weak, innocent and vulnerable.\n\n‘She was brave. She got that from her mother I think,’ Dirk says sadly.\n\nAdrienne, a beekeeper, was also an activist and was by Anna’s side at a demonstration in London nine years ago when women stormed the Houses of Parliament. Their intense bond was forged through such protest action.\n\nDirk, 68, (pictured with Hester) who recovered Anna's diary during a trip to Syria earlier this year, believes she got her bravery from her mother\n\nThen, in 2012, when Anna was 21, her mother died of breast cancer after a four-year battle against the disease. After Adrienne’s death, her ashes were scattered in the local churchyard and a hand-carved wooden bench placed in her memory.\n\nHester recalls now that there ‘was something very right about carrying her in her coffin and laying her to rest. Not being able to do that for Anna just feels really, really wrong. You’re supposed to have a chance to be there at the end, and wish them on their way.’\n\nAfter that first loss, Dirk moved from the six-bedroom family home in Lewes to his smaller flat, down the road.\n\nThe walls are decorated with his musical instruments and there’s a chalkboard by the piano with a reminder of dates when his youngest child, Adam, is next home.\n\nEvery wall, every surface, shows pictures of happier times, including one of his girls together on a trip to Leeds and his wife holding their firstborn, Sophia.\n\nAnna had three full siblings, Sophia, Rose and Adam, and three half-sisters, Hester, Rayne and Sara.\n\n‘It used to be a household of six, and it’s now down to four. It’s just too heartbreaking,’ says Hester, who lives a short train ride away in Deptford with her family.\n\nTheir whole world changed in mid-2017 when Anna, who after her mother’s death had increasingly taken up causes as diverse as fighting the badger cull and supporting female refugees in Calais, decided to travel to Syria to join Kurdish forces fighting against Islamic State terrorists.\n\nAfraid they would dissuade her, she only told a handful of family members, including her father.\n\n‘I wasn’t surprised when she announced she was going to Rojava (the Kurdish name for the autonomous region of northern Syria). I was seriously alarmed, but it was in character,’ says Dirk.\n\nIt is painful to everyone who knew Anna — the fact that what she gave her life for is going to be ancient history - Hester\n\nHester only discovered her sister had left for Syria after Anna’s arrival in the war-ravaged region, something that clearly still causes her much emotional turmoil.\n\n‘I’m cross with her that she didn’t [tell me], because I wouldn’t have given up trying to change her mind,’ she says, tears streaming down her face.\n\nDuring Anna’s ten months in the region she learned to speak Kurdish fluently and went through weapons training, firing an AK-47 for the first time.\n\nShe was surrounded by foreign women who had come from across the world to join the cause, including those from Norway, Germany, Italy and the Czech Republic.\n\nShe called her father on WhatsApp once every couple of months when she had wifi.\n\n‘I would ask her what she was doing and if she was in any danger and she would always tell me, “No, I am nowhere near the fighting.”\n\n‘She lulled me into this false sense of security,’ Dirk says. They never spoke about whether she was happy or had made the right decision.\n\nIn March last year, the family’s worst fears became reality when the city of Afrin, near the Turkish border, came under attack — not from Isis, but from invading Turkish forces. Anna, it seems, was desperate to join the fight.\n\nHer desire to experience combat on the front line was to prove fatal. She was killed by a precision missile in a Turkish airstrike while fighting with an all-female brigade of the Kurdish People’s Protection Units. Anna became the eighth British citizen to die in the Syrian conflict, and the first British woman.\n\nIn one of the last photographs taken of Anna, who was given the nom de guerre Helin Qerecox, she is dressed head-to-toe in military fatigues with her hair dyed jet black, a far cry from the blonde schoolgirl she once was.\n\nA few days after Anna’s death, the Kurdish lines collapsed and the Turkish-backed forces surged forward. The Kurds had lost Afrin and Anna’s body was left, abandoned, in captured territory.\n\nNow, 18 months on, the family has been forced to launch a campaign to bring her home, and is raising money for legal fees after desperate pleas to the British and Turkish governments went unanswered. They have never been able even to visit the place where she died.\n\nDirk says it is a ‘constant source of pain’ that he has not been able to bury his daughter, adding: ‘We have been unable to complete our grieving process. We haven’t been able to have a funeral because we don’t have a body to put in the ground. They’ve ignored my human right to retrieve my daughter’s remains.’\n\nAs Hester describes in tears how she believes Anna must have died in agony, calling out to loved ones who weren’t there, her father tries to convince Hester that her sister would have died quickly; that she felt no pain.\n\nBut to have lost Anna, then not to be able to give her the dignity of a funeral, is a wound the family say they can never recover from.\n\nTo add still further to their torment, Anna’s dream of Kurdish autonomy was crushed earlier this month when U.S. troops pulled out of the border of northern Syria, abandoning their Kurdish allies and paving the way for a Turkish invasion.\n\nHundreds of civilians were killed as Turkish forces seized towns and villages, prompting Russian-backed Syrian regime troops to move in from the south.\n\n‘It is painful to everyone who knew Anna — the fact that what she gave her life for is going to be ancient history. Will anyone know what was achieved in Rojava? It is all very sad,’ Hester says.\n\nDirk says: ‘I think what we have to realise is Anna lived very fully and very actively. She packed into her 26 years more than most people pack into 80 years.’\n\nBefore Marlowe was born, Hester says her nine-year-old daughter, Wren, asked her: ‘Are you still sad about Auntie Anna?’\n\nHester replied: ‘How long do you think I should be sad for?’ To which Wren responded: ‘Maybe until you are 42, and then maybe you shouldn’t be sad any more.’\n\n‘I said I’m always going to be sad, because I wanted Anna to grow up to be an old lady. I won’t ever be at peace with that.’\n\nYou can donate to the family’s campaign at www.crowdjustice.com/case/bring-anna-home", "description": "Anna Campbell, 26, from Sussex, died in a missile strike in Northern Syria last year. Her father Dirk, 68, and sister Hester, 39, shared the pain of being unable to give her the dignity of a funeral.", "authors": ["Larisa Brown Defence And Security Editor For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/21/20397484-0-image-a-2_1572470776459.jpg", "published_at": "2019-10-30"}