{"pub": "cbc", "url": "https://cbc.ca/life/style/how-to-wear-the-tights-of-your-youth-and-still-look-like-a-grownup-1.5316903", "downloaded_at": "2019-10-11 00:22:11.425657+00:00", "title": "CBC Life", "language": "en", "text": "Coloured tights might have been the fall 2019 runway trend you were really surprised to see — we're talking the kind you used to wear as a kid, and in the exact same colours and prints that your six-year-old self would approve of, too. Throughout the season, they popped up at major shows like Dries Van Noten, Zimmermann, Kate Spade and Victoria Beckham. The takeaway? Almost anything goes. Forget the rules because there aren't any when it comes to choosing colours: you can wear the same shade from head to toe, match pastels with more pastels or clash basics with bolds. If it sparks a childlike joy, then it works! Ready to get a leg up on the trend? Here are 11 pairs of tights that nail the spirit.\n\nPastels for fall? Dries Van Noten makes it work, even for nighttime looks. Take a page from the designer's handbook and pair turquoise tights with a LBD for a cocktail outfit classic with a twist.\n\nDries Van Noten + Fogal 30 Denier Tights, about $59 CAD, Net-A-Porter\n\nThe key to taking a pretty-in-pink vibe to the next level is to wear the pastel colour from head to tights to toe. Keep hair slightly tousled and finish off with a pair of hoops to keep the look feeling modern.\n\nOut From Under Basic Opaque Tight, $16.00, Urban Outfitters\n\nOne of the chicest ways to pull off opaque tights is to wear them with a simple but standout cuts, both dress and shoe.\n\nFalke Pure Matt 50 Denier Tights, about $46 CAD, Net-A-Porter\n\nA muted mustard pair of tights won't always be around, but this is a key colour for this fall. What to wear them with? We suggest a faux leather two-piece set in brown and knee grazing western boots to match.\n\nASOS Design 50 Denier Tights in Mustard, $12.62, ASOS\n\nThere's so much to love about these grey leopard print tights. And while they go with almost everything you already own, we picture them as the perfect point of contrast to an all-black outfit. Oh, and don't forget the platform Dr Martens.\n\nPatterned Tights, $6.99, H&M\n\nIf more is more, then two colours are better than one, right? Marc Jacobs' tights come in two-tone pink and blue, which you should not be afraid to pair with a patterned dress for a look that cannot be missed.\n\nMarc Jacobs Pink & Blue 'The Left & Right' Tights, $125, SSENSE\n\nNow that traditional black tights have given way to colours, it's time to have some fun. Style cool shades like burgundy with a midi denim skirt and half buttoned cardigan. The tight's floral print will provide the touch of fall texture you're looking for.\n\nColored Lace Tights, $19.90, Zara\n\nLogomania has hit tights too. Think of these beige and brown tights as the foundation and build your outfit from there. May we suggest you pair them with a feather trimmed sweater and black denim skirt for a downtown vibe.\n\nBrown Nylon Tights, $410.00, Fendi\n\nFaux fur coats are all the rage this season, and there's nothing better to wear them with than white tights. A baby blue topper will appear most striking overtop a corduroy jumper, this poppy legwear, and chunky boots in black.\n\nAngelina 70D Opaque Tights, $7.99, Walmart\n\nBelieve it or not, coloured tights can have grunge appeal. When you layer muted tone tights under denim shorts and top it all off with an oversized plaid top, you're into a '90s vibe that can't be denied.\n\nColourful 3D Microfibre Tights, $11.00, Simons\n\nSure, there's a time and a place for basic tights, but this season isn't it. So, if you're looking for something seriously OTT, an off-white lace pair with black fringe will no doubt do the trick. A bright, puffy shoulder mini dress is all that's needed to complete the standout look.\n\nGucci Fringe Floral Lace Tights, $903.46, Nordstrom", "description": "Poppy, patterned, opaque tights are back and they've never looked more stylish.", "authors": [], "top_image": "https://i.cbc.ca/1.5317135.1570743103!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/coloured-tights.jpg", "published_at": "2019-10-10"}