{"pub": "thenextweb", "url": "https://thenextweb.com/security/2019/10/15/microsoft-rolls-out-windows-tamper-protection-for-windows-antivirus-to-keep-hackers-at-bay", "downloaded_at": "2019-10-15 11:21:15.642107+00:00", "title": "Microsoft rolls out Windows Tamper Protection for Windows antivirus to keep hackers at bay", "language": "en", "text": "Microsoft has officially announced the general availability of a new Tamper Protection feature for its Windows Defender Antivirus service.\n\nThe security feature is essentially meant to thwart any attempts made by cybercriminals to break the real-time anti-malware defenses incorporated in Windows.\n\nIn other words, tamper protection safeguards against “malicious and unauthorized changes to security features, ensuring that endpoint security doesn’t go down.”\n\nThe setting, which will be on by default for home users, can be accessed as follows:\n\nIn the search box on Taskbar, type Windows Security and select the option\n\nSelect Virus & threat protection\n\nSelect Virus & threat protection settings\n\nSelect Manage settings\n\nTurn on/off Tamper Protection\n\nIt’s to be noted that you need to be an administrator in order to make the changes.\n\nMicrosoft originally launched Tamper Protection last December for Windows Insiders, the community devoted to testing pre-release builds of the operating system.\n\nThe Windows maker’s decision to roll out the feature comes as multiple Trojans, including Nodersok and banking malware TrickBot, have targeted PCs to disable Windows Defender and gain elevated system privileges.\n\n“With this protection in place, customers can mitigate malware and threats that attempt to disable security protection features,” Microsoft said.\n\nRead next: Bitcoin's cumulative transaction fees surpass $1B milestone", "description": "Microsoft has officially announced the general availability of Tamper Protection feature for its Windows Defender Antivirus service.", "authors": ["Ravie Lakshmanan"], "top_image": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2Fwindows-defender-hed.png&signature=018233894634eff7b652874d47c6bb84", "published_at": "2019-10-15"}