{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/young-woman-kills-herself-after-20670751", "downloaded_at": "2019-10-22 13:39:11.402605+00:00", "title": "Young woman kills herself after finding child sex abuse images on boyfriend's phone", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA young woman killed herself after she found child sex abuse images on her boyfriend's mobile phone, an inquest heard.\n\nH&M worker Lydia Roberts, 21, felt \"violated and hurt\" after finding the photos on a second phone belonging to businessman Adam Wells.\n\nShe was \"disgusted\" at the thought of Wells being around her young niece and nephew, the inquest was told.\n\nThe couple argued when Miss Roberts confronted him over the images and he found her hanged at their home in Radcliffe, Greater Manchester, when he returned from a night out with friends.\n\nWells, a company director who ran a beauty products company, was later ordered to sign the Sex Offender Register for five years for possessing indecent photographs of children.\n\n(Image: Lydia Roberts/ Cavendish Press)\n\nMiss Roberts had a previous history of suicide attempts and had been prescribed medication for depression, the inquest heard.\n\nShe and Wells had been in a relationship for two years.\n\nThe tragedy occurred on June 10, 2017, after she discovered the images, from a Russia-based website, while he was at work.\n\nRecording a conclusion of suicide, Coroner Zak Golombeck told the Manchester hearing: \"Adam and Lydia had been had been corresponding by text message during the course of June 9 when Lydia was at home and Adam was at work for a larger period of the day and later out with friends and colleagues.\n\n(Image: Lydia Roberts/ Cavendish Press)\n\n\"The nature of the messages had been that Lydia and Adam had argued about content found on one of Adam Wells mobile phones.\n\n\"Adam Wells had returned home at around lunch time and shortly after him departing, Lydia had continued to message Adam Wells.\n\n\"It continued up until 7pm or shortly thereafter, whereupon no further text messaging or contact was made between Adam and Lydia.\"\n\nWells went on a night out with friends and colleagues and returned home at 3.30am, the inquest heard.\n\n(Image: Lydia Roberts/ Cavendish Press)\n\nHe found Miss Roberts hanged and called the emergency services for help, but she was pronounced dead.\n\nMr Golombeck said: \"I have considered the totality of the evidence and I am able to conclude that Lydia Roberts took her own life and intended to do so.\n\n\"There is evidence relating to her mental health and the nature of the correspondence taking place on that day between herself and Adam Wells.\n\n\"She had a history of attempting to take her own life, also had depression and had been prescribed antidepressants, sadly died on 10th June 2017, when she was found hanging at home by Adam Wells. To the family, I offer my condolences.\"\n\n(Image: Lydia Roberts/ Cavendish Press)\n\nWells appeared at Manchester Magistrates' Court in July 2018 charged with possessing 31 indecent photographs of children.\n\nHe was sentenced to a 12 month Community order, was ordered to complete 150 hours unpaid work and pay a £85 victim surcharge.\n\nIn a statement, Miss Robert's mother Michelle said: \"Lydia lived with Adam Wells and had been in a relationship for two years from 2015 to 2017.\n\n\"On June 9th Lydia found a second phone of Adams and found it contained inappropriate images of young girls from a Russian based website.\n\n(Image: Lydia Roberts/ Cavendish Press)\n\n\"Lydia felt violated, hurt and disgusted at what she found - even more so at the thought of Adam being with her young niece and nephew.\n\n\"I feel that he made her make the decision to do what she did.\n\n\"Adam Wells was at court July 2018 and has been charged with possessing indecent images of children and has been put on the sex offenders register.\n\n\"As a family we are devastated at the loss of our beautiful daughter and for this we will never forgive him.\n\n\"In our opinion we are left now with more unanswered questions and hope one day to find out the truth.\"\n\nThe Samaritans is available 24/7 if you need to talk. You can contact them for free by calling 116 123, email jo@samaritans.org or head to the website to find your nearest branch. You matter.", "description": "Lydia Roberts, 21, felt \"violated\" and \"disgusted\" after finding child abuse images on a second phone belonging to Adam Wells", "authors": ["Amy Walker", "Chris Kitching", "Image", "Lydia Roberts", "Cavendish Press"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20670796.ece/ALTERNATES/s1200/0_PAY-0_Cavendish-Press-Manchester-Ltd.jpg", "published_at": "2019-10-22"}