{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/queen-told-right-hand-woman-20742088", "downloaded_at": "2019-10-30 04:14:47.450351+00:00", "title": "Queen told right-hand-woman 'you're sacked' after she played cruel prank on her", "language": "en", "text": "Get the biggest Royal Family stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe Queen is known for her quick sense of humour and those closest to her know she's always up for a fun joke or a cheeky prank.\n\nBut when her right-hand-woman Angela Kelly played a cruel trick on her the Monarch fell for it completely - jokingly telling her she was sacked when she realised she had been had.\n\nSharing the funny story in her new book The Other Side of the Coin, Angela Kelly explains that the Queen was desperate to see a kookaburra bird during their Royal Tour to Australia in 2006.\n\nShe didn't have any luck spotting one, so when Angela saw a cute toy version during a trip to a market in Sydney while her boss was at an engagement, she decided to buy it for her.\n\nBut rather than just giving it to her, she decided to have a bit of fun first.\n\n(Image: Getty Images)\n\nShe writes: \"I had something in mind I thought the Queen would enjoy.\"\n\nWhen she got back to Governor's House, where they were all staying, she placed the toy in a little cage on the balcony outside her room.\n\nWhen the Queen got back Angela told her she had spotted a \"funny looking grey bird\" through the window.\n\n(Image: Getty Images)\n\n\"The Queen looked outside and shouted 'It's a kookaburra!' I went to open the cage doors and she said loudly 'No! Don't do that! It will fly away!' and was behind me in a flash.\n\n\"Turning to her Majesty while trying to keep a straight face, I solemnly told her it was dead.\"\n\n(Image: PA)\n\nThe Queen looked \"horrified\" until Angela walked towards her with outstretched arms and said \"April Fool\".\n\n\"She had only two words for me: \"You're sacked. I was laughing uncontrollably as her Majesty turned to His Royal Highness and said \"Do you know what she has just done to me? Angela has had me!\".\n\nThe Queen took the little toy back to Windsor Castle with her and it now lives on the back of the sofa in her private living room.", "description": "Angela Kelly bought the Queen a sweet gift during their Royal Tour to Austalia, but she decided to have a bit of fun with it first", "authors": ["Zoe Forsey", "Image", "Getty Images", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20742453.ece/ALTERNATES/s1200/0_The-Queen-And-The-Duchess-Of-Cornwall-Attend-A-Service-Marking-The-750th-Anniversary-Of-Westminster.jpg", "published_at": "2019-10-28"}