{"pub": "washingtonpost", "url": "https://washingtonpost.com/technology/2019/10/15/under-pressure-suspend-trump-twitter-restates-that-world-leaders-dont-always-have-follow-its-rules", "downloaded_at": "2019-10-16 01:15:09.178533+00:00", "title": "Under pressure to suspend Trump, Twitter restates that world leaders don’t always have to follow its rules", "language": "en", "text": "The new guidelines from Twitter came two weeks after Sen. Kamala Harris of California, a Democratic presidential contender, asked the company to consider suspending Trump’s account, claiming his online communications “put people at risk and our democracy in danger.”\n\nAD\n\nThe dispute stems from Twitter’s announcement this summer that it would label tweets from world leaders whose comments violate site policies, including those designed to prevent harm and abuse. The rules were designed to strike a balance between the public’s right to know and Twitter’s efforts to ensure hate speech, misinformation and other troubling content do not go viral.\n\nAD\n\nBut Twitter’s application of the policy ultimately invited widespread criticism, after the company opted not to label a number of Trump’s tweets that Democrats and digital watchdogs saw as improper. In July, for instance, the president told four congresswomen of color to “go back” to their countries, a tweet widely viewed as a racist attack in violation of Twitter’s rules against hate speech.\n\nIn an attempt to clarify its rules, Twitter said Tuesday it would take enforcement actions against “any account” in certain, dire circumstances, including instances when a world leader threatens a user with direct violence or publishes private information, such as a home address.\n\nAD\n\nBut Twitter also noted there were cases when the company may not act, such as when heads of state have “direct interactions” with their peers or engage in “foreign policy saber rattling on economic and military issues,” which it said are not violations of rules. Nor would the company seek to “determine all potential interpretations of the content or its intent,” it said.\n\nAD\n\nFor those tweets that are labeled as violations, Twitter said it would also take steps to limit their spread on the site: Users would not be able to retweet or like that content, for example. The company said it has not yet applied this label.\n\n“With critical elections and shifting political dynamics around the world, we recognize that we’re operating in an increasingly complex and polarized political culture,” Twitter said. “These are constantly evolving challenges and we’ll keep our policies and approach under advisement, particularly as we learn more about the relationship between Tweets from world leaders and the potential for offline harm.\n\nAD\n\nThe clarification didn’t immediately satisfy the company’s critics. In response to Twitter's updated policies, Ian Sams, a spokesman for the Harris campaign, said, \"When Trump is using his tweets to make threats, incite violence and intimidate witnesses, this is insufficient.\"\n\nAD\n\nThe request for stricter enforcement of company guidelines — and the update from Twitter — have come amid rising Democratic anger with the laissez-faire attitude adopted by technology giants toward politicians. Trump has made prolific use of the platforms, bypassing mainstream gatekeepers to speak directly to his supporters.\n\nIn an Oct. 1 letter to Jack Dorsey, Twitter’s chief executive, Harris. a former attorney general of California, cited examples of Trump’s tweets that disparaged the whistleblower who brought forth concerns about the president’s dealings with his Ukrainian counterpart.\n\nAD\n\nTrump described the individual, who is a member of the intelligence community, as a “so-called ‘Whistleblower,’” and said, “I deserve to meet my accuser.” He also leveled a baseless accusation of treason, which can carry the death penalty, against Rep. Adam Schiff of California, the Democratic chairman of the House Intelligence Committee, who is leading the impeachment inquiry that could threaten his presidency.\n\nAD\n\nHarris said the messages amounted to an attempt \"to target, harass, and attempt to out the whistleblower.\"\n\n\"Others have had their accounts suspended for less offensive behavior,\" she wrote. \"And when this kind of abuse is being spewed from the most powerful office in the United States, the stakes are too high to do nothing.\"\n\nAD\n\nEarlier this month, Facebook declined a request from former Vice President Joe Biden’s campaign to take down a Trump ad that included a debunked claim about his family’s involvement with a Ukrainian gas company. The company cited its policy of exempting political speech from its fact-checking program.\n\nThat drew a rebuke from Sen. Elizabeth Warren of Massachusetts, who has proposed breaking up Silicon Valley giants in her bid for the Democratic nomination. She called Facebook a “disinformation-for-profit machine.”\n\nThe update from Twitter on Tuesday shows, however, that the conundrum facing social media companies extends far beyond paid advertising. The megaphone they offer politicians — including those with a penchant for mistruths — can be just as valuable, and just as fraught.\n\nAD", "description": "Twitter said Tuesday it would limit the reach of some tweets from world leaders who violate its rules, stressing that top government officials “are not above our policies” at a moment when critics have clamored for the company to take more aggressive action against President Trump.", "authors": ["Tony Romm", "Senior Tech Policy Reporter", "Isaac Stanley-Becker", "National Political Reporter"], "top_image": "https://www.washingtonpost.com/resizer/1QFmPYgjZ4gKeQNuewzXzhWjWIA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JZHDE7XKV4I6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-15"}