{"pub": "fox", "url": "https://foxbusiness.com/markets/five-selective-investor-suggestions-bob-doll", "downloaded_at": "2019-09-07 14:41:29.132206+00:00", "title": "5 ways investors can be selective in today’s market", "language": "en", "text": "Nuveen chief equity strategist Bob Doll on Friday said investors need to be flexible and selective in today’s market.\n\nContinue Reading Below\n\n“You can’t just own the market,\" he told FOX Business’ Liz Claman on “The Claman Countdown.” \"You [have] got to selectively own things that have a better chance of working.”\n\nDoll gives five tips on how investors can be choosy in today’s market:\n\nEconomic sensitivity\n\n“We want companies that benefit from the economic cycle,\" Doll said. \"We believe it’s not over. It means we aren’t crazy about defensive stocks.”\n\nCash flow generator\n\nAdvertisement\n\n“We want companies that are generating positive free cash flow, preferably accelerating and preferably reinvest in the business for growth,\" Doll said.\n\nU.S. consumer health\n\n“Respect for the health of the U.S. consumer, amazing strength of the U.S. consumer,\" Doll said.\n\nCost with new product\n\n“We recognize growth is slowing so give me something special,\" Doll said. \"Can you raise prices? Do you have a new product — a new distribution channel?”\n\nHigh percentage of U.S. business\n\n“Companies that get most of their business from the United States because we’re growing faster than most of the rest of the world,\" Doll said.\n\nOne stock which fits Doll’s criteria is Target.\n\n“Amazon sent the retail industry a wakeup call a couple of years ago,\" Doll said. \"Some responded. Some didn’t. Target did.\"\n\nDoll said Target changed its business model, causing growth it hasn't seen before.", "description": "Nuveen chief equity strategist Bob Doll gives five tips on how investors can be selective in today’s market.", "authors": ["Nick Giampia"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/Market28.jpg?ve=1&tl=1", "published_at": "2019-09-06"}