{"pub": "huffpost", "url": "https://huffpost.com/entry/when-to-tell-someone-youre-dating-that-youre-going-to-therapy_l_5d2d0521e4b0bca603643aad", "downloaded_at": "2019-09-09 23:18:53.807168+00:00", "title": "When To Tell Someone You're Dating That You Go To Therapy", "language": "en", "text": "Illustration: Yukai Du for HuffPost; Photos: Getty\n\nKatie Roscher, a writer living in New York City, doesn’t shy away from talking about her therapy experiences on dates.\n\n“Therapy is an important part of my life, so I tend to try to bring it up within the first three or five dates,” the 31-year-old said. “Not in a serious way, but kind of in a jokey way. I want to alleviate any awkwardness that might come from me admitting I go to therapy.”\n\nSome divulgences go over better than others: “My last serious boyfriend acted a little defensive about it, as if my being in therapy was a direct response to some of his bad behavior.”\n\nBut for the most part, the good responses outweigh the bad. Many people tell her they go to therapy too, which she appreciates: “It means the person is in touch enough with their emotions to know that they need some help figuring things out.”\n\nThese days, Roscher’s experience is a common one. With more and more millennials leaning into psychotherapy ― they’re not called the “therapy generation” for nothing ― breakthroughs and other session experiences have become common table talk on dates.\n\nAccording to a 2017 report from the Center for Collegiate Mental Health at Penn State University, which compiled data from 147 colleges and universities, the rate that students were using counseling centers climbed steeply in the preceding five years. Statistically speaking, you’re bound to date some active therapygoers.\n\nWhile getting help for mental health has been stigmatized in the past (“They’re in therapy? What happened?”), these days, people recognize the value of seeing a therapist, especially when navigating the highs and lows of dating.\n\n“I went out with someone last winter who excitedly shared how life-changing going to therapy has been for him, and someone else more recently who said they’d found therapy to be very helpful when they came back from active duty,” said Micki Cordova, a research associate in behavioral neuroscience in Portland, Oregon.\n\nTo young adults who have seen their parents navigate rocky personal lives (sometimes including multiple divorces), therapy is a badge of honor.\n\n“We’ve seen how much damage holding in collective trauma did to our parents,” Cordova said. “So many people are trying to end those cycles of pain by better managing their mental health needs.”\n\n“If you value honesty and transparency in relationships, you should tell them within the first few dates.” - Kelifern Pomeranz, a psychologist in the Bay Area\n\nIn the Bay Area, where psychologist Kelifern Pomeranz works, having a therapist is akin to having a personal trainer ― commonplace for those who can afford it. (Therapy can be pricey, but if you’re looking for ways to make it more affordable, head here.)\n\nWhile therapy is common, Pomeranz reminds clients that revealing the fact that you’re seeing a therapist depends on your dating goals.\n\n“Is it a casual hookup? Probably not relevant,” she said. “Long-term relationship potential? If you value honesty and transparency in relationships, you should tell them within the first few dates. If it is going to be an issue, it is better to know sooner rather than later.”\n\nAs for how to broach the conversation, it might be as easy and casual as saying something like, “Hey, my therapist told me something interesting today.” Or maybe you share an interesting breakthrough you made in your last session.\n\nIf you’re going to therapy for trauma, you’ll likely treat this conversation and its timing a little more seriously. As with any potentially sensitive disclosure, it’s important to consider how the subject might be received, said Alicia H. Clark, a psychologist in Washington, D.C.\n\nTo get a sense of how your date might respond, draw on something from pop culture. For instance: “Kristen Bell said the smartest thing about depression and going to therapy in this article I was reading,” or, “What do you think about the therapy scenes in ‘Big Little Lies’? Why does everyone in Monterey go to the same damn therapist?”\n\n“These conversation starters are useful ‘test balloons’ to throw out to see how a potential partner thinks about therapy,” Clark said. “This way, you find out without the pressure of them knowing they should say the right thing.”\n\nMostly, don’t overstress it. You don’t have to go into detail about why you go.\n\n“There is nothing wrong with being in therapy and you don’t have to apologize or make excuses for it,” Pomeranz said.", "description": "If you're unsure about how to bring up your experiences with your new partner, here's how to do it.", "authors": ["Senior Lifestyle Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d6ea5682500008d000207a5.jpeg?ops=1778_1000", "published_at": "2019-09-09"}