{"pub": "news24", "url": "https://traveller24.com/Explore/Beach/from-bikini-to-ushaka-see-sas-45-blue-flag-beaches-for-the-festive-season-20191024-2", "downloaded_at": "2019-10-24 04:28:57.337822+00:00", "title": "From Bikini to uShaka: See SA's 45 Blue Flag beaches for the festive season", "language": "en", "text": "It's almost time for the beach, and what better way to kick off that keDezemba feeling than with the announcement of this season's Blue Flag beaches.\n\nThe Blue Flag programme is a collaboration with 47 other countries around the world that help maintain high standards for coastal areas and has been in South Africa for 19 years.\n\nREAD: 10 SA beaches that will make you feel like you're living on an island\n\nAt the launch, general manager of sustainable tourism at Wessa Vincent Shacks noted that one of the biggest threats to beaches is plastic pollution, an issue that plagues oceans around the world.\n\nHowever, he urges everyone to help with this crisis.\n\n\"What are you as the individual doing to be responsible for your own Blue Flag Site?\"\n\nIn total 45 of South Africa's beautiful beaches received full status, alongside ten sustainable tourism boats and nine marinas. President Cyril Rampahosa has set targets to have 100 Blue Flag beaches by 2030.\n\nTen of Cape Town's beaches got the blue tick, including the V&A Waterfront for the second year in a row. For Marian Nieuwoudt - mayoral committee member for spatial planning and environment for the city - our beaches form an important part of our country's identity.\n\n\"It's not a commodity you can sell, you can benefit from it but it's not yours to exploit,\" sais Nieuwoudt at the launch, adding that they aim to get all of Cape Town's beaches to Blue Flag level. Seaforth Beach in Simon's Town didn't receive status like last year, but there are plans to get on the list again for next season.\n\nALSO SEE: How naked can you go on Cape Town beaches?\n\nThe Western Cape is dominating with 33 Blue Flag beaches, followed by the Eastern Cape and KwaZulu-Natal each with six beaches. Coastal province Northern Cape has no Blue Flag beaches.\n\nNewcomers this year include Castle Beach in Overstrand, Jongensfontein and Stilbaai Wes in Hessequa and Glentana in Mossel Bay. The two beaches that were the first to receive the status in South Africa stayed strong yet again for their 19th year - Grotto Beach in Overstrand and Humewood Beach in Port Elizabeth.\n\nHessequa Municipality became the first district to have all their beaches certified with Blue Flag status.\n\nCurrently 35 pilot beaches waiting in the wings to receive their full status, but they are still busing with upgrades and refurbishments to adhere to the strict criteria. The Ethekwini Municipality has 11 pilot sites which could give Cape Town a run for its money.\n\nOn the marina side, the following received Blue Flag status beside Cape Town's waterfront - False Bay Yacht Club, Thesen Island, The Water Club, Yachtsport SA, Harbour Island, St Francis Canals and Royal Alfred. Tourism operators whose boats were awarded the Blue Flag include Offshore Adventures, Dyer Island Cruises, Marine Dynamics, Ocean Odyssey, Great White Shark Tours and White Shark Ventures.\n\nSEE: Sleepy coastal towns where you can have the beach all to yourself\n\nSee the full list of Blue Flag beaches below.\n\nWestern Cape\n\nCity of Cape Town\n\nSilwerstroomstrand\n\nClifton 4th\n\nCamps Bay\n\nLlandudno\n\nMuizenberg\n\nStrandfontein\n\nMnandi\n\nBikini Beach\n\nMelkbosstrand\n\nFish Hoek\n\nREAD: Cape Town beach swearing ban?! Dutch travellers be warned, you might be especially at risk\n\nOverstrand\n\nKleinmond\n\nHawston\n\nGrotto\n\nCastle Beach\n\nCape Agulhas\n\nStruisbaai\n\nWATCH: There's a new reason to travel to the Southern Most Tip of Africa\n\nHessequa\n\nWitsand\n\nPreekstoel\n\nLappiesbaai\n\nJongensfontein\n\nGouritzmond\n\nStilbaai Wes\n\nREAD: Where to find the best of SA's secret beaches\n\nMossel Bay\n\nDe Bakke\n\nHartenbos\n\nKlein Brak\n\nSantos\n\nGlentana\n\nKnysna\n\nBrenton-on-Sea\n\nWATCH: A break in Knysna\n\nBitou\n\nRobberg 5\n\nKeurboomstrand\n\nNature's Valley\n\nLookout\n\nThe Dunes\n\nSinging Kettle\n\nREAD: Bitou Valley Camping: Make Plett's ancient forests your backyard this summer\n\nEastern Cape\n\nKouga\n\nDolphin Beach\n\nNelson Mandela Bay Metro\n\nKings Beach\n\nHumewood\n\nHobie Beach\n\nALSO SEE: Quick Guide to Madiba’s Long Walk to Freedom: Discover historic heritage in Port Elizabeth\n\nNdlambe\n\nKariega\n\nKelly's Beach\n\nSEE: Why the Eastern Cape is SA's adventure treasure trove\n\nKwaZulu-Natal\n\nRay Nkonyeni\n\nMarina\n\nTrafalgar\n\nSouthport\n\nUmzumbe\n\nHibberdene\n\nEthekwini\n\nuShaka Beach\n\nREAD: Diving into the world of sharks off the KZN coast through the sense of sound\n\nFind Your Escape by signing up for the Traveller24 Weekly Newsletter – Subscribe here. Or download the News24 App here, to receive expertly curated travel ideas and deals directly to your mobile.", "description": "The Blue Flag Season has launched with the Western Cape dominating with 33 full status beaches.", "authors": ["Minutes Ago - Gabi Zietsman"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9510/5f9d2a24c4744f6494dd234389f52c3e.jpg", "published_at": "2019-10-24"}