{"pub": "hotair", "url": "https://hotair.com/archives/jazz-shaw/2019/09/16/americans-believe-best-days-ahead-us", "downloaded_at": "2019-09-16 23:15:52.730560+00:00", "title": "Most Americans believe our best days are ahead of us", "language": "en", "text": "For all the complaining we hear on cable news on a daily basis, you might be tempted to think that the world was ending. Liberals wring their hands over how terrible things are under the hateful regime of the Bad Orange Man. Conservatives see Democrats making gains in the polls and fret that the rise of socialism and the inevitable collapse of our nation that would follow may be just around the corner. Maybe we spend too much time watching cable news because most people don’t feel that way.\n\nA new poll out from Scott Rassmussen asked Americans how the future looks to them, and across party lines, most of the respondents didn’t see things in such a dismal fashion. In fact, a very solid majority believed that our best days are still ahead of us.\n\nSixty-five percent (65%) of voters agree that just about all positive change in America begins outside of the political system, and far from the halls of power in Washington D.C. A ScottRasmussen.com survey found that just 22% disagree and 14% are not sure. Sixty-eight percent (68%) also agree that, in America, culture and technology lead the nation forward, while politics and government lag behind. On that point, 18% disagree and 13% are not sure… Fifty-nine percent (59%) of voters nationwide believe that America’s best days are in the future while 41% believe they have already come and gone. Sixty percent (60%) of both liberals and conservatives believe the nation’s best days are still to come. So do 57% of political moderates.\n\nThis cheerful attitude crossed party lines, gender lines, age groups… you name it. There are apparently even some millennials who aren’t certain that the world needs to burn.\n\nAt first glance, I never would have predicted this. But after giving it more consideration, a possible explanation started to present itself and it deals with the things I mentioned in the opening paragraph.\n\nPlenty of us who work in the field of political commentary and analysis regularly make jokes about how swimming around in the swamp of American politics can make you jaded after a while. But that’s really not a joke at all, is it? When the talking heads on cable news and the headlines of the major newspapers constantly blare out stories about how everything is going to crap, that sort of attitude starts to seep in. I don’t know what the official rate of diagnosed depression among bloggers is, but I’d wager it’s above the national average.\n\nBut particularly in an odd-numbered year without a major national election around the corner, it sounds like a lot of the country is tuning all of this stuff out. Those of us caught up in the 24/7 news cycle may have this thrust in our faces on an hourly basis, but there are other Americans who simply aren’t being all that affected. You might even have seen them. They’re the ones outside on sunny days mowing their lawns, enjoying a cold beverage on the porch with a neighbor or heading out to the ballpark or the fishing hole. You know… those kinds of weirdos.\n\nScott has taken the opportunity to piggyback off these survey results and point us to his new book. It’s called The Sun Is Still Rising: Politics Has Failed But America Will Not. I’ll confess I only just found out about it but I’m ordering it today. The name alone lifts my spirits a bit and leaves me thinking that when I finish writing this article I might go out on the back deck, sit in the sun and close my eyes for a little while. Perhaps we all should.", "description": "What a bunch of weirdos", "authors": ["Jazz Shaw", "Ed Morrissey", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/07/CampFlag.jpg", "published_at": "2019-09-16"}