{"pub": "reuters", "url": "https://in.reuters.com/article/cricket-india-dhoni/cricket-dhoni-must-quit-international-game-before-hes-pushed-gavaskar-idINKBN1W50ZM", "downloaded_at": "2019-09-20 13:04:39.933093+00:00", "title": "Cricket: Dhoni must quit international game before he's pushed - Gavaskar", "language": "en", "text": "MUMBAI (Reuters) - The time has come for India’s long-serving wicketkeeper-batsman Mahendra Singh Dhoni to bow out of international cricket - and he should go before he’s pushed, batting great Sunil Gavaskar said.\n\nFILE PHOTO: Cricket - India v Australia - India Team's Practice Session - Indore, India – September 23, 2017 – Mahendra Singh Dhoni bowls in the nets. REUTERS/Adnan Abidi/File Photo\n\nFormer captain Dhoni has been the subject of intense speculation among fans, ex-players and pundits over when he will retire from international cricket since India’s semi-final exit from the World Cup.\n\nThe veteran of 350 one-dayers, who quit playing tests at the end of 2014, has not provided any hint of what his plans are.\n\nHowever he made himself unavailable for India’s tour of the West Indies and instead opted to spend 15 days with India’s territorial army, a reservist force that draws on civilians who can do short stints to assist the military.\n\nDhoni was also a notable omission from India’s Twenty20 squad for the ongoing three-match series against South Africa.\n\n“Nobody knows what’s in MSD’s mind. Only he can clarify what he thinks his future with Indian cricket is,” former India captain and opening batsman Gavaskar told India Today.\n\n“But he’s now 38, by the time the next T20 World Cup comes he will be over 39 years old. I think India should be looking ahead.”\n\nDhoni captained India to the World Twenty20 crown in 2007, and the 50-over World Cup title at home four years later, and enjoys cult status in the cricket-mad country.\n\nAt his prime Dhoni was widely considered the best “finisher” in the game but his electrifying ability to put bowlers to the sword to the end of innings has waned of late, while he has also struggled to make solid starts. Dhoni’s glovework, however, still remains top class.\n\nThe next 50-over World Cup is still four years away but the World Twenty20 will be held in 2020 and Dhoni enjoys unwavering support from India captain Virat Kohli who has publicly backed him on numerous occasions.\n\n“His value to the side is always going to be fantastic. It’s not just the runs he will score or the catches and the stumpings he will effect,” said Gavaskar, who once held the record for most test runs and centuries in the longest format of the game.\n\n“His overall presence is so calming on the field, it’s fantastic for the captain because the captain gets the benefit of his views. So that’s a huge plus.\n\n“But I think the time has come. Everybody has a shelf life,” he added. “He should be going without being pushed out. He should be going on his own terms.”", "description": "The time has come for India's long-serving wicketkeeper-batsman Mahendra Singh Dhoni to bow out of international cricket - and he should go before he's pushed, batting great Sunil Gavaskar said.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190920&t=2&i=1431938798&w=1200&r=LYNXMPEF8J0PE", "published_at": "2019-09-20"}