{"pub": "independent", "url": "https://independent.co.uk/environment/mont-blanc-ice-loss-revealed-photos-100-years-apart-climate-change-a9151951.html", "downloaded_at": "2019-10-11 20:19:58.830616+00:00", "title": "Mont Blanc climate change impact revealed in photos 100 years apart", "language": "en", "text": "Exactly 100 years after the Swiss pilot and photographer Walter Mittelholzer flew over Mont Blanc in a biplane to photograph the landscape around the mountain in southern France, a team of scientists have recreated his photographs to show the impact that climate change.\n\nA century on and researchers from the University of Dundee took three photographs to show the impact on the mountain's glaciers.\n\nUsing a process called monoplotting to triangulate the original camera position in airspace Dr Kieran Baxter and Dr Alice Watterson from the 3DVisLab at Duncan of Jordanstone College of Art and Design, flew over the Mont Blanc massif in August.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe pair used the peaks and spires of the alpine landscape as anchor points to find the geolocation of where the historical shots were taken.\n\nThe resulting photographs of the Argentiere, Mont Blanc Bossons and Mer de Glace glaciers show the large scale of ice loss in the region.\n\nShape Created with Sketch. Climate change in the world's fastest-warming town Show all 18 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Climate change in the world's fastest-warming town 1/18 Husky dogs pull musher Audun Salte through the town of Longyearbyen in Svalbard, Norway. Salte worries that as temperatures warm, climate change could lead to the extinction of all life on Earth. A man who likes kissing and dancing with his dogs, he has 110 of them, is concerned most about the non-humans on the planet. \"If climate change should be the end of humanity, I really don't care, but if climate change is the end of any animal species who hasn't contributed anything towards the speeding up of this process, that's why I am reacting,\" he said. \"On the highway, when people slow down to look at a car crash, climate change is like that because everyone is slowing down to look at the accident but not realising that we are actually the car crash.\" Reuters/Hannah McKay 2/18 A reindeer grazes on land. Since 1970, average annual temperatures have risen by 4 degrees Celsius in Svalbard, with winter temperatures rising more than 7 degrees, according to a report released by the Norwegian Centre for Climate Services in February. Reuters/Hannah McKay 3/18 The Wahlenberg Glacier in Oscar II land Reuters/Hannah McKay 4/18 Audun Salte prepares his huskies for sledding Reuters/Hannah McKay 5/18 The town of Longyearbyen in the late evening light Reuters/Hannah McKay 6/18 Husky dogs relax ahead of sledding Reuters/Hannah McKay 7/18 International director of the Norwegian Polar Institute, Kim Holmen, relaxes with a cup of tea as he travels past the Wahlenberg Glacier. Holmen has lived in the northern Norwegian archipelago of Svalbard for three decades. He describes the changes he's seen as \"profound, large and rapid.\" \"We are losing the Svalbard we know. We are losing the Arctic as we know it because of climate change,\" he said. \"This is a forewarning of all the hardship and problems that will spread around the planet.\" Reuters/Hannah McKay 8/18 A sign warns of the danger from polar bears Reuters/Hannah McKay 9/18 A woman poses next to a polar bear mural in town Reuters/Hannah McKay 10/18 An iceberg floats near the Wahlenberg Glacier Reuters/Hannah McKay 11/18 Wieslaw Sawicki holds a photograph of his son 44-year-old Michal Sawicki who was killed by an avalanche in Svalbard earlier this year. He worked as a geophysicist at the Polish Polar Research Station in Hornsund on the southern side of Svalbard. The Polish scientist and meteorologist Anna Gorska died when they fell from a mountain in May. Sawicki was an experienced mountaineer, scientist and explorer on his fifth stint for the institute in the Arctic. \"Unfortunately, there was a huge snow cornice which looked like it was part of the peak of the mountain,\" said his father Wieslaw Sawicki, who was visiting Longyearbyen to meet with the governor of the archipelago. \"It collapsed with them; they both fell into the abyss.\" Reuters/Hannah McKay 12/18 Christiane Huebner plays with her dog Svea Reuters/Hannah McKay 13/18 A pile of antlers on a ski sled Reuters/Hannah McKay 14/18 Reuters/Hannah McKay 15/18 White wooden gravestones at risk of landslides due to the thawing permafrost underneath the ground, stand at the side of a mountain in the Longyearbyen cemetery Reuters/Hannah McKay 16/18 A man looks at rugs for sale in a store in town Reuters/Hannah McKay 17/18 A miner works inside the Gruve 7 mine, the only remaining operational coal mine on Svalbard Reuters/Hannah McKay 18/18 Children play at the skatepark in town Reuters/Hannah McKay 1/18 Husky dogs pull musher Audun Salte through the town of Longyearbyen in Svalbard, Norway. Salte worries that as temperatures warm, climate change could lead to the extinction of all life on Earth. A man who likes kissing and dancing with his dogs, he has 110 of them, is concerned most about the non-humans on the planet. \"If climate change should be the end of humanity, I really don't care, but if climate change is the end of any animal species who hasn't contributed anything towards the speeding up of this process, that's why I am reacting,\" he said. \"On the highway, when people slow down to look at a car crash, climate change is like that because everyone is slowing down to look at the accident but not realising that we are actually the car crash.\" Reuters/Hannah McKay 2/18 A reindeer grazes on land. Since 1970, average annual temperatures have risen by 4 degrees Celsius in Svalbard, with winter temperatures rising more than 7 degrees, according to a report released by the Norwegian Centre for Climate Services in February. Reuters/Hannah McKay 3/18 The Wahlenberg Glacier in Oscar II land Reuters/Hannah McKay 4/18 Audun Salte prepares his huskies for sledding Reuters/Hannah McKay 5/18 The town of Longyearbyen in the late evening light Reuters/Hannah McKay 6/18 Husky dogs relax ahead of sledding Reuters/Hannah McKay 7/18 International director of the Norwegian Polar Institute, Kim Holmen, relaxes with a cup of tea as he travels past the Wahlenberg Glacier. Holmen has lived in the northern Norwegian archipelago of Svalbard for three decades. He describes the changes he's seen as \"profound, large and rapid.\" \"We are losing the Svalbard we know. We are losing the Arctic as we know it because of climate change,\" he said. \"This is a forewarning of all the hardship and problems that will spread around the planet.\" Reuters/Hannah McKay 8/18 A sign warns of the danger from polar bears Reuters/Hannah McKay 9/18 A woman poses next to a polar bear mural in town Reuters/Hannah McKay 10/18 An iceberg floats near the Wahlenberg Glacier Reuters/Hannah McKay 11/18 Wieslaw Sawicki holds a photograph of his son 44-year-old Michal Sawicki who was killed by an avalanche in Svalbard earlier this year. He worked as a geophysicist at the Polish Polar Research Station in Hornsund on the southern side of Svalbard. The Polish scientist and meteorologist Anna Gorska died when they fell from a mountain in May. Sawicki was an experienced mountaineer, scientist and explorer on his fifth stint for the institute in the Arctic. \"Unfortunately, there was a huge snow cornice which looked like it was part of the peak of the mountain,\" said his father Wieslaw Sawicki, who was visiting Longyearbyen to meet with the governor of the archipelago. \"It collapsed with them; they both fell into the abyss.\" Reuters/Hannah McKay 12/18 Christiane Huebner plays with her dog Svea Reuters/Hannah McKay 13/18 A pile of antlers on a ski sled Reuters/Hannah McKay 14/18 Reuters/Hannah McKay 15/18 White wooden gravestones at risk of landslides due to the thawing permafrost underneath the ground, stand at the side of a mountain in the Longyearbyen cemetery Reuters/Hannah McKay 16/18 A man looks at rugs for sale in a store in town Reuters/Hannah McKay 17/18 A miner works inside the Gruve 7 mine, the only remaining operational coal mine on Svalbard Reuters/Hannah McKay 18/18 Children play at the skatepark in town Reuters/Hannah McKay\n\nEquipped with waypoints from the digital analysis and multiple GPS devices, Dr Baxter hung from the side of the helicopter as it hovered at a height of around 4,700 metres, just below the summit of Mont Blanc, to capture the images.\n\n“The scale of the ice loss was immediately evident as we reached altitude but it was only by comparing the images side-by-side that the last 100 years of change were made visible. It was both a breathtaking and heartbreaking experience, particularly knowing that the melt has accelerated massively in the last few decades,\" he said.\n\n“Mittelholzer played a key role in popularising commercial air travel in Switzerland, an industry which ironically came to contribute to the warming of the climate and the detriment of the alpine landscapes that the pioneering pilot knew and loved. Unless we drastically reduce our dependence on fossil fuels, there will be little ice left to photograph in another hundred years.”", "description": "Exactly 100 years after the Swiss pilot and photographer Walter Mittelholzer flew over Mont Blanc in a biplane to photograph the landscape around the mountain in southern France, a team of scientists have recreated his photographs to show the impact that climate change.  A century on and researchers from the University of Dundee took three photographs to show the impact on the", "authors": [], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/11/14/Mont-Blanc-100-years-2.jpg", "published_at": "2019-10-11"}