{"pub": "mirror", "url": "https://mirror.co.uk/money/premium-bond-prizes-worth-77million-20561752", "downloaded_at": "2019-10-11 20:02:53.932086+00:00", "title": "Premium Bond prizes worth £77million unclaimed - here's how to check if it's you", "language": "en", "text": "Get the biggest money stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nIt's the kind of surprise you only read about in the papers, but the reality is you could be sitting on thousands of pounds of lost money, because you can't be tracked down.\n\nThat's according to the latest Premium Bonds figures that show 2.16million prizes worth £77million are currently unclaimed — largely because the bond owners failed to notify NS&I when they moved house.\n\nThese prizes often get buried and forgotten about - with the cash sitting idle in a pool with other unclaimed winnings.\n\nAccording to NS&I - which runs the Premium Bonds service - more than £76,987,178 in prizes are still waiting to be claimed from hundreds of its 21 million savers.\n\nWhat are Premium Bonds and how do they work?\n\n(Image: Getty)\n\nPremium Bonds are an investment product offered by the Government's National Savings and Investments (NS&I) arm.\n\nHowever, instead of being paid interest, account holders get entered into a monthly prize draw to win anything from £25 to £1 million in tax free cash.\n\nThese accounts were first introduced in 1956. Today, there are around 21 million savers in the UK who have around 79 Premium Bonds, made up of investments of anything from £25 to £50,000.\n\nFor every £1 invested, you get a unique bond number. So, if you save £100, you’ll get 100 bond numbers (each with a chance to win a prize).\n\nNS&I sends prizes worth less than £5,000 to winners in the form of warrants, which are similar to cheques.\n\nIt writes to anyone that wins between £5,000 and £100,000 while jackpot winners are told in person by one of NS&I's Agent Millions.\n\nYou can find out how to buy Premium Bonds in our guide, here.\n\nHow can the money go unclaimed?\n\n(Image: Getty)\n\nPrizes can go unclaimed if the original owner of the bond has died and NS&I has not been notified, or if you move house and fail to notify the Government's savings arm.\n\nOther common cases include where the person was given Premium Bonds as a child - which they later forgot about.\n\nIf a bond-holder dies and NS&I isn't immediately informed, the executor can claim for the estate any prizes the deceased has won 12 months after their death.\n\nAn executor can also choose whether to cash in the deceased's bonds or keep them in draws up to a year after their death.\n\nFind your lost savings\n\n(Image: Getty)\n\nYou can download a list of all unclaimed bond numbers here.\n\nFor recent prizes, you can check if you've missed out by visiting NS&I and using its online prize checker.\n\nIf you have lost the details of your account, want to register updated details, or want to notify NS&I of a bond-holder's death, you can telephone NS&I on 08085 007 007.\n\nBear in mind that bonds that were bought more than 30 years ago are unlikely to have a Premium Bond holder's number associated with them - you're likely just to have the individually-numbered bonds. If that's the case, you can write to NS&I to ask for one.\n\nWebsite My Lost Account can also tell you if you hold any Premium Bonds which you may not have been aware of.\n\nThink you could be sitting on lost money elsewhere? Here's our guide on where it could be and how to find it.\n\nWhile you're at it, make sure you don't miss out on any future prizes by having them paid straight to your bank.\n\nYou can set this up as long as you're registered for NS&I's online and phone services.", "description": "According to NS&I - which runs the Premium Bonds service - millions of pounds in prizes are still waiting to be claimed from hundreds of its 21 million savers", "authors": ["Emma Munbodh", "Image", "Ns I", "Getty"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article8522556.ece/ALTERNATES/s1200/NSI-Premium-Bond-winner.jpg", "published_at": "2019-10-11"}