{"pub": "news24", "url": "https://w24.co.za/SelfCare/Wellness/Mind/thickleeyonce-on-diversity-in-the-fashion-and-beauty-industry-im-often-the-only-big-black-girl-on-set-20191018", "downloaded_at": "2019-10-21 06:42:47.991801+00:00", "title": "ThickLeeyonce on diversity in the fashion and beauty industry - 'I'm often the only big black girl on set'", "language": "en", "text": "It’s been so many decades, someone call change please.\n\nThere hardest thing about having a dream and wanting to achieve it is having no one who looks like you to inspire you. Diversity has been the biggest talk in the decade we are about to close in the entertainment industry, from race, body shape, body size to sexuality\n\nAlthough there may be individuals who have made the effort to spread the message about the lack of diversity, with all the awareness, you would image a big change would be visible at this point.\n\nREAD MORE: The importance of ballet shoes for brown-skinned ballerinas and how they are made\n\nWomen who have stepped up to change the perception of what the ideal girl in the entertainment industry should look like include lawyer, model and activist Thando Hopa, model, and public spokesperson Winnie Harlow, model and radio host Refilwe Modiselle and singer, rapper and songwriter Lizzo.\n\n#BodyPositivity ambassador, plus-size model and photographer, Lesego Legobane, known as ThickLeeyonce is also one who has broken stereotypes around body image.\n\nWe meet up with her in Sandton at the Audi South africa roundtable discussion on purposeful marketing and the need for brands to be mindful in their marketing efforts.\n\nThickLeeyonce is an influencer and ambassador for the car brand and we're glad to that inclusivity is top on their agenda. She talks to us about this and other issues.\n\n“The industry has not opened up enough yet, there is still one or two people in the industry pushing the boundaries. When I go to the shop, magazine covers still look the same, there is still no diversity. The industry is opening up slowly and there is pressure on brands to accommodate diversity,” she says.\n\nREAD MORE: WATCH: Kenyan stylist says more LGBT people should be included in runways\n\nIndividuals can only do so much, the media needs to change as they are the benchmark for setting standards because we are all exposed to it. Diversity should not be a once off thing, it should be consistent. “I would go on a shoot and find that I’m often the only big black girl on set. It would be nice to get on set and there are five girls who look like me,” ThickLeeyonce adds.\n\nWe cannot shy away from giving credit to brands that embrace diversity, like Woolworths and Dove, who have consistently done campaigns that represent real women. Encouraging young women to celebrate how they look without feeling the need to be air-brushed beautiful.\n\n\n\nREAD MORE: Months after Victoria’s Secret CEO resigns, the lingerie company has cast their first-ever openly transgender mode\n\n“Being myself has carried my brand and by being myself I am comfortable knowing that I do not have to adjust, I don’t have to change to suite a certain aesthetic, because my aesthetic is me. Everyone around me adjusts to my energy,” the Audi ambassador says.\n\nTo a young girl looking to follow in the footsteps of this fearless game-changer, ThickLeeyonce has the following advice as a sister, “The biggest step is self-acceptance and understanding who you are, because you will meet people who will have negative things to say about you, regardless of who you are and what you look like.”\n\n\n\nSign up to W24’s newsletters so you don't miss out on any of our hot stories and giveaway.", "description": "It’s been so many decades, someone call change please.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9491/5a771f83df7e4f5b928e0c5a19250925.jpg", "published_at": "1925-09-25"}