{"pub": "fox", "url": "https://foxnews.com/politics/virginia-state-senator-changes-gun-rights-ad-after-challenger-calls-it-violent-rhetoric", "downloaded_at": "2019-09-22 05:12:30.820638+00:00", "title": "Pro-Second Amendment lawmaker tones down ad after Dem opponent calls it 'violent rhetoric'", "language": "en", "text": "A Republican state senator in Virginia changed a Facebook campaign ad Friday after her Democratic challenger called the pro-Second Amendment post “violent rhetoric,\" according to a report.\n\nState Sen. Amanda Chase’s original ad showed her at a gun range and read “I’m not afraid to shoot down gun groups,\" prompting her opponent Amanda Pohl to call for an apology, the Richmond Times-Dispatch reported.\n\n“This kind of rhetoric and threats towards those you disagree with from my opponent is disturbing,” Pohl wrote on Twitter on Friday. “I’m ready to listen to everyone in our community and work for real solutions to the challenges we face.”\n\n‘YOU’RE A CHILD,’ TEXAS STATE LAWMAKER TELLS BETO O’ROURKE AFTER DEM CALLS HIS TWITTER MESSAGE ‘A DEATH THREAT’\n\nShortly thereafter, Chase’s campaign changed the Facebook message to “I’m not afraid to shoot down attacks from any anti-gun groups, because gun rights are women’s rights.\"\n\nThe Chase camp said the original wording was a \"communications oversight,” according to the Times-Dispatch.\n\n“Mistake or not, it’s still violent rhetoric that has to be addressed,” Pohl said. “While Senator Chase might not agree with me and other activists who want to prevent gun violence in our communities, she at the very least needs to listen to our concerns and not take out campaign ads threatening to shoot us.\"\n\nChase is an unapologetic gun rights advocate who gained notoriety earlier this year for openly carrying a .38-caliber revolver onto the Senate floor in Richmond, saying she was concerned about possible violence from protesters at the Statehouse.\n\n\"Unfortunately in the General Assembly we see the good, we see the bad, we see all types of things,” she told the Times-Dispatch. “It’s just for personal safety, quite honestly.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nShe described openly carrying guns as empowering women and even likened it to her own Equal Rights Amendment.\n\nChase is running for a second term.", "description": "A Republican state senator in Virginia changed a Facebook campaign ad Friday after her Democratic challenger called the pro-Second Amendment post “violent rhetoric.”", "authors": ["Brie Stimson"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/amanda-chase.jpg", "published_at": "2019-09-22"}