{"pub": "morningstar", "url": "https://morningstar.com/articles/951278/our-take-on-asset-manager-earnings", "downloaded_at": "2019-10-29 00:15:37.245389+00:00", "title": "Our Take on Asset Manager Earnings", "language": "en", "text": "There has been little in this quarter’s results that would alter our long-term view of the asset managers that have reported earnings so far, although we did raise our fair value estimates for BlackRock (BLK) and Cohen & Steers (CNS) and lower our fair value estimate for Invesco (IVZ). Our valuations for T. Rowe Price (TROW), AllianceBernstein (AB), Franklin Resources (BEN), and Federated Investors (FII) are unchanged.\n\nWe already featured BlackRock’s third-quarter earnings report in the Oct. 18 Stock Strategist. Results for the others follow.\n\nMore Volatile Equity Markets Lead to Mixed Results for T. Rowe Price\n\nT. Rowe Price closed the September quarter with $1.126 trillion in managed assets, up 0.1% sequentially and 3.9% year over year, despite more volatile equity markets. Net inflows of $2.5 billion would likely have been better had the equity markets not sold off during August but were still on par with the $2.3 billion quarterly run rate we’ve seen for flows at T. Rowe Price since the end of the 2008-09 financial crisis. Target-date funds continue to generate the bulk of the company’s organic growth, bringing in another $2.0 billion during the third quarter.\n\nWhile average assets under management rose 2.8% year over year during the September quarter, T. Rowe Price reported a 2.3% increase in revenue compared with the prior-year period thanks to a 6.1% decline in administrative, distribution, and servicing fees, as well as a lowering of its effective fee rate to 0.458% from 0.467% during the third quarter of 2018. Year-to-date revenue growth of 2.0% was in line with our call for low- to mid-single-digit top-line growth during 2019, driven by the equity market recovery during the first half as well as easier comparables in the final quarter of the year.\n\nAdjusted operating margin of 43.5% during the first nine months of 2019 was 120 basis points lower than in 2018, as compensation and occupancy expenses expanded at a much faster rate than revenue. While this was better than our full-year forecast for operating margin of 40%-41% (and our five-year forecast for margin of 40%-42% on average), we’ll hold back on altering our projections as the company continues to make up-front investments in key regions and channels to help drive growth--and is likely to take advantage of the better margin picture to make additional investments.\n\nIn an environment where active fund managers are under assault for poor relative performance and high fees, we believe T. Rowe Price is the best positioned among the U.S.-based active asset managers we cover. The biggest differentiators for the company are the size and scale of its operations, the strength of its brands, its consistent record of active fund outperformance, and reasonable fees. T. Rowe Price has historically had a stickier set of clients than its peers, with two thirds of its assets under management derived from retirement-based accounts. At the end of September, 68%, 75%, and 81% of the company’s funds were beating peers on a 3-, 5-, and 10-year basis, respectively, better than just about every publicly traded (and privately held) U.S.-based asset manager we cover. T. Rowe Price also maintained a much stronger Morningstar Success Ratio--which evaluates whether a company’s open-end funds deliver sustainable, peer-beating returns over longer periods--giving it an additional leg up over many of its peers.\n\nWhile T. Rowe Price will face headwinds in the near to medium term as baby boomer rollovers affect organic growth in the defined-contribution channel, we think the company, and defined-contribution plans in general, have a compelling cost and service argument to make to pending retirees, which should mitigate some of the impact as they work more closely with these end clients. We also believe T. Rowe Price is uniquely positioned among the companies we cover (as well as the broader universe of active asset managers) to pick up business in the retail-advised channel--an area of the market the company has not focused too heavily on in the past--given the solid long-term performance of its funds and reasonableness of its fees, exemplified by deals during the past two years with Fidelity Investments’ FundsNetwork and Schwab’s Mutual Fund OneSource platform.\n\nOutflows From Long-Term AUM Mar Invesco’s Results\n\nWe lowered our Invesco fair value estimate to $21 per share from $23 to account for our expectations for weaker near-term AUM levels and fees than we previously forecast. Invesco closed the September quarter with $1.184 trillion in managed assets, down 1.1% sequentially but up 20.7% year over year. Excluding the impact of the Oppenheimer acquisition, which added $224.4 billion in AUM during the second quarter of 2019, the company’s managed assets were down 2.1% year over year. Long-term AUM outflows of $11.1 billion during the third quarter were driven primarily by outflows from Oppenheimer, in our view. Invesco has been “conservatively” forecasting outflows of around $10 billion (or 4% of Oppenheimer’s AUM) in the year following the close of the deal, but our projections have been focused on having 5%-10% of acquired AUM lost to merger-related outflows during the first year.\n\nWhile average long-term AUM was up 21.5% year over year during the September quarter, Invesco reported a 28.2% increase in revenue compared with the prior-year period. Overall top-line growth of 7.8% through the first nine months of the year was at the lower end of our forecast for high-single- to double-digit revenue growth this year, but the company faces easier comparisons in the December quarter, given the sell-off in the equity markets during the fourth quarter of 2018. We continue to believe that more-volatile markets and a difficult environment for fees and performance will limit revenue growth longer term. Year-to-date adjusted operating margin of 23.5% was 240 basis points lower than in 2018, with almost all of the company’s expenses expanding at a faster rate than revenue, but this was basically in line with how we expected the year to unfold.\n\nPositive Flows and Market Gains Lift AllianceBernstein’s Results\n\nAllianceBernstein closed the September quarter with $592.4 billion in assets under management, up 2.0% sequentially and 7.6% year over year. Net inflows of $8.1 billion marked the fifth straight quarter of positive flows and third consecutive quarter where inflows exceeded $5.0 billion for the company. From an asset class perspective, most of the inflows came from AB’s fixed-income ($10.4 billion) platforms. On a channel basis, the retail ($7.4 billion) and institutional ($1.5 billion) channels drove most of the flows, with the private client channel actually seeing outflows (of $800 million). Although we are impressed by AB’s current annualized organic AUM growth rate (3.5% during the third quarter), we doubt it can be sustained; we expect 0%-2% annual organic AUM growth during 2019-23.\n\nWhile average AUM increased 7.2% year over year, adjusted third-quarter revenue was up just 2.3% year over year as a huge drop in performance fees offset gains in base management fees and distribution revenue. Year-to-date top-line growth of negative 1.4% was in line with our projection for a low-single-digit revenue decline this year. We continue to believe that more-volatile markets and a difficult environment for fees and performance will limit revenue growth longer term, with the net result being flat to slightly negative revenue growth during 2019-23.\n\nAB’s adjusted operating margin of 20.3% during the first nine months of 2019 was in line with our full-year projections. We believe AB will gradually improve its margin, but we doubt that profitability will move higher than 25% of revenue on an adjusted basis, given the fee and margin pressures facing the entire industry.\n\nOutflows and Market Losses Mar Franklin’s Results\n\nFranklin Resources closed the September quarter with $692.6 billion in assets under management, down 3.2% sequentially and 3.4% year over year. Excluding the Benefit Street Partners acquisition, which added $26.4 billion in AUM during the March quarter, Franklin’s AUM was down 7.1% year over year.\n\nNet new outflows of $15.6 billion during the fiscal fourth quarter were $2.5 billion better than our forecast, and total net outflows (which include exchanges and reinvested dividends) of $12.8 billion were better than our forecast for $14.6 billion. Annual organized growth of negative 4.4% during fiscal 2019 was better than results for fiscal 2017 (negative 5.3%) and fiscal 2018 (negative 5.0%) and at the upper end of our forecast for negative 4%-6% organic growth during fiscal 2019. That said, the company trailed our market performance forecast for the period, which was evident in the weaker-than-expected performance figures (especially for global/international products) during the fourth quarter.\n\nWhile average AUM declined 3.1% year over year, Franklin posted a 4.9% decline in fourth-quarter revenue due to shifting product mix and ongoing fee compression. Full-year top-line growth of negative 8.6% was right in line with our full-year forecast for a high-single- to low-double-digit decline. Adjusted full-year operating margins of 27.0% were down 650 basis points from fiscal 2018, as compensation expenses leapt to 27.4% of revenue (compared with 22.0% during the prior-year period) but were basically in line with our expectations, as we have expected Franklin (much like its peers) to keep investing in its asset-management operations to set the stage for longer-term success.\n\nMarket Gains Offset by a Return to Outflows for Federated\n\nFederated Investors closed the September quarter with $527.2 billion in managed assets, up 5.0% sequentially and 20.6% year over year, with much of this being driven by a large influx of money market funds over the past four quarters. Net long-term outflows of $2.4 billion during the third quarter were a return to the string of outflows Federated suffered through during 2018 and the first quarter of 2019, where quarterly outflows averaged $2.9 billion per quarter. Given that we expect the industry to continue to face stiff headwinds, we envision Federated’s organic growth (which is currently tracking around negative 5.5% over the past year) averaging negative 2%-3% annually during fiscal 2019-23, with revenue growth and operating margins affected by industry fee compression and the need to spend more to enhance performance and distribution.\n\nWhile average long-term assets under management were up 19.4% year over year during the September quarter, product mix shift left Federated reporting only a 10.3% revenue increase compared with the prior-year period. Year-to-date top-line growth of 16.9% was in line with our current forecast for 15%-20% during 2019. While year-to-date adjusted operating margin of 26.3% was 410 basis points lower than in 2018, it was in line with how we expect the year to unfold (with Federated’s margins coming in between 25% and 27%). We continue to expect increased expenditures aimed at improving investment performance and enhancing distribution to weigh on the company’s profitability.\n\nSolid Inflows and Market Gains Lift Cohen & Steers’ AUM\n\nWe are raising our fair value estimate for Cohen & Steers to $50 per share from $44 to account for better AUM levels and fees than we previously forecast. Cohen & Steers closed the September quarter with $70.8 billion in total assets under management, up 6.4% sequentially and 11.8% year over year. Net inflows of $1.1 billion were driven by institutional inflows ($512 million) and open-end fund inflows ($616 million). It also marked the first quarter since the second quarter of 2011 that Cohen & Steers has recorded positive flows in each of its investment vehicles: open-end funds and advisory and subadvisory accounts. We forecast full-year organic growth of 3%-5% this year, driven by continued demand for real estate and other alternatives.\n\nWhile average AUM was up 7.7% year over year, revenue increased 6.7% compared with the third quarter of 2018, much of which was due to a slight reduction in the company’s realization rate to 0.5639% (from 0.5673%) owing to changes in product and channel mix. Year-to-date revenue growth of 4.8% through the first nine months of 2019 was better than our full-year forecast for a low- to mid-single-digit increase, which we’ve since boosted to mid- to high single digits (especially with the company having easier comps in the fourth quarter). Year-to-date operating margin of 37.8% was a step down from 39.3% in the year-ago period, as higher compensation costs ate into profits, but is still well above peers. While the company does have around $3.70 per share in cash on hand, which would help support a special annual dividend, a strategic acquisition, or increased share repurchases, its shares are trading well above our revised fair value estimate.", "description": "Nothing alters our long-term expectations, but we have made some valuation changes.", "authors": [], "top_image": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/bltd41ca07127c2d1e8/5d321f0827301d11c67eebf1/Rating_Star_3Stars_1x1.svg", "published_at": "2019-10-28"}