{"pub": "yahoo", "url": "https://news.yahoo.com/essex-lorry-deaths-19-old-110556190.html", "downloaded_at": "2019-10-28 07:37:49.032144+00:00", "title": "Essex lorry deaths: 19-year-old Vietnamese woman feared to be among 39 victims found in trailer", "language": "en", "text": "Relatives believe Bui Thi Nhung is among the victims found in the Essex lorry trailer: Reuters\n\nA 19-year-old Vietnamese woman is feared to be among the 39 migrants who were found dead in a lorry in Essex.\n\nRelatives said Bui Thi Nhung paid a smuggler more than $10,000 (£7,800) to travel to Britain in the hope of working in a nail bar.\n\nHundreds of people attended a church ceremony to pray for the teenager and two other suspected victims from the Do Thanh area of central Vietnam on Saturday.\n\nEarlier, Ms Nhung’s mother and sister cried as they set up an altar with incense and a photo of the missing teenager at their family home.\n\nA relative told the Associated Press they heard from a friend living in the UK that “Nhung is one of the victims”.\n\nShe is one of many young people from the Yen Thanh farming district who migrated for work with the aim of sending home enough money to improve their loved ones’ lives.\n\n“Many families in Yen Thanh have got rich from money sent back by their children working abroad,” said Le Dinh Tuan, one of Nhung’s neighbours.\n\nThe teenager is the latest of several Vietnamese people named as potential victims by concerned family.\n\nRelatives of 26-year-old Pham Tra My told the BBC they had not been able to contact her since she sent a text on Tuesday night saying she was suffocating.\n\n“I am really, really sorry, mum and dad, my trip to a foreign land has failed,” she wrote. “I am dying, I can’t breathe. I love you very much.”\n\nHer father, Pham Van Thin, said smugglers had claimed the route to Britain was safe and involved travel by planes and cars.\n\nHe told Sky News: “We tried to talk her out of it because it would be a very difficult journey for her as a girl.\n\n“But she said: ‘If I don’t go, the family would stay in a very difficult situation because of the big debt’.\n\n“So she took a risk and decided to go, and we had to agree.”\n\nAnother Vietnamese father, Nguyen Dinh Gia, fears his 20-year-old son Nguyen Dinh Luong was among the victims.\n\nPolice have not formally identified any of the 39 victims of the lorry disaster, but VietHome – a website for expatriates in the UK – has sent photos of almost 20 missing Vietnamese citizens to investigators.\n\nDetectives are also looking at a “wider conspiracy” amid claims the lorry could have been part of a convoy of three carrying around 100 people.\n\nPrime minister Nguyen Xuan Phuc has ordered investigations into alleged human trafficking in Vietnam, following years of warnings by British authorities over the use of Vietnamese modern slaves in UK cannabis farms and nail bars.\n\nThe Vietnamese embassy in London has started a hotline while the ambassador to the UK, Tran Ngoc An, spoke to Priti Patel on Friday night before meeting investigators from the National Crime Agency (NCA) and Essex Police.\n\nThe victims’ bodies have been moved from Tilbury Docks to a hospital in Chelmsford as identification efforts and forensic investigations continue.\n\nEssex Police said it was working to “achieve justice for each of these victims and their loved ones” in the largest identification process of its kind in the force’s history.\n\nThe mother, left, and other relatives of Bui Thi Nhung sit in front of an altar inside her home (AP) More\n\nOfficials said they were compiling evidence including DNA, dental records, tattoos and scars as quickly as possible so victims can be identified and repatriated.\n\nOn Sunday police in Vietnam took hair and blood samples from relatives of suspected victims to assist with the probe.", "description": "A 19-year-old Vietnamese woman is feared to be among the 39 migrants who were found dead in a lorry in Essex.Relatives said Bui Thi Nhung paid a smuggler more than $10,000 (£7,800) to travel to Britain in the hope of working in a nail bar.", "authors": ["Lizzie Dearden"], "top_image": "https://s.yimg.com/uu/api/res/1.2/y1OyMpRdv265Sgq40YcNkA--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/5c800d7b4bf145e66e0942f828e872f3", "published_at": "2019-10-27"}