{"pub": "businessinsider", "url": "https://businessinsider.com/facebook-messaging-app-threads-location-fitness-activity-data-2019-10", "downloaded_at": "2019-10-04 17:01:47.825969+00:00", "title": "Facebook’s new 'private' messaging app wants to track your location 24/7, monitor your battery, and even detect if you’re working out", "language": "en", "text": "Facebook released a new companion app to Instagram called Threads, which lets you message your closest friends.\n\nIt requests huge amounts of user data — including 24/7 access to location, battery, whether you're working out, and more\n\nThreads' data slurping highlights how Facebook is still ravenous for users' data, even as it presents itself as a more privacy-focused company.\n\nIt's also Facebook's latest competitor to Snapchat, which Instagram is fiercely competing against for younger users.\n\nVisit Business Insider's homepage for more stories.\n\nFacebook's new messaging app Threads is intended as a way to message your very closest pals — but for an app that plays up privacy and intimacy, it sure asks for a lot of information.\n\nThe Silicon Valley tech giant announced Threads on Thursday as a companion messaging app to Instagram, letting you send messages and status updates just to the people you've designated your \"Close Friends\" on the photo-sharing app. Think of it as a spun-out Instagram inbox, but with a few more features.\n\nThreads — and its maker Facebook — ask for a significant amount of data about everyone who uses it, from continuous, 24/7 access to your physical location to your movement and whether you're working out, and even your battery level.\n\nThe iOS and Android app's requests illustrate how Facebook's thirst for detailed and intimate data about its userbase continues unabated, even after two years of scandals and scrutiny over the company's use and misuse of the personal information of its 2.7 billion users.\n\nRead more: Instagram has created an app for instant messaging with people on your Close Friends list in an attempt to best Snapchat\n\nBusiness Insider downloaded the new app on an iPhone and found the app requesting all the following permissions, even when you're not using it:\n\nContinuous access to your location\n\nYour movement and fitness activity\n\nYour battery level\n\nWhether you're connected to WiFi or mobile data or not\n\nYour closest friends, per your Instagram \"Closest Friends\" list\n\nThreads' auto-status feature requires an awful lot of data. Shona Ghosh/Business Insider\n\nThreads' requests, if granted, amount to giving Facebook unfettered access to a very significant amount of personal info that can be used to build up a detailed and intimate portrait of users' lives.\n\nIt's not immediately clear if Facebook also plans to use this data collected from Threads to inform its sophisticated ad-targeting capabilities, and a spokesperson did not immediately respond to Business Insider's request for clarification.\n\nThe launch of Threads comes despite the ongoing fallout of the Cambridge Analytica scandal, in which a political research firm misappropriated more than 80 million users' data — throwing up serious questions about how Facebook handles people's information and the alarming ways in which that data can be manipulated.\n\nThere has been growing public suspicion of Facebook in light of the scandal and other issues, and unprecedented calls for regulators to break up the firm.\n\nUnder fire, Facebook has gone to some length to rebrand itself as \"privacy-focused,\" not least by pledging to end-to-end encrypt its messaging apps. It is also prioritising smaller-scale sharing between users with real connections over mass followings — the guiding principle behind Threads.\n\nBut Facebook has also made clear that its \"pivot to privacy\" won't meaningfully alter its data collection apparatus: In the company's eyes, privacy on Facebook doesn't extend to privacy from Facebook.\n\nUsers can refuse to hand over continuous access to their data, but it would undermine one of Threads' key features: \"auto-status.\" This automatically tells your friends what you're up to by detecting your movement and activity, from being \"on the move\" while you're traveling to \"at the beach\" when you're close to the ocean, or \"at the gym\" when working out.\n\nThreads asks for your motion and fitness activity for its auto-status feature. Shona Ghosh/Business Insider\n\nThreads described us as \"chilling,\" for example, after we left the iPhone static on the desk, and stuck a little sofa emoji on our profile picture.\n\nYou can also manually change your status, with a pizza emoji for \"eating\", a no-entry sign for \"busy\", or a books emoji for \"studying.\"\n\nThreads automatically affixes your profile image with an emoji to tell close friends what you're up to. Shona Ghosh/Business Insider\n\nThreads is also Facebook's latest assault on Snapchat, which has long billed itself as a more private social network. Facebook has shamelessly copied Snapchat in the past, and is also trying to find ways of attracting younger users who are flocking both to Snapchat and Chinese short video app TikTok, but also love Instagram.", "description": "For a nominally private network, Facebook's new app Threads asks for a surprising amount of user data.", "authors": ["Shona Ghosh"], "top_image": "https://image.businessinsider.com/5c80f43c26289858ad136b16?width=1200&format=jpeg", "published_at": "2019-10-04"}