{"pub": "americanconservative", "url": "https://theatlantic.com/magazine/archive/2019/11/military-officers-trump/598360/?utm_term=2019-10-07T16%3A51%3A38&utm_campaign=the-atlantic&utm_source=twitter&utm_content=edit-promo&utm_medium=social", "downloaded_at": "2019-10-10 15:06:25.146653+00:00", "title": "Top Military Officers Unload on Trump", "language": "en", "text": "The commander in chief is impulsive, disdains expertise, and gets his intelligence briefings from Fox News. What does this mean for those on the front lines?\n\nFor most of the past two decades, American troops have been deployed all over the world—to about 150 countries. During that time, hundreds of thousands of young men and women have experienced combat, and a generation of officers have come of age dealing with the practical realities of war. They possess a deep well of knowledge and experience. For the past three years, these highly trained professionals have been commanded by Donald Trump. To hear more feature stories, see our full list or get the Audm iPhone app. To get a sense of what serving Trump has been like, I interviewed officers up and down the ranks, as well as several present and former civilian Pentagon employees. Among the officers I spoke with were four of the highest ranks—three or four stars—all recently retired. All but one served Trump directly; the other left the service shortly before Trump was inaugurated. They come from different branches of the military, but I’ll simply refer to them as “the generals.” Some spoke only off the record, some allowed what they said to be quoted without attribution, and some talked on the record.\n\nSuch rudderless captaincy creates the headlines Trump craves. He revels when his tweets take off. (“Boom!” he says. “Like a rocket!”) Out in the field, where combat is more than wordplay, his tweets have consequences. He is not a president who thinks through consequences—and this, the generals stressed, is not the way serious nations behave. The generals I spoke with didn’t agree on everything, but they shared the following five characterizations of Trump’s military leadership. I. HE DISDAINS EXPERTISE Trump has little interest in the details of policy. He makes up his mind about a thing, and those who disagree with him—even those with manifestly more knowledge and experience—are stupid, or slow, or crazy. As a personal quality, this can be trying; in a president, it is dangerous. Trump rejects the careful process of decision making that has long guided commanders in chief. Disdain for process might be the defining trait of his leadership. Of course, no process can guarantee good decisions—history makes that clear—but eschewing the tools available to a president is choosing ignorance. What Trump’s supporters call “the deep state” is, in the world of national security—hardly a bastion of progressive politics—a vast reservoir of knowledge and global experience that presidents ignore at their peril. The generals spoke nostalgically of the process followed by previous presidents, who solicited advice from field commanders, foreign-service and intelligence officers, and in some cases key allies before reaching decisions about military action. As different as George W. Bush and Barack Obama were in temperament and policy preferences, one general told me, they were remarkably alike in the Situation Room: Both presidents asked hard questions, wanted prevailing views challenged, insisted on a variety of options to consider, and weighed potential outcomes against broader goals. Trump doesn’t do any of that. Despite commanding the most sophisticated intelligence-gathering apparatus in the world, this president prefers to be briefed by Fox News, and then arrives at decisions without input from others.\n\nOne prominent example came on December 19, 2018, when Trump announced, via Twitter, that he was ordering all American forces in Syria home. “We have defeated ISIS in Syria, my only reason for being there during the Trump presidency,” he tweeted. Later that day he said, “Our boys, our young women, our men, they are all coming back, and they are coming back now.” This satisfied one of Trump’s campaign promises, and it appealed to the isolationist convictions of his core supporters. Forget the experts, forget the chain of command—they were the people who, after all, had kept American forces engaged in that part of the world for 15 bloody years without noticeably improving things. Enough was enough. At that moment, however, American troops were in the final stages of crushing the Islamic State, which, contrary to Trump’s assertion, was collapsing but had not yet been defeated. Its brutal caliphate, which had briefly stretched from eastern Iraq to western Syria, had been painstakingly dismantled over the previous five years by an American-led global coalition, which was close to finishing the job. Now they were to stop and come home? Here, several of the generals felt, was a textbook example of ill-informed decision making. The downsides of a withdrawal were obvious: It would create a power vacuum that would effectively cede the fractured Syrian state to Russia and Iran; it would abandon America’s local allies to an uncertain fate; and it would encourage a diminished ISIS to keep fighting. The decision—which prompted the immediate resignations of the secretary of defense, General James Mattis, and the U.S. special envoy to the mission, Brett McGurk—blindsided not only Congress and America’s allies but the person charged with actually waging the war, General Joseph Votel, the commander of U.S. Central Command. He had not been consulted. Trump’s tweet put General Votel in the position of telling our allies, in effect, We’re screwing you, but we need you now more than ever. Trump’s tweet put Votel in a difficult spot. Here was a sudden 180-degree turn in U.S. policy that severely undercut an ongoing effort. The American contingent of about 2,000 soldiers, most of them Special Forces, was coordinating with the Iraqi army; the Syrian Democratic Forces, or SDF, consisting primarily of Kurdish militias and Syrians opposed to President Bashar al-Assad; and representatives of NATO, the Arab League, and dozens of countries. This alliance had reduced ISIS’s territory to small pockets of resistance inside Syria. America’s troops were deep in the Euphrates Valley, a long way from their original bases of operation. An estimated 10,000 hard-core Islamist soldiers were fighting to the death. Months of tough combat lay ahead.\n\nVotel’s force in Syria was relatively small, but it required a steady supply of food, ammunition, parts, and medical supplies, and regular troop rotations. The avenue for these vital conveyances—through hundreds of miles of hazardous Iraqi desert—was truck convoys, protected almost exclusively by the SDF. To protect its troops during a retreat, America could have brought in its own troops or replaced those truck convoys with airlifts, but either step would have meant suddenly escalating an engagement that the president had just pronounced finished. For the American commander, this was a terrible logistical challenge. An orderly withdrawal of his forces would further stress supply lines, therefore necessitating the SDF’s help even more. Votel found himself in the position of having to tell his allies, in effect, We’re screwing you, but we need you now more than ever. Field commanders are often given orders they don’t like. The military must bow to civilian rule. The generals accept and embrace that. But they also say that no careful decision-making process would have produced Trump’s abrupt about-face. Votel decided to take an exceedingly rare step: He publicly contradicted his commander in chief. In an interview with CNN he said that no, ISIS was not yet defeated, and now was not the time to retreat. Given his responsibility to his troops and the mission, the general didn’t have much choice.\n\nGeneral Joseph Votel and Elizabeth Dent: The danger of abandoning our partners Votel held everything together. He took advantage of the good relationship he had built with the SDF to buy enough time for Trump to be confronted with the consequences of his decision. A few days later, the president backed down—while predictably refusing to admit that he had done so. American forces would stay in smaller numbers (and France and the U.K. would eventually agree to commit more troops to the effort). The 180-degree turn was converted into something more like a 90-degree one. In the end, the main effects of Trump’s tweet were bruising the trust of allies and heartening both Assad and ISIS.\n\nIllustration: Paul Spella; Nicholas Kamm; Olivier Douliery / AFP / Getty; Erik S. Lesser / AP; Kevin LaMarque / Reuters\n\nII. HE TRUSTS ONLY HIS OWN INSTINCTS Trump believes that his gut feelings about things are excellent, if not genius. Those around him encourage that belief, or they are fired. Winning the White House against all odds may have made it unshakable. Decisiveness is good, the generals agreed. But making decisions without considering facts is not. Trump has, on at least one occasion, shown the swiftness and resolution commanders respect: On April 7, 2017, he responded to a chemical-warfare attack by Assad with a missile strike on Syria’s Shayrat Airbase. But this was not a hard call. It was a onetime proportional retaliation unlikely to stir international controversy or wider repercussions. Few international incidents can be cleanly resolved by an air strike. “How did we even get to that point?” one general asked me in astonishment. What kind of commander in chief would risk war with Iran over a drone? A case in point is the flare-up with Iran in June. The generals said Trump’s handling of it was perilous, because it could have led to a shooting war. On June 20, Iran’s air defenses shot down an American RQ-4A Global Hawk, a high-altitude surveillance drone the Iranians said had violated their airspace. The U.S. said the drone was in international airspace. (The disputed coordinates were about 12 miles apart—not a big difference for an aircraft moving hundreds of miles an hour.) In retaliation, Trump ordered a military strike on Iran—and then abruptly called it off after, he claimed, he’d been informed that it would kill about 150 Iranians. One general told me this explanation is highly improbable—any careful discussion of the strike would have considered potential casualties at the outset. But whatever his reasoning, the president’s reversal occasioned such relief that it obscured the gravity of his original decision.\n\n“How did we even get to that point?” the general asked me in astonishment. Given what a tinderbox that part of the world is, what kind of commander in chief would risk war with Iran over a drone? Not only would a retaliatory strike have failed the litmus test of proportionality, this general said, but it would have accomplished little, escalated the dispute with Iran, and risked instigating a broad conflict. In an all-out war, the U.S. would defeat Iran’s armed forces, but not without enormous bloodshed, and not just in Iran. Iran and its proxies would launch terrorist strikes on American and allied targets throughout the Middle East and beyond. If the regime were to fall, what would come next? Who would step in to govern a Shiite Muslim nation of 82 million steeped for generations in hatred of America? The mullahs owe their power to the American overthrow of Iran’s elected government in 1953, an event widely regarded in Iran (and elsewhere) as an outrage. Conquering Americans would not be greeted by happy Persian crowds. The generals observed that those who predicted such parades in Baghdad following the ouster of Saddam Hussein instead got a decade-long bloodbath. Iran has more than twice Iraq’s population, and is a far more developed nation. The Iraq War inspired the creation of ISIS and gave renewed momentum to al‑Qaeda; imagine how war with Iran might mobilize Hezbollah, the richest and best-trained terrorist organization in the world.\n\nSometimes, of course, war is necessary. That’s why we maintain the most expensive and professional military in the world. But a fundamental reason to own such power is to avoid wars—especially wars that are likely to create worse problems than they solve. General Votel, who commanded American forces in the region until he retired in March, told me that if the U.S. had carried out a retaliatory strike, “the trick for the military in this case would be to orchestrate some type of operation that would very quickly try and get us to an off-ramp—give them an off-ramp or provide us with an off-ramp—so we can get to some kind of discussion to resolve the situation.” Trump’s attack might have targeted some of the Iranian navy’s vessels and systems that threaten shipping in the Strait of Hormuz, Votel said, or it might have leveled a measured strike against the air defenses that struck the drone. Ideally it would have been followed by a pause, so diplomatic processes could kick in. The strike would have demonstrated to Iran that we have the capability and willingness to strike back if provoked, and made clear that in a serious fight, it could not prevail. But all of this presumes a sequence that would unfold in an orderly, rational way—a preposterous notion. “This is all completely unpredictable,” Votel said. “It’s hard for me to see how it would play out. We would be compelled to leave large numbers of forces in the region as a deterrent. If you don’t have an off-ramp, you’re going to find yourself in some kind of protracted conflict.” Which is precisely the kind of scenario Trump has derided in the past. His eagerness to free the U.S. from long-term military conflicts overseas was why he made his abrupt announcement about pulling out of Syria. Evidently he didn’t fully consider where a military strike against Iran was likely to lead.\n\nThe real reason Trump reversed himself on the retaliatory strike, one general said, was not because he suddenly learned of potential casualties, but because someone, most likely General Joseph Dunford, the chairman of the Joint Chiefs of Staff, aggressively confronted him with the extended implications of an attack. “I know the chairman very well,” the general said. “He’s about as fine an officer as I have ever spent time around. I think if he felt the president was really heading in the wrong direction, he would let the president know.” He added that Secretary of State Mike Pompeo may have counseled against an attack as well. “Pompeo’s a really bright guy. I’m sure he would intervene and give the president his best advice.” III. HE RESISTS COHERENT STRATEGY If there is any broad logic to Trump’s behavior, it’s Keep ’em confused. He believes that unpredictability itself is a virtue. Keeping an enemy off-balance can be a good thing, the generals agreed, so long as you are not off-balance yourself. And it’s a tactic, not a strategy. Consider Trump’s rhetorical dance with the North Korean dictator Kim Jong Un. No president in modern times has made progress with North Korea. Capable of destroying Seoul within minutes of an outbreak of hostilities, Pyongyang has ignored every effort by the U.S. and its allies to deter it from building a nuclear arsenal. Trump has gone back and forth dramatically on Kim. As a candidate in 2016, he said he would get China to make the North Korean dictator “disappear in one form or another very quickly.” Once in office, he taunted Kim, calling him “Little Rocket Man,” and suggested that the U.S. might immolate Pyongyang. Then he switched directions and orchestrated three personal meetings with Kim.\n\n“That stuff is just crazy enough to work,” one of the generals told me with a what-the-hell? chuckle. “We’ll see what happens. If they can get back to some kind of discussion, if it can avert something, it will have been worth it. The unconventional aspect of that does have the opportunity to shake some things up.” In the long run, however, unpredictability is a problem. Without a coherent underlying strategy, uncertainty creates confusion and increases the chance of miscalculation—and miscalculation, the generals pointed out, is what starts most wars. John F. Kennedy famously installed a direct hotline to the Kremlin in order to lower the odds of blundering into a nuclear exchange. Invading Kuwait, Saddam Hussein stumbled into a humiliating defeat in the first Gulf War—a conflict that killed more than 100,000 people—after a cascading series of miscommunications and miscalculations led to a crushing international response. From July/August 2017: Mark Bowden on how to deal with North Korea Unpredictability becomes an impediment to success when it interferes with orderly process. “Say you’re going to have an engagement with North Korea,” a general who served under multiple presidents told me. “At some point you should have developed a strategy that says, Here’s what we want the outcome to be. And then somebody is developing talking points. Those talking points are shared with the military, with the State Department, with the ambassador. Whatever the issue might be, before the president ever says anything, everybody should know what the talking points are going to be.” To avoid confusion and a sense of aimlessness, “everybody should have at least a general understanding of what the strategy is and what direction we’re heading in.”\n\nWhich is frequently not the case now. “If the president says ‘Fire and brimstone’ and then two weeks later says ‘This is my best friend,’ that’s not necessarily bad—but it’s bad if the rest of the relevant people in the government responsible for executing the strategy aren’t aware that that’s the strategy,” the general said. Having a process to figure out the sequences of steps is essential. “The process tells the president what he should say. When I was working with Obama and Bush,” he continued, “before we took action, we would understand what that action was going to be, we’d have done a Q&A on how we think the international community is going to respond to that action, and we would have discussed how we’d deal with that response.” To operate outside of an organized process, as Trump tends to, is to reel from crisis to rapprochement to crisis, generating little more than noise. This haphazard approach could lead somewhere good—but it could just as easily start a very big fire. If the president eschews the process, this general told me, then when a challenging national-security issue arises, he won’t have information at hand about what the cascading effects of pursuing different options might be. “He’s kind of shooting blind.” Military commanders find that disconcerting. “The process is not a panacea—Bush and Obama sometimes made bad decisions even with all the options in front of them—but it does help.”\n\nIllustration: Paul Spella; Eric Thayer / Reuters\n\nIV. “HE IS REFLEXIVELY CONTRARY” General H. R. McMaster, who left the White House on reasonably good terms in April 2018 after only 14 months as national security adviser, is about as can-do a professional as you will find. He appeared to take Trump seriously, and tailored his briefings to accommodate the president’s famous impatience, in order to equip him for the weighty decisions the office demands. But Trump resents advice and instruction. He likes to be agreed with. Efforts to broaden his understanding irritate him. McMaster’s tenure was bound to be short. Weeks before accepting his resignation, the president let it be known that he found McMaster’s briefings tedious and the man himself “gruff and condescending.”\n\nDistrusting expertise, Trump has contradicted and disparaged the intelligence community and presided over a dismantling of the State Department. This has meant leaving open ambassadorships around the world, including in countries vital to American interests such as Brazil, Canada, Honduras, Japan, Jordan, Pakistan, Russia, and Ukraine. High-level foreign officers, seeing no opportunities for advancement, have been leaving. “When you lose these diplomats and ambassadors that have all this experience, this language capability, this cultural understanding, that makes things very, very difficult for us,” one of the generals said. “And it leads to poor decisions down the line.” Trump so resists being led that his instinct is nearly always to upend prevailing opinion. “He is reflexively contrary,” another of the generals told me. According to those who worked with him, McMaster avoided giving the president a single consensus option, even when one existed. He has said that he always tried to give the president room to choose. After leaving the White House, he criticized others in the national-security community for taking a different approach, accusing them of withholding information in hopes of steering Trump in the direction they preferred. McMaster has not named names, but he was most likely talking about Mattis and General John Kelly, who, after serving as Trump’s homeland-security secretary, became the president’s second chief of staff. McMaster has said that he considered such an approach tantamount to subverting the Constitution—but if his allegation is true, it shows how poorly equipped those people felt Trump was for the job. Special Counsel Robert Mueller’s report records numerous instances of civilian advisers trying to manage the president, or simply ignoring presidential directives they deemed ill-advised or illegal.\n\nDuring his brief tenure on Trump’s staff, McMaster oversaw the production of a broad national-security strategy that sought to codify Trump’s “America first” worldview, placing immigration at the head of national-security concerns, right alongside nuclear proliferation and terrorist attacks. The idea was to build a coherent structure around the president’s scattershot diplomacy. Trump rhapsodized about the document at its unveiling, according to someone who was there, saying, “I love it! I love it! I want to use this all the time.” He hasn’t. Like its author, the document has been dismissed. Those who were involved in writing it remain convinced, somewhat hopefully, that it is still helping guide policy, but John Bolton, McMaster’s successor, said scornfully—a few months before he, too, was ousted by Trump—that it is filed away somewhere, consulted by no one. Trump is no more likely to have read the thing than he is to have written his own books. (Years ago, after he published The Art of the Deal, he asked me if I was interested in writing his next book. I declined.) Trying to shape this president’s approach to the world into a cogent philosophy is a fool’s errand. For those commanding America’s armed forces, it’s best to keep binoculars trained on his Twitter feed. V. HE HAS A SIMPLISTIC AND ANTIQUATED NOTION OF SOLDIERING Though he disdains expert advice, Trump reveres—perhaps fetishizes—the military. He began his presidency by stacking his administration with generals: Mattis, McMaster, Kelly, and, briefly, Michael Flynn, his first national security adviser. Appointing them so soon after their retirement from the military was a mistake, according to Don Bolduc, a retired brigadier general who is currently running as a Republican for the U.S. Senate in New Hampshire. Early on, the biggest difference Bolduc saw between the Trump administration and its predecessors, and one he felt was “going to be disruptive in the long term,” was “the significant reliance, in the Pentagon at least, on senior military leadership overriding and making less relevant our civilian oversight. That was going to be a huge problem. The secretary of defense pretty much surrounded himself with his former Marine comrades, and there was, at least from that group, a distrust of civilians that really negatively affected the Pentagon in terms of policy and strategy in Afghanistan, Syria, and Iraq, by following the same old failed operational approaches.” Trump’s reliance on military solutions is problematic because “there are limits to what the military can solve. I think initially the Trump administration held this idea that general officers somehow have all the answers to everything. I think the president discovered in short order that that’s really not the case.”\n\nBolduc also pointed out an unusual leadership challenge caused by having a general of McMaster’s rank serve as national security adviser—he did not retire when he assumed the post. “McMaster, for whom I have tremendous respect, came in as a three-star general. Leaving him a three-star forces him on a daily basis to have to engage with four-star generals who see his rank as beneath theirs, even though his position is much more than that.” The problems posed by Trump’s skewed understanding of the military extend beyond bad decision making to the very culture of our armed forces: He apparently doesn’t think American soldiers accused of war crimes should be prosecuted and punished. In early May, he pardoned former Army Lieutenant Michael Behenna, who had been convicted of murdering an Iraqi prisoner. Two weeks later, he asked the Justice Department to prepare pardon materials for a number of American servicemen and contractors who were charged with murder and desecration of corpses, including Special Operations Chief Edward Gallagher, a Navy SEAL who stood accused by his own team members of fatally stabbing a teenage ISIS prisoner and shooting unarmed civilians. (He was ultimately acquitted of the murders but convicted of posing for photos with the boy’s body.) Trump subsequently chastised the military attorneys who had prosecuted Gallagher, and directed that medals awarded to them be rescinded. All of the generals agreed that interfering with the military’s efforts to police itself badly undermines command and control. When thousands of young Americans are deployed overseas with heavy weaponry, crimes and atrocities will sometimes occur. Failing to prosecute those who commit them invites behavior that shames everyone in uniform and the nation they serve.", "description": "The commander in chief is impulsive, disdains expertise, and gets his intelligence briefings from Fox News. What does this mean for those on the front lines?", "authors": ["Mark Bowden"], "top_image": "https://cdn.theatlantic.com/assets/media/img/2019/10/WEL_Bowden_TrumpGeneralsOpener/facebook.jpg?1570458085", "published_at": "2019-10-07"}