{"pub": "breitbart", "url": "https://breitbart.com/news/chicago-teachers-to-strike-for-9th-school-day-city-reaches-deal-with-support-staff", "downloaded_at": "2019-10-29 06:01:37.682210+00:00", "title": "Chicago teachers to strike for 9th school day; city reaches deal with support staff", "language": "en", "text": "Oct. 28 (UPI) — The Chicago teachers strike will extend into a ninth school day after the school district and the union failed to reach a deal on Monday.\n\nChicago Public Schools announced schools will remain closed on Tuesday, as the Chicago Teachers Union had not scheduled a House of Delegates vote necessary to end the strike.\n\nChicago Public Schools said it offered the CTU a package worth $485 million including 16 percent raises for all teachers and support staff, a full-time nurse and social worker to work in every school and additional full-time staff for schools with high need.\n\nCTU Vice President Stacy Davis Gates said the latest offer did not successfully meet their demands.\n\n“When I hear that there’s a deal on the table and we cannot say yes, I ask a question: Do you say yes to injustice? Do we say yes to inequity? Do we say yes to things that are half done?” she said. “The offer on the table right now effectively provides class size protections for only one-third of the entire city.”\n\nChief Education Officer LaTanya McDade said one of the issues keeping the sides from reaching a deal was providing teachers with paid time to prepare, which the district opposes, saying it would require reduced instructional time.\n\n“The truth is we have made quite a bit of compromise at the table and we also need the union to make compromises,” she said.\n\nWhile the overall progress toward a deal remained stalled on Monday, Chicago Public Schools reached a tentative deal with SEIU Local 73, the union representing school support staff.\n\n“This is a victory for working people in Chicago and shows what is possible when we unite and take action,” SEIU Local 73 President Dian Palmer said. “The lowest-paid support workers who are the backbone of our schools are going to see raises that mean their families won’t have to struggle living in an expensive city where costs keep going up.”", "description": "Oct. 28 (UPI) — The Chicago teachers strike will extend into a ninth school day after the school district and the union failed to reach a deal on", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-28"}