{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/massachusetts-mansion-with-personal-car-wash-asks-6-5-million-207280", "downloaded_at": "2019-09-14 01:46:52.285000+00:00", "title": "Massachusetts Mansion With Personal Car Wash Asks $6.5 Million", "language": "en", "text": "A sprawling Massachusetts estate with an entire entertainment level and its own car wash has listed with a $6.5 million price tag.\n\n\n\nThe mansion is in the town of Sudbury, roughly 20 miles west of Boston, and hit the market last week.\n\n\n\nMore: A Car-Lover’s Home Lists in Beverly Hills for $45 Million\n\nThe 17,125-square-foot property, approached via a long winding driveway, was built in 1989, according to the listing with Leo Young and Denise Mosher of Coldwell Banker Residential Brokerage, Weston.\n\n\n\nIt’s entered through an ornate entry hall, and has a library, a maple wood-paneled living room topped by an open rotunda, a cathedral-like family room with arched beams and a stone fireplace, and a chef’s kitchen with professional-grade appliances, marble counters and patio access, the listing said.\n\n\n\nThe home’s six bedrooms include a master suite with his-and-hers bathrooms, dressing rooms, and direct access to the garden and pool outside. Meanwhile a private, multi-room in-law, or au pair, suite has its own separate entrance.\n\n\n\nThe home is being sold by a medical technology executive who paid $2.9 million for it in 2007, according to property records. He could not be reached for comment.\n\n\n\nFrom Penta: J.K. Rowling Donates $18.9 Million to MS Research\n\n“This is a beautiful estate home for anyone, but especially convenient for a car enthusiast or wine collector,” Ms. Mosher said in a statement to Mansion Global. “The eight-car heated and cooled garage with a professional-grade car wash is a spectacular feature that adds to all the additional amazing amenities this home offers.”\n\n\n\nAlongside the amenities for the auto enthusiast, the home also has an entire entertainment floor, complete with a billiards room, a gym, a copper-ceilinged wine room with the capacity to hold approximately 1,000 bottles and a 15-person theater, the listing said.\n\n\n\nThe property itself sits on 2.17 acres and backs on to a vast 50-acre conservation area.\n\n", "description": "", "authors": ["Liz Lucking"], "top_image": "https://images.mansionglobal.com/im-107158?width=1280", "published_at": "2019-09-13"}