{"pub": "cbs", "url": "https://cbsnews.com/news/beto-orourke-says-he-expects-americans-to-surrender-their-guns", "downloaded_at": "2019-10-25 15:57:52.080249+00:00", "title": "Beto O'Rourke says he expects Americans to surrender their guns", "language": "en", "text": "Beto O'Rourke dismissed criticisms of his sweeping gun control proposal, telling CBS News in an interview Thursday night that he expects gun owners will go along with his plan to institute a \"mandatory buyback\" of high-powered rifles.\n\n\"If we're able to pass mandatory buybacks and I'm able to sign that into law, then I fully expect our fellow Americans to turn in their AR-15s and their AK-47s,\" the former Texas congressman said.\n\nO'Rourke's \"mandatory buyback\" plan, which would force gun owners to surrender high-powered rifles like the AR-15 and the AK-47, has been criticized as impractical by other candidates in the race. South Bend Mayor Pete Buttigieg, for example, has said that O'Rourke's plan amounts to \"confiscation.\"\n\nBeto O'Rourke says he expects Americans to surrender guns\n\nButtigieg and O'Rourke sparred over their gun views at the most recent Democratic debate earlier this month. Buttigieg, who backs more traditional gun control measures like universal background checks, dismissed O'Rourke's idea as a \"purity test\" and a \"shiny object.\" In a jab back at Buttigieg, O'Rourke said that Democrats should not base their opinions on polling and what consultants say.\n\n\"I don't need lessons from you on courage — political or personal,\" Buttigieg, who was deployed to Afghanistan during his time in the Navy Reserve, responded.\n\nWhen asked by CBS News about the gun activists who stood up for Buttigieg after the exchange, including former Congresswoman Gabby Giffords — who was shot in the head in 2011 — and Parkland shooting survivor David Hogg, O'Rourke praised the activists for their work before firing back at the South Bend mayor.\n\n\"You're bringing up a criticism that was made by the mayor of South Bend, Indiana, that trying to get AR-15s and AK-47s, weapons of war, off the streets, is pursuing a 'shiny object,'\" O'Rourke told CBS News. \"For me, for those who have experienced gun violence from these military style weapons, I think that's a slap in the face.\n\n\"It denies the experience that so many Americans have had, and the fear that so many live under that they, too, will be the victims of gun violence from one of these instruments of terror. So, regardless of the politics of this or how it polls or what other candidates are saying, I'm going to pursue the right thing because it's the right thing to do.\"\n\nO'Rourke also said that the plan could be paid for with new taxes on the gun industry.\n\n\"I think that a mandatory buyback can be financed with a surcharge that would be paid by gun manufacturers,\" O'Rourke said. \"Those who are making the AR-15s and AK-47s and continue to sell them into our communities despite the terror that they've inspired and the lives that they've taken. I think this is the right way to fund a mandatory buyback without imposing any new taxes on our fellow Americans.\"\n\nAnd O'Rourke said that anyone who refuses to go along with his mandatory buyback, should it become law, will face \"consequences.\"\n\n\"For anyone who does not [turn in their weapon] and is caught in possession or seen in possession of one of these weapons of war, one of these instruments of terror, that weapon will be taken from them and they will be fined, and if they should persist in continuing to use and to buy these weapons, then there will be other consequences in the criminal code.\"", "description": "\"If we're able to pass mandatory buybacks, and I'm able to sign that into law, then I fully expect our fellow Americans to turn in their AR-15s and their AK-47s,\" he told CBS News", "authors": ["Timothy Perry"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/25/efbccab7-1451-4781-9709-6e007e806cee/thumbnail/1200x630/6b8b1279c5dda94d599a6e91d1b1353a/gettyimages-1179204853.jpg", "published_at": "2019-10-25"}