{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/a-columbus-day-crisis-no-school-and-a-fortnite-blackout/2019/10/14/fa1ffff6-eeb5-11e9-89eb-ec56cd414732_story.html", "downloaded_at": "2019-10-14 23:21:33.195967+00:00", "title": "A Columbus Day crisis: No school and a Fortnite blackout", "language": "en", "text": "Welcome to the Fortnite black hole that coincided with a day off from school for many American kids.\n\nThe insanely popular video game that swallowed children whole more than a year ago just spit them back up Sunday night, when the entire digital universe that’s been their virtual home shut down.\n\nAD\n\nOn all platforms, the Fortnite home screen is nothing but a slightly twinkling black hole, pieces of debris still being sucked in after the island that millions of kids have inhabited all hours of the day went blip.\n\nAD\n\nParents rejoiced: “We have our kids back!”\n\nThen, parents realized what the indefinite shutdown meant: “Oh. We lost our child care.”\n\nWithin hours of the planned blackout — the first time the gamemakers dramatically ended one season before starting another in what is likely a huge and risky publicity stunt — parents began creating a whole new genre of YouTube videos, showing their kids crying, tantruming and ululating before the blank TV screen.\n\nAD\n\nThe pain is real. And hilarious. And frightening. (I’ll let you find most of them on your own. Most are too profane to link to.)\n\nThe adult gamers who abandoned kid-heavy Fortnite were also raging because their own refuges, games less appealing to kids like Apex and Blackout, started becoming virtual kindertowns as the forlorn Fortnite orphans migrated.\n\n“Finian switched to Minecraft. And Madden,” my son reported, about the friend with whom he had planned a Fortnite team. “I don’t know if I’m going to be disloyal.”\n\nAD\n\nMy kid had a busy weekend — hockey, band practice, outdoor projects, washing the dogs and a high-tide, autumn river swim. He saved up all his video gaming time for what was supposed to be an epic bonus day of playing with his squad on Columbus Day.\n\nAD\n\nBut Sunday night, the squad started texting him the devastating news about the black hole.\n\n“We don’t know when it’s going to start back up,” he said. “So we’re lost. Some of my friends are just sitting there, watching the hole.”\n\nIn Texas, Erasmo Hernandez Jr. posted a video of a kid trying to play with a foam airplane, explaining: This is “8 year olds having to actually do something outside cause fortnite is dead #ripfornite.”\n\nThe world’s most popular game is a difficult question for today’s parents. It’s not the old school gaming of solitude and total awkwardness.\n\nAD\n\nThis game is played in groups and it’s supersocial. My son never plays alone. He mics up and squads up with his friends from school or hockey, and they work to conquer the island together. This is how they socialize and relate.\n\nAD\n\n“I don’t understand how you guys used to just talk on the phone for hours, without doing anything. That was so sad,” my older son observed when I told him about the long phone cord that stretched down the hall and into my room, where I shut myself in and gossiped after school, trying to understand how my kids socialize today.\n\nThe struggle to find a healthy balance is a pain. Ban gaming, and they miss out on a contemporary experience and socializing with their friends. Indulge too much and they become zombies.\n\nIt’s why some folks theorized that the whole black hole was funded by a bunch of desperate parents who simply wanted their kids back for a few days.\n\nAD\n\nAD\n\nI checked up on my son, who was still sitting in the sunshine. He was bored. It felt new. And weird. And good.\n\n“I texted Justin and Jason to see if they could come over and we can play football outside,” he said. “I miss that.”\n\nMe too.\n\nCan we make a deal, Fortnite? Y’all do this black hole thing every few weeks, and we’ll let them keep playing — a little bit — when you come back.\n\nRead more Petula Dvorak:\n\nAD", "description": "Parents were almost as flummoxed as their kids", "authors": ["Petula Dvorak", "Local Columnist"], "top_image": "https://www.washingtonpost.com/resizer/js4AiQQadY1faecizPTOaTBaugY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KEWOGVHOXMI6TCPL5RLM2QKHGI.jpg", "published_at": "2019-10-14"}