{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/arsenal-midfielder-matteo-guendouzi-keen-20534260", "downloaded_at": "2019-10-08 05:13:33.940847+00:00", "title": "Arsenal's Matteo Guendouzi on how Unai Emery has made him better player", "language": "en", "text": "Get the biggest Arsenal FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nArsenal midfielder Matteo Guendouzi is determined to repay Unai Emery's faith in him after a promising start to the season.\n\nGuendouzi has consolidated his position in Arsenal's midfield this season and has been one of the Gunners' most consistent performers.\n\nThere have even been calls for him to be given the captaincy - which was recently handed somewhat controversially to Granit Xhaka - with Arsenal legend Ian Wright hailing Guendouzi as \"leading by example\".\n\nAfter becoming a first-team regular last season, Guendouzi says his improvement is down to Emery's coaching - and the French under-21 international says he wants to give the manager something back.\n\n“We communicate a lot in training, in games on what I can bring on the pitch or in my personal life,\" said Guendouzi in quotes reported by Foot Mercato, via Sport Witness .\n\n(Image: Arsenal FC via Getty Images)\n\n“He’s someone who’s taught me a lot on and off the pitch. I know he trusts me a lot because I’ve started all the games in the Premier League since the start of the season.\n\n“It’s then up to me to stay myself, play well and repay that trust. He’s the one who gave me the opportunity at the highest level.\n\n“I already played a lot last year. He gives me a lot of confidence and he’s the one who makes me feel good on the pitch.\n\n“There’s also my teammates, who are a big part of that, but he’s really, really made me progress since I arrived at Arsenal.”\n\n(Image: PA)\n\nFormer Gunners striker Wright last week praised Guendouzi for \"taking the game by the scruff of the neck and driving Arsenal forward\".\n\n\"I know they've chosen the captain but Xhaka should not be captain in front of this guy (Guendouzi) or Aubameyang, for me,\" Wright told Premier League productions.\n\n\"Guendouzi is leading by example for a 20-year-old. We know Tony Adams was a captain at 20. Maybe Unai's not strong enough to give somebody like Matteo Guendouzi [the captaincy].\n\n\"When you look at him here and what he's doing, that is taking the game by the scruff of the neck and driving Arsenal forward, and he's not been made captain or vice-captain. It's crazy, for me.\"", "description": "French U21 ace has been one of Gunners' most consistent performers and says that's down to the manager", "authors": ["Gareth Bicknell", "Image", "Arsenal Fc Via Getty Images", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article19468164.ece/ALTERNATES/s1200/0_Arsenal-Training-Session.jpg", "published_at": "2019-10-08"}