{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7561671/Polands-ruling-party-gets-40-support-ahead-Sunday-vote.html", "downloaded_at": "2019-10-11 05:59:46.438072+00:00", "title": "Poland's ruling party gets 40% support ahead of Sunday...", "language": "en", "text": "WARSAW, Oct 11 (Reuters) - Poland's ruling nationalist Law and Justice (PiS) party has the highest support of any political grouping ahead of Sunday's parliamentary elections, according to a poll published late Thursday. A poll by Kantar for private television TVN on Oct. 9-10 showed the PiS-led coalition with 40% support, while its main rival, Civic Coalition, which includes Civic Platform (PO), was at 26%. The leftist bloc Lewica had 12% support, PSL/Kukiz'15 had 7% and the far-right Konfederacja got 7%. Poland, the biggest post-communist European Union member country, will hold elections for its upper and lower houses of the parliament on Oct. 13 after four years of PiS rule. Below are the latest party polls (the newest at the top): P'ster PiS PO Lewica PSL/Kukiz'15 Konfederacja Kantar 40 26 12 7 7 IBRiS 42.6 22.5 13.1 6.9 4.3 IBRiS 45.1 24.6 12.6 5.6 3.8 Kantar 42 29 13 4 5 IBRiS 44.3 24.3 12.0 5.9 3.6 IBRiS 42.4 25 13.1 5.8 4.4 Indicator 44.3 26.1 11.9 6.1 4.1 Kantar 40.0 28.0 10.0 5.0 7.0 IBRiS 44.5 23.9 14.1 6.0 4.4 CBOS 46.0 23.0 5.0 8.0 3.0 Kantar 43.0 30.0 11.0 4.0 5.0 Kantar 40.0 24.0 11.0 6.0 2.0 IBRiS 42.4 22.7 13.1 5.6 3.4 IBRiS 43.4 21.2 14.1 5.7 4.8 IPSOS 41.0 28.0 13.0 5.0 5.0 CBOS 47.0 19.0 9.0 6.0 2.0 IBRiS 41.5 26.6 12.2 7.2 4.7 Indicator 41.3 28.5 11.3 5.7 3.1 IBRiS 41.0 25.0 13.0 6.0 5.0 Kantar 39.0 30.0 11.0 6.0 6.0 PiS - Ruling Law and Justice party and its two small satellite parties. PO - Civic Platform along with Nowoczesna party and other small ones. Lewica - Block of three leftist parties including post-communist SLD and progressive Wiosna. PSL/Kukiz'15 - Agrarian Polish Peasants' Party and anti-system Kukiz'15 run by rock musician Pawel Kukiz acting together. Konfederacja - block of far-right parties. (Reporting by Pawel Florkiewicz; Editing by Sherry Jacob-Phillips)", "description": "WARSAW, Oct 11 (Reuters) - Poland's ruling nationalist Law  and Justice (PiS) party has the highest support of any political  grouping ahead of Sunday's...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-11"}