{"pub": "arstechnica", "url": "https://arstechnica.com/cars/2019/09/gm-and-tesla-unlock-connected-car-features-to-help-with-hurricane-dorian", "downloaded_at": "2019-10-05 10:16:02.448503+00:00", "title": "GM and Tesla unlock connected car features to help with Hurricane Dorian", "language": "en", "text": "With Hurricane Dorian threatening the East Coast , some automakers are leveraging their networks of connected cars to help out. General Motors is offering its free OnStar Crisis Assist to owners in Dorian-threatened areas, and Tesla will provide free Supercharging and unlock the software-limited range of some of its cheaper models to help its owners flee the storm.\n\nAs is becoming tradition during hurricane season, GM says that its OnStar advisors can help route people away from danger or toward resources like shelter, food, and water; the service can even help with booking hotel rooms where feasible. OnStar-equipped vehicles will get free hands-free calling minutes and data for the cars' LTE hotspots, and the OnStar nerve center will help out with coordinating emergency rescue and evacuation services. All of these services should work on any Chevrolet, Buick, GMC, or Cadillac with OnStar hardware from model year 2006 onward.\n\nSimilarly, Tesla CEO Elon Musk told a Tesla Model 3 twitter account that his company would again help out with free Supercharging and extra range for some vehicles:\n\nYes — Elon Musk (@elonmusk) August 29, 2019\n\nFor 2017's Hurricane Irma and 2018's Hurricanes Florence and Michael, Tesla temporarily extended the range on Model S and Model X 60D vehicles in hurricane states. These vehicles have identical 75kWh lithium-ion battery packs to the more expensive 75D models, but they are software-locked to just 60kWh. We believe that for Hurricane Dorian, this offer also extends to anyone in the affected area with a standard-range Model 3, which similarly has its battery locked to provide 220 miles (354km) of range instead of the 240 miles (386km) of the SR+ Model 3.", "description": "OnStar's Crisis Assist is free, and Tesla is unlocking extra range on some cars.", "authors": ["Jonathan M. Gitlin"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/09/testla-onstar-dorian-760x380.jpg", "published_at": "2019-09-03"}