{"pub": "fox", "title": "Sports Illustrated model Kate Bock has head stapled after rafting accident", "url": "https://foxnews.com/entertainment/kate-bock-hospitalized-kevin-love-head-staples", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:11:53.804579+00:00", "text": "Sports Illustrated model Kate Bock is recovering from having her head stapled after a rafting accident in Wyoming.\n\nThe 26-year-old and her boyfriend, NBA star Kevin Love, were white-water rafting without helmets when they went overboard and Bock cut her head on some rocks.\n\nBock was taken to a nearby hospital and needed staples in her head to stop the bleeding.\n\nSPORTS ILLUSTRATED MODEL KATE BOCK TALKS INSECURITIES: 'YOU CAN ALWAYS SEE IN ANOTHER GIRL SOMETHING THAT YOU WISH YOU HAD'\n\n“Can’t take her anywhere — @katebock got her head stapled shut after a nasty (but epic) spill,” Love wrote on Instagram along with a series of photos. “‘Only head injury we’ve seen in 34 years.’ FYI we laughed the entire thing off and will be going back.”\n\n\"To say yesterday was eventful is an understatement,\" Boch wrote on social media.\n\nBut luckily the medical emergency didn't ruin the couple's romantic ranch getaway.\n\nBock, who grew up in West Vancouver, previously spoke to Fox News about her modeling career.\n\n“Even sometimes now, when my good friends look at a picture they’re like, ‘I can’t picture you doing that. It looks good and you look great, but not like the person that I know or grew up with,’” she said in 2017. “You just kind of slowly, but surely get more comfortable. By now it’s just second nature, but I did not grow up wearing bikinis and practicing any of these poses.”\n\nSPORTS ILLUSTRATED SWIMSUIT MODEL CAMILLE KOSTEK GETS CANDID ON DATING ROB GRONKOWSKI: ‘IT JUST FEELS GOOD’\n\nShe also revealed she's not afraid to get silly or do something dangerous in order to get the best shot.\n\n“I’ve just gotten way more comfortable with just, like, humiliating myself,” Bock said. “Do whatever it takes… dance in crazy situations, or jump, and twist, or roll around. And you really feel like you look like an idiot, but there’s some moment in there that’s captured, and it works.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“Also, like, posing on cliffs,” she added. “You’re like, ‘If I take one step backwards, I probably will die. But let’s do it!’”\n\nFox News' Stephanie Nolasco contributed to this report.", "description": "Sports Illustrated model Kate Bock is recovering from having her head stapled after a rafting accident in Wyoming.", "authors": ["Jessica Napoli"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/kate-bock-spilt.jpg"}