{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/mum-daughter-smoke-weed-before-20557494", "downloaded_at": "2019-10-11 08:15:26.246151+00:00", "title": "Mum let her daughter smoke weed before her English GCSEs 'to help imagination'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA mum says she let her daughter smoke marijuana before her GCSEs - because it 'helps her imagination'.\n\nIn an online post, the mum explained her teen would smoke a \"tiny bit of weed\" before school as it helped her relax, the Stoke on Trent Live reports.\n\nShe also claims her daughter told her it gives her more \"imagination for her essays.\"\n\nWhile some criticised the Stoke-on-Trent mum and accused her of being a 'bad mother', others commenting on the Facebook post defended her stance of letting her children make their own choices in life.\n\n(Image: Getty Images/EyeEm)\n\nIn the post, the unnamed mum wrote: \"When I asked her why she was doing it right before her English Language exam, she said 'it gives me more imagination when I’m writing essays I have to make up'.\n\n\"My daughter chose to smoke it. She doesn’t touch it anymore. She just used it as a relaxant to get her through her GSCEs and she did really well with her results.\n\n\"It’s up to her to learn from her own choices in life. If I’d have banned her from smoking it every now and then, she would have only done it behind my back as every teenager would do.\n\n\"I’ve always had a be open and honest approach with my daughter and it’s worked well.\n\n(Image: Getty Images/iStockphoto)\n\n\"She hides no secrets from me and her friends, male and female see me as a surrogate mum and talk to me about their issues and problems. I can’t see that as bad parenting.\n\n\"On the plus side my daughter smoking a tiny amount of weed every now and again, also means that the chances of her getting cancer have probably halved already.\n\n\"Doing drugs is a no-no but taking a couple of drags of weed when weed itself isn’t chemically manufactured, and is a plant, is not particularly a big deal.\n\n\"Weed is a cure for cancer and helps with various other ailments such as arthritis , dementia, Parkinson’s disease, MS, and lots of others.\"\n\nSome parents were gob-smacked by her laid back approach to her daughter using illegal drugs.\n\nOne woman replied: \"So you found it OK for your child to smoke drugs when taking there GCSEs. WOW!!! Shame on you. You're supposed to be the parent.\"\n\nAnd another added: \"You have the right to bring your child or children up how you see fit. But to let them think it's OK to do drugs, sorry, but for me as a mum-of-three that's a big no-no.\n\n\"I'm very strict with my kids and they would never ever keep anything from me. Why? Because they know I will find out and when I do then there is consequence and they lose everything.\"\n\nOthes praised the woman's approach to bringing up her children though.\n\nOne mum said: \"This woman is right, if you ban and hide things from kids, they will find a way to do it regardless. \"I was allowed to do whatever I wanted to as a kid to some respect, now I don't touch any alcohol or drugs.\n\n\"I've tried weed and alcohol, neither of which I have ever experienced a need to have.\"\n\nAnd another StokeonTrentLive reader said: \"Go you!!! I think you sound like a great mum. My mum was just like you and we have a great relationship.", "description": "The mother admitted she lets her teen smoke marijuana as it helps her relax", "authors": ["Hayley Parker", "Image", "Getty Images Eyeem", "Getty Images Istockphoto"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20557641.ece/ALTERNATES/s1200/0_Close-Up-Of-Woman-Smoking-Weed.jpg", "published_at": "2019-10-11"}