{"pub": "fox", "url": "https://foxnews.com/lifestyle/instagram-model-jem-wolfie-body-shaming-exhausting", "downloaded_at": "2019-09-14 11:18:13.195358+00:00", "title": "Instagram model says body-shaming is an 'everyday' thing: 'It can be exhausting'", "language": "en", "text": "Jem Wolfie has millions of followers on social media — but not all of them are always so nice.\n\nThe Australian Instagrammer, whose account consists of selfies, modeling shots, fitness inspiration and healthy-eating tips, recently admitted to LADbible that the worst part of her job is “waking up every day and seeing comments and messages that are really horrible.”\n\nSEE IT: WOMAN FALLS OFF BALCONY WHILE PRACTICING 'EXTREME' YOGA\n\nWolfie, 28, worked as a chef and played basketball (with the Western Australian Basketball League) before taking her talents online, posting photos of the health-food items she was aiming to sell as part of her first business venture. Fitness videos soon followed — and then hordes of followers began to follow.\n\nHer Instagram popularity, as well as her ebooks, her pay-per-month fan account and her merchandise line, have allowed Wolfie to put her old business pursuits behind her and focus on her followers, according to an interview she gave to Perth Now earlier this year. However, there are always some followers she’d prefer not to focus on — particularly the ones who criticize her profession, or call her “fat.”\n\n“It can be exhausting to have negativity constantly shoved down your throat every day,” she told LADbible.\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\nFortunately, Wolfie said only a small portion of her 2.7-million following insists on shaming her over the lifestyle she leads.\n\n\"Why would someone get mad about what I do for a living?” she told LADbible. “The only reason why someone would get mad at what I do for a living is 'cause their butt hurts 'cause they sit in an office all day,” she said.\n\nThe social media starlet reiterated her love for her current job in a post shared last week.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“The best decision I ever made was to really run with this and make this a reality,” she wrote in a post detailing her former role as a chef and her transition to a content creator.\n\n“Making content gives me butterflies and I always get so excited when it’s time to post. I’m so in love with my job.”", "description": "Jem Wolfie has millions of followers on social media — but not all of them are always so nice.", "authors": ["Michael Bartiromo"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/ShockWomanPhone1istock.jpg", "published_at": "2019-09-11"}