{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/steelers/2019/10/21/anthony-chickillo-steelers-arrested-assault-harassment-charges-casino-girlfriend/4051325002", "downloaded_at": "2019-10-21 14:58:10.881810+00:00", "title": "Steelers' Anthony Chickillo arrested on misdemeanor assault, mischief charges after 'domestic situation'", "language": "en", "text": "CLOSE SportsPulse: Drama surrounded Dallas this week but after demolishing the Eagles on Sunday night it's clear they're still the class of the division. That and more in Trysta Krick's Week 7 overreactions. USA TODAY\n\nPittsburgh Steelers linebacker Anthony Chickillo is facing multiple misdemeanor charges after police responded to a call early Sunday.\n\nPennsylvania State Police Trooper Robert Broadwater told USA TODAY Sports that police responded to a \"domestic situation\" with Chickillo and his girlfriend at Nemacolin Woodlands Resort in Farmington and that police placed Chickillo under arrest.\n\nChickillo, 26, is now facing one misdemeanor count of simple assault and one misdemeanor criminal mischief charge, according to court records. He's also facing a harassment charge.\n\nChickillo posted a $10,000 unsecured bond and was released, according to court records. His preliminary hearing is scheduled for Oct. 30. Broadwater added that Chickillo's girlfriend, 25-year-old Alysha Newman, was cited for harassment.\n\nSteelers spokesman Burt Lauten said the team is aware of the incident and is still gathering information.\n\n32 THINGS WE LEARNED: Lots of title-caliber teams in DC ... but not Redskins\n\nWEEK 7 WINNERS, LOSERS: Rodgers now in MVP race; Trubisky looks lost\n\nPittsburgh Steelers linebacker Anthony Chickillo (56) reacts during the fourth quarter against the Los Angeles Chargers at Dignity Health Sports Park. (Photo: Jake Roth, USA TODAY Sports)\n\nChickillo primarily plays on special teams and has one tackle and a half-sack this season. The 2015 sixth-rounder out of the University of Miami has spent his entire pro career with Pittsburgh.\n\nOn a bye this week, Steelers players were given the weekend off. They play the winless Miami Dolphins on Sunday.\n\nContributing: Associated Press", "description": "Steelers LB Anthony Chickillo was arrested early Sunday and charged with misdemeanor simple assault and criminal mischief after 'domestic situation.'", "authors": ["Chris Bumbaca", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/21/USAT/309e41bf-b2a8-4fd0-b3bf-56413a7cde6b-Anthony_Chickillo.JPG?crop=1279,719,x292,y894&width=3200&height=1680&fit=bounds", "published_at": "2019-10-21"}