{"pub": "indiatimes", "url": "https://indiatimes.com/technology/news/man-vs-machine-google-s-deepmind-ai-deciphers-missing-ancient-greek-texts-better-than-humans-378184.html", "downloaded_at": "2019-10-20 08:21:14.810661+00:00", "title": "Man Vs Machine: Google's DeepMind AI Deciphers Missing Ancient Greek Texts Better Than Humans", "language": "en", "text": "Researchers at the Faculty of Classics at the University of Oxford took help of Google's DeepMind neural network to decipher ancient missing Greek text with never-before-seen accuracy.\n\nAFP/Reuters\n\nThis deciphering was conducted on texts found on varied surfaces like stone, ceramic and metal. These surfaces were between 1500 and 2500 years old.\n\nThe AI that was responsible for this is called Pythia and it learned to decipher patterns in 35,000 relics, including more than 3 million words.\n\nIt recognises patterns through words, grammar, punctuation as well as the layout of the inscriptions.\n\nAll core characters, along with numbers, accentuations, punctuation marks, and spaces, are standardized into the Ancient Greek alphabet. The researchers brought in two new characters: a hyphen (-) to show a missing character and a question mark (?) to show that a character needs to be suggested.\n\nDon't Miss 319 SHARES 187 SHARES 212 SHARES 1.4 K SHARES\n\nPythia was given an inscription with some missing information. Pythia tried to fill in the blanks with 20 different contextually-appropriate suggestions. This way a researcher could pick the appropriate word based on his/her judgement and knowledge on the subject.\n\nIn order to test Pythia, the team hid nine letters of a Greek personal name. It successfully managed to full the missing spaces.\n\nWhen tested against humans to fill in the gaps between 2949 damaged inscriptions, humans made 30 percent more mistake than Pythia. However, what's surprising is that while the experts took two hours to solve 50 inscriptions, Pythia gave the suggestions for the entire batch in a matter of seconds\n\nRepresentative Image: Reuters\n\nDeepMind researcher Yannis Assael said in a statement, \"It's all about how we can help the experts,\"\n\nPythia works with all kinds of ancient texts including philology, papyrology, and codicology. It can work with any kind of language, be it ancient or modern. If you're interested in using Pythia for your research, you can make the most of it is open-source and available at GitHub.", "description": "Researchers at the Faculty of Classics at the University of Oxford took help of Google's DeepMind neural network to decipher ancient missing Greek text with never-before-seen accuracy. This deciphering was conducted on texts found on varied surfaces like stone, ceramic and metal. These surfaces were between 1500 and 2500 years old.", "authors": ["Monit Khanna"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/google_1571553183_800x420.jpg", "published_at": "2019-10-20"}