{"pub": "cbs", "url": "https://cbsnews.com/news/hurricane-dorian-what-homeowners-should-know-about-dealing-with-hurricane-damage", "downloaded_at": "2019-09-03 23:39:32.333219+00:00", "title": "What homeowners should know about dealing with hurricane damage", "language": "en", "published_at": "2019-09-03", "text": "With the National Hurricane Center warning that Dorian could inflict destructive storm surges and dangerous winds along the coasts of Florida, Georgia and the Carolinas, billions of dollars in damage could be caused to homes and other property in its path.\n\nInsurance industry experts say there are a number of things homeowners need to consider when the time comes to assess the material damage in the wake of a major hurricane.\n\nMy home was damaged — what do I do first?\n\nWhen it's safe to do so, make any temporary repairs to prevent further damage to your home or property. That could be something as simple as putting a tarp over a hole in the roof or plywood over a broken window.\n\nIt's important to document as much as possible to ease your claim process, so take photos or videos of damage and save all receipts for supplies purchased for repairs.\n\nTry to get the claims process started as quickly as possible by contacting your insurance company, although many insurers will reach out to affected policyholders directly. Most major insurers send disaster teams to the affected area to start the process in person, but claims can also begin on the phone or online.\n\nWhat is covered by my insurance policy?\n\nA storm of Hurricane Dorian's magnitude may necessitate making claims through multiple insurance policies.\n\nThe exact limits of your coverage depend on your policy but they follow a general framework: Property damage from wind is covered under standard homeowners, renters and business insurance policies, according to the Insurance Information Institute.\n\nBut flood damage isn't covered through a standard homeowners' policy. That is traditionally separate coverage purchased through the federal government's National Flood Insurance Program, although some homeowners may have purchased flood coverage through private insurers.\n\nSome Florida coastal residents refuse to leave homes ahead of Hurricane Dorian\n\nRenters' policies cover only the renters' possessions; the landlord insures the building's structure.\n\nDamage to a personal vehicle from winds and flooding is covered under an auto insurance policy's optional comprehensive coverage, according to the Insurance Information Institute. The industry group said that nearly 80% of U.S. drivers choose to purchase comprehensive coverage.\n\nAsk your insurance agent or claims representative for details on your coverage and limits.\n\nWhat other expenses are covered?\n\nAgain, the limitations depend on your policy but many homeowners' policies typically help cover costs beyond just damage to a structure or belongings. Ask your insurance representative about help paying for the costs of evacuation, temporary housing if your home is uninhabitable or damage to a structure caused by fallen trees or flying debris.\n\nDevastating images show Dorian ravaging the Bahamas\n\nAdditionally, if you are worried about lost wages because of missed days at work, talk to your employer. Many businesses have insurance policies that include a provision called \"ordinary payroll\" that allows them to pay employees for a set number of days when they are forced to miss work due to mandatory evacuation.\n\nCan I get help from FEMA?\n\nThe Federal Emergency Management Agency provides various forms of financial assistance after a disaster but it must be declared a federal disaster first.\n\nTo find out if you qualify for individual assistance, visit https://www.disasterassistance.gov and enter your address. The site can also point you toward FEMA Disaster Recovery Centers, which are mobile offices set up after a disaster to help those in the area, and other resources.\n\nHow to avoid getting scammed\n\nBe wary of sales representatives or contractors going door-to-door soliciting business. If you have any questions about their legitimacy, contact your local Better Business Bureau or check out their reputation through online clearinghouses such as Angie's List or Yelp. Also:", "description": "After the storm hits, property owners can get back on their feet more quickly by following some basic tips", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/03/fcd1dcd0-0455-4144-a9d3-55bb5a70b9b7/thumbnail/1200x630/a783f75fc3233c28b28d59479481217b/gettyimages-1062918764.jpg"}