{"pub": "cbc", "url": "https://cbc.ca/news/politics/trudeau-warning-conservative-cuts-1.5320944", "downloaded_at": "2019-10-15 16:22:51.782996+00:00", "title": "Trudeau digs for NDP, Green votes, issues dire warning about 'Conservative cuts' | CBC News", "language": "en", "text": "Liberal Leader Justin Trudeau aimed a pitch at NDP and Green voters today, warning darkly that a Conservative government would mean deep spending cuts, a lack of action on climate change and weak support for abortion services — and arguing that voting Liberal is the only way to prevent it.\n\n\"In terms of the NDP and the Greens, remember this: If you want progressive action, you need a progressive government, not a progressive opposition,\" Trudeau said during a campaign stop in Fredericton.\n\n\"Voting Liberal is the only way to stop Conservative cuts. Liberals know that the way to grow the economy is by investing in people and we have the record to prove it.\"\n\nQuestioned by journalists after his statement, Trudeau was asked bluntly if the current Liberal strategy is to drive votes away from the NDP and Greens by whipping up fear among Canadians.\n\n\"We have been very positive in the approach that we take and we will remain so,\" he said. \"I'm looking for a strong mandate to continue to invest in Canadians and I will be sharp in the policy differences between us and the Conservatives.\"\n\nA warning about the consequences of voting New Democrat or Green has emerged as a keynote theme of Trudeau's recent public statements, as the Liberals and Conservatives have lapsed into a polling deadlock. Over the weekend, Trudeau argued that the government of Stephen Harper cut spending on culture and veterans and retreated from action on climate change because the NDP and Bloc Québécois were strong at the time.\n\nToday, Trudeau claimed that electing a Conservative government would return Canada to a time when wages were flat, job creation was stalled and \"ambition was nowhere to be found.\"\n\nAsked about an abortion clinic in Fredericton that's under threat of closure due to a lack of funding, Trudeau said if he's re-elected he would meet with New Brunswick's Progressive Conservative Premier Blaine Higgs to discuss the province's obligation to fund abortion clinics. He said he would use all the tools at the government's disposal under the Canada Health Act.\n\n\"A Liberal government, a Liberal prime minister, will always stand up to provinces who want to limit women's rights to choose, something that the Conservatives, particularly under Andrew Scheer, will not do,\" he said.\n\nTrudeau also said he is best positioned to push back against Conservative premiers such as Alberta's Jason Kenney and Ontario's Doug Ford, \"who don't want to act on climate change.\"\n\nDuring a campaign event in Toronto, NDP Leader Jagmeet Singh insisted the choice for Canadians is not just between the Liberals and the Conservatives.\n\n\"You are not stuck with two choices. No one owns your vote. You are free to choose what you want. Don't vote out of fear, vote for hope,\" he said.", "description": "Liberal Leader Justin Trudeau aimed a pitch at NDP and Green voters today, warning darkly that a Conservative government would mean deep spending cuts, a lack of action on climate change and weak support for abortion services — and arguing that voting Liberal is the only way to prevent it.", "authors": [], "top_image": "https://i.cbc.ca/1.5321177.1571152017!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/fedelxn-liberals-20191015-topix.jpg", "published_at": "2019-10-15"}