{"pub": "businessinsider", "url": "https://businessinsider.com/emmys-2019-gwendoline-christie-dress-lion-detail-nod-to-jaime-2019-9", "downloaded_at": "2019-09-23 04:28:27.118775+00:00", "title": "'Game of Thrones' fans think Gwendoline Christie's Emmys dress had a subtle nod to Brienne and Jaime's love story", "language": "en", "text": "At the 2019 Emmy Awards, Gwendoline Christie may have paid tribute to her character's slow-burning, fan-favorite love story on \"Game of Thrones.\"\n\nChristie, who played Ser Brienne of Tarth on the HBO show, is one of four \"Thrones\" stars nominated for outstanding supporting actress in a drama series. She arrived at LA's Microsoft Theater on Sunday wearing a gold-and-red gown with subtle lion details.\n\nFans were immediately reminded of Jaime Lannister, Brienne's longtime love interest on the show, whose house sigil is a golden lion on a red background.\n\nRead more: A guide to the major houses on 'Game of Thrones,' including a final tally of who's still alive and who's dead\n\nThe gown was designed by Gucci. Frazer Harrison/Getty Images\n\nThe front of the gown also appears to feature the face of a man with a lion on his head, as well as multiple lion heads dotting the sleeves.\n\nA detail shot of Christie's Emmys gown. Frazer Harrison/Getty Images\n\nDespite the show's controversial final season, Brienne's love affair with Jaime remains a highlight for many fans.\n\nSince their fateful meeting on season two, fans had long suspected that Jaime and Brienne had romantic feelings for each other. And then on season eight, episode four, \"The Last of the Starks,\" they finally slept together.\n\nUltimately, Jaime left Brienne to reunite with his twin and lover, Cersei. But the ill-fated couple shared a number of tender moments on the eighth season, including Jaime knighting Brienne on episode two and Brienne memorializing Jaime's heroism on the finale.\n\nRead more: 'Game of Thrones' composer Ramin Djawadi confirms fan theory about Brienne, Jaime, and the 'wedding' music heard on the series finale\n\nNaturally, fans of the \"Braime\" relationship were thrilled that Christie's Emmys look included nods to House Lannister — with some even calling it \"what should've been Brienne's wedding gown when she married Jaime.\"\n\nSome fans even believe the golden lions on her shoulders have sapphires in their mouths, which could be a reference to Brienne's home, Tarth — also known as the Sapphire Isle.\n\n\"I really have fallen in love with the character Brienne of Tarth,\" Christie said on the red carpet. \"I've fallen in love with what she represents, a woman on the margins who fights hard to overcome the obstacle of the prejudice that is exacted toward her because of the way she looks. She has a strong moral compass and I just felt she was a special and rare type of character.\"\n\n\"For everything she represents in terms of women, I wanted for there to be the possibility of the opportunity and for me to feel like that's how I was honoring, saying goodbye to this character,\" she continued. \"I truly never, never thought it would result in a nomination, and the last two months of my life have been truly wonderful because it's a feeling of hope.\"\n\nChristie has yet to confirm fans' suspicions about the gown, so it's possible that her regal look could have been inspired by renaissance fashion or even religous iconography.\n\nSome viewers even drew comparisons between Christie's gown and Jesus Christ himself.", "description": "The \"Game of Thrones\" star, who played Ser Brienne of Tarth, was nominated for outstanding supporting actress in a drama series at the 2019 Emmys.", "authors": ["Callie Ahlgrim"], "top_image": "https://amp.businessinsider.com/images/5d883433f4fc2478020839a7-1136-568.jpg", "published_at": "2019-09-22"}