{"pub": "independent", "url": "https://independent.co.uk/voices/brexit-david-cameron-michael-gove-boris-johnson-sarah-vine-notting-hill-a9109911.html", "downloaded_at": "2019-09-18 10:38:03.367500+00:00", "title": "Thanks to David Cameron and Michael Gove, Brexit has become a posh family psychodrama", "language": "en", "text": "There have always been rivalries and enmities in politics. Everywhere and always. To recycle the old saying of David Lloyd George, who was no stranger to internecine feuds, there is \"no friendship at the top\" of politics. Or, as the Labour politician Ernie Bevin remarked when someone said his fellow cabinet minister Herbert Morrison was “his own worst enemy”: “not while I’m alive he ain’t”.\n\nStill, nothing quite compares in its wider macroeconomic impact to the Tory psychodrama soap opera that goes under the working title “Brexit”.\n\nFrankly – and I’d hope to speak for the many – I couldn’t give a fig if the Camerons fell out with the Goves, and they both fell out with the Johnsons, and the Johnsons got divorced, and then one Johnson brother fell out tearfully with the other, and their sister was also upset about everything. Or whatever it is. It’s about as relevant and vital to me as Emmerdale, although the acting in the Yorkshire village is rather more believable than the one in Westminster.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSo the fact that the David Cameron was once best friends with Michael Gove, the two men's families intertwined but now forced apart, leaves me cold. If Samantha Cameron feels as betrayed as her husband at Sarah Vine's perfidy, so what ? If David can no longer trust George Osborne, who cares? A small earthquake in Notting Hill: few injuries, and no one died.\n\nExcept, as I say, that the dynastic nepotistic dynamics are damaging the lives of families far less able to withstand the impact of Brexit.\n\nShape Created with Sketch. Dave Brown on David Cameron Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Dave Brown on David Cameron 1/11 4 March 2016 Boris Johnson campaigns for Brexit 2/11 20 January 2016 Cameron's response to Tata Steel job cuts 3/11 5 January 2016 Cameron's reaction to Saudi Arabia executions 4/11 3 December 2015 Cameron called the opponents of military action in Syria \"terrorist sympathisers\" 5/11 2 December 2015 Cameron and the Syria bombing vote 6/11 19 November 2015 Cameron moves toward a second vote on bombing Syria 7/11 21 October 2015 Xi Jinping is lauded at a state banquet as British steelworkers lose their jobs, largely as a result of cheap Chinese steel imports 8/11 8 October 2015 Tory conference responds to Cameron’s keynote speech 9/11 6 October 2014 Clegg attempts to distance himself from Cameron 10/11 27 June 2014 Cameron and EU re-negotiation 11/11 1 December 2012 Cameron, Murdoch and the Leveson Report 1/11 4 March 2016 Boris Johnson campaigns for Brexit 2/11 20 January 2016 Cameron's response to Tata Steel job cuts 3/11 5 January 2016 Cameron's reaction to Saudi Arabia executions 4/11 3 December 2015 Cameron called the opponents of military action in Syria \"terrorist sympathisers\" 5/11 2 December 2015 Cameron and the Syria bombing vote 6/11 19 November 2015 Cameron moves toward a second vote on bombing Syria 7/11 21 October 2015 Xi Jinping is lauded at a state banquet as British steelworkers lose their jobs, largely as a result of cheap Chinese steel imports 8/11 8 October 2015 Tory conference responds to Cameron’s keynote speech 9/11 6 October 2014 Clegg attempts to distance himself from Cameron 10/11 27 June 2014 Cameron and EU re-negotiation 11/11 1 December 2012 Cameron, Murdoch and the Leveson Report\n\nWe are being asked to find some shreds of sympathy for these people who brought their divisions and hatred upon themselves and, more to the point, rain it down on the rest of us too.\n\nEven now, David Cameron is touring the TV studios to tell us all how regretful he is – though he still thinks it’s not his fault. Sarah Vine (also known as the wife of Michael Gove) has got the dirty washing out all over again. Forgive me if I find it all a bit remote.\n\nOne of the things that Theresa May found most distasteful about the so-called \"Notting Hill set\" was that its members viewed politics as a game, in which the national interest was always being discarded in favour of some scam to trick the opposition, and where personal rivalries were allowed to drive policy choices. We know now, and fairly conclusively, how right she was to distrust them. (She was not their type.)\n\nIt seems, above all, pretty clear that Boris Johnson only decided to join the Leave campaign in 2016 because he calculated that it would lose but that he would emerge as the darling of the Conservative party. As Cameron says, he never previously argued in favour of, nor believed philosophically, in Brexit. Similarly, Gove was only as energetic and prominent in the Leave campaign because his old friend David had demoted him from education secretary to chief whip and \"failed to acknowledge\" his leadership ambitions – slays referring to Osborne as his chosen obvious successor.\n\nThe great irony is that, had Cameron and Osborne gone in harder on Johnson and Gove's ridiculous claims in the referendum, Leave might not have gotten away with it. They might all still be running the Notting Hill chum-ocracy and gossiping at each other’s dinner parties about the hopelessness of Theresa May. Instead, Cameron refused to engage in “blue on blue” combat and the nation was much the poorer for it – as well as leaving the old gang split asunder and all of them feeling a bit bereft.\n\nWhat a pity we've all been given parts as extras in their private psychodrama.", "description": "There have always been rivalries and enmities in politics. Everywhere and always. To recycle the old saying of David Lloyd George, who was no stranger to internecine feuds, there is \"no friendship at the top\" of politics. Or, as the Labour politician Ernie Bevin remarked when someone said his fellow cabinet minister Herbert Morrison was “his own worst enemy”: “not while I’m", "authors": ["Sean O'Grady"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/06/23/11/referendum-10.jpg", "published_at": "2019-09-18"}