{"pub": "investing.com", "url": "https://ng.investing.com/news/commodities-news/update-1oil-climbs-but-still-set-for-big-weekly-loss-over-demand-worries-61471", "downloaded_at": "2019-10-04 09:18:47.137792+00:00", "title": "UPDATE 3-Oil edge up but still set for big weekly loss on demand worries", "language": "en", "text": "© Reuters. UPDATE 3-Oil edge up but still set for big weekly loss on demand worries\n\n* Brent down 6.2% for the week, U.S. crude 5.6% lower\n\n* Weak data, demand concerns drive prices lower this week\n\n* Supply concerns fade as Saudi fully restore output\n\n\n\n(Updates prices, adds comments, graphic)\n\nBy Bozorgmehr Sharafedin\n\nSINGAPORE, Oct 4 (Reuters) - Oil prices rose on Friday but\n\nwere still on track for a second consecutive weekly loss after\n\nsliding on fears that slower global economic growth would hurt\n\nenergy demand.\n\nBenchmark Brent crude rose 36 cents, or 0.6%, to\n\n$58.07 a barrel by 0839 GMT, while U.S. West Texas Intermediate\n\n(WTI) crude futures rose 30 cents, or 0.6%, to $52.75.\n\nBut Brent was down 6.2% on the week while U.S. crude was\n\n5.6%, lower, on the biggest weekly losses since July.\n\n\"Both are on track for hefty weekly losses and it will take\n\na brave man to bet against the bearish tide,\" Stephen Brennock\n\nof oil broker PVM said.\n\n\"As thing stand, demand and supply-side developments are\n\nanything but supportive and there can be no happy ending for\n\nthose of a bullish disposition,\" he added.\n\nWeak U.S. services sector and jobs growth data on Thursday\n\nadded to worries about global oil demand and exacerbated fears\n\nthat a protracted U.S.-China trade war could push the global\n\neconomy into a recession.\n\nInvestors are awaiting U.S. non-farm payrolls data due out\n\non Friday to determine the next move.\n\n\"Given that U.S. growth is largely supported by a buoyant\n\nconsumer whose confidence is built on a strong job market, this\n\nrelease will be critical in shaping expectations around future\n\nFed policy which will have spillover effects on oil markets,\"\n\nsaid Harry Tchilinguirian, global oil strategist at BNP Paribas.\n\nU.S. job growth likely picked up in September, with wages\n\nincreasing solidly, which could assuage financial market\n\nconcerns that the slowing economy was teetering on the brink of\n\na recession.\n\nSaudi Arabia's energy minister, Prince Abdulaziz bin Salman,\n\nsaid on Thursday the world's top crude oil exporter had fully\n\nrestored oil output after attacks on its facilities last month\n\nknocked out more than 5% of global oil supply.\n\n\"Low spare capacity, the risk of renewed attacks on oil\n\ninfrastructure in the Middle East, and likely larger oil\n\ninventory declines until the end of 2020 following the sharp\n\ndrop in Saudi oil output suggest to us that oil prices should\n\ntrade higher in the short term,\" UBS oil analyst Giovanni\n\nStaunovo said.\n\nFrance said Iran and the United States have one month to get\n\nto the negotiating table, suggesting that Tehran's plan to\n\nincrease its nuclear activities in November would spark renewed\n\ntension in the region. Major Oil Supply Diruptions png https://tmsnrt.rs/2nkroOv\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>\n\n", "description": "UPDATE 3-Oil edge up but still set for big weekly loss on demand worries", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC0R0GY_L.jpg", "published_at": "2019-10-04"}