{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-filmfestival-venice-climate-protests/climate-change-activists-storm-red-carpet-at-venice-film-festival-idUKKCN1VS0DL", "downloaded_at": "2019-09-07 13:49:09.762661+00:00", "title": "Climate change activists storm red carpet at Venice Film Festival", "language": "en", "text": "The 76th Venice Film Festival - Venice, Italy, September 7, 2019 - Climate activists are seen on a red carpet. REUTERS/Piroschka van de Wouw\n\nVENICE, Italy (Reuters) - Several hundred demonstrators took over the red carpet at the Venice Film Festival on Saturday, demanding action to fight climate change and a ban on cruise ships entering the lagoon city.\n\nWearing white boiler suits over their clothes, the roughly 300 protesters sat on the red carpet where Hollywood stars such as Brad Pitt, Scarlett Johansson and Joaquin Phoenix have premiered their latest films during the 11-day event.\n\nWaving banners that read ‘Our home is on fire’ and ‘No to cruise ships’, the protesters sat outside the main festival venue and chanted slogans, surrounded by police.\n\n“We want to address the topic of the climate crisis, we think that it is more important than anything that we can see in the world now,” said Chiara Buratti, a member of the Venice anti-cruise ship committee.\n\n“And we also ask (celebrities) to take a position. We are on the red carpet today, we will stay here (and) ask them to join us on the red carpet,” she said.\n\nSaturday is the last day of the festival, held on the Lido island, and the winner of the Golden Lion prize will be announced in the evening. Buratti said the demonstrators were also planning a march elsewhere on the Lido later in the day.\n\nThe protesters, who belong to Italian and foreign groups, were taking part in a five-day Venice Climate Camp event.\n\nVenice and its lagoon are on UNESCO’s list of World Heritage Sites and protests groups have long called for cruise ships to be banned there.\n\n“The climate crisis has no borders, why should we stop at some border and just care about some local problems that we have back home,” said demonstrator Sina Reisch from the German group Ende Gelande. “We must see that the struggles are connected.”", "description": "Several hundred demonstrators took over the red carpet at the Venice Film Festival on Saturday, demanding action to fight climate change and a ban on cruise ships entering the lagoon city.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190907&t=2&i=1427236723&w=1200&r=LYNXNPEF860GN", "published_at": "2019-09-07"}