{"pub": "politico", "title": "Congress prepares to delay tough decisions on spending with another temporary funding bill", "url": "https://politico.com/story/2019/08/26/congress-funding-bill-1681071", "language": "en", "published_at": "2019-08-26", "downloaded_at": "2019-09-02 07:11:59.147070+00:00", "text": "In a call with House Democrats on Friday, House Majority Leader Steny Hoyer said he thinks a so-called continuing resolution should extend funding through Nov. 22. | Win McNamee/Getty Images congress Congress prepares to delay tough decisions on spending with another temporary funding bill\n\nFive weeks out from the next shutdown deadline, House leaders are already preparing lawmakers for another short-term spending extension that keeps the government running until late November or early December.\n\nCongressional leaders are not expected to pick a firm date for that stopgap until just days — or even hours — away from the Sept. 30 fiscal cliff. But House Democrats are starting to set the realistic expectation of another pre-Christmas funding crunch.\n\nStory Continued Below\n\nIn a call with House Democrats on Friday, House Majority Leader Steny Hoyer said he thinks a so-called continuing resolution should extend funding through Nov. 22. Other top Democrats have predicted that temporary funding patch could go even longer, through Dec. 6, according to senior House aides.\n\n“The Senate is so far behind, we may actually need a short-term CR, which is very unfortunate,” House Appropriations Chairwoman Nita Lowey (D-N.Y.) said in an interview this month. \"I can’t make a judgment now because they haven’t made much progress.”\n\nWith the doors of the House and Senate locked for legislative business until Sept. 9, lawmakers are left with just 13 workdays before federal funding expires at the end of next month. In the Senate, spending leaders have yet to even introduce a single one of their 12 annual funding bills, let alone mark up or pass them on the floor.\n\n“They have to get moving,” Lowey said of her Senate counterparts. “And once they get going — move their bills — we’ll be able to sit down and talk about their differences.”\n\nReal funding negotiations have been on pause all summer, as House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin worked to strike a two-year budget deal setting new limits on that spending. While the bipartisan compromise is widely expected to prevent another government shutdown, it came too late for Congress to haggle over the specifics of funding for every department, agency and program of the federal government before the Oct. 1 start of the new fiscal year.\n\nThere is work to do in the House, too. Even though Democrats in that chamber marked up all of their fiscal 2020 spending measures this summer and passed 10 on the floor, they must now readjust funding levels heading into negotiations with the Senate, since the budget deal provided about $15 billion less than they had initially assumed for non-defense programs and about $5 billion more for the Pentagon.\n\n“One would rather not trim anything, but we know we will,” Rep. David Price (D-N.C.), who chairs the spending subcommittee that funds the departments of Transportation and Housing and Urban Development, said in an interview this month.\n\nSenate Appropriations Chairman Richard Shelby has set a goal of enacting the two largest spending bills before the Sept. 30 deadline, taking care of funding for the departments of Defense, Education, Labor, and Health and Human Services. The Alabama Republican has even floated the idea of coupling those two measures with the bill that funds the Department of Energy and water programs, arguing that there is a “nuclear nexus” between programs in the energy legislation and the defense bill.\n\nBut Shelby has also said his committee expects to start marking up its spending measures on Sept. 12 — timing that would leave just over two weeks for the divided Congress to reach bicameral compromise on the specifics of funding for the vast majority of the federal government.\n\nIt is still unclear whether Senate leaders will try to pass any of their dozen spending measures on the floor before entering into negotiations with their House counterparts on final bills that could get enough votes to move on for President Donald Trump’s signature.\n\nHeather Caygle contributed to this report.", "description": "Congressional leaders are not expected to pick a firm date for that stopgap until just days away from the Sept. 30 fiscal cliff.", "authors": ["Jennifer Scholtes"], "top_image": "https://static.politico.com/08/2b/bc983d6348c38e89e8b1eb674f77/190826-steny-hoyer-gty-773.jpg"}