{"pub": "cnbc", "url": "https://cnbc.com/2019/10/20/nfl-legend-terry-bradshaw-explains-losing-900000-on-real-estate.html", "downloaded_at": "2019-10-20 16:55:01.016371+00:00", "title": "NFL legend Terry Bradshaw once lost $900,000 in real estate—here's why he says it was his best financial move", "language": "en", "text": "As a longtime investor in real estate, Bradshaw recalls the time when he lost $900,000 at the start of the recession. \"I was heavily invested, about 13 million bucks to be exact,\" he explains. \"I came home one day, and I just didn't feel good. I was kind of sick to my stomach. I felt nervous about what was going on in the money markets, and I asked a friend to help me out.\"\n\nNow, as a retired athlete and sports analyst, the 71-year-old tells MarketWatch that he has picked up many different business ventures since leaving the field. Some of those ventures, he says, include investments in real estate, horses, cattle and planes.\n\nTerry Bradshaw is an NFL Hall of Famer and former star quarterback who is most known for leading the Pittsburgh Steelers to four Super Bowl wins between 1970 and 1983.\n\nHonoree Terry Bradshaw onstage at the Friars Club Roast of Terry Bradshaw during the ESPN Super Bowl Roast at the Arizona Biltmore on January 29, 2015 in Phoenix, Arizona.\n\nWithin three days, Bradshaw says he sold all of the properties he owned in Texas, Oklahoma and Mexico, which equaled about $900,000 lost. \"I got a call from Merrill Lynch telling me that's the smartest investment decision I had ever made because the recession was about to come,\" he says. \"I lost a lot, but it could have been a lot worse.\"\n\nAnd Bradshaw says he relies on experts to help him make tough decisions like that.\n\n\"Make sure the people you have are the most qualified people,\" he says. \"I'm smart enough to know that there are people a lot smarter in finance than I am.\"\n\nThough his investments and role as a sports analyst still bring in a lot of money, Bradshaw tells MarketWatch that he doesn't want to get \"rich rich rich.\"\n\n\"I want to be smart with my money, I'm conservative by nature,\" he says.\n\nSimilar to Bradshaw, several other current and former professional athletes have opened up about their conservative habits when it comes to money. On a 2018 episode of the \"Kneading Dough\" podcast, former NFL player Rob Gronkowski told host Maverick Carter that he's particularly frugal when it comes to spending money on clothes.\n\n\"My 'broke habit' is still my clothes and shoes,\" he says. \"If I like the clothing, if I like the shoes, I'll wear those shoes, and I'll wear that clothing down to the rags.\"\n\nThe retired tight end, who didn't spend a dime of his NFL money while in the league, told CNBC Make It earlier this year that as an NFL veteran, he also shared a lot of knowledge with his rookie teammates about smart money management.\n\n\"Financially, I just say: Keep it simple,\" he says he would tell them. \"Get what you need to live comfortably but don't go crazy with splurging until you feel comfortable in the league.\"\n\nLike this story? Subscribe to CNBC Make It on YouTube!\n\nDon't miss: Rob Gronkowski is retiring—here's the No. 1 piece of financial advice he gave his teammates", "description": "Terry Bradshaw is an NFL Hall of Famer, sports analyst and former quarterback who has picked up several different business ventures since leaving the field. In an interview with MarketWatch, he talks about his business moves, including the time when he lost $900,000 in real estate.", "authors": ["Courtney Connley"], "top_image": "https://image.cnbcfm.com/api/v1/image/106190103-1571414150827gettyimages-183122569.jpeg?v=1571414198", "published_at": "2019-10-20"}