{"pub": "yahoo", "url": "https://news.yahoo.com/buy-1-trillion-apple-aapl-231411257.html", "downloaded_at": "2019-09-13 07:36:35.021199+00:00", "title": "Buy $1 Trillion Apple (AAPL) Stock on iPhone 11 & Streaming TV Potential?", "language": "en", "text": "Apple AAPL is once again a $1 trillion company, joining Microsoft MSFT, with shares up 8% in the past month. The tech giant’s shares have also jumped over 5% this week as Wall Street seems pleased with Apple’s latest round of iPhones and its streaming TV plans.\n\niPhone Updates\n\nApple unveiled its newest iPhones at its now customary pre-holiday shopping season event on Tuesday, led by CEO Tim Cook and other top executives. The firm showed off three new iPhones, under the new 11 branding.\n\nThe smartphones feature Apple’s somewhat standard updates, which include better battery life and faster processors. What separates the two new higher-priced smartphones (iPhone 11 Pro & 11 Pro Max: starting at $999) from their less expensive peer (iPhone 11: starting at $699), is a triple-camera system. Apple also dropped the price of last year’s iPhone XR by 20% ($599), with the iPhone 8 starting at $449.\n\nConsumers might be more prone to buy the higher-end iPhone 11s because the price points roughly match last year’s new high-end models—after years of rising prices. Perhaps more importantly, the new iPhone 11 base model is actually $50 cheaper than last year’s comparable offering. Clearly, Apple wants to give consumers every reason possible to upgrade to new phones after a year of poor iPhone sales, especially since there is nothing earth-shattering about the new phones.\n\nApple TV+ & Services\n\nWall Street, investors, and Apple fans have waited for more details on Apple’s foray into the streaming TV world for months. They now have all they can hope for until they get to use the streaming service for the first time on November 1—Disney+ debuts on Nov. 12. Anyone who buys a new iPhone, iPad, Mac, or other qualifying devices will get a year worth of Apple TV+ for free. The service will otherwise cost $4.99 per month, after a seven-day free trial and be available on the Apple TV app.\n\nApple’s streaming TV offering is clearly priced to move, as it comes in well below HBO Go’s T $14.99 per month, Netflix’s NFLX $15.99 premium plan, Amazon AMZN Prime’s $12.99—which comes with shipping perks—and Disney+ at $6.99. Aside from trying not to force users into a decision between Apple+ or Netflix, the price-point represents how little content will be available at launch.\n\nApple TV+ will feature roughly 10 shows at launch, including a fictional space race-era show called For All Mankind, a show starring Jennifer Aniston, Reese Witherspoon, and Steve Carell titled The Morning Show, and post-apocalyptic drama See.\n\nApple will then slowly build up its library of shows, which is set to feature more A-list Hollywood stars both in front of and behind the camera. The iPhone maker is also likely viewing Apple TV+ as a kind of loss-leader for now, since it reportedly spent roughly $15 million an episode to make See.\n\nApple is making a long-term play to convert more of its roughly 1 billion hardware users into services customers. This business, which includes its app store, Spotify SPOT challenger Apple Music, a monthly magazine-heavy news service, and an Apple credit card, will also soon feature Apple Arcade. The company’s big push into the video game world will feature access to roughly 100 titles for $4.99 per month and launch on September 19. Apple hopes to grab a piece of the $68.5 billion global mobile game market.", "description": "Apple (AAPL) is once again a $1 trillion company, joining Microsoft (MSFT), with shares up 8% in the past month. So is now the time to buy Apple stock after it showed off its new iPhone 11s and its streaming TV service, Apple TV+?", "authors": ["Benjamin Rains"], "top_image": "https://s.yimg.com/uu/api/res/1.2/fjkoo.Wm_W57.7sdVvohpg--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/198e4657665063ae21a99b90e6766582", "published_at": "2019-09-12"}