{"pub": "cbc", "url": "https://cbc.ca/news/entertainment/battle-of-the-blades-is-back-and-there-are-going-to-be-bruises-1.5288635", "downloaded_at": "2019-09-19 23:09:57.497937+00:00", "title": "Battle of the Blades is back and there are going to be bruises | CBC News", "language": "en", "text": "Battle of the Blades is back and ready to entertain Canadian audiences with its strange hybrid of two of the country's best loved sports: hockey and figure skating.\n\nThe popular reality TV show makes its return to CBC-TV on Thursday night after a six-year hiatus, once again pairing hockey players with figure skaters to see who can perform the best on-ice routine.\n\nThis season the show airs live in front of an audience at rinks in Hamilton, Mississauga, Oshawa and Toronto as the pairs compete for a $100,000 donation to the charities of their choice.\n\nSince the duos are judged on their skills and grace, the hockey players have the biggest adjustment.\n\n\"It's always so much fun to see hockey players struggle,\" says Ekaterina Gordeeva, a 2-time Olympic gold medallist and past winner of Battle of the Blades. Her partner this time is former New York Islanders defenceman Bruno Gervais. (CBC)\n\nThe show's title is apt since hockey players have to battle with wearing figure skates, which includes the toe pick (a set of jagged teeth at the front of the blade) that can cause a skater to suddenly fall forward if they're not careful.\n\n\"The first day I got here about five minutes and then went down,\" said Bruno Gervais, who played defence for the New York Islanders.\n\n\"I got a black and blue elbow. I got a chipped tooth. I got a sprained wrist, black and blue knees. It's all part of it.\"\n\nHockey players and figure skaters from the new season of Battle of Blades reveal why they're ready to risk falling on the ice. 2:31\n\nThis year, two of the seven pairs feature female hockey players matched with male figure skaters: Amanda Kessel, who won a gold medal with Team USA at the last Winter Olympics, and her Team Canada rival Natalie Spooner.\n\n\"In hockey it doesn't matter what you look like just as long as you get the job done and you score some goals — you put the puck in the net, you can be as ugly a skater as you want,\" said Natalie Spooner, who won an Olympics Gold medal and the Clarkson Cup championship in 2014.\n\n\"Then you come to figure skating and it's really all about pointing your toes, your shoulders back, smiling.\"\n\nHockey player Natalie Spooner, one of Team Canada's top stars, is paired with Andrew Poje, who has represented Canada internationally for 13 years, winning several championships. (CBC)\n\nSpooner points out that she's bigger than most female figure skaters, an added challenge for her partner, ice dancing champion Andrew Poje who has to lift her in the air.\n\n\"I don't think little girls have probably seen a figure skater quite as big as me, so hopefully it shows them that they can do anything that they put their mind to and want to do.\"\n\nThis season of sees former NHL rivals Brian McGrattan and Colton Orr hit the ice in a whole new way. The 2 fought each other 10 times during their NHL careers. Now they compete to see who can be more graceful.\n\nThis season's cast of male hockey players includes former \"enforcers\" Colton Orr and Brian McGrattan, who fought each other 10 times during their NHL careers.\n\n\"I think most of the hockey guys would like to prove that we can do other things than what we've done on the ice,\" said McGratton, a towering six foot four inch former winger who played for several teams including the Calgary Flames. \"Show off our skills, our smooth skating abilities and grace.\"\n\nAnother \"tough guy,\" P.J. Stock, was brought in as a late replacement for Colby Armstrong, who sustained a hamstring injury during rehearsals. Armstrong will appear as a guest judge alongside other rotating guest judges, who include Canadian ice dancing champions Tessa Virtue and Scott Moir, and head judge Kurt Browning.\n\nStock is paired with Violetta Afanasieva, who was his Battle of the Blades partner on season two of the show.\n\nThe type of male hockey players who come on Battle of the Blades are the ones who are used to taking risks to be part of a team, according to Stock.\n\n\"Some of the other guys, they're a little concerned sometimes about the image that you could possibly get by falling on national television in figure skates,\" he said.\n\nFormer NHL player Sheldon Kennedy co-founded Respect Group, which works to prevent abuse, bullying and harassment. His goal on Battle of the Blades is to show people 'there is a way out ... there is hope.' (CBC)\n\nAnother of this year's competitors is Sheldon Kennedy, who has been a spokesperson for victims of child abuse, after his junior hockey coach was charged with sexual assault for the abuse he suffered as a teenager.\n\nHe said being out of his comfort zone by wearing figure skates instead of hockey skates doesn't faze him.\n\n\"Sadly, for a lot of time in my life I've been out of my comfort zone,\" he said.\n\nKennedy — who is paired with figure skater Kaitlyn Weaver — welcomes the opportunity that Battle of the Blades will bring him, and others.\n\n\"I spent a lot of years in that dark place, and we've done a lot of work around trying to prepare and set things up systematically to allow people to get out of that dark place and now we need to show it. And to me this is the reality: we can have fun, there is a way out and this is about hope.\n\n\"And that's what we're skating for: to show people that there's hope. And to smile again.\"\n\nBattle of the Blades premieres Thursday, September 19 at 8 p.m. (8:30 NT) on CBC and the free CBC Gem streaming service.", "description": "CBC's popular reality TV competition Battle of Blades is back after a six-year hiatus, pitting duos of hockey players and figure skaters against one another to show their graceful moves and raise money for their favourite charities.", "authors": ["Arts Producer", "Nigel Hunt Is A Longtime Cbc News Producer Covering The Arts Beat. Previously", "He Served As A Magazine Writer", "More This Author"], "top_image": "https://i.cbc.ca/1.5287051.1568744951!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/battle-of-the-blades-group-season-5.jpg", "published_at": "2019-09-19"}