{"pub": "yahoo", "url": "https://sports.yahoo.com/lot-points-pep-guardiola-bemoans-175618149.html", "downloaded_at": "2019-10-07 12:20:50.329737+00:00", "title": "'It is a lot of points' - Pep Guardiola bemoans bad day for 'nervous' Man City as they lose further ground to Liverpool", "language": "en", "text": "Manchester City's players were found wanting against victorious Wolves - AFP\n\nPep Guardiola claimed nerves got the better of Manchester City and admitted the champions have given themselves a mountain to climb in the title race after their worst start to a season for six years.\n\nCity suffered their second defeat in four Premier League matches with a 2-0 loss at home to Wolverhampton Wanderers and now trail Liverpool by eight points - the biggest lead any side has enjoyed after eight matches in the Premier League era.\n\nScroll to continue with content Ad\n\nCity overturned a seven point deficit to Liverpool to retain the title last season but the long-term loss of defender Aymeric Laporte is proving costly and they had not had as few shots on target (two) in a Premier League game since the goalless draw at Anfield a year ago. Guardiola admitted they will have their work cut out trying to haul back Liverpool.\n\n“It is a lot of points,” the City manager said. “They didn’t drop points for many circumstances. Today was the day we created less than the other games, even [in the 3-2 defeat against] Norwich we created a lot.\n\n“We have faced many teams who defend deep and more or less we found a way to win but today we had a problem. It is better not to think that one team is eight points ahead.\n\n“I know these guys. Still they are incredibly involved and can do it. What happened, happened. Most of the teams who won in the past, the year after, don’t win. Today we were not in our level. The previous games were good but the distance is big. I know that.\n\n“Liverpool are not dropping points but we are in October and there are still a lot of games and competitions to play.\n\n“It was a bad day, sometimes it happens. We started quite well and, after we conceded two situations in our build up where it’s impossible to defend, we got a little bit nervous.”\n\nStory continues\n\nAsked why his players were nervous, Guardiola said: “It sometimes happens. We spoke about this, ‘Come on guys, a lot of games to play, we did it and we’re going to do it again’.\n\n“We lost to a good team that were really well-organised, had good physicality, strong in the air and so fast on the counter-attack.”\n\nPep Guardiola admitted his players were nervous in defeat Credit: AP\n\nNicolas Otamendi was particularly poor alongside Fernandinho in a makeshift central defence but Guardiola refused to point the finger.\n\n“No,” he said when asked if it was a game too far for that pairing. “They were quite good. They suffered because we lost the position in front of them. No central defenders can sustain the kind of balls we lose in the first moments.”\n\nNuno Espirito Santo, the Wolves manager, paid tribute to his players’ commitment and application and was delighted to see Adama Traore score twice.\n\n“I’m very, very proud, it was a very good performance,” he said. “More than the performance, it was the way they ran. City move the ball so fast and it required a lot of running from our boys.\n\n“It’s not the same City as last season and you have to find solutions, the areas to exploit. The first thing is to stop them playing, how they create chances. My players ran like crazy.\n\n“Having a fantastic group of players who want to grow makes me proud. They believe and want to work. The challenge is to sustain this.\n\n“Adama played well. He went to the limits for us. It wasn’t only him, all of them did well.”", "description": "Pep Guardiola claimed nerves got the better of Manchester City and admitted the champions have given themselves a mountain to climb in the title race after their worst start to a season for six years.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/JMicMjJSBkoRMlBPGLrfgA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/FC3Qa19aQS2KrW5c.w2FuA--~B/aD0xNTYzO3c9MjUwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_818/38c039d7065af17efbf7bae1bf627772", "published_at": "2019-10-06"}