{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7586359/Husband-bought-wife-cute-micro-pig-says-salesman-told-porkies.html", "downloaded_at": "2019-10-18 01:22:19.503494+00:00", "title": "Husband who bought his wife a cute micro pig says the salesman told him porkies", "language": "en", "text": "Advertisement\n\nWe have all dealt with salesmen who have told a few porkies.\n\nBut spare a thought for Nigel and Sam Graham, who were sold a micro pig which has grown up to be a 28-stone beast.\n\nMr Graham bought the pet for his wife as a birthday present five years ago as she is allergic to cats and dogs.\n\nHe was told it would weigh no more than five stone as an adult.\n\nNigel Graham, 57, from Malvern, Worcestershire, with 28-stone Grace who Mr Graham bought as a micro pig for his wife Sam five years ago\n\nA pig's life: Mr Graham with Grace who is five feet long and stands waist-high to a human while getting through £20 of food a week\n\nYounger years: Grace as a piglet wearing a harness where Mr Graham was was told she would weigh no more than five stone as an adult\n\nA smaller Grace pictured wrapped in a towel. Mr Graham's wife Sam is allergic to cats and dogs hence the piglet pet\n\nBut the pig, called Grace, has now taken over the ground floor of their three-bedroom cottage. She is five feet long, stands waist-high to a human and gets through £20 of food a week.\n\nGrace has become used to the finer things in life, scoffing on rice pudding with jelly or tinned peaches and refusing to sleep outside in a sty the Grahams built for her.\n\nBut rather than grow frustrated Mr Graham, a father of two girls, says Grace has become like a ‘third daughter’ to them. The family have even stopped eating bacon.\n\nMr Graham, 57, said that when he went to the farm to buy Grace, he was shown her parents. ‘They were about knee-high, which is the size of a fully-grown micro pig,’ he added. ‘They were fed a couple of pig pellets a day, whereas Grace gets three big meals a day and treats.\n\n‘I think that’s contributed to her size, really. Plus she get loads of exercise as well. So she is sturdy and powerful.’ Grace has her own ‘pig flap’ so she can come and go as she pleases at the home in Malvern, Worcestershire, she shares with Mr and Mrs Graham, 48, and their younger daughter Xena, 29. She sleeps on an orthopaedic mattress in the living room and lounges on the family’s sofa when they watch TV.\n\nNigel, a property developer, said: ‘She will go outside but not if it’s raining or it’s windy. She’s got quite used to her creature comforts and likes to stay cosy – and she’s toilet trained so she’s really clean.\n\n‘She’s part of the family. She’s not like a pig. It’s no different than a dog or a cat, in fact she is cleaner than one of my daughters and shows me more love. Grace eats three full meals a day as well as pig pellets, fruit and left-overs from the family.\n\nGrace the pig enjoying the hot weather underneath the hammock in Malvern while Sam enjoys the sunshine with her pet by her side\n\nGrace has a custom-built pig pen with the plaque 'Graceland' which she has only used twice because she prefers to live in the house\n\nGrace the pig lying on her bed in the kitchen in front of the radiator which she prefers to living outside in her custom-made pen\n\nTrotters up: Grace relaxing on her bed in front of the radiator where she has an array of cushions and snoozes peacefully on her bed in the kitchen\n\n‘Bacon was my favourite meat but, since Grace has joined the family, we don’t eat it any more as it just wouldn’t feel right.\n\n‘It’s great when people come into our house, not knowing about Grace, as their reactions are priceless.’\n\nMr Graham says Grace is now fully grown – which comes as a relief to the family as micro pigs typically live up to 18 years.", "description": "Mr Graham, 57, from Malvern, Worcestershire, bought Grace, what he thought was a micro pig, for his wife Sam who is allergic to cats and dogs. Grace now weighs a whopping 28-stone.", "authors": ["Daily Mail Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/00/19863228-0-image-a-83_1571355676001.jpg", "published_at": "2019-10-17"}