{"pub": "cbc", "url": "https://cbc.ca/news/politics/canada-votes-2019-voting-disabilities-1.5289126", "downloaded_at": "2019-09-22 15:23:30.863341+00:00", "title": "What you need to know if you have a disability and want to vote | CBC News", "language": "en", "text": "If you're one of the six million or so Canadians who identify as having at least one disability, there are new tools and services available to help you vote.\n\nMany were developed with the input and experience of an advisory group struck in 2014 specifically to address some of the biggest obstacles people with different abilities face when they go to cast a ballot.\n\nSome of the tools and measures are being used in an election for the first time.\n\nHere's a guide to what's available:\n\nPolling stations\n\nWhether you use a wheelchair or a cane or other form of assistance to get around, you should be able to easily access your polling station. There are specific accessibility criteria laid out by Elections Canada — including some that are mandatory.\n\nFor example, if there are stairs, there needs to be a ramp that is wide enough to accommodate a wheelchair or scooter. Doors need to be easy to open. And the actual room where you vote needs to be on the same level as the entrance.\n\nJewelles Smith, who is part of the Advisory Group for Disability Issues (AGDI), which has been working with Elections Canada, said it goes beyond just being able to get in the polling station door.\n\nFor those in a wheelchair, access can mean \"not having things so high that you can't reach to make your mark,\" she said. Making sure your ballot doesn't slip while using the braille reader, or that the pencils are the right size are also important.\n\n\"The pencils were really terrible previously,\" Smith said. The first new batch wasn't much better either. \"So Elections Canada went back, got different pencils, and then we trialled them again.\"\n\nThe result? Better grip, making the ability to mark the ballot easier. It makes a difference, Smith said.\n\nBut it's not just about the tools. It also matters how polling station staff is trained, Smith said. \"Don't assume what somebody needs by looking at them. Ask 'what can I do to assist you to vote?'\"\n\nThe ballot\n\nThe ballot itself has changed since 2015 to accommodate larger text. It's also been optimized to be read by screen readers. And beginning this year, visually impaired Canadians can bring their own communication device or screen reader to use behind the voting screen.\n\nOne recommendation of the AGDI was to also put photos of each candidate beside their name. According to Elections Canada, doing so would require a change by Parliament to the Elections Act.\n\nWhat else is there for people who are visually impaired?\n\nWhether you are voting in advance or on election day, these tools and services are available:\n\nmagnifiers with light (4x)\n\na tactile and braille voting template\n\nlarge-print lists of candidates\n\nbraille lists of candidates (available on election day only)\n\nvoting screens that let in more light\n\nlarge pencils\n\nJohn Rae, who lives in Toronto and is blind, wants further choices — such as voting by phone or electronically. \"Any of these options would make it possible to vote independently and verify independently in secret.\"\n\nSmith said privacy and independence are also important to the AGDI and it continues to push Elections Canada in that direction.\n\nWhat if I use sign language?\n\nElections Canada will ensure there is someone who can translate to American Sign Language or Langue des signes québécoise available when you go to vote.\n\nThe voter information card that you receive in the mail has information on how to request the service ahead of election day.\n\nCan I bring someone to help me vote?\n\nYes. Elections Canada allows Canadians to bring someone to the polling station to help them mark their ballot. That can be your spouse, your friend, or your personal support worker. That person is even allowed to help another voter if the need arises.\n\nThe assistant needs to be at least 18 years old — but does not even need to be eligible to vote themselves. They simply need to make a solemn declaration that they will respect the secrecy of your vote.\n\nWhat if I can't get to the polling station?\n\nThere is always an option to vote by mail or go to any Elections Canada office before election day to cast a ballot.\n\nAnd if you live in a long-term care home or a hospital, you can likely vote there. Elections Canada has mobile voting stations, and they can even bring the ballot box from room to room if patients are confined to bed.\n\nBut for people who simply can't leave their private home to vote, like Susan Stenson of Red Deer, Alta., there is another, little-known option.\n\nShe asked Elections Canada to come to her. After several weeks of back and forth, and help from a local candidate, the agency agreed. They sent a returning officer to Stenson's home and she voted \"with no problem.\"\n\n\"There are so many potential voters who don't get to exercise their right because they don't even know they have the right.\"\n\n\"I didn't give up.\"\n\nThat's voting. What about a more accessible campaign?\n\nSmith said there have been a couple of significant changes made for 2019, again, on the recommendation of the AGDI.\n\nCandidates can spend as much as is necessary to make their local events or meetings fully accessible — including to provide sign language translation — and have the costs reimbursed.\n\n\"We also pushed so that more people with disabilities could actually run as candidates,\" Smith said. As a result, Elections Canada will also reimburse any extra costs associated with being a candidate with a disability.\n\nAnd debates?\n\nThe two official debates on Oct. 7 and 8 will have closed captioning, described video, and sign language translation — American Sign Language for the English debate, and Langue des signes québécoise for the French.\n\nBut Rae, who is also on the Canadian Council of Canadians for Disabilities, points to a persistent failing. \"We have never to my knowledge had a question about a disability issue asked during the debates.\" He's hopeful that, too, will change.\n\nThe Accessible Canada Act\n\nFinally, some of our readers have wondered whether this new law will affect elections. Short answer is — maybe.\n\nThe Accessible Canada Act was just passed in late June. Before any changes to elections are made because of it, a few things have to happen first.\n\nFirst, the Canadian Accessibility Standards Development Organization has to be created and the government has to pass regulations establishing standards in the areas covered by the Accessible Canada Act, including Elections Canada.\n\nOnce those regulations are law, Elections Canada says it will have one year to prepare a compliance report setting out whether it meets the standards set out in regulation. If it doesn't, it has to come up with a plan to achieve compliance.", "description": "One in five Canadians identifies as having a disability. There are tools and services — many new for 2019 — to help them vote.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5258715.1566610320!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/disability-vote-matters.jpg", "published_at": "2019-09-22"}