{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7601595/Ken-Loach-joins-Martin-Scorsese-Francis-Ford-Coppola-slating-superhero-movies.html", "downloaded_at": "2019-10-23 09:13:04.919676+00:00", "title": "Ken Loach joins Martin Scorsese and calls superhero films 'boring'", "language": "en", "text": "Ken Loach has joined Martin Scorsese and Francis Ford Coppola in bashing superhero movies as he brands them 'boring'.\n\nThe British director claimed the films have 'nothing to do with the art of cinema' while promoting his new drama Sorry We Missed You.\n\nLast week Scorsese, who was behind Goodfellas and Taxi Driver, slammed Marvel as 'not cinema' for the lack of emotion being conveyed.\n\nAnd yesterday Ford Coppola backed him up by denouncing them as 'despicable'.\n\nScroll for video\n\nBritish director Ken Loach (pictured) claimed the films have 'nothing to do with the art of cinema' while promoting his new drama Sorry We Missed You\n\nLoach, 83, told Sky: 'I find them boring. They're made as commodities … like hamburgers … It's about making a commodity which will make profit for a big corporation – they're a cynical exercise.'\n\nThe BAFTA-award winner added: 'They're a market exercise and it has nothing to do with the art of cinema.'\n\nScorsese described the Marvel films as more like theme parks than cinema, even if they were well made.\n\nCoppola, who directed classics like The Godfather and Apocalypse Now, revealed he agreed with him.\n\nBut he went further than Scorsese and described the superhero series as 'despicable' and like seeing 'the same movie over and over again'.\n\nMarvel bashing: Just days after Martin Scorsese bashed Marvel Studios superhero movies, he got another ally in Francis Ford Coppola (pictured) who agrees with his stance\n\nThe 80-year-old filmmaker was in Lyon, France, accepting the Prix Lumiere for his contributions to cinema, when he was asked about Scorsese's controversial comments.\n\nHe said: 'When Martin Scorsese says that the Marvel pictures are not cinema, he's right because we expect to learn something from cinema, we expect to gain something, some enlightenment, some knowledge, some inspiration.\n\n'I don't know that anyone gets anything out of seeing the same movie over and over again,' Coppola added.\n\nCoppola added an extra jab, going as far to call Marvel movies 'despicable' and saying Scorsese's statement was kind.\n\n'Martin was kind when he said it's not cinema. He didn't say it's despicable, which I just say it is,' Coppola added.\n\nDespicable: Coppola even added an extra jab, stating that Scorsese's statement was kind, while Coppola went so far to call Marvel movies 'despicable'\n\nScorsese was being interviewed by Empire last week when he was asked about Marvel Studios superhero movies, revealing he has 'tried' to watch them.\n\nHis remarks made waves across social media for days, as fans of his work and the Marvel hits such as the Avengers films, argued the merits.\n\n'I don't see them. I tried, you know? But that's not cinema,' Scorsese said.\n\n'Honestly, the closest I can think of them, as well made as they are, with actors doing the best they can under the circumstances, is theme parks,' he continued.\n\n'It isn't the cinema of human beings trying to convey emotional, psychological experiences to another human being,' he added.\n\nKind: 'Martin was kind when he said it's not cinema. He didn't say it's despicable, which I just say it is,' Coppola added\n\nScorsese's statement lead to several Marvel Studios directors to respond to his criticism, including Guardians of the Galaxy director James Gunn.\n\n'Martin Scorsese is one of my five favourite living filmmakers,' Gunn began on Twitter.\n\n'I was outraged when people picketed The Last Temptation of Christ without having seen the film. I'm saddened that he's now judging my films in the same way,' Gunn added, referring to religious groups protesting Scorsese's 1988 film.\n\n'That said, I will always love Scorsese, be grateful for his contribution to cinema, and can't wait to see The Irishman,' Gunn added.\n\n'And I'm not saying religious zealotry is the same as not liking my movies, or in the same category.\n\nTry: Scorsese was being interviewed by Empire last week when he was asked about Marvel Studios superhero movies, revealing he has 'tried' to watch them\n\nCinema: 'It isn't the cinema of human beings trying to convey emotional, psychological experiences to another human being,' he added\n\n'What I'm saying is I'm not fond of people judging things without actually seeing them, whether it's a movie about Jesus or a genre.'\n\nGunn added on Instagram gangster movies, which have been closely associated with Coppola and Scorsese, were once called 'despicable' by 'our grandfathers'.\n\nHe wrote: 'Some superhero films are awful, some are beautiful. Like westerns and gangster movies [and before that, just MOVIES], not everyone will be able to appreciate them, even some geniuses. And that's okay.'\n\nCoppola has not directed a movie since 2011's Twixt, but he has been working on a project called Megalopolis for the past two decades.", "description": "The British director (pictured) claimed the films have 'nothing to do with the art of cinema' while promoting his new drama Sorry We Missed You.", "authors": ["James Gant For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/18/20048352-0-image-a-3_1571766950264.jpg", "published_at": "2019-10-22"}