{"pub": "yahoo", "url": "https://sports.yahoo.com/why-scottie-pippen-thinks-never-171540627.html", "downloaded_at": "2019-10-06 00:24:43.057701+00:00", "title": "Why Scottie Pippen thinks there never will be another Steph Curry", "language": "en", "text": "Players like Steph Curry don't come around very often.\n\nThe Warriors superstar guard changed how the game of basketball is played. No longer is the 35-foot 3-pointer a bad shot. Not after Curry has been able to hit shots from all over the floor with deadly accuracy.\n\nCurry's meteoric rise to the top of the basketball world has come with three NBA titles, two MVP awards and surefire spot on Springfield, Mass.\n\nScroll to continue with content Ad\n\nWhile there have been countless superstars throughout the course of NBA history, Curry finds himself in rarified air as one of the legends who never will be duplicated.\n\nScottie Pippen, who won titles alongside Michael Jordan, knows a thing or two about that level of greatness, and he doesn't believe the world will ever see another player like Curry.\n\n\"I think this is truly a one-off,\" Pippen said on ESPN's \"The Jump.\" \"Unless he can force his son to go after his records, no one is even going to have the DNA to even think about trying to capture this. It's amazing, you look at how this kid shoots the ball from behind the 3-point line, he shoots it like it's a layup. There's no restriction. He's been a game-changer. You look at his threes attempted compared to Ray Allen, and Ray Allen was probably getting three to five a game, whereas Steph is probably getting 10 to 15 a game. So, I don't see any players in the league that can really change this landscape unless him and Klay get on separate teams.\"\n\nNo arguments here.\n\n[RELATED: Larry Bird not sure what to expect from Warriors this season]\n\nWith Kevin Durant no longer in the picture, Curry will look to remind everyone why he won back-to-back MVP awards and universally is considered one of the best players of all-time.\n\nStory continues\n\nThe new-look Warriors will need MVP Curry to return if they are to be a threat in the stacked Western Conference.\n\nI expect Curry to be beyond great this season. He hasn't shown any reason to believe otherwise.\n\nWhy Scottie Pippen thinks there never will be another Steph Curry originally appeared on NBC Sports Bay Area", "description": "Steph Curry changed the game. Those players don't come around often.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/v6KVodZK27_2f3bjGIiExg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/KbgEET30rGVYB_Azn0D05A--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnbayarea.com/bbcbf8ddec2f6ebfcad271dde90464d4", "published_at": "2019-10-05"}