{"pub": "realclearpolitics", "url": "https://nationalpost.com/opinion/jonathan-kay-conservatives-shouldnt-unleash-cancel-culture-insanity-on-the-wounded-trudeau?video_autoplay=true", "downloaded_at": "2019-09-20 12:56:04.185151+00:00", "title": "Jonathan Kay: Conservatives shouldn't unleash cancel-culture insanity on the wounded Trudeau", "language": "en", "text": "When I was 10 years old, I attended my synagogue’s annual Purim party dressed as (what I imagined to be) an Arab herdsmen. I wore a bathrobe instead of an actual Bedouin thobe. But my headwear was authentic, as I’d donned a real kufeya and igal that my family had purchased in the West Bank. Had I put more effort into the outfit, I probably would have darkened my face. But this being the late 1970s, I had old-fashioned hang-ups about boys wearing makeup. In other words, the only thing saving me from my racism was my homophobia.\n\nNevertheless, if I’d indeed gone in for brownface or beigeface (the exact hue depending on whatever picture the World Book editors had included under the heading for “Bedouin”), I doubt anyone at that Montreal party would have batted an eyelid. Five years later, during a high-school model United Nations in New Hampshire, a classmate of mine covered himself in brown makeup in keeping with his assigned role as delegate from some South American country (I forget which). He also wore sunglasses and carried a briefcase — as he wanted to convey the impression of a drug kingpin. Everyone thought it was hilarious, and the only reason he stopped wearing the makeup on the second day was that it was causing his face to break out. That’s the way things were back then. We were all, by today’s standards, extremely racist.\n\nIt pains me to say it, but Trudeau’s defenders aren’t entirely wrong\n\nIn this same spirit of confession, I will admit it is somewhat maddening to observe the hypocrisy of Liberal partisans lining up to defend Justin Trudeau now that he’s been outed for using brownface as part of a campy Arabian Nights-inspired get-up in 2001, and full-on blackface on stage at Brébeuf high school in the 1980s: we all know that if the shoe were on the other foot, and photos of Andrew Scheer in cosmetically enhanced faux-black mode were making the rounds, those same Liberals now insisting this is a “learning moment” would cite this as horrifying evidence of alt-right crypto-Breitbartian Faith-Goldyism. But, and it pains me to say it, Trudeau’s defenders aren’t entirely wrong.\n\nWhen critics Tweet “How did the entire Canadian media miss this (story)?” one big reason is that — outside the context of full-on blackface — this kind of dress-up wasn’t universally stigmatized until somewhat recently. Writer Robert Jago dug up a second 2001 photo of Trudeau doing his brownface genie shtick at a fundraising gala for his Vancouver school, this time with the then-teacher putting arms around two South Asian men in turbans. We don’t know what the men were thinking — it could very well have been “When is Professor Dress-up going to get his Maybeline-stained hands off my shoulders?” — but the fact that Trudeau felt free to gallivant around one of Vancouver’s most expensive hotels like this without attracting censure or controversy tells us something about the standards of the time.\n\nTrudeau’s Aladdin bit, while tacky and insensitive, had no connection to the legacy of slavery and Jim Crow. His 1980s-era Banana Boat act at Brébeuf, by contrast, is harder to defend, because it can’t be deflected on the basis of chromatic, ethnic or historical nuance. But I still don’t think it would have been shocking to those who grew up in Quebec during this period, especially as regards Francophone norms.\n\nAs recently as 2003, the Journal de Montreal sent one of its reporters into a dollar store, wearing blackface, posing as a job applicant. (The stunt bombed because the cashier thought the skin tone looked blue, and so assumed the guy was some kind of psycho trying to rob the place.) In 2005, a comedian appeared on TVA wearing what the media described gingerly as “near-blackface” to lampoon then-governor-general Michaëlle Jean. A 2014 satirical show at Théâtre du Rideau Vert included a white comedian impersonating then-Montreal Canadien P.K. Subban by donning blackface and an afro wig. These were mainstream Québécois cultural and media events, not meetings of the Ville D’Anjou Lionel Groulx Cosplay Co-op. From spending time with Trudeau, my sense is that he is largely Franco-Canadian in his cultural outlook, with an overlay of Anglo influence acquired somewhat late in his youth (mostly at McGill). It isn’t surprising to me that, even as a teacher in B.C. many years later, he still thought his old Québécois high school shtick would be a gas.\n\nAs much as I roll my eyes at the Liberal social-justice puritans and cancel-culture fanatics who very suddenly are pontificating about how the quality of mercy is never strained, the response from Trudeau’s critics often has been equally ridiculous. On social media, you hear some pundits wondering aloud whether Trudeau will now be forced to resign — as if this were somehow worse than gaslighting his own attorney general while turning the PMO into a concierge service for an engineering company accused of renting hookers for the son of a Libyan dictator. Meanwhile, NDP Leader Jagmeet Singh told the media: “Who is the real Trudeau? Is it the one behind closed doors, the one when the cameras are turned off that no one sees?” — as if the curtains had been raised on the window of Trudeau’s bedroom while he was performing some kind of pervy one-man cultural-appropriation fetish show. The very opposite is true: Trudeau dressed up in these ludicrous outfits precisely to please public crowds. He was not ashamed of what he was doing because he believed the public would regard it as funny and entertaining.\n\nConservatives have been just as bad, with many demanding that these disclosures be leveraged for culture-war vengeance; and that Trudeau be effectively “cancelled,” much in the way that Trudeau cancelled the careers of two of his own MPs after receiving unverified accounts that they’d engaged in sexual misconduct. Trudeau and the people he surrounds himself with prattle on endlessly about “toxic masculinity.” They have injected intersectional gibberish into Canadian infrastructural requirements. His minister for sport goes on Twitter to contradict women who are concerned about male bodies in female sporting spaces. And so, yes, it is delicious to watch the ultimate Canadian social-justice level boss betrayed as just another imperfect soul. The charge of hypocrisy is completely fair, and in a perfect world, Trudeau will use this opportunity to admit as much.\n\nBut to the extent that these conservatives — small- and large-C alike — are cheering on Trudeau’s shaming, they are legitimizing the very same witch-hunt culture that, in recent years, has led to the deterioration of our national politics into a hysterical bug hunt for incriminating Facebook posts, the spread of false allegations against men such as Steven Galloway, and the collapse of highbrow arts and letters into a name-and-shame ouroboros of perpetual wokeness. Sparing Trudeau the logic of tit-for-tat might help arrest these awful trends.\n\nIn my own fake Bedouin village, we have a fake Bedouin expression that translates fakely as follows: “The best time to make peace with a man is when the tip of your big curvy genie sword is at his throat.” For it is at this time that you have the moral advantage, and by sparing him your full wrath may supply an example by which you both shall conduct yourself in the future. Today, conservatives hold the sword. Tomorrow, they won’t.\n\nWe don’t need this “learning opportunity” to teach us not to paint our faces. We already knew that. What we need to learn is how not to vilify each other for things we did half a lifetime ago. For there is not one among us who doesn’t have something disgraceful hidden under our terrycloth thobe.\n\n• Twitter: JonKay\n\nJonathan Kay is Canadian editor of Quillette.", "description": "They are legitimizing the very same witch-hunt culture that, in recent years, has led to the deterioration of our national politics into a hysterical bug hunt", "authors": [], "top_image": "https://nationalpostcom.files.wordpress.com/2019/09/justin-trudeau-1-13.png", "published_at": "2019-09-20"}