{"pub": "marketwatch", "url": "https://marketwatch.com/story/tie-ceo-pay-to-increases-in-stakeholder-and-shareholder-value-2019-09-09", "downloaded_at": "2019-09-09 10:25:26.808082+00:00", "title": "Tie CEO pay to increases in stakeholder and shareholder value", "language": "en", "text": "The CEOs who make up Business Roundtable recently made a big splash by revising the group’s statement on the purpose of a corporation. According to this new approach, a corporation not only should create long-term value for shareholders, it should serve the interests of all other corporate stakeholders — employees, customers, suppliers, and the community.\n\nWhile laudable in intent, the Business Rountable statement raises more questions than it answers about CEOs and their priorities.\n\nWhat happens when there is a conflict between shareholder value and the interests of other stakeholders? How long is the long term — five or 10 or even 20 years? And how will CEOs be held accountable in this new world of multiple priorities?\n\nFor the revised statement to be more than a public relations gambit, BRT companies should put forward a business plan for shareholders and stakeholders — with specific success metrics for each in a definite time period. To hold management accountable, companies should tie executive compensation to the achievement of these metrics.\n\nThe revised statement lists all stakeholders — without any priority or definition of the long term. It offers no guidance on how to resolve the inevitable conflicts between the interests of shareholders and those of another group.\n\nFor instance, Bank of America BAC, -1.39% CEO Brian Moynihan stated: “You can provide great returns for your shareholders and great benefits for your employees…” Yes — as long as the business is doing well. However, suppose demand for a company’s products falls off sharply due to a disruptive technology. The company will likely have to choose between laying off employees and reducing profits.\n\nSimilarly, delivering better products to customers will often lead to higher shareholder returns. However, this correlation does not hold in certain situations. For example, customers may be willing to pay more for “green” cosmetics, but not “green” electricity. Or, an online news service may not generate enough advertising or subscription revenues to cover the costs of well-researched articles.\n\nThe relationship between local communities and shareholder value is particularly difficult to evaluate. Of course, companies should consider the implications of plant locations on adjacent communities. Yet, multinational companies already have factories in multiple communities across the globe. So it is unclear which community should be favored if new factory jobs could be located in an American, Mexican or Vietnamese city.\n\nIn fact, companies may have very different strategies for pursuing stakeholder interests that reduce annual revenues or profits. A company may decide to change its social policy in response to public concerns or as a means to increase long-term shareholder value.\n\nFor example, after the Parkland School shootings in Florida in February 2018, Dick’s Sporting Goods DKS, -1.28% CEO Edward Stack decided the retailer would stop selling assault weapons, regardless of profit implications. In March 2019, Dick’s Sporting Goods removed guns and ammunition from 125 of its stores, to be replaced by higher-margin sporting goods in order to “drive growth.”\n\nLast week, after extensive research on how to respond to the mass shooting in August at its El Paso, Tex. store, retail giant Walmart WMT, -0.62% stopped selling assault rifles, discouraged customers from openly carrying guns on store premises, and called on Congress to increase background checks for gun buyers.\n\nRead: How Walmart and other companies could turn the gun debate\n\nIf a company is devoting substantial resources to promoting a stakeholder interest in order to increase long-term shareholder value, that company should articulate its objective with an express time frame, with metrics to assess progress. So if Dick’s Sporting Goods is replacing guns with other products to augment its margins and spur growth, the company should tell shareholders what to expect in terms of revenue growth and higher margins, and over what time period.\n\nSuch guidance would give both shareholders and stakeholders a strong tool to hold a company’s executives accountable for their strategies. Without a strong tool, a company’s executives could justify any earnings shortfall under the new Business Roundtable statement by saying they were pursuing other stakeholder interests. Yet there would be no clear accounting of the benefits provided by the company to employees, customers, or local communities.\n\nTo encourage executives to focus on long-term shareholder value, companies should base cash bonuses on corporate performance over several years.\n\nTo build corporate accountability into its new approach, the Business Roundtable should urge its member companies to tie executive compensation to long-term returns to shareholders. Currently, most companies base cash bonuses on last year’s financial performance, and allow executives to sell immediately all shares acquired through options. To encourage executives to focus on long-term shareholder value, companies should base cash bonuses on corporate performance over several years — and require executives to retain half of the shares acquired through stock options.\n\nA Business Rountable company should also promulgate metrics, with a time frame, for its stakeholder objectives and their relationship to long-term shareholder value. For employees, metrics could include turnover rates, relative salary levels, and satisfaction surveys. For customers, metrics could include rates of product returns, response time to questions, and satisfaction surveys. For communities, metrics could include levels of charitable contributions and training of local workers.\n\nIn short, the Business Roundtable has issued a well-meaning, though vague, aspirational statement for its member companies to serve all stakeholder interests. For this statement to become operational, companies need to establish objectives for each interest group, with specific metrics and time periods, which would become criteria for executive compensation.\n\nRobert C. Pozen is senior lecturer at MIT Sloan School of Management and former president of Fidelity Investments.\n\nMore: Politically active CEOs may help their companies attract more employees", "description": "Clear measures of success are needed to hold management accountable to its constituents, writes Robert C. Pozen.", "authors": ["Robert C. Pozen"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GX559_Dimon_ZG_20181101152623.jpg", "published_at": "2019-09-09"}