{"pub": "businessinsider", "url": "https://pedestrian.tv/film-tv/john-krasinski-and-ryan-reynolds-working-together-is-definitely-a-dream-i-have-had", "downloaded_at": "2019-10-16 03:58:39.252908+00:00", "title": "John Krasinski And Ryan Reynolds Are Gunna Be Co-Stars & I Must Know Who Leaked My Fan Fic", "language": "en", "text": "Sometimes things come across my desk that reminds me that there is actually some good in the world. Today, it’s the knowledge that my boyfriends John Krasinski and Ryan Reynolds are working on, and co-starring in, an upcoming film together.\n\nAs per The Hollywood Reporter, the pair are working on a comedy-fantasy flick called ‘Imaginary Friends’, and tbh ‘fantasy’ is very much the right word for it because I’m about 90% sure this is a dream I’ve had.\n\nIt’s reported that John Krasinski is writing and directing the film, which apparently follows the story of a guy who can see and speak with the forgotten imaginary friends of other people, and is being pinned as similar to the whole “only you can talk to me” comedy seen in Dr Dolittle.\n\nReports are looking like Ryan Reynolds will play the lead here, and has to make efforts to save the world when some of the imaginary friends turn evil after being neglected by their IRL friends for so long.\n\nLook this is going to be great and it’ll be fab to see John Krasinski getting back into a comedy role after he showed his range with directing and starring in A Quiet Place, the Very Serious Films, but I’m also going to be sitting in the cinema very distracted by both of my husbands on the screen at the same time, as co-stars of the film, and also my heart.\n\nBoth actors are big on the ol’ breaking-the-fourth-wall in the name of comedy, so this is going to be some beautiful Deadpool-cross-Jim-Halpert shit, isn’t it. Here for that, my good bitches. Here. For. That.\n\nImaginary Friends is being shopped out to production companies at the moment, it’s reported, so as soon as this one gets some more information on like, when the fuck I can throw all my money at the local cinema to watch every screening forever, I’ll let you know.", "description": "Reports have surfaced that John Krasinski and Ryan Reynolds are set to co-star in a fantasy-comedy where a man can speak to forgotten imaginary friends.", "authors": ["Courtney Fry"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/krasinski-reynolds-fb.jpg", "published_at": "2019-10-16"}