{"pub": "investing.com", "url": "https://ca.investing.com/news/economy/imf-warns-low-global-rates-are-spurring-a-risky-reach-for-yield-1985285", "downloaded_at": "2019-10-16 14:14:39.616498+00:00", "title": "IMF Warns Low Global Rates Are Spurring a Risky Reach for Yield", "language": "en", "text": "© Reuters. IMF Warns Low Global Rates Are Spurring a Risky Reach for Yield\n\n(Bloomberg) -- The International Monetary Fund warned that global economic risks have risen as central banks reduce borrowing costs and that stronger oversight is needed ease threats to an already shaky expansion.\n\n“While easier financial conditions have supported economic growth and helped contain downside risks to the outlook in the near term, they have also encouraged more financial risk-taking and a further buildup of financial vulnerabilities, putting medium-term growth at risk,” the fund said Wednesday in its latest Global Financial Stability Report.\n\nThe policy easing that has helped support global growth has also fueled a further increase of financial risks, and threats to global growth and financial stability remain “firmly skewed to the downside,” the fund said. It added that policy makers “urgently need to take action to tackle financial vulnerabilities that could exacerbate the next economic downturn.”\n\nThe latest warnings come a day after the fund said global growth is on pace for the weakest expansion since 2009, when the world economy shrank, as trade wars cloud the outlook. Those disputes have whipsawed global markets and weighed on business sentiment, though central bank easing has helped alleviate concerns about a deeper economic slowdown, the report said.\n\nThe fund said lower yields are spurring investors such as insurance companies and pension funds “to invest in riskier and less liquid securities” and that pricing in financial markets signals interest rates will remain lower for longer than anticipated at the start of this year. About $15 trillion of debt worldwide has negative yields, it said.\n\nRisks in China remain elevated due to high debt levels for investment vehicles, according to the report, which said the authorities taking over one regional bank this year and injecting capital into another underscore the risks to the financial system in the world’s second-largest economy.\n\nVulnerabilities among non-bank institutions are now elevated in 80% of nations with large financial sectors, a share similar to the depths of the global financial crisis, the fund said. In an economic slowdown scenario half as severe, corporate debt owed by firms unable to cover their interest payments with earnings could rise to $19 trillion, or nearly 40% of company debt in major economies.\n\n“The search for yield in a prolonged low-interest-rate environment has led to stretched valuations in risky asset markets around the globe, raising the possibility of sharp, sudden adjustments in financial conditions,” the fund said. “Such sharp tightening could have significant macroeconomic implications, especially in countries with elevated financial vulnerabilities.”\n\nIMF Chief Economist Gita Gopinath pointed to rising financial stability risks on Tuesday after releasing the World Economic Outlook.\n\n“While monetary easing has supported growth, it is essential that effective macroprudential regulation be deployed today to prevent mispricing of risk and excessive buildup of financial vulnerabilities,” she told reporters at a briefing.", "description": "IMF Warns Low Global Rates Are Spurring a Risky Reach for Yield", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEDA40TU_L.jpg", "published_at": "2019-10-16"}