{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/immigration-debate-liberal-judges-rule-against-trump-public-charge-rule", "downloaded_at": "2019-10-14 11:28:56.319411+00:00", "title": "Immigration Debate: Liberal Judges Rule against Trump’s Public Charge Rule", "language": "en", "text": "Central American migrants surrenders to a U.S. Border Patrol agent south of the U.S.-Mexico border fence in El Paso, Texas, March 6, 2019. (Lucy Nicholson/Reuters)\n\nLast week’s district-court decisions against the administration are bad.\n\nThis an actual excerpt from the United States Code:\n\nAny alien who, in the opinion of the consular officer at the time of application for a visa, or in the opinion of the Attorney General at the time of application for admission or adjustment of status, is likely at any time to become a public charge is inadmissible.\n\nThis gives an astonishingly broad power to the executive branch. Executive officials are allowed to enforce their “opinion” of who is “likely” — “at any time,” at that — to become a “public charge” — a term that is not defined — and to keep such people from coming into the country or getting a green card once here. The statute goes on to say that certain factors such as age, health, and education must be considered “at a minimum.” But that’s it, in terms of limiting this power.\n\nConservatives have long warned against these kinds of laws, pointing out that while they’re nice when your guy is in power, they can be maddening when it’s the other guy’s turn. Liberals have now replied: “Not when the judges are on our side.” Because on Friday, not one, not two, but three Democrat-appointed district-court judges ruled, in effect, that the public-charge rule issued by Trump’s Department of Homeland Security (DHS) had somehow managed to overstep the nonexistent bounds of the law quoted above. Specifically, they paused the rule’s enforcement while the cases proceed, which required them to find that the plaintiffs challenging the rule are “likely to succeed” on the merits. The rule was tied up in court before it even went into effect.\n\n***\n\nAdvertisement\n\nAdvertisement\n\nTrump’s rule certainly was a departure from the approach taken by past administrations, for good reason: Some version of the public-charge rule has been in federal law for more than a century, but government benefits have expanded dramatically and changed in character over the years. Current practice largely stems from a long-controversial Clinton-administration guidance document defining a public charge as someone who supports himself primarily with cash benefits. These days, however, most of the welfare state comprises non-cash benefits such as food stamps, Medicaid, and housing subsidies.\n\nTrump’s rule added many non-cash benefits to the calculation — and set the key threshold at one year of benefit receipt over a three-year period. Benefit use beyond that is a “heavily weighted” strike against the immigrant, though each case is decided according to the totality of the circumstances, including the immigrant’s resources, job, sponsors, etc. (The DHS rule applies to immigrants trying to adjust their status within the country; a separate but similar rule from the State Department applies to those applying from abroad.)\n\nAdvertisement\n\nYou might think that’s too harsh. But it is the executive’s prerogative to enforce its opinion about who is likely to become a public charge. So why do these judges think they can block it?\n\nAdvertisement\n\nThe judges’ decisions are fairly similar, evaluating three main objections to the rule. Two are not worth much of your time. One is that the rule violates a different law against discrimination based on disabilities, which is absurd because the statute laying out the public-charge power explicitly instructs the government to consider “health.” (Even one of these liberal judges rejected that one, in harsh terms.) The other objection is that old standby, “arbitrary and capricious,” which is what judges say to strike down an action on the grounds that they disagree with it.\n\nWorth grappling with, though, is the idea that “public charge” is actually a well-defined term that refers to someone who is primarily or exclusively dependent on the government. This wouldn’t stop the government from considering non-cash benefits, but it might rule out considering someone a public charge for using benefits, even in small amounts, for one year out of three.\n\nAdvertisement\n\nParts of the historical record do support this reading, especially from the days when insane asylums and “almshouses” were abundant and food stamps didn’t exist. But the overall thrust of that record is that the term has meant different things to different people at different points in history — and indeed was deliberately left vague by Congress. The law is clear, by contrast, that the executive is supposed to have wide discretion to interpret the term, and under current Supreme Court precedent, courts are supposed to be highly deferential to the executive branch’s reading of the laws anyhow. As a result, this shouldn’t have been a close call.\n\nAdvertisement\n\n***\n\nAs the government discussed in 2018 in proposing the rule, going by dictionary definitions, someone can be a “charge” if he is fully entrusted to someone else, but also if he just relies on someone for some degree of support or oversight. “Public charge” as a term is often defined in generic language, as someone who relies on government support.\n\nSimilarly, going by the term’s history, someone fully in the care of the state is definitely a public charge, but not everyone who receives public benefits is one, and the exact threshold lies . . . well, probably somewhere in between.\n\nAdvertisement\n\nThe first federal law keeping out public charges, enacted in 1882, also collected a 50-cent tax from all immigrants and used the proceeds in part “for the care of immigrants arriving in the United States, for the relief of such as are in distress.” This was a time when immigrants left their homes with little and traveled in disease-infested ships, but certainly this makes clear that not all public benefits make someone a public charge.\n\nIn the decades that followed, courts struggled to apply the term in their cases. (This history is most thoroughly explained in the California ruling, which repeatedly notes that these cases don’t say exactly how much aid makes one a public charge.) An 1891 case analyzed an immigrant’s age, occupation, savings, and history of benefit receipt in determining whether he was likely to become a public charge. An 1893 case involved a woman who’d been deemed likely to become a public charge owing to the “poverty and character” of her husband, and the court said she “became a public charge” when she suffered a mental break and ended up in an asylum. An 1895 ruling noted that “the mere fact that a person may occasionally obtain assistance from the county does not necessarily make such person a pauper or a public charge.” Developments over the next few decades included a tedious disagreement among courts over whether prisoners technically counted as “public charges” or rather fell into some other category.\n\nThere’s lots more history here, but things don’t get clearer as you read more of it. Some people use the term “public charge” to refer to wards of the state, or at least to people completely incapable of supporting themselves; others use much broader language; still others try to draw a line somewhere in between.\n\nAdvertisement\n\nAdvertisement\n\nIf you want to argue the term has a limited meaning, for instance, you might cite a 1916 decision interpreting it to refer to “those persons who through misfortune cannot be self-supporting, but also those who will not undertake honest pursuits, and who are likely to become periodically the inmates of prisons.” Then add a 1962 document from the Board of Immigration Appeals (BIA) saying that “a healthy person in the prime of life cannot ordinarily be considered likely to become a public charge, especially where he has friends or relatives in the United States who have indicated their ability and willingness to come to his assistance in case of emergency.”\n\nIf you want to make the opposite case, quote that BIA document a little differently: What’s needed to show that someone is likely to become a public charge is “some specific circumstance, such as mental or physical disability, advanced age, or other fact reasonably tending to show that the burden of supporting the alien is likely to be cast on the public” — a category that getting public benefits for a full year quite logically falls into. Also point out that the welfare state was much smaller in 1962, with public spending on healthy people in their primes having skyrocketed since. Then bring up a 1916 comment by the secretary of labor that someone is likely to become a public charge when “such applicant may be a charge (an economic burden) upon the community to which he is going.” Toss in a 1909 declaration from the solicitor of the Department of Commerce and Labor, reasoning that a public charge is “any burden or incumbrance upon public property or resources,” though it doesn’t include reliance on private charity. And so on.\n\nAdvertisement\n\nBy the 1950s, Congress was well aware that judges and other officials had failed to create a solid definition of the term. But rather than actually define it, a congressional committee passed the buck: “Since the elements constituting likelihood of becoming a public charge are varied, there should be no attempt to define the term in law. But rather to establish the specific qualification that the determination of whether an alien falls into that category rests within the discretion of the consular officers or the Commissioner [of immigration].” The language passed in 1952, the first to forthrightly defer to the “opinion” of executive-branch officials, is highly similar to what’s still on the books today.\n\nLooking to more contemporary evidence, the judges in last week’s rulings make much of the fact that, in 1996, some in Congress tried to define “public charge” in a way similar to Trump’s rule but failed to get that language into the final law. However, when a law explicitly delegates a decision to the executive, it’s not clear why a previous, failed attempt to limit the executive’s options would stop future administrations from changing policy using the very discretion that has not been restricted. Moreover, Congress has at numerous times — including in that very same year — stated its desire to make sure that immigrants do not depend on public resources: Self-sufficiency is a “basic principle of United States immigration law”; “aliens within the Nation’s borders [should] not depend on public resources to meet their needs”; “the availability of public benefits [should] not constitute an incentive for immigration to the United States.”\n\n***\n\nThe bottom line is that the term “public charge” by itself is imprecise, while the current statute is very clear that the executive branch gets to implement it as it chooses. When Congress uses a vague term, deliberately refuses to define that term, and instructs the executive branch to enforce its “opinion” of which immigrants satisfy the meaning of the term, courts have no serious option but to let the executive do more or less what it wants. (At least until the Supreme Court revives the “nondelegation” doctrine.)\n\nThe rulings are especially galling for another reason as well: Two of the district-court judges issued nationwide injunctions. This means the injunctions don’t just protect the plaintiffs in the cases but stop the administration from enforcing the rule nationwide. Such injunctions were unheard of for nearly two centuries of American history but are increasingly common today, and particularly since Trump became president.\n\nThese rulings are bad. Higher courts should step in and quash them. And for God’s sake, Congress should write better laws.", "description": "It is the executive's prerogative to enforce its opinion about who is likely to become a public charge. So why do these judges think they can block it?", "authors": ["Robert Verbruggen", "Tobias Hoonhout", "Rich Lowry", "Zachary Evans", "Jim Geraghty", "Mairead Mcardle", "Victor Davis Hanson", "Andrew C. Mccarthy", "The Editors", "Read More"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/09/border-patrol-agent-migrants.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-14"}