{"pub": "realclearpolitics", "url": "https://foxnews.com/politics/doj-files-civil-suit-against-edward-snowden-over-new-book", "downloaded_at": "2019-09-17 23:23:48.821145+00:00", "title": "DOJ files civil suit against Edward Snowden over new memoir", "language": "en", "text": "The Justice Department filed a civil lawsuit Tuesday against former National Security Agency contractor Edward Snowden for violating his non-disclosure agreements with the CIA and the NSA by writing a new book about his leaks.\n\nSnowden’s memoir, \"Permanent Record,” hit bookshelves Tuesday. Snowden, who famously leaked classified documents about government surveillance, has avoided prosecution by living in Russia.\n\nEDWARD SNOWDEN SAYS HE WILL RETURN TO US ON ONE CONDITION\n\n“Edward Snowden has violated an obligation he undertook to the United States when he signed agreements as part of his employment by the CIA and as an NSA contractor,” said Assistant Attorney General Jody Hunt of the Department of Justice’s Civil Division.\n\nThe filing alleges that Snowden violated his non-disclosure agreements by failing to submit his manuscript to the agencies for pre-publication review, as is a standard process for former employees and contractors of the agencies.\n\nThe DOJ aims to ensure that no funds are transferred to Snowden or at his direction while the court is resolving the United States' claims. The immediate consequence could be the freezing of book revenue.\n\n“Intelligence information should protect our nation, not provide personal profit,” said G. Zachary Terwilliger, U.S. Attorney for the Eastern District of Virginia. “This lawsuit will ensure that Edward Snowden receives no monetary benefits from breaching the trust placed in him.”\n\nThis case was filed in the Eastern District of Virginia and is separate from the criminal case against Snowden for allegedly disclosing classified information.\n\nSnowden responded to the lawsuit, tweeting, \"The government of the United States has just announced a lawsuit over my memoir, which was just released today worldwide. This is the book the government does not want you to read.\"\n\nAttorney General William Barr approved the lawsuit, according to a source familiar with the situation.\n\nSnowden’s memoir tells his life story in detail for the first time, explaining why he chose to risk his freedom to become perhaps the most famous whistleblower of all time.\n\nSnowden writes in the book that his seven years working for the NSA and CIA led him to conclude the U.S. intelligence community \"hacked the Constitution\" and put everyone's liberty at risk and that he had no choice but to turn to journalists to reveal it to the world.\n\n\"I realized that I was crazy to have imagined that the Supreme Court, or Congress, or President Obama, seeking to distance his administration from President George W. Bush's, would ever hold the IC [intelligence community] legally responsible — for anything,\" he writes.\n\nHis decision to turn from obscure IC wonk to whistleblower in 2013 set off a national debate about the extent of government surveillance by intelligence agencies desperate to avoid a repeat of the Sept. 11 attacks. Intelligence officials who conduct annual classified assessments of damage from Snowden's disclosures say the documents will continue trickling out into the public domain for years to come.\n\nAmid the release of his book, Snowden this week called on French President Emmanuel Macron to grant him asylum.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBut in an interview Monday on “CBS This Morning,” Snowden said he would like to return to the United States one day if he can get a fair jury trial.\n\n“That is the ultimate goal, but if I’m going to spend the rest of my life in prison then my one, bottom-line demand that we all have to agree to is that at least I get a fair trial,” Snowden said.\n\nFox News' Catherine Herridge and The Associated Press contributed to this report.", "description": "The Justice Department filed a civil lawsuit Tuesday against former National Security Agency contractor Edward Snowden for violating his non-disclosure agreements with the CIA and the NSA by writing a new book about his leaks.", "authors": ["Jake Gibson", "Jake Gibson Is A Producer Working At The Fox News Washington Bureau Who Covers Politics", "Law Enforcement", "Intelligence Issues."], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2016/04/29/694940094001_4870545595001_042916-ff-snowden-1280.jpg", "published_at": "2019-09-17"}