{"pub": "yahoo", "url": "https://news.yahoo.com/10-things-know-today-october-113700666.html", "downloaded_at": "2019-10-08 12:10:34.840827+00:00", "title": "10 things you need to know today: October 8, 2019", "language": "en", "text": "1.\n\nHouse Democrats stepped up their impeachment inquiry on Monday by issuing subpoenas to the Pentagon and the Office of Management and Budget for documents on the decision to hold up aid to Ukraine. House Democrats had already demanded documents from the State Department, the White House, and President Trump's personal lawyer, Rudy Giuliani, for information on Trump's effort to pressure Ukraine to investigate former Vice President Joe Biden, now a Democratic presidential candidate, and Biden's son Hunter, who served on the board of a Ukrainian energy company. It was not immediately clear how the Trump administration would respond to the new subpoenas, although the State Department missed a Friday deadline to comply with the subpoena it received. [CNN]\n\n2.\n\nA federal judge on Monday ruled that President Trump can't legally keep his tax returns from New York prosecutors. Judge Victor Marrero of the U.S. District Court in Manhattan called Trump's claim his position makes him immune from criminal investigation \"repugnant to the nation's governmental structure and constitutional values.\" Trump won a temporary delay of the ruling from the U.S. Court of Appeals for the Second Circuit, meaning that Trump's accounting firm, Mazars USA, did not have to immediately hand over the requested eight years of Trump's returns while the appeals court reviews the case. [The New York Times, NBC News]\n\n3.\n\nSens. Lindsey Graham (R-S.C.), Mitt Romney (R-Utah), and Marco Rubio (R-Fla.), and other prominent Republicans on Monday criticized President Trump's decision to move America's 1,000 troops in northeastern Syria out of the way ahead of a Turkish incursion into the area. The GOP senators said the move amounted to abandoning America's Kurdish allies who helped drive out ISIS. Turkey views the Kurds as a threat. Senate Majority Leader Mitch McConnell (R-Ky.), in a rare public disagreement with Trump, warned that \"a precipitous withdrawal ... would only benefit Russia, Iran, and the Assad regime,\" and help ISIS regroup. Trump sought to reassure critics, tweeting Monday that he would \"obliterate\" the Turkish economy if Ankara did anything he considers \"off limits.\" [The Associated Press, The Washington Post]\n\n4.\n\nHouse Democrats are considering taking extraordinary precautions to mask the identity of the whistleblower whose complaint sparked an impeachment inquiry of President Trump, hoping that the measures will clear the way to getting the whistleblower to testify, The Washington Post reported Monday, citing three officials familiar with the discussions. Democrats reportedly are considering having the whistleblower testify remotely, and masking the person's appearance and voice so Trump's congressional allies can't expose the whistleblower's identity. Trump has attacked the person's credibility and said he should be able to know who the individual is. On Tuesday, Gordon Sondland, the U.S. ambassador to the European Union, will testify before the House Intelligence Committee about his role in trying to get Ukraine to investigate former Vice President Joe Biden. [The Washington Post]\n\n5.\n\nThe 2019 Nobel Prize in Physics was awarded Tuesday to James Peebles, Michel Mayor, and Didier Queloz for \"improving our understanding of evolution of universe and Earth's place in the cosmos.\" The Royal Swedish Academy of Sciences said Peebles, a Princeton University professor, won half the $908,280 prize \"for theoretical discoveries in physical cosmology,\" while Mayor and Queloz will receive the other half \"for the discovery of an exoplanet orbiting a solar-type star.\" Peebles' theoretical framework has come to serve as the foundation for current understanding of the universe's history, The Guardian reported. Mayor and Queloz discovered the first planet outside our solar system in 1995. [The Guardian, Princeton University]\n\n6.\n\nThe Commerce Department late Monday blacklisted 28 Chinese state security bureaus and tech companies for their alleged involvement in suppressing China's Uighur Muslims and other ethnic minorities. The entities' inclusion on the Entity List bars U.S. companies from doing business with the Chinese firms. The filing accuses the agencies and some of China's top artificial intelligence companies of involvement in Beijing's \"campaign of repression, mass arbitrary detention, and high-technology surveillance\" against the minority groups. Commerce Secretary Wilbur Ross said in a statement that the U.S. \"will not tolerate the brutal suppression of ethnic minorities in China.\" The move came as high-level U.S. and Chinese negotiators prepared to meet Thursday for talks on ending the two countries' trade war. [NPR]", "description": "1.House Democrats stepped up their impeachment inquiry on Monday by issuing subpoenas to the Pentagon and the Office of Management and Budget for documents on the decision to hold up aid to Ukraine. House Democrats had already demanded documents from the State Department, the White House, and President", "authors": ["Harold Maass"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-08"}