{"pub": "reuters", "url": "https://in.reuters.com/article/environment-plastic-aluminium-insight-in/plastic-bottles-vs-aluminium-cans-wholl-win-the-global-water-fight-idINKBN1WW0JD", "downloaded_at": "2019-10-17 06:27:49.701078+00:00", "title": "Plastic bottles vs. aluminum cans: who'll win the global water fight?", "language": "en", "text": "LONDON (Reuters) - Global bottled water giants are ramping up trials of easily recyclable aluminum cans to replace plastic that pollutes the world’s seas. Sound like a slam-dunk for the environment? Not entirely.\n\nFILE PHOTO: A plastic bottle drifts on the waves of the sea at a fishing port in Isumi, east of Tokyo, Japan November 21, 2018. REUTERS/Issei Kato/File Photo\n\nAluminum cans might indeed mean less ocean waste, but they come with their own eco-price: the production of each can pumps about twice as much carbon into the atmosphere as each plastic bottle.\n\nFrench group Danone (DANO.PA) has become the latest company to make a move, telling Reuters it had started to replace some plastic bottles with aluminum cans for local water brands in Britain, Poland and Denmark.\n\nThe shift, previously unannounced, comes as multinational rivals like Coca-Cola Co (KO.N), PepsiCo (PEP.O) and Nestle (NESN.S) are also launching some canned versions of water brands.\n\nThe beverage industry has been scrambling to react to public anger over scenes of huge piles of plastic waste contaminating oceans, pledging to step up recycling efforts.\n\nHowever it’s not black and white on the green front. By increasing recycling via cans, companies could fall back in efforts to reduce their carbon footprints, illustrating the tough juggling act they can face to keep environmentally conscious investors, campaigners and consumers on-side.\n\n“That’s the dilemma you’re going to have to choose between,” said Ruben Griffioen, sustainability manager of packaging materials at Heineken, adding the company was trying to reduce both plastic waste and emissions.\n\nRecycling plastic is more complex, leads to degradation and has lower reuse rates than aluminum - so the metal has been heralded as a greener alternative. Cans have on average 68% recycled content compared to just 3% for plastic in the United States, Environmental Protection Agency data shows.\n\nNew water brands are also making a splash.\n\n“Mananalu will rid the world of plastic water containers and start a wave of change,” says the website of the new canned water launched by Hollywood actor Jason Momoa, of Aquaman fame. Another entrant, Liquid Death, meanwhile, hails its “eco-friendly cans” and uses the hashtag #DeathtoPlastic.\n\n“The aluminum industry can play on the fact that its product is infinitely recyclable, and they’re right,” said Martin Barrow, director of footprinting at UK-based non-profit consultancy the Carbon Trust.\n\n“But primary aluminum uses huge amounts of electricity and it’s also got some chemical releases of greenhouse gas emissions.”\n\nComparing the carbon footprints of aluminum and plastics is a complex calculation because making the metal with hydro power instead of fossil fuels reduces emissions while using recycled aluminum slashes it even further.\n\nBut when all types of metal are averaged out, however, cans still account for about double the greenhouse gases of plastic bottles, Barrow said, citing figures for Europe.\n\nAt aluminum’s most polluting level, a 330 ml can is responsible for 1,300 grams of carbon dioxide emissions, according to the analysis compiled for Reuters, roughly equating to the emissions produced by driving a car 7 to 8 km.\n\nA plastic bottle of the same size, made from the polyethylene terephthalate (PET) plastic typically used, accounts for up to 330 grams.\n\n‘NEVER THAT CLEAN’\n\nBruce Karas, an executive at Coca-Cola North America in change of environment and sustainability, acknowledged the conflicting environmental pressures at play.\n\n“When we look at a different material, you look at all of the levers: the carbon footprint, consumer preference, energy, water,” he said. “There’s a mix, there are some things that are not that desirable, but if you have five good things and one that isn’t, we’ll all have to make decisions.\n\n“It’ll never be that clean.”\n\nSo aluminum has a larger footprint in production because of the vast power needed in the smelting process. But, in a further example of the complexities of environmental impact, the overall carbon equation becomes more muddied when other issues such as logistics are taken into account.\n\n“It’s a complex picture, certainly,” said Simon Lowden, an executive who leads Pepsi’s plastics drive. “You have to think about transport, secondary packaging, time in store, all those considerations come into play.”\n\nBecause aluminum is lightweight and cans make efficient use of space, less transport is usually needed than for plastics or glass, while less power is also needed to chill drinks in cans - particularly useful in tropical climes.\n\n“That means in some markets aluminum would actually not produce as much greenhouse gas,” Lowden said.\n\n(GRAPHIC: Carbon Footprint of Aluminum - here)\n\nRelated Coverage Factbox: Aluminum cans get boost from anger over plastic pollution\n\nGRAPHIC: Carbon Footprint of PET Bottle - here)\n\nPLASTIC STRIKES BACK\n\nBut while cans could well carve out a niche within the $19 billion-a-year bottled water industry, they are unlikely to sweep the board anytime soon, if ever, industry experts say.\n\nSimple economics is a major factor; aluminum is more expensive than plastic - the raw material cost for a can is about 25-30% higher than a PET bottle of a similar volume, according to analyst Uday Patel at consultancy Wood Mackenzie.\n\nA broad shift to aluminum cans would raise costs for drinks companies, also including new manufacturing infrastructure, some of which are likely to be passed on to consumers, thus hitting products’ competitiveness against plastic rivals.\n\nAnother key factor is consumer convenience.\n\nHow often do people down bottles of water in one go? While advances are being made in can technology, most cans are opened and stay open, while bottles can be recapped.\n\nPlastic water bottles can also be sold in a range of sizes, while cans are more limited.\n\nAs a result of such factors, drinks giants are cautious.\n\n“It’s not necessarily saying we’re pulling the plug on plastic, it’s really looking at how do consumers react to canned water,” said Coca-Cola’s Karas.\n\nIn an example of this toe-in-the-water approach, Coke is planning a limited launch of its top U.S. water brand Dasani in aluminum cans and aluminum resealable bottles later this year.\n\nEven while companies are beginning to sell water in cans, to assuage pollution concerns, they are also embarking on a green makeover for plastic. Scientific efforts include creating new compounds that are biodegradable or more easily recyclable.\n\nDanone told Reuters it was replacing some plastic with aluminum cans for its Flyte brand in Britain, Sparkles in Poland and Aqua d’or in Denmark.\n\nBut the company, which uses 400,000 tonnes of PET plastic bottles each year, is also focusing on increasing recycling of plastic and plans to use an average of 50% recycled material in its water bottles by 2025 and 100% for its Evian brand.\n\nAnd while Pepsi is testing aluminum for its Aquafina water at food service outlets, it is also introducing a plastic bottle made of 100% recycled material for another brand, LIFEWTR.\n\n“The consideration for aluminum is much higher on the list than it has been for the last few years (but) the hardest thing to change is infrastructure,” said Pepsi’s Lowden.\n\n“Hence our need to drive hard the recyclability of plastic as well as look at our mix of cans and glass.”\n\nCAN SHORTAGES\n\nAnother obstacle to a large-scale shift from plastic bottles is that there may not be enough cans to go round, at a time when some beers and wines are also switching from glass to cans.\n\nThe world’s top can maker Ball Corp (BLL.N), which supplies the likes of Coke and Pepsi, is already scrambling to add capacity to meet demand.\n\n“This is a level of growth that we haven’t seen in a long time. We’re looking at a number of speed-up projects, new can lines,” said Kathleen Pitre, chief commercial and sustainability officer for Ball’s global beverage packaging business.\n\nBall told investors it planned to add 4-5 billion additional cans of capacity by mid-2021 to its existing 105 billion, but this does not even include potential expansion in the water sector.\n\nA shift of only 1% of global soft drinks, beer and bottled water from plastic and glass to cans, would mean a surge of 24 billion more cans, said the company, the third-biggest stock gainer among the S&P 500 index .SPX over the past 12 months.\n\nSlideshow (7 Images)\n\nThat 1% change would increase aluminum demand by around 310,000 tonnes, according to Patel at Wood Mackenzie and further shifts could counter wider market weakness.\n\nMajor aluminum producers Alcoa (AA.N) and Norsk Hydro (NHY.OL) have cut estimates of global demand growth for aluminum recently, partly due to trade tensions between the United States and top metals consumer China.\n\n“You’re talking about billions and billions of water bottles, so there’s a potential revival for the aluminum can market,” said Patel. “But it’ll take three or four years to see if this is a real trend.”", "description": "Global bottled water giants are ramping up trials of easily recyclable aluminum cans to replace plastic that pollutes the world's seas. Sound like a slam-dunk for the environment? Not entirely.", "authors": ["Eric Onstad", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191017&t=2&i=1441762325&w=1200&r=LYNXMPEF9G0DA", "published_at": "2019-10-17"}