{"pub": "guardian", "url": "https://theguardian.com/environment/2019/sep/19/reef-protection-laws-pass-despite-industry-attacks-on-their-scientific-basis", "downloaded_at": "2019-09-19 09:40:11.826921+00:00", "title": "Reef protection laws pass despite industry attacks on their scientific basis", "language": "en", "text": "The Queensland government has passed new regulations to limit agricultural pollution damaging the Great Barrier Reef in the face of a hostile campaign that has sought to discredit consensus science.\n\nOn Tuesday the state made relatively minor commitments to agricultural groups, including an undertaking not to vary new limits for farm sediment and chemical runoff into reef catchments for at least five years.\n\nThe laws were passed without amendment on Thursday afternoon after a debate that oscillated between authentic concern about the impact of regulation on primary producers and hysterical attempts to discredit robust science that warns agricultural pollution is a significant threat to the health of the reef.\n\nGreat Barrier Reef expert panel says Peter Ridd misrepresenting science Read more\n\nOne Liberal National party MP, Colin Boyce, said the reef protection bill was “socialist, fake, Green-Labor climate dogma”.\n\nThe state’s environment minister, Leeanne Enoch, said some of the attacks on consensus science during the debate had been “outrageous”.\n\n“You need to work from evidence and scientific fact,” she said.\n\nEnoch told the ABC on Wednesday the reef was at risk of an endangered listing by the Unesco world heritage committee, and that the state needed to accelerate measures to improve water quality.\n\n“Two recent scientific reports released last month – the federal government’s outlook report and the water quality report card that was a joint initiative between the federal and Queensland governments – showed urgent action was needed to ensure the survival of Australia’s most treasured natural wonder,” Enoch said.\n\n“We know the two biggest threats to the reef are climate change and water quality, and the laws passed today will help improve water quality flowing to the Great Barrier Reef.”\n\nThe regulations were recommended by a 2016 water quality taskforce, and introduced by the Labor state government after progress to improve water quality stagnated.\n\nVoluntary and industry-led “best management practice” programs have been run for more than a decade. The most recent water quality report detailed a lack of progress and the relatively low takeup of those programs.\n\nThe new regulations empower government officers to access relevant farm data, such as purchase records for agricultural chemicals, to ensure farm practices are environmentally sound.\n\nSome of the state’s largest agricultural lobby groups – including AgForce, which represents grain producers and graziers, and various cane growers’ bodies – have campaigned against the regulations and at the same time actively promoted the work of the controversial academic, Peter Ridd, who has called for reef science to be reviewed.\n\nOn Tuesday the Senate backed a motion for a federal inquiry along those lines.\n\nBut while the agricultural industry broadly opposed the regulations, some parts of the sector did so while backing the science.\n\nOn Wednesday, as debate in parliament continued, the peak body for the Queensland horticulture industry, Growcom, issued a pointed statement that backed the science and the need for industry to play a role.\n\n“Some are simultaneously standing behind the science supporting the use of [the herbicide] glyphosate while also questioning the science on climate change and impacts on the Great Barrier Reef,” Growcom chief executive David Thomson said.\n\n“So to be clear, Growcom agrees with the scientific community and state and federal governments that water quality and the health of the reef is impacted in part by runoff from farms.\n\n“Where Growcom does depart from the Queensland government is how to best address it. We do not believe regulation is an effective and cost-efficient mechanism of improving runoff water quality in the horticulture industry.”\n\nSenate inquiry into Great Barrier Reef seen as bid to discredit Queensland laws Read more\n\nSome farmers with genuine concerns about the impact of the regulations have told Guardian Australia they became increasingly frustrated with the direction of the major lobby groups questioning the science.\n\nOne cane industry employee said: “We lined up against the government. That cost us our credibility, and that cost us a better deal that worked for us, and worked for the reef.”\n\nWWF Australia chief executive officer Dermot O’Gorman said the reforms would maximise the ability of the reef to recover from coral bleaching events and cyclone damage.\n\nO’Gorman said there were already “fantastic examples” of farm programs where government and private investment had helped to improve practices, but that “this approach on its own simply hasn’t delivered on the scale that the reef needs.\n\n“These regulations are necessary to ensure that all farmers and many industrial land users take the next step towards making sure their practices are safe for the reef.”\n\nShani Tager from the Australian Marine Conservation Society said clear water was essential for the reef “to give it as much resilience as possible in the face of climate change”.\n\n“Overwhelmingly we’re really happy these new laws have gone through and we can start to see some progress on cleaning up the water quality on the reef,” Tager said.\n\n“It’s been quite unfortunate that farming lobby groups have taken the approach they have to slow it down.\n\n“There’s a small number of farmers who are doing the right thing and they won’t have to change their practices at all. But this is getting everyone else up to speed, because we’ve had 10 years of voluntary programs that haven’t worked.”", "description": "Queensland’s government will limit the agricultural pollution harming the Great Barrier Reef", "authors": ["Ben Smee"], "top_image": "https://i.guim.co.uk/img/media/cca702b11215a7563807deb5fb061ea9b04ee677/0_141_4252_2552/master/4252.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=516e6cac652aa8e3c9002631561a7512", "published_at": "2019-09-19"}