{"pub": "reuters", "url": "https://widerimage.reuters.com/story/keeping-the-show-on-track-at-the-moulin-rouge-for-130-years", "downloaded_at": "2019-10-03 07:47:46.800845+00:00", "published_at": "2019-10-03", "title": "Keeping the show on track at the Moulin Rouge for 130 years", "language": "en", "text": "Advertisement\n\nThe Moulin Rouge, the French cabaret famous for its high-kicking cancan dancers and flesh-exposing ostrich feather costumes, this week marks 130 years since it first opened its doors to audiences.\n\nFor two performances every evening, 60 performers from 14 different countries twirl, kick and dance their way through the \"Feerie\" show, the review that is now the mainstay of the Moulin Rouge’s repertoire.\n\nDancer Megan changes costume as she performs in the review \"Feerie”. But backstage – unseen by the 600,000 audience members who watch the show each year and quaff their way through nearly a quarter of a million bottles of champagne – is a different kind of choreography; the sophisticated machinery of costume changes and scenery-pulling needed to make the show happen.\n\nDancer Claudine puts on her make-up before entering the stage in the review \"Feerie”. \"The whole team including dancers, aides and technicians need to be very organised,\" said Claudine Van Den Bergh, a 27-year-old Irish dancer who has been dancing at the Moulin Rouge for seven years and has been principal for three years. \"A little mistake or a little delay and you can miss your entrance. You really need to be at the right time at the right place.\"\n\nWomen work inside a workshop at Moulin Rouge. Each show requires 1,000 outfits, all crafted in the workshops that have been supplying the Moulin Rouge for decades. Each dancer has to make between 10 and 15 costume changes per show, with about 90 seconds to complete each one before they have to be back out on stage.\n\nAxelle stretches as she warms up before performing the French Cancan. Every time a number finishes out on stage, the same scenario is repeated. The troupe of dancers rushes backstage. There, the multicolored costumes, many encrusted in rhinestones, have been laid out in order by an army of assistants. Rows of pink feather boas hang from rails.\n\nDancer Lauren changes costume. Pink and black thigh-high leather boots, with sequin decoration, hang from racks. Elaborate constructions which go over the dancer’s shoulders and create the illusion they have sparkling butterfly wings and ostrich feathers sprouting from their backs, sit in rows on tables. Each dancer heads to the costume they require. While they change, technicians shift the scenery in time for the next number. The dancers are changed in an instant. Then, the troupe rush back out onstage into the glare of the footlights. Without a pause, the costume assistants backstage put away the outfits that the dancers removed, then lay out a new set of outfits so they are ready for the next costume change and the next number.\n\nClaudiu, Harry, Reece, Samantha and Claudine backstage. \"The moment I rush out to the backstage, I know exactly where to go, what to do, where my next costume is for the next part,\" said Claudine Van Den Bergh, one of the principals. The performances at the Moulin Rouge still hold true to the traditions established at the cabaret’s founding on Oct. 6, 1889, when women who made a living washing linen by day transformed themselves into dancers at night.\n\nDancers perform. One of them, La Goulue (gluttonous), flanked by her partner Valentin-le-desosse (boneless Valentin), were among dancers painted by Henri de Toulouse-Lautrec on Moulin Rouge advertising posters at the end of the 19th century. The shows featured dancers with stage names such as Nini Pattes en l’air (Nini legs in-the-air), Rayon d’or (golden ray) and La Sauterelle (Grasshopper). Nowadays, Olga, Jasmine, Claudine or Esmeralda shine on stage.\n\nA dancer performs. Critics say some aspects of the performance – especially the fact that many of the female dancers are topless or wear see-through costumes – is a sexist objectification that is out of step with modern times. To mark the Moulin Rouge’s 125th anniversary, in 2014, two activists from feminist group Femen climbed onto the theatre’s roof and shouted that women’s bodies should not be for sale.\n\nOlga Khokhlova performs.\n\nStory For Olga Khokhlova, a dancer from ex-Soviet Kazakhstan who performs a cancan solo and has been at the Moulin Rouge for 12 years, the spirit of the cabaret is timeless. \"I love the adrenaline of the stage. The Moulin is a magical place where I live out my passion,\" she said. \"When I'm on stage, I know that I am the inheritor of famous dancers who for 130 years have made the Moulin Rouge.\"", "description": "The Moulin Rouge, the French cabaret famous for its high-kicking cancan dancers and flesh-exposing ostrich feather costumes, this week marks 130 years since it first opened its doors to audiences.", "authors": ["Philippe Wojazer"], "top_image": "https://photos.wi.gcs.trstatic.net/WBTnOVC7qqta06gXHeKsQ7MUGAxS9LpFjjUiGt8rQ3k0v6dRqludR59zfI-T9ftT_BQ2BvhNYsnJKkzAmSa4T-5_9D8odxHSunTTnxTuDX5Hqa5n4IvxYQuMSeRtYGPp"}