{"pub": "cnbc", "url": "https://cnbc.com/2019/10/02/a-key-number-on-thursday-will-reveal-whether-the-economic-slowdown-is-spreading.html", "downloaded_at": "2019-10-03 07:22:44.652166+00:00", "published_at": "2019-10-02", "title": "A key number on Thursday will reveal whether the economic slowdown is spreading", "language": "en", "text": "Dan Dalton | Getty Images\n\nSo far, businesses in the services sector have been growing at a decent pace and withstanding the headwinds that have hit manufacturing. Economists expect that services remained strong in September but at a slightly slower pace than in August. The next reading to gauge the progress of that sector is Thursday's 10 a.m. ET release of the September ISM nonmanufacturing index. According to Dow Jones, the consensus forecast is 55.3, a number that shows a healthy rate of expansion though that would be down from August's 56.4.\n\nAnything above 50 shows expansion. Earlier this week, ISM U.S. manufacturing purchasing managers' index dropped to a surprising 47.8 for September, the second month of contraction, and a decade low. Following that report, ADP's private sector payroll data Wednesday was slightly softer than some expected at 135,000 and included revisions that cut 38,000 from August's payrolls report. \"If for some reason, [ISM services] drops to 52, 53, anything that's below consensus ... that would raise the concern that services output is beginning to slow as well, and you'd get that same picture if employment is weak as well,\" said Michael Gapen, chief U.S. economist at Barclays. The big report for the week comes Friday, when the monthly employment report is released, and it is expected to show 145,000 jobs were added in September, according to Dow Jones. Both reports are being watched closely after Tuesday's shockingly weak ISM manufacturing report set off new fears that a manufacturing recession could spill into the broader economy. That sent stocks reeling and bond yields lower. The Dow was down as much as 598 points Wednesday, after a 343-point decline Tuesday. \"So far at least, the ISM services sector seems to be holding up pretty well, which is really important. It's basically 85% of the U.S. economy,\" said Ward McCarthy, chief financial economist at Jefferies. \"The decline in manufacturing has been ongoing since the beginning of the trade war and has been exacerbated by the Boeing 737 Max problems and now the GM strike.\" As stocks sold off, the fed funds futures market began to indicate a greater chance of a Fed rate cut for the Oct. 29 and 30 meeting. Before ISM manufacturing, the odds for a quarter-point cut were about 40%, but they have since shot up more than 75%. Gapen said a first big warning sign about the consumer, which has been propping up the economy, came Friday when the personal consumption and spending data showed consumer spending slowed in August, Household spending edged up just 0.1%, compared with growth in the first seven months of the year which averaged 0.5% a month.", "description": "So far, the businesses in the services sector have been growing at a decent pace and withstanding the headwinds that have hit manufacturing.", "authors": ["Patti Domm", "In"], "top_image": "https://image.cnbcfm.com/api/v1/image/103229294-GettyImages-525441251.jpg?v=1537216240"}