{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/2019/10/08/impeachment-donald-trump-say-no-evidence-nancy-pelosi-until-things-improve/3911234002", "downloaded_at": "2019-10-09 00:47:34.653283+00:00", "title": "Donald Trump to Nancy Pelosi: No cooperation in 'partisan' impeachment investigation", "language": "en", "text": "CLOSE Whistleblowers have been at time essential and detrimental to a country's democracy, but what makes them different than a leaker? We explain. Just the FAQs, USA TODAY\n\nWASHINGTON – The White House will not provide documents or witnesses to House impeachment investigators because it considers their investigation to be unfair and illegitimate, President Donald Trump and his team told House Speaker Nancy Pelosi and other Democratic leaders Tuesday.\n\n\"You have designed and implemented your inquiry in a manner that violates fundamental fairness and constitutionally mandated due process,\" White House Counsel Pat Cipollone wrote in a blistering eight-page letter to Pelosi and the chairmen of three key House committees.\n\n\"President Trump cannot permit his Administration to participate in this partisan inquiry under these circumstances,\" Cipollone added.\n\nHouse Democrats have said Trump is using the absence of a vote as an excuse to refuse to cooperate with investigators. Some said Trump's refusal to answer subpoenas and provide documents could constitute an impeachable offense in and of itself as they investigate the president's dealings with Ukraine.\n\nMimi Rocah, a former federal prosecutor, questioned the thrust of Cipollone’s argument – that the president wouldn’t take part because he doesn’t agree with the process.\n\n“This is political propaganda,” Rocah said, “not real legal arguments.\"\n\nIn this 2017 photo, then-President-elect Donald Trump greets House Democratic leader Nancy Pelosi. (Photo: J. Scott Applewhite, AP)\n\nJust before the White House release, Pelosi sent House colleagues a letter protesting Trump's actions, saying the president \"is obstructing justice, abusing power and diminishing the office of the presidency.\"\n\nRep. Adam Schiff, a California Democrat, chairman of the House Intelligence Committee and one of the recipients of the letter, tweeted that Trump's argument boiled down to the idea that the White House would only take part in the investigations on its terms.\n\n\"They mean: the president is above the law,\" Schiff argued. \"The Constitution says otherwise.\"\n\nMore: Jimmy Carter: Trump shouldn't 'stonewall' Congress during impeachment inquiry\n\nMore: Lindsey Graham wants Rudy Giuliani to testify before Senate Judiciary on Ukraine corruption findings\n\nOther Democrats scoffed at Trump's objections, and indicated they may go to court to try and enforce subpoenas and document requests.\n\n\"Let's say it again, all together, for the slower learners: The President doesn’t get to dictate how Congress investigates him,\" tweeted Rep. Eric Swalwell, D-Calif.\n\nLet’s say it again, all together, for the slower learners:\n\n🚨The President doesn’t get to dictate how Congress investigates him.🚨 — Eric Swalwell (@ericswalwell) October 8, 2019\n\nIn his letter, Cipollone described as a number of irregularities in the investigation, slamming Democrats for not allowing the administration to cross-examine witnesses, receive transcripts of testimony or have access to evidence. The process used by the Democrats, Cipollone argued, is an overreach of congressional authority.\n\nEchoing political arguments Trump has made on the campaign trail, Cipollone accused the Democrats of seeking \"to overturn the results of the 2016 election and deprive the American people of the President they have freely chosen.\"\n\nHe added: “Many Democrats now apparently view impeachment not only as a means to undo the democratic results of the last election, but as a strategy to influence the next election, which is barely more than a year away.”\n\nThe president, Cipollone wrote, \"cannot allow your constitutionally illegitimate proceedings to distract him and those in the Executive Branch from their work on behalf of the American people.\"\n\nIn discussing the letter last week, officials said Trump might demand a full House vote to authorize the impeachment inquiry. The letter itself stopped short of such a demand, but did protest the absence of a full vote as one of the unfair things about the letter.\n\nPelosi has not ruled out a full House vote, telling the Atlanta Journal Constitution editorial board last week: “If we want to do it, we’ll do it. If we don’t, we don’t. But we’re certainly not going to do it because of the president.\"\n\nThe White House released the letter hours after it acted to prevent a key witness from providing testimony to House members. Gordon D. Sondland, the United States ambassador to the European Union, had dealings with Ukraine as Trump asked it to investigate U.S. political opponent Joe Biden.\n\nHouse Democratic investigators subpoenaed Sondland minutes after the White House letter.\n\nDefending his decision to block Sondland's testimony, Trump tweeted that he \"would be testifying before a totally compromised kangaroo court, where Republican’s rights have been taken away.\"\n\nMore: Merriam-Webster defines \"kangaroo court\" after GOP uses it as impeachment defense\n\nHow did we get here\n\nThe investigation revolves around Trump's request that the government of Ukraine investigate Biden and his son Hunter Biden, who had business interests in Ukraine. House Democrats have cited evidence that Trump withheld U.S. aid from Ukraine until it agreed to investigate Biden, effectively injecting the issue into the 2020 U.S. presidential campaign.\n\nMore: Read the summary of President Trump's call with Ukraine president about Biden\n\nTrump is also under criticism for asking China to investigate Biden and his son, who also had business dealings in that country. Chinese officials have rejected Trump's request.\n\nBiden has said Trump is asking foreign countries to dig up dirt because he fears the former vice president will defeat him in 2020.\n\nThe White House letter sent Tuesday underscores the political pressures surrounding impeachment.\n\nWhite House and Republican officials have said they want to get all House members on the record about whether they favor an impeachment investigation, particularly Democrats who represent districts carried by Trump in 2016.\n\nRepublicans also question whether Pelosi and the Democratic leadership could get their impeachment inquiry authorized by the full House.\n\nPelosi has repeatedly said that committees are free to conduct their own impeachment investigation, and \"there's no requirement that there be a floor vote.\"\n\nThe investigation began after a whistleblower complained about a Trump phone call with Ukrainian President Volodymyr Zelensky in which Trump asked to have the government in Kiev investigate Biden.\n\nA group of House committee chairmen released text messages from diplomats describing an effort to lobby Zelensky into a public pledge to take up the investigation in exchange for the nearly $400 million in aid as well as a private meeting with Trump.\n\nTrump has denied wrongdoing, and described the impeachment drive as a \"coup\" designed to drive him from office.\n\nThe administration's letter to Pelosi echoed a request made last week by House Republican leader Kevin McCarthy, R-Calif.\n\nCriticizing \"the swiftness and recklessness\" of the impeachment drive, McCarthy asked Pelosi if Republicans would be let into the process and if administration lawyers could cross-examine witnesses.\n\n\"Unfortunately, you have given no clear indication as to how your impeachment inquiry will proceed – including whether key historical precedents or basic standards of due process will be observed,” McCarthy said in his letter.\n\nIn replying to McCarthy, Pelosi said the majority is proceeding under authority it already has.\n\n“There is no requirement under the Constitution, under House Rules, or House precedent that the whole House vote before proceeding with an impeachment inquiry,\" Pelosi said in a letter to the House Republican leader.\n\nIn discussing the letter last week, Trump demurred when asked if he would ever comply with subpoenas.\n\n“That’s up to the lawyers,” he said, adding that his lawyers have never seen something “so unfair.”\n\nIn her letter to colleagues on Tuesday, Pelosi said: “President Trump must know that no one is above the law. The president will be held accountable. When it comes to impeachment, it is just about the facts and the Constitution.”\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/2019/10/08/impeachment-donald-trump-say-no-evidence-nancy-pelosi-until-things-improve/3911234002/", "description": "Speaker Nancy Pelosi has accused Donald Trump of seeking to stonewall the impeachment inquiry into the president's dealings with Ukraine.", "authors": ["David Jackson", "John Fritze", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/08/USAT/08dea9ea-67fb-4444-b479-e27bd21a5429-AP_Election_2018.JPG?crop=4672,2628,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-08"}