{"pub": "investingcom", "url": "https://ng.investing.com/news/commodities-news/update-1oil-prices-climb-as-positive-china-factory-data-eases-demand-concerns-58706", "downloaded_at": "2019-09-30 04:06:44.036526+00:00", "title": "UPDATE 1-Oil prices climb as positive China factory data eases demand concerns", "language": "en", "text": "© Reuters. UPDATE 1-Oil prices climb as positive China factory data eases demand concerns\n\n* China's factories ramp up activity in Sept - Caixin PMI\n\n* Saudi prince warns of oil price spike if world does not\n\ndeter\n\n* Yemen's Houthis say it attacked Saudi border frontline\n\n(Recasts, adds comments, updates prices)\n\nBy Florence Tan\n\nSINGAPORE, Sept 30 (Reuters) - Oil prices edged up on Monday\n\nafter China's factories unexpectedly ramped up production in\n\nSeptember, easing concerns about demand at the world's largest\n\ncrude importer amid an ongoing trade war with the United States.\n\nBrent crude futures rose 9 cents to $62 a barrel by\n\n0300 GMT while U.S. West Texas Intermediate (WTI) crude\n\nfutures rose 13 cents to $56.04 a barrel.\n\nThe Caixin/Markit Manufacturing Purchasing Managers' Index\n\n(PMI) for September expanded for a second straight month as\n\nChinese factories ramped up production and new orders rose,\n\nbeating market expectations. \"The Caixin data was a real surprise and should be positive\n\nfor Asia's markets today,\" said Jeffrey Halley, OANDA senior\n\nanalyst in Singapore.\n\nHe added that the data would need to post similar results\n\nover the next few months to point to a China oil demand growth\n\nrecovery. The country is the world's second largest oil user.\n\nBrent is set to rise 2.6% in September, its first monthly\n\ngain since June, with prices lifted by an unprecedented attack\n\non Saudi's oil facilities on Sept. 14 that reduced its\n\nproduction by half. WTI is set to rise 1.7% this month. .\n\nWorld's top oil exporter Saudi Arabia has restored capacity\n\nto 11.3 million barrels per day, sources told Reuters last week\n\nalthough Saudi Aramco has yet to confirm it is fully back\n\nonline. \"Most of this is already priced in when the Saudis said they\n\nwere going to do it (resume production) fast,\" said Avtar Sandu,\n\na senior commodities manager at Phillip Futures in Singapore.\n\nWhile Saudi Arabia is maintaining exports by using crude\n\nfrom inventories and spare production capacity, how much of it\n\nis actually restored could only be determined in the next few\n\nweeks, he added.\n\nStill, geopolitical tensions in the Middle East simmered\n\nafter Saudi Arabia's crown prince warned in an interview\n\nbroadcast on Sunday that oil prices could spike to \"unimaginably\n\nhigh numbers\" if the world does not come together to deter Iran,\n\nbut said he would prefer a political solution to a military one.\n\nThis came a day after Yemen's Houthi movement said it had\n\ncarried out a major attack near the border with the southern\n\nSaudi region of Najran and captured many troops and vehicles,\n\nbut there was no immediate confirmation from Saudi Arabian\n\nauthorities.", "description": "UPDATE 1-Oil prices climb as positive China factory data eases demand concerns", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB8015J_L.jpg", "published_at": "2019-09-30"}