{"pub": "fox", "url": "https://foxnews.com/entertainment/michael-moore-suggests-elizabeth-warren-doesnt-believe-shes-a-self-described-capitalist", "downloaded_at": "2019-09-14 05:27:28.485696+00:00", "title": "Michael Moore says he doubts Elizabeth Warren really considers herself a 'capitalist'", "language": "en", "text": "Liberal filmmaker Michael Moore said Friday night that Sen. Elizabeth Warren, D-Mass., probably doesn't really consider herself a capitalist, despite the senator's past claim of being one.\n\nMoore made the comments on \"Real Time with Bill Maher,\" after the host suggested \"capitalism plus\" was a better term than \"socialism\" for Warren's platform.\n\n\"Elizabeth Warren says she's a capitalist,\" Maher said to Moore. \"Are you not OK with Elizabeth Warren not being far enough for the left?\"\n\nMICHAEL MOORE WARNS DEMS 'PROFESSIONAL POLITICIAN' CAN'T BEAT TRUMP: 'I LOVE JOE BIDEN... BUT WE GOTTA WIN'\n\n\"I'm not so sure she believes that,\" Moore responded.\n\n\"So she's a liar?,\" Maher reacted, joking that his next film would be titled, \"'Warren is a Liar: Michael Moore.'\"\n\n\"No, no,\" Moore clarified. \"She's taking a cue from you, which is you've got to tone it down because people are gonna be nervous.\"\n\nThe \"Fahrenheit 9/11\" director went on to claim that \"old capitalism is gone\" and that \"new capitalism is a cruel and evil system\" that can't be fixed.\n\n\"To me, socialism means everybody has a seat at the table and everybody gets a slice of the pie,\" Moore continued. \"We have to believe in that if it's a democracy. Everybody has to participate.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nMoore also warned that if the election were next Tuesday, President Trump \"would win.\"\n\n\"You have to respect the evil genius of this guy and how he gets away with every f---ing thing!\" Moore exclaimed.", "description": "Liberal filmmaker Michael Moore suggested on Friday night, that Sen. Elizabeth Warren, D-Mass., doesn't actually believe that she is, as she has previously described herself, a capitalist.", "authors": ["Joseph Wulfsohn", "Joseph A. Wulfsohn Is A Media Reporter For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/ContentBroker_contentid-a0539429b59b49cd896cb64abaee1698.png", "published_at": "2019-09-14"}