{"pub": "independent", "url": "https://independent.co.uk/sport/football/live/everton-manchester-city-live-stream-latest-score-goals-updates-watch-video-tv-channel-prediction-a9124526.html", "downloaded_at": "2019-09-28 21:36:48.768722+00:00", "title": "Everton vs Manchester City: Five things we learned as Riyad Mahrez and Raheem Sterling earn win", "language": "en", "text": "City remain composed for important three points\n\nEven for a side with the quality of Manchester City, three points do not always come easy. For long periods of this valuable win at Goodison Park, it seemed as if the reigning Premier League champions could fail to win for the third time in eight league games, handing a significant advantage to the contenders and pace-setters across Stanley Park.\n\nGabriel Jesus’ opener was cancelled out by Dominic Calvert-Lewin. But Pep Guardiola’s remain composed and eventually profited through the excellent Riyad Mahrez and the otherwise-wasteful Raheem Sterling. Jordan Pickford’s role in both goals will be questioned. The result continues Everton’s disappointing run of form, but City will only care that the gap at the top remains five points.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nFourth defeat in five does little to help Silva\n\nThe reigning Premier League are the last team that any manager wants to see roll into town, but particularly when you and your players were booed off the pitch the previous weekend. A heavy defeat would only have increased the pressure on Marco Silva after last weekend’s defeat to Sheffield United.\n\nHe was not even the master of his own technical area at times, with Guardiola once needing to apologise for straying into his counterpart’s space. This was a much-improved performance from the one which preceded it, and Everton had opportunities to make sure they earned a positive result, but a fourth defeat in five games does little to help Silva's cause.\n\nShape Created with Sketch. Player ratings: Everton vs Man City Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Player ratings: Everton vs Man City 1/22 Jordan Pickford - 4 Getty Images 2/22 Seamus Coleman - 7 Everton FC via Getty Images 3/22 Michael Keane - 6 REUTERS 4/22 Yerry Mina - 6 Getty Images 5/22 Lucas Digne - 6 Manchester City FC via Getty Ima 6/22 Morgan Schneiderlin - 5 REUTERS 7/22 Fabian Delph - 7 EPA 8/22 Alex Iwobi - 8 Getty Images 9/22 Gylfi Sigurdsson - 7 Everton FC via Getty Images 10/22 Richarlison - 8 Everton FC via Getty Images 11/22 Dominic Calvert-Lewin - 8 Getty Images 12/22 Ederson - 8 Action Images via Reuters 13/22 Kyle Walker - 6 Manchester City FC via Getty Ima 14/22 Nicolas Otamendi - 6 REUTERS 15/22 Fernandinho - 5 Action Images via Reuters 16/22 Oleksandr Zinchenko - 6 REUTERS 17/22 Rodri - 6 Action Images via Reuters 18/22 Illkay Gundogan - 5 Getty Images 19/22 Kevin De Bruyne - 8 Getty Images 20/22 Raheem Sterling - 7 Action Images via Reuters 21/22 Gabriel Jesus - 7 Getty Images 22/22 Riyad Mahrez - 9 Manchester City FC via Getty Ima 1/22 Jordan Pickford - 4 Getty Images 2/22 Seamus Coleman - 7 Everton FC via Getty Images 3/22 Michael Keane - 6 REUTERS 4/22 Yerry Mina - 6 Getty Images 5/22 Lucas Digne - 6 Manchester City FC via Getty Ima 6/22 Morgan Schneiderlin - 5 REUTERS 7/22 Fabian Delph - 7 EPA 8/22 Alex Iwobi - 8 Getty Images 9/22 Gylfi Sigurdsson - 7 Everton FC via Getty Images 10/22 Richarlison - 8 Everton FC via Getty Images 11/22 Dominic Calvert-Lewin - 8 Getty Images 12/22 Ederson - 8 Action Images via Reuters 13/22 Kyle Walker - 6 Manchester City FC via Getty Ima 14/22 Nicolas Otamendi - 6 REUTERS 15/22 Fernandinho - 5 Action Images via Reuters 16/22 Oleksandr Zinchenko - 6 REUTERS 17/22 Rodri - 6 Action Images via Reuters 18/22 Illkay Gundogan - 5 Getty Images 19/22 Kevin De Bruyne - 8 Getty Images 20/22 Raheem Sterling - 7 Action Images via Reuters 21/22 Gabriel Jesus - 7 Getty Images 22/22 Riyad Mahrez - 9 Manchester City FC via Getty Ima\n\nDe Bruyne finding the channel without fail\n\nAnother week, another assist for Kevin De Bruyne in the inside-right channel. It was his eighth of the season. The record, Thierry Henry’s 20 in 02-03, already seems in sight. And just like Tottenham and Watford before them, Everton could not stop De Bruyne finding a pocket of space and sweeping the ball to the far post.\n\nIt is, in a way, predictable. De Bruyne is constantly looking to take up this specific position, sure that his supreme crossing ability can overcome even the most organised defence. You know what is coming next, but can do next to nothing about it.\n\nFernandinho fumbles in defence\n\nThere was considerable concern about City’s defence after the defeat at Norwich, and even more when John Stones joined Aymeric Laporte in the treatment room. Fernandinho then stepped in at Shakhtar Donetsk and two clean sheets followed. Suddenly, calm was restored.\n\nYet Everton’s equaliser was a reminder that he is a holding midfielder playing in an unfamiliar position. His botched clearance, straight into Alex Iwobi’s feet, could have proved to be a costly moment’s hesitation. Meanwhile, City’s midfield failed to press the ball without him at the base. He is filling a gap, but perhaps not the cure-all to City’s injury issues.\n\nCalvert-Lewin makes most of what he has\n\nSilva’s Everton are an odd team: playing with a target man but surrounding him with tricky, intricate technicians. The idea, it would seem, is that Dominic Calvert-Lewin knocks the ball down to feed those around him. And even though he is not well catered for, he is increasingly carrying a goal threat of his own.\n\nCalvert-Lewin has to take anything he can get in a team not set up to make the most of his attributes, hence why he so eagerly stole Everton’s equaliser from Seamus Coleman. It was the first time he has scored in consecutive Premier League games, but also his fourth goal in three starts. And he should perhaps have had another, when denied by Ederson shortly after Mahrez’s winner.", "description": "City remain composed for important three points Even for a side with the quality of Manchester City, three points do not always come easy. For long periods of this valuable win at Goodison Park, it seemed as if the reigning Premier League champions could fail to win for the third time in eight league games, handing a significant advantage to the contenders and pace-setters", "authors": ["Mark Critchley"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/28/19/raheem-sterling.jpg", "published_at": "2019-09-28"}