{"pub": "usatoday", "url": "https://usatoday.com/story/money/usaandmain/2019/10/16/culture-wars-impeachment-talk-can-compromise-small-business/3990938002", "downloaded_at": "2019-10-16 13:58:43.777558+00:00", "title": "Entrepreneurial politics: Trump, impeachment talk and your small business", "language": "en", "text": "CLOSE John Dean, a star witness during Watergate who helped bring down the Nixon presidency, testifies that special counsel Robert Mueller left Congress with a \"road map\" for investigating President Donald Trump. (June 10) AP\n\nNot long ago, I was researching a business I might work with next year. Diving into the morass that is social media, I somehow ended up on the personal Facebook page of the CEO.\n\nAnd there it was.\n\nA picture of him, smiling next to a giant Marlin he had just caught in Florida and wearing a bright red cap that said,\n\n“Make America Great Again.”\n\nNow, a lot can be said about that, most of which I won’t say because simply mentioning Trump’s name in this column gets me in trouble with some readers. But it does serve as an important reminder that during this era of sharply divided loyalties and politics, you need to not only be extremely cautious when it comes to mixing business and politics, but also, you better double-check your privacy settings.\n\nMore importantly, you need to be very sure that it is good for you, your business and your brand to wade into the political and culture wars of our day. Somehow, with impeachment looming, the divide and the noise is only going to get louder and more pronounced (if that is even possible).\n\nNow, if you are sane, you are likely thinking that politics and small business don’t mix, and obviously I agree. People buy from you because they like your products, or your prices, or your brand, or whatever, but it’s very likely that it is not because you have a hot take on Nancy Pelosi and the Democrats.\n\nSharing whatever it is you think – no matter how smart or well-reasoned – has more potential to do harm than good right now, you may be thinking. And anyway, if you haven’t noticed, reasoning is not held in high regard today.\n\nIn front of the U.S. Capitol on Sept. 26, 2019. (Photo: Adrew Caballero-Reynolds/AFP/Getty Images)\n\nAnd yet, you and I may be wrong.\n\nAccording to Forbes, a recent survey of U.S. consumers found that\n\n• 66% wanted brands to “to engage in social and political issues”\n\n• For those ages 18-34, a whopping 73% wanted brands to speak up\n\nSo, is that the answer? Of course not. The other shoe must drop:\n\n• While 52% said that they would show more loyalty if they agreed with a brand’s position, 53% said they would show less if they disagreed with the brand’s position.\n\nMore: Some small-business owners have toxic bosses to thank for their independence\n\nMore: Every small business is a brand: Make yours stand out\n\nMore: Wisconsin's Penzeys Spices raises $435,000 for Trump impeachment ads\n\nSo whether it's vocal employees, or passionate customers, or vocal millennials, there is a lot of pressure these days on businesses to take a stand.\n\nWhat to do? How can you take a stand in an era of highly partisan politics? The smart money is on picking the right battles.\n\nSupporting impeachment, opposing impeachment, whatever, is simply too risky. The possibility of angering your customers is too high.\n\nA better strategy, if you want to get involved in the issues of the day, is to choose to support a cause you believe in which would also resonate with your customers. Indeed, choosing an issue that aligns with the values of your business can actually help reinforce your brand.\n\nFor example, boat charter businesses might want to champion environmental causes and ocean cleanup.\n\nDick’s Sporting Goods recently stopped selling assault-style rifles to anyone under 21, and in fact, destroyed $5 million worth of rifles because, according to CEO Ed Stack, “If we really think these things should be off the street, then we need to destroy them.”\n\nBut what if you feel so passionate about something controversial that you simply have to speak up? In that case, I suggest doing what a pal of mine did. She created a new incognito Twitter account and uses it to rail against the other political team.\n\nAnd no one knows that she owns the cafe down the street.\n\nSteve Strauss is an attorney, popular speaker and the bestselling author of 17 books, including \"The Small Business Bible.\" You can learn more about Steve at MrAllBiz.com, get even more tips at his site TheSelfEmployed, and Connect with him on Twitter at @SteveStrauss and on Facebook at TheSelfEmployed.\n\nRead or Share this story: https://www.usatoday.com/story/money/usaandmain/2019/10/16/culture-wars-impeachment-talk-can-compromise-small-business/3990938002/", "description": "If you are going to mix politics with your small business, make sure you are prepared to weather any customer fallout.", "authors": ["Steve Strauss", "Special To Usa Today", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/13/USAT/4b7293d6-68cb-4a9f-aba5-312c816145b4-impeach.ourview.jpg?crop=5559,3127,x0,y369&width=3200&height=1680&fit=bounds", "published_at": "2019-10-16"}