{"pub": "townhall", "title": "Western Dealings With Iran Must Recognize The Extent Of Terrorist Threats", "url": "https://townhall.com/columnists/kenblackwell/2019/09/02/western-dealings-with-iran-must-recognize-the-extent-of-terrorist-threats-n2552483", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 07:18:52.724618+00:00", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nThe Iranian regime has been virtually and universally described as the world’s foremost state-sponsor of terrorism. Yet this does not mean that all those who have a role in shaping policy toward the regime, factor in the threat accordingly. Last year, multiple terrorist threats on European soil were neutralized.\n\nThis was certainly the case in France, where an opposition rally organized by Iranian expatriates was targeted in June 2018.\n\nAt Villepinte, just outside Paris, the Free Iran rally brought together an estimated 100,000 advocates for Iranian democracy, under the banner of the National Council of Resistance of Iran. It also nearly attracted two aspiring bombers, who were fortunately stopped on their way to the gathering on June 30, 2018. Shortly thereafter, a senior Iranian \"diplomat\" named Assadollah Assadi was also arrested and identified as the mastermind of the plot. He had been stationed at the embassy in Vienna but was taken into custody after traveling to Germany, where he could not claim diplomatic immunity.\n\nThe operation leading to these arrests was a testament to European authorities’ awareness of the persistent threat emanating from Tehran. A subsequent investigation by French intelligence left no doubt about the fact that Assadi and his Iranian-Belgian assets were acting upon orders from the highest ranks of the regime.\n\nBut security agencies were no doubt already on their guard against such orders, since the Paris plot was not one of a kind. About three months earlier, Iranian operatives had also tried to attack a compound in Albania which houses 3,000 members of the People’s Mojahedin Organization of Iran (MEK), the main constituent group in the NCRI coalition.\n\nThe French and Albania plots were only two of at least six that were publicly exposed over the course of 2018. But of all the countries where Tehran sought to carry out bombings or assassinations, only the United States seems to have responded in a meaningful fashion.\n\nThe EU only saw fit to impose limited sanctions on the Iranian secret service and a handful of its known agents. But even this gesture was ultimately undermined by a broader European strategy that involves the continuation of conciliatory policies for dealing with the regime.\n\nAccording a report published by Le Monde on July 31, French authorities ordered their own intelligence chiefs to avoid bringing attention to the previous year’s terror plot for political considerations.\n\nAssadi is by no means the only such diplomat to be connected to the mullahs' terrorism. In fact, his arrest prompted a spokesperson for the Belgian police to affirm that almost all Iranian diplomats play a role in the Iranian secret service. This makes them probable terrorist operatives, working under the direction of the Foreign Ministry.\n\nAnd if the Belgian authorities’ testimony on this matter is not convincing enough, it should be noted that even Iranian officials have pointed to the intimate connections between paramilitary and diplomatic entities within the regime. In a recent interview with Iranian state media, Deputy Foreign Minister Abbas Araqchi declared that the Foreign Ministry, the Islamic Revolutionary Guard Corps (IRGC), and the Ministry of Intelligence and Security all pursue the same objectives.\n\nThis goes to show that even the United States could do more to address Iranian terrorism and its multiple outlets for reaching Western targets. Comprehensive sanctions on the IRGC were a long time coming, but now they should be extended to also include the entire Ministry of Intelligence and the entire Foreign Ministry, rather than just Mohammad-Javad Zarif, the regime's foreign minister.\n\nBombings, assassinations, and hostage-taking are all part of the Iranian regime’s DNA, and no major government institution can be thought of as isolated from the use of terrorism as a form of statecraft. So the only way to fully address the relevant threat is by isolating the regime as a whole, pending a far-reaching change in its behavior or its imminent collapse.\n\nIf the U.S. hasn’t gone far enough toward this goal, then the nations of Europe have even more ground to make up. In the wake of last year’s thwarted terror plots, an appropriate policy would involve dramatically expanding economic sanctions as well as expelling Iranian diplomats. But in the case of France and certain other EU member states, such a strategy cannot realistically be adopted until those nations’ leaders recognize the fact that much of the world is facing persistent danger from the Iranian regime's undiminished malign activities.\n\nKen Blackwell is the former U.S. Ambassador to the United Nations Human Rights Commission.", "description": "The Iranian regime has been virtually and universally described as .09/02/2019 3:17:45AM EST.", "authors": ["Ken Blackwell", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/233/ce482cc3-e9d5-499c-8624-5977d1b94aa9.png"}