{"pub": "nymag", "url": "https://vulture.com/2019/10/rosa-salazar-undone-interview-ending.html", "downloaded_at": "2019-10-02 00:35:44.488627+00:00", "title": "Rosa Salazar Has No Answers About Undone and Likes It That Way", "language": "en", "text": "Photo: JC Olivera/WireImage\n\nIf you’ve just finished watching the first season of Amazon’s remarkable new series Undone, you probably have some questions. But if you’re looking for the big secret that will unlock the solution to the show’s lingering mysteries, you won’t get it from star Rosa Salazar. “I will offer no answers,” she warns me, laughing, at the top of our conversation.\n\nUndone fires on all cylinders, but you can imagine how the whole show could have failed without Salazar’s stunning lead performance to pull it all together. Salazar plays Alma Winograd-Diaz, who, in the wake of a near-fatal car accident, may or may not have developed the ability to travel through time. Between the unusual filming process required for the series’ rotoscope animation, the complexity of both the main character and the plot, and the fact that Salazar appears in the vast majority of the show’s scenes, Undone would have presented a considerable challenge for any actor. Somehow, in an eight-episode first season that’s both narratively intricate and heartbreakingly human, Salazar never puts a foot wrong.\n\nHer first encounter with Undone was, appropriately enough, a little magical. She was meeting with casting director Linda Lamontagne about an entirely different project when Lamontagne brought up Undone out of the blue. “She opens this secret drawer and says, ‘Read this, right now, in front of me,’” Salazar recalls. “And reading it cold — oh man, I was holding back tears. Even the first time I read it. It just felt like the universe or the powers that be just handed it to me. I couldn’t believe it. I left her office shaking my head, like I lived through a dream.”\n\nFortunately, despite her initial teasing, Salazar was willing to share her candid thoughts on Undone’s fascinating characters, twisty plot, and ambiguous ending — and even hint at places where viewers who are desperate for closure might find some answers.\n\n[Spoilers for Undone below.]\n\nFor this show, it feels right to start by going back to the beginning. What do you remember about your first meeting with [Undone co-creators] Kate Purdy and Raphael Bob-Waksberg?\n\nWe had a two-and-a-half-hour conversation: our experiences with mental health, our own questions. They walked me through the character’s journey, the journey of the show. It was sort of like a therapeutic session because Kate shared her inspiration for making the show, which was her own experience with mental illness and her own breakup and her grandmother actually being diagnosed with schizophrenia.\n\nI am a huge BoJack Horseman fan, so I already knew [Bob-Waksberg’s] writing and where he was coming from. He loves to investigate the dark side of life and how it coincides with the humorous side of life. And that’s exactly where I stem from. I know for a fact that comedy and tragedy are one.\n\nAnd they showed me a test they did, and I was so floored by the test itself. It was done in rotoscope — and by the very people that did my favorite movie, Waking Life, which I watched millions of times in my formative life. And I thought, Rotoscope, wow, this is the only way to do this show. It keeps the audience wondering, Are we in a dream, or are we in reality? And that’s where we wanted them to be.\n\nWhat was the filming process like — just the cast in a big empty room?\n\nIt’s wonderful. It’s also extremely challenging. I’ve never put that much of myself — physically, mentally, spiritually — into another project, ever. You would assume that something like Alita: Battle Angel would be an even bigger undertaking with the performance-capture suits and the gadgets that are strapped to me and the helmet and the whole tech side of things added to your normal process. But that was a much larger beast and a much slower-moving beast, so there was a lot of downtime. Undone is TV, so that always moves pretty fast. But it was so stripped down because of the rotoscope process. There are no light changes; everything is lit very harshly from above so you can get every nuance and shadow and line on the faces and the bodies and the clothes. It was like performing in a black-box theater. You have a bar scene? “Here’s a high table and two stools and two cups. There you go, there’s your bar.” Okay, done with the bar scene! “Time for the bedroom scene. Wheel in the bed!”\n\nIt’s so stripped down that it moves so incredibly fast, and we shot so many pages a day. But what I loved about that is that it keeps you in the moment. And because there’s so much less to interact with, the moment is everything. For an actor, that turned me on so much, and it gave me this momentum that you just never have on other sets, which can be like, “Okay, we got your coverage. That’s lunch. See you in an hour and a half, and we’ll do the other half of this scene.”\n\nThis was nothing like that. It was “We’ll do the scene three or four times. Two or three times. Maybe one time. And then we’ll move on.”\n\nWhen you’re performing lengthy scenes in a mostly empty room, do you have a sense of how, say, the room will look when it’s animated? Or are the animators figuring that out once they’ve seen the footage?\n\n[Director Hisko Hulsing] had this incredibly large binder of every single frame of the show, hand-drawn by him. He would come over and say, “Don’t step there, because that’s a piano. Don’t walk over there, because that’s going through a wall.”\n\nLet’s talk about the specific boundaries of Alma’s ability, which seems to be almost limitless at times.\n\nWell … does she have an ability?\n\nWhat do you think?\n\nI never answered that question for myself. I couldn’t. And if I had, it wouldn’t have worked. For every scene, I had to walk through the script and go, Okay. What are the multiple solutions for this? I had multiple outs for every scene, where I could go, If I play it this way, am I tipping my hand too much in one direction? And sometimes you want to tip it a little more, and sometimes you want to reserve it. But you always want to be in the fluctuating space of that question. The desire for answers. And the silence that follows.\n\nThat’s certainly the feeling that hangs in the air after the season finale.\n\nMy answer to that is going to be very disappointing, which is: There is no answer. But I would also pose this to you: Is there anything more disappointing than actually having an answer?\n\nI have a tendency to go on a rant when it comes to this question because it’s sort of open to interpretation. That’s the last scene of the last episode, which is sort of a Rorschach test for your beliefs. If you choose the mental-illness route, Alma is deteriorating and all of her relationships are falling apart and she’s burning it all down. And perhaps that is mental illness gaining its strength. Or, as her power really is strengthening, she is becoming unglued to the reality that everyone else believes to be true. And she is committing to her power but pushing away the people closest to her, who have no insight into her ability, because they don’t share it.\n\nIt’s a multipronged answer, and there are probably a few more prongs than that. But for every single scene, I was looking at it and saying, Okay, what is the magic of this? And how would you and I — people who are not, potentially, schizophrenic — how would we see this?\n\nBut I go back to saying it’s better not to have the answer. I was really happy when people were disappointed with the last episode. I was so happy! Because to me, that’s what the beauty of life is predicated on — searching for answers. If we’d answered it either way, I think on the surface, people would have been satisfied. But I think — subconsciously — if we’d answered it either way, there would have been a death. The death of the other side.\n\nWhat about you, Scott? What do you think?\n\nIn principle, I’m with you. And in general, I think Undone is very cagey about what’s real and what’s not, and very clever about which POV it chooses to show us at a given time.\n\nRight.\n\nBut the thing that trips me up is Nancy the security guard [whom Alma successfully disarms by empathizing about Nancy’s never-mentioned missing sister]. Because objectively, it seems like Alma has so much information about Nancy that she couldn’t have obtained any other way. To me, it felt like confirmation that Alma’s ability was real.\n\nIt’s interesting, right? Because that episode is from outside Alma’s perspective. And Sam says, “Wow, did you get all that from her screen saver?”\n\nBut Alma knows everything. She even knows the name of Nancy’s missing sister!\n\nI wrestled with that scene. I really, really did. Because as I was performing it, I’m going, “This tips our hand.” We didn’t even know the truth. On set, Kate would say, “We don’t know.” And I was the viewer, going, “But, but, but!” And she would say, “We don’t know.”\n\nSo I wrestled with that. And in my mind, because we’re seeing it from the outside, it could very well be that Alma has this ability. Or … she did some research. Which is the most boring answer of all time! But everyone gets tripped up on Nancy. There is a screen saver. There are pictures. How could she know this woman’s sister had died? It could have been a wild guess. She could have done research. But because we’re not with [Alma] in that episode, we really don’t know how she got that information.\n\nAnd then there’s this question I think you wrote about: the gap in Jacob’s memory of the accident.\n\nYes, I did.\n\nThat’s another one people are getting tripped up on. I think there’s a more concrete, two-pronged answer to that one for me. The first way is that this is all in Alma’s head, and she has no further information because her relationship with her father ended that night on the sidewalk. That’s where the memory ends. If it’s a schizophrenic break, she’s creating an explanation to mend the trauma of losing her father. That, potentially, is the answer.\n\nOkay, I can buy that.\n\nThe other potential answer is that when people are traumatized — even if they caused the event — they usually shut down or block it out. I read this book while I was filming this project called The Body Keeps the Score, by Bessel van der Kolk, and it really linked with the script. It talks about how trauma is embedded in our molecular structure. Buried in places in our minds. When Jacob is talking about the lineage stored in our minds, where good and bad have been compartmentalized — it’s true! We do carry a world inside of us. And not just our stories. Our father’s father’s father’s stuff. As a half-Peruvian woman, I wonder what I’m carrying with me.\n\nAnd I think Jacob’s memory could have ended on the sidewalk because that was the moment of the mistake he made. And then the memory of the murder-suicide was so traumatic to him that he blocked it out, and it wasn’t until they got closer to solving the mystery that it triggered the memory. That’s when he finds out and says, “You have to go back.”\n\nClearly, you had to think about how to play every scene, accounting for at least two different possibilities. Are there any specific scenes you’d suggest viewers go back and revisit once they’ve seen the entirety of the series — something that might play differently with additional context, or just provide some cool Easter eggs?\n\nOh yeah. I’ll probably get fired for saying this. [Laughs] I recommend going back to the first two episodes. When I look at them, I’m like, This is very blatant. This is very obvious to me. Based on my own assumptions. Again, I don’t even have answers; I’m just an actor. But to me, the first two episodes are very telling for what I believe to be the truth. There are many, many Easter eggs. It just links perfectly, full circle, to the eighth episode.\n\nWhen Jacob is giving her the speech — “You can go back to your life, or you can try something different” — you see this montage. And you see a lot of little … hints in all directions. You also get that big speech that [Becca] gives: “The clouds, the birds, the trees.” And she is literally saying the same things that Alma says to Cassie in the first episode. To me, that was very much, like, everything is connected. Perhaps this is not the first time she’s even gone through this cycle.\n\nYou also see [Alma say], “I’m not here. I’m two weeks from now. I’m at home with Sam.” And then there we are in episode five, and she’s in the house with Sam. There are many, many Easter eggs, and most of them are in episodes one and two.\n\nYou probably just sent every Undone superfan scrambling back to their couch for a rewatch.\n\nI’ve seen every episode umpteen times.\n\nLike any good superfan.\n\nLook, this is the thing I’m most proud of in my entire career. For personal reasons, because I was working through … I mean, my own relationship with both of my parents, through this show.\n\nIt seems like Undone came from a very personal and intimate place for everyone involved.\n\nOh, absolutely. People ask me what relationship in the show was the most fun to dive into, and they were all amazing. But for me — and for everyone, let’s be honest, and for Freud — it’s always the parents, right? [Laughs] This is what I mean when I say this was serendipitous. I was coming to this point where I was like, I need to unpack my relationship with my own mother. I’ve talked, really openly, about the tense relationship I had with my mother. And in Undone, I just saw the opportunity to explore that. Sort of like … reenactment therapy? Reenact my life, and my relationship, through Alma and Camila.\n\nWhat I came out with was really interesting, this idea that we never fully forgive our mothers for doing their best. And it brought a sense of accountability and empathy that I never really had before. It really felt like growing up, when I was doing this show. And it was really beautiful.\n\nEpisode six is particularly poignant in the way it shifts the spotlight to Camila, Alma’s mother.\n\nIt’s very, very touching. Because look, I did the same thing. My father has passed. And we all sort of glorify one parent. Especially when they’re gone, it’s like, he was the king. You know? And you bestow these otherworldly qualities to this person who was a fallible human being and was potentially not the best guy. I mean, I love my father, and who’s going to change that? But I definitely [ascribed] these grandiose characteristics to my father while never forgiving my mother for doing her best.\n\nWhen I worked through it as Alma, I was doing the same thing. It definitely changed my life. This show sort of moved through me in a very cathartic way — which is a very overused word, but it’s true. As actors, we’re always trying to achieve that feeling, and I felt it every day on Undone. It was very therapeutic for all of us. We all talked about a lot of our experiences.\n\nWhat I found most affecting, whether you believe Alma has a superpower or not, is the way her ability eventually manifests as a kind of extreme empathy: the way she can experience another person in full and see everything that made them who they are, and how that always leaves her in a place of acceptance and forgiveness.\n\nAbsolutely. Oh God, I’m gonna cry now. That episode with Sam. Hoo. It’s really special. I literally get chills every time. The idea that she could go back and see his story of being the other and having to abandon what he’s known. That’s Alma’s whole origin story — having a community at the deaf school and being ripped from that. Being Mexican-American and Jewish. Being this person who rejects the notion of conformity in all respects. She is other. And Sam is other. And once she learns that, she says, “Oh, I get it now.”\n\nIf only we all had that ability to zoom straight into someone’s origin story, our loved one who we’re just hating at the moment. And if we could just go, “Oh! That’s why you did this unspeakable, weird thing. You were afraid of losing me. You weren’t being vindictive. You were afraid, and that’s heartbreaking.” We all wish fights would end that way: “I get it, I forgive you, I love you.”\n\nIt’s been the theme of this interview, so I have to ask you another question you might not be able to answer: Will there be more Undone?\n\nI certainly hope so. It could go on and on. And it also could stop right there, just leaving everyone with the same questions they’ve been asking before the show came into existence. I want to know so much more. I’m just like you. But at the same time, it’s beautiful the way that it is. If they say, “This is a natural conclusion,” I would be like, “I can’t argue.” And that’s also very beautiful.\n\nThis interview has been edited and condensed for clarity.", "description": "A Q&A with Rosa Salazar about the Amazon Prime animated series Undone, sharing the episodes in which viewers who are desperate for closure might find some answers.", "authors": ["Scott Meslow"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/01/01-rosa-salazar-chat-room-silo.w1200.h630.jpg", "published_at": "2019-10-01"}