{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/19/saudi-oil-attack-shines-light-on-geopolitical-truth-and-lies", "downloaded_at": "2019-09-19 23:10:22.480432+00:00", "title": "Saudi oil attack shines light on geopolitical truth and lies", "language": "en", "text": "Truth is notoriously the first casualty in war, but even more so in the run-up to a war.\n\nThe Middle East finds itself in the strange position at the moment where an undoubted crime has been committed, an apparent perpetrator has come forward providing elaborate supporting details of the weapon used, the motive and timing, but the victim refuses to believe the confessor, and instead accuses a third party.\n\nIn seeking to disentangle responsibility for Saturday’s attack on the Saudi oil installations, which was claimed by Yemen’s Iran-backed Houthi rebels but blamed by Riyadh and Washington on Iran itself, the court of world opinion has to bear in mind many of those coming forward to give evidence could, in David Cameron’s phrase, be reasonably described as occasionally “leaving the truth at home”.\n\nTake for example, Mike Pompeo, the US secretary of state. Seeking to persuade reporters on the plane to Saudi Arabia on Tuesday that the Houthis could not have been responsible, he said: “Whatever you report about them, you say, ‘the Houthis said’, [but] you should say, ‘the well-known, frequently lying Houthis have said the following’.”\n\n“You ought not report them as if these are truth-tellers, as if these are people who aren’t completely under the boot of the Iranians, and who would not at the direction of the Iranians lay claim to attacks which they did not engage in, which clearly was the case here,” he continued.\n\nRegardless of the Houthis’ own reputation for veracity, the striking aspect of Pompeo’s remarks is the lack of self-awareness. He seems unable to reflect that the man for whom he works lies casually, and almost daily.\n\nIndeed fact-checking Donald Trump has become a minor industry in and of itself. As of 5 August, his 928th day in office, he had made 12,019 false or misleading claims, according to the Washington Post’s Fact Checker’s database.\n\nThe Post reported “Trump crossed the 10,000 mark on 26 April, and he has been averaging about 20 fishy claims a day since then. From the start of his presidency, he has averaged about 13 such claims a day”.\n\nSimilarly, anyone who followed the 17 days of outright Saudi denials that the journalist Jamal Khashoggi had been killed in its consulate in Istanbul knows that prominent Saudis lie, or in some cases, allow themselves to be misinformed, in the national interest.\n\nIran also enters the court without clean hands. Arguably its specialism is plausible deniability, using surrogates to act on its behalf and on its instruction. The 2015 Iran nuclear deal, for example, stemmed from the exposure of the Iranian state dissembling over the existence of two undeclared nuclear facilities.\n\nSome will say states pursuing the national interest are necessary strangers to truth – Sir Henry Wotton famously said back in 1604: “An ambassador is an honest gentleman sent to lie abroad for the good of his country.”\n\nDoubtless in the days ahead, technical intelligence assessments, fragments of weaponry and photographs will be produced to convince many western minds that Iran was responsible for what Pompeo has described as “an act of war”. But it is an uphill task.\n\nIn a new media age – where everything is more open to contest – politicians are going to have to work ever harder to convince sceptical electorates of the veracity of their statements, especially when building a case for military action. Their casual peacetime lies, corroding public trust, make that task more difficult.", "description": "Disentangling responsibility has been made so much harder by casual peacetime mendacity", "authors": ["Patrick Wintour"], "top_image": "https://i.guim.co.uk/img/media/1255663d0ead75700fc663579a0d5918ad0362f1/0_60_1280_768/master/1280.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=50c22b60dfde6f86bcb55c7f5505baa3", "published_at": "2019-09-19"}