{"pub": "marketwatch", "url": "https://marketwatch.com/story/medical-stocks-on-the-move-abbvie-arrowhead-pharmaceuticals-and-zynex-2019-10-04", "downloaded_at": "2019-10-04 16:57:15.389710+00:00", "title": "Medical stocks on the move: AbbVie, Arrowhead Pharmaceuticals and Zynex", "language": "en", "text": "Medical stocks dominate today’s top charts to watch.\n\nAbbVie Inc. ABBV, +1.19% climbed $1.72 to $73.85 on 6.2 million shares traded Thursday. The move came on no news from the maker of Humira and other drugs. The stock has been rallying for the past month, breaking out of a 1 1/2-year declining channel. However, it pulled back Tuesday and Wednesday to test support before Thursday’s bounce. Watch for a move next to recent highs near $76.\n\nArrowhead Pharmaceuticals Inc. ARWR, +1.04% jumped $1 to $29.92 on 883,800 shares traded Thursday. The move, on no news, continued the stock’s breakout of a one-month falling wedge. The stock needs to get above $31.50 to confirm the continuation of the uptrend, beyond which it could make a run at the recent high near $37.\n\nZynex Inc. ZYXI, +6.19% popped $1.02, or 9.4%, to $11.80 on 1 million shares traded Thursday, over three times its average volume. On Wednesday, the maker of electrotherapy medical devices announced 95% year-over-year order growth for the third quarter. The move followed Wednesday’s breakout of a two-month coil that also closed the stock above its June all-time high. Watch for $14 next.\n\nOur lone non-medical stock today, Turtle Beach Corp. HEAR, +2.66%, gained 39 cents to $10.89 on 406,800 shares traded Thursday. The company announced the availability of a new gaming headset audio enhancer. The move bounced the stock off its 21-day moving average, as it continues to build a multi-month base that could be setting up for a breakout. Watch for a test next of the $12-$12.50 range.\n\nSee Harry’s video-chart analysis on these stocks.\n\nThe writer has no holdings in any securities mentioned.\n\nHarry Boxer is founder of TheTechTrader.com, a live trading room featuring his stock picks, technical market analysis, and live chart presentations.", "description": "AbbVie has been rallying for the past month.", "authors": ["Harry Boxer"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GE143_medica_ZG_20180221131404.jpg", "published_at": "2019-10-04"}