{"pub": "thehill", "url": "https://thehill.com/policy/finance/466083-tensions-flare-as-democrats-urge-consumer-bureau-to-boost-penalites", "downloaded_at": "2019-10-16 20:47:58.271382+00:00", "title": "Tensions flare as Democrats urge consumer bureau to boost penalties", "language": "en", "text": "Tensions flared at a House committee hearing Wednesday as Democrats accused a powerful federal watchdog of shirking its obligation to protect consumers from financial fraud.\n\nA House Financial Services Committee hearing with Consumer Financial Protection Bureau (CFPB) Director Kathy Kraninger quickly devolved after a top Democratic congresswoman insisted the bureau had abandoned its mission under her watch.\n\n“If you're not following direction from your staff to help consumers that are harmed, then you are absolutely worthless,” said Rep. Carolyn Maloney Carolyn Bosher MaloneyNew York Democratic congresswoman hospitalized Cast and crew of 'Unbelievable' join lawmakers to advocate for reducing DNA, rape kit backlog O'Rourke gun confiscation talk alarms Democrats MORE (D-N.Y.).\n\nADVERTISEMENT\n\nMaloney was referencing Kraninger’s decision to not seek payback for consumers in a January legal settlement with Enova International, an online lender accused of illegally collecting debts from consumers.\n\nWhile Kraninger approved a $3.2 million fine, she did not seek restitution for consumers, despite recommendations from career staff to do so, according to documents released by the committee Wednesday.\n\nThough Kraninger had already faced criticism on the settlement from the panel’s chairwoman, Rep. Maxine Waters Maxine Moore WatersThe Hill's 12:30 Report: Video depicting Trump killing media, critics draws backlash Backlash erupts at video depicting Trump killing media, critics Cindy McCain condemns video of fake Trump shooting political opponents, late husband MORE (D-Calif.), Republicans erupted after Maloney rebuked Kraninger’s leadership.\n\nRep. Ann Wagner Ann Louise WagnerFederal aid is reaching storm-damaged communities too late Missouri Republican wins annual craft brewing competition for lawmakers Liberal think tank: GOP paid parental leave proposals are too narrow MORE (R-Mo.) urged Waters to enforce the committee’s rules of decorum and denounce Maloney, but her request was swiftly denied.\n\n\"The chair is in charge and the chair will decide exactly how this committee will be run,” Waters shot back. “Thank you for your comments.\"\n\nRep. Bill Posey William (Bill) Joseph PoseyTensions flare as Democrats urge consumer bureau to boost penalties Conservatives ask Barr to lay out Trump's rationale for census question Biz groups target Florida voters ahead of Democratic debates in Miami MORE (R-Fla.) ripped Democrats for their “denigration” of Kraninger, arguing he would be dismissed from the committee if he spoke that way about her Obama-era predecessor, Richard Cordray Richard Adams CordrayDemocrats fear Ohio slipping further away in 2020 House leaders ask Supreme Court to reject Trump challenge to consumer bureau Trump administration asks Supreme Court to take up challenge to consumer bureau MORE.\n\nPosey then accused the Democrats of treating Kraninger with a “double standard” after Cordray set \"a new level of bureaucratic petulance, arrogance, and defiance.\"\n\nRep. Bill Huizenga (R-Mich.) said that if Republicans ever addressed Cordray or Sen. Elizabeth Warren Elizabeth Ann WarrenWarren defends, Buttigieg attacks in debate that shrank the field Five takeaways from the Democratic debate in Ohio New study: Full-scale 'Medicare for All' costs trillion over 10 years MORE (D-Mass.), the architect of the agency, that way, “there would be rioting out in those halls right now.”\n\n“You frankly deserve an apology,” Huizenga added.\n\nLawmakers on the panel have battled for years over the CFPB and its immense authority, and Wednesday's hearing highlighted the partisan rancor that has overshadowed the agency.\n\nOn Wednesday, Democrats had little patience for objections from Republicans, who argued that the GOP routinely berated Cordray when he appeared before the committee.\n\n“I do recall conversations from my friends on the other side with the previous director when they were actually screaming at the top of their lungs and calling him names,” said Rep. Juan Vargas Juan C. VargasHere are the 95 Democrats who voted to support impeachment ICE does not know how many veterans it has deported, watchdog says Pelosi employs committee chairs to tamp down calls for Trump impeachment MORE (D-Calif.). “If you look at the record, that’s there too.”\n\nNonetheless, Maloney apologized to Kraninger, explaining she did not “intend to say that [she] was worthless.”\n\n“I only intended to echo the chairman's point about the bureau making consumers whole. I didn't intend to disrespect the director personally, and I'm sorry for the confusion that my statement caused.”\n\nKraninger has faced constant criticism from Democrats since taking over the CFPB in December 2018 from acting Director Mick Mulvaney John (Mick) Michael MulvaneyState Dept. official told to 'lay low' after voicing concerns about Giuliani: Dem lawmaker Democrats see John Bolton as potential star witness The Hill's Morning Report - Trump grapples with Turkey controversy MORE, who now serves as acting White House chief of staff.\n\nKraninger had pledged to stabilize the CFPB after Mulvaney’s efforts to gut the agency. But Democrats and consumer advocates have condemned her efforts to loosen CFPB regulations on payday lending and easing oversight of financial institutions.\n\nRepublicans and financial industry advocates who have long been critical of the CFPB’s power have praised Kraninger and her willingness to reign in the bureau. Several suggested that Democrats had suffered from buyer’s remorse by giving the CFPB director immense personal power.\n\n“They ought to blame themselves,” said Rep. Andy Barr Andy Hale BarrThe Hill's Campaign Report: Impeachment fight to take center stage at Dem debate McGrath raises nearly million in third quarter for bid to unseat McConnell Farm manager doubts story horse bit Pence: report MORE (R-Ky.). “They deliberately designed an agency to elude congressional oversight or accountability.”\n\nHanging over the hearing was also a larger fight in the courts over the agency.\n\nDemocrats responded with outrage last month after Kraninger filed a joint brief with the Justice Department urging the Supreme Court to take up a case challenging the constitutionality of the bureau.\n\nTop Justice Department and CFPB attorneys argued in a brief that the structure of the powerful financial watchdog infringes on the president’s executive authority.\n\nKraninger also explained in a letter to lawmakers that she supported a ruling that would allow the president to fire the director at will, regardless of the personal consequences.\n\nThe move has angered Democrats, who see it as a serious threat to the agency. Democrats on the committee blasted Kraninger for the move.\n\n\"Congress deliberately created the CFPB as an independent regulator, and for you to second guess Congress's judgment on this constitutionality of the CFPB and to argue against the CFPB structure in court is disrespectful of Congress,\" said Maloney.\n\nKraninger added Wednesday that resolving the issue of the CFPB’s legal structure would allow the bureau to focus its time and efforts on enforcing consumer protection law.\n\n“The constitutional question has delayed many enforcement actions, it has delayed regulatory actions and has been something that I believe fundamentally the Supreme Court and Congress need to decide and settle, once and for all, so that the bureau can move forward and finish and actually engaged in its mission,” Kraninger said.\n\nUpdated at 3:31 p.m.", "description": "Tensions flared at a House committee hearing Wednesday as Democrats accused a powerful federal watchdog of shirking its obligation to protect consumers from financial fraud.", "authors": [], "top_image": "https://thehill.com/sites/default/files/kraningerkathleen_101619gn_lead.jpg", "published_at": "2019-10-16"}