{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/lionel-messi-explains-what-makes-20639638", "downloaded_at": "2019-10-17 10:34:06.227857+00:00", "title": "Lionel Messi explains what makes Virgil van Dijk so hard to play against", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLionel Messi has pinpointed the strengths of Virgil van Dijk ahead of the forthcoming Ballon d'Or battle between the pair.\n\nBarcelona icon Messi pipped Van Dijk to be named as FIFA's Best Men's Player of the Year at a ceremony last month, but Liverpool's Dutch defender is still seen as the favourite to win the Ballon d'Or award in December.\n\nVan Dijk's dominant defensive displays helped the Reds win the Champions League in June, while after that he led the Netherlands to the Nations League final in the summer.\n\nHe has then started this season by featuring for every minute as Liverpool have won eight out of eight to top the Premier League.\n\n(Image: PA)\n\nMessi - who already has five Ballons d'Or to his name, the same amount as rival Cristiano Ronaldo - was on the receiving end of Van Dijk's qualities when Liverpool overcame a 3-0 first leg deficit to beat Barca 4-3 on aggregate in last season's Champions League semi-final.\n\nThe Argentinean is clearly a huge fan of the centre-back, who he says can cause damage at both ends of the pitch.\n\n(Image: Getty Images)\n\n\"He is a defender who knows how to judge his timing and wait for the right moment to challenge or jockey [the attacker],\" Messi told Marca .\n\n\"He is very fast and big, but he has a lot of agility for his height.\n\n\"He is fast because of his great stride, and he is impressive both in defence and attack because he scores lots of goals.\"\n\n(Image: AFP via Getty Images)\n\nMessi has had a somewhat injury-hit season thus far, featuring just three times in La Liga and twice in the Champions League, playing the full 90 minutes on only two of those occasions.\n\nHe scored his first goal of the season against Sevilla before the international break.", "description": "The Barcelona superstar heaped praise on the Dutch defender, who got the better of him in the Champions League last season", "authors": ["Mark Jones", "Image", "Pa", "Getty Images", "Afp Via Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20639629.ece/ALTERNATES/s1200/0_Liverpool-v-Barcelona-UEFA-Champions-League-Semi-Final-Second-Leg-Anfield.jpg", "published_at": "2019-10-17"}