{"pub": "hotair", "url": "https://hotair.com/archives/jazz-shaw/2019/09/10/pretty-much-done-north-korean-talks", "downloaded_at": "2019-09-10 23:32:12.971143+00:00", "title": "So are we pretty much done with the North Korean talks?", "language": "en", "text": "For the eighth time in less than three months, North Korea has fired another short-range missile into the sea. Curiously, it happened only hours after Kim Jong-un offered once again to restart negotiations with President Trump. But that offer came with strings attached: no more meetings until Washington shows that it’s ready to give Kim some of what he wants. The President can’t afford to cave on that part of the bargain, so this is probably a non-starter. So where do we go from here? (Associated Press)\n\nAnother week, another North Korean weapons test. North Korea’s relentless, carefully calibrated barrage of firepower — Tuesday’s test was its eighth since late July — has managed to normalize a martial display of defiance that not too long ago raised fears of war in one of the most dangerous corners of the world. The tests, which have been repeatedly dismissed by President Donald Trump as routine, are just the latest bit of proof that North Korea, a small, fiercely proud, totalitarian nation surrounded by big neighboring powers that are often unfriendly, is a master at getting a lot from a little.\n\nThe President is once again writing this off as just “routine testing,” but our own analysts don’t seem to agree. It’s true that President Trump’s stated red line was long-range testing and Kim is still being careful not to cross it. But it’s being reported that these short-range tests are growing increasingly accurate and stealthy. It’s feared that once this technology is perfected, it could be transferred over to Kim’s long-range missiles, making them significantly more dangerous. And all the while, there’s no sign of the dictator doing anything to seriously reduce his stockpile of nuclear weapons.\n\nAt some point, we need to seriously ask ourselves if these ongoing talks between Trump and Kim are actually accomplishing anything or if we’re just being played. South Korea is currently doing better negotiating with the North than we are, and Moon Jae-in obviously has the most to gain (or lose) from the prospect of normalizing relations on the Korean peninsula.\n\nTrump has been admirably stubborn in holding out for concessions from Kim Jong-un before offering any sanctions relief. But Kim has been equally stubborn and these ongoing missile tests seem like a carefully calculated thumb in the eye to Washington. One analyst in the linked report described Kim’s strategy as the classic good cop, bad cop ploy. Have diplomats offer another round of talks with one hand and fire off some improved missiles with the other. Is that going to work?\n\nOf course, Trump has a lot of plates in the air just now. It’s hard to say how much attention he’s really paying to the North Korean situation at the moment. But that pot won’t stay on a slow simmer forever. At this point, we’re still not seeing any nuclear detonations or long-range missile tests, but other than that Kim is pretty much back to his old routine. The only thing that’s missing is his constant stream of threats to destroy America.\n\nOne thing that worries me is the obvious fact that the President would dearly love to get some sort of deal inked with Kim before the next election, both as an argument for a second term and out of fear that the project will fail entirely if he’s not reelected. Could that sort of timetable push him toward blinking first and removing some sanctions to see if Kim will verifiably dismantle some of his nukes? If so, Kim walks away from the table looking like a winner.\n\nExit question. Let’s just say that Donald Trump doesn’t win a second term. (It remains a distinct possibility.) Do you think any of the Democrats still in serious contention for the nomination would continue the engagement with North Korea that Trump started? I get the feeling that since it’s a project with the Trump brand on it their party might pressure them to walk away and return to the old status quo.", "description": "The summer romance may be over", "authors": ["Jazz Shaw", "Ed Morrissey", "John Sexton", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/06/TrumpKim.jpg", "published_at": "2019-09-10"}