{"pub": "usatoday", "url": "https://usatoday.com/story/tech/talkingtech/2019/10/07/fortnite-producer-epic-games-lawsuit-says-addictive-as-cocaine/3900236002", "downloaded_at": "2019-10-07 19:47:00.585348+00:00", "title": "Epic Games sued for not warning parents 'Fortnite' is allegedly as addictive as cocaine", "language": "en", "text": "Epic Games sued for not warning parents 'Fortnite' is allegedly as addictive as cocaine\n\nCLOSE\n\nFortnite characters are dressed in various outfits, including a bunny and a samurai soldier. (Photo: EPICGAMES.COM.https://www.epicgames.com/fortnite/en-US/news/creative-ama-3-29-2019)\n\nRoughly a quarter of a billion mostly obsessed gamers are battling it out in \"Fortnite.\" There’s a darn decent chance kids you know are among them.\n\nA Montreal-based law firm launched a proposed class action in Canada on behalf of two Quebec parents who claim that \"Fortnite\" publisher Epic Games needs to pay the price for a third-person shooter they allege is as addictive, and potentially harmful, as cocaine.\n\nThe firm, Calex Légal, represents plaintiffs who are identified only by their initials, FN and JZ. They are the parents of a 10- and 15-year-old, respectively.\n\nWritten in French, the legal action alleges that when a person is engaged in \"Fortnite\" for a long period, the player’s brain releases the “pleasure hormone, dopamine” and that \"Fortnite\" was developed by psychologists, statisticians and others over four years “to develop the most addictive game possible,” all so Epic could reap lucrative profits.\n\nAn Epic spokesperson said the company does not comment on ongoing litigation.\n\nKindle for kids: Want your kids to read more? Amazon has a new Kindle for them\n\nThough \"Fortnite\" is free to play, kids spend gobs of real money purchasing the in-game currency, V-Bucks, used for dances (which are called “emotes”), skins and custom outfits for their virtual alter-egos.\n\n“The defendants used the same tactics as the creators of slot machines, or variable reward programs, (to ensure) the dependence of its users, (and) the brain being manipulated to always want more,” the suit alleges in a rough translation. “Children are particularly vulnerable to this manipulation since their self-control system in the brain is not developed enough.”\n\nFortnite. (Photo: Epic Games)\n\nEpic has 30 days to respond to the legal action. The case could take up to a year or so.\n\nAlessandra Esposito Chartrand, an attorney with Calex Légal, told the CBC in Canada that the suit is based on the same legal basis as a Quebec Superior Court ruling in 2015 that determined that tobacco companies didn’t warn the public about the dangers of smoking. Chartrand said it was Epic’s duty to issues similar warnings around the addictive nature of \"Fortnite.\"\n\nLast year, the World Health Organization classified \"gaming disorder\" as a diagnosable condition, giving mental health professionals a basis for setting up treatment and identifying risks for addictive behavior.\n\nIn a Common Sense/Survey Monkey poll released last December, about one in five parents found it at least moderately difficult to get kids off \"Fortnite,\" and about a quarter said they were concerned about how much time their kid played.\n\nThe Canadian suit isn’t the first time Epic Games has faced a potential class action. In June, a federal case was brought in the northern district of California that alleged in part that \"Fortnite\" lacks built-in “parental controls that would allow parents or guardians of minors to make informed decisions regarding in-app purchases” and that minors who change their mind after making a purchase, even minutes after doing so, are not allowed a refund.\n\nEmail: ebaig@usatoday.com; Follow @edbaig on Twitter\n\nRead or Share this story: https://www.usatoday.com/story/tech/talkingtech/2019/10/07/fortnite-producer-epic-games-lawsuit-says-addictive-as-cocaine/3900236002/", "description": "Quebec parents sued \"Fortnite\" publisher Epic Games for a third-person shooter they allege is as addictive and dangerous as cocaine.", "authors": ["Edward C. Baig", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/1e4b73bac357d52452d8c39adb20f5728a658b03/c=0-85-2568-1529/local/-/media/2019/05/02/USATODAY/usatsports/MotleyFool-TMOT-3c6c327d-fortnite-characters.png?width=3200&height=1680&fit=crop", "published_at": "2019-10-07"}