{"pub": "blastingnews", "url": "https://us.blastingnews.com/sports/2019/10/moss-claims-brady-wants-to-continue-playing-high-level-football-beckham-praises-patriots-003006989.html", "downloaded_at": "2019-10-28 23:27:08.829128+00:00", "title": "Moss claims Brady wants to continue playing high-level football; Beckham praises Patriots", "language": "en", "text": "Hall of Fame wide receiver Randy Moss weighed in on the talk about the future of his former teammate, New England Patriots quarterback Tom Brady. Adam Schefter of ESPN reignited discussions about Brady’s future in New England when he said that staying with the Patriots next season is the “least-likely” option for the 42-year-old signal caller if he wants to continue playing.\n\nThe two other options for Brady, according to Schefter, are to retire after this season or move on and join another team in his 21st season in the league.\n\nDuring ESPN’s NFL Countdown, Moss, who played alongside Brady with the Patriots from 2007 to 2010, said he got the indication that the veteran signal-caller still wants to play football.\n\nBrady has done a lot for Patriots\n\n“He still loves the game, he’s still playing at a high level,” said Moss, adding that the possibility of Brady playing with another team would look weird. “For me, to look at Tom Brady in another jersey, it would look weird,” said Moss.\n\nHowever, the Hall of Fame receiver said he won’t eliminate the possibility that Brady might take his talent elsewhere, just like what Brett Favre and Peyton Manning did in the latter part of their Hall of Fame careers.\n\n“Hey, we’ve seen the best of them, from Favre to Manning, move on,” said Moss. “It’s just seems weird that a man that has done so much for one organization, it’s just hard to see him in another uniform,” he added.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. NFL New England Patriots\n\nBased on their short conversation before the Patriots’ Monday Night Football (MNF) clash with the New York Jets, Moss said he got an indication that Brady wants to play football and he still loves to play at a high level. Earlier, ESPN analyst Stephen A. Smith said that Patriots CEO Robert Kraft won’t allow Brady to leave New England, but if he indeed leaves, Tennessee could be an option as he is close with Titans head coach Mike Vrabel.\n\nBeckham praises Patriots, gifts Brady with GOAT shoes\n\nCleveland Browns wide receiver Odell Beckham Jr. was gracious even in defeat as he heaped praises on the New England Patriots’ defense following their 27-13 loss on Sunday at Gillette Stadium. Beckham was limited to just five catches for 52 yards and no touchdown by the Patriots defense. “It's not like we look into that, but this is a real defense.\n\nThis is a very, very good team,” said Beckham, who particularly lauded Patriots cornerback Stephon Gilmore for effectively covering him all game long. After the game Beckham had a long chat with Brady after giving him a pair of goat hair cleats, referring to the quarterback’s status as “Greatest of All Time.” Earlier, Beckham stirred rumors after declaring that he wants to play for the Patriots.", "description": "Moss said the possibility of the 42-year-old Brady playing in another uniform would look weird.", "authors": ["Zeegee Cecilio", "Read More On The Same Topic Zeegee Cecilio", "Trade Rumors", "Patriots Want To Add Pass Catchers", "Offensive Line Help Before Deadline", "Bolt Ready To Play For Patriots", "Dorsett", "Izzo Possible Trade Targets For Other Teams", "Tom Brady Shows Love For Mom", "Daughter"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/28/os/b_1200x630/brady-threw-two-touchdown-passes-in-27-13-win-over-browns-in-week-8-image-credit-new-england-patriotsyoutube_2345719.jpg", "published_at": "2019-10-28"}