{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/tv/2019/10/29/game-of-thrones-prequel-hbo-passes-naomi-watts-series/2499618001", "downloaded_at": "2019-10-30 00:06:32.998294+00:00", "title": "'Game of Thrones' prequel starring Naomi Watts nixed by HBO, reports say", "language": "en", "text": "CLOSE Sometimes when your favorite TV show comes to an end, it leaves a bitter taste for years to come. USA TODAY\n\nThe world of Westeros just got a little smaller.\n\nA potential prequel series to HBO's blockbuster \"Game of Thrones\" starring Naomi Watts is not moving forward at the premium cable network, Deadline and The Hollywood Reporter said Tuesday.\n\nThe unnamed series was one of five \"Thrones\" spinoff concepts HBO considered after the ratings juggernaut finished its eighth and final season earlier this year. It was the only one to film a pilot episode over the summer, but the network ultimately passed.\n\nThe nixed series would have been in the world of Westeros, but thousands of years before the events of \"Thrones.\"\n\nPeter Dinklage as Tyrion Lannister on \"Game of Thrones.\" (Photo: Helen Sloan/HBO)\n\nBritish screenwriter and producer Jane Goldman (\"Kingsman\" franchise, \"X-Men: First Class\") and George R.R. Martin, the author of the \"A Song of Ice and Fire\" series on which \"Thrones\" is based, developed the series together. The initial synopsis said it would \"chronicle the world’s descent from the golden Age of Heroes into its darkest hour. And only one thing is for sure: from the horrifying secrets of Westeros’s history to the true origin of the White Walkers, the mysteries of the East to the Starks of legend … it’s not the story we think we know.\"\n\nSep 22, 2019; Los Angeles, CA, USA; Naomi Watts arrives at the 71st Emmy Awards at the Microsoft Theater. Mandatory Credit: Dan MacMedan-USA TODAY (Via OlyDrop) (Photo: Dan MacMedan/USA TODAY)\n\nMore: 'Game of Thrones' Targaryen prequel series close to HBO pilot deal\n\nHowever, HBO isn't out of the \"Thrones\" business, promising to continue efforts to expand the world of the fantasy drama, its biggest series to date. The network is expected to confirm plans for a second pilot, based on Martin's \"Fire & Blood,\" that details the history of Westeros and the Targaryens, an era of the story much closer to the events of the original series.\n\nMore: A 'Game of Thrones' final season do-over? HBO chief says no\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/tv/2019/10/29/game-of-thrones-prequel-hbo-passes-naomi-watts-series/2499618001/", "description": "HBO is not moving forward with a pilot episode of a \"Game of Thrones\" prequel starring Naomi Watts, but there may be another \"GoT\" project coming.", "authors": ["Kelly Lawler", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/authoring/2019/05/15/USAT/cd21334c-cc48-4215-b8e9-4b14f3e67c3b-Helen_Sloan_-_HBO.jpg?crop=3154,1763,x0,y0&width=1600&height=800&fit=bounds", "published_at": "2019-10-29"}