{"pub": "yahoo", "url": "https://news.yahoo.com/trump-visits-us-mexico-border-213053500.html", "downloaded_at": "2019-09-19 06:03:49.933334+00:00", "title": "Trump visits US-Mexico border wall amid protests", "language": "en", "text": "With protests raging nearby, Donald Trump has visited a section of the US-Mexico border in San Diego to see part of the wall he has hinged his political career on building.\n\nMr Trump visited the border in the Otay Mesa neighbourhood, the same location he stopped at last year when he reviewed several border wall prototypes that he has prescribed as a major fix for the immigration crisis he claims is threatening American values.\n\nThe president called it \"an amazing project,\" according to the Associated Press.\n\nMeanwhile, hundreds of protesters gathered in Southern California to demonstrate against his visit, and to push back on the idea that any border crisis truly exists except one that Mr Trump himself has created through a crackdown on asylum seekers and families fleeing violence and poverty in Central America.\n\nNearly three years into his first term, Mr Trump has pushed forward with construction on his border wall, in spite of pushback from congressional Democrats who have refused to fund much of the project.\n\nInstead, Mr Trump has largely relied on diverted funds from other parts of the government, including the Defence Department and the Homeland Security Department.\n\nWhile Mr Trump promised that Mexico would pay for the wall, instead some $3.6 billion in military infrastructure money has been raided, undercutting projects across the US from New York to Virginia and the Carolinas. All told, US Customs and Border Protection says it has received $6.2 billion since January 2017 to build the wall.\n\nAmong those projects that have had funding taken away include an ambulatory centre in North Carolina; an engineering centre at the US Military Academy in West Point, New York; a cyber-ops facility in Virginia; a fire station in South Carolina; a central heating facility on an Air Force base in Alaska; and a Kentucky middle school.\n\nBut, despite Mr Trump’s repeated claims that the US border wall is nearing completion, there actually hasn’t been much movement on creating new wall along the border. Before Mr Trump became president, 654 miles of the nearly 2,000 miles border had some form of fencing or wall on it, and that figure has remained mostly unchanged.\n\nhttp://players.brightcove.net/624246174001/default_default/index.html?videoId=5837728067001\n\nSupport free-thinking journalism and attend Independent events\n\nInstead, new construction has largely been to replace existing infrastructure, including with larger fences, bollards, lights, and roads.\n\nMeanwhile, Mr Trump has overseen a crackdown on immigration into the United States, with his administration notably separating families as they cross into the United States seeking asylum.\n\nThe administration has also pushed forward with efforts to stop migrants from getting into the United States at all, asking them instead to take a number at the border and to wait until they are called for a chance to have their asylum cases heard.\n\nAs a result of those policies and others, US immigration court backlogs have skyrocketed, with over 1 million waiting for their cases to be heard in the most recent tally, matching the highest backlog seen in the US.", "description": "With protests raging nearby, Donald Trump has visited a section of the US-Mexico border in San Diego to see part of the wall he has hinged his political career on building.Mr Trump visited the border in the Otay Mesa neighbourhood, the same location he stopped at last year when he reviewed several border", "authors": ["Clark Mindock"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.fApuKvtW5mHshznc7Qluw--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/28e1797172354ad375be5dda1fc465f2", "published_at": "2019-09-18"}