{"pub": "yahoo", "url": "https://sports.yahoo.com/rams-stifle-baker-mayfield-browns-offense-in-2013-victory-032622597.html", "downloaded_at": "2019-09-23 04:26:59.481582+00:00", "title": "Browns, Baker Mayfield struggle again in home loss to Rams", "language": "en", "text": "The Los Angeles Rams didn’t play their A-game or take full advantage of a Cleveland Browns secondary missing four starters on Sunday night.\n\nThey didn’t need to.\n\nA pair of Cooper Kupp touchdowns and two Greg Zuerlein field goals were all they needed to score a 20-13 win against a stunted Browns offense that’s giving cause for concern in Cleveland.\n\nScroll to continue with content Ad\n\n[Watch live NFL games on the Yahoo Sports app, here's how]\n\nNeither team could get anything going in the first half that saw the Browns outkick the Rams to take a 6-3 lead into halftime.\n\nBut the Rams found a semblance of rhythm on offense in the second half while continuing to pressure and frustrate Baker Mayfield on defense to improve to 3-0.\n\nIt's time to worry about Baker Mayfield and the Browns offense. (Getty)\n\nBrowns blow late chance\n\nDespite their struggles, the Browns found themselves with a chance to tie the game late thanks to a Juston Burris interception of Jared Goff with 2:54 remaining.\n\nBut the final Cleveland drive served as a microcosm of the night, as the Browns failed to capitalize on their late opportunity. Cleveland found itself in first-and-goal from the four-yard line, but failed to get into the end zone on four straight passes, sealing the loss to fall to 1-2 on the season.\n\nFitting final play\n\nThe Browns’ fourth-down effort saw Mayfield face immediate pressure from an aggressive Los Angeles defense that saw Clay Matthews and Samson Ekubam break free from the edges.\n\nMayfield immediately retreated before launching a desperation heave in the end zone that was intercepted by John Johnson III.\n\nIt was the first interception of the night for Mayfield, but it was far from the first bad play from Cleveland’s passing game that saw Mayfield complete 18-of-36 pass attempts for 195 yards with a single touchdown.\n\nThis hit of Baker Mayfield by Clay Matthews was a familiar scene in Cleveland Sunday. (Getty)\n\nConstant pressure on Mayfield\n\nStory continues\n\nMayfield was under pressure most of the night from a blitzing Wade Phillips defense that saw Matthews and Aaron Donald regularly finding their way into the backfield. Matthews logged a pair of sacks and Donald recorded one as the Rams rarely gave Mayfield opportunities to make plays when he didn’t immediately get rid of the ball.\n\nThe most successful pass play of the night arrived via screen when Mayfield took advantage of the Rams’ aggression to find running back Nick Chubb on a third-and-13 that went for 30 yards midway through the third quarter.\n\nThe conversion led to the only touchdown of the night for Cleveland, a two-yard pass from Mayfield to tight end Demetrius Harris on a busted coverage from the Rams.\n\nWhere are the big plays?\n\nUntil the final panicked drive by the Browns, downfield passes were not an option.\n\nSunday was the second time in three games that the Browns have failed to break the 13-point threshold to start the season. They were embarrassed in their season opener at home in a 43-13 loss to the Tennessee Titans.\n\nThey managed a little better on offense in a 23-3 win over New York Jets. But even then — against an inept 0-3 team — downfield passes didn’t arrive with regularity. Mayfield completed just 19-of-35 attempts in that effort that saw 89 of his 325 passing yards come courtesy of a catch-and-run play by Odell Beckham Jr.\n\nBeckham, the big-play receiver who arrived via trade this offseason, was a minor factor in Sunday’s loss, tallying 56 yards on six catches.\n\nThis is not the start Browns fans had in mind for the Freddie Kitchens era. (Getty)\n\nFor the season, Mayfield is averaging 251.3 yards per game while completing 56.8 percent of his passes. He’s thrown three touchdowns and five interceptions through three games. It’s far from the sophomore effort a rabid Browns fanbase anticipated in Cleveland’s first season under head coach Freddie Kitchens.\n\nA team focused on making its first playoff appearance since 2002 now finds itself in an early hole with a pair of losses at home.\n\nStrange late call by Kitchens\n\nDecisions like Kitchens’ bizarre late call to run a draw play on fourth-and-nine with 9:19 remaining while trailing 17-13 on the Rams 40 will only amplify the noise in Cleveland.\n\nThe play didn’t work.\n\nThe Rams took the ball over on downs and drove for a Zuerlein field goal that proved the final score of the night.\n\n“If you're looking to blame somebody, just blame me,” Kitchens told reporters after the game. “Don't blame any of our players, don't blame any of our other coaches. Go write your article, and say it's my fault it doesn't look like it did last season, because it is.\"\n\nIf Kitchens isn’t careful and the Browns can’t figure out a way to give Mayfield time to work through his pass progressions, he just might end up with his wish.\n\nMore from Yahoo Sports:", "description": "It's time to worry about Baker Mayfield and the Browns offense.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/Y3u7F7aZRKbKX1ISKa7LXg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05MzkuNzMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/oNrGLZ2QHrgqVzUKgtVgnA--~B/aD0xMDY3O3c9MTQ1NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/a9a52ae0-ddaf-11e9-bfff-8bb78e62f6bc", "published_at": "2019-09-23"}