{"pub": "businessinsider", "url": "https://businessinsider.com/mcconnell-if-trump-impeached-senate-would-have-to-hold-trial-2019-9", "downloaded_at": "2019-10-01 04:30:33.929340+00:00", "title": "Mitch McConnell says the Senate would have 'no choice' but to hold a trial if Trump is impeached", "language": "en", "text": "Senate Majority Leader Mitch McConnell on Monday said he would have \"no choice\" but to hold a trial if the House were to pass articles of impeachment against President Donald Trump.\n\n\"Under the Senate rules, we're required to take it up if the House does go down that path, and we'll follow the Senate rules,\" McConnell told CNBC.\n\nLast week, House Speaker Nancy Pelosi launched a formal impeachment inquiry into Trump linked to the escalating Ukraine scandal.\n\nVisit Business Insider's homepage for more stories.\n\nSenate Majority Leader Mitch McConnell on Monday said the Senate would be required to hold a trial if President Donald Trump were impeached in the House.\n\nTechnically, the Constitution does not require the Senate to hold a trial if a president is impeached, but McConnell told CNBC that Senate rules would leave him with \"no choice\" but to move forward with one.\n\nRead more: 'This was his show': Rudy Giuliani emerges as the key to unraveling the Trump-Ukraine whistleblower scandal\n\n\"Under the Senate rules, we're required to take it up if the House does go down that path, and we'll follow the Senate rules,\" McConnell said.\n\nHe added: \"It's a Senate rule related to impeachment that would take 67 votes to change, so I would have no choice but to take it up. How long you're on it is a whole different matter, but I would have no choice but to take it up, based on a Senate rule on impeachment.\"\n\nThe Kentucky Republican's remarks came less than a week after House Speaker Nancy Pelosi launched a formal impeachment inquiry into Trump amid the escalating scandal regarding a whistleblower complaint linked to a July 25 phone conversation with Ukrainian President Volodymyr Zelensky.\n\nMcConnell in March said the Senate would hold a trial if impeachment occurred, but this was his first comment on the matter since the impeachment inquiry began.\n\nOnly two presidents in US history — Andrew Johnson and Bill Clinton — have been impeached; both were acquitted in the Senate.", "description": "Senate Majority Leader Mitch McConnell on Monday said he would have \"no choice\" but to hold a trial if the House were to pass articles of impeachment.", "authors": ["John Haltiwanger"], "top_image": "https://image.businessinsider.com/5d922b252e22af49ad2aa855?width=1200&format=jpeg", "published_at": "2019-09-30"}