{"pub": "usatoday", "url": "https://usatoday.com/story/sports/mlb/playoffs/2019/10/15/mlb-playoffs-nationals-score-7-cardinals-first-inning-game-4/3992451002", "downloaded_at": "2019-10-16 01:14:49.636722+00:00", "title": "Cardinals unravel as Nationals score seven runs in first inning of NLCS Game 4", "language": "en", "text": "CLOSE\n\nWASHINGTON – The St. Louis Cardinals have now seen what it’s like the other side of an energy-sapping, soul-crushing, series-clinching first-inning beatdown.\n\nJust six days after the Cardinals eliminated the Atlanta Braves with a 10-run first inning in Game 5 of the National League Division Series, the Washington Nationals nearly did the same thing to them.\n\nThe Nats bats blasted rookie right-hander Dakota Hudson for seven runs on six hits in the bottom of the first inning to take a commanding lead on their way to what could be a four-game sweep of the Cardinals and a berth in the World Series.\n\nAnthony Rendon drove in the first run with a sacrifice fly – the only out Hudson would get in the inning – and Juan Soto added an RBI double to get things started. The Nationals also benefited from a pair of defensive misplays by a Cardinals defense that was one of the best in the majors during the regular season.\n\nSecond baseman Kolten Wong dropped a throw on a potential force play and a trio of Cardinals – Wong, right fielder Jose Martinez and first baseman Paul Goldschmidt – allowed a shallow popup off the bat of Victor Robles to drop in between them, scoring another run.\n\nYan Gomes added a two-RBI single and Trea Turner drove in another pair with a single in his second at-bat of the inning, before the frame mercifully came to an end.\n\nThe Nationals have scored first in every game of the series and have never trailed. The only team to ever sweep a postseason series and never lose the lead at any point: the Baltimore Orioles in the 1966 World Series.", "description": "Washington jumped all over St. Louis with seven runs in the first inning of NLCS Game 4.", "authors": ["Steve Gardner", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/16/USAT/38a2e7f2-a8ee-4942-b94e-d2592ba2ecdc-USATSI_13520520.jpg?crop=1552,873,x931,y43&width=3200&height=1680&fit=bounds", "published_at": "2019-10-15"}