{"pub": "cnbc", "url": "https://cnbc.com/2019/10/25/john-boltons-lawyers-are-in-contact-with-trump-impeachment-panels.html", "downloaded_at": "2019-10-25 16:21:25.900609+00:00", "title": "Lawyers for former Trump advisor John Bolton reportedly in contact with impeachment probe panels", "language": "en", "text": "National Security Advisor, John Bolton, gestures as he meets with journalists during a visit to London, Britain August 12, 2019.\n\nLawyers for former national security advisor John Bolton have been in touch with officials working on House committees about possibly testifying in the impeachment probe of President Donald Trump, a person close to Bolton told NBC News on Friday.\n\nThe news comes more than a week after the White House's former top Europe expert, Fiona Hill, reportedly testified to Congress that Bolton was so disturbed by efforts to get Ukraine to investigate Trump's political opponents that he called it a \"drug deal.\"\n\nHill said that Bolton told her he did not want to be part of that push, which involved White House chief of staff Mick Mulvaney, according to reports of her testimony.\n\nHill also reportedly testified that Bolton had called Trump's personal lawyer Rudy Giuliani a \"hand grenade.\"\n\nGiuliani has been at the head of a charge to have Ukraine launch investigations that could benefit Trump politically ahead of his 2020 reelection effort.\n\nThe Washington Post reported Thursday that White House trade representative Robert Lighthizer in August withdrew a recommendation to restore some of Ukraine's trade privileges after Bolton \"warned him that President Trump probably would oppose any action that benefited the government in Kyiv.\"\n\nBolton left the Trump administration on Sept. 10.\n\nTrump said he fired Bolton, while Bolton said he had resigned.", "description": "John Bolton reportedly was so disturbed by efforts to get Ukraine to investigate President Trump's political opponents, including former Vice President Joe Biden, that he called it a \"drug deal.\"", "authors": ["Dan Mangan"], "top_image": "https://image.cnbcfm.com/api/v1/image/106086037-1566225729194rts2mbec.jpg?v=1572010102", "published_at": "2019-10-25"}