{"pub": "nationalreview", "url": "https://dailymail.co.uk/sciencetech/article-6777893/Jellyfish-like-creature-demand-ANUS-making-ability.html", "downloaded_at": "2019-10-05 06:17:36.739627+00:00", "title": "Jellyfish-like creature has an on-demand ANUS making ability", "language": "en", "text": "An animal that creates a new anus every time it needs to defecate has been discovered by scientists.\n\nThe primitive creature, called a warty comb jelly, does not have a permanent orifice for removing waste.\n\nInstead it produces a tiny opening that disappears as soon as it has excreted its waste.\n\nAnimals with several anuses have previously been discovered and some use the same opening to consume food and release digested waste.\n\nThe 'transient' anus of the warty comb jelly is thought to be unique in the animal kingdom.\n\nScroll down for video\n\nThe primitive creature, called a warty comb jelly (pictured), does not have a permanent orifice for removing waste and instead produce a tiny opening that rapidly disappears as soon as it has finished releasing its waste (stock image)\n\nComb jellies resemble jellyfish but are actually members of the unrelated ctenophore group of animals.\n\nSidney Tamm of the Marine Biological Laboratory in Woods Hole, Massachusetts, published the research in Invertebrate Biology.\n\nIt was already known that they have a digestive system which is made of a separate mouth and anus.\n\nBut Dr Tamm was unable to find the permanent anus of the Mnemiopsis leidyi.\n\n'That is the really spectacular finding here,' Dr Tamm told New Scientist. 'There is no documentation of a transient anus in any other animals that I know of.'\n\nAnalysis of the animals revealed a tiny hole that opens when it defecates and almost instantly closes again.\n\n'It is not visible when the animal is not pooping,' Dr Tamm added. 'There's no trace under the microscope. It's invisible to me.'\n\nThe animal's guts are not connected to its rear physically, instead the culmination of waste expands until it touches the animal's outermost layer, the epidermis.A seamless transition then sees the guts and the epidermis fuse together and create an anal opening (stock)\n\nThe animal's guts are not connected to its rear. Instead the culmination of waste expands until the creature's guts touch the animal's outermost layer, the epidermis.\n\nA seamless transition then sees the guts and the epidermis fuse together and create an anal opening.\n\nAs soon as the waste has been dispelled the process is reversed and it disappears.\n\nThe researcher claims the find suggests an intermediate stage of evolution where an anus is needed but has yet to become a permanent feature.\n\nIt suggests this feature may have been widespread in the past, but now the wart comb jelly may be the only animal on Earth with this unique ability.", "description": "A researcher from Massachusetts found an animal that creates an anus every time it defecates before it vanishes from sight.", "authors": ["Joe Pinkstone For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/03/06/14/10653218-0-image-a-30_1551884315131.jpg", "published_at": "2019-03-06"}