{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/16/fit-again-cheslin-kolbe-ready-to-test-japan-with-searing-pace", "downloaded_at": "2019-10-16 13:47:24.185406+00:00", "title": "Fit-again Cheslin Kolbe ready to test Japan with searing pace", "language": "en", "text": "A side-effect of the crackdown on high tackles is that small is becoming beautiful again. As big hits become hazardous, off-loading is increasing, along with the pace of games.\n\nTwenty-four years ago, Jonah Lomu redefined wing play when he stampeded his way around South Africa, but here wide men of rather small stature made their mark in the group stage: Wales’ Josh Adams, Japan’s Kotaro Matsushima and Kenki Fukuoka, Scotland’s Darcy Graham and Cheslin Kolbe, the Springbok speedster who has recovered from an ankle injury to feature against the host nation in Sunday’s quarter-final at Tokyo Stadium.\n\nJapan are our World Cup enemy but we love the people, says Rassie Erasmus Read more\n\n“The ankle played up for a while, but I am back on the training field and confident,” said Kolbe, who will turn 26 on the day of the second semi-final. At 80kg and 1.72m, he stands out for his relative smallness in the most overtly physical side in the tournament. “They say dynamite comes in small packages and I think that if you are playing well it does not matter what size you are or which country you are playing in, the coach will look at you.”\n\nIf Japan’s frenetic style of play has hooked neutrals, so has Kolbe’s searing pace and his ability to step out of a defender’s reach at the point of contact, a trait rarely seen since Gerald Davies was dancing over try-lines in a Wales jersey in the 1960s and 1970s.\n\nKolbe made his name in South Africa’s sevens team and played for Western Province but his size prevented him from making an impact and in 2017, frustrated at his failure to make a breakthrough, he moved to France and joined Toulouse.\n\n“It was a stage of my career where I had started a family and it was a tough decision,” said Kolbe, who played at full-back when Toulouse defeated Clermont Auvergne to clinch the French Top 14 title last June. “I had the opportunity to go abroad and it was one I wanted to take. They welcomed me with open arms and made it easy for me.\n\n“Even though I moved to France, I still wanted to play for South Africa and my story shows that if you play at your best, you will get a chance. And now there is a World Cup final to look forward to against a Japan team who have been playing brilliant rugby. For the moment, it does not get any bigger than this.”\n\nKolbe made his Test debut against Australia 13 months ago, but such has been his impact that when it was feared his ankle injury would rule him out of the quarter-final, it was seen as a considerable set-back for the team the bookmakers fancy will contest next month’s final against New Zealand.\n\nRugby World Cup: how the quarter-finalists shape up | Michael Aylwin Read more\n\n“I love to get the ball in my hands and beat defenders, but the game is about more than that,” said Kolbe. “You have to be good in the air and in defence and it is not about me but the team. I get opportunities because of the work put in by others and we are very much a team.\n\n“We beat Japan in a warm-up last month, but it will be different this weekend and we know the challenge they will present. I have played against their two wings before and they are both explosive. We will not forget that Japan beat us in the 2015 World Cup, but the game has changed a lot since then. This is a new opportunity.”", "description": "South Africa’s winger has overcome an ankle injury and will play in the Springboks’ quarter-final against the Rugby World Cup hosts", "authors": ["Paul Rees"], "top_image": "https://i.guim.co.uk/img/media/37661fc12bd5eac6bea118486790a5b539b983b3/0_111_5443_3268/master/5443.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c6ed261083908d2df6344dcf958bf73a", "published_at": "2019-10-16"}