{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/25/deference-powerful-media", "downloaded_at": "2019-10-25 15:59:47.214481+00:00", "title": "A 'No 10 source' is the voice of power. Too many journalists simply parrot it | Gary Younge", "language": "en", "text": "“The 19th-century fetishism of facts was justified by a fetishism of documents,” EH Carr wrote in his 1961 book What is History? “But no document can tell us more than what the author of the document thought – what he thought had happened, what he thought ought to happen or would happen, or perhaps only what he wanted others to think he thought … The facts, whether found in documents or not, have still to be processed by the historian before he can make any use of them.”\n\nFor journalists, the 21st-century fetish appears to be with quotes. When powerful people say things, too many journalists simply convey them, acting not as critical interlocutors but convenient conduits. The fact that a politician has said something, apparently, makes it news. This is all too often conveyed neat – uncritiqued, unfiltered and unprocessed. It is then injected into the conversational bloodstream caffeinated by social media. It’s as though the act of journalism is limited to getting the quote and distributing, and does not extend to verifying it, contextualising it and making sense of it.\n\nWhen those quotes are non-attributed – “a senior No 10 source” or “sources within the cabinet” – the risk of the journalist becoming an enabler and participant is real. By giving voice to those who are unnamed and, therefore, untraceable, they allow those with an agenda to broadcast it without taking responsibility for it. Mistaking power for perspective and forgoing analysis for access, they can end up not reporting on the machine but making it run more smoothly.\n\nThis is in effect what happened on Tuesday, as Downing Street became aware that the government would probably win a meaningful vote on the second reading of Boris Johnson’s Brexit deal but could lose the programme motion, and have to concede more time for parliamentary scrutiny. A “Downing Street source” – we do not know who – told journalists that if the government lost on the programme motion it would withdraw the bill and demand an election. Journalists duly tweeted this as though it were a fact.\n\nThis had a material effect. As the day progressed, the MP Oliver Letwin – who’d lost the Tory whip over his opposition to no deal – responded on Twitter: “Getting seriously worried that HMG will pull Bill if Programme Motion is defeated. Surely best for all of us who regard this deal as the least of the evils to vote for the Programme Motion, whatever we really think of it.”\n\nFacebook Twitter Pinterest ‘As the day progressed, Oliver Letwin – who’d lost the Tory whip over his opposition to no deal – tweeted: “Getting seriously worried that HMG will pull Bill if Programme Motion is defeated”.’ Photograph: Simon Dawson/Reuters\n\nBut it was not a fact. It was a ploy. Johnson’s brinkmanship in getting this far had, in effect, been to threaten everybody with everything: making enough Brexit hardliners fear that if they didn’t accept his deal there would be a second referendum; and makingenough remain MPs fear that if they didn’t accept his deal there would be no deal.\n\nOn this thin and fraying thread hung his strategy to push through his deal by the self-imposed deadline of 31 October. But when faced with defeat, the government did not pull the bill. It paused the process. It was an empty threat. The only thing that made it plausible was the uncritical, unattributable reporting of it.\n\nJohnson did not invent playing the media in this way – though given his reputation for brazen dishonesty, the media’s gullibility was particularly egregious. But with a general election imminent, it’s worth casting a critical eye over the role journalism is playing in our politics.\n\nWhen the polling industry gave us misleading predictions in the run-up to the 1992 and 2015 elections, it understood that the reputation of the profession was at risk and set up inquiries to work out what had gone wrong. After the Iraq war, several outlets, including the New York Times and the Washington Post, published lengthy internal investigations into why and how they had misread the war’s buildup and the claims over weapons of mass destruction. Despite a series of clear failures, the British media has gone through no such process.\n\nMany of the inequalities we see in our political class – its concentration in London, its class and racial bias – are replicated in the media class, shaping what Gramsci termed a prevailing “common sense”. A report by the Sutton Trust and Social Mobility Commission this year shows there’s a higher proportion of Oxbridge graduates writing columns at present than there is sitting in the House of Lords. Between them they settle on a consensus of what, and who, matters and then subject those outside their sphere to coverage that is more akin to anthropology than journalism.\n\nThe upshot was most clearly witnessed during the 2017 general election, where the prospect of a Labour rout was not so much an opinion as a fact waiting to happen. Minutes before the polls closed, Piers Morgan tweeted his prediction: “Conservatives to win by 90-100 seat majority.” Four minutes later the Sun’s deputy political editor Steve Hawkes shared: “Rumour Tories could be looking at 400 seats.” When the exit poll suggested a hung parliament, in which Labour had actually gained seats and vote share, the televised choreography could not have provided a clearer metaphor. “Well, now let’s go back to the studio to ask those who got everything wrong so far what will happen next.” They still have the mic. There was no reckoning. They are still out there forecasting the future.\n\nFacebook Twitter Pinterest ‘Johnson did not invent playing the media in this way – though given his reputation for brazen dishonesty, the media’s gullibility was particularly egregious.’ Boris Johnson leaves 10 Downing Street. Photograph: Tolga Akmen/AFP via Getty Images\n\nThe mea culpas that followed that debacle were too narrowly tailored. Commentators lamented that they had predicted the wrong result, as though their job was to foresee the future. It wasn’t. The problem was that they had chronically misportrayed the present, mistaking their own political prejudice for the situation they were actually covering.\n\nThese are busy times for ‘No 10 source’. Journalists should refuse to be played | Peter Geoghegan Read more\n\nThere are important differences between the kind of malpractice behind the cavalier use of unattributed quotes by a few senior journalists, and the wider failure to interrogate and understand the shifts in British politics. The former comes from a place that is craven – suggesting a greater desire to be trusted by those in authority than by readers or viewers. The problem is not that they don’t know how to be sceptical: they were sceptical of Saddam Hussein when he said he had no WMD, or of Mark Duggan’s family when they said he didn’t have a gun. But when it comes to those in power they all too often err on the side of defence and credulity.\n\nThe latter has been the result of a chronic lack of curiosity, underpinned by crippling cynicism towards new orthodoxies and possibilities. But where the two transgressions meet is in the belief that the establishment is to be trusted, either in its pronouncements or its framing, and always given the space to make its case unchallenged in a world where its legitimacy and credibility is withering away.\n\nWith attacks on journalists on the rise, when the profession finds itself in the crosshairs of authoritarians, it is important to defend the media and those who work in it from the despot and the populist. Being honest about our shortcomings is central to that defence. In a period of rampant inequality, entrenched division and diminishing trust, we are most effective when we challenge the powerful, not when we embed ourselves among them.\n\n• Gary Younge is a Guardian columnist", "description": "When the media uncritically repeats anonymous quotes, it becomes an enabler of the establishment it should challenge, says Guardian columnist Gary Younge", "authors": ["Gary Younge"], "top_image": "https://i.guim.co.uk/img/media/47fe1171d8e36718fa567a3ee9ebb9e55d362224/0_0_3047_1829/master/3047.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=951d26fc719203efc6962e2ac3c37d76", "published_at": "2019-10-25"}