{"pub": "businessinsider", "url": "https://businessinsider.co.za/mark-zuckerberg-facebook-moderation-congress-2019-10", "downloaded_at": "2019-10-24 07:51:46.682461+00:00", "title": "A US congresswoman dared Mark Zuckerberg to spend an hour a day policing the same 'murders, stabbings, suicides, other gruesome, disgusting videos' as Facebook's moderators. He declined.", "language": "en", "text": "Facebook CEO Mark Zuckerberg faced a Congressional committee hearing on Wednesday, where lawmakers asked him about everything from user data scandals to housing discrimination.\n\nOne line of questioning targeted Facebook's content moderation practices, which rely on contracted workers who have complained of PTSD and other psychological effects of policing the most horrific content uploaded by users: Murders, suicides, hate speech, and more.\n\nWhen asked if he would personally spend an hour each day moderating the worst offenders, Zuckerberg demurred. \"I'm not sure that it would best serve our community for me to spend that much time on that, but I spend a lot of time looking at this content,\" he said.\n\nFor more stories go to www.BusinessInsider.co.za.\n\nFacebook CEO Mark Zuckerberg is a billionaire several times over thanks to his work at Facebook.\n\n\n\nThe tens of thousands of contractors that Facebook employs through a third-party service are not billionaires, and many are making as little as $30,000 (R438,000) per year to police the site for the prohibited, and typically horrific, content that gets uploaded every minute.\n\nThat much was revealed in a report from The Verge earlier this year, which highlighted the poor working conditions of those contractors as they removed child pornography, gruesome deaths, and other such content uploaded by users to Facebook.\n\n\"You've got about 15,000 contractors watching murders, stabbings, suicides, other gruesome, disgusting videos, for content moderation Correct?\" Rep. Katie Porter asked Zuckerberg on Wednesday during a Congressional hearing. \"Yes, that is correct,\" he answered.\n\nIn addition to the difficult job they have, these moderators are said to suffer from difficult working conditions.\n\n\n\n\"According to one report I have, and this is straight out of an episode of 'Black Mirror,' these workers get nine minutes of supervised wellness time per day,\" Rep. Katie Porter said to Zuckerberg on Wednesday. \"That means nine minutes to cry in the stairwell while someone watches them.\"\n\nBefore Zuckerberg could push back, Porter asked, \"Would you be willing to commit to spending one hour per day for the next year watching these videos and acting as a content monitor, and only accessing the same benefits available to your workers?\"\n\nWithout answering the question, Zuckerberg pointed to the \"good benefits\" all content moderators employed by Facebook have. But Porter cut him off.\n\n\"Mr. Zuckerberg I'm looking for a yes or a no. Would you be willing to act as a content monitor? To have that life experience?,\" she said.\n\n\"I'm not sure that it would best serve our community for me to spend that much time,\" he said. \"But I spend a lot of time looking at this content.\" Porter cut him off once again. \"Are you saying you're not qualified to be a content moderator?\" she asked.\n\n\"No Congresswoman, that's not what I'm saying,\" he responded. The Congresswoman had one more response: \"Okay then you're saying you're not willing to do it.\"\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "During an hours-long Congressional hearing on Wednesday, Facebook CEO Mark Zuckerberg was grilled about content moderator working conditions.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/6037/65dcb6addf30472fae8dc1057709c95c.jpg", "published_at": "2019-10-24"}