{"pub": "morningstar", "url": "https://morningstar.com/articles/944869/ultimate-stock-pickers-top-10-buys-and-sells", "downloaded_at": "2019-09-04 23:48:09.228592+00:00", "published_at": "2019-09-04", "title": "Ultimate Stock-Pickers' Top 10 Buys and Sells", "language": "en", "text": "For the past decade, our primary goal with Ultimate Stock-Pickers has been to uncover investment ideas our equity analysts and top investment managers find attractive, in a manner timely enough for investors to gain some value. As part of this process, we scour the quarterly (in some cases, the monthly) holdings of 26 different investment managers: 22 managers oversee mutual funds covered by Morningstar's manager research group and four Stock-Pickers run the investment portfolios of large insurance companies. As holdings data becomes available, we attempt to identify trends and outliers among their holdings as well as any meaningful purchases and sales that took place during the period under examination.\n\nIn our last article, we walked through the Ultimate Stock-Pickers' purchasing activity during the second quarter of 2019. The piece itself was an early read on the purchases--focused on high-conviction and new-money buys--that were made during the period, based on the holdings of almost all our top managers. As all of our Ultimate Stock-Pickers have reported their holdings for the period, we think that it is appropriate to examine our managers' high-conviction purchases and sales. As stock prices have changed since our Ultimate Stock-Pickers chose to purchase or sell the holding, we urge investors to analyze securities at current valuation levels before making any investment decisions and we provide our fair value estimates, moat ratings, stewardship ratings, and uncertainty ratings to help investors make these decisions.", "description": "Six of the top 10 conviction purchases are undervalued.", "authors": [], "top_image": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/bltb383cfbf7fca7e83/5cae95f6529a88e3487efd50/AuthorPlaceholder_1x1.png"}