{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/instagram-fuelling-mental-health-crisis-20551865", "downloaded_at": "2019-10-10 18:33:29.997020+00:00", "title": "Instagram 'fuelling mental health crisis' with \"Fix Me\" plastic surgery filter", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nInstagram has been accused of fuelling insecurity amongst young Brits after it published a filter which appeared to promote plastic surgery.\n\nThe filter - which is called \"Fix Me\" - mimics how a cosmetic surgeon might map out the lifts and tucks they will make on the operating table.\n\nIt suggests how the user could undergo an eyebrow lift and that fillers could be inserted into the cheeks.\n\nBlack lines appear scribbled over the person's face in order to highlight the supposed 'problem areas.'\n\nOne student wrote: \"I'm sorry but why when fillers and surgery is so in demand and everywhere around young girls, would Instagram think it's appropriate to create a filter that makes your nose half the size and your lips twice as big??\"\n\nIn August, the photo-sharing app started to allow users to upload their own virtual face effects that people can add to their Instagram stories.\n\nWhilst other filters were available before, this update meant users could create their own designs for people to use.\n\n(Image: Mirrorpix)\n\n(Image: Mirrorpix)\n\nNow people can browse an Effects Gallery where users can try effects that they like.\n\nMirror Online found other augmented reality filters with names include as \"Plastics\", \"Beautiful Face\" and \"Perfect Face\".\n\nThey allow people to look as if they have had plastic surgery and have narrower noses, smoother skin and plumped up lips.\n\nIn September, Facebook , the owner of Instagram, announced it would crack down on adverts promoting cosmetic surgery and diet products.\n\nThey said that some posts would be hidden and others removed from the site completely.\n\nNow charities and mental health experts have called on the social media giant to remove the filter.\n\nYoung Minds Director of Campaigns, Tom Madders, said: \"While filters can be fun on social media, young people shouldn’t feel the need to doctor images of themselves to adhere to society’s standard of beauty.\n\n\"It’s important to remind young people that social media doesn’t reflect reality, that there is no single definition of beauty and no right or wrong way to look.\n\n\"If you’re struggling with your body image, try to focus on other areas of your life that are going well and talk to someone you trust about how you’re feeling.\"\n\nA spokeswoman for the Body Dysmorphic Disorder Foundation said the filters could fuel young people's insecurity.\n\nThe disorder, which sees people obsess over perceived flaws in their appearance, is more common amongst teenagers and young adults.\n\nThe NHS warns that the disorder can also lead to depression, self harm, and even thoughts of suicide.\n\nSpokeswoman Kitty Wallace said: \"Filters that alter the way individuals look are highly likely to fuel mental health problems in vulnerable individuals, particularly young people.\n\n\"Young people are already bombarded by idealised body images via the media which exacerbate feelings of insecurity and anxiety about their appearance.\n\n\"Filters such as this only serve to reiterate the message that young people are not good enough as they are and that cosmetic procedures can be used to solve the problem.\n\n\"In fact, we know that individuals who have cosmetic procedures can become even more concerned and fixated by their appearance.\n\n(Image: Mirrorpix)\n\n(Image: Mirrorpix)\n\n\"We need to safeguard young people and also vulnerable adults from such damaging messages.\n\n\"We urge Instagram to do better and to think about the impact they are having on the mental health of their users.\"\n\nNow questions have now been raised over whether the giant is doing enough to protect its young users by checking which filters it approves.\n\nOne filter called \"Holy Bucks\" which appears to show people with the effects of lip fillers was criticised online.\n\nOne Twitter user said: \"The holy bucks filter is dangerous, fillers and a nose job pleeease.\"\n\nAnother wrote: \"That ‘holy bucks’ instagram filter reaaallly got every girl considering lip and jaw fillers.\"\n\nAnd someone tweeted: \"That holy bucks filter on insta is makin me want lip fillers so bad.\"\n\nNHS chief executive Simon Stevens has previously said social media giants need to rein in \"harmful or misleading content\" that could harm people's health.\n\n(Image: Mirrorpix)\n\n(Image: Mirrorpix)\n\nNow Natasha Devon, the UK government's former tsar for children's mental health, has warned the filters could be damaging.\n\nShe said: \"It’s been shown in numerous studies that looking at pictures of highly photoshopped models conveying impossible beauty standards can induce feelings similar to trauma in vulnerable individuals.\n\n\"Unconscious comparison with our own real bodies is unavoidable, but at least we could reason that those models likely had a whole dedicated team to make them look that way.\n\n(Image: Mirrorpix)\n\n(Image: Surrey Advertiser)\n\n\n\n\n\n\"Now, owing to filters and apps, we’re competing against an idealised version of ourselves.\n\n\"What we see in the mirror can never compete.\"\n\nLife coach Jane Evans, who focuses on childhood anxiety and parenting, added: \"We know there’s more pressure on youngsters to look flawless based on artificially created images.\n\n\"Young people are especially emotionally vulnerable to these unrealistic expectations as it’s linked to feeling acceptable which means you belong with your tribe, a most basic human need for us all.\n\n\n\n\"Sadly if membership requires perfection it can increase feelings of rejection which impact mental health.\"\n\nAfter being contacted by Mirror.co.uk, Instagram removed the filter.\n\nA Facebook company spokesman said: “The ‘Fix me’ filter created by a third party developer on the Spark AR platform has been removed for violating our guidelines.\n\n\"We’re constantly looking at how filters might impact people’s wellbeing and are in the process of re-evaluating our policies in this area.\n\n\"We review camera effects developed for the Spark AR Platform against Facebook’s Spark AR Policies, Terms, and Community Standards.\n\n\"Effects Instagram creates and makes available to the entire community are subject to additional requirements.\n\n\"People can report a Spark AR effect or a Story they feel is inappropriate or violates our guidelines.”", "description": "EXCLUSIVE: The filter mimics how a cosmetic surgeon would map out the lifts and tucks they will make on the operating table", "authors": ["Rosaleen Fenton", "Image", "Mirrorpix", "Surrey Advertiser"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20552773.ece/ALTERNATES/s1200/0_insta.jpg", "published_at": "2019-10-10"}