{"pub": "yahoo", "url": "https://uk.style.yahoo.com/dobbies-now-offer-free-plastic-160300540.html", "downloaded_at": "2019-09-27 16:39:23.978817+00:00", "title": "Dobbies now offer a free plastic pot and tray return service", "language": "en", "text": "From House Beautiful\n\nDobbies Garden Centres has introduced a new free plastic plant pot return service, encouraging customers to drop off old or unwanted plastic pots and trays.\n\nWith half a million plastic plant pots ending up in landfill each year, this initiative is a great way to ensure the ones you no longer need don't end up in landfill. To help you with recycling yours, the UK's leading garden centre is now giving everyone the chance to properly return them and do their bit for the environment.\n\nTo return yours, simply wash your pot or tray to remove soil (all sizes, shapes and colours are accepted), and drop them off at any of the allocated return points based in each Dobbies centres. Just make sure that your pot is plastic, not polystyrene, in order for it to be recycled.\n\nBut what happens to the pots once they have been returned? 'Working with our national waste management partners, we bale the plastic pots and trays onsite, and they are collected and taken to regional recycling plants where they are processed and turned into plastic pellets to be turned back into new plastic items,' a spokesperson for Dobbies tells House Beautiful UK.\n\nDobbies is also keen for local community groups, schools, nurseries and local charities to reuse any of the pots for projects.\n\nPhoto credit: johnbraid - Getty Images More\n\n'Our ethos goes beyond providing the best garden products, service and advice. We make it our number one priority to be responsible and care for our environment,' says Marcus Eyles, Horticultural Director at Dobbies. 'Our pot and tray return service is a huge step in the right direction on reducing the environmental impact and a sustainable approach for the future.'\n\nWhat is Dobbies doing to help remove plastic from its pots?\n\n'We are working with our supply chain partners to ensure we are removing as much plastic as possible from our packaging,' Dobbies tells us.\n\nDobbies has reduced single-use plastics throughout its restaurants and also within stores. 'Introducing paper bags, paper straws and cardboard for our bakery goods are just some of the ways in which we have made changes.\n\n'All carrier bags available at tills will be paper by the start of 2020. We are also continuously working with our suppliers to reduce use within the supply chain.'\n\nAs well as recycling your plant pots, another option for gardeners to consider is biodegradable pots made from natural materials like rice, coconut husks or wood chips.\n\nOn average, it takes single-use items such as plastic plant pots around 450 years to biodegrade, so choosing ones made from planet-friendly materials means you're already making a difference.\n\n\n\nTo find your nearest Dobbies drop-off zone, head over to their website.\n\nLike this article? Sign up to our newsletter to get more articles like this delivered straight to your inbox.\n\nSIGN UP\n\nYou Might Also Like", "description": "'We make it our number one priority to care for our environment.'", "authors": ["Lisa Walden"], "top_image": "https://s.yimg.com/uu/api/res/1.2/KfEAZ9i.zGoMRp4CDbWj2w--~B/aD03MjM7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/house_beautiful_473/fd9ea64e55514d259047e538a68a20cb", "published_at": "2019-09-27"}