{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/10/17/turkish-officials-threw-trumps-threatening-letter-trash", "downloaded_at": "2019-10-18 01:06:32.278918+00:00", "title": "Turkish officials: We threw Trump’s threatening letter in the trash; Update: Turkey to cease fire in return for end to sanctions and Kurdish retreat", "language": "en", "text": "That would be the same letter that everyone apart from MAGA Nation was making fun of yesterday for sounding … a little too Trump-y, let’s just say. Normally I’d call this counter-bluster by the Turks just that — bluster, empty rhetoric aimed at their domestic audience to show that the strong man Erdogan is willing to laugh in the face of the president of the United States.\n\nBut everything Turkey’s done since the letter was sent suggests that they really did scoff at Trump’s threats. He urged them not to invade; they went right ahead and did so. Trump urged them to cease fire and threatened sanctions. The Turkish offensive proceeded. Yesterday POTUS took to assuring reporters that the Kurds are no angels and that the PKK is worse than ISIS. That is to say, realizing he was powerless to end his humiliation from the Turks’ defiance, he resorted to Turkey’s own propaganda about how the offensive was actually not only necessary but good.\n\nSo why wouldn’t they have also chucked his letter in the garbage?\n\nIt has now been confirmed as genuine by the White House, but soon after the leak on Wednesday, thousands of Turks asked each other on Twitter and WhatsApp whether the letter was authentic or a joke… “We just dumped his letter into the trash,” one [Turkish official] said. “The date on the letter is 9 October, the same day we began Operation Peace Spring. Our president gave the best response by launching the operation on the same day at 4pm,” the official told MEE… Erdogan earlier this week complained that he doesn’t understand what Trump wants anymore. “We can no longer follow Trump’s tweets. We cannot track them. There is a stark change in his stance compared to last night,” he said.\n\nWhy did the White House even release this letter? It was a week old when it emerged yesterday afternoon and had already been overtaken by events. The answer, per the Times, appears to come from yesterday’s “meltdown” meeting at the White House between Trump and Democratic leaders. Pelosi wanted to know why Trump condoned Turkey’s onslaught towards the Kurds. I didn’t condone it, Trump countered, and I have proof — at which point he asked Kevin McCarthy to pass around copies of the now-famous letter. Once Democrats had it, it was destined to leak. So the White House had no choice but to confirm it.\n\nImagine the look on McCarthy’s face when Trump asked him to circulate the letter, realizing that that would mean the world would soon see it too.\n\nEmbarrassment about the rhetoric wasn’t the worst part. A Turkish expert pointed out that leaking a threatening letter the night before Mike Pence and Mike Pompeo met with Erdogan would risk hardening Erdogan’s resolve to resist U.S. pressure. He’d look weak at home if he bowed to American demands for a ceasefire under any circumstances but to bow after Trump had revealed that he’d warned Erdogan not to be a “fool” would compound the humiliation. Pence’s and Pompeo’s job suddenly got much harder, to the point where Erdogan’s office is now telling reporters that the letter was actually “the final straw” that convinced him to authorize the offensive in northern Syria.\n\nBut he needs to be careful. Erdogan knows Trump doesn’t care how many Kurds he kills but he will care if Turkey humiliates him personally. He’s a strongman too and needs to project “strength” to his own base. Erdogan seems to understand that: That’s why he backed off yesterday after initially claiming that he wouldn’t meet personally with the president’s envoys, Pence and Pompeo. Not only did he meet with Pence today, it sounds like they’re having quite a conversation:\n\nPence-Erdogan meeting is still ongoing, approaching 4 hours. — Zeke Miller (@ZekeJMiller) October 17, 2019\n\nI doubt he’ll agree to a ceasefire after just eight days but maybe Pence will put something on the table that’ll convince him to scale back operations. What about rescinding the new U.S. sanctions on Turkey? Those probably aren’t going to hurt much and might even boost Erdogan’s popularity among his constituents, but it’s something. If that’s not enough, how about … a clean bill of legal health in America for the Turkish bank accused of violating U.S. sanctions on Iran? The White House isn’t supposed to interfere with criminal investigations for political reasons but the Trump era is full of novelties.\n\nA simple promise Trump could make in exchange for Erdogan backing off the Kurds would be to veto any additional sanctions on Turkey that might come out of Congress. Lindsey Graham gave a press conference within the past hour threatening such sanctions. Can he get to a veto-proof majority? If not, there’s probably nothing to talk about.\n\nSen. Lindsey Graham introduces bipartisan sanctions legislation against Turkey: \"We appreciate what the president did with sanctions against Turkey. We're here to add to it … We will impose sanctions in the strongest measure possible.\" https://t.co/RbFZav3Dh9 pic.twitter.com/NnR22sYn2b — This Week (@ThisWeekABC) October 17, 2019\n\nUpdate: Yep, there’s the deal — all U.S. sanctions go away in return for a Turkish ceasefire for five days. During that time, the Kurds will have to withdraw from the “safe zone” near the border. If they do, presumably the operation’s over.\n\nBREAKING: After hours-long talks Thursday, VP Pence says US and Turkey have agreed to a ceasefire in Syria; says Turks will pause their operation for 120 hours to allow YPG forces to withdraw from “the safe zone.” — NBC News (@NBCNews) October 17, 2019\n\nNEW: PENCE says us will not impose any new sanctions on Turkey, and TRUMP will withdraw sanctions put in on Monday. — Jake Sherman (@JakeSherman) October 17, 2019\n\nHopefully that means the killing is finished, but if the deal holds it’ll also mean that Turkey’s mission was a success. They wanted the Kurds cleared out of the border area; the U.S. is now politely asking the Kurds to comply with that demand in return for the guns falling silent until next week. What do the Kurds do?\n\nUpdate: It sounds like Erdogan’s going to get everything he wants here, a territory cleansed of Kurds, and he’ll get it without having to risk the lives of any more Turkish troops. Even better for him, if the Kurds refuse to retreat, Erdogan can then start shooting again and claim that it’s the Kurds who are defying the United States now, not him. I hope the Kurds are onboard here.\n\nBIG – #Pence confirms that the full #YPG withdrawal will be taking place in a territory 20miles (32km) deep. If enacted (unclear), that's the maximalist demand originally set by #Erdogan. However this is spun, it's a huge concession from the #Trump admin/US government. pic.twitter.com/bfVRZbsgH3 — Charles Lister (@Charles_Lister) October 17, 2019\n\nUpdate: Turkey is insisting that this isn’t a ceasefire. It’s more of a “you have five days to get out of Dodge” demand to the Kurds.\n\nTurkish FM Çavuşoğlu just now: \"We will suspend the Peace Spring operation for 120 hours for the PKK/YPG to withdraw. This is not a ceasefire.\" — Piotr Zalewski (@p_zalewski) October 17, 2019\n\nUpdate: This is in fact how the “deal” appears at this hour. We’ll see how the Kurds react.\n\nPence thus confirms it. So the YPG have to give the ground? It's basically Turkey = mission accomplished via US diplomacy rather than guns. https://t.co/7GiLOTmYPu — Tom Rogan (@TomRtweets) October 17, 2019", "description": "\"Our president gave the best response by launching the operation on the same day at 4pm.\"", "authors": ["Ed Morrissey", "John Sexton", "Jazz Shaw"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/t-9.jpg", "published_at": "2019-10-17"}