{"pub": "abcnews", "url": "https://abcnews.go.com/US/dead-pittsburgh-apartment-party-horror/story?id=65778902", "downloaded_at": "2019-09-22 15:18:06.109143+00:00", "title": "At least 3 dead in Pittsburgh apartment party horror", "language": "en", "text": "At least three partygoers, all wearing orange wristbands, died early Sunday and four others were hospitalized following a medical emergency at an apartment party in Pittsburgh, officials said.\n\nPolice and paramedics were called to the South Side City Apartments around 2 a.m. and discovered seven people in medical distress, including two who were unresponsive, police said.\n\nAll of the victims were wearing orange wristbands apparently connected to one of the apartments, police said.\n\nOne man was found passed out in the street outside the apartment building and later died, police said at a news conference. Another victim was found unresponsive in an elevator, according to authorities.\n\nGoogle Maps Street View\n\nWhen police officers went inside the apartment where a party had occurred, they found five other partygoers in need of medical assistance, authorities said.\n\nThe five people found inside the apartment were taken to a hospital with conditions ranging from serious to critical, officials said.\n\nPolice were investigating the cause of the deadly incident. Pittsburgh Public Safety Director Wendell Hissrich said at a news conference Sunday morning that police have found at least two venues that were hosting parties where orange wristbands were used.\n\nInvestigators are looking into the possibility that the deaths and injuries were caused by drug overdoses, officials said.\n\nAir tests in the apartment and throughout the complex came back negative, authorities said.\n\nPolice said no drug paraphernalia was found inside the building.\n\nABC News' Ahmad Hemingway contributed to this report.\n\nThis is developing story. Please check back for updates.", "description": "At least three partygoers died and four others were hospitalized in serious to critical condition following a medical emergency at an apartment party in Pittsburgh.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/pittsburgh-ht-er-190922_hpMain_16x9_992.jpg", "published_at": "2019-09-22"}