{"pub": "foxnews", "url": "https://foxnews.com/world/new-zealand-student-body-discovered-dorm-room", "downloaded_at": "2019-09-25 13:43:38.977363+00:00", "title": "New Zealand student lay dead in dorm room for nearly 2 months before his body was discovered: reports", "language": "en", "text": "A New Zealand university student was dead in his dorm room for nearly two months before his body was finally discovered, reports say.\n\nThe body was found Monday night at the Sonoda residence at the University of Canterbury, in Christchurch, after fellow students noticed a foul smell and notified officials, Stuff reported.\n\nAccording to the report, the student’s father also contacted police after he was unable to reach his son. Police did not confirm this.\n\nWIMBLEDON FINALIST'S NIECE DIES UNEXPECTEDLY DURING TRIP TO WASHINGTON, FAMILY SAYS\n\nPolice declined to identify the student, say how long he’d been missing or specify a cause of death. Detective Senior Sgt. Craig Johnson told the Associated Press that an investigation is underway.\n\nOn Wednesday, the country’s education minister, Chris Hipkins, called for an investigation, saying the death was deeply troubling.\n\n“If you’re going into a hall residence or a hostel, you are paying top dollar for not just a roof over your head but also the pastoral care that goes with that,” Hipkins told the AP. “And I think clearly that’s not been present in this case.”\n\nHe added: “We’ll be looking closely at the regulatory and legal arrangements around the halls of residence and hostels to make sure they are as strong as they need to be. But clearly, I am really concerned about this case.”\n\nNEW ZEALAND MAN ADMITS HE SMASHED CARS WITH AX AFTER DRINKING 48 BEERS\n\nAccording to reports, the student’s room was at the end of a long corridor and not attended to by the hall’s cleaners as they only worked on common areas.\n\nPolice said an autopsy was conducted Tuesday. Investigators were still finishing up a scene examination on Wednesday.\n\nUniversity Vice Chancellor Cheryl de la Rey said in a statement that it was \"inconceivable to imagine how these circumstances could have occurred.\"\n\nShe said the university has an extensive well-being program and that residential assistants also support students in dorms. She said the university would commission an independent investigation.\n\n“This is an extremely distressing time for university students and staff. The University of Canterbury is doing everything it can to support the police investigation into the tragic death,” she said in a statement.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe dorm is run by the Australian company Campus Living Villages, which also operates dorms in the U.S. and Britain. The company said it was saddened by the death but wouldn't be commenting on the circumstances after the student's family requested privacy.\n\nThe university's second semester began in mid-July, as New Zealand universities typically take their summer breaks in December and January.\n\nThe Associated Press contributed to this report.", "description": "A New Zealand university student was dead in his dorm room for nearly two months before his body was finally discovered, reports say.", "authors": ["Lucia Suarez Sang"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/AP19268179003392.jpg", "published_at": "2019-09-25"}