{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/2019/10/06/dover-air-force-base-behind-scenes-column/3865561002", "downloaded_at": "2019-10-06 12:24:12.928102+00:00", "title": "Behind the scenes at Dover Air Force Base — where casualties of America's wars come home", "language": "en", "text": "CLOSE\n\nThe emotional journey of the military unit that cares for the bodies of America's war dead — and the rising number of suicides.\n\nUS Army First Sgt. Nicole McMinamin works in the room that stocks all the uniforms as well as decorations and insignias that will be used as part of the uniform to dress the deceased members of the military. The ribbons she holds are part of what she puts together for the fallen. It is part of the mortuary at Dover Air Force Base in Delaware where the remains of America’s military who have fallen arrive and are prepared before being released to their families. (Photo: Chris Pedota, NorthJersey.com-USA Today Network)\n\nDOVER AIR FORCE BASE, Delaware — There is no room for mistakes here.\n\nThe flag-draped silver case with a soldier’s body must be carried slowly down the ramp of a U.S. Air Force cargo plane. No tilting. No slipping. The final uniform jacket worn to the grave must be wrinkle free, the pants' creases razor sharp, with all rank insignias, stripes and tiny oak leaf clusters perfectly placed. And for the surviving families who come in tears, there must bowls of chocolates and mints — and even a refrigerator full of pizza and meatloaf in a hotel-like compound.\n\nNothing can be left out or guessed at.\n\nSuch is the unspoken commitment of the soldiers — and even some civilians, too — who labor in a nondescript building at this Air Force base in the Delaware flatlands that has become the unlikely bridge to America’s endless wars.\n\nOfficially, it’s called Air Force Mortuary Affairs Operations unit. Unofficially, it’s where America tries to bring some comfort to a moment that is exceedingly uncomfortable — when the bodies of those lost in overseas combat zones are brought home.\n\nStory continues below the video.\n\nCLOSE The mortuary at Dover Air Force Base in Delaware where the remains of America’s military who have fallen arrive. Chris Pedota, NorthJersey\n\nRecently, NorthJersey.com and the USA TODAY NETWORK were granted exclusive access to the behind-the-scenes workings of the mortuary unit. What emerged was not so much a story of death but a tale of ordinary people struggling to preserve some small flicker of humanity amid the carnage of war.\n\nTheir assignment — in one of the U.S. military's most sensitive and gruesome units — could call on them to search for the right brigade patch for a final uniform that a soldier will wear to the grave. It could also mean looking into the eyes of a young wife who lost her husband in Iraq or Afghanistan and saying, \"It's OK not to be OK.\" In recent years, it has also meant dealing with an alarming increase in suicides.\n\n“We do the behind-the-scenes stuff that nobody wants to think about,” said U.S. Army Sgt. 1st Class Nicole McMinamin, one of several soldiers who assemble uniforms for the dead at the mortuary unit.\n\nWomen are an essential element of peace: Afghanistan peace talks: Lasting peace is impossible without women at the negotiating table\n\nWhat's striking about the process is that, like war itself, there is no established schedule. A soldier dies in a faraway place. But bringing a body home may take a few days — or longer.\n\nAnd then, it could be well after midnight when a hulking, gray Air Force cargo plane finally completes its flight across the Atlantic and glides to a stop on the Dover tarmac, sometimes to be greeted by a high-ranking government official such as President Donald Trump, a row of Pentagon generals and a grieving family.\n\nNo matter. The mortuary unit is on constant alert to receive a body.\n\nCommander, Air Force Mortuary Affairs Operations, Colonel Dawn Lancaster in front of the memorial wall in the lobby of the Charles C. Carson Center for Mortuary Affairs. It is part of the mortuary at Dover Air Force Base in Delaware where the remains of America’s military who have fallen arrive and are prepared before being released to their families. (Photo: Chris Pedota, NorthJersey.com-USA Today Network)\n\nDuties sad and solemn\n\nIn an interview, the unit’s commander, Air Force Col. Dawn Lancaster, became so emotional as she described the monumental weight of the tasks facing her cadre of several dozen Army and Air Force members that she started to cry.\n\n“I’ve done a lot of cases,” said Lancaster, a 26-year Air Force veteran who has deployed overseas six times and escorted hundreds of soldiers’ remains from the Dover tarmac. \"I remember them all. You don’t forget.”\n\nIndeed, remembering seems part of the DNA here.\n\nYou walk into the sun-washed main hall and atrium of the unit’s headquarters, past a brown-gray marble wall with the words “Dignity, Honor and Respect” engraved in gold, and come face to face with memorial that features the names of some of America’s most shocking catastrophes that have produced bodies for the unit to handle for the past half-century. There are references to the Marine Barracks bombing in Beirut in 1983, the Black Hawk Down incident in Somalia in 1993, the space shuttle crashes, the African embassy bombings, the mass shooting at Fort Hood.\n\nAnd on and on.\n\nFor the past two decades, however, most of the casualties have come from Iraq and Afghanistan — what has become known as America’s longest and perhaps endless wars.\n\nNo one expected us to return: As teens, we could have sought asylum in America. Instead, we came home to Afghanistan.\n\nMore than 6,800 U.S. military personnel and American civilians assigned to various combat jobs have perished in Iraq and Afghanistan since the terrorist attacks of Sept. 11, 2001. In just the last decade, as those conflicts were supposedly winding down, the remains of 2,102 Americans who died in the various war zones have come through Dover — 46 so far this year.\n\nOn a wall in the corner, beyond a pond brimming with nearly a dozen koi fish — their yellow, orange, black and red scales flashing in the water — hangs a framed Arizona Cardinals football jersey worn by Pat Tillman before he gave up his promising career in the National Football League in 2002 to enlist in the Army.\n\nTillman, who became an elite Army Ranger, was killed in Afghanistan in 2004. His body returned to America through Dover.\n\n“It doesn’t get easier,” Lancaster said as she looked back on the two decades of conflict that America has endured. “It’s one thing when you are dealing with deaths that are of a hostile nature. That’s what we do in the military — and we understand that. And we understand that’s a risk. What’s difficult now, unfortunately, is dealing with the suicide problem. Those are hard to understand and wishing you could have done something to help that young man or woman find another way.”\n\nOn May 7, 2013 the casket containing the remains of Marine Staff Sgt. Eric Christian, killed in Afghanistan, arrives at Dover Air Force Base. Christian's home town was Ramsey. Marines carried the remains off the plane as part of the Dignified Transfer. (Photo: CHRIS PEDOTA, CHRIS PEDOTA / THE RECORD)\n\nLancaster should know.\n\nTwo weeks before she spoke to NorthJersey.com, she revealed to her staff that she had attempted suicide more than two decades before as a newly minted second lieutenant.\n\nLancaster was just 24 and had graduated only a year earlier from the Air Force Academy. But, as she tells the story, she “screwed up” on her first assignment — so badly that her boss transferred her. Thinking her Air Force career was over, she washed down a bottle of sleeping pills with a bottle of tequila.\n\nBut she telephoned a friend. And that friend, she said, saved her.\n\nColumn continues below gallery.\n\nLancaster told her staff the story as a way of calming what she noticed was a growing concern about the growing number of military deaths by suicide they have handled — six in just one month earlier this year. Her message was simple: Almost anyone, even the strongest and most confident people, might be capable of suicide at some point — or the depressed feelings that lead to it.\n\nEven if her unit has to carry the body of a suicide victim and prepare a burial uniform, Lancaster insists that it would not be handled any differently from a soldier who died heroically and was awarded the Medal of Honor.\n\n“No matter how or where that member died, they chose to serve and defend our nation,” she said, her eyes welling up with tears again. “They stood up and said, ‘I volunteer.’ We need to honor them in that sacrifice.”\n\n“If it’s suicide,” she added, “who knows what the wounds are that they are carrying?”\n\nA Air Force C5 cargo plane on the runway at Dover Air Force base. Dover Air Force Base houses the military mortuary at in Delaware where the remains of America’s military who have fallen arrive and are prepared before being released to their families. (Photo: Chris Pedota, NorthJersey.com-USA Today Network)\n\nThe process\n\nOnce a soldier’s remains arrive, military medical examiners have to make a major decision: Can the soldier’s body be seen by family members in a coffin? Sometimes, because of the horrific nature of warfare, a soldier’s body might be so mutilated or dismembered that it is classified as “unviewable.”\n\nThat painful news has to be delivered to the soldier’s family by the unit.\n\n“Most of the families are in shock,” said Major Darren Schwartz, 52, an Army National Guard chaplain from Montana who is assigned to the Dover unit for 2019.\n\n“Sometimes they’re lost,” said Schwartz, a Southern Baptist minister who works in civilian life as a hospital chaplain in Kalispell, Montana. “Sometimes they’re angry. They’re angry at the Army. Sometimes it can be hard to gauge all of that. There aren’t always a lot of great words.”\n\nSchwartz calls himself privileged “to meet these families.” But he adds: “I wish we didn’t have to do that.”\n\nRegardless of what state a soldier’s body is in, the unit “builds” a uniform for burial in a room that seems more akin to a tailor's shop.\n\nNear a back wall, in front of four mannequins wearing wearing Army, Marine, Navy and Air Force uniforms, racks of pants, jackets and shirts from all branches of the U.S. military hang in rows. Men's uniforms in one section; women's uniforms in another. And for families who don’t want a uniform, there are black civilian suits.\n\nUS Air Force Master Sgt. Naomi Bouska works in the room that stocks all the uniforms that will be used to dress the deceased members of the military. It is part of the mortuary at Dover Air Force Base in Delaware where the remains of America’s military who have fallen arrive and are prepared before being released to their families. (Photo: Chris Pedota, NorthJersey.com-USA Today Network)\n\n“We will honor whatever the family wishes,” said Air Force Master Sgt. Naomi Bouska, 34, of Chaska, Minn. “If the family wishes them to buried in their favorite sports jersey and jeans, we will do that if the family provides.”\n\nBouska, who majored in theater at the University of Wisconsin, said she is often deeply moved by the task of pulling together a soldier’s burial uniform.\n\nBouska tries to read up on each soldier's history in the military — where they went to school, what military specialty they might have had, what medals they were awarded and, if possible, how they died.\n\n“It paints a picture,” she said. “It goes back to the history of the individual. You get to honor the legacy of a fallen hero. They’ve given everything. I can give something back to them and to the families.”\n\nBouska’s compatriot in the “uniform shop,” Army Sgt. First Class Nicole McMinamin, specializes in “building the ribbon rack” — the rows of medals that are placed on the left chest of every soldier’s uniform, above the heart.\n\nMcMinamin, 38, of Plymouth, Mass., said she was drawn to the military’s mortuary unit after working several years as a hospice nurse.\n\n“I get attached to people,” she said. “So when I was taking care of a specific individual for a couple of years in hospice, after she passed away I wanted to continue to help the families, but in a different way.”\n\nThe mortuary unit, she said, helps “with bringing closure to families” and “is something that I really found that I wanted to do.”\n\nUS Army First Sgt. Nicole McMinamin works in the room that stocks all the uniforms as well as decorations and insignias that will be used as part of the uniform to dress the deceased members of the military. It is part of the mortuary at Dover Air Force Base in Delaware where the remains of America’s military who have fallen arrive and are prepared before being released to their families. (Photo: Chris Pedota, NorthJersey.com-USA Today Network)\n\nIf a soldier’s body is badly mutilated, the remains are wrapped in a sheet and then in a wool Army blanket. The uniform assembled by Bouska and McMinamin is then placed atop the remains in a casket.\n\nSuch work is understandably draining. The soldiers say they often lean on each other for comfort.\n\nLancaster initiated a “resiliency program” that ranges from basic meetings, where members of the unit share their feelings, to group spin classes or an occasional pizza party.\n\nSometimes the unit members seek out Schwartz, however, for some of the comfort and insight he passes to the families of the soldiers who died.\n\nBut there is no easy prescription, no standard set of instructions to follow. Each day can bring another tragic tale with another soldier's remains returning from the battlefield.\n\n“This changes you,” Schwartz said of the work of the unit. “The challenge is to make sure it changes you for the better.”\n\nMike Kelly is a columnist for the North Jersey Record, where this column originally appeared. Follow him on Twitter: @MikeKellyColum\n\nYou can read diverse opinions from our Board of Contributors and other writers on the Opinion front page, on Twitter @usatodayopinion and in our daily Opinion newsletter. To respond to a column, submit a comment to letters@usatoday.com.\n\nRead or Share this story: https://www.usatoday.com/story/opinion/2019/10/06/dover-air-force-base-behind-scenes-column/3865561002/", "description": "The emotional journey of the military unit that cares for the bodies of America's war dead — and the rising number of suicides.", "authors": ["Mike Kelly", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/25/PNJM/ee5aecc2-0351-4e47-ae9c-c7d42cf39893-091219_Dover_0002.JPG?crop=5759,3240,x0,y292&width=3200&height=1680&fit=bounds", "published_at": "2019-10-06"}