{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7558953/The-moment-man-pours-beer-alligators-throat-caught-video-emerged.html", "downloaded_at": "2019-10-10 15:17:38.161197+00:00", "title": "The moment a man pours beer down alligator's throat is caught on video that has emerged", "language": "en", "text": "Shocking video shows the moment two Florida men force an alligator to drink beer after fetching the reptile off the road.\n\nFootage shows Timothy Kepke, 27, and Noah Osborne, 22, terrorizing the alligator in Palm City on August 26 at around 10pm.\n\nThe Florida Fish and Wildlife Conservation Commission were notified about the video, which was shared on social media. Both men were arrested on October 3 and are now facing felony charges for unlawfully taking an alligator.\n\nScroll down for video\n\nFootage shows Timothy Kepke, 27, and Noah Osborne, 22, terrorizing the alligator in Palm City on August 26 at around 10pm\n\nThe clip shows Kepke - from Hobe Sound - provoking the reptile and getting it to bite his arm, which it eventually does. Kepke's arm then is seen bleeding.\n\nThe pair then pours a can of beer into the small alligator's mouth.\n\nIn a police report, Kepke claimed Osborne grabbed the animal with his bare hands from the side of the road. Kepke was apparently bitten by the animal on his right forearm before pouring the beer down its throat, but it's not clear how serious the injury was.\n\nBoth men were arrested on October 3 after police became aware of a video the pair made of the incident.\n\nThe two men were arrested on October 3 for grabbing an alligator in Florida and forcing beer down its throat\n\nThey have both been charged with unlawfully taking an alligator.\n\nFlorida Fish and Wildlife Conservation Commission received a complaint about the incident in August.\n\nAuthorities investigating the incident were ultimately able to obtain the video on September 17. They then confronted Kepke about the allegations at his home where he confessed he was involved in the incident, the New York Post reported.\n\nKepke told officers that Osborne caught the reptile with his bare hands from the side of the road. Kepke then enticed it to bite him and then poured beer into its mouth, causing the alligator to act aggressively, TCPalm.com said.\n\nThe Florida Fish and Wildlife Conservation Commission were notified about the video, which was shared on social media\n\nThe pair then released the gator alive, Kepke told officers.\n\nAlthough Kepke admitted to having a couple of beers, he told cops he was not drunk at the time of the incident.\n\nKepke told officers a female friend was also there when the alleged episode happened.\n\nThe woman said she thought the reptile bit Kepke because of his hostility.\n\nKepke and Osborne were taken to the Martin County Jail with $5,000 and $2,500 bonds, respectively. Both men were released on the same day after posting bail.", "description": "Footage shows Timothy Kepke, 27, and Noah Osborne, 22, terrorizing the alligator in Palm City on August 26 at around 10pm. Both men were arrested on October 3 for the video.", "authors": ["Matthew Wright For Dailymail.Com", "Jerry Barmash For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/15/19543458-0-image-a-4_1570717785865.jpg", "published_at": "2019-10-10"}