{"pub": "foxbusiness", "url": "https://foxbusiness.com/small-business/christmas-tree-shop-owner-makes-six-figures-selling-trees-for-more-than-100-each", "downloaded_at": "2019-10-01 00:09:54.548492+00:00", "title": "Christmas tree merchant makes six figures in a 30-year-old side hustle", "language": "en", "text": "The most wonderful time of the year is every day for New York City native Greg Walsh, who is in the business of buying and selling Christmas trees.\n\nContinue Reading Below\n\nWalsh, 57, started his own Christmas tree business, Greg's Trees, in 1985 with $20,000 of his own money and a stand in Queens.\n\n“When I was in my 20s, I just wanted to make a quick buck,” Walsh told FOX Business of the seasonal side hustle he started while going to school to become a teacher. “Now, I do it because I enjoy bringing a little Christmas small town feel into the heart of New York City.”\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nWalsh noticed increased demand for Christmas tree shopping in the city – so he brought the North Pole to the concrete jungle himself, setting up shops on street corners and occasionally donning a Santa Claus costume to get shoppers in the holiday spirit.\n\nThe business of selling Christmas trees starts in January when Walsh buys Frasers, Balsams and Nordmann Firs and Nobles (what he calls the Cadillac of Christmas trees) from farmers in states including Oregon and Washington as well as regions including the Blude Ridge Mountains and Quebec. The average price of his trees is $115.\n\nIt's a lucrative business, Walsh says. He has opened six locations in Manhattan, Brooklyn and Queens transforming parks and beer gardens into winter wonderlands with wreath-making stations, lights and Christmas ornaments. He sells around 5,000 Christmas trees a year.\n\n“A well-run tree stand can make $10,000 to $20,000,” Walsh says, adding that he has made upwards of $100,000 a year running his own business.\n\nOther small businesses have also cashed in on Christmas, too. Anne Marie Blackman, a former stay-at-home mom, had the idea of selling ugly Christmas sweaters in 2008. Since then, her company My Ugly Christmas Sweater, has reportedly sold more than 25,000 of of the garments and raked in more than a million dollars in revenue.\n\nAnd last year, Amazon said it would start shipping fresh, full-size Christmas trees, including Douglas firs and Norfolk Island pines for $115.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "The small business of buying and selling Christmas trees turned into a lucrative six-figure gig for this entrepreneur.", "authors": ["Jeanette Settembre"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/small-biz-1280.png?ve=1&tl=1", "published_at": "2019-09-23"}