{"pub": "cbs", "url": "https://cbsnews.com/news/mark-knopfler-music-is-a-bit-of-an-obsession", "downloaded_at": "2019-09-22 15:16:57.817206+00:00", "title": "Mark Knopfler: Music is \"a bit of an obsession\"", "language": "en", "text": "Down a London backstreet, an anonymous rider glides unnoticed, slipping discretely past a garage door. The giveaway is the guitar etched into the motorcycle's gas cap. The rider is Mark Knofler, and this is where he makes his music.\n\nHis latest album, \"Down the Road Wherever,\" was recorded at British Grove Studios, the state-of-the-art dream studio he built more than a decade ago. \"I use stuff like this,\" Knopfler said, showing Anthony Mason his studio. \"You're talking about a 1960's, that's an EMI REDD.\"\n\n\"Did that come out of Abbey Road?\" Mason asked.\n\n\"It will have done originally.\"\n\nAnthony Mason and Mark Knopfler at British Grove Studios in London, where Knopfler recorded his most recent album, \"Down the Road Wherever.\" CBS News\n\n\"You don't really have to make music anymore.\"\n\n\"I do,\" Knopfler said. \"I'm afraid it's a bit of an obsession.\"\n\nTo hear Mark Knopfler perform \"Good on You Son\" from \"Down the Road Wherever\" click on the video player below:\n\nA lifelong obsession for Knopler, who grew up in Glasgow, Scotland and then Newcastle, England, before moving to London to form a band called Dire Straits.\n\nHe described his distinctive guitar playing: \"I have a style which is probably all wrong,\" he said. \"It would be a guitar teacher's nightmare. I hold a guitar like a plumber holds a hammer.\"\n\nBut musician wasn't Knopfler's first job, having had a brief career in journalism. \"It was a good thing for a kid to do – I was a cub reporter.\"\n\n\"Did you like being a reporter?\" Mason asked.\n\n\"I did, a lot of it. I could do it, but I don't think I was tough enough for it.\"\n\nBut it shaped his talent as a storyteller, and all the songs he had in his head: \"There's a junkyard in there; the songs just kept pushing and pushing.\"\n\n\"What were they pushing for?\" Mason asked.\n\n\"Just to come out. I had 'Sultans of Swing,' and a whole pile of songs,\" Knopfler said.\n\nIn 1978, \"Sultans of Swing\" put Dire Straits on the charts:\n\nMusic kept pouring out of Knopfler – so much, that he gave some songs away, like \"Private Dancer,\" originally intended to be a Dire Straits song: \"Yeah, I actually recorded that when we were doing the \"Love Over Gold\" record,\" he said.\n\nKnopfler offered it to Tina Turner: \"Tina injected a whole lot of power and, you know, stuff into it.\"\n\nDire Straits' biggest album, \"Brothers in Arms\" (1985), would sell more than 30 million copies.\n\nTo listen to \"Money for Nothing\" from \"Brothers in Arms,\" click on the video player below:\n\nBut just as the band was launched into the stratosphere, Knopfler suddenly dissolved it.\n\n\"You walked away essentially at the peak,\" said Mason.\n\n\"Well, it seemed to me to do that was the only intelligent thing to do,\" Knopfler said. \"We got so big that we had three stages that were leapfrogging around in front of each other, and you'd walk into catering and see some guy you just didn't know. And I didn't like that. Didn't want to be that. I didn't want to be that size.\"\n\nMason said, \"You didn't mind the success, but you didn't like the fame. Is that fair to say?\"\n\n\"Well, I can't think of anything good about fame, can you?\" Knopfler replied.\n\n\"Restaurant reservations? Not worth it?\"\n\n\"Not worth it.\"\n\nDire Straits would reunite for one last album in the '90s, \"On Every Street, but then it was really over. To watch the music video of \"Calling Elvis,\" from the album \"On Every Street,\" click on the video player below:\n\nLast year, Dire Straits was inducted into the Rock & Roll Hall of Fame. Knopfler did not show up for the ceremony. The 70-year-old singer may have turned his back on celebrity, but not on the music. \"I still enjoy playing those songs; if you've written them and they have that effect on people, it's very important. And to play 'em well.\n\nHis latest tour of America will have its finale at Madison Square Garden this week. Mark Knopfler plays on – still a brother in arms, but with a different band. \"They can all play better than I can,\" he said. \"But they let me get away with stuff because I'm the guy who wrote the songs!\"\n\nMason asked, \"You're very happy with these guys?\"\n\n\"Yeah! I mean, I think that's why people find themselves going bananas when they listen to it.\"\n\n\"It's nice to hear people go bananas.\"\n\n\"Bananas is good,\" Knopfler smiled.\n\nYou can stream Mark Knopfler's album \"Down the Road Wherever\" by clicking on the embed below (Free Spotify registration required to hear the tracks in full):\n\nFor more info:\n\n\n\n\n\nStory produced by Ramon Parkins.", "description": "Having dissolved his hit band, Dire Straits, when they were at the peak of their success, the musician says he can't think of anything good about fame", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/21/55b46e63-a022-487a-a273-fda45f6f1f05/thumbnail/1200x630g2/bd1c896a22709853cab9e6d0d7643699/mark-knopfler-in-concert-promo.jpg", "published_at": "2019-09-22"}