{"pub": "indiatimes", "url": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-we-banned-e-cigarettes-when-used-by-never-smokers-these-can-be-a-gateway-for-cigarette-smoking-and-drug-use", "downloaded_at": "2019-10-10 03:14:13.108892+00:00", "title": "Why we banned E-cigarettes: When used by never-smokers, these can be a gateway for cigarette smoking and drug use", "language": "en", "text": "I have seen, as an ENT surgeon, many cancers attributable to tobacco use. As per estimates, two fifth of cancers in India are related to tobacco use. Nearly half of these cancer patients meet a painful death within 12 months of diagnosis. Their suffering and the ordeal of their relatives are behind my determination to fight this menace.\n\nI do realise sensitivities involved in the field of tobacco control. However, there is nothing more important than wellbeing and happiness of our citizens. We cannot remain a mute spectator to 13.5 lakh Indians dying every year because of tobacco. One Indian dies every 10 seconds because of this lethal habit. These deaths are preventable and I will do all I can as health minister and responsible citizen to protect future generations.\n\nI conceived the first ever anti-tobacco legislation in India. In 1997, the Delhi Prohibition of Smoking and Non-Smokers Health Protection Act was passed in the Delhi assembly. The Supreme Court later asked all states and the Centre to follow the Delhi model and enact similar legislation. Soon, there was a central legislation banning smoking in public places in 2002.\n\nOur resolve for tobacco control is reflected in the preamble of the Cigarette and Other Tobacco Products Act (COTPA) 2003. This important bill was introduced in 2003 by late Sushma Swaraj and under the leadership of Atal Bihari Vajpayee in the face of stiff resistance of the tobacco lobby. The preamble states “it is expedient to prohibit consumption of cigarettes and other tobacco products which are injurious to health with a view to achieving improvement of public health in general as enjoined by Article 47 of the Constitution.” We are now looking to amend COTPA 2003 to plug its loopholes.\n\nAfter becoming health minister in 2014, I resumed my fight against tobacco. Despite strenuous opposition, we succeeded in getting large size (85%) warning on tobacco packs along with the Quit line number. Free multilingual telephonic counselling is successfully assisting tobacco users quit the habit. I ensured better implementation of gutka and flavoured chewing tobacco ban. We also launched one of the most graphic anti-tobacco awareness campaigns on Indian television and cinema halls.\n\nWe also initiated steps to ban e-cigarettes in early 2014. Considering the need for engaging other ministries, we constituted committee of secretaries to accelerate tobacco control in India. It was heartening that, as per the Global Adult Tobacco Survey 2016, India has shown 17% relative decrease in tobacco consumption between 2010 and 2016 – the steepest ever reported in any part of the world.\n\nWith declining cigarette consumption globally, cigarette companies introduced e-cigarettes to remain profitable. These newer products are being deceptively promoted as a less harmful alternative to cigarettes. The liquid in the e-cigarette usually contains nicotine, which is toxic, highly addictive and known to be a lethal chemical. To make it more appealing to kids, more than 7,000 varieties of flavours are mixed in the liquid. Apart from nicotine, e-cigarette cartridges can also be used as delivery devices for addictive and harmful substances such as cannabis and opiates.\n\nE-cigarette industry targets youth as potential customers – many of whom are never-smokers who view the devices as a form of recreation and sometimes a fashion statement. When used by never-smokers, these devices can be a gateway for cigarette smoking and other drug use. As per the US National Youth Tobacco Survey, e-cigarette use acquired epidemic proportions and increased by 77.8% among high school students and by 48.5% among middle school students from 2017 to 2018, only in one year.\n\nThere is no conclusive evidence of “harm reduction” as well as any cessation benefits of these products. On the contrary newer evidence of harm is emerging, as demonstrated by the outbreak of severe lung disease due to vaping in New York where more than 400 people were affected and 12 reportedly died. Their use for cessation is not yet approved under the Drugs and Cosmetics Act.\n\nDespite being sold illegally, as per GATS 2016, prevalence of e-cigarette smoking in India was 4%. Alarmed by these statistics and emerging evidence, various expert committees and institutions petitioned the ministry of health to ban e-cigarettes before they became an epidemic. Also, 18 states and two Union territories had already banned sale of e-cigarettes, vape, e-hookah and similar devices.\n\nHowever, no legislation was available to ban these hazardous products across India. Therefore, on September 18, our government took a bold step by promulgating the Prohibition of Electronic Cigarettes (production, manufacture, import, export, transport, sale, distribution, storage and advertisement) Ordinance, 2019.\n\nThis path breaking decision will go a long way in accelerating tobacco control in India. Introduction of electronic nicotine delivery systems would have weakened our mission in this regard.\n\nI would like to appeal to smokers to really resolve to quit completely rather than being nicotine dependent through unapproved alternatives. Nicotine replacement therapies through nicotine gums, lozenges and patches that are safe and duly approved under the Drugs and Cosmetics Act are also available. Prime Minister Narendra Modi has also highlighted the importance and urgency of e-cigarette ban in the UN and in his Mann ki Baat recently.", "description": "I have seen, as an ENT surgeon, many cancers attributable to tobacco use. As per estimates, two fifth of cancers in India are related to tobacco use. Nearly half of these cancer patients meet a...", "authors": ["Harsh Vardhan"], "top_image": "https://timesofindia.indiatimes.com/blogs/wp-content/uploads/2019/10/3345.jpg", "published_at": "2019-10-10"}