{"pub": "abcnews", "url": "https://abcnews.go.com/US/14-year-florida-boy-arrested-threatening-mass-shooting/story?id=66329485", "downloaded_at": "2019-10-16 23:12:49.082806+00:00", "title": "14-year-old Florida boy arrested after threatening mass shooting at school, police say", "language": "en", "text": "Police arrested a Florida teenager on Wednesday when he allegedly threatened to carry out a mass shooting at school after getting into a fight.\n\nThe 14-year-old student at LiFT Academy School in Seminole allegedly told a classmate that he planned to shoot up the school shortly after he was forced to withdraw from classes due to an altercation, police said.\n\nSchool officials gave his parents the option to withdraw him or have him expelled on Tuesday over an altercation that occurred last week, police said. Shortly after being withdrawn, the teen allegedly sent text messages to a female classmate, saying, \"I'm finna shoot that school up,\" the Pinellas County Sheriff's Office said in a statement.\n\nHe allegedly expressed plans to target at least two students and a school faculty member specifically, the statement said. Investigators said they became aware of the threats when a parent of the classmate notified the school, triggering a temporary lockdown.\n\nSTOCK PHOTO/Getty Images\n\nPolice located the suspect at his home on Wednesday. They said he admitted to sending the messages, but investigators confirmed that he did not have a weapon, according to the statement.\n\n\"An adult family member allowed deputies to search the residence and it was determined that [the suspect] had no access to any firearms,\" the statement said. \"He admitted to deputies he sent the threats because he was 'mad.'\"\n\nHe was arrested on charges of written threats to kill or do bodily injury and was transported to the Pinellas County Juvenile Assessment Center without incident.\n\nThe Pinellas County Sheriff's Office said it is still investigating the incident.\n\n\"The Sheriff's Office will continue to investigate all complaints of this nature,\" the statement said. \"We encourage the public to report any suspicious activity to law enforcement immediately and we will diligently investigate all reported information.\"\n\nThere have been several similar arrests in recent months, including a number in Florida. Two students were arrested on Aug. 22 in unrelated incidents in Davie, Florida, and Brandon, Florida. A 16-year-old was arrested on Sept. 12 in St. Petersburg, Florida.", "description": "The 14-year-old student allegedly told a classmate about his plans.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/police-gty-er-191009_hpMain_16x9_992.jpg", "published_at": "2019-10-16"}