{"pub": "euronews", "url": "https://euronews.com/2019/10/16/don-t-be-a-tough-guy-trump-warned-erdogan-over-turkish-offensive-in-syria", "downloaded_at": "2019-10-16 23:15:13.841772+00:00", "title": "'Don't be a tough guy,' Trump warned Erdogan over Turkish offensive in Syria", "language": "en", "text": "US President Donald Trump sent a letter to his Turkish counterpart before Erdogan launched an incursion into Syria, urging him \"don't be a tough guy\" and \"don't be a fool!\"\n\nThe October 9 letter, released by the White House on Wednesday, came as Trump fought to control criticism of his decision to withdraw US troops from northern Syria, paving the way for a Turkish military operation.\n\nTurkey invaded northern Syria five days ago to drive Kurdish-led forces away from the border, accusing the Kurds of being terrorists.\n\nKurdish forces in Syria have been longtime Western partners in the fight against the so-called Islamic State (IS).\n\nA letter from Trump to Erdogan dated October 9. White House\n\n\"You don't want to be responsible for slaughtering thousands of people,\" wrote Trump, \"and I don't want to be responsible for destroying the Turkish economy — and I will.\"\n\nHe went on to caution Erdogan: \"History will look upon you favorably if you get this done the right and humane way. It will look upon you forever as the devil if good things don't happen.\"\n\n\"I will call you later,\" Trump signed off his letter.\n\nThe Turkish president said on Wednesday he will only end Turkey's offensive in northern Syria if Kurdish-led forces withdraw.\n\nIt would be the fastest way to end the conflict, he said, adding that he was not willing to negotiate on his position.\n\nThe US House of Representatives earlier on Wednesday voted overwhelmingly to condemn President Donald Trump's withdrawal of American forces from northern Syria.\n\nDemocrats and Republicans banded together and approved a nonbinding resolution, which states Congress' opposition to the troop pullback and says Turkey should cease its military action in Syria.\n\nThe measure said the White House should present a plan for an \"enduring defeat\" of IS.", "description": "The US president cautioned Erdogan: \"History will look upon you favorably if you get this done the right and humane way. It will look upon you forever as the devil if good things don't happen.\"", "authors": ["Emma Beswick"], "top_image": "https://static.euronews.com/articles/stories/04/23/88/98/1000x563_cmsv2_86be2150-4517-56f5-a495-9aae7a8d877d-4238898.jpg", "published_at": "2019-10-16"}