{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/10/12/watch-watergate-prosecutors-really-dumb-take-on-impeachable-offenses-n2554633", "downloaded_at": "2019-10-13 00:14:35.441848+00:00", "title": "WATCH: Watergate Prosecutor's Really Dumb Take On 'Impeachable Offenses'", "language": "en", "text": "Former Watergate prosecutor Jill Wine-Banks on Saturday told MSNBC's Joy Reid she believes polls reveal Americans want to see President Donald Trump impeached. She also argued that further investigations don't matter because there's \"enough on the public record\" to show Trump committed impeachable offenses.\n\n\"Jill, this is a piece of The Washington Post OpEd that you were one of the cosigners, creators of. And it said, 'In 1974 it was a group of Republican senators who put national security interests over party loyalty and informed Nixon that his conduct was indefensible and would compel conviction by the Senate and removal from office. We hope the current Senate would similarly put honor and integrity above partisanship and personal political interests.' Do you — that’s a hope that you can have, but do you believe it will happen?\" Reid asked. \"Mitch McConnell is already signaling to his donors that he would be the place where impeachment would die, that he would kill it in the Senate.\"\n\n\"Well, I still remain Pollyanna, and I can remain aspirationally motivated to think that it could happen, that facts will matter, and that as the American people — as polls are showing — are turning against the president and starting to believe that he should not only be impeached but that he should be convicted and removed from office,\" Wine-Banks explained. \"I think that that will ultimately affect the Republicans who know that if they stick with him, it will be like having a very heavy anchor tied to them and that they need to take some action.\"\n\nAccording to the former prosecutor, one of the OpEd's co-signers, former deputy solicitor general of the United States Phil Lacovara, was a Republican who voted for Nixon twice \"but believed in justice,\" inferring that he favored ousting Nixon.\n\n\"And I think that that’s what people have to see is that the facts matter and that in this case, we don’t have to keep investigating. There is enough right now on the public record,\" she said. \"And unless there is something that we haven’t seen and that Donald Trump is hiding that counters that, there is enough evidence for crimes, but you don’t need a crime. You have impeachable offenses. You have a danger to American security.\"\n\nIf the Americans were turning on Trump, why have there been protests across the nation where people are calling out their Congressmen and women for supporting this bogus impeachment inquiry? If Americans were turning their back on Trump why are the Republican National Committee and the Trump campaign raking in waaayyy more money than the Democrats? If the American people didn't believe Trump and see through this media charade, why are a record number of first time donors writing checks to support the RNC and Trump?\n\nAt least if you're going to try to make the case that Trump should be impeached, don't use the American people to justify your claims. The average person has woken up to this political hoax.\n\n\n\n", "description": "Here we go..10/12/2019 20:09:31PM EST.", "authors": ["Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/285/19b5be06-18a5-4a8f-acd3-e96d43a48b72.png", "published_at": "2019-10-12"}