{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/charles-schwab-to-offer-fractional-stock-trading-attract-young-clients-2019-10-1028611327", "downloaded_at": "2019-10-19 10:44:56.002015+00:00", "title": "Can't afford a $1,780 share of Amazon? Charles Schwab will offer fractional share trading in an effort to attract younger investors (SCHW)", "language": "en", "text": "Reuters\n\nCharles Schwab will soon offer fractional share trading in a bid to bring in younger clients, the Wall Street Journal reported Thursday.\n\nThe purchase and sale of fractions of shares is one of several new investment programs coming to the firm's platform, the firm's founder and chairman Charles Schwab told WSJ.\n\nFractional shares offer a new way to entice younger traders who can now avoid commission fees at a bevy of trading firms. Those without the capital for pricier stocks like Amazon or Berkshire Hathaway Class A — which closed Thursday at $313,200 per share — would be able to invest in the firms at a feasible buy-in.\n\nThe new program comes off the heels of the Schwab's elimination of commission fees. Schwab's decision prompted Interactive Brokers, TD Ameritrade, E*Trade, and Fidelity to cut their commission fees in the following weeks.\n\n\"I wanted to take commissions out of the formula. We've been on that path for 40 years,\" Schwab told WSJ.\n\nMajor brokers are pushing for new ways to drive revenue with commission-free trading quickly becoming the industry standard. Some new offerings include commission-free options trading, free financial advice, and high-yield interest accounts.\n\nRead more: Charles Schwab on Charles Schwab: The founder explains why the firm just axed commissions as broker wars reach a fever pitch\n\nThough Schwab is poised to be the first major firm to offer fractional share trading, a similar program has been around for years. The firm already sells partial shares to clients to allow them to access dividend reinvestment plans, or DRIPs.\n\nThe new fractional share system could allow for a greater variability of ownership options, though the program's parameters aren't yet clear.\n\nCharles Schwab wasn't immediately available for comment.\n\nSeveral smaller firms already offer fractional trading, including M1 Finance and SoFi. The latter launched after finding investors would purchase shares for their price and not for their belief in a company's financial success, according to SoFi.\n\nCharles Schwab closed at $39.45 per share Thursday, down about 5% year-t0-date.\n\nThe firm has 11 \"buy\" ratings, eight \"hold\" ratings, and two \"sell\" ratings from analysts, with a consensus price target of $42.08, according to Bloomberg data.\n\nNow read more markets coverage from Markets Insider and Business Insider:\n\nSaudi Aramco reportedly delays what would be the biggest IPO in history\n\nAirbnb's losses reportedly doubled last quarter — and it could spell disaster for the company's attempt to go public\n\nLegendary investor Peter Borish describes how effective investing is like being a successful baseball manager — and shares his top trade for an economy wracked with record debt", "description": "Charles Schwab will soon offer fractional stock trades in an effort to bring in younger clients, the Wall Street Journal reported Thursday. Fractional sha...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5da9acf84af9097f3b0fb162-2400/2019-10-01t135311z1lynxmpef902x0rtroptp4usa-business.jpg", "published_at": "2019-10-10"}