{"pub": "news24", "url": "https://w24.co.za/Style/Fashion/Trends/instagram-and-facebook-boutiques-may-be-cute-but-getting-scammed-isnt-heres-how-to-avoid-being-duped-by-fraudulent-fashion-sites-20191008", "downloaded_at": "2019-10-08 15:54:49.212712+00:00", "title": "Instagram and Facebook boutiques may be cute, but getting scammed isn't - here's how to avoid being duped by fraudulent fashion sites", "language": "en", "text": "If you can shop the item inside a mall, rather do that. Always.\n\nI'll be the first to admit that I have the least interest in purchasing items from Instagram boutiques, for three reasons; they're often overpriced - with markup values no different to that of premium alcohol bottles in a club - for pieces that are not exactly one-of-a-kind buys; more often than not they're knockoffs; and lastly, I've seen enough people share their stories of social media boutique comedic horrors.\n\nREAD MORE: Instagram and Facebook boutiques - How social media has changed the way we shop\n\nThese online shopping fails have become so common that there's even a Facebook page called Knock Off Nightmares, where aggrieved shoppers share their stories of orders gone wrong. In a previous article published on W24, one of the several disclaimers from this Facebook page was shared;\n\n“The choice is entirely yours. Just remember, if it looks too good to be true, generally, it is.\"\n\nREAD MORE: IN PICS - People share their hilarious online shopping fails\n\nAnd honestly, that's the mantra one should always have playing on loop in their head when shopping for anything online - clothes, gadgets, and rental apartments.\n\nThe same sentiment was reiterated by a Reddit user who named and shamed a number of fraudulent fashion sites recently, providing the warning that \"if you see a too-good-to-be-true deal - especially an unrecognised brand that appeared as a social media advertisement out of nowhere based on ad targeting to your profile - be suspicious.\"\n\nHowever, it's also understandable how easily keen shoppers may fall into the traps of dubious fashion entrepreneurs, especially when the usual retail outlets are failing to deliver.\n\nWoops, almost forgot that some of the IG boutiques also don't deliver... ever.\n\nInstagram ‘boutiques’ who take girls money and never deliver the clothing are the worst king of scumbag fraudsters. — Maria Fowler (@MariaFowler) November 10, 2017\n\nOr sometimes they're just selling fake merchandise. Either way, exercising discernment is always necessary.\n\n\n\nInstagram boutiques will show you flames when you're clueless ????‍?? — ? (@_URBANISM) September 30, 2019\n\ndee_storee_the_plugger is a huge scam,\n\nPeople please be vigilant from these online stores, cause wow,\n\nThe material is weak\n\nThe size isn't the one she requested\n\nan entire R1500 for this\n\n\n\nFAKE!!!!! pic.twitter.com/IsKSxo4G2R — T E B O H O (@RealTeboho12) September 30, 2019\n\nLadies do yourselves a favour and stop buy swimwear from Instagram boutiques for 2 mil. Buy them from Ali express. ??#GirlTalkZA — Gugs? (@__Gugulethu) September 23, 2019\n\nInstagram boutiques were found SHAKING!! https://t.co/j6ZnsqdIRb — Thembakazi Matroshe (@ThembiMatroshe) September 13, 2019\n\nStop allowing Instagram Boutiques to dribble you to poverty and back with hair they buy at Dragon City.\n\n\n\nGot this 12 inch Grade 8A Brazilian and 10 inch three part closure for R650. #GirlTalkZA pic.twitter.com/w25EMKwHjk — mfaz’omnyama. (@mfazomnyama_) May 22, 2018\n\nREAD MORE: \"I was duped by a local Instagram shop\"\n\nA common thread observed from the above tweets is that consumers have now finally had the counterfeit wool pulled from their eyes. With more people making use of alternative shopping practices; whether that be time-traveling to a different fashion decade by thrifting, taking a deep dive into Small Street in Johannesburg, bargain hunting at factory outlets or keeping your tabs (open) on e-commerce sites such as AliExpress and Fashion Nova, Instagram boutiques are gradually losing their appeal and trustworthiness.\n\nBut for those who would still like to support small businesses online, here's how to spot red flags brighter than the soles of those faux Louboutins you're considering placing an order on:\n\n- Since we're on the subject of designer labels, if it's not sold at an official standalone store usually in malls such as Sandton City, Hyde Park Corner and the V&A Waterfront, Apsley House, or a store that sells pre-owned luxury goods such as Luxity, then it's Weezy F baby and the 'F' is for fake... not Fendi.\n\n- If an Instagram boutique's captions or bio reads \"DM for prices\", rather leave it. Zara doesn't tell us to go to the till for the price of each item, all items have price tags and every honest business should operate as such.\n\n- Always reverse search the images of the clothing sold on IG/Facebook fashion retailers. You can also look for telltale signs of image editing - some sellers have merely photosphopped clothing to create the impression that the pieces come in different colours.\n\n- This Reddit post also notes that \"some sites have weird payment restrictions (no Visa, Mastercard; needs to be PayPal, or some other less secured mechanism). This should be a red flag.\"\n\n- Lastly, if a boutique of interest has trusted testimonials in the form of social media influencers who've been spotted wearing their merch - for economic savviness' sake - make price comparisons. This is due to the fact that often with these social media stores is that there's more than one of them selling the same thing, but some markup their prices more than others. An example of this is when we noticed three local personalities who all had the same knitwear ensemble this winter. They had all bought their outfits at three very different boutiques and prices.\n\nREAD MORE: This must-have winter outfit everyone's wearing proves that price tags don't affect how good you look\n\n- And I must reiterate, if you can shop it in a brick-and-mortar store rather make use of that option. Always.\n\nWhen it comes to trends and putting your best Instagram foot forward, many peeps all want a piece of the pie and that's okay. Unfortunately, while we're trying to get this pie, businesses are also trying to get their bread, so be careful in case you get burnt. Ultimately, everyone's trying to eat, right?\n\nSign up to W24’s newsletters so you don't miss out on any of our hot stories and giveaways.", "description": "If you can shop the item inside a mall, rather do that. Always.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9442/0ecde4f92f5a43e0976611908ab2684f.jpg", "published_at": "2019-10-08"}