{"pub": "townhall", "url": "https://townhall.com/tipsheet/timothymeads/2019/10/24/breaking-judge-rules-father-of-james-young-can-have-say-in-transgender-transition-n2555326", "downloaded_at": "2019-10-25 00:40:13.367739+00:00", "title": "BREAKING: Judge Overrules Jury That Blocked Texas Father From Stopping Son's Transgender Transition", "language": "en", "text": "On Thursday, a Texas Judge overruled a jury that decided on Monday that Jefferey Younger, father of seven-year-old boy James Younger, had no conservatorship of his children in terms of medical decisions. This meant that James' mother and Younger's ex-wife, Dr. Anne Georgulas, would have been allowed to continue chemical castration and other gender-changing medical procedures such as puberty blockers, despite the father's wishes. However, the court's ruling today grants conservatorship back Mr. Younger as well as Dr. Georgulas.\n\nLifeSiteNews reports that Judge Kim Cooks announced her decision this afternoon:\n\nThe judge presiding over the case of Jeffrey Younger, the father who is trying to protect his seven-year-old son, James, from chemical castration via a gender “transition,” ruled today that the parents will have joint conservatorship over James, which includes making joint medical decisions for the child. Judge Kim Cooks of the 255th district also put a gag order on the father so that he cannot speak to the press about the case and decided that the father is not required to pay attorney fees. The judge’s decision means that the Save James website will have to be shut down.\n\nAs reported by LifeSiteNews, Dr. Georgulas insists that James is actually a girl and that he has stated that he wants to be a girl despite being born male.\n\nDr. Georgulas, who brought the lawsuit, was asking Mr. Younger’s possession schedule be altered to decrease overnight stays and to force his visits with the boys to be supervised. Dr. Georgulas brought the original modification suit to the court and did not request a jury trial. Mr. Younger, in his counter-petition, asked for a jury trial. Since Mr. Younger requested the jury trial, the jury ruled on his specific request for Sole Managing Conservatorship and the judge ruled on all other aspects of the petition as brought by Dr. Georgulas. She was also asking that Jeff be forbidden from calling his son James – his given and legal name – and that he be prohibited from bringing James around people who do not “affirm” James as a “girl.”\n\nAll week long, #ProtectJamesYounger trended on Twitter with numerous advocates demanding a higher court intervene to stop the transgender transition imposed by his mother. Jefferey Younger's website, SaveJames.com, had the following message regarding why he did not want his son to under transgender transitions:\n\nI’m looking out for the best interests of James, my son. When James is with me, he shows no signs of wanting to be a girl when given the choice. Even when in female company, away from me, James rejects a female gender expression. This suggests that the diagnosis of Gender Dysphoria should be reviewed by an independent psychologist. James has never had an independent second opinion. Medical and social intervention should be suspended until James’ father can get a good second opinion. James is unaware of long-term consequences of transitioning gender. James has expressed an interest in having children. If subjected to medical interventions, James will be permanently sterilized. James would never be able to have children. Help me Save James. ~ Jeff Younger, father of two sons, James and Jude\n\nMr. Youger's website will most likely be deleted in wake of the gag-order imposed by Jude Cooks. The Daily Wire's Matt Walsh led much of the protest against Dr. Georgulas and the jury the week. He argued on Thursday that Republicans need to ban chemical castration for minors and that the judge's ruling was the best case anybody could hope for.\n\nBREAKING: the judge in the #ProtectJamesYounger case has ruled that the father will have a say over medical decisions, including the \"transition\" of his son. This is the best outcome we could hope for in a horrible situation all around. I think our outcry made a real difference. — Matt Walsh (@MattWalshBlog) October 24, 2019", "description": ".10/24/2019 20:38:42PM EST.", "authors": ["Timothy Meads", "Matt Vespa", "Bronson Stocking", "Sarah Lee", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/188/cb7f5b15-a9d2-41fb-a4b6-2f4012580eb0.png", "published_at": "2019-10-24"}