{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/09/18/prominent-dem-donor-and-lgbt-activist-ed-buck-was-busted-for-operating-drug-house-n2553290", "downloaded_at": "2019-09-18 07:24:41.731941+00:00", "title": "Prominent Dem Donor And LGBT Activist Ed Buck Busted For Operating Drug House", "language": "en", "text": "Democratic donor and LGBT activist Ed Buck was arrested on Tuesday after a man overdosed in his California home, ABC 7 news reported. The overdose last week marked the third time a man overdosed in Buck's home. The first two men's overdoses were due to methamphetamine that resulted in death. Both of their deaths took place two years apart.\n\nLGBT activists were upset about the overdoses of 26-year-old Gemmel Moore and 55-year-old Timothy Dean, both black gay men, because they believed Buck was personally responsible for their deaths. Their cases were not prosecuted because of a lack of evidence, the Los Angeles Times reported.\n\nAccording to prosecutors, Buck injected meth into the third victim. He sustained an overdose but ended up surviving.\n\n“With this new evidence, I authorized the filing of criminal charges against Ed Buck,” Los Angeles County District Attorney Jackie Lacey said in a statement\n\nBuck has been charged with one felony count of battery causing serious injury, one count of administering methamphetamine and one count of maintaining a drug house.\n\nProsecutors are seeking a $4 million bail because they say he is \"a violent, dangerous sexual predator. He mainly preys on men made vulnerable by addition and homelessness.\" According to court documents, Buck personally administered \"dangerously large doses of narcotics to his victims\" and is \"a predator with no regard for human life.\"\n\nRecommended Good News John Stossel\n\n“From his home, in a position of power, Buck manipulates his victims into participating in his sexual fetishes,” prosecutors wrote in court papers, the Times reported.. “These fetishes include supplying and personally administering dangerously large doses of narcotics to his victims.... Not deterred by the senseless deaths of Moore and Dean, the defendant nearly killed a third victim last week.”", "description": "Yikes.09/18/2019 3:23:09AM EST.", "authors": ["Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/261/e58d6cb8-1348-47bd-b270-352318c680da.jpg", "published_at": "2019-09-18"}