{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7537531/Boy-born-skull-missing-SKIN-protecting-brain.html", "downloaded_at": "2019-10-05 08:36:54.024251+00:00", "title": "Boy born with part of his skull missing and only SKIN protecting his brain", "language": "en", "text": "A boy born with part of his skull missing leaving his brain only covered by skin is believed to be the first to 'survive and thrive' with the rare condition.\n\nLucas Santa Maria, who is seven-months-old, was not expected to live beyond just a few hours due to exencephaly.\n\nHis mother, Maria, was advised to terminate her pregnancy at just ten weeks - but she said she couldn't go through with the heartbreaking choice.\n\nLucas was born at 35 weeks weighing 6lb 5oz. But Mrs Santa Maria, 30, and her husband, Augusto, 31, of Garfield, New Jersey, claim they were handed a list of funeral homes and advised to make arrangements.\n\nTo everyone's shock, Lucas' stability increased, and he was able to eat and breathe unaided.\n\nAfter having surgery to remove fluid and damaged parts of his brain just four days after his birth, Lucas was able to go home.\n\nHe is awaiting surgery to mould a skull over his brain, which is currently only protected by his skin and extremely fragile.\n\nLucas Santa Maria was born with part of his skull missing leaving his brain only covered by skin. He is believed to be the first to 'survive and thrive' with his rare condition\n\nMrs Santa Maria and her husband, Augusto, 31, of Garfield, New Jersey, claim they were handed a list of funeral homes when Lucas was born (pictured)\n\nMrs Santa Maria, a stay-at-home mother-of-four, said: 'I found out about his condition on my first ultrasound when I was just ten weeks pregnant and was told that he would most likely die in my uterus or at birth.\n\n'They recommended that we had an abortion which was devastating since they didn't give us any hope at all and said that he was incompatible with life.\n\n'I had never thought about having an abortion before but we were forced to consider due to the circumstances but it was something that I couldn't bring myself to do.\n\n'I thought if Lucas wasn't going to live he can pass in my uterus without me having the regret that I may have stopped my son from having a life.\n\n'The doctor's told us this made him the first in the world to survive and thrive with this rare condition.'\n\nWHAT IS EXENCEPHALY? Exencephaly is considered a lethal brain development abnormality that is discovered during pregnancy. It's characterized by loss of brain tissue and top of the skull - the calvarial - making a baby unable to survive outside the womb. The incidence occurs one in every 33,000 pregnancies, according to research. It's a type of neural tube defect (NTD), of which approximately one in 1,000 babies are born with. Worldwide, 300,000 or more infants are born each year with NTDs, and NTDs result in more than 70,000 deaths annually. Exencephaly is a precursor to anencephaly, a serious birth defect in which a baby is born without parts of the brain and skull. Anencephaly occurs no later than 24 days' gestation. Anencephaly happens if the upper part of the neural tube does not close all the way. This often results in a baby being born without the front part of the brain or the cerebrum - the thinking and coordinating part of the brain. The remaining parts of the brain are often not covered by bone or skin. Anencephaly and exencephaly are both fatal and cannot be treated.\n\nExencephaly is usually discovered in the embryo and is considered a lethal brain development abnormality. It occurs one in every 33,000 pregnancies, according to research.\n\nThe condition is characterized by the calvarial - the top of the skull - and brain tissue not forming. A baby is unable to survive outside the womb.\n\nIf a baby is not stillborn or terminated, it normally leads to anencephaly, a serious birth defect in which a baby is born without parts of the brain and skull.\n\nThere is no known cure or treatment for exencephaly or anencephaly. Almost all babies born with anencephaly will die shortly after birth.\n\nFor the rest of the pregnancy, Mrs Santa Maria had regular check ups, anatomy testing and ECGs. She said: 'My pregnancy continued as normal, until I was induced at 35 weeks.\n\n'At this point I knew he was still alive as, prior to me pushing, I could feel him moving around a lot.\n\n'As soon as he was born I heard the doctor say that this was not what they were expecting so I knew he was alive - but didn't know how long for.'\n\nLucas was born with a large sac of spinal fluid attached to his brain. Part of his brain tissue was protruding out where the part of his skull was missing.\n\nThe family were unable to celebrate the birth for long, and Mr and Mrs Santa Maria and their three daughters, Sophia, eight, Mia, seven and Giana, three, said their goodbyes in case Lucas didn't survive.\n\nMrs Santa Maria said: 'We had chosen comfort care at the hospital which meant all they where going to do was wrap his head and hand him to us to be able to spend as much time with him.\n\nLucas Santa Maria, who is seven months old, was not expected to live beyond a few hours due to the extremely rare exencephaly. Exencephaly is usually discovered in the embryo and is considered a lethal brain development abnormality\n\nMrs Santa Maria, a stay-at-home mother-of-four, was unable to terminate her pregnancy\n\nLucas was born with a large sac of spinal fluid attached to his head but missing a large chunk of his skull. The family said their goodbyes because doctors expected him to die\n\n'Our three daughters came to the delivery room to meet their baby brother and it was explained to them that Lucas was going to die.\n\n'It was the hardest thing to see their little faces when they heard that.\n\n'The hospital gave my husband a list of funeral homes and he called them to organise arrangements - but luckily this time never came.\n\n'As the hours went by Lucas showed how much of a warrior he really was - he was eating, going to the toilet and breathing completely by himself.'\n\nMrs Santa Maria was expected to be discharged from the hospital three days later.\n\nBut the sac on Lucas' head was too fragile and Mrs Santa Maria was nervous that if it ruptured he would be unlikely to survive.\n\nMrs Santa Maria said: 'So since he was doing so well we stayed in the hospital by each other's side the whole time and this is when, after asking what other options we had, we were told about the surgery.\n\nLucas was doing so well in hospital that doctors offered surgery to remove the sac of fluid when he was four days old. He was discharged a week later. Pictured, Mrs Santa Maria with Lucas and her daughter Sophia, eight\n\nThe family were told to spend as much time with him as possible because it wasn't understood if Lucas would survive past a few days. Pictured, Lucas with his father\n\nLucas, pictured after birth, is expected to have a surgery when he is one-and-a-half-years-old to mold a skull. His brain is protected only by skin\n\n'We understood that every step of the surgery was a risk - but him not getting the surgery was even more of one, so we knew it had to be done.'\n\nAfter five grueling hours waiting for their son to have the surgery that would save his life, Mrs Santa Maria was overjoyed to find out the operation was a success.\n\nShe said: 'It was an amazing relief. Straight after the operation he began to make a speedy recovery and within just one week he was discharged and allowed to go home.\n\n'Now he is home we feel so blessed - he doesn't need much extra care than a normal baby and we just have to make sure we are careful with his head, as his brain is only covered by skin.\n\n'He eats baby food now and is making attempts to crawl, but he does sleep more than a \"normal\" baby which we are working on with physical therapy.\n\n'The next step in his life will be when he is around one to one-and-a-half-years-old, he will have another surgery which will help mold his skull to protect his brain.'", "description": "Lucas Santa Maria, who is seven months old, from Garfield, New Jersey, was not expected to live beyond a few hours due to the extremely rare condition exencephaly.", "authors": ["Vanessa Chalmers Health Reporter For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/12/19295584-0-image-a-31_1570190354453.jpg", "published_at": "2019-10-04"}