{"pub": "dailybeast", "url": "https://thedailybeast.com/alexander-vindman-a-white-house-nsc-official-twice-reported-trump-ukraine", "downloaded_at": "2019-10-29 02:12:25.733967+00:00", "title": "White House Ukraine Expert Twice Raised Trump Call Concerns", "language": "en", "text": "A White House national security official intends to tell Congress on Tuesday that he heard President Trump ask Ukrainian President Volodymyr Zelensky to investigate one of his political rivals, former Vice President Joe Biden, in a July 25 phone call.\n\nLt. Col. Alexander Vindman—the top Ukraine expert on the National Security Council—will be the first White House official to testify before Congress who listened in to the call where Trump mentioned corruption allegations against Biden and his son.\n\nAccording to a draft statement of his remarks obtained by The Daily Beast, Vindman twice raised concerns to superiors about how Trump and other senior officials were handling Ukraine. He took his concerns to NSC lawyer John Eisenberg, once on July 10 and once again shortly after the July 25 call.\n\n“I did not think it was proper to demand that a foreign government investigate a U.S. citizen, and I was worried about the implications for the U.S. government’s support of Ukraine,” Vindman wrote in his draft statement, which was first reported by The New York Times. “I realized that if Ukraine pursued an investigation into the Bidens and Burisma it would likely be interpreted as a partisan play which would undoubtedly result in Ukraine losing the bipartisan support it has thus far maintained.”\n\nBiden’s son, Hunter Biden, sat on the board of Ukrainian company Burisma Holdings while his father was in office.\n\nVindman will tell Congress that he did not interact directly with Trump, but did confront Ambassador to the European Union Gordon Sondland after a July 10 meeting with Ukrainian officials. According to Vindman, Sondland brought up Ukraine conducting “specific investigations in order to secure the meeting” with Trump.\n\nHe will recall how Trump refused to sign a memo he drafted in August that would re-start security aid being withheld from Ukraine. Vindman will also tell Congress how he drafted a letter congratulating Zelensky on his inauguration earlier this year, but Trump also refused to sign that.\n\nVindman is scheduled to appear behind closed doors before the House Intelligence, Foreign Affairs and Oversight and Reform Committees in defiance of White House order not to cooperate with the impeachment inquiry. His lawyer, Michael Volkov, has not spoken publicly on the matter.", "description": "Lt. Col. Alexander Vindman, who listened in on the July 25 call, reported his concerns before and right after the conversation between Trump and the Ukrainian president.", "authors": ["Julia Arciga"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2694,w_4791,x_0,y_62/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1572313108/RTX2SIXA_aikcun", "published_at": "2019-10-29"}