{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/cape-town-activist-wants-to-teach-climate-literacy-20190924", "downloaded_at": "2019-10-05 11:38:38.941147+00:00", "title": "Cape Town activist wants to teach climate literacy", "language": "en", "text": "Climate literacy - this is what a Cape Town teenager and activist Ayakha Melithafa wants to teach South Africans, especially those living in poorer communities.\n\n\"I want to be a voice for the voiceless, for people of colour who live in shacks and are every day faced with the effects of climate change,\" the 17-year-old high school pupil said.\n\n\"Because it's not coming - it's already here and already affecting us.\"\n\nREAD | Trump slammed for trolling Greta Thunberg climate speech\n\nMelithafa - who hails from Eerste River, about 40km from the city centre - was one of 16 child petitioners aged between 8 and 17 who on Monday presented a landmark official complaint to the United Nations Committee on the Rights of the Child to protest lack of government action on the climate crisis.\n\nThis immediately after Swedish environmental activist Greta Thunberg's emotional address at the UN Climate Action Summit in New York.\n\nViolation of child rights\n\nThe petitioners, from 12 countries across the globe, allege that member states' failure to tackle the climate crisis constitutes a violation of child rights.\n\nREAD | #ClimateStrike: 'You'll die of old age. I'll die of climate change,' SA protesters warn\n\nThey urge the independent body to order member states to take action to protect children from the devastating impacts of climate change, Unicef said in a statement.\n\nFiled through the Third Optional Protocol to the Convention on the Rights of the Child, a voluntary mechanism which allows children or adults on their behalf to appeal directly to the United Nations for help if a country that has ratified the protocol fails to provide a remedy for a rights violation, the complaint \"aims to inspire the urgent action needed to curb global heating and mitigate the impact of the climate crisis\".\n\nThe petition also cited the Cape Town 2017/2018 drought: \"Climate change has already made the 1 in 100-year drought that contributed to the Cape Town water crisis three times more likely. Another drought in southern Africa in late 2018 hit just after the maize planting season, causing a severe food crisis for 10.8 million people.\"\n\nMelithafa said she became fascinated with the climate crisis during Cape Town's Day Zero panic.\n\n\"Privileged people have access to underground [borehole] water, while everyone else - mostly people of colour - were limited to the [50] litres per person per day. This is actually how most people [in poorer areas] where eight people live in a two-bedroom house already function,\" she said.\n\n\"During droughts and heatwaves, people living in shacks don't have the luxury of turning on the air conditioner or cooling down in a pool. In extreme weather, those living in privilege are not the ones whose homes are flooded.\n\n\"It's really affecting us, but some feel the wrath worse than others.\"\n\nClimate protest\n\nMelithafa, who is in Grade 11 at the Centre of Science and Technology in Khayelitsha, is a recruitment officer and spokesperson for the African Climate Alliance, a youth led climate advocacy group that arranged the climate protest in Cape Town on Friday, attended by an estimated 2 000 people.\n\nWhen interviewed by the New York Times, she called for an immediate moratorium on the extraction of coal, oil and gas in South Africa.\n\nShe had previously said she would like to see Minister of International Relations and Cooperation Naledi Pandor, who attended the summit, \"taking a bold plan to New York, committing South Africa to reducing air pollution and investing in jobs in renewable energy\" as \"sticking with coal is strangling our economy as well as choking us\".\n\n\"I am fighting for everyone,\" she said.\n\n\"But I am representing people of colour because I don't want it to only be a white privileged fight, but for all to be involved. The climate crisis doesn't see boundaries so neither should we.\"\n\n", "description": "Climate literacy - this is what a Cape Town teenager and activist Ayakha Melithafa wants to teach South Africans, especially those living in poorer communities.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9396/1cb450f6d0c24d9f998fde562b253d5d.jpeg", "published_at": "2019-09-25"}