{"pub": "cnbc", "url": "https://cnbc.com/2019/10/02/cramer-bernie-sanders-leninist-agenda-scarier-than-elizabeth-warren.html", "downloaded_at": "2019-10-02 15:31:09.763909+00:00", "published_at": "2019-10-02", "title": "Cramer: Bernie Sanders and his wealth-grabbing 'Leninist' agenda scarier than Elizabeth Warren", "language": "en", "text": "CNBC's Jim Cramer believes Wall Street should be much more afraid of Bernie Sanders in the White House of than of Elizabeth Warren.\n\nSanders, a Vermont senator who describes himself as a democratic socialist and is seeking the Democratic Party presidential nomination, wants to \"make people who are billionaires lower than billionaires,\" Cramer said Wednesday on \"Squawk on the Street.\"\n\nSanders is \"basically doing a socialist agenda,\" Cramer said. \"It has a Leninist feel to it,\" calling the senator's ideas for taxing the wealthy \"just wholesale redistribution.\"\n\nCramer spoke Wednesday before the Sanders campaign revealed that the senator was recovering from an artery blockage procedure. All Sanders campaign events and appearances have been canceled until further notice.\n\nIn making a \"Leninist\" comparison, Cramer was referring to Vladimir Lenin, the Russian revolutionary and leader, who created the Soviet Union and contributed to the concept and practice of a state-controlled economy.\n\nAnalyzing the current political climate, Cramer pointed out that impeachment proceedings against President Donald Trump could imperil his reelection, which then begs the question of who among the Democratic presidential candidates have a chance of winning. Sanders cannot be discounted, the \"Mad Money\" host added.\n\nSanders, who polls in third place behind former Vice President Joe Biden and Warren, has raised the more money in the third quarter, over $25 million, than any of the other 2020 Democratic candidates who've reported their numbers. Biden and Warren have not disclosed their Q3 haul yet.\n\n\"I'm not as fearful of Elizabeth Warren as Wall Street is,\" Cramer reiterated Wednesday, a day after he said that fears of Warren among banking and corporate CEOs are \"getting overblown.\"\n\n\"I want to stop the fear of Sen. Warren. I really think that's a mistake,\" Cramer also said Tuesday. Last month, Cramer first reported that he's hearing the financial community saying, \"She's got to be stopped.\"", "description": "CNBC's Jim Cramer believes Wall Street should be much more afraid of Bernie Sanders in the White House of than of Elizabeth Warren.", "authors": ["Matthew J. Belvedere"], "top_image": "https://image.cnbcfm.com/api/v1/image/106049707-1564538509243rtx71mf3.jpg?v=1564538588"}