{"pub": "investing.com", "url": "https://za.investing.com/news/stock-market-news/global-marketsasian-shares-firm-as-quotvery-goodquot-trade-talks-boost-risk-appetite-1965267", "downloaded_at": "2019-10-11 04:00:38.255623+00:00", "title": "GLOBAL MARKETS-Asian shares firm as \"very good\" trade talks boost risk appetite", "language": "en", "text": "© Reuters. GLOBAL MARKETS-Asian shares firm as \"very good\" trade talks boost risk appetite\n\n* MSCI Asia ex-Japan +0.5%; Nikkei +0.9%\n\n* Pound eases after rallying on Brexit hopes\n\n* Asian stock markets: https://tmsnrt.rs/2zpUAr4\n\nBy Andrew Galbraith\n\nSHANGHAI, Oct 11 (Reuters) - Asian shares and U.S. stock futures rose on Friday after U.S. President Donald Trump said he would meet with China's top trade negotiator, while sterling retreated after rallying on revived hopes of a possible Brexit deal.\n\nInvestors' renewed appetite for riskier assets weighed on the safe-haven yen and U.S. Treasury prices, while oil stayed firm on comments about possible supply cuts from the head of OPEC.\n\nIn early Asian trade, MSCI's broadest index of Asia-Pacific shares outside Japan rose 0.5%, following on from gains on Wall Street. S&P e-mini futures added 0.2%.\n\nAustralian shares climbed 0.8%, while Japan's Nikkei stock index gained 0.9%.\n\nThe more bullish market mood came after a first day of trade talks between top U.S. and Chinese negotiators that Trump characterised as \"very, very good.\"\n\nA White House official said the talks had gone \"probably better than expected\" and a U.S. Chamber of Commerce official briefed by both sides raised the possibility of a currency agreement this week. tariffs at current levels are unlikely to reverse the current trade driven slowdown in economic growth, and the uncertainty around unresolved structural issues such as IP theft and subsidies to state own enterprises are likely to remain deterrents for a pick-up in much needed capital expenditure,\" analysts at National Australia Bank said in a morning note.\n\n\"On this score details on a potential currency pact will be important,\" they said.\n\nThe dollar rose 0.1% against the yen to 108.07 , while the euro was flat at $1.1004 and the pound was slightly lower, fetching $1.2432.\n\nThe , which tracks the greenback against a basket of six major rivals, was down at 98.663 after posting its biggest daily drop in five weeks on waning safe-haven demand for the currency.\n\nThe British pound jumped nearly 2% on Thursday, its biggest daily gain since March, after Irish Prime Minister Leo Varadkar said a Brexit deal could be clinched by the end of October after what he called a very positive meeting with his British counterpart, Boris Johnson. move away from safe havens also lifted the yield on benchmark 10-year Treasury notes to 1.6716% compared with a U.S. close of 1.656% on Thursday. Yields rose across the curve, with two-year notes yielding 1.5464% compared with a U.S. close of 1.53%.\n\nIn commodity markets, oil prices remained higher after the head of OPEC said the organisation could take action to balance oil markets, including a deeper cut in oil supplies. crude was up 0.43% to $53.78 a barrel and global benchmark Brent crude was up 0.46% at $59.37 per barrel.\n\nRising risk appetite tarnished gold's appeal, pushing spot gold down 0.16% to $1,491.65 per ounce. GOL/\n\n(Editing by Jacqueline Wong)", "description": "GLOBAL MARKETS-Asian shares firm as \"very good\" trade talks boost risk appetite", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB66095_L.jpg", "published_at": "2019-10-11"}