{"pub": "reuters", "url": "https://in.reuters.com/article/hongkong-protests-entertainment/protests-split-hong-kong-entertainment-world-many-keep-silent-idINKBN1WD05N", "downloaded_at": "2019-09-28 12:07:12.258425+00:00", "title": "Protests split Hong Kong entertainment world; many keep silent", "language": "en", "text": "HONG KONG (Reuters) - The anti-government protests that have roiled Hong Kong for four months have also split the city’s influential entertainment community, with stars who weigh in doing so at the risk of alienating fans on either side of the often-bitter divide.\n\nWhile many performers have been careful not to be seen taking sides, others whose political stances were already known have been more willing to be heard.\n\nVeteran actor and singer Alan Tam has openly backed the Hong Kong police, attending a pro-police rally in June. When he was unable to get a table at a crowded Hong Kong restaurant earlier this month and left instead of waiting, some customers clapped, according to a report in the Ming Pao newspaper.\n\nTam’s measured response on his Weibo-like Twitter account - “People with different political stances have different reactions. They don’t respect me, but I respect them. I will go eat again next time” - won him plaudits on mainland Chinese social media.\n\nSinger Denise Ho, known for her social activism, has been forthright in her support of the protesters.\n\n“Real freedom can’t be eradicated ... It’s our civic duty to continue to go to the streets,” she posted on Facebook earlier this month.\n\nAction star Jackie Chan has long pledged his allegiance to Beijing, describing himself in August as a “flag-bearer” after protesters in Hong Kong desecrated China’s national flag.\n\nHong Kong’s Cantonese-language films, TV shows and pop songs for years enjoyed outsized popularity among audiences in Greater China and beyond, but nowadays its stars must be able to speak and sing in Mandarin if they want to hit it big.\n\nPolitics has long been perilous for Chinese-language artists, with self-ruled and democratic Taiwan - considered by China to be a wayward province - also a potential minefield, especially as many famous singers come from there.\n\nIn 2000, China banned top Taiwan pop singer Chang Hui-mei for a year after she performed at the inauguration of Taiwan President Chen Shui-bian, viewed by Beijing as a dangerous separatist.\n\nHong Kong’s Aaron Kwok, one of the “Four Heavenly Kings” of Cantopop, caused a brief stir this month when he found himself surrounded in his Lamborghini by protesters blocking roads, but would not be drawn on his views on the protests, according to media reports.\n\n“I’m getting diapers for my daughter,” he told reporters.\n\nOthers have been outspoken.\n\nMacau-born singer, TV personality and film star Maria Cordero, affectionately called Fat Mama by her fans, has supported the Hong Kong police and government.\n\nBut a mashup of a speech by Cordero at a pro-government rally combined with the song “Chandelier” by Sia was turned into an anti-police anthem, “Fat Mama Has Something to Say”, that has in recent weeks been shouted at police by masked protesters.", "description": "The anti-government protests that have roiled Hong Kong for four months have also split the city's influential entertainment community, with stars who weigh in doing so at the risk of alienating fans on either side of the often-bitter divide.", "authors": ["Donny Kwok", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-28"}