{"pub": "cnn", "url": "https://cnn.com/2019/09/13/media/seth-rich-fox-news-lawsuit/index.html", "downloaded_at": "2019-09-13 19:22:43.126500+00:00", "title": "Appeals court revives Seth Rich family's lawsuit against Fox News", "language": "en", "text": "New York (CNN Business) A federal appeals court on Friday revived a lawsuit filed against Fox News by the parents of Seth Rich , a Democratic National Committee staffer whose unsolved murder became the basis for conspiracy theories on the far-right.\n\n\"We would not wish what we have experienced upon any other parent -- anywhere,\" the Riches said in a statement provided to CNN. \"We appreciate the appellate court's ruling and look forward to continuing to pursue justice.\"\n\nThe parents, Joel and Mary Rich, filed a lawsuit in March 2018 against Fox News, one of the network's reporters, and a Texas businessman.\n\nThe lawsuit said that Malia Zimmerman, the Fox News reporter named in the lawsuit, worked with Ed Butowsky, the Texas businessman, to develop a \"sham\" story about Rich's death that Fox News published online in May 2017 and referenced on-air multiple times.\n\nThe Rich family sought compensation for \"mental anguish and emotional distress, emotional pain and suffering, and any other physical and mental injuries.\"\n\nThe complaint argued that actions taken by the defendants \"were so outrageous in character and so extreme in degree as to go beyond all possible bounds of decency and are atrocious and utterly intolerable in a civilized community.\"\n\nBut Judge George B. Daniels of the US District Court for the Southern District of New York dismissed the case in its entirety in August 2018.\n\nDaniels wrote in his opinion that he had granted the motion to dismiss the lawsuit over the plaintiffs' \"failure to state a claim.\"\n\nHowever, on Friday, the United States Court of Appeals for the Second Circuit overturned Daniels' decision.\n\nThe appeals court said that upon review, it determined that the lawsuit contained \"sufficient facts\" to survive a motion to dismiss the lawsuit based on failure to state a claim.\n\nTo that end, the appeals court ordered proceedings to continue in the lawsuit.\n\nLenny Gail, an attorney representing the Rich family, said in a statement, \"This decision now clears the way for a thorough investigation into the facts. We will now obtain documents from Fox News and other parties and take testimony under oath from those involved.\"\n\nFox News released a statement expressing confidence in its case, despite the legal setback Friday.\n\n\"The court's ruling today permits Mr. and Mrs. Rich to proceed with discovery to determine whether there is a factual basis for their claims against Fox News,\" the network said. \"And while we extend the Rich family our deepest condolences for their loss, we believe that discovery will demonstrate that Fox News did not engage in conduct that will support the Riches' claims. We will be evaluating our next legal steps.\"\n\nTy Clevenger, a lawyer for Butwosky, told CNN he is also \"confident we can prove that the allegations are false.\"\n\nZimmerman declined to comment through a Fox News spokesperson.\n\nThe dispute between Rich's family and Fox News dates back to the story Zimmerman published in 2017\n\nZimmerman's story said Rod Wheeler, a private investigator who was at the time a Fox News contributor hired by Butowsky on behalf of the Rich family to look into Rich's death, had learned that Wikileaks had been in contact with Rich prior to his death.\n\nThe story suggested without real evidence that Rich had leaked a trove of DNC emails to Wikileaks and further suggested that his death, which police suspect was a botched robbery, was retribution for the supposed leak.\n\nWithin hours, however, the Fox News story fell apart when Wheeler -- who sued Fox News over the story, but also had his case dismissed by Daniels -- told CNN he had no evidence to suggest Rich had contacted Wikileaks before his death.\n\nBut Fox News left the story up on its website for days and guests continued to mention the conspiracy theory on its air. The network ultimately retracted the story seven days after it was published.\n\nSpecial Counsel Robert Mueller's report said that WikiLeaks founder Julian Assange \"made several public statements\" that implied Seth Rich leaked him the trove of DNC documents \"apparently\" in an effort \"designed to obscure the source of the materials\" the website was releasing.\n\nMueller's report also indicated that WikiLeaks was communicating with the Russian military intelligence officers about the stolen DNC documents before and after Rich's death.\n\nEditor's note: Ed Butowsky has filed a lawsuit against CNN and CNN journalists Oliver Darcy, Gary Tuchman, Anderson Cooper, and former reporter Tom Kludt for coverage related to his role in the now-retracted Seth Rich story. Butowsky has also sued The New York Times, Vox Media, and NPR. CNN stands by its reporting.", "description": "A federal appeals court on Friday revived a lawsuit filed against Fox News by the parents of Seth Rich, a  Democratic National Committee staffer whose unsolved murder became the basis for conspiracy theories on the far-right.", "authors": ["Oliver Darcy", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/170801111443-seth-rich-fox-news-super-tease.jpg", "published_at": "2019-09-13"}