{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/8/brady-starts-his-20th-season-by-beating-steelers-3", "downloaded_at": "2019-09-09 06:51:48.136469+00:00", "title": "Brady starts his 20th season by beating Steelers 33-3", "language": "en", "text": "FOXBOROUGH, Mass. (AP) - The New England Patriots trolled the Pittsburgh Steelers on Saturday and then blew them out Sunday night.\n\nA day after the acquiring former Steelers malcontent Antonio Brown, the reigning Super Bowl champions showed they might not even need him, getting 341 yards and three touchdown passes from 42-year-old Tom Brady to beat Pittsburgh 33-3.\n\n“Well, he’s the best in the world,” Steelers quarterback Ben Roethlisberger said. “There’s a reason he’s the best when he’s out there doing his thing.”\n\nPhillip Dorsett caught two touchdown passes, including a 58-yard score, and Josh Gordon - another receiver who wore out his welcome elsewhere - caught one TD pass. On the night New England unveiled its sixth NFL championship banner, Super Bowl MVP Julian Edelman caught six passes for 83 yards and also completed a throw to help the Patriots begin their title defense.\n\nNo one has won back-to-back NFL titles since New England did it in 2003 and ‘04.\n\n“We were so locked in on the moment. We were locked in because we knew of the expectations,” defensive back Duron Harmon said. “We knew that when we had the opportunity to play the Steelers, on opening night, with the banner raising, we were going to do everything possible to prepare the right way.”\n\nFacing the last team to beat them, back in Week 15 last year, the Patriots opened a 20-0 lead before Pittsburgh kicked a field goal on fourth-and-goal from the 1 with 10:17 left in the third quarter. Brady responded with a 58-yard touchdown pass to Dorsett and a 27-3 lead.\n\nDorsett had four catches for 95 yards and the first multi-score game of his career. He will be moving down the depth chart Monday when the Patriots are expected to make Brown’s signing official.\n\n“He’s a playmaker,” Edelman said. “The more playmakers you have, the more dynamic we can be.”\n\nThe move couldn’t be welcome in Pittsburgh. Unable to get Brown to behave, the Steelers refused to trade the disgruntled diva to New England only to see him wind up with the team that has reached the AFC championship game eight straight seasons.\n\n“Whatever,” Roethlisberger said\n\n“Didn’t spend a lot of time thinking about it or dwelling on it,” said Steelers coach Mike Tomlin. “I’m not specifically worried about anything relative to Antonio Brown.”\n\nRoethlisberger completed 27 of 47 passes for 277 yards and an interception, though 116 of the yards came on non-scoring drives in the fourth quarter with the Steelers down four scores. The offense showed the effects of losing two of its biggest playmakers: Brown, who talked and tweeted his way out of both Pittsburgh and Oakland in one offseason, and running back Le’Veon Bell, a two-time All-Pro who sat out all of last season to avoid a franchise tag.\n\nIn their place, James Conner gained 21 yards on 10 carries; the Steelers gained only 32 yards rushing in all. Top receiver JuJu Smith-Schuster caught six passes for 78 yards, 26 of it coming on one throw in the final six minutes with the Steelers already trailing 33-3.\n\nThe drive ended when Roethlisberger threw it into the end zone from the 41-yard line and was picked off by Devin McCourty.\n\nThe Steelers had five full possessions in the first half and punted on four of them, going three-and-out three times.\n\n“We got our butts whooped,” defensive tackle Cameron Heyward said.\n\nAB NEGATIVE\n\nBrown, who asked for and was granted his release by Oakland on Saturday morning and then agreed to terms with the Patriots in the afternoon, and was not yet eligible to play.\n\nThere was no sign of him at the stadium. The Patriots are expected to announce on Monday the one-year deal that will guarantee the four-time All-Pro $9 million. Asked about it during his postgame news conference, coach Bill Belichick didn’t even allow a reporter to finish his question.\n\n“Do you have any comment on the reports … “\n\n“No,” Belichick interrupted. “Next.”\n\n“Of Antonio Brown …”\n\n“Next,” Belichick said.\n\nBANNER NIGHT\n\nThe Patriots made room for another Super Bowl memento above their south end zone.\n\nThe team unveiled their sixth championship banner before the game in a ceremony that included fireworks and a highlight video projected onto a screen covering much of the field.\n\nDrew Bledsoe, Ty Law, Willie McGinest, Rob Ninkovich and Martellus Bennett brought out the first five Lombardi Trophies. Owner Robert Kraft brought out the one the team won in February by beating the Los Angeles Rams 13-3 - the one that was dented by Rob Gronkowski when he used it for batting practice at the Boston Red Sox opener.\n\nKraft received a big cheer from the fans, who seemed unbothered by charges that he solicited prostitution in a Florida massage parlor. Gronkowski, who retired in March, also received a loud cheer.\n\nINJURIES\n\nSteelers: Linebacker T.J. Watt left with a hip injury and did not return.\n\nPatriots: Linebacker Marcus Cannon had a shoulder injury.\n\nUP NEXT\n\nSteelers: Host the Seattle Seahawks next Sunday.\n\nPatriots: Visit Miami next Sunday.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The New England Patriots trolled the Pittsburgh Steelers on Saturday and then blew them out Sunday night.", "authors": ["The Washington Times Http", "Jimmy Golen"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/08/steelers_patriots_football_83092_c0-132-4360-2674_s1770x1032.jpg?be40aaca81461cb320c3ca3f6fd7a7a22879e9a0", "published_at": "2019-09-08"}