{"pub": "vice", "url": "https://vice.com/en_us/article/43kpeq/mister-america-is-trumps-most-scathing-satire-without-even-mentioning-his-name", "downloaded_at": "2019-10-25 23:38:47.095439+00:00", "title": "'Mister America' Is Trump's Most Scathing Satire Without Even Mentioning His Name", "language": "en", "text": "Mister America, the first feature film in the medium-hopping On Cinema universe—Adult Swim's movie review show that does everything but review movies—doesn't ask its audience what they want. Instead, it tells us what America is. It is a portrait of two lonely men locked in a world of delusion and codependence, offering a darkly comic vision of how white, aged-out failures shape our modern political moment. Made in three days on a shoestring budget, Mister America is a much-needed alternative political satire in a time where every two-bit comic hosts a Daily Show knock-off, and SNL attempts to address our most dire issues as a nation via hackneyed sketches featuring Alec Baldwin.\n\nThe mockumentary film follows Tim Heidecker (a fictional version of Tim Heidecker) as he runs a haphazard campaign for district attorney of San Bernardino County, an act of revenge against Vincent \"The Rat\" Rosetti (Don Pecchia), the lawyer who fell short of convicting Heidecker for 20 counts of second-degree murder in 2017. The film is interrupted on occasion by On Cinema guest and self-appointed film expert Gregg Turkington (a bizarro version of real-life Gregg Turkington), who takes us with him as he trawls through trash cans for straight-to-VHS classics of yore.\n\nWith Mister America and the On Cinema project, Heidecker and Turkington have created a parallel world that arrives at an indictment of Trump and the culture that made him without really needing to say his name at all. (In fact, in Mister America he's never even mentioned.) On Cinema presaged Trump in a lot of ways. The show had an eerie knack for capturing the aesthetic and mood of a certain sphere of this particularly toxic, particularly online, zeitgeist. From a death by poisonous vape to a disastrous influencer-driven music festival, On Cinema seemed to beat reality to the punch more often than not.\n\n\"I think we were ahead of the curve on some of these issues, but it's nothing that you can feel proud about,\" says Turkington, speaking with VICE. \"Tim has been pretty obsessed with Trump from way back when there was a zero-percent chance that the guy would get a single vote for president… so having that all go down in the midst of doing the show has been really weird!\" he laughs.\n\nIs being so prescient comforting? Vindicating? Or distressing as hell? \"I'd lean more toward distressing as hell,\" sighs Heidecker, with a laugh. \"I think whatever kind of [aspects of] culture we're satirizing or making fun of in On Cinema are things that are disappointing elements of the society that we live in, or they're annoying or unflattering looks at our culture. But those are things that don't actually potentially create the end of civilization necessarily, as the Trump administration feels like it's ushering in in some way.\"\n\nThe \"Tim\" of On Cinema and Mister America seems excruciatingly relevant. He is a meme: the large adult son, the family court dad, the extremely online reply guy.\n\nMister America has received criticism for making light of the rise of Trump, but Mister America isn't actually about the rise of Trump so much as it is about the rise of a certain type of stupid man who has persisted throughout American history, but has just now come into his most profitable moment. Unfortunately for men like the fictional Heidecker who do not have the nepotistic upbringing and brand management of a slumlord's heir, their self-assuredness tends to get them nowhere.\n\nIn regards to that criticism, Heidecker laments the very real consequences of Trump: \"these things that aren't funny at all.\" But, he says, \"Trump is a hilarious figure. You can't deny it. You can despise him and you can be scared of the choices he's making, but there's something almost always unintentionally very funny about him.\"\n\nThe film uses Heidecker and Turkington's clueless characters to ape that lack of intentionality. From the get-go, they have a \"fundamental misunderstanding\" of what type of film director Josh Lorton (played by the film's actual director, Eric Nortanicola) is actually making. Turkington is repeatedly excised from the film; one soul-crushing moment has him slowly walking away from the camera crew to sit alone on a bench after being shooed away.\n\nHeidecker imagined their disappointments as being a more realistic look at how they'd fare outside the confines of On Cinema, what he calls \"the world of their delusion.\" The film is ruthless in its depiction of these hopelessly adrift nobodies having tantrums in their little kingdom.\n\n\"There's a lot of people who seem to function when they're in that state of extreme loneliness,\" says Turkington. Mister America takes note of exactly how such men function in 2019, drawing a direct line between toxic male cultural spaces and contemporary politics as it dryly dissects the curdling of white male rage.\n\n\"I don't really know what to do about people, especially maybe white men, white adult men, who are used to being listened to and are used to being taken seriously,\" says Heidecker. \"And that is sort of changing in the world in general. And we're not exactly quite sure what to do about it. They're not really relevant anymore.\"\n\nYet the \"Tim\" of On Cinema and Mister America seems excruciatingly relevant. He is a meme: the large adult son, the family court dad, the extremely online reply guy. He may be one of the greatest villains of the modern age—a self-centered sociopath indirectly responsible for multiple deaths, including that of his infant son Tom Cruise, Jr. In Mister America we witness him realize, albeit fleetingly, that there may be no redemption for someone like him.\n\n\"They're both bad men,\" says Turkington about his and Heidecker's characters. \"You're seeing that these guys are really two sides of the same coin.\" By lumping Turkington, the rabid fanboy, in with Heidecker, the bigoted bully, Mister America lassoes the spectrum of insecure manhood and binds it to its sour roots. Its message is one that few American comedies are comfortable in making: Trumpism is a symptom of the culture, not the cause.\n\n\"I saw, yesterday, Judd Apatow retweeting this cabaret singer who's doing this parody of Gary Indiana from the Music Man about Rudy Giuliani… and it sort of smacked me back down to earth, like, ' oh, this is still what people consider funny?\"\n\nIn a time when political satire is still being mass-produced by corporations like Viacom, and we are saturated with flimsy, laugh-tracked takes from late-night shows and mainstream comedy, On Cinema and Mister America offers a powerful skewering of the Trumpian moment that doesn't have to dilute its message for the masses.\n\n\"Not to be a complete jerk,\" Turkington begins, \"but uh, being funny people is an advantage we have over SNL,\" he cackles. \"I think that the difference is that most comics don't have the aesthetic or the confidence or whatever to do something like this, where they're not letting the audience in on the joke at every turn. And to us, any moment like that ruins the entire project.\" Unlike Saturday Night Live, he says, he and Heidecker are \"prepared to have something go out there where people say 'I don't get it.' For some people there weren't any laughs, but for us, and the fan base that we have, there's plenty.\"\n\n\"I saw, yesterday, Judd Apatow retweeting this cabaret singer who's doing this parody of Gary Indiana from the Music Man about Rudy Giuliani… and it sort of smacked me back down to earth, like, 'oh, this is still what people consider funny? and what people still consider biting satire?'\"\n\nAt the end of the day, Mister America is a film that asks the audience to meet it halfway. Heidecker knows that creative freedom comes at the cost of a never-ending hustle: \"For us, it's always been a grinding, groveling process to get things made. The actual making of it is a joy, but getting (almost, always) Adult Swim to trust us—'just give us a few crumbs and we'll make something!'—has always been the hard part.\"\n\nNext, On Cinema fans will have to wait for the superhero epic Whale Man. But for now, they'll have to content themselves with the acerbic character study of Mister America, a film which the characters themselves say to \"avoid at all costs.\"", "description": "We spoke to Tim Heidecker and Gregg Turkington about On Cinema's clairvoyance, lonely white men, and why Judd Apatow's tweets make Tim sad.", "authors": [], "top_image": "https://video-images.vice.com/articles/5db3527a34d426008d5601c2/lede/1572033285397-Screen-Shot-2019-10-25-at-113534-AM.png?crop=0.9230282914493441xw:1xh;center,center&resize=1200:*", "published_at": "2019-10-25"}