{"pub": "marketwatch", "url": "https://marketwatch.com/story/dow-poised-to-notch-3rd-straight-gain-as-fridays-crucial-jobs-report-looms-2019-09-06", "downloaded_at": "2019-09-06 12:10:17.941210+00:00", "title": "Dow poised to notch 3rd straight gain as Friday’s crucial jobs report looms", "language": "en", "text": "U.S. stocks were set to head modestly higher Friday morning toward a third gain in a row as Wall Street awaits a key reading of the health of the U.S. labor market, which could help guide the near-term policy path for the Federal Reserve. After that report, markets will hear from the Fed’s top boss.\n\nHow are major benchmarks performing?\n\nFutures for the Dow Jones Industrial Average YMU19, +0.41% were up 84 points, or 0.3%, to 26,785, while those for the S&P 500 index ESU19, +0.40% added 8.50 points to 2,980.50, a gain of 0.3%. Nasdaq-100 futures NQU19, +0.32% advanced 17.50 points, or 0.2%, to reach 7,873.\n\nFor the week, the Dow is on track to post a 1.2% return, the S&P 500 is set for a 1.7% gain and the Nasdaq is on pace for a 1.9% advance, as of Thursday’s close, according to FactSet data.\n\nOn Thursday, the Dow DJIA, +1.41% rose 372.68 points, or 1.4%, to 26,728.15, while the S&P 500 index SPX, +1.30% advanced 38.2 points, or 1.3%, to reach 2,975.98. The Nasdaq Composite Index COMP, +1.75% rose 139.95 points to 8,116.83, a gain of 1.8%.\n\nThe Dow stands 2.3% shy of its record closing peak at 27,359.16, hit July 15, while the S&P 500 is about 1.7% shy of its all-time closing high set July 26 at 3,025.86, and the Nasdaq stands 2.6% from its July 26 record at 8,330.21, according to Dow Jones Market Data.\n\nRead: History says the stock market’s volatile August paves the way for more losses in September\n\nWhat’s driving the market?\n\nAs investors have been wringing their hands over growing signs of a recession, jobs data have become a key gauge for market watchers and economists to assess the vitality of a U.S. economy.\n\nThe nonfarm-payroll report is due at 8:30 a.m. Eastern Time.\n\nEconomists are expecting the U.S.to have created some 173,000 jobs in August, coming after a private-sector report from Automatic Data Processing Inc. on Thursday showed that 195,000 jobs were created last month. The unemployment rate is estimated to stand at 3.7%, with a 0.3% increase in hourly wages. Hours worked will be another key part of the report after falling to a nearly two-year low in July. Companies tend to cut back hours before laying off workers.\n\nRead: Here’s why this big bank expects stocks to drop through the end of the year\n\nIn addition to the jobs data, Fed Chairman Jerome Powell will speak at 12:30 p.m. Eastern Time at the “Economic Outlook and Monetary Policy” at the University of Zurich in Switzerland and his comments will likely be parsed for signs that the central bank will deliver further easing to an investment community that has wrestled with waning economic growth outside of the U.S. and a China-U.S. tariff dispute that has threatened to exacerbate business woes domestically and abroad.\n\nThe jobs report will weigh heavily on market sentiment but Powell’s words, with the rate-setting Federal Open Market Committee’s, or FOMC, Sept. 17-18 gathering looming, could influence sentiment.\n\n“Due to the media blackout period which starts next week this will be the last opportunity for the Chair Powell to provide near-term guidance ahead of a hugely anticipate September 18 FOMC,” wrote Stephen Innes, an independent market analyst in Asia, referring the period in which Fed officials are limited from speaking ahead of a policy decision.\n\nWall Street is pricing in a greater than 90% chance that the FOMC will cut rates by a quarter of a percentage point, while 8.8% are betting that the central bank will hold rates at its current 2%-2.25% range.\n\nMeanwhile, investors have been focused on China after the world’s second-largest economy cut its reserve-requirement ratio by a half-point, marking the third such move, among dozens of other stimulus measures, implemented by the Chinese government. Market participants are focused on China’s economy because weakness in the country could filter through to the rest of the global economy.\n\nOn Thursday, markets rallied amid as Chinese and American officials set the stage for negotiations toward a resolution in their trade conflict to take place in “early October.”\n\nAn upbeat reading from ISM of nonmanufacturing, or services, came in at 56.4%, up from the 53.7% reading in July and above the consensus estimate of 54.2% expected by economists polled by MarketWatch, helping to support Wall Street’s tentative bullishness.\n\nHow are markets trading?\n\nThe yield on the 10-year U.S. Treasury note TMUBMUSD10Y, +2.07% climbed to 1.585% Friday morning.\n\nIn commodities markets, the price of crude oil CLV19, -1.49% were headed sharply lower, with West Texas Intermediate crude 1.8% lower at $55.33 a barrel on the New York Mercantile Exchange. The price of gold GCZ19, -0.77% fell further early Friday after notching its sharpest daily decline in about three years, on a dollar basis on Thursday. The ICE U.S. Dollar Index DXY, +0.09% a measure of the U.S. currency against a basket of six major rivals, added 0.1%.\n\nIn Asia, equities closed higher, as the China CSI 300 000300, +0.59% rose 0.6% and Japan’s Nikkei 225 NIK, +0.54% climbed 0.5%, while Hong Kong’s Hang Seng Index HSI, +0.66% advanced 0.7%.\n\nEuropean stocks, meanwhile, were mixed, with the Stoxx Europe 600 SXXP, +0.22% edging 0.1% higher.", "description": "U.S. stocks are poised to head higher Friday morning as Wall Street awaits a key reading of the health of the U.S. labor market, which could help guide the...", "authors": ["Mark Decambre"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HO679_helpwa_ZG_20190802065129.jpg", "published_at": "2019-09-06"}