{"pub": "zdnet", "url": "https://www.zdnet.com/article/australian-computer-society-splashes-out-on-four-data-driven-industry-associations", "downloaded_at": "2019-09-19 23:09:22.875946+00:00", "title": "Australian Computer Society splashes out on four data-driven industry associations", "language": "en", "text": "Not-for-profit organisation Australian Computer Society (ACS) has announced the acquisition of four competing data-centric organisations, for an undisclosed amount.\n\nThe ACS has scooped up Data-Driven Marketing and Advertising (ADMA), Institute of Analytics Professionals of Australia (IAPA), Digital + Technology Collective (D+ TC), and Data Governance Australia (DGA), which will now sit under the ACS umbrella from the Australian Alliance for Data Leadership (AADL).\n\nSpeaking to ZDNet, ACS president Yohan Ramasundara said the acquisitions align with the organisation's 2017-2022 strategy.\n\n\"Our strategy outlines there is need for us to grow organically, as well as through strategic acquisitions that are aligned with our strategy.\n\n\"Our vision for Australia is to be a world leader in innovation and create new forms of value and we can't do that on our own.\n\n\"As you know, we live in an exciting time where traditional industries are converging, IT is an enabler, and data is extremely important, especially if you look at all the emerging technologies like artificial intelligence -- data is the fuel for all of that.\"\n\nRamasundara said for the time being, each organisation will remain as their own entities, but did not rule out plans of dissolving them into the ACS brand.\n\n\"We regularly look at our offerings and business models and if it's not working, we'll review it,\" he said.\n\nSee also: 56% of employees lack digital skills needed for future jobs (TechRepublic)\n\nThe acquisitions have increased ACS total membership from 46,000 members to 50,000.\n\nADMA CEO Andrea Martens said the acquisitions are a win-win for all of those involved.\n\n\"In guiding the custodians of the data and technology systems that feed the data value chain, ACS is like a turbo charger for our associations that support the capture, storage, access, analysis, insights and action of data,\" she said.\n\n\"This turbo-charging reinforces the marketer's role as the revenue generation machine for business; increases the scale and velocity of analytics, insights and AI-led innovation and boosts focus on cyber security, storage and the ethics of data in business.\n\n\"By joining ACS, we have access to enhanced resources and facilities as well leading edge thinking and education in the IT sector that will only expand our position in the marketplace and give our members even more reasons to join.\"\n\nThe acquisition comes as the ACS management committee awaits the votes of members after it proposed to change the legal structure of the organisation from an incorporated association to a company limited by guarantee (CLG), where any compliance obligations will fall under the Corporations Act 2001.\n\nAccording to ACS CEO Andrew Johnson, the unanimous decision by the management committee forms as part of the ACS' five-year strategy, much like the acquisitions. He said one of the sections within the strategy highlighted \"the need for ACS to review its corporate form and governance structures, and to streamline its decision-making processes to enable it to be agile in the future, in order to more effectively achieve its objects and deliver its services\".\n\nJohnson said the CLG structure is the most common form of incorporating a national membership association under Commonwealth law, which means even under the structure change, ACS will remain as a membership body.\n\n\"Member centricity has been one of the guiding principles of change,\" he said.\n\nRead more: Why employers need to build workers' digital skills (TechRepublic)\n\nHe points to the likes of the Chartered Accountants Australia and New Zealand and Institute of Public Accountants as other not-for-profit organisations that operate in this structure.\n\nIf ACS becomes a CLG, the company will be regulated by the Australian Securities and Investments Commission (ASIC), rather than Access Canberra.\n\nJohnson also assured that if the structure goes ahead, any certification that individuals have received from ACS for completing courses, such as its migration skills assessment, would remain valid.\n\nMembers will be able to formally vote on the proposal during the organisation's general meeting that is scheduled for October.\n\nDuring the same time last year, the organisation claimed the title of the first IT professional association to have membership of the World Economic Forum.\n\nThe World Economic Forum holds an annual week-long TEDx-style event for the 1% in the Swiss ski resort town of Davos that combines political leaders, celebrities, and caviar.\n\nThe organisation also picked up Brisbane's River City Labs last year, which the society at the time said it would invest AU$7.5 million over three years into.\n\nDuring the 2018 financial year, ACS, which is authorised to undertake skill assessments for the purpose of skilled migration, reported revenue of AU$36.6 million, a 256% increase over five years. Of that, 86% or $31.5 million was earned as professional standards income.\n\nWhen compared to 2013, the society's professional standards income only made up 66% of total revenue.\n\nMeanwhile revenue earned from membership fees has remained steady over the last five years at around the $3 million mark.\n\nThe organisation also spent just over AU$4 million in marketing, PR, and publications, and another AU$298,000 in sponsorship for the period ending 30 June 2018.\n\nRelated coverage", "description": "The acquisition aligns with the society's 2017-2022 strategy.", "authors": ["Aimee Chanthadavong"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/06/14/a7b09a30-04fb-4d4c-bf93-f7a297762bee/thumbnail/770x578/26a72cc6a7a282d8ebe4614933998c37/istock-1135580110.jpg", "published_at": "2019-09-19"}