{"pub": "breitbart", "url": "https://breitbart.com/news/protesters-call-for-south-korean-justice-ministers-arrest", "downloaded_at": "2019-10-09 12:47:58.068903+00:00", "title": "Protesters call for South Korean justice minister’s arrest", "language": "en", "text": "SEOUL, Oct. 9 (UPI) — Conservative groups called Wednesday for the arrest of embattled South Korean Justice Minister Cho Kuk and the resignation of President Moon Jae-in at a massive rally in central Seoul for the second week in a row.\n\nMoon appointed Cho as justice minister last month to spearhead a prosecution reform drive, but Moon’s former senior secretary for civil affairs has been dogged since his nomination by corruption allegations swirling around his family.\n\nThe rally, organized by Jeon Gwang-hoon, chairman of the Christian Council of Korea, and Hwang Kyo-ahn, chairman of the opposition Liberty Korea Party, drew hundreds of thousands to Seoul’s Gwanghwamun Square on what was a national holiday in South Korea. A demonstration was held in the same location last Thursday.\n\nProtesters, who were predominantly middle-age and elderly, chanted “Moon Resign!” and “Arrest Cho Kuk!” as they waved signs and Korean flags. Many were also quick to criticize Moon as a North Korean sympathizer.\n\n“We want Moon Jae-in out,” said protester Scott Chang, 68. “He’s a liar and we can’t trust him.”\n\nThe scandal surrounding Cho Kuk has tarnished Moon, who won the presidency in 2017 with an image built on transparency in the wake of former President Park Geun-hye’s impeachment on corruption charges.\n\nMoon’s approval rating fell this week to 44.4 percent, according to a survey released on Monday by pollster Realmeter. The approval number was down 2.9 points from the week before and represents Moon’s lowest point since his inauguration.\n\nMoon addressed the deepening political divide for the first time Monday, saying it was “not desirable,” and that the political rift is moving beyond “productive discussions.”\n\nHe also defended the need to reform South Korean prosecution as “urgent.”\n\n“Despite a wide variety of opinions, the reform of the prosecution is urgent, and its reform is the will of the people,” Moon said.\n\nCho Kuk laid out a sweeping plan for reform of the prosecutor’s office on Tuesday, aiming to cut down on its power for special investigations and adopt measures for human rights protections. Critics have long claimed that prosecutors wield too much discretion and that their investigations have been politically motivated.\n\nHowever, his political opponents question Cho’s fitness for the office as allegations swirl around him.\n\n“How can [Cho] be in charge of the justice ministry when he has violated the rules?” Jiyeon Ihn, chief spokeswoman for conservative political party Our Republican Party, told UPI. “Moon Jae-in needs to step down and Cho should be arrested and detained.”\n\nSouth Korean prosecutors have launched an investigation over questionable investments in a private equity fund tied to Cho’s family while he was presidential secretary, following the arrest of a Cho relative suspected of operating the fund.\n\nCho and his wife have also been accused of forging documents in order to help their daughter gain admission to medical school. The justice minister’s home was raided by prosecutors last month and Cho’s wife has been summoned for questioning three times.\n\nThe minister denies all the allegations.\n\nCounter-protests in support of Moon and Cho and calling for prosecutorial reform have also been held. A candlelight demonstration took place on Saturday near the Supreme Prosecutors’ Office in southern Seoul and another is planned for this weekend.", "description": "SEOUL, Oct. 9 (UPI) — Conservative groups called Wednesday for the arrest of embattled South Korean Justice Minister Cho Kuk and the resignation of", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-09"}