{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/15/sofi-stadium-naming-rights-sold-for-los-angeles-ne", "downloaded_at": "2019-09-15 23:12:50.107039+00:00", "title": "SoFi Stadium: Naming rights sold for Los Angeles' new arena", "language": "en", "text": "LOS ANGELES (AP) - SoFi Stadium is the name of the palatial new home of the Los Angeles Rams and the Los Angeles Chargers.\n\nThe growing personal finance company formally known as Social Finance has reached a 20-year agreement for the naming rights to the multibillion-dollar stadium complex in Inglewood, California, the teams announced Sunday.\n\nSoFi Stadium is on schedule to open next summer in Hollywood Park ahead of the 2020 season for Los Angeles’ two NFL teams. One season later, the stadium will host the Super Bowl.\n\nSoFi was only founded in 2011, but the Bay Area-based online lending startup has grown rapidly into a prominent financial services business particularly successful among people refinancing student loan debt. Led by CEO Anthony Noto, a former NFL executive, and fresh off a $500 million round of equity financing led by Qatar’s sovereign wealth fund in May, SoFi bought the naming rights to reap extraordinary exposure from the world’s most prominent new stadium.\n\n“It was something that really took a while for us to convince them that we were the right partner, and really gain the confidence that we could make that long-term commitment,” Noto told The Associated Press. “We’re super excited to have got to this point. They’re building something that’s unprecedented, and I think the impact it could have (on SoFi) will be equally unprecedented.”\n\nThe 70,000-seat stadium is the centerpiece of a 298-acre complex developed by Rams owner Stan Kroenke and shared by owner Dean Spanos’ Chargers. Along with the 2022 Super Bowl, the arena also will host the 2023 College Football Playoff national championship game, an annual college football bowl game, and the opening and closing ceremonies of the 2028 Olympics.\n\nWith SoFi’s name out front, the entire complex will have a prominent role in the future of the NFL and the Los Angeles metroplex.\n\n“It’s one of these forward-thinking companies,” Spanos told the AP. “It’s in the forefront of innovation in their industry. That’s something and somebody we want to be associated with as our stadium takes on that same sort of energy, because it’s something that nobody has ever done before. I think what Stan has built here and done here, in his creativity with this whole development, this probably is going to redefine this area of Los Angeles for the next century. It’s going to be something that LA is going to be very proud to have.”\n\nSpanos and Rams chief operating officer Kevin Demoff are both pleased by the addition of a young, technologically savvy partner with the naming rights deal.\n\n“When Stan started to imagine what sports and entertainment district at Hollywood Park to be, he wanted to find not only world-class partners, but innovative partners,” Demoff told the AP. “He wanted to bring someone unique to the table that hadn’t been there before, and I think SoFi is a terrific partner because under Anthony’s leadership, you can see their vision for financial technology, for changing banking and loans, and really that process of putting the customer first is very similar to what we want to do at the stadium. I think it’s a unique fit for what we believe will be the greatest stadium in the world.”\n\nKroenke and Demoff also were pleased by the compact, alliterative name for such an expansive project, Demoff said.\n\n“SoFi Stadium - I’m a fan of alliteration, so I love it,” Demoff said. “That may be very 10th-grade English of me, but I think it’s a very natural-sounding name.”\n\nNoto has a personal connection to the stadium and to its primary sport: The former Goldman Sachs partner also is the former chief financial officer of the NFL, and he worked on the league’s groundwork efforts a decade ago to return to the Los Angeles market. After he became the chief operating officer of Twitter in 2014, Noto worked on its agreement to stream NFL games on the platform.\n\n“I really had a front-row seat on seeing the impact (the NFL) could have on a business like ours,” Noto said. “It’s a small component of our overall marketing budget and our overall spending budget, but the benefit we get from reallocating the investment into this from other things is magnitudes greater.”\n\nSoFi recently has partnered with sports brands ranging from college basketball conference tournaments to the U.S. Open tennis tournament and the X Games. Noto said SoFi aggregated the audiences that saw their combined sponsorship efforts in 2018 and came up with about 15 million unique viewers for the entire year.\n\nThat’s roughly the same amount of exposure they’ll get from one prime-time NFL game in SoFi Stadium, Noto said.\n\nNoto praised his former boss, NFL Commissioner Roger Goodell, for this culmination of the league’s years of patient planning for a return to the nation’s second-largest market.\n\n“It’s a result of Roger’s vision back in 2008 and ‘09 when he established he wanted the LA market to be not just another stadium, but to be this iconic destination,” Noto said. “Stan and Dean are bringing it to life in a way that no one could truly comprehend when Roger laid out the vision.”\n\nAlong with the name, SoFi members will have their own lounge inside the stadium, and the company will stage additional events and seminars at the complex.\n\nThe money from a naming rights deal typically offsets construction costs, and Kroenke’s project is expected to cost more than $5 billion. The Hollywood Park project already sold separate naming rights last month to American Airlines for a year-round performance venue and stadium entrance area.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "SoFi Stadium is the name of the palatial new home of the Los Angeles Rams and the Los Angeles Chargers.", "authors": ["The Washington Times Http", "Greg Beacham"], "top_image": "", "published_at": "2019-09-15"}