{"pub": "guardian", "url": "https://theguardian.com/environment/2019/oct/30/climate-crisis-affects-how-majority-will-vote-in-uk-election-poll", "downloaded_at": "2019-10-30 12:31:40.696052+00:00", "title": "Climate crisis affects how majority will vote in UK election – poll", "language": "en", "text": "A majority of people in the UK say the climate crisis will influence how they vote in the looming general election, according to an opinion poll, with younger voters feeling particularly strongly about the issue.\n\nAlmost two-thirds of people agreed the climate emergency was the biggest issue facing humankind, with 7% disagreeing. The poll also asked if “fossil fuel companies, whose products contribute directly to climate change, should help pay for the tens of billions in damages from extreme weather events?” Two-thirds of people agreed, with 12% opposed.\n\nGuardian climate score: how did your MP do? Read more\n\nIn terms of action to tackle the climate emergency, 81% of people backed planting more trees, 63% supported a Green New Deal – a large-scale, long-term investment in green infrastructure and jobs – and more than half said it was important to ban fracking.\n\nJonathan Church at the environmental law firm ClientEarth, which commissioned the poll conducted by Opinium, said: “From the student strikes to Extinction Rebellion, people across the UK are demanding greater action to address the climate crisis.\n\n“Importantly these demands appear strong enough to make a difference at the next election.”\n\nThe poll of 2,000 UK adults aged 18 and over was conducted in September, before the most recent Extinction Rebellion protests but after a global climate strike that brought millions of people on to the streets.\n\nMore than half of those polled (54%) said climate change would affect how they would vote, with the proportion rising to 74% for under-25s. The poll also showed support for fossil fuel divestment, with 60% of people thinking banks and financial institutions should ditch investments in coal, oil and gas.\n\nIn June, the polling company YouGov found public concern about the environment rose to record levels in the UK after the visit of the school climate striker Greta Thunberg to parliament and the first major Extinction Rebellion protests in April. The environment was ranked as the third most pressing issue facing the nation, after Brexit and health but ahead of the economy, crime and immigration.\n\nThe prime minister, Boris Johnson, has said he will chair a new cabinet committee on climate change, holding departments to account for their actions to combat the climate crisis.\n\n“I want us to become the cleanest, greenest society on earth, and inspire countries around the world to follow our lead so that our children can breathe clean air and benefit from the wonderful flora and fauna of this earth,” he said earlier this month.\n\nThe Friends of the Earth chief executive, Craig Bennett, said “The prime minister’s pledge to make the UK a global leader on the climate crisis will only be realised if slashing climate-wrecking emissions is at the very heart of every government policy.\n\n“This means scrapping plans for a third runway at Heathrow, halting the multibillion-pound road-building programme and abandoning support for fossil fuel development at home and abroad.”\n\nIn June, the UK committed to ending net carbon emissions by 2050, when Johnson’s predecessor, Theresa May, accepted the advice of the government’s official advisory body, the Committee on Climate Change.\n\nBut CCC leaders said they were shocked the UK had no proper plans for protecting people from heatwaves, flash flooding and other effects of the climate crisis. The Opinium poll found 58% of people believed the government has done too little to prepare for such impacts.\n\nThe CCC’s annual report also found only one of the 25 emissions-cutting policies the body said were vital in 2018 had been delivered in full.\n\nThe government’s response to the report was published on 15 October. Chris Stark, the chief executive of the CCC, said there was “a plan for a plan for emissions reduction, but [it is] still thin gruel on adaptation”.\n\nJohnson’s Brexit deal and a new environment bill have also been criticised. ClientEarth’s Karla Hill said: “The deal utterly fails to guarantee the future of environmental standards in the UK post-Brexit.\n\n“The binding part of the agreement contains nothing about those standards. When coupled with the environment bill, which also fails to provide a legal block on regression in standards, among other flaws, it paints a bleak picture for future legal environmental protection in the UK.”\n\n• The five environmental commitments the Guardian is making", "description": "Survey also finds two-thirds of people agree climate is biggest issue facing humankind", "authors": ["Damian Carrington"], "top_image": "https://i.guim.co.uk/img/media/24b467e18c44fcbad3ce96087579cc54a763a8fb/0_91_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ba3f0e48eb77c535d8f6780a4e0946f8", "published_at": "2019-10-30"}