{"pub": "dailymail", "url": "https://dailymail.co.uk/debate/article-2191094/Over-years-George-Osborne-Mr-Popular-Mr-Right.html", "downloaded_at": "2019-10-05 07:03:57.043769+00:00", "title": "Over the next few years, George Osborne might not be Mr Popular, but he may be Mr Right", "language": "en", "text": "Over the next few years, George Osborne might not be Mr Popular, but he may be Mr Right\n\nAccountable: A letter in the Sunday Times called for Osborne to begin spending cuts a year earlier than planned\n\nIn February 2010, twenty economists published a letter in the Sunday Times calling on George Osborne to begin spending cuts a year earlier than planned. The key sentence of that letter stated that, ‘In order to be credible, the government's goal should be to eliminate the structural current budget deficit over the course of a parliament.’\n\n\n\nThe logic was clear. If you say you’re going to do something hard but essential, you need to do it at a credible pace. Saying you’re aiming to do something in five years time and after a general election is rather like admitting that you’ve no intention of doing it at all.\n\nYou probably agree with that logic. If you are in charge of your household budget and you notice that your expenditures are running ahead of your income, you’ll almost certainly want to address that gap right now this minute. It’s not pleasant doing it, but you do it anyway. Businesses think the same way.\n\nWhat’s strange then is why those same economists have now reversed themselves. Just three of the original twenty economists are thought to stand by their original view. The Daily Telegraph will this week print opinion pieces from a range of other economists all calling upon the Chancellor to reverse course, slow down the fiscal tightening. Spend more, tax less.\n\nSome of the specific ideas have real merit. Britain has an acute shortage of good affordable housing. Plenty of people would seek to buy a house if suitable properties were available at a vaguely sane price. Yet, as things stand, planning restrictions artificially restrict supply while the construction industry is staggering under its post-Olympic hangover. In principle, therefore, you could release demand and reignite an industry by changing planning laws so as to enable the provision of new homes.\n\nAnother good idea is widespread tax reform. The British tax system is too complicated and tax rates are too high. Simpler, broader taxes would allow tax rates to be lowered without any overall loss of revenue. The economy would surely benefit from such a reform. There would also be a huge boost to fairness, as the super-wealthy would find themselves having to pay tax instead of dodging it.\n\nBad plan: Certain other plans for spending cuts are just bananas, such as cutting stamp duty. Britain has long suffered from a huge property bubble, which is at its worst in London\n\nSo some of the ideas floating around at the moment are entirely valid. Some of the reforms mooted are obvious and overdue. But certain other ideas are just bananas. Cut stamp duty? Really? Britain has long suffered from a huge property bubble, which is at its worst in London.\n\n\n\nA valid alternative? Alistair Darling wants new investment in power stations, airports and railways\n\nStamp duty is a tax that’s hard to evade and which keeps some kind of lid on prices. Abolishing the tax will just encourage prices upwards: a disastrous step backwards to the bubble economy of 1997-2008.\n\n\n\nAnd higher prices will of course make it even harder for ordinary people to own their own homes, which should be a perfectly reasonable aspiration for working families in a twenty-first century democracy.\n\nOther ideas are more marginal. Alistair Darling wants new investment in power stations, airports and railways.\n\n\n\nHe’s right, of course, that Britain’s infrastructure does look ragged compared with that of our European competitors. New investment makes good sense, in principle. But why should we expect the government to fund that investment? If there’s a market demand for new airport capacity, the private sector should be able to fund it. If planning restrictions get in the way, Osborne needs to look at the planning laws – he shouldn’t just pull his chequebook out. Same with the railways. Same with power. Those services need to exist, but they need to be funded by the people who use them. Any other approach is a reversion to the jam-today, pay-tomorrow culture of the previous decade.\n\nThis debate is going to rumble away for some time to come. Osborne will face a thousand calls from a thousand directions to reverse course, to back off, to ease the pain. But before you join that chorus, please just remember the position we’re in. According to the IMF’s data, the British government will this year borrow 8% of GDP. That’s £124 billion. Of every £1 that the government spends, about 18p is borrowed money. That’s plainly unsustainable. If you look at all debt in the economy – household, government, corporate, banking – then our debt to GDP ratio is a terrifying 500%.\n\nThose numbers were produced in April. Since then, the economy has deteriorated, the outlook darkened. That doesn’t make is less needful to get the finances in order, but more needful. This entire crisis – from the collapse of Northern Rock to the travails of the Eurozone – arose because of too much debt. Too much stupid debt. Urging George Osborne to borrow more for longer is like telling an alcoholic to use cider as a way to get through his whisky withdrawal pangs.\n\nFor the same reason, it’s sheer madness for the Bank of England to cast around for new ways to loosen policy. The IMF’s commodity price index has almost doubled from its early-2009 lows. London house prices are crazy. The financial markets are also at unsupportable levels. These things are certain harbingers of inflation – and sure enough, last month, the RPI inflation index rose again, to 3.2% and it won’t stop there.\n\nYou would think these things would act like a cold shower on policy-makers. That they would remind them of basic truths: that debt is bad, that fiscal responsibility matters, that money-printing is destructive. Instead, though, it sometimes seems that those in charge of policy will do anything but face the facts. There’s talk about changing the way inflation is calculated – the classic government dodge: if the facts don’t change, fiddle the numbers. Meanwhile, the IMF wants the Bank of England to cut the base rate from 0.5% to 0.0%, as though current rates aren’t already absurd. The lunatics are trying to take over the asylum.\n\nBut personally, I think George Osborne understands all this. He’s not a dummy. He gets that you can’t cut expenditure without causing pain. He understands that too many people are still hooked on the Ponzi-ish belief that we can enjoy things today and pay for them tomorrow. Over the next few years, George Osborne might not be Mr Popular. He may yet prove to be Mr Right.", "description": "MITCH FEIERSTEIN: In February 2010, twenty economists published a letter in the Sunday Times calling on George Osborne to begin spending cuts a year earlier than planned.", "authors": ["Mitch Feierstein For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/i/pix/2012/08/20/article-2191094-124913DF000005DC-428_1024x615_large.jpg", "published_at": "2012-08-20"}