{"pub": "businessinsider", "url": "https://businessinsider.com/fill-in-the-blank-template-for-writing-effective-linkedin-profile-2019-9?r=rr", "downloaded_at": "2019-09-30 00:52:56.735087+00:00", "title": "A fill-in-the-blank template that'll make writing an effective LinkedIn profile summary way easier than doing it yourself", "language": "en", "text": "The first impression you make on a recruiter, a prospective client, or a potential partner often isn't your business card or your resume.\n\nIt's your LinkedIn profile.\n\nAnd that's a good thing! Rather than being confined to a piece of paper, you have a blank slate (well, a few blank fields) to tell a story about your professional self for the world to see.\n\nBut with all that freedom, where do you begin?\n\nA friendly photo, a strong title — that's all pretty simple. But that 2,000-character box for your summary can be a bit more daunting.\n\nAnd that's fair. In that space, you need to accomplish some important things. For example:\n\nYou want to tell a story about your career history, something that ties all of your jobs and responsibilities together and gives context to your path.\n\nYou want to get found in LinkedIn searches by recruiters, hiring managers, or clients.\n\nYou want to give those people a teaser of who you are — not just what you do, but why you do it, and what you're like as a person.\n\nYou want to encourage those people to reach out.\n\nRead more: There are 11 types of emails you'll send when you launch a business. Here's a template for each that will help you gain new clients and keep your old ones loyal.\n\nIt's a lot to cover in a little piece of real estate, but here's a template that'll make it easy:\n\nThe template\n\nI'm a[your title] who helps[your target audience][what you do].\n\nWhy?[Your back story]\n\nFor the past[years of experience], I've worked with companies like[past employers] to[key skill 1],[key skill 2], and[key skill 3]. In addition,[big accomplishments].\n\nI've also[additional work history], which[how you use it today].\n\nAdditional things I do well:[additional skills]\n\nIf you're[reason others would want to connect], I'd love to chat. Reach out at[contact info].\n\nRead more: One email I wrote brought in 100% of my clients after I started my business — here's the template\n\nHow to make it your own\n\nHere's a rundown of what to put in each of those template prompts:\n\nYour title: This doesn't have to be your exact job title; instead, use a broader, three- to five-word description that someone might type when searching for people with your background. (Think: B2B product manager, diversity and inclusion leader, or freelance beauty writer.)\n\nYour audience: If you're an entrepreneur, this might be your ideal client. If you're looking for a new job, you'll want to list the type of companies you've worked for (or want to) — for example, healthcare startups or public relations agencies. And if you've worked for a variety of places, think about the thread that ties them together, such as \"companies that do talent management differently.\"\n\nWhat you do: This is the big theme of your work — the umbrella of what you do. An example: As a marketing manager, you might be responsible for growth, SEO, and social media, but here, you could write something that ties those tasks together, like \"create lasting brands and engaged communities.\" (We'll get to the more specific skills later on.)\n\nYour backstory: Here, you'll get to share a bit about why you do what you do. What led you to this field? Why are you passionate about your work? No matter what your story is, talking about your \"why\" will help readers get to know you better and put a personal spin on your professional background.\n\nYears of experience: In this spot, add how many years you've been doing this to make your experience level clear to recruiters. (If you think it's irrelevant, or are worried about age-related discrimination, feel free to leave it out.)\n\nPast employers: List a few of the companies you've worked with before. It doesn't need to be a laundry list, just a few of your most eye-catching employers.\n\nKey skills: Here's where you'll get into more detail about what you do. What are your most important responsibilities? What are the skills that are most in-demand by potential hiring managers or clients? List three to five of them here.\n\nBig accomplishments: Now it's time to brag! What are some of your accomplishments — the things that make you stand out from others in your field? If you've received special certifications, won awards, or been featured in publications, this is the place to highlight them. You can also use this area to describe some of the results you've achieved or accolades you've received on the job.\n\nWork history and how you use it today: If you've changed careers or your work has evolved over time, it can be helpful to explain this here. Briefly mention what you've done in the past, and then, more importantly) highlight how it helps you in your career today.\n\nAdditional skills: Anything else you'd like to mention? Here's an easy catch-all area to add other keywords that recruiters or potential clients might search for (like, \"public speaking,\" \"management\" or \"volunteering\").\n\nReason others would want to connect, plus contact info: Finally, invite people to reach out to you and give them the best contact information to do so. Pro tip: If you're looking for a job and don't want to tip off your current employer, say something vague like, \"I'm always excited to chat with others in the digital media space — feel free to reach out.\"\n\nRead more: There are 7 types of emails you need to master to land your dream job. But they're easy to mess up. Here's a copy-paste template for each that will make you look great to employers.\n\nFinal thoughts\n\nOf course, you can and should adapt this template. Don't be afraid to add quotes, testimonials, or funny anecdotes to make it your own.\n\nAnd remember: While your LinkedIn profile summary should tell a story about who you are, it doesn't have to tell the whole story. (There's a character limit for a reason!) Think of it as a highlight reel — the top hits of your career that will make a prospective client or employer excited to learn more.", "description": "Adrian Granzella Larssen is a content strategist who founded her own business. Here's her LinkedIn summary template.", "authors": ["Adrian Granzella Larssen"], "top_image": "https://amp.businessinsider.com/images/5cffb4066fc92012b5284cf4-1920-960.jpg", "published_at": "2019-09-29"}