{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7537057/Five-people-killed-crash-landing.html", "downloaded_at": "2019-10-05 07:01:19.931051+00:00", "title": "Five people are killed Spanish cargo plane crash over Ukraine", "language": "en", "text": "Three desperate survivors were banging on the fuselage after being trapped in a Ukrainian Antonov-12 which 'ran out of fuel' today.\n\nFive people were killed when the cargo plane was forced to make an emergency landing just over a mile from Lviv airport in Ukraine following a flight from Vigo in Spain on Friday.\n\nThe plane, built in 1968, had vanished from radar some eight and a half miles from the airport.\n\nThose killed were named as chief pilot Vitaly Stepanenko, co-pilot Igor Maevsky, navigator Yury Kuzmenko, technician Igor Zavadyuk, and radio operator Vladimir Kirilenko.\n\nThe injured were listed as engineers Oleg Shakhov and Andrey Amelkin, along with technician Andrey Koryakin.\n\nFive people have been killed after a cargo plane (pictured) was forced to make an emergency landing when it 'ran out of fuel' over Ukraine\n\nReports said five people on board had died, and three survivors were injured.\n\nThere were eight people on the aircraft, seven crew and one person accompanying the unidentified cargo.\n\nLocal resident, Igor Sklyarevsky said 'The plane scythed down trees like grass.\n\nThe wounded were 'stuck in the cabin, knocking (on the fuselage) to save them.'\n\nA rescuer said: 'People were knocking and moaning. They were trapped by the cargo, badly wounded.\n\n'There was blood everywhere, their bones were broken.'\n\nTwo of the injured faced surgery and are now in intensive care.\n\nOne injured crew member called the emergency services to say the plane had made an emergency landing.\n\nThe four-engined plane was originally a Soviet air force aircraft used around the world for cargo transport.\n\nThe cargo plane came down just over a mile from the airport in Lviv following a flight from Vigo in Spain on Friday\n\nRescuers work at the crash site in a forest outside Lviv after Spanish cargo plane ran out of fuel\n\nInfrastructure Minister Vladyslav Kryklii said the aircraft had run out of fuel ahead of the crash.\n\n'Burning is not observed. The crew is being removed from the damaged aircraft,' a statement from Ukraine's emergencies service read.\n\nMaxim Sokolyuk, head of Ukraine's state migration service, said: 'There are casualties. An emergency landing was performed because the plane ran out of fuel.\n\n'An investigation into the accident has started.'\n\nNow there are also claims that the aircraft may have been overloaded with an unspecified cargo.\n\nThere is also a puzzle about the plane's circuitous route from Spain to Istanbul yet aiming for a refuelling stop in Ukraine.\n\nUkraine's National Guard at the scene of the crash which killed five and injured three", "description": "Three desperate survivors banged on the fuselage after being trapped in a Ukrainian Antonov-12 which 'ran out of fuel' today. Five people were killed when it crashed a mile from Lviv airport.", "authors": ["Will Stewart For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/18/19307648-0-image-a-2_1570208485085.jpg", "published_at": "2019-10-04"}