{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7570349/Englishwoman-48-wins-World-Porridge-Marking-Championship.html", "downloaded_at": "2019-10-14 10:11:15.451999+00:00", "title": "Englishwoman, 48, wins World Porridge Marking Championship", "language": "en", "text": "An Englishwoman has won the World Porridge Making Championship title.\n\nLisa Williams, from Suffolk, claimed the golden spurtle in the 26th annual competition, which is held in Carrbridge in the Highlands.\n\nThe title is awarded to the contestant deemed to have made the best traditional porridge using just three ingredients; oatmeal, water and salt.\n\nA Londoner won the speciality title with his maple pecan porridge.\n\nLinda William's winning recipe was made with half Scottish oatmeal and half pinhead oatmeal, along with Maldon sea salt\n\nMs Williams, who has entered the competition three times before, said the trick to the perfect porridge was to 'keep stirring'\n\nMs William's winning recipe was made with half Scottish oatmeal and half pinhead oatmeal, along with Maldon sea salt.\n\nMs Williams, who has entered the competition three times before, said the trick to the perfect porridge was to 'keep stirring.'\n\nThe judges tasted more than 60 porridges throughout the day.\n\nNick Barnard, from London, won the speciality title with his maple pecan porridge which included oatmeal, pecans from South Africa and Guernsey cream from a farm in Somerset.\n\nMs Williams, who runs a social enterprise and a community cafe for adults with learning disabilities in Trimley St Mary near Felixstowe in Suffolk, said she was 'surprised and thrilled' to win the competition.\n\nThe 48-year-old added: 'I discovered the golden spurtle in 2015 and immediately fell in love with the competition. In 2016 I made it to the final six and have been chasing the dream ever since.\n\n'I absolutely love the competition. From the moment you step into the hall you are welcomed like family.\n\n'It's hard to describe, but from the flags and the tartan, to the people from the village who organise everything, the ladies who serve the porridge, the volunteers who wash up our equipment, the porridge parade, the bagpipes - it's just magical.\n\n'I didn't used to use salt in my porridge, but I saw Nigel Slater using it years ago and have been doing the same ever since.'\n\nContestants from Sweden, Russia, France, Poland, Canada, Scotland, England, Ireland, Wales, Belgium and Germany descended on Carrbridge in Badenoch and Strathspey for the big event.\n\nSome 30 finalists, stirring furiously with their wooden spurtles, battled over five heats for the ultimate accolade.\n\nAs well as the title and the Golden Spurtle there was a cash prize of £500.\n\nNick Barnard, from London, (left) won the speciality title with his maple pecan porridge which included oatmeal, pecans from South Africa and Guernsey cream from a farm in Somerset\n\nThe title is awarded to the contestant deemed to have made the best traditional porridge using just three ingredients; oatmeal, water and salt\n\nCharlie Miller, from the organising committee, said: 'This year's competition attracted competitors from 11 different countries including Sweden, Canada, Germany, France, Poland and from across the UK.\n\n'It has been a fantastic weekend celebrating a mutual love of porridge. Congratulations to our winners, well done to all competitors, and thanks to our sponsors and to everyone who came to watch them battling it out.'\n\nPorridge company Hamlyns of Scotland Managing Director, Alan Meikle, said: 'It's great to see that it's not just us Scots who are so passionate about porridge.\n\n'It's really interesting to see how something made from just oatmeal, salt and water can vary so much, and of course we love seeing the culinary flare in the speciality event. Congratulations to the winners, and also to Carrbridge Community Council on another excellent event.'\n\nThe judges were Colin Bussey, former head chef at Gleneagles, Lydie Bocquillon, classically taught French chef and owner of the Auld Alliance in Kingussie, and Neil Mugg, chef lecturer at Perth College UHI and former Head Pastry Chef at Glengeagles.", "description": "Lisa Williams, from Suffolk, won the coveted golden spurtle in the 26th year of the World Porridge Making Championships, which are held in Carrbridge in the Highlands every year.", "authors": ["Amie Gordon For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/09/19682828-0-image-a-18_1571042768420.jpg", "published_at": "2019-10-14"}