{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7632467/Owen-Farrell-George-Ford-spent-hours-practising-rugby-together.html", "downloaded_at": "2019-10-30 23:53:15.126697+00:00", "title": "Owen Farrell and George Ford spent hours practising rugby together", "language": "en", "text": "To the casual observer, there was nothing remarkable about the scene, played out on the parks, fields and gardens of Harpenden in Hertfordshire 15 years ago.\n\nTwo lads, kicking a rugby ball about after school. Teenagers living in the same suburban cul-de-sac, no doubt with homework that needed to be done, but for whom a kickabout with a friend took priority.\n\nNobody would have guessed that these two — no different to any boys (and girls) up and down the country filling half-term time — would one day represent their country, playing side by side, with the hopes of a nation resting on their now much broader shoulders.\n\nFast forward to Saturday and those same two lads will be part of the most anticipated rugby match in more than a decade. For those two lads were — are — Owen Farrell and George Ford. Schoolboy friends who bonded over their passion for sport and who will join the England line-up in Yokohama for the Rugby World Cup final on Saturday.\n\nFast forward to Saturday and those same two lads will be part of the most anticipated rugby match in more than a decade. For those two lads were — are — Owen Farrell and George Ford\n\nAs young lads, they'd devised a system so they could spend as much time as possible on the important things in life. Practising rugby.\n\n'All we wanted to do was go outside and kick a ball around,' Ford has said of their time growing up in each other's pockets.\n\n'Owen used to come home and be like, \"C'mon mate, we need to go outside and have a mess around, do a bit of my homework for me.\" I'd be, \"All right.\" And I'd start doing a bit of his French or whatever it was. That way we could go out on the front and kick a ball around, it was stupid of me when you look back on it.'\n\nStupid? Rugby fans anticipating Saturday's final would disagree. It has meant a deep friendship, forged as precociously talented under-11s playing rugby league (the code of the game with 13, rather than 15, players) in the clubs of northern England.\n\nIt followed them south when their dads joined Saracens rugby union club, and continued when the young pals went on to play professional rugby and be capped for their country (both were set to be named in the World Cup final squad when the line-up was announced this morning).\n\nSchoolboy friends who bonded over their passion for sport and who will join the England line-up in Yokohama for the Rugby World Cup final on Saturday\n\nThe friendship also spawned a nagging rivalry as they competed to play in the coveted fly-half position. To this day, it continues, with the England coach Eddie Jones swapping them in and out of that role depending on the tactics and the opposition — to the team's benefit.\n\nEven more astonishing, is the fact that both boys went to a school which has produced four of England's players.\n\nAs well as Farrell and Ford, the state comprehensive St George's School in Harpenden can also boast Maro Itoje and Jack Singleton among its former pupils.\n\nFarrell and Ford joined the school as members of rugby league royalty: Farrell's father Andy originally played for Wigan but switched codes and joined Saracens in 2005, shortly after George's father Mike — another rugby league original — was named the club's coach. Itoje was one of the few boys who boarded at the state school, while Singleton came from a strong sporting family.\n\nIt's an incredible return for a state comprehensive, albeit one with a proud rugby history.\n\nWhen classes resume next week after half-term, the current crop of hopefuls will build up their strength in the Owen Farrell Fitness Suite, dreaming that their picture will join the school's wall of fame.\n\nAs a young boy, Farrell was known for his steely resolve. Aged 12 and playing for St Patricks rugby league club in Wigan, Farrell sported a mop of long, blond hair, kept out of his eyes by a hairband.\n\n'He took pride in his hair,' a team-mate from those days recently recalled. 'I remember the opposition trying to wind him up one day and, every time they could, they'd pull his hairband over his face.\n\n'Eventually Owen lost his cool and it all kicked off. By the time any of us got there he'd laid four of them out. He wasn't someone to mess with.'\n\nFormer England rugby union defensive coach Mike Ford with his sons\n\nA decade and a half on and that haircut is shorter and sharper — but the steely inner core remains.\n\nLast Saturday, as the New Zealand opposition performed the Haka, the fearsome Maori 'war dance' with which they begin each match, Farrell wasn't going to be intimidated. Instead, watching with his team-mates, the faintest trace of a smile — a smirk, even — flickered across the England captain's normally expressionless face.\n\nGiven the reputation of the All Blacks, such provocation could easily have backfired. But within two minutes of the start of the semi-final, England had taken the lead. They never looked back, winning the game and booking a place in Saturday's final.\n\nThat's not to say that Farrell, 28, came out of the encounter entirely unscathed, suffering a dead leg that hampered him for much of the match.\n\nWhile it meant that he had to hand over the kicking duties, it was fitting that George Ford — England's fly-half on the day — was on hand to take on the task. Of course, during the match, nobody dared to suggest to Farrell that he might consider leaving the field of play because of his injury.\n\n'I think you would have needed a samurai sword to get him off,' Eddie Jones observed afterwards.\n\nBut then, that's Farrell for you. Not only one of the most gifted rugby union players in the world — but one of the toughest, too. Given his heritage, that's hardly surprising. His mother, Colleen O'Loughlin, and father, Andy, teenage sweethearts, were just 16 when he was born in Wigan. They didn't have a home of their own, each instead giving their parents' addresses on their son's birth certificate.\n\nAlmost from the word go, Owen was by his dad's side, living and breathing every aspect of a game that ran in his blood\n\nOn the same document, his dad recorded his occupation as 'apprentice joiner'.\n\nIt wasn't a profession he would pursue for long.\n\nBecause by then Farrell Senior was already making his name with Wigan Warriors. By the age of 18 he was playing international rugby, going on to captain Great Britain.\n\nAlmost from the word go, Owen was by his dad's side, living and breathing every aspect of a game that ran in his blood. Having had him so young, say friends, the bond between the pair was more like that of best buddies than parent and son. During school holidays, the youngster would watch his father train, helping collect the balls afterwards — 'Big Faz' and 'Little Faz' as they were known.\n\n'There were always rugby balls in the house,' Farrell recalled. 'Pretty much everyone in my family used to play. My dad taught me how to kick. That's what you want to do as a kid — kick a ball.'\n\nBy the age of 12, Farrell was streets ahead of his peers: 'From early on, you could tell he was a bit different,' recalls Martin McLaughlin, one of his coaches at St Patricks.\n\nEven at that age word began to spread that Farrell looked set to follow his father to the top of the game. And by 'game' he meant rugby league, not rugby union.\n\nBut that all changed in 2005 when his father moved south to switch codes and pursue a career with Saracens — a top rugby union club. The family moved to a £1 million home in Harpenden, Hertfordshire — much to the fury of the young Farrell. His dad recalled his boy 'kicking and screaming' about the move, which took him away from his beloved rugby league.\n\nInitially, the plan was for him to go back up north at the weekends by train so he could carry on with his old team, staying with his grandparents.\n\nBut it wasn't long before he got a taste for rugby union, being 'dragged down' to Harpenden RFC where his talents were there to see.\n\nSports teacher Steve Robbins recalls the young Farrell's arrival.\n\n'He turned up on his first day and everyone stared at him thinking: 'Blimey, you look about two years older than us,' ' says Mr Robbins.\n\n'He was quite quiet because it was a different environment for him — a church school down south with smart blazers. He looked uncomfortable but it didn't take him long to undo his top button.'\n\nFarrell's primary interest was sport rather than study, and George was happy to help out with the homework: 'George was a bit more organised than me,' Farrell himself has admitted. By their mid-teens, Farrell was on the books at Saracens, while Ford was making a name for himself for Leicester Tigers, and both made their way up the England age-group teams.\n\nFor his Saracens debut, in a pre-season friendly, Farrell was on the bench alongside his father. Early in the second half, Andy went on first and suffered a broken thumb, to be replaced by his son. As one Farrell exited the stage, another entered.\n\nSince retiring from playing the game Farrell Senior has become a successful coach. He and his son have worked alongside one another, first at Saracens and then at England. And, more recently, they have lined up for opposing sides — Andy recently started as head coach of Ireland.\n\nDespite his star status and chiselled good looks, Farrell's fame has never gone to his head. In a recent interview, he said that he does not see himself as a 'celebrity' and would never consider going down the Strictly Come Dancing route.\n\nLast year, he married his girlfriend Georgie Lyon and in March they had a son, Tommy. Georgie keeps herself very private: apart from one appearance on his Instagram account during a holiday in July 2016, she has never been pictured alongside Owen publicly on social media, and very little is known about her or their relationship.\n\nThe bond between father and son was evident at Owen's wedding evening reception when the pair sang Oasis's Some Might Say together.\n\nOn the day Owen's son was born, Saracens were playing Glasgow in the Champions Cup. Kick-off was at 3.15pm. At 2.30pm, Farrell rang his club saying that the birth was imminent and he thought that he still might be able to play.\n\nUnsurprisingly, in the end he didn't make the game — but it's a mark of his dedication to the sport that he even thought it possible.\n\nAnother mark of the man is the work he has done for charity. For the past few years, whenever Farrell scores on the rugby field he celebrates by locking his two forefingers together, his arms held out in front of him.\n\nThe trademark gesture forms the letters 'JJ' — the initials of 11-year-old Jack Johnson, who suffers from Duchenne muscular dystrophy, a muscle-wasting disease.\n\nJack is the terminally ill son of Andy Johnson, a former team-mate of Farrell's father at Wigan.\n\nAs well as helping raise the profile of the disease and the Joining Jack charity, he also helps out at events as well as spending time with Jack.\n\nA sure sign that, even if come Saturday he and England find themselves on top of the world, Owen Farrell will never forget his roots.", "description": "Nobody would have guessed that these two would one day represent their country, playing side by side, with the hopes of a nation resting on their now much broader shoulders.", "authors": ["Tom Rawstorne For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/22/20399038-0-image-a-11_1572473215232.jpg", "published_at": "2019-10-30"}