{"pub": "cbs", "url": "https://cbsnews.com/news/antonio-brown-released-by-new-england-patriots-following-rape-allegation-2019-09-20", "downloaded_at": "2019-09-20 22:52:54.906149+00:00", "title": "Antonio Brown released by Patriots following rape allegation", "language": "en", "text": "The New England Patriots on Friday released wide receiver Antonio Brown, 10 days after he was accused of rape in a federal lawsuit by a former trainer. Brown was signed by the Patriots on September 7, just days before the lawsuit was filed in Florida.\n\n\"We appreciate the hard work of many people over the past 11 days, but we feel that it is best to move in a different direction at this time,\" the Patriots said in a statement.\n\nBrown tweeted, \"Thanks for the opportunity appreciate @Patriots.\"\n\nEarlier this week, Sports Illustrated reported that another woman accused him of sexual misconduct. He was later accused of sending her threatening text messages after the story published.\n\nAccording to Sports Illustrated, Brown and the woman, an artist, had begun working together after he bought a piece of her artwork. But, she said, one day when she was in a kneeling position while painting, she turned to find Brown allegedly naked and holding a small hand towel over his genitals.\n\nThe report came after Brown's former trainer, Britney Taylor, accused him of sexually assaulting her in three separate incidents — two in June 2017 and one in May 2018. The federal lawsuit, filed on September 10, alleged that Brown first exposed himself to and then kissed the woman without her consent at his Pittsburgh-area home in June 2017.\n\nLater that same month, Taylor alleged she and Brown were at his Miami home watching a religious video when she said he masturbated behind her without her knowledge and then ejaculated on her back. She alleged that Brown referenced the incident in profane text messages, which she included in the lawsuit.\n\nAntonio Brown of the New England Patriots looks on against the Miami Dolphins during the fourth quarter at Hard Rock Stadium on September 15, 2019, in Miami. Getty\n\nAccording to the lawsuit, Taylor cut off her working relationship with Brown, but after he promised to stop any sexual advances, she agreed to train with him again. In May 2018, the lawsuit alleged that Brown \"forced\" the woman \"down onto a bed, pushed her face into a mattress and forcibly raped her.\" The lawsuit alleges that the woman \"screamed and cried\" throughout the rape, and she \"repeatedly\" said no.\n\nBrown's lawyer said in a statement that Brown denies \"each and every allegation.\"\n\nTaylor has said she would cooperate with the NFL's investigation. Her lawyer said Friday they had no comment on his release from the Patriots.\n\nBrown joined the Oakland Raiders in March but his relationship with the team quickly turned sour by September. On September 6, Brown apologized to the team after a string of missteps. But one day later, he posted a message to Instagram, telling the team to release him.\n\nShortly after the post, the Raiders released him, but he signed a deal with the Patriots hours later.\n\nTaylor's lawsuit was filed on Tuesday, September 10 in federal court in Florida. At a press conference on Wednesday, New England Patriots coach Bill Belichick shut down reporters' questions about the allegations. Belichick refused to answer if he knew about the allegations when they signed Brown and said they are taking it \"one day at a time.\"\n\nBrown sat out the first week but played the second week against the Dolphins.\n\nAt a press conference shortly before the Patriots announced they were releasing Brown, Belichick refused to answer any questions about him.\n\nNike confirmed Thursday the company had cut ties with Brown and his signature sneakers were no long available on the company's website.", "description": "\"We appreciate the hard work of many people over the past 11 days, but we feel that it is best to move in a different direction at this time,\" the Patriots said in a statement", "authors": ["Caroline Linton"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/20/f5992956-27e7-459d-8569-ca3d865ec3cb/thumbnail/1200x630/447a3b59f35cbcbf60432f61c87c2d69/gettyimages-1174876889.jpg", "published_at": "2019-09-20"}