{"pub": "atlantic", "url": "https://theatlantic.com/newsletters/archive/2019/09/back-to-campus-books-briefing/597691", "downloaded_at": "2019-09-13 18:09:56.067898+00:00", "title": "The Books Briefing: Campus Life Is Full of Plot Twists", "language": "en", "text": "📚 Substitute: Going to School With a Thousand Kids, by Nicholson Baker\n\nSusan Choi’s taut drama-school narrative asks: Where does art end and reality begin?\n\n“It’s a meta work of construction and deconstruction, building a persuasive fictional world and then showing you the girders, the scaffolding underneath, and how it’s all been welded together. It’s also a work that lives in the gray area between art and reality: the space where alchemy happens.”\n\n📚 Trust Exercise, by Susan Choi\n\nHow I became an ‘accidental’ professor\n\n“I genuinely did not think I was smart enough to be a professor … But I knew … that I wanted to be someone who made knowledge, who got to live in books and in theories about books, who got to spend her life writing while teaching future generations of writers how to pick apart the books they loved and discover how they were built.”\n\n📚 An excerpt from My Time Among the Whites: Notes on an Unfinished Education, by Jennine Capó Crucet\n\n📚 Make Your Home Among Strangers, by Jennine Capó Crucet\n\nThe plight of the black academic\n\n“Research shows [that] when these professors are in the numerical minority, their experiences aren’t all that different from what [W. E. B.] Du Bois encountered as he attempted to navigate higher education in the early 20th century: exclusion, marginalization, and the consistent message that, as a black person, he was not suited for the academy and that his ideas were unwelcome.”\n\n📚 The Scholar Denied: W.E.B. Du Bois and the Birth of Modern Sociology, by Aldon Morris\n\n📚 Systemic Racism: A Theory of Oppression, by Joe R. Feagin\n\n📚 Reproducing Racism: White Space, Elite Law Schools, and Racial Inequality, by Wendy Leo Moore\n\nA brief taxonomy of fictional academics\n\n“You know how dogs look like their owners? The bouncy, athletic guy matches his golden retriever, and the tall, skinny lady with a long nose, her greyhound? Likewise, fictional academics resemble their work.”\n\n📚 Hedda Gabler, by Henrik Ibsen\n\n📚 Lucky Jim, by Kingsley Amis\n\n📚 Stoner, by John Williams\n\n📚 Talent, by Juliet Lapidos\n\nThe Reference Desk\n\n(New York Public Library)\n\nThis week’s question is “a slightly sideways cry for help” from Jessica:\n\nWe read to my mom every day—she is 89, physically incapable, and has a bit of a cognition challenge—but we are having problems finding good books to read. We have encountered too many books that are fine when read in your own head, but do not read well out loud, or in which the plot lines are a bit too mobile, or where there is an unpleasant aspect to the tale that comes up suddenly or feels gratuitous. We are reading Paradise of the Blind right now (gorgeously written), and she has recently enjoyed Tesla: Man Out of Time, and Fly Girls: How Five Daring Young Women Defied All the Odds, among many others.\n\nWhat a lovely way to spend time with your mother. My family had a similar tradition of reading aloud at the dinner table, and one of our favorite titles was the memoir Rocket Boys, about a group of West Virginia teenagers inspired to build their own rockets when Sputnik passes over their coal-mining hometown. In general, memoirs should provide a good straightforward narrative to read aloud; you could check out those of Françoise Gilot, Ruth Reichl, and Michelle Obama.", "description": "Please turn to the next page in your syllabus: your weekly guide to the best in books.", "authors": ["Rosa Inocencio Smith"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/shutterstock_659133262/facebook.jpg?1568131909", "published_at": "2019-09-13"}