{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/best-of-late-night/2019/10/15/trevor-noah-stephen-colbert-snl-trump-giuliani-late-night-comedy/3979882002", "downloaded_at": "2019-10-15 23:06:04.168518+00:00", "title": "Best of Late Night: Trump's friends and associates plan", "language": "en", "text": "CLOSE President Donald Trump's treatment of his friends and associates leaves much to be desired. Mike Thompson, Detroit Free Press\n\nThe late night comics point out that President Trump's idea of friendship leaves a lot to be desired\n\nThere don't seem to be many advantages to joining President Donald Trump's friends and associates plan. The president is notorious for throwing just about anyone under the bus if it suits his needs. It's a habit that continues to create havoc with US foreign policy and the late night comics have taken note.\n\nTrevor Noah points out that Trump's erratic foreign policy has left our friends and allies in the Middle East in a lurch. The president's willingness to \"flip\" on his own vice president didn't escape Stephen Colbert's notice. Jimmy Kimmel pokes fun at Trump's ever-changing loyalty to his personal attorney Rudy Giuliani, a trait that Saturday Night Live's Kate McKinnon picks up on in her hilarious impersonation of the former mayor of New York.\n\nTrevor Noah works on the set of \"The Daily Show\" on Sept. 29, 2015 in New York. (Photo: Evan Agostini/Invision/AP)\n\nAfter you watch our favorite jokes from last night's late-night lineup, vote for yours in the poll below.\n\nFollow Mike Thompson onFacebook and Twitter\n\nMore humor:\n\nRead or Share this story: https://www.usatoday.com/story/opinion/best-of-late-night/2019/10/15/trevor-noah-stephen-colbert-snl-trump-giuliani-late-night-comedy/3979882002/", "description": "Best of Late Night: President Trump's treatment of his friends and associates leaves much to be desired.", "authors": ["Mike Thompson", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/02/19/USAT/1229021f-1414-4804-9e17-56fe32d669d3-XXX_SW_Trevor_Noah.JPG?crop=2082,1171,x321,y180&width=3200&height=1680&fit=bounds", "published_at": "2019-10-15"}