{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7531775/American-Horror-Story-1984-Emma-Roberts-stabbed-neck-tensest-episode-yet.html", "downloaded_at": "2019-10-05 06:24:01.728537+00:00", "title": "American Horror Story: 1984: Emma Roberts is stabbed in the neck in tensest episode yet", "language": "en", "text": "In a series of dramatic plot twists, FX's anthology series American Horror Story shows us time and time again that all will never be as it seems.\n\nLast week’s episode saw Dr. Hopple (played by Orla Brady) try to warn Camp Director Margaret (Leslie Grossman) that Mr. Jingles aka Benjamin Richter (John Carroll Lynch) had escaped and was likely looking to kill again. Margaret ignores Dr. Hopple’s advice to close down the camp, putting everyone at risk.\n\nEntitled 'Slashdance,' this week's episode opens with Nurse Rita (Angelica Ross), Brooke (Emma Roberts), Chet (Gus Kenworthy) and Rey (DeRon Horton) hiding in the infirmary as an unknown killer pounds on the door.\n\nEntitled 'Slashdance,' this week's episode opens with Nurse Rita (Angelica Ross), Brooke (Emma Roberts), Chet (Gus Kenworthy) and Rey (DeRon Horton) hiding in infirmary as an unknown killer pounds on the door.\n\nThey continue looking for they keys to Rita's getaway Volkswagen until the Night Stalker, aka Richard Ramirez (played by Zach Villa), breaks a window.\n\n'That's not Mr. Jingles,' Nurse Rita says, as they all realize Brooke wasn't lying, they really are up against two killers.\n\nThey find keys and Brooke suggests they make a run for it, saying, 'There are four of us and one of him.'\n\nRey agrees, explaining Darwinism. At least three people will make it out alive, he argues.\n\nDouble the trouble: 'That's not Mr. Jingles,' Nurse Rita says, as they all realize Brooke wasn't lying, they really are up against two killers\n\nSurvival of the fittest: Rey agrees, explaining Darwinism. At least three people will make it out alive, he argues\n\nAs he heads for the door, The Night Stalker opens it and begins slashing his forearms. Chet comes back to save him, picking him up with a 'Move it, Darwin.'\n\nRey and Chet are seen running through the woods towards the car together while Brooke and Rita are a few steps ahead of them. Brooke hears a scream and almost doubles back, but Nurse Rita tells her to push on.\n\nThe boys have fallen into pit with spikes, similar to one in Vietnam, Chet notes. The Olympic Medalist has been stabbed through the heart. Rey tells him he can't move him or he'll bleed out.\n\nMeanwhile, Trevor (Matthew Morrison), Xavier (Cody Fern) and Montana (Billie Lourd) are hiding in a cabin when suddenly, a flaming bag of poop is thrown into the cabin by two pranksters.\n\nTrap: The boys have fallen into pit with spikes, similar to one in Vietnam, Chet notes. The Olympic Medalist has been stabbed through the heart. Rey tells him he can't move him or he'll bleed out\n\nHideaway: Meanwhile, Trevor (Matthew Morrison), Xavier (Cody Fern) and Montana (Billie Lourd) are hiding in a cabin\n\nFire! Suddenly, a flaming bag of poop is thrown into the cabin by two pranksters\n\n'Happy Jingles day douchewads,' one prankster says as the group steps outside.\n\nThen, Mr. Jingles appears behind the tricksters, brutally murdering both of them and cutting off their ears while the others escape.\n\nA third, nerdier prankster is then seen in the woods, having been ditched by his other, now deceased, friends.\n\nMr. Jingles walks up behind him as he can be heard telling, who he thinks is his buddy, that he knows he was only invited because his mom pushed them to invite him.\n\nPranksters: Then, Mr. Jingles appears behind the tricksters, brutally murdering both of them and cutting off their ears while the others escape\n\nMercy! A third, nerdier prankster is then seen in the woods, having been ditched by his other, now deceased, friends. 'When I wear this mask I am Jingles, the most ruthless killer of all time. Just let me be a badass for one night, come on,' he pleads\n\nBut he's desperate for some fun.\n\n'When I wear this mask I am Jingles, the most ruthless killer of all time. Just let me be a badass for one night, come on,' he pleads.\n\nMr. Jingles shows mercy for his fan and lets him go as he stumbles into the darkness.\n\nMeanwhile, Nurse Rita and Brooke have made it to their getaway car.\n\nRita casually lights up a smoke while Brooke worries why it's taking the boys so long.\n\n'Maybe we should get help,' she suggests.\n\n'And leave everyone to fend for themselves? Your friends wouldn't bail on you like that,' Rita says before handing her the keys and telling her to go.\n\nAs Brooke fumbles with the car keys, Rita stabs her in the neck with a horse tranquilizer, she thinks.\n\n'I mean I'm not a nurse. My degree is in psychology,' she admits.\n\nGetaway! Meanwhile, Nurse Rita and Brooke have made it to their getaway car\n\nBackstabber: As Brooke fumbles with the car keys, Rita stabs her in the neck with a horse tranquilizer, she thinks\n\nNot who you think: 'I mean I'm not a nurse. My degree is in psychology,' she admits.\n\nWe're then transported into a flashback from one week ago where Rita is seen sitting in a meeting with Dr. Hopple who tells the nurse: 'Mr. Richter is a lost cause.'\n\nIn a Mindhunters crossover-eqsue scene, Nurse Rita tells Dr. Hopple that during her research for her PhD, she recently spoke with infamous murderer Ted Bundy and he confessed to two additional murders.\n\nShe says many killers are closed off '...until Donna Chambers arrives and opens them.'\n\nIt's then that we realize Nurse Rita is actually Donna Chambers and she's officially convinced Dr. Hopple to let her interview Mr. Jingles.\n\nIn the interview, she tells the murderer that since the mid-1970's, there's been an uptick in murders, she believes because of increased access to pornography that's damaged the minds of 'otherwise good men.'\n\nTimewarp: We're then transported into a flashback from one week ago where Rita is seen sitting in a meeting with Dr. Hopple who tells the nurse: 'Mr. Richter is a lost cause'\n\nIt's then that we realize Nurse Rita is actually Donna Chambers and she's officially convinced Dr. Hopple to let her interview Mr. Jingles.\n\nIn the interview, she tells the murderer that since the mid-1970's, there's been an uptick in murders, she believes because of increased access to pornography that's damaged the minds of 'otherwise good men.'\n\nShe tells him she wants to get him out to study him in his natural habitat, showing him the newspaper clip of the camp opening back up.\n\n'Sometimes sacrifices need to be made in the name of science,' in order to find 'the world's last serial killer,' she tells him before instructing him how to escape.\n\n'Did someone hurt you?' he asks.\n\n'I have my reasons, but most importantly, no one is born evil,' she replies.\n\n'I feel like I'm being seen for the first time in 14 years,' he says, a sentiment we heard echoed by the Night Stalker when speaking to the camp director in Episode 2. Could Margaret be in on the experiment?\n\nExperiment: 'Sometimes sacrifices need to be made in the name of science,' in order to find 'the world's last serial killer,' she tells him before instructing him how to escape\n\nAssist: She tells him she wants to get him out to study him in his natural habitat, showing him the newspaper clip of the camp opening back up\n\nNot Nurse Rita: Donna hops in Rita's back seat while she's in the restroom. We don't see the murder scene\n\nWe then see Donna following the real Nurse Rita to a desolate gas station on the way to camp.\n\nDonna hops in Rita's back seat while she's in the restroom. We don't see the murder scene.\n\nCut to Rey who is having a 'come to Jesus moment,' as he and Chet are still stuck in the pit.\n\nWhile Chet is passed out, Rey tells him of a frat party hazing gone wrong. Not only did Rey try to cover up the death of a pledge named Chan, but he actually kills him twice.\n\nBelieving he's dead after drunkenly tripping on the stairs, Rey straps Chan to the driver's seat of a car that he then pushes over a cliff. Just before the car edges over the ledge, Chan wakes up, but it's too late. Rey is unable to save him.\n\n'That's why I'm here. I'm runnin'. It feels good to finally tell someone,' he admits.\n\nBut Chet was awake, he heard the whole thing.\n\nRey climbs out of the pit while Chet begs him not to leave him down there alone.\n\nConfessions: While Chet is passed out, Rey tells him of a frat party hazing gone wrong\n\nKiller: Not only did Rey try to cover up the death of a pledge named Chan, but he actually kills him twice\n\nNasty spill: Rey believes he's dead after Chan takes a nasty drunken spill down the stairs\n\nCover up: Rey tries to cover up the death by strapping Chan to the driver's seat of a car he then pushes over a cliff\n\nToo late: Just before the car edges over the ledge, Chan wakes up, but it's too late. Rey is unable to save him\n\nMeanwhile, Xavier has a guilty conscious. He's already gotten one person killed (his sugar daddy Blake) and he wants to turn around and find to Margaret. He, Montana and Trevor double back.\n\nThey hear jingling and hide only to discover a duct-taped Nurse Rita in a body bag, still alive. They take off the tape and she screams.\n\nMuch to the other's chagrin, she escapes their shushes, only to find Mr. Jingles towering over her.\n\nHe drives a perfectly themed sharpened oar through her head as the other's watch, terrified and a silent tear falls down Xavier's face.\n\nAs they climb out from their hiding place, they see her uniform with the name 'Rita R.N.' stitched on the front.\n\nShe's alive! They hear jingling and hide only to discover a duct-taped Nurse Rita in a body bag, still alive. They take off the tape and she screams\n\nWhoops: Much to the other's chagrin, she escapes their shushes, only to find Mr. Jingles towering over her\n\nUnlucky one: He drives a perfectly themed sharpened oar through her head\n\nPerfectly themed death: The other's watch, terrified and a silent tear falls down Xavier's face\n\nAs they continue to try to make their way to Margaret, they meet up with Rey in the woods.\n\nRey tells the group he and Chet 'got separated.' He's dedicated to escaping, so he and Montana head to the motorcycle while Trevor and Xavier head back towards camp.\n\nXavier and Trevor find Chet en route to Margaret.\n\nThey successfully pull him off the spike and out of the pit when they hear jingling keys in the distance.\n\nTrevor attacks Mr. Jingles, pushing him into the spike pit with a 'Welcome to your own petard a**hole.' As he peers down into the pit he sees a mask off to the side. It wasn't Mr. Jingles. It was the third prankster.\n\nMeet up: As they continue to try to make their way to Margaret, they meet up with Rey in the woods\n\nSaved! Xavier and Trevor find Chet en route to Margaret\n\nSuccess: They successfully pull him off the spike and out of the pit when they hear jingling keys in the distance\n\nWhoops: Trevor attacks Mr. Jingles, pushing him into the spike pit with a 'Welcome to your own petard a**hole.' As he peers down into the pit he sees a mask off to the side. It wasn't Mr. Jingles. It was the third prankster\n\nMontana and Rey finally reach the motorbike when run into the Night Stalker.\n\nRey selfishly takes off on the bike, leaving Montana alone with the killer.\n\nHe's almost reached the exit when Mr. Jingles finds him, slicing his head off with an ax as he passes him at 50 mph.\n\nHe's the first in their immediate crew to be killed.\n\nThe episode ends when Montana shares a passionate kiss with the Night Stalker, then biting his lip and asking 'Why the hell haven't you killed her yet?'\n\nDesperate to escape: Rey selfishly takes off on the bike, leaving Montana alone with the killer\n\nAlmost made it! Rey has almost reached the exit when Mr. Jingles finds him, slicing his head off with an ax as he passes him at 50 mph", "description": "Entitled 'Slashdance,' this week's episode opens with  Rita (Angelica Ross), Brooke (Emma Roberts), Chet (Gus Kenworthy) and Rey (DeRon Horton) hiding as an unknown killer pounds on the door.", "authors": ["Cailley Chella For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/07/19239356-0-image-a-71_1570082974935.jpg", "published_at": "2019-10-03"}