{"pub": "businessinsider", "url": "https://businessinsider.com/argentine-soccer-manager-fined-for-cheating-wins-fair-play-award-2019-9", "downloaded_at": "2019-09-24 13:59:50.987688+00:00", "title": "An Argentine soccer coach won FIFA's annual Fair Play award just months after he was fined $248,000 for cheating", "language": "en", "text": "An Argentine soccer coach who was fined $248,000 for cheating in February just won FIFA's annual Fair Play award.\n\nBielsa, who manages English club Leeds United, landed himself in hot water at the start of the year when he admitted in a press conference that the club had illegally spied on opposition training sessions prior to matches in order to gain an advantage.\n\nThe English Football League launched an investigation into \"spygate,\" and subsequently fined Bielsa and Leeds $248,000 — a fee the 64-year-old paid out of his own pocket, according to The Independent.\n\nThe EFL also introduced a new rule a new rule which prevents teams viewing opponents' traning sessions 72 hours prior to matches.\n\nRead more: The 'world's strongest soccer player' is starting a charity for young players suffering racial abuse after his own experiences as a teenager in Eastern Europe\n\nFIFA, however, chose to ignore the incident on Monday night when it handed Bielsa and Leeds its annual Fair Play Award at the Best FIFA Football Awards in Milan.\n\nThe Argentine and his side were awarded the prize thanks to a separate incident in April, when Bielsa ordered his team to allow opponents Aston Villa to score unchallenged after Leeds scored whilst a Villa player was injured.\n\nBielsa's instructions meant the game finished 1-1, and ultimately resulted in his side missing out on promotion to the Premier League.\n\n\"Some residents of planet football consider winning the ultimate. The only purpose of playing the sport,\" reads a statement from FIFA.\n\n\"For others though, there are values which need to be held even higher than those which bring victory.\"\n\nRead more: 3 charts that show Neymar has been a massive waste of money at Paris Saint Germain\n\nLionel Messi won the Best Mens Player award on the night, whilst World Cup hero Megan Rapinoe scooped the Womens Best Player.", "description": "Marcelo Bielsa, who manages Leeds United, admitted the team spied on opponents back in February, but he still won FIFA's annual sportsmanship prize.", "authors": [], "top_image": "https://amp.businessinsider.com/images/5d89d7992e22af3ed92c8686-1920-960.jpg", "published_at": "2019-09-24"}