{"pub": "cbc", "url": "https://cbc.ca/news/canada/toronto/it-s-illegal-for-anyone-under-19-in-ontario-to-buy-vaping-products-so-why-are-so-many-able-to-1.5268085", "downloaded_at": "2019-09-03 23:45:16.915707+00:00", "title": "", "language": "en", "published_at": "2019-09-03", "text": "It came as a shock to Jane Neville when she discovered one of her twin daughters, just 13 at the time, was vaping.\n\nA man was caught coming onto a Toronto middle school's property, illegally selling vape kits to girls. The police got involved and Neville thought that would be the end of it.\n\nBut since then, she has pulled six kits from her daughter, who's now 15.\n\n\"She says she's stopped vaping, but to me that's one problem. The other problem is how did she get this in the beginning? And how does she keep acquiring it?\" Neville, 54, asked from her front porch in the area of the city known as the Beach.\n\nToronto parent Jane Neville, 54, says she's not angry at her teen daughter for vaping, but she wants vape companies to be held to the same standards as big tobacco. (Amanda Grant/CBC)\n\nCBC Toronto spoke with several parents grappling with the fact young people are getting their hands on vapour products — often buying them themselves directly from vape shops or corner stores, despite being under the legal age, which is 19 in Ontario.\n\nIt comes as health officials in the United States are reporting growing numbers of breathing illnesses among teens, or adults who have used an electronic cigarette or some other kind of vaping device.\n\nOne reported death, in the U.S., has been tied to vaping. It involved an adult in Illinois who was vaping before being hospitalized with a \"severe respiratory illness.\"\n\nSo far, there have been no reports of acute lung injury in Canada, though it's a serious concern, says the director of the cardiac intensive-care unit at St. Michael's Hospital in Toronto.\n\n\"That does not mean it hasn't occurred,\" said Dr. Akshay Bagai. \"What it means is people who vape and parents of children who vape should report any mysterious illness to their family doctor or Health Canada.\"\n\nBagai also warns most vaping products contain nicotine, the same chemical that makes cigarettes so addictive, and says nicotine has also been shown to stunt adolescent brain growth.\n\nCanadian research from earlier this year suggested that vaping among Canadian teens skyrocketed 74 per cent in one year, between 2017 and 2018.\n\nThe federal government legalized vaping in May 2018.\n\nMost provinces have regulations for vaping, but Saskatchewan and Alberta do not.\n\nIn June, the Canadian Cancer Society called on the provinces to institute measures aimed at curbing vaping among youth, such as increasing the age to purchase tobacco, vaping products and e-cigarettes to 21; restricting advertising; and moving the sale of flavoured vaping products to adult-only shops.\n\nIn an email to CBC Toronto, Health Canada says it's \"moving as quickly as possible to develop additional vaping product promotion regulations.\"\n\nThe federal department recently wrapped a series of consultations, after proposing a number of new regulations in February.\n\nNo ID? No problem\n\nNeville said her teen recently admitted to buying vapes from a nearby convenience store.\n\nShe reached out to police but was referred to Toronto Public Health, which enforces the Smoke-Free Ontario Act, 2017. Much like selling cigarettes to minors, anyone caught selling vapour products to teens can face a fine.\n\nNeville said her neighbourhood shop was investigated by public health, but ultimately no fines were given.\n\n\"If [teens] were to walk into the LCBO [Liquor Control Board of Ontario] tomorrow, and try and buy a bottle of vodka, they are going to get carded and they are going to get refused. And they can try and try and try, but they'll be refused,\" said Neville. \"These kids are going into the vape shops and they are purchasing from these shops and that's the problem.\n\n\"And it doesn't have to be a vape shop, it can be a gas station.\"\n\nPaul Di Salvo, a public health spokesperson, says that since 2018, 13 convictions have been handed to Toronto retailers for selling vapes to minors.\n\nDurham Region reports one case, and in Peel, there have been just two.\n\nThis vape company has opened a free standing store near King Street West and Spadina Avenue. Underneath its hours of operation, a sign reads, 'Vype products may be harmful to health and contain nicotine which is addictive,' adding the devices are not suitable for 'persons who are not adults.' (Shannon Martin/CBC Toronto)\n\nBut at least one vape shop in Peel has a reputation for selling to young people.\n\nEarlier this summer, a Brampton mom was transferring money into her teen son's bank account when she noticed an $84 charge from a vape shop.\n\n\"The word vape immediately triggers something in your head,\" said Siliva. CBC Toronto has agreed not to publish her last name in order to protect her son.\n\nShe said the youth told her he heard about the shop, and that it sells to young people, from friends at his high school.\n\nHe purchased a small vape kit using his own debit card, and without showing identification, she said. When she and her husband confronted the owner, he agreed to give them $40 back.\n\n\"Kids learn from their own mistakes. We are here to guide them along and we as parents are doing our best to do that, but there are supposed to be regulatory systems in place that prevent our children from being unhealthy or from doing harm to themselves,\" Siliva said.\n\n\"It would be nice to have the confidence that the systems are working the way they are supposed to be — protective of our children.\"\n\nVaping added to elementary school curriculum\n\nFor the first time, Ontario elementary students will learn about vaping as part of the revised health and physical education curriculum.\n\n\"We need to empower kids with the knowledge of the dangers of vaping, not only what vaping can lead to, but all the chemicals that are in vaping products,\" said George Kourtis, the program co-ordinator for health and physical education with the Toronto District School Board.\n\nVaping, like smoking, is not permitted within 20 metres of school property, as part of the Smoke-Free Ontario Act.\n\nThese high schoolers from Oakville, Ont., say there may be rules in school to keep kids from vaping, but many are still doing it and often on school property. (Shannon Martin/CBC Toronto)\n\nBut some Oakville high school students told CBC Toronto that students manage to vape in the hallways and washrooms.\n\n\"It's hard to enforce especially since staff can't go into the bathrooms where things occur. And we don't have cameras in the bathroom,\" said Liza Abraham, 16.\n\nHealth warnings needed now: Toronto cardiologist\n\nDespite originally being marketed as a way for adults to quit smoking, Bagai said there's no data to support that claim.\n\nHe said what's clear is more teen and young adults are getting hooked, with vaping now surpassing cigarette smoking.\n\nDr. Akshay Bagai, the director of the cardiac intensive care unit at St. Michael's Hospital, says nicotine is used in almost all vaping products and that nicotine is highly addictive and can stunt adolescent brain growth. (Oliver Walters/CBC Toronto)\n\n\"Until we know they are entirely safe — which doesn't seem to be the case from what we know so far — there has to be advisory notices on the products and it has to be tightly regulated to not to let the new generation being exposed to them widely.\"", "description": "For the first time, Ontario elementary school students will learn about the dangers of vaping as early as Grade 3 as part of the revised health and physical education curriculum. Parents, meanwhile, are dealing with the fact young people are getting their hands on vapour products despite being under the legal age.", "authors": [], "top_image": "https://i.cbc.ca/1.5178823.1567455920!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/vaping-an-epidemic-among-youth.jpg"}