{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/10/24/lickspittle-lindseys-week-walk-backs", "downloaded_at": "2019-10-24 23:59:48.805906+00:00", "title": "Could Lindsey Graham be any more shameful?", "language": "en", "text": "Trump’s reply? “I am the boss.” He publicly advised Graham to focus on other things — in particular, to go after Trump’s accusers.\n\nTrump loyalists, led by Donald Trump Jr., launched a social media campaign against Graham, demanding he step up his attack on the impeachment process. Trump summoned Graham to lunch at the White House on Thursday to drive home the point.\n\nAD\n\nAnd Lickspittle Lindsey obeyed. First, he said he was “impressed” that Trump is “thinking outside the box” on Syria. He reportedly shelved sanctions legislation. And on Thursday afternoon, he marched into the Senate TV studio to unveil a resolution attacking House Democrats over their impeachment proceedings.\n\nAD\n\n“The attempted impeachment of President Trump is out of bounds,” he inveighed. “Star-chamber-type inquiry … a runaround … off-script … wrong … a rogue action … very dangerous.” He chopped the air. “If we were doing this, you’d be beating the shit out of us!” he shouted to a live television audience.\n\nHe even talks like Trump now.\n\nCould he be any more shameful? Well, he held his news conference in the Capitol on Thursday afternoon at the same time the body of Rep. Elijah Cummings (D-Md.), a leader of the impeachment inquiry until his death last week, lay in state nearby. Cummings was the first African American lawmaker so honored, and impeachment proceedings halted out of respect. Graham didn’t.\n\nAD\n\nThis came two days after Graham, defending Trump, said impeachment “is a lynching in every sense.” Um, because an innocent Trump is being murdered by a racist mob solely because he has orange skin?\n\nAD\n\nOn Wednesday, Graham criticized House Republicans who stormed into a secure room shouting to disrupt impeachment proceedings. He said they were “nuts,” adding: “That’s not the way to do it.” Soon after came his inevitable tweet: “CORRECTION … I understand their frustration and they have good reason to be upset.”\n\nRounding out Graham’s week of walk-backs, Graham had told Axios he might consider impeachment if \"Trump actually was engaging in a quid pro quo.” On Tuesday, Trump-appointed acting ambassador to Ukraine William B. Taylor Jr. detailed such a quid pro quo between Trump and the Ukrainian president trading military aid for political dirt. And Graham? He dismissed it as “hearsay.”\n\nAD\n\nFormer Obama national security adviser Susan Rice called Graham a “piece of [same s-word Graham used]” during a podcast interview this week. Rather than join Graham and Trump in public vulgarity, I prefer to think of Graham as the weakest man in Washington. For years, he imitated McCain’s maverick streak. But he was no maverick. After McCain’s death, Graham found himself a new father-figure.\n\nAD\n\nGraham famously called Trump a “nut job” and a “jackass” during the 2016 campaign. But Graham calculated that avoiding a primary fight required him to become Trump’s golf buddy. Graham told the New York Times’s Mark Leibovich that his courtship of Trump was “to try to be relevant.” Instead, Lindsey O. Graham put the \"O\" in oleaginous.\n\nGraham played down his hawkish line on Iran after a Trump scolding. After the Mueller report came out, Graham used his Judiciary Committee chairmanship to echo Trump’s talking points and to spread falsehoods. Graham bravely promised there would be “holy hell to pay” if Trump fired Jeff Sessions as attorney general. Trump later fired Sessions; Graham defended it.\n\nAD\n\nNow he’s walking back his impeachment views. Twenty years ago, as a Clinton impeachment manager, Graham said a president’s failure to comply with subpoenas was impeachable because it “took the power from Congress.” Now the Trump administration is ignoring subpoenas wholesale — and Graham is attacking the lawmakers who issued them.\n\nAD\n\nIn his Thursday news conference, Graham couldn’t quite bring himself to exonerate Trump: “I don’t want to comment on substance,” he said. “I’m not here to tell you that Donald Trump has done nothing wrong.” He merely raged against procedures, arguing, “The process in the House today, I think, is a danger to the future of the presidency.”\n\nABC News’s Terry Moran reminded him that during Watergate, lawmakers took depositions behind closed doors before there was an impeachment resolution, just as the House is doing now.\n\nAD\n\nGraham did not dispute this.\n\nCNN’s Ted Barrett reminded him that during the Clinton impeachment, House Republicans took private depositions before public hearings. “Why was it okay then and not now?”\n\n“The inquiry itself became very public,” Graham replied.\n\nAnd so will this one — leaving Graham looking foolish once more.\n\nRead more:\n\nAD", "description": "Graham wanted to be \"relevant.\" Now he's just a factotum.", "authors": ["Dana Milbank", "Op-Ed Columnist Covering National Politics"], "top_image": "https://www.washingtonpost.com/resizer/KsyEq4zuGfHhv-GQu_1GJjfgjtY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YVKAH74HWFHQDAMW77YYH7HQVQ.jpg", "published_at": "2019-10-24"}