{"pub": "dailymail", "url": "https://thisismoney.co.uk/money/cars/article-7363319/James-Bond-Goldfinger-Aston-Martin-DB5-sells-auction-6-4-million.html", "downloaded_at": "2019-10-05 08:54:43.985599+00:00", "title": "James Bond Goldfinger Aston Martin DB5 sells at auction for $6.4 million", "language": "en", "text": "The customised classic still has the tyre slashers, machine guns and a bullet-proof shield fitted\n\nAdvertisement\n\nA vintage Aston Martin DB5 equipped with all the James Bond gadgets used in the 1964 classic Goldfinger film has sold at auction for a staggering $6.4million (£5.3million).\n\nThe 1965 model was kitted out with with several of 007's greatest tools, including pop-out machines guns, a bullet-proof shield and and tyre slashers.\n\nThe vehicle - described as 'the most famous car in the world' - went under the hammer earlier today as part of a special Aston Martin event at RM Sotheby's Monterey sale and became the most expensive DB5 ever sold at auction.\n\nThe vehicle went under the hammer earlier today as part of a special Aston Martin event at RM Sotheby's Monterey sale and became the most expensive DB5 ever sold at auction.\n\nThe 1965 Aston Martin DB5 custom made as a replica of the car used in Goldfinger and Thunderball sold at the Monterey RM Sotheby's auction for $6.4 million on Wednesday evening\n\nThe first James Bond Sean Connery stands in front of a DB5 that is believed to have been used in the Goldfinger and Thunderball films, which followed on from the success of Dr No and From Russia With Love\n\nBidders from around the world on Wednesday evening were vying for ownership of some of the jewels in the British sports car brand’s heritage crown - though the film-car DB5 was the highlight of the sale.\n\nAlthough the car was never seen in Bond films, it matches the one that was driven by Sean Connery in the cult movies Goldfinger and Thunderball.\n\nThe vehicle was commissioned by filmmaker Eon Productions and used at promotional events for Thunderball in the United States, the auction house said.\n\nIt includes 13 modifications created for Bond, including a Browning 30-caliber machine gun in each bumper, tyre slashers mounted on its wheel hubs and a bulletproof rear screen that can be raised and lowered from behind the rear windscreen.\n\nThe model, which is now over 50 years old, is complete with several Bond features including a bullet-proof shield covering the back window, and other mechanisms hidden in the tires and chassis of the car\n\nThe model has been described as 'the most famous car in the world', though this one never featured in one of the flicks\n\nThe stunning interior has been given a full refurbishment of the upholstery and dashboard. Included in the auction lot will be a solid prop Mauser C96 pistol (pictured on the seat), and a plastic knife and grenade\n\nThe car even features the revolving number plates famed in the James Bond movies. The car is one of just three surviving original examples commissioned, and fitted with MI6 Q specifications\n\nSotheby's Senior Car Specialist Barney Ruprecht shows a radio telephone concealed in secret door compartment of a James Bond 1965 Aston Martin DB5\n\nNo space for luggage: The DB5's boot is packed with technology, including gas canisters the bullet proof shield which springs up\n\nSpeaking about the sale, Andy Palmer, president and group CEO Aston Martin Lagonda, said: 'The interest among collectors and enthusiasts worldwide underscores the enduring global appeal of this great British sports car company.\n\n'Aston Martin Lagonda has stood tall at the pinnacle of the British automotive world for over a century.\n\n'Recognised today for our excellence in design, engineering, craftmanship and style, we of course would not stand in this position without a rich history of iconic models that have helped shape and define what this brand means today.\n\n'Thanks to RM Sotheby’s, this event has been, without question, a highlight on the Aston Martin heritage calendar in 2019 and I, for one, look forward to seeing many more sales in the future, in partnership with our exceptional heritage division, Aston Martin Works.'\n\nThere are a total of 13 modifications created for Bond by the MI6 weapons-master Q, including a Browning .30 caliber machine guns that fitted behind lightbulbs in each fender\n\nTyre slasher fitted to the wheel hubs extend out to immobilise the vehicle used by Bond's biggest rivals\n\nHundreds of classic car collectors were in the room to bid for the DB5 of Bond fame at the RM Sotheby's sale in Monterey\n\nThe gear stick can be flipped open to reveal the iconic red button for the ejector seat - Bond used it in Goldfinger to eject a would-be assassin from the car\n\nOne of the interior control panels in the original Aston Martin DB5 car, one of just three surviving examples, fitted with James Bond specifications and gadgetry\n\nBarney Ruprecht, car specialist, RM Sotheby’s added: 'It was an honor to offer the iconic James Bond 007 Aston Martin DB5 alongside our partners at Aston Martin and Aston Martin Works. We are beyond thrilled with tonight’s fantastic result and proud to have set a new record for the most valuable DB5 sold at auction.\n\n'Beyond this new auction record, the enormous amount of interest in the car and excitement surrounding it ahead of the auction solidifies its status as the 'most famous car in the world', along with the collector car hobby’s great respect for the Aston Martin brand.'\n\nAhead of its time in 1964, Bond even had an in-dash radar tracking scope which displays a map of the home counties beside a series of knobs and switches\n\nThe car had been showcased at a New York event in July (pictured here) to promote last night's sale\n\nThe DB series of Aston Martins is named after one-time owner David Brown, who bought the company for £30,000 in 1946 after test driving the Atom\n\nDB5 models had an all-aluminium 4.0-litre engine, a new robust ZF five-speed transmission and was capable of 145mph\n\nThe Bond modifications made to the DB5 had been 'properly refurbished to function as originally built,' and has had three private owners over 50 years.\n\nMr Ruprecht had previously said that no other car in history had 'played a more important leading role on film and in pop culture than the Aston Martin DB5'.\n\n'The DB5 is the iconic cornerstone of a marketing relationship that still exists to this day - with the model's collectible status rooted largely in its 007 fame - and we look forward to exciting car and film enthusiasts alike in the lead up to the auction,' he had commented before the sale.\n\n'This is an unbelievably rare chance to play secret agent in a car that offers incredible performance and style in its own right and we're honoured to offer the Bond DB5 alongside our partners at Aston Martin.'\n\nA bullet-proof shield extends from the rear deck of a car to protect Bond from any shots fired from behind\n\nBarney Ruprecht, Car Specialist, RM Sotheby's said that no other car in history had 'played a more important leading role on film and in pop culture than the Aston Martin DB5'\n\nThough probably not advisable to make use of, the front bumper contained hydraulic battering rams which Bond made good use of in the films\n\nMr Ruprecht said someone had taken advantage of 'an unbelievably rare chance to play secret agent in a car that offers incredible performance and style in its own right'", "description": "The vehicle - described as 'the most famous car in the world' - went under the hammer earlier today as part of a special Aston Martin event at RM Sotheby's Monterey sale.", "authors": ["Rob Hull For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/06/13/12/14738200-0-image-a-22_1560424462258.jpg", "published_at": "2019-08-16"}