{"pub": "yahoo", "url": "https://news.yahoo.com/royal-tour-2019-guide-duke-082247876.html", "downloaded_at": "2019-09-26 23:54:35.759807+00:00", "title": "Royal Tour 2019: A guide to the Duke and Duchess of Sussex's South Africa itinerary", "language": "en", "text": "The Duke and Duchess Of Sussex Visit Auwal Mosque during their South Africa tour - WireImage\n\nThe Duke and Duchess of Sussex began their first overseas tour as a family on Monday, taking five-month-old Archie Harrison Mountbatten-Windsor to Africa.\n\nThe ten-day tour sees the Duke, Duchess and baby Archie visit South Africa, in a programme designed to cover their favourite charitable causes and boost Britain’s relationships abroad.\n\nThe Duke will travel alone to Botswana, Angola and Malawi where he will follow in the footsteps of his late mother, Diana, Princess of Wales, with work on clearing land mines and HIV awareness.\n\nA spokesman for the couple said: “The Duke of Sussex’s love for Africa is well known; he first visited the continent at the age of thirteen and more than two decades later, the people, culture, wildlife and resilient communities continue to inspire and motivate him every day.\n\n“As Her Majesty’s Commonwealth Youth Ambassador, The Duke now has a platform to be able to support young people across Africa in reaching their full potential.\n\n“Through her Patronages, The Duchess will be working with organisations to promote women’s education, health, entrepreneurship and leadership.\n\n“The Duchess of Sussex is particularly looking forward to the opportunity to learn from inspirational women in the region.”\n\nThe couple first public moment together on tour: in Toronto, 2017 Credit: Getty More\n\nWhen did Harry and Meghan start their tour?\n\nThe royal couple and baby Archie kicked off their tour on Monday, September 23rd. It runs until Wednesday, October 2nd.\n\nWhere are they travelling to?\n\nSouth Africa, specifically Cape Town and Johannesburg. The Duke will travel alone to Botswana, Malawi and Angola.\n\nWhere are they staying in Africa?\n\nThis remains confidential for security reasons, but will be an official residence arranged by the Foreign and Commonwealth Office\n\nWho will the Duke and Duchess meet on their tour?\n\nKey figures include Archbishop Desmond Tutu, Graça Machel, widow of the late President Mandela, President Lourenço of Angola, President Peter Mutharika of Malawi, and President Cyril Ramaphosa of South Africa. They will also meet influential women in South Africa, likely to include some public figures, and hundreds of members of the public. Evening receptions are expected to include some famous local guests.\n\nWhat will baby Archie get up to?\n\nOfficially? Very little. The published plans do not yet include engagements featuring Master Archie Mountbatten-Windsor, who is five months old. He is expected to make appearances at points, though not upon arrival in South Africa which happened privately. Royal sources have said that the Duke and Duchess hope to include him in their programme, but will make relatively last-minute decisions based on how he is getting on in his unfamiliar surroundings.\n\nHarry and Meghan in Australia, October 2018 Credit: Getty More", "description": "The Duke and Duchess of Sussex began their first overseas tour as a family on Monday, taking five-month-old Archie Harrison Mountbatten-Windsor to Africa.  The ten-day tour sees the Duke, Duchess and baby Archie visit South Africa, in a programme designed to cover their favourite charitable causes and", "authors": ["Hannah Furness"], "top_image": "https://s.yimg.com/uu/api/res/1.2/fU8u1YTjlypt0wP70dCv7g--~B/aD0yNDAwO3c9MjQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_258/27fb207fbb42cb4baa32c3bc410fa217", "published_at": "2019-09-26"}