{"pub": "theverge", "url": "https://theverge.com/circuitbreaker/2019/10/18/20920488/oneplus-8-pro-leaked-render-hole-punch-notch-rumor", "downloaded_at": "2019-10-18 08:51:43.264360+00:00", "title": "OnePlus 8 Pro will swap the pop-up camera for a hole-punch, leak claims", "language": "en", "text": "A new leak says that OnePlus could replace the pop-up selfie camera used by the OnePlus 7 Pro and 7T Pro with a hole-punch notch in the OnePlus 8 Pro. The leak comes courtesy of 91Mobiles, which created the unofficial renders based on information provided by tipster OnLeaks. The images also show a fourth sensor on the back of the next OnePlus flagship — a 3D time-of-flight sensor for depth-sensing.\n\nAlongside the renders, 91Mobiles also notes that the phone will have a 6.65-inch curved 90Hz display, which is ever so slightly smaller than the 6.67-inch display found on the 7T Pro. Aside from the loss of the pop-up selfie camera, the information suggests we won’t see many big changes in the next OnePlus device.\n\nThe OnePlus 8 Pro images arrive in the same month that CashKaro posted renders of what could be its mid-range sibling, the OnePlus 8, also based on information from OnLeaks. The phone appears to lack the 3D ToF sensor found in the Pro, and will reportedly come with a slightly smaller 6.5-inch display.\n\nAlthough we’re still far away from the expected unveiling of these phones (for reference, the OnePlus 7 and 6 were both unveiled in May), OnLeaks’ recent leaks have been accurate. The tipster accurately predicted the iPhone 11’s square camera bump way back in January, and he’s also published accurate information about OnePlus devices ahead of their launches before. The pop-up selfie camera had a good run, but it looks like OnePlus might be ready to move on.", "description": "A new leak has that OnePlus could ditch the pop-up selfie camera it used for the OnePlus 7 Pro and 7T Pro in favor of a hole-punch notch. The renders also suggest that OnePlus could add a 3D ToF sensor to the back of its next flagship.", "authors": ["Jon Porter", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/09-VgqNEFsffDufJqF0EvZ-2E_4=/0x51:2048x1123/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19298306/oneplus_8_pro_5K_render_1.jpg", "published_at": "2019-10-18"}