{"pub": "news24", "url": "https://channel24.co.za/The-Juice/News/tamara-dey-demands-r20-000-a-month-in-child-support-from-yvonne-chaka-chakas-son-reports-20191028", "downloaded_at": "2019-10-29 00:19:37.296206+00:00", "title": "Tamara Dey demands R20 000 a month in child support from Yvonne Chaka Chaka’s son – reports", "language": "en", "text": "Tamara Dey demands R20 000 a month in child support from Yvonne Chaka Chaka’s son – reports share this\n\nCape Town - Tamara Dey and her baby daddy, Yvonne Chaka Chaka’s son Nina Mhinga will be heading to court over child support in January 2020.\n\nAccording to reports by Sunday World, the singer filed papers at the Randburg Magistrate’s court recently.\n\nIn the document she reportedly demands that Mhinga double his current child support for their nearly two-year-old daughter, Lalabella Dey, from R10 000 to R20 000 a month.\n\nREAD MORE: Tamara Dey expecting her first child\n\nShe allegedly claims that this would be the amount that would be sufficient to cater to the child’s monthly expenses.\n\nBut Mhinga, who is based in France is reportedly having none of that and has accused the singer of wanting the extra money for herself in an affidavit where he responds to her papers.\n\nTamara and Ningi welcomed their first child together in 2017. The songstress announced her pregnancy in a stunning Instagram post where she poses while cradling her growing baby bump.\n\nThe singer is not the first celebrity to claim that their child’s expenses amount to R20 000 per month.\n\nEarlier this year, entertainer, Ntando Duma accused her DJ baby daddy, Junior de Rocka of not contributing towards raising their daughter and said she was struggling as her daughter’s monthly expenses also amounted to R20 000.\n\nREAD MORE: Ntando Duma accuses Junior De Rocka of not supporting their daughter\n\nNumerous attempts by DRUM to reach Tamara for comment were unsuccessful at the time of publishing.", "description": "Tamara Dey and her baby daddy, Yvonne Chaka Chaka’s son Nina Mhinga will be heading to court over child support in January 2020.", "authors": ["Mahlohonolo Magadla"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/4201/4aee81108b2e42bf867f56940a5b712a.jpg", "published_at": "2019-10-28"}