{"pub": "bbc", "url": "https://bbc.co.uk/news/world-us-canada-50198123", "downloaded_at": "2019-10-27 12:02:41.636305+00:00", "title": "Abu Bakr al-Baghdadi: US 'conducts operation against IS chief'", "language": "en", "text": "Image copyright AFP Image caption There are unconfirmed reports of a US raid against Islamic State leader Abu Bakr al-Baghdadi\n\nThe US military has conducted an operation against the fugitive leader of the Islamic State (IS) group, US media report.\n\nClaims of a raid against Abu Bakr al-Baghdadi have not been confirmed.\n\nThe White House said US President Donald Trump would make a \"major statement\" on Sunday, but gave no further details.\n\nMr Trump earlier shared a cryptic tweet saying: \"Something very big has just happened!\"\n\nThe IS leader has been wrongly reported dead on several previous occasions.\n\nOfficials quoted anonymously by various media outlets said US forces targeted the militant leader in a raid in Idlib province, in north-west Syria.\n\nThe commander of the Kurdish-led Syrian Democratic Forces (SDF), Mazloum Abdi, said on Sunday that a \"historic, successful operation\" had resulted from \"joint intelligence work\" with the US.\n\nA US official told Reuters news agency an operation took place but was unable to confirm speculation that Baghdadi was killed.\n\nThe White House has neither confirmed that an operation took place, nor its alleged outcome.\n\nMedia playback is unsupported on your device Media caption A video appearing to show the IS group leader was released earlier this year\n\nThe raid was carried out by special operations forces after they received \"actionable intelligence\", Newsweek said, citing unnamed sources.\n\nThe Syrian Observatory for Human Rights, a UK-based monitoring group, said helicopter gunfire had killed nine people near a village in the Syrian province of Idlib, where \"groups linked to the Islamic State group\" were present.\n\nMr Trump is set to make his statement at 13:00 GMT (09:00 local time) on Sunday.\n\nThis is not the first time the fugitive IS leader has been reported killed, but this weekend US officials have been speaking with confidence about a decisive operation to target him.\n\nBaghdadi - his adopted nom de guerre rather than his real name - has been a key jihadist leader in both Iraq and Syria since 2010. Before then, he was incarcerated in the US-run Camp Bucca in southern Iraq, where he formed alliances with other future IS operatives.\n\nAs Syria collapsed into civil war and Iraq's government discriminated against its Sunni minority, Baghdadi galvanised the remnants of al-Qaeda into a fluid fighting force that took over Raqqa in Syria in 2013 and then Iraq's second city of Mosul the following year.\n\nHis brutal and destructive self-proclaimed IS \"caliphate\" lasted five years and attracted thousands of jihadists from around the world. But in March 2019, it lost its last piece of territory at Baghuz in Syria.\n\nIS has since vowed to carry on fighting a \"war of attrition\" against its enemies.\n\nWho is Abu Bakr al-Baghdadi?\n\nThe IS leader has been described as the world's most wanted man.\n\nIn October 2011, the US officially designated him a \"terrorist\" and offered a reward of $10m (£5.8m at the time) for information leading to his capture or death. This was increased to $25m in 2017.\n\nBaghdadi has a reputation as a highly organised and ruthless battlefield tactician.\n\nHe was born near Samarra, north of Baghdad, in 1971, and his real name is Ibrahim Awad al-Badri.\n\nReports suggest he was a cleric in a mosque in the city around the time of the US-led invasion in 2003.\n\nSome believe he was already a militant jihadist during the rule of former Iraqi leader Saddam Hussein. Others suggest he was radicalised during the time he was held at Camp Bucca, a US facility in southern Iraq where many al-Qaeda commanders were detained.\n\nHe emerged in 2010 as the leader of al-Qaeda in Iraq, one of the groups that merged with IS, and rose to prominence during the attempted merger with the al-Nusra Front in Syria.\n\nIS released a video of a man it said was Baghdadi earlier this year. Before this, he had not been seen since 2014, when he proclaimed from Mosul the creation of a \"caliphate\" across parts of Syria and Iraq.", "description": "Reports come as the White House says President Donald Trump will make a \"major statement\" on Sunday.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/1B02/production/_106641960_a20f6b7e-1cd1-4e4c-9b92-bbe82db3f7f1.jpg", "published_at": "2019-10-27"}