{"pub": "yahoo", "url": "https://news.yahoo.com/al-gore-makes-climate-case-080002432.html", "downloaded_at": "2019-10-30 09:16:55.958637+00:00", "title": "Al Gore Makes the Climate Case for Old-Fashioned Farming", "language": "en", "text": "(Bloomberg) -- Al Gore’s 400-acre farm is located in Carthage, a small Tennessee town where the former vice president and senator kicked off his political campaigns. During Gore’s second act as a famous environmentalist, the farm became the site of a training program for aspiring climate activists, and more recently, an experiment in what he said is the world’s most realistic chance at averting climate catastrophe.\n\nTopsoil, the foot or so of ground underneath your feet, is responsible for almost all food production on Earth. But it also stores more than three times as much carbon as forests. Today, agriculture is a net carbon emitter, contributing about 14% of the world’s greenhouse gas emissions. But unlike power generation or automobiles, farming can be turned into a net absorber, pulling carbon out of the atmosphere.\n\nIf farming practices are changed through the use of cover crops, low-tilling and tree-planting, Gore said, agriculture conglomerates and family farmers alike could theoretically make their farms more productive while fighting global warming. Those changes can also replenish nutrients to the world’s soil, of which 33% has already been depleted.\n\nA virtuous circle if there ever was one—and one that’s already attracting attention from farmers, consumers and food companies.\n\nGore, 71, is preaching the benefits of so-called carbon farming, a form of regenerative farming, at a time when U.S. President Donald Trump has been trying to roll back regulations meant to limit greenhouse gas emissions. And while science-based climate policy has been a prominent topic on the Democratic presidential campaign trail, it’s not always seen as a priority.\n\nGore, who these days is more of a denim-wearing advocate than reserved technocrat, remains undeterred. His laboratory has been the farm where his parents once raised livestock and grew tobacco. Earlier this month, he invited 450 soil experts—farmers, scientists, chefs, food experts, entrepreneurs and investors—to join him there to discuss how to scale regenerative farming into something that might actually slow climate change.\n\n“We’ve waited so long to start to address the climate crisis,” Gore told those gathered. “We will need to both reduce emissions drastically and take as much carbon out of the atmosphere as we possibly can.”\n\nUnlike 2006, when Gore’s film “An Inconvenient Truth” was met with skepticism in some quarters, 13 years of intensifying storms, catastrophic floods and unprecedented droughts and wildfires have persuaded more Americans that there’s a very big problem. The goal now, Gore said, is to get people to start taking carbon farming seriously.\n\nWhen it comes to actually tackling what may soon become an existential crisis, the numbers are daunting. Trillions of dollars are needed to adapt civilization to the near-term consequences of climate change while tens of trillions of dollars are needed to slow its advance. But Gore said there are still too few plans to reverse global warming that don’t rely on technology that has yet to be developed.\n\n“Planting trees and sequestering carbon in soil are likely to remain the two most effective approaches,” Gore said in an interview at his Carthage farm. “There’s already some indication that farms that operate this way are more resilient in the face of climate extremes.”\n\nCarbon dioxide levels in the atmosphere are at their highest in 3 million years. Oceans, the biggest carbon sinks of all, are acidifying because they hold too much of it. Plant life, which absorbs CO2 through photosynthesis, can sink carbon into the soil. Regenerative farming helps speed that along—with the added benefit of producing more nutrient-rich soil.\n\nRattan Lal, a professor of soil physics and director of Ohio State University’s Carbon Management and Sequestration Center, is the key scientist behind Gore’s thinking. Lal served on the Intergovernmental Panel on Climate Change (IPCC) when it shared a Nobel Prize with Gore in 2007, and was awarded the Japan Prize this year for his work on soil carbon sequestration.The world’s population currently uses more than a third of the planet’s surface for agriculture, according to the United Nations. In the U.S., close to 40% of land is farmland. Soil used for agriculture has degraded and eroded over centuries of use, losing between 20% and 60% of its original carbon content, according to the IPCC. Lal’s research shows that soil can sequester carbon at rates as high as 2.6 gigatons each year. An aggressive, global combination of tree planting and increased vegetation along with soil carbon sequestration, he said, has the “technical potential” to absorb 157 parts per million of CO2.", "description": "(Bloomberg) -- Al Gore’s 400-acre farm is located in Carthage, a small Tennessee town where the former vice president and senator kicked off his political campaigns. During Gore’s second act as a famous environmentalist, the farm became the site of a training program for aspiring climate activists, and", "authors": ["Emily Chasan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ULEWHFhALKledp9AZx4zCg--~B/aD0yMDY7dz0yODA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/bloomberg_politics_602/b21dd213e3cc8488a0325e82c87729ca", "published_at": "2019-10-30"}