{"pub": "wsj", "url": "https://wsj.com/articles/el-paso-murder-spree-renews-spotlight-on-8chan-online-forum-11564941070?mod=rsswn", "downloaded_at": "2019-09-05 07:06:36.794302+00:00", "title": "El Paso Murder Spree Renews Spotlight on 8chan Online Forum", "language": "en", "text": "The man suspected of killing 20 people and injuring 26 more in a shooting rampage at a Walmart in El Paso, Texas, allegedly posted a hate-filled manifesto on the same fringe online message board used earlier this year by the suspect in the Christchurch, New Zealand, mosque massacre.\n\nThe message board, known as 8chan, was founded in 2013 as a no-holds-barred bastion of unconstrained speech devoted to critiquing what its creator saw as the dominance of left-wing views in culture and politics. It is available on the open internet, though it is often blocked by corporate firewalls and isn’t indexed by Google’s search engine.\n\nAuthorities on Sunday said they were looking into the shooting as a possible case of domestic terrorism.\n\nPressure on 8chan mounted late Sunday after Cloudflare, which provided some of the internet infrastructure for 8chan, said it would withdraw its support for the site. Cloudflare’s technology helps websites protect themselves from the floods of hacker traffic that can knock sites offline in so-called denial of service attacks.\n\nCloudflare has faced criticism for its willingness to support websites promoting any content or mission, including those run by neo-Nazis. Cloudflare has previously said it wasn’t its duty to police content, though in 2017, it made a notable exception by ceasing service to the Daily Stormer, a bulletin board for self-proclaimed white supremacists, after the site began claiming that Cloudflare secretly supported its ideology.\n\nCloudflare Chief Executive Matthew Prince, in a blog post, Sunday said “We just sent notice that we are terminating 8chan as a customer effective at midnight tonight Pacific Time. The rationale is simple: they have proven themselves to be lawless and that lawlessness has caused multiple tragic deaths.”\n\nMr. Prince said Cloudflare’s decision on 8chan is unlikely to keep the site off the internet for long. When Cloudflare removed its support for the Daily Stormer, it soon re-emerged using another service provider. “I have little doubt we’ll see the same happen with 8chan,” he said.\n\nRelated Video In the wake of the El Paso, Texas, mass shooting, web-infrastructure company Cloudflare took down the online message board where the alleged shooter posted his manifesto. So-called deplatforming is a growing strategy to stem the rise of hate speech online, but does it work?\n\nThe creator of 8chan, Fredrick Brennan, who has since distanced himself from the site, welcomed the move. “Thank you so much,” he said of Cloudflare via Twitter . Earlier he tweeted, in response to the killing spree, “Another 8chan shooting?” In that message, he attacked the forum’s owner, Jim Watkins, and called on him to shut the site.\n\nA representative of domain name registrar Tucows, which 8chan uses, said it is up to law-enforcement officials to request when a site should be taken down. Tucows doesn’t make those decisions on its own, the representative said.\n\nSeveral far-right attackers looking to telegraph their intentions to carry out shootings appear to have embraced 8chan as an outlet of choice. In addition to alleged postings from the accused shooters in El Paso and Christchurch, John Earnest, the accused shooter in April’s synagogue shooting in Poway, Calif., announced his plans on 8chan minutes before the attack took place.\n\nThe shootings come at a time when large social-media companies such as Facebook Inc. and Google parent Alphabet Inc. have been trying to moderate online content after fierce criticism contending they haven’t done enough. Some law-enforcement authorities, politicians and others have accused them of failing to adequately control content such as violent live videos, harassment of users and alleged Russian interference in the 2016 U.S. presidential election.\n\nPeople seeking to express extremist views increasingly are migrating to fringe websites, such as 8chan, that place fewer limits on views. The man accused of the October 2018 shooting at a Pittsburgh synagogue that left 11 dead allegedly used another fringe online forum, called Gab.com, to broadcast his intentions. The company later said it had suspended the account.\n\nUnlike YouTube parent Alphabet, Facebook and other big, publicly traded social-media companies, privately owned 8chan intervenes less in what users post and has a reputation for appealing to provocateurs, trolls and others who say they are stifled on more mainstream sites. Users aren’t required to identify themselves by their real names, unlike on a site such as Facebook.\n\nOther sites, such as Discord, a chat service for videogamers with 250 million users, also have become outlets for extremists to communicate. Discord says its rules prohibit harassment, threatening messages and calls to violence, and it has shut down accounts over those issues.\n\nSuch groups could also switch to the Dark Web—an encrypted part of the internet not easily accessed by most people—to voice their views with less risk of being caught. But they generally have preferred to stay in the public part of the internet.\n\nSince the New Zealand and El Paso incidents, 8chan has largely stuck to its policy of minimal intervention in what is posted on the site. “In the interest of free speech, only content that violates the Digital Millennium Copyright Act or other United States laws is deleted,” the site says.\n\nMr. Watkins, 8chan’s owner, didn’t respond to requests for comment.\n\nThe suspected Christchurch mosque shooter, whose rampage left 50 dead in March, chose 8chan as the outlet for announcing his intentions before broadcasting the killing spree live on Facebook. “I have provided links to my writings below,” he allegedly wrote to the readers of the site, adding “please do your part by spreading my message, making memes and shitposting as you usually do.”\n\nAnonymous 8chan users, in response, posted hundreds of messages, digitally altered photographs and videos of the shooting designed to become viral “memes” that quickly spread around the internet.\n\nIt was after the Christchurch shooting that 8chan creator Mr. Brennan, who cut ties with the site last December, told The Wall Street Journal he believed 8chan’s administrators were too slow to remove the shooter’s posts and others on it that incite violence.\n\nMr. Brennan told the Journal in March that 8chan had about 100,000 people regularly using the site and that it had revenue of no more than $100 a month through advertisements and donations.\n\nWrite to Sarah E. Needleman at sarah.needleman@wsj.com", "description": "The suspect in the Walmart rampage in El Paso allegedly posted a hate-filled manifesto on 8chan, the same fringe online message board used this year by the suspect in the New Zealand mosque massacre.", "authors": ["Sarah E. Needleman", "Sarah.Needleman Wsj.Com"], "top_image": "https://images.wsj.net/im-95794/social", "published_at": "2019-08-04"}