{"pub": "nationalreview", "url": "https://nationalreview.com/news/senate-democrats-warn-hillary-not-to-jump-into-2020-race", "downloaded_at": "2019-10-25 16:04:23.341743+00:00", "title": "Senate Democrats Warn Hillary Not to Jump Into 2020 Race", "language": "en", "text": "Hillary Clinton speaks at the IBEW union hall in Commerce, Calif., May 24, 2016. (Lucy Nicholson/Reuters)\n\nIn the wake of reports that Hillary Clinton is considering making a late entry into the 2020 presidential race, Senate Democrats are warning her against it, saying the party has moved on.\n\n“She’s done a great service to our country and public service, and I supported her wholeheartedly, but I believe it’s time for another nominee,” Senate minority whip Dick Durbin said, according to a Politico report.\n\nSenator Martin Heinrich of New Mexico called the move a “mistake.”\n\nSenator Joe Manchin of West Virginia, generally the most conservative Senate Democrat, said, “Absolutely not,” when asked about a possible Clinton 2020 run.\n\nThe senators’ expressions of doubt come after longtime Clinton adviser Philippe Reines said earlier this week that the former secretary of state has not ruled out running in 2020 and would consider doing so if she thought she had the best odds of beating President Trump.\n\n“There might be a reason that she’d be the best person, not only to beat Donald Trump, but to govern after Donald Trump, which is a part we don’t talk about much,” Reines said. “You can make fun of her all you want, but 65 million people voted for her and that’s second more to anyone except Barack Obama.”\n\nEstablishment Democratic donors have also reportedly been musing about what the 2020 race would look like if Clinton jumped in at the eleventh hour.\n\n“It’s hard to know whether the world has passed on or not,” Senator Dianne Feinstein of California wondered. “I’m a friend of hers and I’m extraordinarily fond of her. But that’s a factor.”\n\n“It’s just my instinct that there’s no way she wants to go through this meat grinder again,” Senator Richard Blumenthal of Connecticut remarked.\n\nSenator Doug Jones of Alabama, Senator Mazie Hirono of Hawaii, Senator Tammy Duckworth, and Senator Jon Tester of Montana also expressed doubts about a Clinton run.\n\nClinton even fanned the rumors herself earlier this month when she shot back at a tweet from President Trump prodding her to enter the race with, “Don’t tempt me. Do your job.”\n\nSenator Elizabeth Warren and former vice president Joe Biden currently lead the crowded Democratic primary field of candidates.", "description": "“I supported her wholeheartedly, but I believe it’s time for another nominee,” said Senate Minority Whip Dick Durbin.", "authors": ["Mairead Mcardle", "Ilya Shapiro", "Victor Davis Hanson", "Kevin D. Williamson", "Jack Crowe", "Tobias Hoonhout", "Michael Brendan Dougherty", "Jim Geraghty", "Will Collier", "Jonah Goldberg"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2018/02/hillary-clinton-commerce-california-2016.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-25"}