{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/10/hong-kong-authorities-deny-protester-death-claims-after-police-raid", "downloaded_at": "2019-09-10 07:43:22.627539+00:00", "title": "Hong Kong authorities deny protester death claims after police raid", "language": "en", "text": "Officials say there were no casualties during violent police clearance of subway station\n\nThe Hong Kong government has denied persistent rumours that anti-government protesters may have died during a violent police clearance of a subway station last weekend.\n\nIn the clarification – made in a rare joint conference between three Hong Kong emergency services departments and the city’s subway operator – officials repeated for the sixth time in little over a week that no casualties occurred on 31 August at Prince Edward station.\n\nRumours of possible deaths have endured in Hong Kong after 10 individuals were initially reported as injured at the subway station that night, before the figure was changed to seven.\n\nDespite denials from the government, residents have continued to leave funeral offerings at the entrance to the station.\n\nQuick guide What are the Hong Kong protests about? Show Hide Why are people protesting? The protests were triggered by a controversial bill that would have allowed extraditions to mainland China, where the Communist party controls the courts, but have since evolved into a broader pro-democracy movement. Public anger – fuelled by the aggressive tactics used by the police against demonstrators – has collided with years of frustration over worsening inequality and the cost of living in one of the world's most expensive, densely populated cities. The protest movement was given fresh impetus on 21 July when gangs of men attacked protesters and commuters at a mass transit station – while authorities seemingly did little to intervene. Underlying the movement is a push for full democracy in the city, whose leader is chosen by a committee dominated by a pro-Beijing establishment rather than by direct elections.\n\nProtesters have vowed to keep their movement going until their core demands are met, such as the resignation of the city’s leader, Carrie Lam, an independent inquiry into police tactics, an amnesty for those arrested and a permanent withdrawal of the bill. Lam announced on 4 September that she was withdrawing the bill. Why were people so angry about the extradition bill? Beijing’s influence over Hong Kong has grown in recent years, as activists have been jailed and pro-democracy lawmakers disqualified from running or holding office. Independent booksellers have disappeared from the city, before reappearing in mainland China facing charges. Under the terms of the agreement by which the former British colony was returned to Chinese control in 1997, the semi-autonomous region was meant to maintain a “high degree of autonomy” through an independent judiciary, a free press and an open market economy, a framework known as “one country, two systems”. The extradition bill was seen as an attempt to undermine this and to give Beijing the ability to try pro-democracy activists under the judicial system of the mainland. How have the authorities responded? Beijing has issued increasingly shrill condemnations but has left it to the city's semi-autonomous government to deal with the situation. Meanwhile police have violently clashed directly with protesters, repeatedly firing teargas and rubber bullets. Beijing has ramped up its accusations that foreign countries are “fanning the fire” of unrest in the city. China’s top diplomat Yang Jiechi has ordered the US to “immediately stop interfering in Hong Kong affairs in any form”. Lily Kuo and Verna Yu in Hong Kong\n\nYu Hoi-kwan, the senior superintendent of the police public relations branch, told reporters on Tuesday that rumours of deaths and a possible cover-up were “totally false”.\n\n“Certain people spread such malicious comments to slander the government and stir up grievances in society,” she said.\n\nThe fire services department said the confusion may have come from the fact that first responders initially miscounted the number of injured.\n\nForty-six people were injured at protests that night in particularly tense clashes with police, according to the city’s hospital authority. On 31 August, officers used pepper spray and batons on passengers and suspected protesters inside a subway car.\n\nThe MTR corporation, which operates the subway, took the unusual step on Tuesday of releasing stills from CCTV cameras inside the station.\n\nThe protests have become the worst political crisis faced by Hong Kong since it returned to Chinese sovereignty in 1997.\n\nPersistent rumours reflect the deep mistrust with the Hong Kong administration that has emerged since protests began, with 64% of respondents reporting they did not trust the local government in a recent survey by the Hong Kong Public Opinion Research Institute.\n\nAmong the rumours that have circulated over the past three months among protesters are reports ranging from an imminent Chinese invasion from across the Shenzhen border to allegations that Hong Kong police may have sexually assaulted female protesters.\n\nMany protesters believe that Chinese police officers are already embedded within the Hong Kong force or that they have attempted to act as agent provocateurs at protests.\n\nMistrust extends across the political spectrum. On Monday, executive council member Fanny Law told a Hong Kong radio station that young women had been persuaded to offer sex to frontline protesters, prompting a political backlash.\n\nCarrie Lam, the Hong Kong leader, said Law’s comments were “her personal views”, but advised residents to be “extremely cautious” in their approach to rumours that circulate online.\n\nChina Daily, meanwhile, said on Facebook that Hong Kong protesters were planning a terrorist attack to coincide with the anniversary of 11 September with “indiscriminate attacks” planned for non-native speakers of Cantonese.", "description": "Officials say there were no casualties during violent police clearance of subway station", "authors": ["Erin Hale"], "top_image": "https://i.guim.co.uk/img/media/1b1b9c18e01551d45a5609f7af7a656e64c7f109/0_337_4486_2692/master/4486.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=02e9307d12e8d5ea90b9f06a016d3747", "published_at": "2019-09-10"}