{"pub": "realclearpolitics", "url": "https://insidehook.com/daily_brief/sports/baseballs-slow-play-has-resulted-in-people-knitting-at-games", "downloaded_at": "2019-09-26 23:45:53.464498+00:00", "title": "Baseball’s Slow Play Has Resulted in People Knitting At Games", "language": "en", "text": "Women knitting during the Stitch N' Pitch event sponsored by The National Needlearts Association (TNNA) during the game between the Detroit Tigers and the Seattle Mariners at Comerica Park in Detroit, Michigan on September 9, 2007. The Mariners defeated the Tigers 14-7. (Photo by Mark Cunningham/MLB Photos via Getty Images)\n\nMajor League Baseball has implemented new rules in recent seasons in an attempt to speed up the rate of play, but as a new New York Times story points out, there’s at least one group of fans who remain more than willing to sit through a three-and-a-half-hour game: knitters.\n\nThe average length of an MLB game this season is three hours and 10 minutes, which is two minutes longer than the record set in 2017. That slow pace is appealing to fans who want to take in a game while still keeping their hands busy.\n\n“If anything, it’s a positive for someone who knits,” Libby Butler-Gluck told the Times. “We sit for long periods of time and knit.”\n\nPeople knitting at baseball games isn’t a new phenomenon. Teams have hosted Stitch N’ Pitch events since 2005. But as games drag on longer, more and more fans are feeling compelled to craft while they watch — something they don’t necessarily do while watching other sports.\n\n“I went to a football game, and I brought kitting and I did not touch it,” Rachael McDaniel, the managing editor of The Hardball Times and a knitter, said. “It’s also just that atmosphere of being at a baseball game. It’s very different from being at a hockey arena, or basketball or football, where there’s high energy and everybody is getting riled up all the time…This style of baseball that I have grown attached to and devoted so much time to writing about — it allows me to pursue these other activities.”\n\nNot everyone is supportive of the knitting trend, however. Victoria Pojrazov told the publication she gets comments from older men about her stitching during games. “They’re maybe a little bit defensive of their turf,” she said. “Like, ‘I don’t think this girl knows baseball and isn’t paying attention to it. Look at her knitting.’ Some people think it’s funny.”\n\nSubscribe here for our free daily newsletter.\n\nRead the full story at New York Times", "description": "With this season setting a new record for the average length of a game, Major League Baseball has been attracting a signficant number of knitters.", "authors": ["Bonnie Stiernberg"], "top_image": "https://www.insidehook.com/wp-content/uploads/2019/09/GettyImages-76760540.jpg?fit=1024%2C685", "published_at": "2019-09-26"}