{"pub": "nyt", "url": "https://nytimes.com/2019/10/01/us/politics/democrats-q3-fundraising-numbers.html", "downloaded_at": "2019-10-02 12:46:32.730925+00:00", "published_at": "2019-10-01", "title": "Sanders Posts Biggest Money Haul of Quarter. Will Warren Top Him?", "language": "en", "text": "Mr. Biden’s campaign has said he scored his best week of fund-raising since the second week of the campaign as Democrats initiated an impeachment inquiry of Mr. Trump over a whistle-blower complaint claiming that Mr. Trump prodded the president of Ukraine to investigate the business dealings there of Mr. Biden’s son Hunter Biden.\n\nStill, some Biden supporters are nervous about how the impeachment process, and any added scrutiny of Hunter Biden’s business affairs, will play out. Some have even discussed creating a super PAC, which the campaign quickly disavowed. Others see in Ms. Warren’s rise as a top rival, with Mr. Sanders in third, an opportunity for Mr. Biden to truly consolidate a donor class that has remained fractured.\n\nMr. Biden’s ability to attract small donors will be closely scrutinized. In the last 90 days, his campaign ranked 10th among the Democratic presidential candidates for advertising dollars on Facebook, where campaigns often prospect for new contributors. He spent less than one-quarter of what Mr. Buttigieg had spent on the platform in that time, and well less than half of what Ms. Warren and Mr. Sanders had spent, according to Facebook data.\n\nMr. Biden told donors at a sushi restaurant in Los Angeles last week that he had nearly 670,000 donations overall with an average donation of $46, which would translate to only about $10.8 million this quarter. A Biden campaign official said the former vice president had not presented the “full picture” but declined to elaborate.\n\nA Biden campaign official said Tuesday that the former vice president had “unequivocally’’ raised enough money to be competitive in the primary race, and that details would be released soon.\n\n[Sign up for our politics newsletter and join the conversation around the 2020 presidential race.]\n\nSteve Westly, a bundler for Mr. Biden in California, said that skeptics and critics place too much importance on any one measurement of Mr. Biden’s candidacy.\n\n“Every time someone is a front-runner, they say, ‘Oh my gosh, they’re not ahead in every straw poll, ahead in every state and every fund-raising report,’” Mr. Westly said. “The reality is you want to be in first place, which is where Joe Biden is.”", "description": "In the last three months, Bernie Sanders raised $25.3 million. Pete Buttigieg raised $19.1 million and Kamala Harris $11.6 million, at a time when donations signal viability.", "authors": ["Shane Goldmacher"], "top_image": "https://static01.nyt.com/images/2019/10/01/us/politics/01campfin-01/merlin_161386263_0b0aef9c-730f-4467-b24d-b2415be33de8-facebookJumbo.jpg"}