{"pub": "mirror", "url": "https://mirror.co.uk/travel/news/passengers-hack-changes-plane-seat-20748941", "downloaded_at": "2019-10-29 15:10:37.340973+00:00", "title": "Passenger's hack changes plane seat into bed - but others say it's dangerous", "language": "en", "text": "Get the biggest Weekly Travel stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLong haul flights can leave us all fearing for our sleep pattern when we eventually touch down on the other side.\n\nPaying a little extra for a Sky Couch can turn a row of seats into a bed but that's not always an option and we instead try to make do with a neck pillow and limited leg room.\n\nA photo posted online shows one passenger's hack to turn her standard seat into something resembling a business class bed without the pricey cost.\n\nSitting in an emergency exit seat, the unknown passenger has tied what looks like a sheet to a fixed handle in the cabin to support her feet, allowing her to recline and get some much-needed shut eye.\n\n(Image: Facebook)\n\nSome were quick to praise her ingenuity, with one saying: \"Brilliant! That’s thinking outside of the box.\"\n\nAnother wrote: \"Woman is brilliant and considerate. Her feet aren’t exposed and the hammock can’t rattle around during turbulence. She probably paid the premium to get that front row too.\"\n\nDespite the praise, others were quick to slam her invention for endangering the lives of others after the image was posted on the Passenger Shaming Facebook page.\n\n\"If it wasn’t so rude, intrusive, and dangerous, it’s actually a smart idea. Too bad,\" said one.\n\n\"I might have to break her legs if I need to get out that emergency exit!\" wrote another.\n\nA third commented: \"In front of the exit row door. Endangering hundreds of lives. Genius indeed.\"\n\nIt's not the first time someone has irked fellow plane passengers with their behaviour, after a man was shamed recently for choosing to dry his socks by wedging them in the shutter of the plane window.\n\nThe anonymous traveller was labelled a 'disgusting pig' as people struggled to come to terms with his bizarre decision.", "description": "Some praised the plane passenger's ingenuity for the sleeping hack while others said it was 'endangering hundreds of lives'", "authors": ["Luke Matthews", "Image", "Facebook"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20749384.ece/ALTERNATES/s1200/0_Womans-genius-hack-for-sleeping-on-plane-divides-opinions.jpg", "published_at": "2019-10-29"}