{"pub": "businessinsider", "url": "https://businesstimes.com.sg/consumer/indonesia-restaurant-chain-operator-weighs-us150m-ipo", "downloaded_at": "2019-10-15 08:04:25.406496+00:00", "title": "Indonesia restaurant chain operator weighs US$150m IPO", "language": "en", "text": "[JAKARTA] PT Champ Resto, Indonesian operator of restaurant chains including Gokana Ramen & Teppan, is weighing an initial public offering in the largest nation in Southeast Asia that could raise about US$150 million, according to people with knowledge of the matter.\n\nThe firm, which is backed by Indonesian private equity firm Capsquare Asia Partners, is working with advisers on the planned first-time share sale, said the people, asking not to be named as the information is private. The restaurant operator aims to list as soon as in the first quarter, the people said.\n\nDeliberations are ongoing and there's no certainty that Capsquare and the company will proceed with the planned IPO, said the people. Representatives for Champ Resto and Capsquare didn't immediately respond to requests for comment.\n\nChamp Resto is joining PT Amman Mineral Nusa Tenggara, which owns the second-largest copper and gold mine in Indonesia, and Lion Air in planning listings in Jakarta. Companies have raised a total of US$788 million through IPOs so far this year, down from US$1.2 billion during the same period in 2018, according to data compiled by Bloomberg.\n\nsentifi.com Market voices on:\n\nChamp Resto, founded in 1997 in Bandung, West Java, has grown into one of the biggest restaurant chains in Indonesia, according to its website. Besides Gokana Ramen & Teppan, it also runs restaurant chains under the brand names of Raa Cha Suki & BBQ, Gobic, BMK Baso Malang Karapitan, BMK Baso Mie Kopi, Platinum and Chopstix.\n\nBLOOMBERG", "description": ": THE BUSINESS TIMES Consumer - [JAKARTA] PT Champ Resto, Indonesian operator of restaurant chains including Gokana Ramen & Teppan, is weighing an initial public offering in the largest nation in Southeast Asia that could raise about US$150 million, according to people with knowledge of the matter. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-15"}