{"pub": "cnbc", "url": "https://cnbc.com/2019/10/28/after-new-record-these-are-the-stocks-wall-street-thinks-will-lead-the-next-market-leg-higher.html", "downloaded_at": "2019-10-29 03:58:42.269341+00:00", "title": "After new record, these are the stocks Wall Street thinks will lead the next market leg higher", "language": "en", "text": "The index topped the 3,027.98 level, thanks to Apple , UnitedHealth and J.P. Morgan , the largest point contributors to the new record.\n\nThe S&P 500 hit an all-time high on Monday, but investors are already wondering who's going to lead the next leg of the bull market.\n\nCNBC screened the largest 50 companies in the S&P 500 and found which stocks have the most upside to their consensus 12-month price target set by analysts on Wall Street. In other words, these are the big U.S. stocks analysts believe will be up the most in the next one year.\n\nDespite the recent underperformance of growth stocks, specifically the so-called FANG (Facebook, Amazon, Netflix and Google) stocks, data shows Wall Street is bullish on a recovery in the group. Netflix, Facebook and Amazon are all expected to rally, and with such large market values, these stocks can certainly move the needle on the index.\n\nShares of Jeff Bezos-led Amazon tanked last week when it reported earnings that fell short of Wall Street's expectations, as a return to a heavy investment cycle cut into the e-commerce giant's profitability. However, the stock is only down 1% since the disappointing results. Facebook reports third-quarter earnings after the bell on Wednesday.\n\nSalesforce has remained relatively insulated from the recent pullback in software stocks. Health-care company Merck reports earnings before the bell on Tuesday.\n\nPayPal surged 8% last week after growth in its Venmo business led the company to the strongest earnings results in at least a year.", "description": "The S&P 500 hit an all-time high on Monday, led by these stocks, including Amazon and Facebook.", "authors": ["Maggie Fitzgerald"], "top_image": "https://image.cnbcfm.com/api/v1/image/104864151-1572284532596dis.jpg?v=1572284564", "published_at": "2019-10-28"}