{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/trump-touts-nationalistic-view-of-foreign-affairs-at-un/2019/09/24/e4a8486a-ded2-11e9-8fd3-d943b4ed57e0_story.html", "downloaded_at": "2019-09-24 15:15:32.814026+00:00", "title": "Trump touts nationalistic view of foreign affairs at U.N.", "language": "en", "text": "He argued that a globalist worldview had “exerted a religious pull over past leaders, causing them to ignore their own national interests,” and called on other nations to “embrace its national foundations.”\n\n“The United States does not seek conflict with any other nation,” Trump said. “We desire peace, cooperation, and mutual gain with all. But I will never fail to defend America’s interests.\n\nTrump’s address Tuesday comes while he is under mounting scrutiny over his purported attempts to pressure Ukraine to investigate former vice president Joe Biden and his family — revelations that have ramped up calls for impeachment in Washington.\n\nAs he arrived at the U.N. Tuesday, Trump was engulfed with questions about why he withheld nearly $400 million in military aid for the small eastern European democracy at least a week before a July 25 phone call with Ukrainian President Volodymyr Zelensky, during which Trump allegedly pressured Zelensky to launch a probe into Hunter Biden’s business dealings in Ukraine.\n\nIn his address, Trump took a hard line against Iran, arguing that the governing regime was “squandering the nation’s health” and vowed to “stop Iran’s path toward nuclear weapons.”\n\n“All nations have a duty to act. No responsible government should subsidize Iran’s blood lust,” Trump said. “As long as Iran’s menacing behavior continues, sanctions will not be lifted. They will be tightened. Iran’s leaders will have turned a proud nation into just another precautionary tale of what happens when a ruling class abandons its people and embarks on a crusade for personal power riches.”\n\nSome lines echoed his remarks at campaign rallies — such as his focus on unemployment rates for minority Americans — except they were delivered in a much more subdued tone.\n\nTrump highlighted the United States’ “ambitious campaign to reform international trade” and stressed his desire to complete separate bilateral trade agreements with the United Kingdom and Japan.\n\n“For decades, the international trading system has been easily exploited by nations acting in bad faith,” he said. “As jobs were outsourced, a small handful grew wealthy at the expense of the middle class.”\n\nMost emblematic of America’s fresh approach on trade, Trump said, was with China, with which the United States has been embroiled in an escalating trade war.\n\nChina, Trump said, has “embraced an economic model dependent on massive market barriers, heavy state subsidies, currency manipulation, product dumping … and a theft of intellectual property.”\n\n“I will not accept a bad deal for the American people,” Trump said.\n\nHe also took aim at immigration advocates he said want open borders.\n\n“Your policies are not just,” he said. “You’re policies are cruel and evil.”\n\nTrump also warned that migrants heading to the United States to enter the country illegally should head back.\n\n“If you make it here you will not be allowed in, you will be promptly returned home,” he said.", "description": "Trump’s address Tuesday comes as he comes under mounting scrutiny over his purported attempts to pressure Ukraine to investigate former vice president Joe Biden and his family — revelations that have ramped up calls for impeachment in Washington.", "authors": ["Anne Gearan", "White House Reporter", "Seung Min Kim"], "top_image": "https://www.washingtonpost.com/resizer/itNb1ks02wQDY6YRYteGiRayQE0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UZ2BLSW62YI6TMMZ6Y4L6LBUB4.jpg", "published_at": "2019-09-24"}