{"pub": "reuters", "url": "https://in.reuters.com/article/usa-immigration-courts/insight-hasty-rollout-of-trump-immigration-policy-has-broken-border-courts-idINKCN1VV11W", "downloaded_at": "2019-09-10 23:44:20.261251+00:00", "title": "Insight: Hasty rollout of Trump immigration policy has 'broken' border courts", "language": "en", "text": "(Reuters) - On the day she was set to see a U.S. immigration judge in San Diego last month, Katia took every precaution.\n\nMigrants, many of whom are asylum seekers sent back to Mexico from the U.S. under Migrant Protection Protocols (MPP), line up for a free meal provided by volunteers at a makeshift encampment near the U.S. port of entry at the Gateway International Bridge in Matamoros, Tamaulipas, Mexico, August 24, 2019. REUTERS/Loren Elliott\n\nAfter waiting two months in Mexico to press her case for U.S. asylum, the 20-year-old student from Nicaragua arrived at the border near Tijuana three hours before the critical hearing was scheduled to start at 7:30 a.m.\n\nBut border agents didn’t even escort her into the U.S. port of entry until after 9 a.m., she said, and then she was left stranded there with a group of more than a dozen other migrants who also missed their hearings.\n\n“We kept asking what was going on, but they wouldn’t tell us anything,” said Katia, who asked to be identified by her first name only for fear of jeopardizing her immigration case.\n\nBashir Ghazialam, a lawyer paid for by Katia’s aunt in the United States, convinced the judge to reschedule her case because of the transportation snafu. Later, staff at the lawyer’s office learned that at least two families in the group were ordered deported for not showing up to court.\n\nSince it started in January, the rollout of one of the most dramatic changes to U.S. immigration policy under the Trump administration has been marked by unpredictability and created chaos in immigration courts, according to dozens of interviews with judges and attorneys, former federal officials and migrants.\n\nThe program - known as the “Migrant Protection Protocols” (MPP) - has forced tens of thousands of people to wait in Mexico for U.S. court dates, swamping the dockets and leading to delays and confusion as judges and staff struggle to handle the influx of cases.\n\nIn June, a U.S. immigration official told a group of congressional staffers that the program had “broken the courts,” according to two participants and contemporaneous notes taken by one of them. The official said that the court in El Paso at that point was close to running out of space for paper files, according to the attendees, who requested anonymity because the meeting was confidential.\n\nTheresa Cardinal Brown, a former Department of Homeland Security official under presidents Barack Obama and George W. Bush, said the problems are “symptomatic of a system that’s not coordinating well.”\n\n“It’s a volume problem, it’s a planning problem, it’s a systems problem and it’s an operational problem on the ground,” said Brown, now a director at the Bipartisan Policy Center think tank. “They’re figuring everything out on the fly.”\n\nU.S. Customs and Border Protection (CBP) estimated that 42,000 migrants had been sent to wait in Mexico through early September. That agency and the Executive Office for Immigration Review (EOIR), which runs the nation’s immigration courts, referred questions about the program’s implementation to the Department of Homeland Security (DHS), which did not respond to requests for comment.\n\nHUGE SURGE, FEW COURTS\n\nThe disarray is the result of a surge in migrants, most of them Central Americans, at the U.S. southern border, combined with the need for intricate legal and logistical arrangements for MPP proceedings in a limited number of courts - only in San Diego and El Paso, initially. Rather than being released into the United States to coordinate their own transportation and legal appearances, migrants in MPP must come and go across the border strictly under U.S. custody.\n\nSome migrants have turned up in court only to find that their cases are not the system or that the information on them is wrong, several attorneys told Reuters. Others, like Katia, have received conflicting instructions.\n\nAccording to court documents seen by Reuters, Katia’s notice to appear stated that her hearing was at 7:30 a.m., while another paper she received said she should arrive at the border at 9 a.m., well after her hearing was set to start. She decided to show up at the border before dawn, according to staff in her lawyer’s office. Still, she wasn’t allowed into the border facility until hours later. Ultimately she was never bussed to the San Diego court and was told her case was closed - a fate she was able to avoid only after frantically summoning her lawyer, Ghazialam, to the border.\n\nMost migrants in MPP - including the two families who were deported from her group at the port of entry - do not have lawyers.\n\nIn open court, judges have raised concerns that migrants in Mexico - often with no permanent address - cannot be properly notified of their hearings. On many documents, the address listed is simply the city and state in Mexico to which the migrant has been returned.\n\nLawyers say they fear for the safety of their clients in high-crime border cities.\n\nA Guatemalan father and daughter were being held by kidnappers in Ciudad Juarez at the time of their U.S. hearings in early July but were ordered deported because they didn’t show up to court, according to court documents filed by their lawyer, Bridget Cambria, who said she was able to get their case reopened.\n\nAdding to uncertainty surrounding the program, the legality of MPP is being challenged by migrant advocates. An appellate court ruled in May that the policy could continue during the legal battle, but if it is found ultimately to be unlawful, the fate of the thousands of migrants waiting in Mexico is unclear. A hearing on the merits of the case is set for next month.\n\n‘UNREALISTIC’ NUMBERS\n\nWhen the MPP program was announced on December 20, then-Homeland Security Secretary Kirstjen Nielsen said one of its “anticipated benefits” would be cutting backlogs in immigration courts.\n\nIn the announcement, the agency said sending migrants to wait in Mexico would dissuade “fraudsters” from seeking asylum since they would no longer be released into the United States “where they often disappear” before their hearing dates.\n\nBut the immediate impact has been to further strain the immigration courts.\n\nA Reuters analysis of immigration court data through Aug. 1 found judges hearing MPP cases in El Paso and San Diego were scheduled for an average of 32 cases per day between January and July this year. One judge was booked for 174 cases in one day.\n\n“These numbers are unrealistic, and they are not sustainable on a long-term basis,” said Ashley Tabaddor, head of the national immigration judge’s union.\n\nTo reduce the backlog, DHS estimates the government would need to reassign more than 100 immigration judges from around the country to hear MPP cases via video conferencing systems, according to the attendees of the June meeting with congressional staff.\n\nKathryn Mattingly, a spokeswoman for EOIR, said that the rescheduling was necessary to deal with the substantial volume of recent cases.\n\nAll told, the courts are now struggling with more than 930,000 pending cases of all types, according to EOIR.\n\nAs of August 1, 39% of the backlog in the San Diego court and 44% of the backlog in the El Paso court was due to MPP case loads, Reuters analysis of immigration court data showed.\n\nDespite concerns over the system’s capacity, the government is doubling down on the program.\n\nIn a July 26 notification to Congress, DHS said it would shift $155 million from disaster relief to expand facilities for MPP hearings, and would need $4.8 million more for transportation costs. DHS said that without the funding “MPP court docket backlogs will continue to grow.”\n\nTent courts are set to open this month in Laredo and Brownsville, Texas, and so far more than 4,600 cases have been scheduled there to be heard by 20 judges, according to court data.\n\nIn Laredo, 20 to 27 tent courtrooms will provide video conferencing equipment so judges not based at the border can hear cases remotely, said city spokesman Rafael Benavides.\n\nBrownsville’s mayor Trey Mendez said last month that about 60 such courtrooms were likely to be opened, though he had few details. City manager Noel Bernal told Reuters that communication with the federal government about the plans has been “less than ideal.”\n\n‘DESPERATE PEOPLE’\n\nAt her next hearing in San Diego in mid-September, Katia hopes to tell a judge how her participation in student demonstrations made her a target of government supporters.\n\nMeanwhile, she said, she is living with her parents and 10-year-old brother in a fly-infested apartment with broken plumbing outside Tijuana.\n\nSlideshow (2 Images)\n\nThe whole group is seeking asylum because of their support for the protests, according to Katia, her mother Simona, her lawyers, as well as court documents.\n\nRecently, family members said they witnessed a shootout on their corner and Katia’s brother is now waking up with night terrors.\n\n“They are playing games with the needs of desperate people,” said Simona, 46, who like Katia requested the family’s last names be withheld to avoid harming their case. “It’s soul crushing.”", "description": "On the day she was set to see a U.S. immigration judge in San Diego last month, Katia took every precaution.", "authors": ["Mica Rosenberg", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190910&t=2&i=1428276266&w=1200&r=LYNXNPEF890R2", "published_at": "2019-09-10"}