{"pub": "axios", "url": "https://courier-journal.com/story/news/politics/mitch-mcconnell/2019/10/05/mitch-mcconnell-campaign-ad-says-trump-impeachment-fail/3879571002", "downloaded_at": "2019-10-09 10:45:58.324770+00:00", "title": "In campaign ad, Mitch McConnell says impeachment will fail 'with me as majority leader'", "language": "en", "text": "CLOSE Mitch McConnell says in a new campaign ad that impeachment of President Trump will fail “with me as majority leader.” Louisville Courier Journal\n\nEarlier this week, Senate Majority Leader Mitch McConnell said his chamber would have \"no choice\" but to hold a trial on whether to remove President Donald Trump from office if the House votes to impeach.\n\nBut in a new campaign ad on Facebook, the Kentucky Republican makes clear that any impeachment attempt will fail as long as he remains in charge of the Senate.\n\n\"Nancy Pelosi's in the clutches of a left wing mob. They finally convinced her to impeach the president,\" McConnell says directly to the camera in a 17-second video. \"All of you know your Constitution. The way that impeachment stops is a Senate majority with me as majority leader.\n\n\"But I need your help,\" he adds, standing in front of a picture of an elephant. \"Please contribute before the deadline.\"\n\nThe McConnell campaign, according to Facebook's \"Ad Library,\" started running the digital ad last week, a few days after House Speaker Nancy Pelosi announced an impeachment inquiry over whether Trump improperly pressured Ukraine's president to investigate political rival and possible 2020 opponent Joe Biden.\n\nThe ad features the same video, but McConnell's team has paired the video with different captions that all are mostly focused on the topic of impeachment.\n\n\"Your conservative Senate Majority is the ONLY thing stopping Nancy Pelosi from impeaching President Trump. Donate & help us keep it!\" one caption reads.\n\nOpinion: Trump impeachment inquiry may help Mitch McConnell, but there are risks\n\nMcConnell campaign manager Kevin Golden told The Courier Journal the impeachment inquiry is energizing the Senate leader's supporters.\n\n\"Few issues energize conservative voters like liberal overreach,\" Golden said in a statement. \"And the Democrats latest outrageous attempt to impeach President Trump has activated our base to new heights.\"\n\nAnother caption from Team Mitch goes after Pelosi's fellow California Democrat, Rep. Adam Schiff, who chairs the House Intelligence Committee.\n\n\"BREAKING: Adam Schiff LIED. His office secretly coordinated with the source of this laughable impeachment inquiry,\" the caption reads. \"Help me stop it.\"\n\nThat caption appears to reference the New York Times reporting this week that Schiff received an early account of the whistleblower's complaint regarding Trump's phone call with Ukrainian President Volodymyr Zelensky.\n\nThe complaint from the anonymous whistleblower, reportedly a CIA officer, led to the White House releasing a summary of the July phone call between Trump and Zelensky.\n\nAccording to the call's summary, Trump told Zelensky to reopen an investigation into a Ukrainian energy company connected to Biden's son, Hunter.\n\nMcConnell reportedly told the White House to release the transcript of the phone call, something that McConnell and his spokespeople have not commented on.\n\nOn Thursday, Trump added further fuel to the fire by telling reporters that China should also investigate the Bidens.\n\nThe president also claimed Thursday that McConnell put out a statement referring to the president's phone call with the president of Ukraine as \"the most innocent phone call (transcript) that I’ve read.\"\n\nWatch: Bevin rails on media for Beshear's opinion on Trump impeachment\n\nMcConnell's office has not responded to questions about Trump's assertion, though the Senate leader dismissed criticism of the call last week and said it is “laughable to think this is anywhere close to an impeachable offense.”\n\nOn the Senate floor, McConnell has defended his record of standing up for Ukraine, especially against the Russian government.\n\nDemocrats and some Republican critics of Trump have said the president's requests to Ukraine and China are a blatant attempt to have a foreign power interfere with next year's election.\n\nTrump has denied any wrongdoing.\n\nIt would take a simple majority of the House (218 votes) to submit articles of impeachment to the Senate.\n\nA trial would then be held in the Senate, where it would take at least two-thirds (or 67 votes) of the chamber to convict Trump and remove him from office.\n\nThe chief justice of the Supreme Court presides over the trial. But as majority leader, McConnell would have some power in setting up ground rules for a trial, including timing.\n\n\"So I would have no choice but to take it up,\" McConnell told CNBC on Monday, referring to the impeachment trial. \"How long you're on it is a whole different matter.\"\n\nThe new campaign ad from McConnell shows the Senate leader sees the impeachment matter as a chance to raise funds for his 2020 reelection campaign.\n\nAmy McGrath, a former Marine Corps pilot and one of several Democrats in Kentucky vying to unseat McConnell in 2020, endorsed the impeachment inquiry last week.\n\nMcGrath has also urged McConnell to show \"patriotic courage\" and get to the truth of the allegations in the whistleblower complaint.\n\nMcGrath: McConnell lacks 'patriotic courage' to investigate Trump on Ukraine\n\nThe \"deadline\" mentioned by McConnell in the new video refers to this past Monday, Sept. 30.\n\nThat was the third-quarter cutoff for donations to Senate, House and presidential candidates.\n\nCandidates now have until Oct. 15 to file reports with the Federal Election Commission that reveal their fundraising and spending totals.\n\nAccording to Facebook's Ad Library, McConnell's campaign spent a little over $63,000 on digital ads between Sept. 27 and Oct. 3.\n\nThat represents about 44% of the roughly $143,500 that Facebook data shows Team Mitch spent from May 2018 to Oct. 3, a decent-sized sum in a brief amount of time.\n\nAccording to the most recent FEC data, McConnell had a sizable war chest for his 2020 reelection bid, with nearly $7.9 million in cash on hand.\n\nReach Billy Kobin at bkobin@courierjournal.com or 502-582-7030. Support strong local journalism by subscribing today: courier-journal.com/subscribe.\n\nRead or Share this story: https://www.courier-journal.com/story/news/politics/mitch-mcconnell/2019/10/05/mitch-mcconnell-campaign-ad-says-trump-impeachment-fail/3879571002/", "description": "In a new campaign ad on Facebook, the Kentucky Republican says any Trump impeachment attempt will fail as long as he remains in charge of the Senate.", "authors": ["Billy Kobin", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/04/PLOU/5b0dddf9-f91e-4b7b-8d2a-fb40ade8f035-McConnellUofL--PEARL_02.jpg?crop=3599,2025,x0,y183&width=3200&height=1680&fit=bounds", "published_at": "2019-10-05"}