{"pub": "marketwatch", "url": "https://marketwatch.com/story/the-ecbs-new-stimulus-helps-trumps-bid-against-the-federal-reserve-2019-09-12", "downloaded_at": "2019-09-13 09:16:43.422964+00:00", "title": "The ECB’s new stimulus helps Trump’s bid against the Federal Reserve", "language": "en", "text": "President Trump has called for the Federal Reserve’s “Boneheads” to cut interest rates. Now Trump has more ammunition against the Fed from the new plans of “Super Mario” — European Central Bank President Mario Draghi.\n\nDraghi is known as Super Mario for adopting extremely stimulative monetary policy to pull Europe out of pending fiscal disaster. On Thursday the ECB announced another rate cut and more bond buying, a move that pushed up U.S. stocks.\n\nIn addition, there are rumors of an interim trade deal with China — but with trade deal news, never trust the first reports. Regardless, Trump is determined to run up the stock market. Please see “Trump’s China gambit is working for now — this chart tells the story” and “Trump claims the stock market would be higher if he hadn’t confronted China — is he right?”\n\nLet’s pull this news together with the help of two charts.\n\nCharts\n\nPlease click here for an annotated chart of long bond ETF TLT, -0.66%.\n\nPlease click here for an annotated chart of S&P 500 ETF SPY, +0.35%, which mirrors the S&P 500 Index SPX, +0.29%. For the sake of transparency, this chart was previously published and no changes have been made.\n\nNote the following:\n\n• The first chart shows that bonds traced a parabolic move on recession fears.\n\n• The first chart shows that The Arora Report gave a sell signal on TLT at a time when almost everybody was expecting it to go higher. With the benefit of hindsight, The Arora Report’s signal to short-sell bonds has proven spot-on. At the same time, a signal was given to buy inverse bond ETF TBT, +1.22% for those who could not short-sell. Both trades are now nicely profitable.\n\n• The first chart shows that at a time when bonds were rocketing, the relative strength index (RSI) was showing divergences.\n\n• The second chart shows a megaphone pattern. At the time the chart was first published, many gurus and media were using this chart to proclaim that the stock market was about to fall out of bed. The Arora Report took the opposite position, saying the upside move was possible. That call has turned out to be correct. Please see “A ‘megaphone’ pattern in the stock market sounds scary — but there’s no need for dread.”\n\n• Gold ETF GLD, +0.21%, silver ETF SLV, -0.18% and gold miner ETF GDX, -1.62% are moving higher on the ECB news.\n\n• Note that the stock market is now overbought in the short term. Overbought markets tend to be vulnerable.\n\n• Apple AAPL, -0.23% stock has moved up after the introduction of new iPhones and a lower-than-anticipated price on its streaming service.\n\n• The carnage in cloud stocks, such as CrowdStrike CRWD, +0.80%, Zoom Video Communications ZM, +1.02%, Okta OKTA, -0.20% and Twilio TWLO, +3.08%, has temporarily stopped.\n\n• Short squeezes in laggard retail and energy stocks are showing signs of easing, according to algorithms at The Arora Report. Examples of retails stocks that have experienced short squeezes are Michaels Cos. MIK, -5.13%, J.C. Penney JCP, -11.20%, Signet Jewelers SIG, +1.46%, Rite Aid RAD, -21.28% and Best Buy BBY, +0.03%. Examples of energy stocks that have experienced short squeezes include Comstock Resources CRK, -2.52%, Helmerich & Payne HP, -4.43% and Halliburton HAL, -1.50%.\n\n• Semiconductor stocks such as Intel INTC, +0.42%, AMD AMD, +1.51% and Micron Technology MU, -0.08% not only did not join the cloud stocks on the downside, but they have rallied on hopes of successful trade talks with China.\n\n• Another sign of strength in the stock market is that in spite of government investigations, the stocks of Facebook FB, -0.54%, Google GOOG, +1.15% GOOGL, +1.23% and Amazon AMZN, +1.13% have not reacted to the downside.\n\nAsk Arora: Nigam Arora answers your questions about investing in stocks, ETFs, bonds, gold and silver, oil and currencies. Have a question? Send it to Nigam Arora.\n\nWhat to do now\n\nJust remember that the stock market is overbought and vulnerable, and seasonality is negative. On the other side, progress in trade talks is positive. Further, a breakout to new highs will prompt the momo (momentum) crowd to more aggressively buy stocks; the momo crowd is already buying stocks. Note that the smart money is lightly selling into the strength. Bulls are hopeful that the Fed will cut interest rates. So watch out below if the Fed does not cut interest rates.\n\nUnder these market conditions, investors ought to follow a proven adaptive model with a track record in both bull and bear markets, such as the ZYX Asset Allocation Models. In general the model is cautiously bullish and protecting the portfolio with hedges and a fair amount of cash.\n\nKeep in mind that if the market dips as it often does between September and November, you will not be able to take advantage of opportunities if you are not holding enough cash.\n\nDisclosure: Subscribers to The Arora Report may have positions in the securities mentioned in this article or may take positions at any time. Nigam Arora is an investor, engineer and nuclear physicist by background who has founded two Inc. 500 fastest-growing companies. He is the founder of The Arora Report, which publishes four newsletters. Nigam can be reached at Nigam@TheAroraReport.com.", "description": "As the European Central Bank adds more stimulus, the pressure is on the Federal Reserve to do the same.", "authors": ["Nigam Arora"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HM194_trump__ZG_20190626091212.jpg", "published_at": "2019-09-12"}