{"pub": "bbc", "url": "https://bbc.com/news/business-49808379", "downloaded_at": "2019-10-18 01:05:59.316129+00:00", "title": "Ghost nets: Tackling a silent killer of the seas", "language": "en", "text": "Image copyright Giannis Athinaios Image caption Jannis Athinaios has been fishing off the coast of Greece for over three decades\n\nJannis Athinaios is preparing to sell his merchandise, an assortment of fresh red mullets, red snappers, white sea bream and blunt-snouted mullets, at the sun-washed port of Nea Makri, a coastal town 25km northeast of Athens.\n\nFor 31 years he has been fishing in the South Euboean Gulf, mainly at night, heading to Nea Makri's port at noon to sell his catch, either to local restaurants or his many loyal clients.\n\n\"I use small nets,\" Mr Athinaios says. \"Occasionally, I lose some of them, but nothing special - about 10m (32ft) per year, which costs me about €20,\" he says.\n\nBut imagine those lost nets scaled-up to the size of the giant nets used by ocean going trawlers.\n\n\"These big boats use nets over 45m in height and 800m in length, which may cost five to six thousand euros or much more,\" says Mr Athinaios.\n\nMore Technology of Business\n\nWhen those nets get lost at sea, they become ghost nets, an expense for fishermen and deadly for marine life.\n\nIt's hard to measure the scale of the problem, but in 2009 the UN Food and Agriculture Organisation estimated that 640,000 tonnes of fishing gear was lost or discarded in the seas over year.\n\nIn 2015 a single mission by WWF in the Baltic recovered 268 tonnes of nets, ropes and other material.\n\nAnd because nets are made of nylon, or other tough synthetic compounds, they can survive in the oceans for decades, catching, injuring and killing all sorts of marine life.\n\nThe ghost nets also damage coral, breaking their brittle skeletons, destroying their soft tissue, and killing large chunks of the reef.\n\nImage copyright Giannis Athinaios Image caption Tough modern nets can survive for decades in the ocean\n\nTo help tackle the problem British, Portuguese, and Spanish organisations and universities, and figures from the European fishing industry, are co-operating on a project called NetTag.\n\nIt aims to promote new technologies that cut down on the number of lost nets, and to educate fishermen about new practices to limit losses.\n\nIts key technology is a special underwater acoustic transponder - the NetTag - that fishermen can attach to their nets and other gear.\n\nNetTag's transponders work using sound waves, which travel efficiently over long distances under water.\n\nWhen the surface vessel sends out a signal the transponder replies and by calculating the time difference between the signal and response the net can be located.\n\n\"For an estimated cost of about €300 each, NetTag can help fishermen safeguard assets costing thousands of euros,\" says Jeff Neasham, an electrical engineer at Newcastle University and lead researcher of the project.\n\nImage copyright Newcastle University Image caption NetTag transponders can be attached to fishing nets\n\nDr Neasham helped design the transponders, which are about the size of a matchbox.\n\nThey have similar batteries to smartphones, but use circuitry which requires very low power, which means they can operate for many months attached to a net.\n\n\"These transponders definitely work. The technology is practical,\" says Brian von Herzen, an environmentalist and executive director of the Climate Foundation, a non-profit organisation tackling food security.\n\nHowever, he is not certain that the NetTag will be attractive to the operators of big fishing boats, who might not want to waste time retrieving lost nets.\n\nMr von Herzen says that even if the new transponder allows fish boats to locate lost nets, they still might spend half a day recovering the equipment. That time could be more valuable than the price of the net.\n\nMr Athinaios finds NetTag environmentally very promising, but is also sceptical whether it will modify his fellow professionals' behaviour.\n\nSince 2009 a European Community Council Regulation has required fishing boats to recover any lost fishing gear as soon as possible - carrying equipment on board for this purpose - or else potentially face harsh fines, and ultimately confiscation of the vessel or fishing gear.\n\n\"Yet, nothing has changed,\" says Mr Athinaios.\n\n\"The law is not enforced. Most of us have equipment like GPS and plotters. Big boats have advanced equipment and crews of divers to track lost gear down, but they don't do it because they can make €6,000, the cost say, of a lost net on any given day.\"\n\nImage copyright Jeff Neasham Image caption Jeff Neasham is convinced the transponders can save fishermen time and money\n\nDr Neasham says that if fishermen have the precise coordinates to retrieve a net via GPS, then they are not really searching for a ghost net.\n\n\"We are talking about situations where gear has been moved by storms, broken away from moorings, or caught by other vessels and cut loose,\" Dr Neasham says.\n\n\"The skipper of our research boat has been involved in many attempts to retrieve lost gear and, even when they are confident they know where a ghost net is, the net can prove to be several hundred metres off where they finally manage to hook it.\"\n\nHe is convinced that NetTag will save lots of time and money.\n\nMr von Herzen thinks the solution is to reward fishermen for retrieving ghost nets.\n\nIn regions like Europe where the fisherman's catch is capped, he suggests that for each net recovered that cap could be raised.\n\n\"In this case, these low-cost transponders would come in handy,\" Mr von Herzen says.\n\nImage copyright Giannis Athinaios Image caption Transponders might encourage fisherman to recover nets\n\n\"We should propose these revised regulations, and have a period of public comment, in which we would have town meetings and discussions - instead of lectures - with the fishermen,\" he adds.\n\nHe thinks it could also change the culture of fishing. \"They would view themselves as stewards of the ocean,\" suggests Mr von Herzen.\n\nOver the next months, the NetTag project will conduct full field trials with fishermen in Portugal and Spain, who will be the first to try out the technology before it hits the markets.\n\nDr Neasham is confident the endeavour will do away with the \"epidemic\" of ghost nets.\n\n\"We should be expecting 90% of lost fishing gear to be recovered in the developed world over the next 10 years if the project becomes mainstream.\"", "description": "Ghost nets kill huge numbers of marine animals every year, but new tech might help prevent that.", "authors": ["Stav Dimitropoulos", "Technology Of Business Reporter"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/4BF2/production/_108924491_jannis.back.boat.jpg", "published_at": "2019-10-17"}