{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/2019/10/14/parents-british-teen-killed-crash-will-only-meet-us-diplomats-wife-if-she-returns-britain", "downloaded_at": "2019-10-14 11:47:04.596897+00:00", "title": "Parents of British teen killed in crash will only meet U.S. diplomat’s wife if she returns to Britain", "language": "en", "text": "“Our line in the sand is this issue of her coming back and returning to the U.K. and going through the legal system. That is not up for discussion or negotiation. That is our red line in the sand,” Dunn family spokesman Radd Seiger told Sky News.\n\nAD\n\n“Mrs. Sacoolas has to commit to returning to the United Kingdom to submit herself to the English authorities, to Northamptonshire Police, and to cooperate with their inquiries,” he later told the BBC.\n\nAD\n\nDunn’s devastated parents Charlotte Charles and Tim Dunn flew to the United States over the weekend in a bid to drum up more U.S. coverage of the case and to put more pressure on President Trump to intervene and help them obtain justice for their son.\n\nIn remarks last week, Trump called the incident a “terrible accident” and said driving on the wrong side of the road “happens.” At the news conference, Trump was photographed holding “secret” briefing notes that stated Sacoolas would not return to Britain.\n\nAD\n\nHarry’s parents had previously expressed hope that Trump would consider waiving diplomatic immunity so that Sacoolas can be held accountable in the British legal system. The U.S. Embassy noted in a statement that “immunity is rarely waived.”\n\nOver the weekend it emerged that Sacoolas no longer has diplomatic immunity because she is not on British soil anymore. According to British media reports, a letter to the Dunn family from Foreign Secretary Dominic Raab read: “The U.K. government’s position is that immunity, and therefore any question of waiver, is no longer relevant in Mrs. Sacoolas’ case, because she has returned home.”\n\nAD\n\n“The U.S. have now informed us that they too consider that immunity is no longer pertinent,” the letter continues.\n\nAD\n\nSacoolas’s lawyer says the suspect is “devastated by the tragic accident” which took place near the Royal Air Force Croughton station, which is operated by the U.S. Air Force, and would like to meet with Harry’s parents to offer an apology.\n\nReacting to the prospect of an apology from Sacoolas almost seven weeks after the fatal collision, Harry’s mother told Sky News: “Sorry just doesn’t cut it. It’s not really quite enough. I’m still very open to meeting her,” she said, adding: “I can’t promise what I would or wouldn’t say, but I certainly wouldn’t be aggressive.”\n\nBritish Prime Minister Boris Johnson said last week that he hoped Sacoolas would return to Britain and “engage properly with the processes of law.”\n\nHarry’s death has sparked widespread outrage in Britain. In recent weeks there has been fierce debate over the concept of diplomatic immunity, who it should apply to and what it should cover.\n\nAD", "description": "Anne Sacoolas left the country under diplomatic immunity and did not have to face the British justice system.", "authors": ["Jennifer Hassan", "Social Media Editor For The Foreign Desk"], "top_image": "https://www.washingtonpost.com/resizer/M5cLGJ1yTJBZ9ewNeNsKlfgj1SQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HBE6N5XLN4I6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-14"}