{"pub": "yahoo", "url": "https://news.yahoo.com/lebanon-hezbollah-says-government-must-092346789.html", "downloaded_at": "2019-10-20 17:14:55.499979+00:00", "title": "Lebanon Heads for Showdown as Reform Vows Fail to Quell Protests", "language": "en", "text": "(Bloomberg) -- Lebanese officials were scrambling to finalize a plan to avert a financial meltdown as tens of thousands of protesters took to the streets nationwide for a fourth straight day, demanding the ouster of a political class they blame for rampant corruption and worsening living standards.\n\nPrime Minister Saad Hariri held talks with some of his coalition partners on Sunday, two days after he gave them 72 hours to back reforms to rebuild confidence. The plan envisages contributions from banks to help lower public debt servicing without raising taxes on citizens, Finance Minister Ali Hasan Khalil said.\n\nThe proposals also include imposing a “wealth tax” while leaving wages intact, Industry Minister Wael Abou Faour said.\n\nBut those pledges have done little to end protests that broke out Thursday over a decision, later rescinded, to tax WhatsApp calls. Drone footage showed a sea of people marching through the upscale streets of downtown Beirut near Hariri’s headquarters.\n\n“What they’re offering now is too little too late,” said Sami Nader, head of the Beirut-based Levant Institute.\n\nInequality, Unemployment\n\nThe cause of Lebanon’s protests bears a striking resemblance to upheavals sweeping the region from Algeria to Iraq: rising inequality, growing unemployment and accusations that the elite have lined their pocket at the expense of the nation.\n\nBut Lebanon’s sectarian politics and the influence of regional rivals such as Saudi Arabia and Iran, along with one of the world’s highest debt burdens, have made it harder for analysts to predict an easy way out.\n\nGulf powers led by Saudi Arabia, dismayed at the unchecked influence of Iran-backed Hezbollah, have largely ignored Hariri’s pleas for aid. Hezbollah, a militant group with representatives in cabinet and parliament, has resisted calls to loosen its grip on power.\n\nThe result was captured by one protester who spoke on local television to thank the ruling elite for uniting all sects “to demand their resignation. Leave!”\n\nAgainst this backdrop, banks said they’ll stay shuttered on Monday to repair damage from previous demonstrations in the hope that the government can take steps to restore stability.\n\nFour ministers from a major Christian party, the Lebanese Forces, stood down late Saturday, saying they had no faith in the government’s ability to deliver.\n\nHezbollah and its allies, primarily the Free Patriotic Movement led by Foreign Minister Gebran Bassil, want to preserve the government, warning that the alternative would only lead to chaos. The Hezbollah coalition holds a majority in parliament and the cabinet.\n\nObservers doubt that the planned road map would ease tension on the streets given the magnitude of the demonstrations that have spread to regions known for their loyalty to political leaders such as the parliamentary speaker, Nabih Berri, and Hezbollah’s chief Hasan Nasrallah.\n\nProtesters have filled up the streets of the capital, insisting their demonstration is peaceful and nonsectarian and would continue until the fall of the government. Fistfights erupted in the southern town of Tyre and Aley in Mount Lebanon Saturday, where protesters clashed with supporters of Berri and Druze leader Walid Jumblatt.\n\nBerri, who has been house speaker for nearly 28 years, is the head of one of the largest Shiite parties in the country and is a longtime ally of Hezbollah. Some protesters say armed men tried to dispel protests in Tyre, with Berri’s party vowing to investigate the incident.\n\n“I love Berri but we want to eat. We are hungry. We are poor,” one protester said.\n\nTo contact the reporter on this story: Dana Khraiche in Beirut at dkhraiche@bloomberg.net\n\nTo contact the editors responsible for this story: Lin Noueihed at lnoueihed@bloomberg.net, Alaa Shahine, Paul Abelsky\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Lebanese officials were scrambling to finalize a plan to avert a financial meltdown as tens of thousands of protesters took to the streets nationwide for a fourth straight day, demanding the ouster of a political class they blame for rampant corruption and worsening living standards.Prime", "authors": ["Dana Khraiche"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-20"}