{"pub": "marketwatch", "url": "https://marketwatch.com/story/facebook-discloses-record-lobbying-spending-as-zuckerberg-braces-for-house-hearing-2019-10-22", "downloaded_at": "2019-10-22 16:04:59.614972+00:00", "title": "Facebook discloses record lobbying spending as Zuckerberg braces for House hearing", "language": "en", "text": "Facebook Inc. disclosed late Monday that it spent $4.8 million to influence U.S. lawmakers and regulators in the third quarter, lifting its year-to-date spending on Washington lobbying to $12.3 million — a level that already nearly matches 2018’s full-year total of $12.6 million.\n\nThe social media giant’s third-quarter and year-to-date outlays have topped the lobbying spending by the other so-called FAANG companies, and its most recent disclosure comes as CEO Mark Zuckerberg is due to get questioned on Wednesday by the House Financial Services Committee.\n\nFacebook’s FB, -2.97% filing for the past quarter shows it lobbied on a wide range of issues, including blockchain policy, election integrity, data security, internet competition, high-tech worker visas, privacy legislation, the U.S.-Mexico-Canada Agreement and bullying prevention. The Silicon Valley company in recent months has faced scrutiny in particular over Libra, its blockchain-based cryptocurrency, and Zuckerberg is expected to get asked about Libra on Wednesday, as the House committee’s hearing is slated to focus on Facebook’s impact on financial services and the housing sector.\n\nRelated: Zuckerberg unveils Facebook’s new security measures to combat 2020 election interference\n\n“We see the Libra project compounding political pressure on the company, amplifying privacy and antitrust concerns and enabling more opposition,” said Robert Kaminski, a Capital Alpha Partners analyst, in a note. “We expect questions on Visa V, -1.12% , Mastercard MA, -1.98% and PayPal’s PYPL, -2.03% decision to withdraw from the project, lending credibility to lawmakers skeptical of the project’s viability and ulterior motivations.”\n\nRead more: Facebook’s Libra battered by defections, pushback\n\nOpinion: Facebook’s Libra unravels, and for good reason\n\nAmazon.com Inc. AMZN, -0.72% wasn’t far behind Facebook with $4 million in lobbying spending in this year’s third quarter, according to its disclosure from late Monday. Both companies are staying on track to set new annual records in their outlays to influence Washington, as shown in the chart below.\n\nMeanwhile, Alphabet Inc.’s GOOG, -0.28% GOOGL, -0.26% Google business — which has been reducing its outlays this year and reorganizing its lobbying effort amid growing scrutiny — disclosed spending $2.8 million from July 1 through Sept. 30. Apple Inc. AAPL, +0.26% said it shelled out $1.8 million, and Netflix Inc. NFLX, -3.43% said it spent a relatively modest $200,000.\n\nThe lobbying comes as Big Tech deals with antitrust probes, and as some politicians say the Silicon Valley titans should get broken up. In the wake of Facebook’s Cambridge Analytica data harvesting scandal and other foul-ups, the companies are also facing greater scrutiny over how they handle their users’ data as well as how they manage misinformation and political bias. Lawmakers have talked up the potential for a bipartisan law that would lead to better safeguards for personal data, though analysts say it’s unlikely because of a partisan split over the potential for federal preemption of states’ laws.\n\nCapital Alpha analysts “have been less worried about antitrust risk in the near-to-medium term,” Kaminski said. “In our view, the early federal ‘investigation’ headlines and investor reaction overstate the imminence and impact. We don’t believe the government knows what they’re looking for, what the problem is, nor what the solution would be.”\n\nRelated: 4 reasons why antitrust actions probably will fail to break up Big Tech\n\nOpinion: The Big Tech antitrust investigation may be a political game, but that doesn’t mean it will end quickly\n\nFacebook’s third-quarter lobbying spending of $4.8 million comes after the company shelled out $4.1 million in the second quarter, and the outlay easily tops the company’s spending of $2.82 million in 2018’s third quarter.\n\nFacebook’s stock has gained 43% this year, Amazon has advanced 18%, and Apple is up 53%. Netflix has tacked on less than 1%, while Google is higher by 20%. The S&P 500 SPX, +0.08% has added 20%.", "description": "Facebook Inc. disclosed late Monday that it spent $4.8 million to influence U.S. lawmakers and regulators in the third quarter, lifting its year-to-date...", "authors": ["Victor Reklaitis", "Money", "Politics Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT792_zucker_ZG_20191022115259.jpg", "published_at": "2019-10-22"}