{"pub": "cnn", "url": "https://cnn.com/2019/10/30/tech/facebook-fake-trump-page/index.html", "downloaded_at": "2019-10-30 23:52:04.914340+00:00", "title": "Facebook let a fake page posing as the Trump campaign run political ads", "language": "en", "text": "New York (CNN Business) Even as its executives were out fiercely defending its policies on political ads this month, Facebook (FB) was allowing an obviously fake page that purported to be linked to President Trump's reelection campaign to run ads on its platform. The ads directed users to an online donation portal that claimed to be a way to donate to the Trump campaign.\n\nThe Trump campaign told CNN on Wednesday that the page, called \"DonaldTrumpCampaign,\" was not affiliated with the real campaign and called it a \"scam.\" After CNN contacted Facebook for comment, the company removed the page, saying it broke the platform's rules on impersonation. The page's permissions to run political ads had been \"mistakenly applied,\" Facebook said.\n\nThe discovery raises new questions about how Facebook is policing the political ads it allows to run and if it is doing enough to stop bad actors from taking advantage of the platform. A covert Russian troll group targeted ads at American voters ahead of the 2016 U.S. presidential election.\n\nThe fake page which Facebook removed after CNN contacted the company\n\nThe ads run by the page parroted Trump talking points and attacks on the media, along with calls to \"drain the swamp.\" The ads linked to a website that was designed to look like it belonged to the Trump campaign and included a donation page.\n\nFacebook has added steps designed to vet people who run political ads on their platform and to ensure they are in the country where they are advertising. In the US, these steps include providing Facebook with a copy of a government-issued identification and a US address.\n\nRead More", "description": "Even as its executives were out fiercely defending its policies on political ads this month, Facebook was allowing an obviously fake page that purported to be linked to President Trump's reelection campaign to run ads on its platform. The ads directed users to an online donation portal that claimed to be a way to donate to the Trump campaign.", "authors": ["Donie O'Sullivan", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191030192256-zuckerberg-testifying-restricted-super-tease.jpg", "published_at": "2019-10-30"}