{"pub": "news24", "url": "https://businessinsider.co.za/wwe-going-ahead-with-saudi-arabia-show-despite-khashoggi-killing-2018-10", "downloaded_at": "2019-10-05 11:02:58.303417+00:00", "title": "WWE is going ahead with its Saudi Arabia show despite calling out the 'heinous crime' of Khashoggi's killing", "language": "en", "text": "WWE is taking its show to Riyadh in Saudi Arabia, it has confirmed.\n\nThe event follows the death of Saudi journalist Jamal Khashoggi.\n\nWWE called the killing a \"heinous crime\" but has decided to proceed with its \"Crown Jewel\" show on November 2 regardless.\n\nFor WWE, the show must go on - and the company has confirmed that it is taking its show to Saudi Arabia.\n\nThe event comes at a sensitive time as it follows the death of Saudi journalist Jamal Khashoggi, who was killed in the Saudi Consulate in Istanbul in early October.\n\nKhashoggi, often critical of the Saudi government and Crown Prince Mohammed bin Salman, wrote opinion pieces for The Washington Post. He entered the Saudi Consulate in Istanbul on October 2 and was killed inside.\n\nSaudi Arabia has said that rogue agents carried out the killing without permission from the country's rulers, though experts have doubted that account.\n\nWWE said that a \"heinous crime\" took place at the consulate, but has decided to proceed with its \"Crown Jewel\" show in Riyadh on November 2.\n\n\"WWE has operated in the Middle East for nearly 20 years and has developed a sizable and dedicated fan base,\" a statement on the company's website read.\n\n\"Considering the heinous crime committed at the Saudi consulate in Istanbul, the company faced a very difficult decision as it relates to its event scheduled for November 2 in Riyadh.\n\n\"Similar to other US-based companies who plan to continue operations in Saudi Arabia, the company has decided to uphold its contractual obligations to the General Sports Authority and stage the event.\"\n\nSome of the WWE's biggest stars, including John Cena, are reportedly unwilling to work at the Saudi show, according to widespread rumours reported by Dave Meltzer on the Wrestling Observer Radio and by Bleacher Report.\n\nIt remains to be seen which athletes will take part in the event.\n\nReceive a single WhatsApp every morning with all our latest news: click here.\n\nAlso from Business Insider South Africa", "description": "Pominent professional wrestling firm WWE has an event planned in Saudi Arabia on Sunday, and despite the death of Jamal Khashoggi, this show must go on.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8113/ded1bfe6c87e46be82145bfca203acf4.jpg", "published_at": "2018-10-27"}