{"pub": "indiatimes", "url": "https://indiatimes.com/entertainment/celebs/wedding-or-not-we-are-genuinely-rooting-for-ranbir-kapoor-and-alia-bhatt-s-alliance-378496.html", "downloaded_at": "2019-10-24 06:57:39.934069+00:00", "title": "Wedding Or Not, We Are Genuinely Rooting For Ranbir Kapoor And Alia Bhatt's Alliance!", "language": "en", "text": "Wedding Or Not, We Are Genuinely Rooting For Ranbir Kapoor And Alia Bhatt's Alliance!\n\nWedding Or Not, We Are Genuinely Rooting For Ranbir Kapoor And Alia Bhatt's Alliance!\n\nAmidst rumored wedding dates, invites and other reports around their wedding, Ranbir Kapoor and Alia Bhatt were spotted chilling in London.\n\nA fake wedding card of B-Town lovebirds Alia Bhatt and Ranbir Kapoor was circulating on social media, unleashing fan frenzy over a possible wedding in Bollywood. Look closely at the card and you'll realise it was probably created by a fan. It is full of typos and incorrect information. The card reads,\n\n\"Mrs Neetu and Mr Rishi Kapoor cordially invite you for the Sagan ceremony of their son Ranbir with Aliya (D/0 Mrs Soni and Mr Mukesh Bhatt) on Wednesday, 22th January 2020, 5.00 pm onwards. Venue: Umaid Bhawan Palace, Jodhpur\".\n\nTwitterati started making fun of the card no sooner after it was uploaded. A user wrote: \"This wedding card circulating online is *FAKE* @aliaa08''s name is not spelt as ''Aliya'' n neither is her father''s name Mukesh Bhatt, that''s her uncle. She is @MaheshNBhatt''s daughter. Pls don''t believe in this n stop circulating this picture.\"\n\nDon't Miss 536 SHARES 154 SHARES 42.4 K SHARES\n\nAnother user commented: \"It sucks when you''re about to have a multi million dollar wedding but can''t fix the typos in your wedding card. It''s the 22nd not 22th.\"\n\nWell, if you're as confused as we are, here's everything we know about the wedding! Read on.\n\n1. According to all the existing reports, Ranbir and Alia are planning to tie the knot in France. The caterers for the wedding have already been booked.\n\n2. Reports claim that Ranbir had a few confidential meetings with Sabyasachi and Alia Bhatt also was seen jetting off to an undisclosed foreign trip.\n\n3. The tentative dates for the wedding are 8th, 9th, and 10th of November, 2019 and Chef Ritu Dalmia, who also curated Virushka’s extravagant Italian wedding, has been approached for the catering.\n\nMeanwhile, Alia Bhatt has denied rumours that she is tying the knot on January 22.\n\nQuizzed by the paparazzi at Mumbai airport, she stopped and smiled, and added: \"What do I say?!\" After a pause, she said: \"No\". On the work front, Ranbir and Alia will be seen together in Ayan Mukerji''s \"Brahmastra\", which is expected to release next year. The film also stars Amitabh Bachchan.", "description": "Amidst rumored wedding dates, wedding invites and other reports around their wedding, Ranbir Kapoor and Alia Bhatt were spotted chilling in London. A fake wedding card of B-Town lovebirds Alia Bhatt and Ranbir Kapoor was circulating on social media, unleashing fan frenzy over a power possible wedding in Bollywood.", "authors": ["Isha Sharma"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/ranbir_and_alia_1571896648_800x420.jpg", "published_at": "2019-10-24"}