{"pub": "businessinsider", "url": "https://businessinsider.com/us-holiday-sales-set-to-bounce-back-2019-10", "downloaded_at": "2019-10-10 15:15:38.846356+00:00", "title": "US retail sales could exceed $730 billion this holiday season", "language": "en", "text": "This story was delivered to Business Insider Intelligence Payments & Commerce subscribers earlier this morning.\n\nTo get this story plus others to your inbox each day, hours before they're published on Business Insider, click here.\n\nThe National Retail Federation (NRF) forecasts US holiday retail sales, which includes November and December, to grow between 3.8% and 4.2% annually, excluding automobile dealers, gas stations, and restaurants, per a press release. Business Insider Intelligence\n\nThis would be a stark increase from the 2.1% annual growth the season posted in 2018 — its smallest increase since 2009, when it jumped up just .2%. This year's projected growth sets the industry up to bring in between $727.9 billion and $730.7 billion, building on 2018's record $701.2 billion in sales.\n\nE-commerce is expected to drive retail's growth over the holidays, so merchants need to boost their online offerings to capture online spend during the key period.\n\nE-commerce sales are projected to rise more than three times as fast as the total industry's. The NRF forecasts US online and other nonstore sales to increase between 11% and 14% annually, totaling $162.6 billion to $166.9 billion. Not only are e-commerce sales set to grow far faster than overall retail sales, they're positioned to account for a much larger share of overall sales than they do in general since e-commerce sales made up 10.1% of US retail sales in Q2 2019, and the NRF's forecasts suggest that the segment will account for between 22% and 23% of sales during the holidays, making them even more important to merchants' success.\n\nTo capitalize on the growth of holiday e-commerce sales, merchants should consider adding services like free two-day shipping to attract shoppers. Target introduced free two-day shipping on \"hundreds of thousands of items\" from November 1 through December 22, 2018, even though it generally only offers the perk to REDcard holders and for orders of $35 or more. Making free two-day shipping widely accessible likely helped Target to a strong digital performance for the season. Adding services like free two-day shipping that make shopping more convenient should help merchants rack up online sales during the holidays, and because of the high order volumes seen during the season, services that might be cost-prohibitive year-round could be worth considering for the lead-up to Christmas.\n\nDespite strong expectations for the holidays, tariffs on Chinese goods threaten to curtail consumers' spending and weaken merchants' Q4 performances. US President Donald Trump has introduced a number of tariffs on Chinese goods, including categories like toys, clothing, and consumer electronics that can be popular purchases during the holiday season.\n\nIf retailers raise their prices to pass the costs of tariffs on to consumers, it could lessen the amount of holiday shopping US consumers do. Fifty-four percent of US consumers are already concerned about the impact tariffs will have on goods they regularly purchase, and if they're worried about prices they might cut back on their spending even if merchants don't raise their prices significantly. This makes navigating the tariff landscape and product pricing issues that merchants need to focus on to succeed over the holidays.\n\nWant to read more stories like this one? Here's how to get access:", "description": "The National Retail Federation forecasts US holiday retail sales to grow between 3.8% and 4.2% annually after rising just 2.1% last year.", "authors": ["Daniel Keyes"], "top_image": "https://image.businessinsider.com/56702ab772f2c19c108b5906?width=1200&format=jpeg", "published_at": "2019-10-10"}