{"pub": "fox", "url": "https://foxnews.com/health/cyberbullying-all-american-little-girl-suicide", "downloaded_at": "2019-09-21 10:10:20.706830+00:00", "title": "Cyberbullying on rise in US: 12-year-old was 'all-American little girl' before suicide", "language": "en", "text": "[Editor's note: This story discusses suicide. If you or someone you know is having thoughts of suicide, please contact the National Suicide Prevention Lifeline at 1-800-273-TALK (8255).]\n\nMallory Rose Grossman was your typical sixth grader. She loved cheerleading and gymnastics and was a dedicated student. She’d spend her afternoons on the trampoline or chasing her two dogs, Lola and Rocky, around the yard with her older sister, Carly. She was spirited and silly, creative and kind.\n\n“Mallory was truly the most all-American little girl. She loved sports. She loved nature. She loved hand-making crafts,” Mallory’s mom, Dianne Grossman, of Rockaway, N.J., told Fox News. “I remember how she would repurpose blue jeans, cutting the seams to make pocketbooks and give them as gifts to her friends.”\n\nJANITOR COMFORTING STUDENT WITH AUTISM GOES VIRAL\n\nBut on June 14, 2017, after what her mother claims was at least nine months of cyberbullying, Mallory’s lifeless body was found hanging in her bedroom closet. She was pronounced dead at 7:05 PM. She was 12 years old.\n\n“Cyberbullying is happening because it can,” Michael Brooks, superintendent of Marlboro Central School District in Marlboro, N.Y., which Mallory did not attend, told Fox News in a phone interview. “And unfortunately in the world of the Internet and added [social media] elements it’s being taken to a whole other level.”\n\nAccording to the latest federal report from the National Center for Education Statistics, cyberbullying is on the rise. Statistics show online bullying increased among teens and tweens 3.5 percent since the 2014-2015 school year. And the dangerous effects are reportedly hitting young girls the hardest.\n\n“Social media doesn’t turn off. It’s 24/7,” Joan Luby, a pediatric psychologist at Washington University School of Medicine, who did not treat Mallory, told Fox News. “I think girls are much more sensitive to peer rejection, which can potentially lead to suicide.”\n\nFor Mallory, the trouble allegedly started with little digs. Her classmates reportedly teased her for doing cartwheels on the playground, allegedly told her she couldn’t sit at certain lunch tables and purportedly laughed as she passed by their lockers. Her beautiful blonde hair was allegedly called “frizzy\" and her muscular thighs were supposedly declared “jiggly” and “fat.”\n\nUNIVERSITY OF TENNESSEE GIVES SCHOLARSHIP TO BULLIED STUDENT WHO DESIGNED HOMEMADE SCHOOL SHIRT\n\n“Mallory was overly sensitive,” Dianne, who started the Mallory's Army Foundation in her daughter's honor, said. ”When she told me about these things, I thought it was just kids being kids. I brushed it off as her being hypersensitive.”\n\nThen Mallory’s grades began to drop. She quit cheerleading, and would come home with a full lunch box. Her mother claimed she later found out Mallory was hiding in the bathroom during lunchtime.\n\nThe day before she died, Dianne said Mallory came downstairs weeping, with her cellphone in her hand. Dianne and her husband, Seth, had never seen their daughter so distraught.\n\nTwo girls allegedly screenshot their Snapchat videos. One photo was allegedly of Mallory as she walked to the bus. The caption allegedly read “Poor Mal. You have no friends” coupled with laughing emojis. Another pictured allegedly showed Mallory sitting on a bench, reportedly with the caption “You have no friends. When are you going to kill yourself?”\n\nTo this day, Mallory’s parents don’t know exactly how long the cyberbullying had been going on.\n\nCyberbullying is particularly dangerous because it takes away human interaction.\n\n“When you’re sitting with a person face-to-face and talking with them you can look at their facial expressions. You can pick up on the tone and quality of their voice,” Luby explained. “You see their reactions to things being said and how words impact other people. This doesn’t occur over social media. Kids are losing the ability to socially interact. They are losing the ability to empathize.”\n\nCyberbullying can create a poisonous school culture, affecting students’ social and emotional lives both in and out of the classroom.\n\nIn a 2017 study published in the Journal of the American Academy of Child and Adolescent Psychiatry, researchers found cyberbullying was associated with depression, anxiety, dissociation and anger.\n\n“We certainly look for changes in behavior,” Brooks said. “Whether there are physical changes, emotional changes, withdrawing behaviors, grades dropping — anything along those lines. These are signs that something is going on.”\n\nSecurly, a San Jose-based digital monitoring company, provides web filtering systems designed to detect cyberbullying and self-harm alerts across all social media platforms available to kids today. Securly's Linsly Donnelly offered parents the following advice should they suspect their child is being cyberbullied:\n\nKids can be obsessed with or wary of technology. Either they don’t want to be on their devices at all or they want to be on it all the time. This can be an indicator that something is happening that’s not healthy on that device.\n\nWatch out for changes in demeanor. If kids are being severely bullied, they’ll want to avoid school, sports and other activities — wherever they would be interfacing those who are bullying them.\n\nBe in front of the conversation. Educate your kids about bullying — what it is and how it manifests. How to seek out resources at school or other places. Tell them you’re there to help.\n\nGet children on board. Kids need to be comfortable with the fact it’s really important to tell someone, whether it’s happening to them or someone else.\n\nLog any incidents with the school. When a bullying incident occurs, it’s important to log it with the school. Should it escalate, the log is evidence of your complaints.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“If [you suspect] something going on you need to figure out how to engage with students and say ‘OK, something’s up. Let’s go figure it out and work to resolve it to help this person,’” said Superintendent Brooks. “Bottom line, we need to be kinder to each other and choose to call out bad behaviors. It is not acceptable to treat others badly.”\n\nRockaway Township School District, where Mallory was a student before her death, did not respond to multiple requests for comment.", "description": "Statistics show online bullying increased among teens and tweens 3.5 percent since the 2014-2015 school year.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/mallory_3.jpg", "published_at": "2019-09-19"}