{"pub": "businessinsider", "url": "https://businessinsider.com/why-get-life-insurance-before-having-kids", "downloaded_at": "2019-10-28 00:35:05.733736+00:00", "title": "3 reasons to get life insurance before your first child is born", "language": "en", "text": "There's a lot to take care of in the lead-up to having a baby.\n\nIf you don't have a life insurance policy but plan to have a baby in the next year or so, it's a good time to consider getting one.\n\nHere's why:\n\n1. You'll likely get a better rate\n\nThe way life insurance works, the younger and healthier you are, the lower your rate, regardless of the amount of coverage you get. Generally speaking, most people's health declines with age. The longer you wait to buy a policy, the greater the eventual cost.\n\nIf you're already pregnant and you're the breadwinner of the family, it's still possible to buy life insurance, though you'll probably get the best rates if you undergo the medical exam before or after pregnancy, according to Policygenius insurance expert Logan Sachon.\n\nStill, if you're already carrying a baby and the need for life insurance feels urgent, some insurance companies will allow you to retake your medical exam a year or two after giving birth and then adjust your rate accordingly.\n\nPolicygenius can help you compare policies to find the right coverage for you, at the right price »\n\n2. One parent plans to stay home\n\nIf one parent is leaving a steady paycheck behind to stay at home with the baby, it's time to get life insurance.\n\nStart by choosing a coverage amount equal to a year, two years, or more of the working partner's income so the stay-at-home parent won't have to rush back to work too soon if the breadwinner dies. The coverage amount doesn't have to be perfect — something is always better than nothing. If you have more kids or one parent decides to stay at home indefinitely, you can always increase the death benefit later.\n\n3. You need a contingency plan\n\nMost parents plan to leave at least a little bit of money to their children and/or spouse. But when you're young, building up a trust or even making a formal will usually aren't top priority amid bills and more immediate savings goals. Life insurance can act as a stand-in during the earlier years, or indefinitely if you have a permanent policy.\n\nWhoever is named as the beneficiary on a policy will get the entire death benefit, income tax-free. But keep in mind that some states won't allow you to name a minor as a beneficiary on a life insurance policy. Even in places where it is allowed, experts often recommend naming a spouse or legal guardian instead, explains Sachon.", "description": "If you don't have a life insurance policy but plan to have a baby in the next year or so, here's why it's a good time to consider getting one.", "authors": ["Tanza Loudenback"], "top_image": "https://image.businessinsider.com/5db324dddee019495e64afdf?width=1200&format=jpeg", "published_at": "2019-10-27"}