{"pub": "politico", "url": "https://politico.eu/article/the-eus-plans-for-a-water-powered-future", "downloaded_at": "2019-10-07 04:07:55.494242+00:00", "title": "The EU’s plans for a water-powered future", "language": "en", "text": "This article is part of the special report, End of the Road, about decarbonizing freight transport.\n\nBetsy and Corstiaan Heijns and their 73-meter barge Stormvogel are supposed to be the future of EU transport policy.\n\nThe Dutch couple's blue-and-white vessel transports steel coils between the Netherlands and Belgium — and emits much less carbon dioxide than if the same load were taken by truck. That's why the EU wants 30 percent of the bloc's freight to be transported by cleaner methods, including its 37,000 kilometers of inland waterways, instead of by road — something that would slash greenhouse gas emissions as the EU aims to become carbon neutral by 2050.\n\nThe problem?\n\nMuch of Europe's waterway infrastructure dates back to the 1950s and 1960s, and is often too old to accommodate larger, new vessels. Bridges are too low, and waterways are too narrow and too shallow.\n\nThe network is falling into disrepair, and countries have been reluctant to stump up the funds needed for modernization. But if they don't, there's no chance of shipping companies abandoning trucks for barges because of the delays caused by shoddy infrastructure.\n\nThanks to underfunding, the bloc has failed to eliminate traffic jams across its waterways, the EU Court of Auditors said in a 2015 report.\n\n\"That's the problem,\" said Betsy. \"You can never say, 'I'll be [at my destination] at that time,' because you get too many things that prove a stumbling block each time around.\"\n\nIt wasn't supposed to be that way. In 2011, the European Commission proposed shifting the balance between different modes of transport to favor rail and water over road. Ships are slow, but they're cheap and efficient. Using the same energy, an inland vessel can transport 1 ton of cargo nearly four times farther than a truck. Thanks to its gigantic cargo volumes, a vessel can transport the equivalent of hundreds of trucks.\n\nTo boost shipping, Brussels is spending 7 percent of the €24 billion Connected Europe Facility in the bloc's current seven-year budget on projects to link up waterways into TEN-T transport corridors, add missing links, and better integrate barge traffic with other ways of shipping goods.\n\nBut that's a fraction of the €13 billion tab countries say will be required just to eliminate bottlenecks by 2030 — a sum that doesn't include broader modernization.\n\nThanks to underfunding, the bloc has failed to eliminate traffic jams across its waterways, the EU Court of Auditors said in a 2015 report. \"These bottlenecks include bridges which are not high enough, inefficient locks and stretches of water which are not wide enough for traffic volumes.\"\n\nThat has far-reaching consequences. When a lock breaks, vessels can be stuck for hours — if not days. That harms one of the main selling points of inland shipping — reliability.\n\nCargo owners opting for shipping don't mind that it takes longer than other modes, but they'll switch back to road if they're faced with an unexpected delay, said Erik Schultz, chair of the infrastructure commission of the European Skippers' Organization (ESO). “We see a reverse modal shift happening, because of the fact that we’re not dependable anymore.”\n\nThat's one of the reasons the share of water-borne transport has remained stuck at around 6 percent since 2001.\n\n\"The potential of a cheap, relatively cheap, environmentally friendly transport is neglected because the infrastructure is not in place,\" said Schultz.\n\nTroubled waters\n\nThe use of waterways for freight transport is unevenly distributed in the EU. It's dominated by countries along the Rhine and the Danube rivers, key arteries for trade. The countries on the Rhine — Belgium, the Netherlands, France and Germany — represent about 85 percent of total inland navigation goods transport, while those on the Danube — Bulgaria, Croatia, Hungary, Austria, Romania and Slovakia account for about 15 percent. The rest of the EU accounts for only 0.5 percent.\n\nThe Netherlands, home to the EU's densest network of waterways, transports the highest share of freight on water: a whopping 44.7 percent in 2017. Poland, which is looking at developing freight on its Oder and Vistula rivers, has a freight traffic share of 0.1 percent. For three decades, Poland has \"forgotten they have water,\" said Schultz.\n\nThe Poles have barely started — the aim is to invest 76 billion złoty (€17.3 billion) by 2030, according to a government plan, with about 85 percent coming from the EU. From 2014 to 2020, investments are estimated at less than a tenth of that figure.\n\nAt the other end of the scale, the Netherlands is dealing with pressure of growing volumes of traffic while maintenance has fallen \"way behind,\" said Schultz. Earlier this year, the Dutch court of auditors warned that the government would need more than its annual waterways maintenance budget just to fund postponed repairs — let alone tackle the day-to-day wear-and-tear.\n\nIn next year's budget, the government has put aside an extra €100 million to give \"a strong boost\" to the country's waterways. But that's only half of what the sector was hoping for, said Schultz. “Painting a lamppost is not what we call maintenance,\" he said. \"What we're calling for is ... to make it fit for the future, to make it fit for the next 30, 40 years.\"\n\nBelgian boondoggle\n\nBelgium's sloped lock of Ronquières is an example of the changing fortunes of waterways investments.\n\nVariable rains and increasingly frequent heatwaves are also wreaking havoc on water levels.\n\nThe lock — an ingenious mechanism that uses gigantic 91-meter tanks on rail tracks to lift ships 68 meters — shaves seven hours off the trip between Brussels and the industrial town of Charleroi.\n\nIt was built in the 1960s to handle coal shipments from the mines of Wallonia. But as Belgium's coal industry withered and died, the lock was denounced as an expensive white elephant.\n\nFifty years later, the slope, like much of the region's waterways, has fallen into disrepair. Only one of its tanks is in operation while the other one is being repaired.\n\nFor the Heijns, the Brussels-Charleroi canal is a vital link for their barge — and the Ronquières slope has proved its \"biggest stumbling block,\" Betsy said.\n\n\"They have been working for two years [on one tank] and it's still not finished ... If the other tank also malfunctions ... then you're stuck there,\" Betsy said in a telephone interview, conducted as the Stormvogel was making its way back to Moerdijk, near Rotterdam.\n\n\"It's very frustrating if you always have to pass through there.\"\n\nNow Belgium is scrambling to upgrade it waterways. In an infrastructure plan presented earlier this year, former Walloon Mobility Minister Carlo Di Antoni promised a €350 million investment to boost a shift to water, calling it \"a major and truly strategic issue for our region.\"\n\nIn Tournai, a historic bridge over a canal is being rebuilt with wider arches after it was demolished — sparking vociferous protests — in order to make way for larger barges.\n\nIt's part of a wider rethink of waterways. Countries are working to link up the Scheldt network in the Netherlands and Belgium with the Seine basin in France — a gigantic EU-funded project that aims to upgrade some 1,000 kilometers of waterways to make them accessible for large vessels.\n\nClimate conundrum\n\nAll of that effort is aimed at helping reach the EU's decarbonization goals — one of the main priorities of incoming Commission President Ursula von der Leyen. But that's not happening fast enough to stop the consequences of climate change — and water-borne traffic is particularly vulnerable.\n\nThe focus on greenhouse gases also has the paradoxical effect of the Commission and national governments extolling water-borne freight, but then calling on the sector to clean up its own emissions by switching to barges powered by either electricity or natural gas.\n\n“The extreme drought over the past years has demonstrated: If ships cannot sail on the Rhine, gas stations remain empty and companies have to reduce production” — German Transport Minister Andreas Scheuer\n\nVariable rains and increasingly frequent heat waves are also wreaking havoc on water levels.\n\nGerman Transport Minister Andreas Scheuer presented a plan earlier this year to make sure the Rhine remains a reliable freight option. Traffic on the river ground to a halt in 2018, as a persistent drought dropped water levels to a record low. Freight volumes on the canal linking up the Rhine and the Danube fell by 350,000 tons.\n\n“The extreme drought over the past years has demonstrated: If ships cannot sail on the Rhine, gas stations remain empty and companies have to reduce production,” said Scheuer.\n\nThe low water levels also leaves some locks unable to lift vessels. That forces shippers like the Heijns to make long detours — as they did in September when they tried to circumvent low water levels in Ittre, north of Ronquières.\n\nThe traveled east down the Sambre toward Liège, then back toward the North Sea via the Albert Canal — only to find the locks there were hampered by low water as well.\n\n\"That'll take us three extra days,\" Betsy sighed.\n\nThis article is from POLITICO Pro: POLITICO’s premium policy service. To discover why thousands of professionals rely on Pro every day, email pro@politico.eu for a complimentary trial.", "description": "Europe wants to shift cargo from road to water, but its old waterway infrastructure may not be ready to carry the weight.", "authors": ["Hanne Cokelaere", "Joshua Posaner"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/eor_waterways300x219-1200x628.jpg", "published_at": "2019-10-01"}