{"pub": "cnn", "url": "https://cnn.com/travel/article/nairobi-fastest-city-africa/index.html", "downloaded_at": "2019-10-04 09:17:29.191835+00:00", "title": "Is Nairobi, Kenya, the fastest city on the planet?", "language": "en", "text": "(CNN) — Nairobi's only been a city since 1954, but it's been making up for lost time ever since.\n\nThe capital of Kenya is now a thriving metropolis that continues to grow rapidly in a country that covers 582,650 square kilometers (around twice the size of Nevada). Nairobi is always on the move, always changing.\n\nWhile its name comes from a Maasai phrase meaning \"the place of cool waters,\" Nairobi is more commonly referred to as the \"Green City in the Sun.\"\n\nPositioned between Somalia and Tanzania in Eastern Africa, it's a place where residents and wild beasts live in close proximity -- and might be the only city with a safari park on its doorstep.\n\nRelated content Panama: How a country of chaos became a bridge across the Americas\n\nNow one of Africa's most influential cities, Nairobi is a vital commercial and financial regional hub, home to the regional headquarters of various major international companies and organizations. It's also got the highest number of malls in Kenya.\n\nDespite its youth, Nairobi's growth rate has been one of the highest of any African city, with major real estate projects and skyscrapers regularly popping up on its burgeoning skyline.\n\n\"There's a lot of entrepreneurship going on in Nairobi. Everybody is busy creating a life,\" says Najib Balala, Kenya's minister of tourism. \"Also, the vibrancy of the city, wharf and business and tourism and hospitality, every part of Nairobi is fast.\n\n\"I come from Mombasa. When I come to Nairobi, I find myself in a different landscape. Here people are moving fast, and people want to get things done.\"\n\nThe city's population has also risen, doubling in size since 1986.\n\nIn fact the only thing that moves slowly in Nairobi is the traffic, a bone of contention for travelers and locals alike.\n\nBirth of a city\n\nNairobi has a safari park on its doorstep. Peter Macdiarmid/Getty Images\n\nIts growth can largely be traced back to the arrival of the railway system, without which the city as we know it would not exist.\n\nThe two have been intertwined since 1895, when the British were busy connecting parts of its empire by building a railroad from Mombasa on Kenya's coast to the neighboring colony -- Uganda.\n\nWith an elevation of 5,889 feet above sea level, the area was chosen as a stopover point due to its cool temperature and the availability of food and water. In 1899 Nairobi was founded by the colonial authorities as a rail depot on the Uganda Railway.\n\n\"It's the railway that created Nairobi ... as the city,\" explains Nairobi Railway Museum curator Randiga Aron Elias.\n\nRelated content Berlin: The city where anything goes\n\n\"The first buildings began when the railway reached Nairobi. Otherwise it was just a vast land where the only possibility was raising animals.\"\n\nThe Uganda Railway was constructed by Indian slaves brought over to work in terrible conditions. Some were even eaten by lions as they worked on the railroad.\n\nBut despite the horrendous circumstances behind it, Kenya recognizes that legacy and is preserving it at the museum.\n\nThe arrival of the railways transformed Nairobi. Jonathan Hawkins/CNN\n\n\"Our great founding father told us, 'Don't forget, but forgive.' That's why we have peace with what our past is all about. We moved forward,\" says Balala.\n\n\"[It was] very painful, but we have moved on, and we try to improve what was the foundation [of Kenya].\"\n\nOf course, no one could have predicted quite such an improvement.\n\nThe one-time shanty town went on to replace Machakos as the capital of Kenya in 1907 and remained as such after the country gained independence in 1963.\n\nSafari capital\n\nIt may be strange feeding a giraffe with its head through the window but it's truly a World of Wonder.\n\nNow one of Africa's largest cities, Nairobi has long been the safari capital of the continent and its National Park plays a major part in the structure of the city.\n\nMeasuring about 134 square kilometers, it's home to more than 400 species of birds as well as a plethora of animals, including buffaloes, leopards, lions and rhinos and has the rather unusual backdrop of city skyscrapers and landing planes.\n\nThis sharp contrast between the wild and the city -- an electric fence the only thing separating them -- is about as unique a wildlife offering as it gets.\n\nAfter all, where else in the world can you witness at least four of the big five living next to half a million residents?\n\nRelated content In Athens, having fun is the only way to survive\n\nFor visitors who can afford it, one luxurious way to experience this is a stay at the Giraffe Manor , a stately boutique hotel famed for the resident animals its named after. The giraffes make regular appearances at breakfast, craning their long necks through the windows to greet the guests.\n\nFeeding time at Giraffe Manor. Jonathan Hawkins/CNN\n\nWhile conservation activists have voiced concerns about the threat Nairobi's continuing advancement poses to its landscape, Balala believes that Africa's oldest national park and the Karura Forest, with its Sykes' monkeys and towering trees, play a huge role in Nairobi's flourishing.\n\n\"The greenery and the ecosystem support Nairobi as a healthy city,\" he explains. \"Look at the freshness of this weather!\n\n\"We say that half the land of Nairobi is Nairobi National Park. The other land is Karura Forest.\"\n\nNature is the heartbeat of Nairobi and its wildlife has helped to attract travelers to Kenya for many years.\n\nBright future\n\nReverand Kathy Kiuna: \"Nairobians are very happy, thriving, exciting human beings.\" Jonathan Hawkins/CNN\n\nThe number of visitors to the country is currently on the up, with tourism earnings increasing by 20% in 2017.\n\nNairobi was also recently named as one of the top 10 destinations on the rise by travel and restaurant review site TripAdvisor, which listed the Karen Blixen Museum , the former home of \"Out of Africa\" author Karen Blixen, and the Giraffe Center, established to protect the endangered Rothschild giraffe, as its top sights, along with the national park.\n\nBut what is the true essence of the city?\n\nReverend Kathy Kiuna, who co-founded Nairobi's Jubilee Christian Church with her husband in 1989, attributes the success of Nairobi to its people.\n\n\"It's the Nairobians,\" says Reverend Kiuna. \"They make Nairobi because Nairobians are very happy, thriving, exciting human beings.\n\n\"They are so vibrant. They live for real. We live life. It's not a rehearsal.\"\n\nRadio personality Shaffie Weru, who was born and bred in the city, wholeheartedly agrees with this sentiment.\n\n\"We Nairobians love everything about Nairobi. Everything that's Kenya, everything about the culture.\"\n\nAs Nairobi continues to make advancements, the one thing that remains constant is its limitless energy. This place is so full of life.\n\nShaffie Weru: \"Nairobians love everything about Nairobi.\" Jonathan Hawkins/CNN\n\nAnd while every four years or so, it falls into disagreement -- usually over politics -- you'll find peace and dignity here the rest of the time.", "description": "Nairobi, Kenya's capital, has only been a city since 1954, but it's been making up for lost time ever since. This thriving metropolis is always on the move and always changing.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F181205174232-nairobi-skyline-1-super-tease.jpg", "published_at": "2018-12-07"}