{"pub": "zdnet", "title": "ASX approaching artificial intelligence with caution", "url": "https://www.zdnet.com/article/asx-approaching-artificial-intelligence-with-caution", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:14:09.332366+00:00", "text": "While the Australian Securities Exchange (ASX) makes a global name for itself by implementing one of the only real use cases for distributed ledger technology (DLT) in its blockchain-based CHESS replacement project, its CIO Dan Chesterman has detailed a handful of other tech-related initiatives the \"large regulated fintech\" is also undertaking.\n\nSpeaking with ZDNet at VMworld in San Francisco last week, Chesterman said his organisation is looking into the application of artificial intelligence (AI) and machine learning (ML), highlighting that in the ASX's context, there are a lot of examples where machines are making quite clever decisions.\n\n\"The main exploration we've been doing of artificial intelligence in that AI/ML space has been in market announcements ... it's not in production, it's something we're doing as a proof of concept,\" he said.\n\n\"And what we've come to the conclusion of is that we certainly see, in that sort of context, there is actually a serious consequence for any error.\"\n\nMarket announcements, for example, is one element of the business where Chesterman said AI could both help, but also cause legal dilemmas.\n\n\"If we put something sensitive and it wasn't, or we don't put something sensitive and it was, that's going to be an issue,\" he continued. \"We think there will be the requirement for quite some period for a human to make that decision, but what we'd like to do is give that individual better insights into what could be in the document.\"\n\nChesterman said his organisation has settled on the idea that if it is a decision that should be made by a human, it probably should be made by a human, but it can still use technology to help.\n\n\"We are thinking about augmented intelligence, rather than artificial intelligence replacing a human, particularly in areas where we need to be able to explain our decision or there's gravity associated with the decision,\" he said.\n\nThe ASX is also investing heavily in infrastructure. It's building a secondary data centre, refreshing its network, and upgrading its website. Chesterman said the ASX sees itself accelerating the investment into replacing aged assets and contemporising technology from the ground up, not necessarily just application replacement.\n\nExpanding on the ASX's data analytics platform DataSphere, Chesterman said the exchange is essentially creating a datalake with a set of analytic tools attached to it.\n\n\"We'll ingest some ASX data, some of which has not been previously distributed in the form of market data feeds or other items, and then also third parties can then ingest their data in with very robust data governance technologies and contracts,\" he explained.\n\n\"That DataSphere initiative we've now been using it internally for a couple of months, in October we'll start to ingest the first third party data elements to it and make analytics products available to the market as well.\"\n\nTech services more profitable than trading\n\nThe ASX doesn't exactly have a cloud strategy, primarily because it runs its own data centre and sells co-location services to customers.\n\n\"I think we actually now make more money from selling technology services to customers than pure trading fees,\" Chesterman said during a panel session on financial services at VMworld.\n\n\"The reality is, technology services, as a business, has grown at about 10% a year for eight years and the comparison is on fees for the cash equity trading, which is a portion of what you get from trading ... the reality is we don't have a technology services business if we don't have trading ... our technology services is a growing business,\" he later added.\n\n\"When we opened the [Australian Liquidity Centre] eight years ago, there were lots of empty racks and empty space, that kind of is more close to capacity and we've got more than 100 customers who have their infrastructure in our data centre, so it is a meaningful business.\"\n\nAs a result of that, Chesterman said the ASX hasn't really invested heavily in cloud because it is offering it as a service. The ASX is however using cloud, mostly in non-production, with Chesterman saying that is primary for the speed of spinning up new environments and for the developer experience.\n\nVMware and DLT\n\nLast week, the ASX announced it had, alongside its blockchain partner Digital Asset, signed a memorandum of understanding (MOU) with VMware that will see work conducted on DLT initiatives in Australia.\n\n\"We recognise a company like VMware does have pedigree in running infrastructure at significant scale, so we saw working in a three-way partnership as being beneficial for us to be able to manage the DLT for CHESS replacement but also for future opportunities,\" Chesterman said.\n\nChesterman told ZDNet \"there's no doubt\" that customers of the ASX are customers of VMware. The ASX is also a large consumer of VMware -- VMware is providing some of the underlying infrastructure for the CHESS replacement project.\n\n\"We're a big VMware user, we use vSphere, vRealise, we've got virtual machines -- a lot of our technology -- so the CHESS replacement solution we were developing with Digital Asset was going to sit on VMware infrastructure,\" he said.\n\nTouching on announcements emerging from VMworld that would be applicable to the ASX, Chesterman said he's particularly interested in the idea of Kubernetes being embedded into vSphere.\n\n\"I think that's a significant step forward for me. We're an early stage user of PKS and I think what we see as being a pattern our developers -- it brings the infrastructure and developer teams closer together in terms of a pattern and architecture that they can both get behind,\" he said.\n\nDisclosure: Asha Barbaschow travelled as a guest of VMware to VMworld in San Francisco\n\nRELATED COVERAGE", "description": "Aside from the blockchain-based CHESS replacement project, the ASX is experimenting with artificial intelligence and machine learning, but it's cautious of letting the tech run wild in such a sensitive market.", "authors": ["Asha Barbaschow"], "top_image": "https://zdnet2.cbsistatic.com/hub/i/r/2017/12/13/3f180be2-c877-44fd-90fe-2c23e43bc3ef/thumbnail/770x578/4e078813501d4768600096a18d7616dc/asx-listing-requirements.jpg"}