{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-south-africa-vs-namibia-kick-off-time-watch-tv-channel-stream-team-news-a9123336.html", "downloaded_at": "2019-09-27 15:03:28.335262+00:00", "title": "Rugby World Cup 2019: Kick-off time and TV details for South Africa vs Namibia", "language": "en", "text": "South Africa will be looking to bounce back from their Rugby World Cup defeat against New Zealand when they take on Namibia.\n\nRassie Erasmus’ men were beaten 23-13 on the opening weekend, despite making a promising start against their fierce rivals.\n\nThe Springboks take on a Namibia side that will be licking the wounds of their 47-22 loss at the hands of Italy.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nErasmus has rung the changes for the clash, with Schalk Brits, who came out of retirement for the World Cup, starting the game at number eight.\n\nBrits has only 13 caps since making his debut in 2008, with Saturday his third start and first appearance at the back of scrum.\n\nShape Created with Sketch. Rugby World Cup 2019 - Team of the Round Show all 16 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rugby World Cup 2019 - Team of the Round 1/16 Rugby World Cup 2019 - team of the round AFP/Getty Images 2/16 1 Jefferson Poirot Getty Images 3/16 2 Rory Best Getty Images 4/16 3 Tadhg Furlong Getty Images 5/16 4 Maro Itoje Getty Images 6/16 5 Scott Barrett AP 7/16 6 Ardie Savea PA 8/16 7 Peceli Yato Getty Images 9/16 8 Kazuki Himeno PA 10/16 9 Tomos Williams AFP/Getty Images 11/16 10 Romain Ntamack AFP/Getty Images 12/16 11 Cheslin Kolbe AFP/Getty Images 13/16 12 Samu Kerevi AFP/Getty Images 14/16 13 Manu Tuilagi Getty Images 15/16 14 Kotaro Matsushima Getty 16/16 15 Beauden Barrett Getty Images 1/16 Rugby World Cup 2019 - team of the round AFP/Getty Images 2/16 1 Jefferson Poirot Getty Images 3/16 2 Rory Best Getty Images 4/16 3 Tadhg Furlong Getty Images 5/16 4 Maro Itoje Getty Images 6/16 5 Scott Barrett AP 7/16 6 Ardie Savea PA 8/16 7 Peceli Yato Getty Images 9/16 8 Kazuki Himeno PA 10/16 9 Tomos Williams AFP/Getty Images 11/16 10 Romain Ntamack AFP/Getty Images 12/16 11 Cheslin Kolbe AFP/Getty Images 13/16 12 Samu Kerevi AFP/Getty Images 14/16 13 Manu Tuilagi Getty Images 15/16 14 Kotaro Matsushima Getty 16/16 15 Beauden Barrett Getty Images\n\nWhen is it?\n\nSouth Africa vs Namibia kicks off at 6.45pm Japan Standard Time (10.45am BST) on Saturday 28 September.\n\nWhere can I watch it?\n\nITV will be broadcasting the match. Coverage starts at 10.30am.\n\nAlternatively, you can live stream the game via the ITV Hub on your smartphone, desktop or tablet.\n\nTeams\n\nSouth Africa: Warrick Gelant, Sbu Nkosi, Lukhanyo Am, Frans Steyn, Makazole Mapimpi, Elton Jantjies, Herschel Jantjies; Schalk Brits (captain), Kwagga Smith, Francois Louw, Lood de Jager, RG Snyman, Vincent Koch, Bongi Mbonambi, Tendai Mtawarira.\n\nReserves: Steven Kitshoff, Thomas du Toit, Eben Etzebeth, Siya Kolisi, Franco Mostert, Cobus Reinach, Damian de Allende, Cheslin Kolbe.\n\nNamibia: Johan Tromp, Chad Plato, JC Greyling, Peter John Walters, Lesley Klim, Cliven Loubser, Eugene Jantjies; Adriaan Booysen, Muharua Katjijeko, Thomasau Forbes, Tjiuee Uanivi (captain), Johan Retief, AJ De Klerk, Louis van der Westhuizen, Desiderius Sethie.\n\nReserves: Obert Nortje, Andre Rademeyer, Johannes Coetzee, Prince Gaoseb, Janco Venter, Wian Conradie, Helarius Axasman Kisting, Johan Deysel.\n\nPrediction\n\nThe Springboks have made 13 changes to the side that ran out against New Zealand as Erasmus looks to keep his men fit and fresh for the latter stages of the competition. Even with a weakened team, there’s no doubt that it’d take something special from Namibia to topple the two-time world champions. Do they have it in their locker? No, probably not. A thumping win for South Africa.", "description": "South Africa will be looking to bounce back from their Rugby World Cup defeat against New Zealand when they take on Namibia. Rassie Erasmus’ men were beaten 23-13 on the opening weekend, despite making a promising start against their fierce rivals. The Springboks take on a Namibia side that will be licking the wounds of their 47-22 loss at the hands of Italy.", "authors": ["Samuel Lovett"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/27/12/south-africa.jpg", "published_at": "2019-09-27"}