{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/transfer-news/ole-gunnar-solskjaer-gives-ed-20575602", "downloaded_at": "2019-10-14 10:14:55.923217+00:00", "title": "Ole Gunnar Solskjaer 'gives Ed Woodward Man Utd transfer wish list'", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nOle Gunnar Solskjaer and his coaching staff have handed Manchester United bosses a six-man transfer wish list, according to reports.\n\nUnited have endured a tricky start to the Premier League season and currently sit 12th in the table, just two points above the relegation zone.\n\nMuch of the criticism of the Red Devils has been placed on the a weak squad - with fingers pointed at the likes of Fred, Andreas Pereira and Ashley Young as not being good enough for the club.\n\nAs such, Solskjaer, assistant Mike Phelan, scout Jim Lawlor and United's recruitment team have put together a list of six players they would like to sign, and have passed the note onto Ed Woodward, according to the Daily Mail.\n\n(Image: EMPICS Sport)\n\nAny potential transfers are unlikely to be rushed through in January, though, as Woodward and Matt Judge have ruled out a winter spending splurge.\n\nThe Mail include Lyon striker Moussa Dembele's name as being a part of the short-list, while Mario Manduzkic is known to be on United's radar.\n\n(Image: AFP via Getty Images)\n\n(Image: SIMONE ARVEDA/EPA-EFE/REX)\n\nInjuries to Anthony Martial have left Solskjaer short of options up front after the summer departures of Alexis Sanchez and Romelu Lukaku to Inter Milan.\n\nThe Red Devils have sent scouts to France to watch Dembele this season, with the front man hitting six goals in eight appearances in Ligue 1.\n\nUnited have apparently already reached a verbal agreement for Juventus hit man Manduzkic.\n\nMandzukic was close to joining the Red Devils in the summer only to eventually stay in Turin, where he hasn't featured for the Italian champions this season and was omitted from their 25-man Champions League squad.\n\nTuttosport claimed last week that Mandzukic's camp have an agreement in place with United, who he will join on January 1.\n\nMandukic has scored 44 goals in 162 games for Juve since joining the club from Atletico Madrid in 2015.", "description": "Man Utd have endured a rocky start to the season which has seen Ole Gunnar Solskjaer eyeing up potential squad improvements", "authors": ["Alex Smith", "Image", "Empics Sport", "Afp Via Getty Images", "Simone Arveda Epa-Efe Rex"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20575588.ece/ALTERNATES/s1200/0_Newcastle-United-v-Manchester-United-Premier-League-St-James-Park.jpg", "published_at": "2019-10-14"}