{"pub": "yahoo", "url": "https://finance.yahoo.com/news/saudi-attacks-reveal-oil-supply-142715691.html", "downloaded_at": "2019-09-16 09:15:07.144751+00:00", "title": "Saudi Attacks Reveal Oil Supply Fragility in Asymmetric War", "language": "en", "text": "(Bloomberg) -- The latest and most destructive attacks on Saudi oil facilities provide stark evidence of the vulnerability of global crude supply in an age of disruptive technologies that can bring a century-old industry to its knees -- at least temporarily.\n\nFrom remote-controlled drones to anti-ship mines and computer worms, hostile parties have employed an unpredictable array of asymmetric weaponry to confound one of the best-equipped militaries in the Middle East. Saudi Arabia blames many of the attacks against its oil assets on Houthi rebels in impoverished Yemen, where Saudi forces have been fighting since 2015 in a civil war that’s spilling across their shared border.\n\nThe use of drones shows that “an air force or even particularly advanced rockets are not necessary to cause widespread economic damage to the kingdom’s center of gravity,” said Milena Rodban, an independent risk consultant based in Washington, D.C. The Saudis accuse Iran of backing the Houthis and supplying them with weapons.\n\nThe attacks mark at least the sixth time in four months that Saudi energy facilities or tankers carrying the kingdom’s oil have been targeted. Mine attacks against ships near the Strait of Hormuz and drone strikes on Saudi pipelines in May and June served as warnings of the vulnerability of supplies, even if they didn’t cause significant cuts in shipments. The weekend attack, by contrast, forced an immediate halt in 5.7 million barrels of daily production.\n\nCyber attacks, another element of asymmetric warfare, pose a similar risk. Saudi Arabia blamed unidentified people based outside the country for sending a virus that compromised state-run oil producer Saudi Aramco’s computer network in August 2012. Although the virus had no effect on output of crude and refined products, the incident highlighted Aramco’s vulnerability to cyber strikes.\n\nThe Houthis have previously targeted Saudi pipelines and refineries, in forays over the past year. In other strikes against Aramco facilities, guards repulsed a 2006 al-Qaeda attack on Abqaiq, and bombings at residential towers near Aramco’s headquarters in Dhahran on the country’s eastern coast caused deaths and damage.\n\nYemen’s Houthis claimed responsibility for Saturday’s attack. The rebels said they launched drones, and the Saudi Press Association reported that drones were involved. Saudi Aramco said “projectiles” hit its facilities.\n\nAlthough U.S. Secretary of State Mike Pompeo directly blamed Iran for the attacks, Iran’s Foreign Ministry spokesman Abbas Mousavi denied the accusation.\n\n“Saudi Arabia’s oil infrastructure is an attractive target to more than just the Houthis,” Rodban said. “Anyone hoping to sway oil markets, spook investors, and highlight glaring weaknesses in defenses can take advantage of cheap and easy-to-deploy drones.”\n\n(Adds details of asymmetric threats in second paragraph.)\n\n--With assistance from Manus Cranny and Alaa Shahine.\n\nTo contact the reporters on this story: Anthony DiPaola in Dubai at adipaola@bloomberg.net;Verity Ratcliffe in Dubai at vratcliffe1@bloomberg.net\n\nTo contact the editors responsible for this story: Nayla Razzouk at nrazzouk2@bloomberg.net, Bruce Stanley, Andrew Blackman\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- The latest and most destructive attacks on Saudi oil facilities provide stark evidence of the vulnerability of global crude supply in an age of disruptive technologies that can bring a century-old industry to its knees -- at least temporarily.From remote-controlled drones to anti-ship", "authors": ["Anthony Dipaola", "Verity Ratcliffe"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Dve7duG9L_.SO_.0Dlz6lA--~B/aD0xMzUwO3c9MTI5NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/b0c6dadf2a7bc28cc4374d3647b156d9", "published_at": "2019-09-15"}