{"pub": "guardian", "url": "https://theguardian.com/music/2019/oct/12/k-pop-group-bts-criticised-for-saudi-arabia-concert", "downloaded_at": "2019-10-12 06:47:37.033247+00:00", "title": "K-pop group BTS criticised for Saudi Arabia concert", "language": "en", "text": "Group performs in Riyadh despite appeals by human rights groups and its own fans\n\nA historic concert by K-pop superstars BTS has caused accusations of “whitewashing” an authoritarian regime. The Korean group were the first non-Arab artists to play a stadium in the country, with a concert at Riyadh’s King Fahd International Stadium held on Friday night as part of their Love Yourself: Speak Yourself tour.\n\nThe seven-piece is one of the world’s biggest acts, regularly topping charts globally and selling out stadiums in Asia, the US and the UK. In Riyadh they played to an audience of about 30,000 in a venue with a capacity of almost 70,000.\n\nLove Yourself more: K-pop band BTS take 'extended break' to 'enjoy life' Read more\n\nThe group were greeted by about 100 fans at the airport as they arrived in the country. Many more flew in from Middle Eastern countries such as Kuwait and the United Arab Emirates to attend the concert.\n\nWomen have only been allowed to enter King Fahd Stadium since 2017.\n\nTURKI ALALSHIKH (@Turki_alalshikh) بي تي اس ... يقولون ملعب مره مره فاضي مافيه الا ٧ pic.twitter.com/lsfcONHgSI\n\nCriticism of the decision to play Saudi Arabia erupted almost the moment the concert was announced in July, dividing BTS’s fans, with many citing the 2018 murder of Jamal Khashoggi in the Saudi Arabian consulate in Turkey and the kingdom’s human rights record.\n\nIt also seems at odds with the group’s involvement in Unicef’s End Violence campaign and their own “Speak Yourself” speech to the UN, given Saudi Arabia’s history of censorship, its restriction of women’s rights and that same-sex sexual activity is illegal.\n\nOn This Day In K-Pop (@onthisdaykpop) Remember there are Muslim K-Pop fans who are also LGBTQ+, some of them have been vocal about their contempt for the concert, but for those who live in Saudi Arabia speaking out on the concert means getting killed.\n\nWhile many fans supported the group’s decision to perform, in the lead-up to the concert, others posted tweets with the hashtag #BTSdontgo. On Saturday, the Human Rights Foundation joined the criticism, saying the group was whitewashing the regime’s human rights violations.\n\n“Rather than using their platform to denounce the Saudi regime’s abuses, BTS chose to whitewash the regime’s human rights violations by performing in Riyadh today. HRF calls on celebrities to think twice before endorsing authoritarian regimes,” it said in a tweet.\n\nHuman Rights Foundation (@HRF) Rather than using their platform to denounce the Saudi regime’s abuses, BTS chose to whitewash the regime’s human rights violations by performing in Riyadh today.\n\n\n\nHRF calls on celebrities to think twice before endorsing authoritarian regimes. https://t.co/843nov1R2i\n\nThe group defended the decision to perform in Saudi Arabia in an interview with the Hollywood Reporter earlier this month, saying although it wasn’t an easy one to make, they had been “officially invited” and that “we go where people want to see us”.\n\nBTS’s company BigHit acknowledged concessions had been made for the concert, which was live streamed globally.\n\n“In consideration of local sentiment, some dance moves that involve revealing a member’s abdominal muscles [were] modified.”\n\nEarlier this year Mariah Carey performed in Saudi Arabia, but American rapper Nicki Minaj cancelled a concert there, saying it was important for her to show support for the rights of women, the LGBTQ community and freedom of expression.", "description": "Group performs in Riyadh despite appeals by human rights groups and its own fans", "authors": ["Guardian Staff"], "top_image": "https://i.guim.co.uk/img/media/e8ccfe353dfd764eeae364e3b4c17d430d15f874/302_596_6544_3928/master/6544.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f2c240ced8c7ecbc9f80c5a44629afd9", "published_at": "2019-10-12"}