{"pub": "investing.com", "url": "https://uk.investing.com/news/economy/speaker-john-bercow-announces-he-will-quit-1958482", "downloaded_at": "2019-09-09 23:32:48.592333+00:00", "title": "Speaker Bercow, champion of Britain's parliament in clash with Johnson, bows out", "language": "en", "text": "© Reuters. Speaker of the House of Commons John Bercow speaks in Parliament in London\n\nBy William James and Kylie MacLellan\n\nLONDON (Reuters) - House of Commons Speaker John Bercow, champion of Britain's parliament in its move to rein in Prime Minister Boris Johnson over Brexit, said on Monday he would stand down, issuing a warning to the government not to \"degrade\" parliament.\n\nBercow, known for his thundering cries of \"Order! Order!\" and his scathing put-downs of misbehaving lawmakers, has been the target of fury from Johnson's government, which accused him of breaking rules to let lawmakers force a delay to Britain's exit from the EU.\n\nWith less than two months until Britain's most important political decision in decades, Bercow, whose position is formally meant to be neutral, helped give lawmakers the chance to strip control of the outcome away from the government. Last week, lawmakers defeated Johnson to pass a law ordering Johnson to seek a delay from the Oct. 31 Brexit deadline.\n\nIn the speech announcing his plan to resign, Bercow fixed his gaze on the benches where ministers sit and delivered a direct warning to the government: \"We degrade this parliament at our peril.\"\n\nBercow, 56, was given a standing ovation from many members of the lower house as he announced his plan to stand down in the coming weeks - particularly by those on the opposition benches.\n\n\"When the history books come to be written, you will be described as one of the great reforming speakers of the House of Commons,\" said opposition Labour Party lawmaker Hilary Benn, who led the passage of the law to try and stop a no-deal Brexit.\n\n\"In every decision you have made, you have put one consideration above everything else: Your wish to enable the House of Commons to discuss matters and to have a view.\"\n\nA day earlier, Johnson's business minister, Andrea Leadsom, had called Bercow's decision to give lawmakers a chance to pass legislation against the wishes of the government a \"flagrant abuse\" of parliamentary process.\n\n\"It acts in complete disregard to the will of the people – not just on Brexit, but on whom they have chosen to govern them,\" she wrote in the Mail on Sunday. \"The Speaker hasn’t just bent the rules, he has broken them.\"\n\nPOWERS\n\nIn Monday's speech, Bercow said he would not contest the next election if parliament voted later on Monday in favour of calling one. If, as expected, lawmakers reject the government's attempt to call an election, he said he would quit on Oct. 31 - the Brexit deadline that lawmakers voted last week to postpone.\n\nBercow has been speaker since 2009 - a role traditionally responsible for ensuring decorum during debate, but which took on unusual power this year when Johnson and his predecessor Theresa May failed to get their Brexit policies past parliament.\n\nIn a country with no written constitution and a parliament ruled by convention, it fell to him to interpret rules that normally give the government control over parliament's agenda.\n\nBercow's cries of \"Order! Order!\" have travelled around the world in viral video clips, as have his quips.\n\n\"Don't tell me, young man ... what I can and can't say,\" he bellowed at one heckler on Monday. \"If you're not interested, leave the chamber. I'm not remotely interested in your pettifogging objection, chuntered inelegantly from a sedentary position.\"\n\nDuring his ten-year term, he has survived an outcry over expense claims - including costly use of official cars and overseas trips - and has faced allegations of bullying from former members of staff, which he has denied.\n\nPro-Brexit campaigner Nigel Farage, one of the architects of the decision to leave the European Union, summed up the eurosceptic sentiment in a two-word tweet: \"Good Riddance.\"", "description": "Speaker Bercow, champion of Britain's parliament in clash with Johnson, bows out", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXNPEF881IF_L.jpg", "published_at": "2019-09-09"}