{"pub": "breitbart", "url": "https://breitbart.com/entertainment/2019/10/14/howard-university-professors-hate-on-kanye-wests-sunday-service", "downloaded_at": "2019-10-15 02:18:04.684691+00:00", "title": "Howard University Professors Hate on Kanye West’s Sunday Service", "language": "en", "text": "Hip-hop superstar and fashion designer Kanye West on Saturday hosted his weekly Sunday Service at Howard University, one of the country’s most prominent historically black colleges, and he drew hundreds of eager fans. Some professors were none too impressed with the event.\n\nKanye West, flanked by wife Kim Kardashian, kicked off the event at around 8 a.m., and attracting hundreds of students. The rapper performed his 2014 hit song “Jesus Walks” and spoke about Christianity and the plight of African Americans.\n\nThough many of the students were pleasantly surprised by West’s impromptu appearance, a handful of lecturers had choice words for him.\n\nGreg Carr, who serves as an associate professor at Howard’s University’s Afro-American Studies Department, suggested West should visit the school’s library following his performance.\n\n“I have some books for him,” Carr wrote on Twitter with the hashtag #TheMiseducationOfTheNegro.\n\nKeneshia Grant, an assistant professor of Political Science, tweeted: “This Kayne [sic] church thing makes me uncomfortable. There, I said it.”\n\nFrederick Joseph, author of The Black Friend, also bashed the rapper and attendees, writing: “Can’t blame Kanye anymore, he’s shown us who he is. Black people need to stop making space for his anti-Blackness.”\n\nThe professors’ harsh words aren’t the first directed at West and his Sunday Service.\n\nThe Metro Times reports: “Some Black critics have called West’s event “blasphemous,” pointing to the pricey “Church Merch” line of sportswear for sale at previous stops which includes items like a $225 sweatshirt emblazoned with the words “Holy Spirit” and $50 socks that say “Jesus Walks.” (After backlash, West removed his online “Church Merch” store). Others have called “Sunday Service” a “cult.””\n\nWest’s popup singers and musicians have made various appearances on Sundays since January including a stop in Dayton, Ohio, at a benefit event supporting the community affected by the mass shooting.\n\nLast week, thousands of people showed up to an outdoor shopping center in Utah to see the rapper perform what he calls a worship service.\n\nThe concert was held right before the Church of Jesus Christ of Latter-day Saints held its twice-yearly conference in Salt Lake City.\n\nAfterward, the Salt Lake Tribune reported that West prayed and testified to the crowd about his religious journey.\n\nHe also talked about politics and what he called the dangers of social media. The Deseret News reported that between 7,000 and 10,000 people attended the event.", "description": "Hip-hop superstar and fashion designer Kanye West on Saturday hosted his Sunday Service at Howard University, one of the country's most prominent historically black colleges, and he drew hundreds of eager fans, some professors were none too impressed with the event.", "authors": ["Joshua Caplan"], "top_image": "https://media.breitbart.com/media/2019/10/kanyewestprof1-640x335.jpg", "published_at": "2019-10-14"}