{"pub": "reuters", "url": "https://reuters.com/article/uk-britain-eu/mps-cannot-be-surprised-by-brexit-anger-johnsons-adviser-idUSKBN1WC0U5", "downloaded_at": "2019-09-27 11:35:39.476128+00:00", "title": "MPs cannot be surprised by Brexit anger - Johnson's adviser", "language": "en", "text": "LONDON (Reuters) - Prime Minister Boris Johnson’s most senior adviser has said British politicians should not be surprised by the mounting anger over Brexit and said the atmosphere will get ever more toxic unless the result of the referendum is delivered.\n\nFILE PHOTO: Dominic Cummings, special adviser for Britain's Prime Minister Boris Johnson, walks for a cabinet meeting in Downing Street, London, Britain September 10, 2019. REUTERS/Toby Melville/File Photo\n\nParliament, locked in a three-year battle over how, if or when the country should leave the European Union, reached boiling point on Wednesday when Johnson and his opponents spent hours hurling allegations of betrayal and deceit across the chamber of the House of Commons.\n\nOpposition MPs accused Johnson of stoking hatred and cast him as a cheating dictator. One called him a liar. Johnson dismissed death threats against female MPs as “humbug” and accused his opponents of “surrender” to European leaders.\n\nBritain’s leading bishops said on Friday this behaviour must stop.\n\nBut Dominic Cummings, adviser to the prime minister and mastermind of the 2016 campaign to leave the EU, said MPs seeking to thwart Brexit should not be surprised by the reception they receive around the country.\n\n“If you are a bunch of politicians and you say that we swear we are going to respect the result of a democratic vote and after you lose you say ‘we don’t want to respect that vote’. What do you expect will happen?” Cummings said at a book launch on Thursday night, reported by the Daily Telegraph.\n\n“I find it very odd that these characters are complaining that people are unhappy about their behaviour now.”\n\nJohnson, the public face of the Vote Leave campaign, has also said that tempers need to calm down and that resolving Brexit would “lance the boil”.\n\nThe Conservative Party elected him as leader in July on his promise to break the impasse and take Britain out of the bloc by Oct. 31.\n\nBut he has faced defeat at every turn, losing his parliamentary majority, every vote in the legislature, and a groundbreaking case in the Supreme Court over his decision to suspend the assembly.\n\nThree years since Britons voted to leave the EU, the outcome remains mired in uncertainty with possible outcomes ranging from a departure with a new divorce deal, a no-deal exit, a second referendum, or no Brexit at all.\n\nCummings rejected a suggestion that the government would back a “soft Brexit” - one that keeps Britain more closely aligned to EU rules - in order to get a deal by Johnson’s October deadline.\n\nDespite the uncertainty and turmoil, Cummings said they were not under any pressure and the situation was far less difficult than winning the 2016 referendum.\n\n“This is a walk in the park compared to that. All the Vote Leave team, we are enjoying this, we are going to win, we are going to leave, don’t worry,” he said.\n\nCummings has been cast by allies as a ruthless strategist who cares little for the conventions of traditional British politics and by enemies as an anarchist.\n\nHe was found to be in contempt of parliament earlier this year for failing to appear before lawmakers investigating “fake news” and the referendum. He said he had offered to appear and give evidence.\n\nAlso on Friday, Church of England bishops called for respect on all sides of the Brexit argument, saying the language being used in the increasingly vitriolic debate was divisive and abusive.\n\n“We should speak to others with respect. And we should also listen,” the bishops said. “In the last few days, the use of language, both in debates and outside Parliament, has been unacceptable.”\n\nBREXIT OR ELECTION\n\nJohnson challenged his opponents on Wednesday either to bring down the government or get out of the way to allow him to deliver Brexit, something he has vowed to do by Oct. 31 whether or not he has agreed a withdrawal deal with the European Union.\n\nJean-Claude Juncker, the president of the European Commission, said he and the EU’s chief Brexit negotiator Michel Barnier were doing all they could to get a Brexit deal, and if they failed it would be Britain’s fault.\n\nWith the clock ticking down, opposition parties have forced through a law that would order the prime minister to ask Brussels for a three-month Brexit delay unless he can strike a deal. Johnson has labelled the law a “Surrender Bill” and said he will never ask for an extension.\n\nFILE PHOTO: Britain's Prime Minister Boris Johnson gestures as he speaks at the parliament, which reconvenes after the UK Supreme Court ruled that his suspension of the parliament was unlawful, in London, Britain, September 25, 2019, in this screen grab taken from video. Parliament TV via REUTERS\n\nThat has left critics hunting for any loophole the government could use to ignore the bill and take the country out of the bloc without a deal, something they fear would cause huge economic disruption.\n\nFormer prime minister John Major, who has condemned Johnson’s pugilistic approach to politics, warned on Thursday that the government may still try to use “political chicanery” to bypass the order for a delay.\n\nDavid Gauke, a former justice minister who was pushed out of Johnson’s Conservative Party after he voted against it over Brexit, said he believed the new law was watertight.", "description": "Prime Minister Boris Johnson's most senior adviser has said British politicians should not be surprised by the mounting anger over Brexit and said the atmosphere will get ever more toxic unless the result of the referendum is delivered.", "authors": ["Kate Holton", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190927&t=2&i=1434469025&w=1200&r=LYNXMPEF8Q0KG", "published_at": "2019-09-27"}