{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7592357/Strictly-Motsi-Mabuse-reduced-tears-Bayleys-emotional-dance.html", "downloaded_at": "2019-10-20 03:41:16.373933+00:00", "title": "Strictly: Motsi Mabuse is reduced to tears over Will Bayley's emotional dance", "language": "en", "text": "Strictly Come Dancing judge Motsi Mabuse was brought to tears by Will Bayley's performance with his pro partner Janette Manara on Saturday night's show.\n\nThe contenders performed their contemporary Couple's Choice routine after Will revealed he was diagnosed with cancer aged seven and also spoke about his arthrogryposis diagnosis.\n\nThe Paralympic table tennis player, 31, dedicated the routine to the patients and staff at Great Ormond Street Hospital before receiving a glowing response from the audience and judges.\n\nScroll down for video\n\nEmotional: Strictly Come Dancing judge Motsi Mabuse was brought to tears by Will Bayley's performance with his pro partner Janette Manara on Saturday night's show\n\nHe was given an overall score of 32 points, with Motsi so overcome with emotion that she was unable to talk.\n\nWill ran over and embraced her over the judges' desk, prompting wild cheers from spectators.\n\nAnd Alfonso Ribiero, who was failing in his attempt to fight back his own tears, said: 'You gave me chills. That was incredibly inspiring.\n\n'There will be young boys and girls who watch that routine and know anything is possible.'\n\nAmazing: The contenders performed their contemporary Couple's Choice routine after Will revealed he was diagnosed with cancer aged seven and also spoke about his arthrogryposis diagnosis\n\nCraig Revel Horwood added: 'Clear, emotional storytelling, an absolutely complete inspiration.\n\n'However, darling, you do need a little bit more free movement in your torso that will help you tell the story you can expand your chest a little bit more you can get a little bit more connection there.\n\n'But I thought the whole thing, like the anger part, you were hitting with punch, you were hitting with purpose, with form. It was great. Really, really good.'\n\nDame Shirley Bassey also gave the sports star a ringing endorsement, saying she found his performance 'inspiring'.\n\nYou need a hug: Will ran over and embraced an emotional Motsi over the judges' desk, prompting wild cheers from spectators\n\n'Well this is you. You came out here you shared your journey,' she said.\n\n'I'm sure every child in every children's hospital is looking at that today and has discovered that no matter what you put your mind to you can do it under extreme circumstances.'\n\n'I find it inspiring, you give the whole nation hope. It is just a beautiful number and just so well executed,' she added.\n\nWhen the pair went upstairs to reunite with their fellow dancers, Catherine Tyldesley was also in tears.\n\nEmotional: Alfonso Ribiero, who was failing in his attempt to fight back his own tears, said: 'You gave me chills. That was incredibly inspiring'\n\nWill Bayley had discussed his condition before the routine.\n\nHe said: 'I didn't think I'd struggle as much as I am with balancing. I had a great childhood but it was really challenging.\n\n'When I was seven years old I went to Great Ormond Street and they diagnosed me with Non Hodgkin's Lymphoma, as a seven-year-old to have cancer was so scary.\n\n'But the doctors and the nurses were so amazing. I had so much support and love around me.'\n\nTear-jerker: When the pair went upstairs to meet and reunite with their fellow dancers, Catherine Tyldesley was also in tears\n\n'It gave me so much confidence and made me who I am.'\n\nWill's arthrogryposis affects all four of his limbs and causes multiple curved joints from birth. It generally results in stiff joints and muscle weakness.\n\nWill learnt to play table tennis when his grandmother bought him a table following his cancer diagnosis.\n\nHe joined the local club at the age of 12 and went on to represent Kent's able bodied men's team before winning the gold medal at the 2016 Paralympic games.", "description": "The contenders performed their contemporary Couple's Choice routine after Will revealed he was diagnosed with cancer aged seven and also spoke about his arthrogryposis diagnosis.", "authors": ["Harry Howard For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/00/19939316-0-image-a-17_1571527695367.jpg", "published_at": "2019-10-20"}