{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7614249/Craig-Bellamy-explains-behaviour-Cardiff-City-academy-investigation.html", "downloaded_at": "2019-10-26 00:11:41.261713+00:00", "title": "Craig Bellamy explains his behaviour at Cardiff City after academy investigation", "language": "en", "text": "Craig Bellamy has apologised to the players and parents who accused him of bullying after the conclusion of Cardiff City's investigation into their former academy coach.\n\nThe club's internal probe began in January after Sportsmail revealed a complaint of bullying and xenophobia had been brought by a youth-team player.\n\nSeveral former academy players then came forward to make allegations against Bellamy and other coaches.\n\nCraig Bellamy is determined to move forward after the conclusion of Cardiff's investigation\n\nAfter a 10-month investigation the club admitted this week to 'failings' over safeguarding of teenage players and said they were subjected to 'an unacceptable coaching environment'.\n\nBellamy temporarily stood down from his role as Under-18s coach in January and left Cardiff in June to take up a position as Anderlecht Under-21s boss.\n\nAnd, in light of the club's findings, he has now apologised for any offence caused.\n\n'My only aim was to produce winners and if I upset any young players or their parents or if I was insensitive in any way towards their feelings, then that was never my intention,' said the 40-year-old.\n\nHOW WE TOLD YOU FIRST Sportsmail broke the story on January 1, detailing how the accusations had been levelled at former Cardiff and Liverpool man Bellamy. We revealed how an official complaint was in the hands of chairman Mehmet Dalman, and that chief executive Ken Choo would be examining the case immediately.\n\n'If I inadvertently offended anyone then I am truly sorry. I have probably relied too much on my own life experiences playing under some of the best coaches in the world, rather than assessing the sensitivities of a new generation of players.\n\n'As a player and now as a coach, self-improvement was always my aim. My love for coaching has not for a moment been diluted, but I accept the report highlighted aspects of my coaching skills that could perhaps be improved.\n\n'Whilst I have always categorically denied and disputed the allegations against me, the whole process was still very difficult to deal with and has resulted in a long period of self-reflection.'\n\nIn a personal statement Bellamy confirmed he isn't the subject of any disciplinary proceedings\n\nBellamy, who says he is willing to take 'additional recommended training', added: 'The allegations of bullying and xenophobic behaviour made against me were difficult for me to come to terms with as I deplore bullying and any form of discrimination.\n\n'I am not the subject of any disciplinary proceedings which, of course, comes as an immense relief to me.\n\n'My job is to develop promising young players and to build a winning team, ensuring that the young players reach the very pinnacle of their abilities.\n\n'I will strive for continuous personal improvement and development to ensure I become the best coach that I can be.\n\n'Finally, I would like to thank my family and all the players and their families that have supported me and cooperated with the full and lengthy investigation.\n\nBellamy, who stood down during the investigation, is now coaching at Anderlecht's academy\n\n'I would like to thank Cardiff City and particularly the loyal supporters who have been unwavering in their support and also the players, their families and all the staff and owners at Anderlecht FC, who have shown faith in me and who have supported me during the last few months.\n\n'The support that I received was the only reason that I decided to carry on in football and as a coach. My focus now is to continue in the job and the sport that I love.'", "description": "Craig Bellamy has apologised to the players and parents who accused him of bullying after the conclusion of Cardiff City's investigation into their former academy coach.", "authors": ["Craig Hope For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/16/20186080-0-image-a-18_1572016964953.jpg", "published_at": "2019-10-25"}