{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7547121/Victorias-Secret-shops-New-York-London-feature-transgender-model-window-time.html", "downloaded_at": "2019-10-09 12:49:21.758131+00:00", "title": "Victoria's Secret shops in New York and London to feature transgender model in window for FIRST time", "language": "en", "text": "Victoria Secret is making strides to celebrate diversity in femininity with a new collaboration featuring a transgender model.\n\nWorking in partnership with fellow lingerie brand Bluebella, it will showcase transgender model May Simón Lifschitz, 24, in the windows of its London and New York stores this Friday.\n\nIt's part of Bluebella's #LoveYourselfCampaign, which aims to celebrate female empowerment.\n\nThe brand's Autumn/Winter 2019 collection will be worn by May and fellow models Olivia Sang, Laura Rakhman-Kidd and Ali Tate Cutler, whose diverse bodies represent different aspects of femininity.\n\nFrom mid-October, images of diverse bodies will adorn the Victoria's Secret London home and its flagship store in the Big Apple in a move that comes after years of backlash over the brand's lack of inclusivity - and, more recently, merciless comparisons to Rihanna's wildly-successful Savage x Fenty fashion show.\n\nMay Simón Lifschitz, 24, stars in lingerie line Bluebella's collaboration with Victoria's Secret, and will feature in the brand's store windows in New York and London from Friday\n\nFrom left to right: May, next to Olivia Sang, Laura Rakhman-Kidd and Ali Tate Cutler. The four women showcase different bodies, ethnicities and ethos in the campaign\n\nMay, who was born to a Danish mother and Argentine father, said she was overjoyed at the idea of participating in the campaign, and shared that she felt 'liberated' while posing for the posters.\n\n'By expressing vulnerability in general, I think we can help each other become stronger feminine beings,' she said.\n\n'So I am very grateful that I have been given the chance to share and I feel very lucky for being part of a project with so much love in it.'\n\nThe model added that she felt empowered by her modeling career and other job opportunities.\n\n'I do feel strong in my position these days, and that I have something to share. And if you have the energy and power to make other people feel stronger about themselves by you yourself feeling strong, then you truly should share that gift,' she said.\n\nMay started taking anti-testosterone hormones aged 16, when she started getting work as an androgynous model, and transitioned shortly after, making the cover of several publications in her native Denmark.\n\nMay (pictured) said she felt very grateful to be part of the campaign, which celebrates diversity\n\nThe campaign's photographs will be showcased in Victoria's Secret London and the New York city store from Friday. Pictured left to right: Ali, May, Olivia and Laura\n\nShe explained: 'I could suddenly move through spaces and be acknowledged as a feminine creature, acknowledged for the psyche that comes with being on that side on the spectrum.\n\n'I will never be 100 per cent happy with my body, like any other woman. But I choose to remind myself that I don’t need to \"fix\" myself constantly in order to reach that sense of love towards myself.'\n\nThe campaign will also feature a US size 14 model - a first for Victoria's Secret.\n\nBody positivity activist Ali Tate Cutler said she hoped her involvement in the campaign would pave the way for plus-size women in the future.\n\nShe said: 'I have been the size I am now since second grade and I felt very insecure.\n\n'When I first starting doing shoots I would look for fat rolls, but the more I modelled the more I felt less shame about my body and when I see a fat roll now I now think it looks cute. I feel free.'\n\nMay, who kickstarted her transition aged 16 said it felt good to be acknowledged as a woman in her industry\n\nAfter being criticised for its lack of diversity, Victoria's Secret made a U-turn, with this collaboration with Bluebella\n\nOlivia and May posing together for the campaign. May said she felt 'strong' in her position and career\n\nWhile sharing the news of her latest campaign on Instagram, Cutler praised Victoria's Secret for taking a 'step in the right direction' with the shoot, while revealing that she is the first woman of her size to ever pose for the brand.\n\n'I believe I’m the first size 14 on @victoriassecret?' she wrote. 'Regardless I’m pretty stoked to work with a brand I idolized when I was a teen. Great step in the right direction for bodies.'\n\nShe added in an interview with E! News: 'Size 14 is actually the average size of women in America and I do think that we need to see more of it in media and fashion because most women are that size. So, we need to be accurately represented in brands and media,' she said.\n\nWhile the models are not employed by Victoria's Secret itself, it is a step forward for the lingerie giant which has been repeatedly criticised for its lack of diversity by consumers and activists.\n\nLast year the brand's chief marketing officer, Ed Razek, implied Victoria's Secret would never hire transgender or plus-size models in order to stay true to its 'fantasy' - but quickly backtracked when faced with an international backlash.\n\nIn August Valentina Sampaio, from Brazil, became the first Victoria's Secret transgender model, and is set to pose for the label's Pink campaign.\n\nMay said she felt empowered by a campaign that let her showcase her body, and added she is still learning to be ok with it, just like any other woman\n\nBody positivity activist Ali Tate Cutler said she hoped her involvement in the campaign would pave the way for plus-size women in the future\n\nFrom left to right: May, Olivia and Laura embody confidence in the new collaborative campaign\n\nLadies in red: May and Laura (pictured) sport some very daring numbers in the new diverse campaign\n\nThe new partnership is the brand's latest attempt to revive its ailing company, which has faced stiff competition from newer lingerie brands with more inclusive marketing strategies aimed at women of all shapes, sizes, and skin tones.\n\nRihanna's wildly successful Savage X Fenty lingerie line is among the brands that have given Victoria's Secret a run for its money in recent years.\n\nThe singer's second annual Savage x Fenty runway show streamed exclusively on Amazon Prime Video on September 20, a little over a week after it was filmed at Barclays Center in Brooklyn during New York Fashion Week.\n\nNumerous headlines purported that the diverse spectacular, which featured musical performances, dancers, and a wide representation of models, had 'killed' Victoria's Secret.\n\nThe nine-time Grammy winner kicked off her hour-long New York Fashion Week presentation with a sultry choreographed dance number.\n\nVogue called the slickly-staged performance art 'the event of the year' thanks to a large cast of models representing all genders, ages, and sizes.\n\nOut Magazine said Riri's 16-month-old lingerie label was the 'queerest show' thanks to catwalk appearances from Laverne Cox, Isis King, Cara Delevingne, and Aquaria.\n\nAnd bisexual pop star Halsey was among the onstage performers, which included Migos, Normani, DJ Khaled, Big Sean, Tierra Whack, and A$AP Ferg.\n\nValentina Sampaio, from Brazil (pictured) is the first transgender model to join the Victoria's Secret Pink campaign\n\nOlivia Sang, looking laid back in a silky purple pair of pyjamas from the brand's loungewear collection\n\nMay and Olivia posing together for the campaign, which will be featured in the Victoria's Secret London store and its New York flagship store from Friday\n\nRihanna's 'Navy' legion of fans tweeted mostly about the elephant in the room: the Victoria's Secret Fashion Show, which was canceled this year due to low ratings.\n\nVictoria's Secret has quietly been trying to turn the tide by hiring a slightly curvier cast, though it's unclear which models Cutler was referring to when she said she wasn't the first plus-size woman to work with the brand.\n\nWhen the retailer announced earlier this year that Barbara Palvin would become one of its newest Angels, some tried to claim she was the brand's first 'plus-size' campaign star.\n\nAt 5'9\" with a 24-inch waist, the 26-year-old Hungarian model is far from plus-sized. However, she is more curvaceous than the brand's standard models, leading some to believe that the company was finally listening to public outcry over its lack of inclusivity.\n\nSpanish beauty Lorena Duran was dubbed Victoria's Secret's 'first curvy model' when she signed with the brand in April. Some went as far as calling her the brand's first plus-size model, though she is relatively thin and describes herself as curvy.", "description": "Lingerie brands Victoria's Secret and Bluebella have partnered up for a campaign celebrating female diversity. Danish transgender model May Simón Lifschitz is headlining the campaign.", "authors": ["Claire Toureille For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/09/19433922-0-image-a-11_1570524007524.jpg", "published_at": "2019-10-09"}