{"pub": "nymag", "url": "https://vulture.com/2019/10/national-book-awards-2019-finalists.html", "downloaded_at": "2019-10-08 15:02:14.397550+00:00", "title": "National Book Awards Announce 2019 Finalists", "language": "en", "text": "Photo: Vulture\n\nAh, fall, the perfect time to curl up with your favorite hot beverage and catch up on all the best books of the year. The National Book Awards know this; today, they’ve announced their finalists across five categories — the 25 books to move to the top of your stack. Just two of the writers on this year’s list have been previous finalists, and both are in young people’s literature — Jason Reynolds and Laura Ruby. Among the other nominees are four debuts — Kali Fajardo-Anstine’s short story collection Sabrina & Corina and Julia Phillips’ novel The Disappearing Earth in fiction, along with Sarah M. Broom’s memoir The Yellow House and Albert Woodfox’s memoir Solitary (with Leslie George, also a debut writer) in nonfiction. The translated literature category, now in the second year of its current incarnation, recognizes work translated from Arabic, French, Hungarian, Japanese and Finnish (including international sensations László Krasznahorkai and Yoko Ogawa).\n\nThe longlists came out last month, and if you’re keeping score, a few notable picks didn’t make the latest cut, including Taffy Brodesser-Akner’s debut Fleishman Is in Trouble (currently being adapted into an FX limited series), Ocean Vuong’s debut novel On Earth, We’re Briefly Gorgeous (which just earned the writer a MacArthur “Genius” Grant), previous winner Colson Whitehead’s novel The Nickel Boys, and Hanif Abdurraqib’s fanboy essay collection Go Ahead in the Rain: Notes to A Tribe Called Quest. Among the happy finalists are Vulture subjects Susan Choi (for her Rashomon-like teen #MeToo saga Trust Exercise) and Marlon James (whose Black Leopard, Red Wolf, is being adapted into a film by Michael B. Jordan). We won’t learn the winners until the ceremony on November 20, leaving you plenty of time to study up. Your reading list is below.\n\nFiction\n\nSusan Choi, Trust Exercise\n\nHenry Holt and Company/Macmillan Publishers\n\nKali Fajardo-Anstine, Sabrina & Corina: Stories\n\nOne World/Penguin Random House\n\nMarlon James, Black Leopard, Red Wolf\n\nRiverhead Books/Penguin Random House\n\nLaila Lalami, The Other Americans\n\nPantheon Books/Penguin Random House\n\nJulia Phillips, Disappearing Earth\n\nAlfred A. Knopf/Penguin Random House\n\nNonfiction\n\nSarah M. Broom, The Yellow House\n\nGrove Press/Grove Atlantic\n\nTressie McMillan Cottom, Thick: And Other Essays\n\nThe New Press\n\nCarolyn Forché, What You Have Heard is True: A Memoir of Witness and Resistance\n\nPenguin Press/Penguin Random House\n\nDavid Treuer, The Heartbeat of Wounded Knee: Native America from 1890 to the Present\n\nRiverhead Books/Penguin Random House\n\nAlbert Woodfox with Leslie George, Solitary\n\nGrove Press/Grove Atlantic\n\nPoetry\n\nJericho Brown, The Tradition\n\nCopper Canyon Press\n\nToi Derricotte, “I”: New and Selected Poems\n\nUniversity of Pittsburgh Press\n\nIlya Kaminsky, Deaf Republic\n\nGraywolf Press\n\nCarmen Giménez Smith, Be Recorder\n\nGraywolf Press\n\nArthur Sze, Sight Lines\n\nCopper Canyon Press\n\nTranslated Literature\n\nKhaled Khalifa, Death Is Hard Work\n\nTranslated from Arabic by Leri Price\n\nFarrar, Straus and Giroux/Macmillan Publishers\n\nLászló Krasznahorkai, Baron Wenckheim’s Homecoming\n\nTranslated from Hungarian by Ottilie Mulzet\n\nNew Directions\n\nScholastique Mukasonga, The Barefoot Woman\n\nTranslated from French by Jordan Stump\n\nArchipelago Books\n\nYoko Ogawa, The Memory Police\n\nTranslated from Japanese by Stephen Snyder\n\nPantheon Books/Penguin Random House\n\nPajtim Statovci, Crossing\n\nTranslated from Finnish by David Hackston\n\nPantheon Books/Penguin Random House\n\nYoung People’s Literature\n\nAkwaeke Emezi, Pet\n\nMake Me a World/Penguin Random House\n\nJason Reynolds, Look Both Ways: A Tale Told in Ten Blocks\n\nAtheneum/Caitlyn Dlouhy Books/Simon & Schuster\n\nRandy Ribay, Patron Saints of Nothing\n\nKokila/Penguin Random House\n\nLaura Ruby, Thirteen Doorways, Wolves Behind Them All\n\nBalzer + Bray/HarperCollins Publishers\n\nMartin W. Sandler, 1919 The Year That Changed America\n\nBloomsbury Children’s Books/Bloomsbury Publishing", "description": "The National Book Awards have debuted their shortlists for awards in fiction, nonfiction, poetry, translated literature and young people’s literature. Winners will be announced on November 20.", "authors": ["Justin Curto"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/07/07-national-book-award-finalists.w1200.h630.jpg", "published_at": "2019-10-08"}