{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/24/WS5db0ea1aa310cf3e35572313.html", "downloaded_at": "2019-10-24 00:31:27.789011+00:00", "title": "Macao can play the role of an ideal offshore yuan center", "language": "en", "text": "By Shu Youjun | China Daily | Updated: 2019-10-24 08:02\n\n[Photo/IC]\n\nThe yuan has become the world's fifth-largest payment currency, third-largest currency for settling trade deals, eighth-largest foreign exchange currency and sixth-largest reserve currency. More than 60 countries' central banks or monetary authorities have incorporated the yuan in their foreign exchange reserves. Over 320,000 enterprises and more than 270 banks have launched cross-border yuan businesses, and 242 countries and regions have established cross-border yuan receipt and payment business with China. Which means the yuan's internationalization process is moving forward steadily.\n\nBut since the United States' trade war against China and the violent protests in the Hong Kong Special Administrative Region have affected the yuan's internationalization process, China has to build more stable offshore centers to facilitate its internationalization. For example, China could use the advantages of the Macao Special Administrative Region's offshore financial center to build an offshore yuan center and explore business in the Portuguese-speaking countries.\n\nThe cumulative population of the eight Portuguese-speaking countries that have diplomatic relations with China is more than 260 million while their total GDP is about $2 trillion. And in 2018, trade between China and Portuguese-speaking countries was worth $147.3 billion.\n\nChina's imports from Portuguese-speaking countries are remarkably higher than China's exports to those countries, which is conducive to promoting the yuan as a currency to settle foreign trade. Brazil's central bank has already signed a currency swap agreement with China's central bank, and the central banks of countries such as Angola, Mozambique and Cape Verde make official quotations in their national currencies with reference to the yuan, providing the basic condition for the yuan to enter their local markets.\n\nAnd since these countries appear intent on incorporating the yuan into their reserve currencies, the promotion of business between China and Portuguese-speaking countries could help Beijing explore new markets for facilitating the yuan's internationalization.\n\nMacao shares many traits, including language, syncretic culture and legal system, with Portuguese-speaking countries because of historic reasons, and therefore enjoys an advantage when it comes to building offshore yuan centers in those countries.\n\nBesides, the Macao SAR has a sound yuan clearing system, and the Monetary Authority of Macao supports the development of yuan business. In fact, building yuan clearing centers in Portuguese-speaking countries is one of the three major financial policies of Macao.\n\nMacao has all the yuan business channels that Hong Kong has; it has also implemented some innovative and pilot projects in yuan business. The Macao branch of the Bank of China dealt with the first cross-border financing business of China (Shanghai) Pilot Free Trade Zone and provided the first cross-border loan under the free trade account framework. And earlier this year, the Ministry of Finance issued 2 billion yuan ($175.67 million) worth of yuan treasury bonds in Macao for the first time.\n\nMacao has the right conditions and capability to be a sub-center of yuan business, as well as a backup platform for Hong Kong's yuan operations. As such, it will serve as an ideal center to develop a comprehensive cross-border yuan business system.\n\nIf trade between China and Portuguese-speaking countries rise continuously, China could promote the yuan as a trade settlement currency, which in turn would enable the yuan to play the role of an international currency in those countries. The authorities should therefore accelerate the construction of Macao as an offshore yuan center and establish a currency swap agreement between the Monetary Authority of Macao and the People's Bank of China, in order to provide liquidity support to Macao's yuan market.\n\nAlso, Macao's financial sector should accelerate the building of a China-Portuguese-speaking countries investment and financing platform to prompt those countries to use the yuan for investment and for financing projects.\n\nMoreover, the Macao SAR should encourage more local government enterprises to issue yuan bonds and urge Portuguese-speaking countries' enterprises to issue Panda Bonds through Macao's financial organizations, so as to connect the yuan-denominated market.\n\nThe author is a senior researcher at Asia Finance Think Tank and office director of the Bank of China, Macao Branch. The views don't necessarily represent those of China Daily.", "description": "The yuan has become the world's fifth-largest payment currency, third-largest currency for settling trade deals, eighth-largest foreign exchange currency and sixth-largest reserve currency. More than 60 countries' central banks or monetary authorities have incorporated the yuan in their foreign exchange reserves. Over 320,000 enterprises and more than 270 banks have launched cross-border yuan businesses, and 242 countries and regions have established cross-border yuan receipt and payment business with China. Which means the yuan's internationalization process is moving forward steadily.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/24/5db0ea1aa310cf3e97a2a93a.jpeg", "published_at": "2019-10-24"}