{"pub": "fox", "url": "https://foxbusiness.com/markets/goldman-sachs-joins-exodus-from-ken-fishers-firm-after-lewd-comments", "downloaded_at": "2019-10-25 16:24:22.483744+00:00", "title": "Goldman Sachs joins exodus from Ken Fisher's firm after lewd comments", "language": "en", "text": "Goldman Sachs became the latest firm to retreat from Fisher Investments this week, according to a person familiar with the matter.\n\nContinue Reading Below\n\nThe investment bank reportedly pulled $234 million from Ken Fisher’s firm, according to Bloomberg News, though the figure may grow.\n\nA spokesman for Goldman declined to comment.\n\nIn the two weeks since Fisher, 68, made lewd comments at a conference on Oct. 8, more than $2.7 billion has been withdrawn from Fisher Investments, including $500 million from the Los Angeles fire and police pension board.\n\nAt a financial services industry conference in San Francisco at the beginning of the month, the billionaire money manager compared winning wealthy clients to “trying to get into a girl’s pants,” Bloomberg reported. Despite a swift backlash, Fisher was slow to acknowledge that he had said anything wrong. He later apologized.\n\n\"Some of the words and statements I used during a recent conference to make certain points were clearly wrong, and I shouldn't have made them,\" he said in a statement to FOX Business. \"I realize this kind of language has no place in our company or industry.\"\n\nIn the ensuing days, pension funds in New Hampshire, Iowa, Michigan, Boston and Philadelphia withdrew from his firm.\n\nFisher Investments is based near Portland, Oregon and employs about 3,500 people.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE", "description": "The investment bank reportedly pulled $234 million from Fisher Investment.", "authors": ["Megan Henney"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Ken-Fisher-Getty.jpg?ve=1&tl=1", "published_at": "2019-10-25"}