{"pub": "businessinsider", "url": "https://businessinsider.com/what-is-a-good-interest-rate-on-a-credit-card", "downloaded_at": "2019-09-07 02:27:31.107902+00:00", "title": "What is a good interest rate on a credit card?", "language": "en", "text": "If you're credit-card shopping, one of the things you want to look at is the Annual Percentage Rate (APR) on the card. The interest rate on a credit card is expressed as an APR, and the rate you get approved for will depend on your credit score. But what is a \"good interest rate\" on a credit card? First let's look at some factors.\n\nWhat is a good interest rate on a credit card?\n\nIt's important to consider that the very best interest rates on a credit card are reserved for consumers with good credit. According to credit bureau Experian, a good credit score is 700 or above.\n\nIf you have a good credit score, you may be eligible for the most competitive rates. If your credit isn't so great, you might be approved for a higher rate, which is how the lender protects themselves against the risk of lending you money.\n\nThe range of APRs available can vary by credit card issuer, but a rate between 14.65% and 26.93% is typical, according to a report from U.S. News. According to CreditCards.com, the average APR on new credit cards is 17.68%.\n\nIt's also important to note that rewards credit cards tend to have higher APRs in general and typically are reserved for consumers with good credit. So the type of credit card you apply for can impact the APR range and what rate you get approved for.\n\nA good interest rate is a low interest rate\n\nA good interest rate on a credit card is a low interest rate. The lowest possible APR is 0%, which is typically advertised as a promotional offer for a credit card and only available for a specific amount of time. In many cases, these cards may be balance transfer credit cards, which are used to consolidate debt and save money on interest.\n\nIf you have an APR that is less than the average APR of around 17%, that can be considered a good interest rate. The lower the rate, the better the APR.\n\nBut what is considered good for you will depend on your credit history, credit score, and overall creditworthiness. The APR you get approved for is based on how creditworthy you are in the eyes of the lender.\n\nWhy interest rates matter (or don't)\n\nGetting a good interest rate on a credit card can save you a lot of money in interest — but only if you plan on keeping a balance on your credit card. If you pay off your balance in full each month by the due date, you'll never be charged interest and the interest rate won't really matter.\n\nHowever, if you need your credit card to make purchases that will be paid off over several months or years, then the APR is very important. Even just a few percentage points higher may result in spending hundreds or thousands more in interest.\n\nHow to get approved for the best rate\n\nIf you want to get approved for the best interest rate for a new credit card, you want to make sure your credit is in good shape. Having a strong credit score can help you unlock the best rates.\n\nIn order to maintain or improve your credit score, you want to be mindful of how much of a balance you are carrying. Though you may be approved for a certain amount on your credit limit, lenders like to see a credit utilization of less than 30%. In other words, you should keep your balances low and manageable.\n\nThe most important thing you can do is to repay your loans on time each month. Your payment history makes up about 35% of your credit score and is the top influencing factor.\n\nTaking these two steps and being cautious with opening new lines of credit or taking out additional loans may help.\n\nThe bottom line\n\nA good interest rate on a credit card can vary. If you have a strong credit score, you'll likely be approved for the best rates. If you don't have great credit, you might have a higher APR. But remember, your APR only matters if you carry a balance. If you can commit to paying off your balance each month, your APR won't cost you in the long run.\n\nRelated coverage from How to Do Everything: Money", "description": "What is a good interest rate on a credit card? The lowest APR you can possibly get — and that all depends on your credit score.", "authors": ["Melanie Lockert"], "top_image": "https://amp.businessinsider.com/images/5d71568d2e22af7ad32ee604-1920-960.jpg", "published_at": "2019-09-06"}