{"pub": "realclearpolitics", "url": "https://quillette.com/2019/10/18/the-defenestration-of-domingo", "downloaded_at": "2019-10-21 13:10:56.403519+00:00", "title": "The Defenestration of Domingo", "language": "en", "text": "The #MeToo movement has ended the U.S. career of legendary 78-year-old Spanish tenor Placido Domingo, one of classical music’s greatest ambassadors and impresarios. For nearly half a century, Domingo’s intense stage presence and warm, soaring voice captivated opera audiences; during the 1990s, he reached millions of new listeners as a member of the itinerant Three Tenors. In recent years, long after most singers have retired from the stage, he has continued a grueling international performance schedule, now singing baritone roles with remarkable pitch control and legato.\n\nDomingo’s entrepreneurial drive has been as untiring as his stage career. He was pivotal in creating Los Angeles’s first full-time opera company, LA Opera, the culmination of two decades of artistic diplomacy in Southern California. As LA Opera’s general director, he wooed philanthropic support from philistine Hollywood and the city’s political class. In 1993, he founded the international opera competition, Operalia, one of several institutions he has established to promote young singers. He led the Washington National Opera as general director from 1996 to 2011, and his conducting career has spanned opera pits and concert stages around the world.\n\nHe has championed the unjustly neglected Spanish opera form, Zarzuela, which he sang growing up in Mexico City, and his charitable endeavors have extended beyond classical music; he led fundraising for Mexico City following its catastrophic earthquake in 1985. Testimonials to his kindness, generosity, and bottomless work ethic abound. Helga Rabl-Stadler, the president of the Salzburg Festival, the most important classical music gathering in the world, recently praised Domingo’s “appreciative treatment” of festival employees: “He knows every name, from the concierge to the secretary; he never fails to thank anyone performing even the smallest service for him.”\n\nOn August 13, 2019, however, the AP announced that nine females, all but one anonymous, were accusing Domingo of making unwanted sexual advances decades ago. The accusers—chorus singers, a few small-time soloists, and one ballet dancer—alleged wet kisses, solicitations to rehearse at his apartment, whispered blandishments while on stage, a hand down a shirt or up a skirt in cabs, and persistent phone calls.\n\nThe latest of the incidents allegedly occurred in the early 2000s; most dated from the 1980s and 1990s. Some of the accusers had had voluntary sexual liaisons with the singer, yet still asserted victimhood. An anonymous singer with LA Opera claimed that in 1998, after they kissed on his couch, he undressed her in his bedroom for a session of “heavy petting” and “groping.” A mezzo soprano in the chorus of LA Opera slept with Domingo in 1991 at the Biltmore Hotel in downtown Los Angeles and at his apartment. After those two encounters, she cut off physical contact. The one named accuser, soprano Patricia Wulf, said that he never touched her, but used to whisper in her ear backstage: “Do you have to go home tonight?”\n\nBy all accounts, Domingo backed off when told explicitly to do so. None of the accusers alleged quid pro quo pressure to have sex in exchange for a role. Some alleged that their careers plateaued after they broke off relations, without providing any evidence that he was responsible or that their careers were still on an upward trajectory. Nevertheless, the claim that he sometimes “professionally punished those who rejected him,” in the words of the New York Times, has now become a standard feature of the anti-Domingo narrative.\n\nThe AP story rocketed around the world. Domingo issued a statement claiming that the allegations “as presented” were “inaccurate,” while acknowledging that “standards” have changed. Without waiting to hear more, the Philadelphia Orchestra booted him from its season-opening gala because, it said, it was “committed to providing a safe, supportive, respectful, and appropriate environment for the orchestra and staff, for collaborating artists and composers, and for our audiences and communities.” The San Francisco Opera also cancelled Domingo’s upcoming engagements. LA Opera launched an investigation and suspended Domingo from day-to-day management. The Metropolitan Opera, where Domingo was scheduled to sing the title role of Verdi’s Macbeth in September, announced that it would await the Los Angeles investigation’s outcome before deciding Domingo’s fate.\n\nOn September 5, 2019, the AP published a follow-up, based on another 11 accusers; all but one of whom were again unnamed. (Oddly, the original August 13 AP story seems to have been scrubbed from the site, and the September 5 report has been replaced at the same url with a September 7 story about the same topic.) The named accuser, Angela Turner Wilson, a former soprano with the Washington National Opera, claimed that in 1999—that would be 20 years ago—Domingo grabbed her breast in a dressing room. Before the alleged breast-fondling incident, Domingo had badgered Wilson for dinners, for pre-performance good luck kisses, and for trips to his apartment to talk about possible roles, she says. The AP revealed little about the other ten accusers’ stories. A former tech assistant with the LA Opera did say that Domingo once backed her into a wall, grasped her hand, and whispered in her ear as her male boss looked on, but it impossible to say whether this was sinister or innocuous because we are not even told what Domingo is alleged to have said.\n\nIn response to the second AP article, the Dallas Opera pulled the plug on its March 2020 gala, in which Domingo was to have starred. LA Opera administrators told staff via email how “very troubled” they were by ongoing AP allegations against Domingo, and echoed the Philadelphia Orchestra’s “safety” rhetoric: “We believe all our employees and artists should feel valued, supported and safe.” The Washington National Opera said it was “disturbed and disheartened” by the new allegations.\n\nThe AP had spent two years trying to get sources to talk about Domingo; a feminist music critic had also been on the hunt but abandoned the project for lack of cooperating witnesses. After the AP’s persistence finally paid off, other outlets scrambled to catch up. NPR was particularly aggressive but the well of complainants with first-hand experience of Domingo’s womanizing had apparently run dry. Nevertheless, on Friday, September 20, NPR ran a story headlined “Met Opera Faces ‘One More Catastrophic Crisis’ As Employees Must Work With Domingo.” The piece was based on four anonymous sources at the Metropolitan Opera, where the Domingo-starring Macbeth was set to open in a few days.\n\nNone of NPR’s four sources had experienced any misconduct from Domingo. But Domingo’s overtures to certain women were “common knowledge,” they said; some females allegedly avoided one-on-one situations with the singer. One anonymous orchestra member said that another instrumentalist was calling in sick to avoid working with Domingo; the anonymous orchestra source felt “livid” about having to perform in his presence. “I feel queasy in the pit during rehearsals, seeing him onstage,” she said. (Nausea is a recurrent accompaniment to feminist outrage: in 2005, MIT biologist Nancy Hopkins reported fleeing a conference room to avoid throwing up, after Larry Summers, then Harvard University’s president, suggested that the different distribution curves of the very highest level math skills among males and females may be part of the explanation for the lack of 50-50 sex parity in abstract STEM fields.)\n\nThe day after the NPR story, Saturday, September 21, was the dress rehearsal for Macbeth, which I attended. Domingo received warm applause on his first entrance from the Met Patrons in the audience, if not the defiant standing ovation he received after Verdi’s Luisa Miller in Salzburg in August—but admittedly the critical mass needed for such rapturous collective response was missing in the mostly empty Met hall. Domingo sang confidently and accurately, poignantly conveying Macbeth’s alternation between brutal ambition and gnawing remorse. His co-superstar, Russian soprano Anna Netrebko, had posted her support for Domingo on Instagram after the first AP story, pointedly saying how much she was looking forward to their Met engagement together. Netrebko was a blazing Lady Macbeth, ruthlessly egging on her partner to ever more bloody deeds, and her duets with Domingo were charged and headstrong.\n\nThe next Monday, September 23, two days before the opening, NPR published a follow-up story, based on four “long-time Metropolitan employees”—presumably the same four anonymous sources for NPR’s story three days earlier. They described a heated meeting between Met General Manager Peter Gelb and orchestra and chorus members after the Macbeth rehearsal, in which Gelb tried to explain to skeptical staffers why Domingo was still singing at the house. Women’s voices were not listened to, the staffers allegedly complained.\n\nBy the next day, on the eve of the Macbeth opening, Domingo was out. He and the Met issued dueling press releases in which each party claimed that it had made the withdrawal decision. Domingo thanked the Met’s leadership for “graciously granting” his request to withdraw from the production; the Met said that Domingo had “agreed to withdraw from all future performances . . . , effective immediately.” Lest there were any ambiguity about the scope of his withdrawal, Domingo’s press release said that he considered the Macbeth dress rehearsal his “last performance on the Met stage.”\n\nA week later, Domingo’s entire U.S. career was over. He announced that he was resigning his directorship of LA Opera and pulling out of all future performances there. Even the tiny Chapman University south of Los Angeles, which enjoys a modestly conservative reputation, had pushed Domingo out of what would have been a PR windfall for its performing arts center: a concert performance in February starring Domingo in Donizetti’s Roberto Devereux. Domingo’s resignation letter graciously stated: “I hold Los Angeles Opera very dearly to my heart and count my work to create and build it as among my most important legacies.” But recent accusations against him in the press had created an atmosphere in which his ability to serve “this company that I so love,” he wrote, had been compromised. The company’s president, Christopher Koelsch, offered his “deep thanks” to Domingo, and noted that the institution was strong financially and “flourishing creatively.” But Koelsch also engaged in the by then de rigueur chest-beating about his employees’ feelings, which he implied the company had failed to protect: “I am committed to a vigorous process of reflection and reform. . . . We will fall short of our goals unless every member of our community feels heard, valued and respected. I am committed to ensuring that they do.”\n\nMeanwhile, the story was shifting yet again. Just as it had become received wisdom, contrary to any reported facts, that Domingo retaliated against females who rebuffed him, it is now suggested that LA Opera failed to respond to harassment allegations, even though no one has reported making such allegations to management.\n\nThe gloating was immediate. Debra Katz, a high profile sex discrimination lawyer who represents Patricia Wulf, announced that Domingo’s resignation from LA Opera was “an important and welcome step in the effort to end sexual misconduct by powerful men in the opera industry.” Katz had failed to keep Brett Kavanaugh off the Supreme Court on behalf of another client, Christine Blasey Ford, so Domingo’s scalp must have been a welcome consolation prize. Katz had earlier lit into Peter Gelb for his failure to cave immediately to the pressure to eject Domingo from the Met stage. The “more than 20 women who were sexually harassed by Mr. Domingo” deserve the public and the arts world’s “respect and appreciation” for their “pain and indignity,” Katz told Gelb in a letter, not the “victim shaming” that Gelb had allegedly engaged in by stating that the allegations against Domingo were uncorroborated. Patricia Wulf presented herself as a heroic whistleblower: “I feel at peace knowing that speaking publicly is leading to changes that will hopefully protect the next generation of women in the industry.”\n\nThere are three possible justifications for Domingo’s scourging, each more unpersuasive than the last. The first is to punish his past behavior. But his alleged infractions occurred decades ago, making punishment too belated to be just or meaningful. None of his accusers brought their objections to anyone in authority. If they wanted to punish him, that would have been the time to do so. Now, the overwhelmingly anonymous nature of the accusations and the passage of time prevent Domingo from mounting a defense. Some of the alleged incidents were undoubtedly more ambiguous than the accusers are disclosing. But without a known accuser, Domingo cannot establish the facts of these incidents, even if he could remember what may have been a fleeting and misunderstood gesture.\n\nThe second justification is a symbolic one: to demonstrate feminist solidarity. According to the New York Times, the Metropolitan Opera needed to show its “commitment” to “protecting women and rooting out sexual harassment” by ejecting Domingo. But such expressions of piety should not take precedence over getting the facts right, and none of the institutions that pushed Domingo out the door established any factual record.\n\nThe third justification is the most frequently invoked: safety. Domingo’s mere presence in an opera house or concert hall allegedly puts the safety of that venue’s female employees at risk. The threat extends beyond the stage. It sinks into the orchestra pit like a miasma. It overflows into the audience and the surrounding community. You can be in the top tier of the Philadelphia’s Kimmel Hall or miles out on the Main Line, and still at risk of the toxic effects of Domingo’s masculinity, according to the Philadelphia Orchestra. The threat extends across the entire music world. In August, the American Guild of Musical Artists, the union representing opera soloists, choristers and ballet dancers, announced it would “closely monitor the situation,” and was “making the safety of our members our first priority.”\n\nThis idea that Domingo poses a current risk to females even in his immediate orbit is pure hysteria. Domingo is a near-octogenarian. The most recent allegations against him, even if they constituted an actual danger at the time, date from over 15 years ago. After those allegations belatedly surfaced, his every movement would have been under a microscope. Were Domingo still inclined at his age to make advances, it would have taken a suicidal recklessness to engage in any behavior that could be massaged into a harassment incident. But, for the sake of argument, let us assume that he let slip, even now, an appreciative glance or ambiguous compliment. Are we supposed to believe, in this era of “strong women,” that a female chorister is so vulnerable and weak that, faced with someone who is operating under a potential death sentence, she can’t simply rebuff an advance? Domingo’s 20 accusers somehow survived the trauma of being propositioned by one of the opera world’s most charismatic stars. Why would the trauma today be so much more lethal to require proleptically snuffing out a still fertile career?\n\nHere is the reality of Domingo’s world: It is shot through with sexual energy and tension. Performers and staff work long hours in an enterprise requiring the passion and willpower to conquer some of the most challenging works in the musical repertoire. Put males and females in any high-pressure, close-contact situation, and Eros will make an immediate appearance—just ask the spouses of lawyers in white shoe law firms or of soldiers in gender-integrated Army barracks. In the performing arts, filled with oversized personalities and appetites, the erotic currents are particularly headstrong. Females threw themselves at Domingo. Young fans pled with his assistants to get their phone numbers into his hands. Wealthy socialites tried to arrange affairs. Singers sought out liaisons. Many of their advances were unwelcome. Does that make his suitors harassers? This kind of female behavior is routinely excised from the #MeToo narrative that presents a world apparently composed exclusively of male rapists and female victims, and which declines to acknowledge the billions of dollars that women invest annually in make-up and clothes they hope will make them more desirable to the opposite sex.\n\nAs the object of so much sexual attention, Domingo could have been forgiven for thinking that his own advances were part of the mix. He clearly belongs to the “Latin Lover” prototype, a good-natured, charming seducer from the old Hollywood era. Learning to deal with such types used to be part of a woman’s skill set. The instigator of a sexual advance does not know beforehand whether it will be wanted or not; he (or she) is taking a chance. It is up to the target of that advance to signal how it has been received. If the would-be seducer does not back off, the seducee needs to escalate to whatever level of explicitness is required, however uncomfortable it may be to elevate what is unspoken and ambiguous into the realm of language and clarity. Rebuffing an advance from a superior is particularly difficult. But, as noted, Domingo appears to have dropped his petitions when told to do so and did not exert quid pro quo pressure. If all else fails, avoidance is the fallback strategy: turning one’s head to avoid a kiss, or staying far enough away to avoid charged interaction.\n\nAn unwanted advance is not sexual assault, despite the fashionable conflation of the two. If persistent enough, such advances feel and may become harassing. But an alternative regime that puts the burden on the sexual petitioner to proceed only when certain of a positive reception would result in no sexual overtures at all, since such advances are, by definition, uncertain. It is doubtful that the average female would want to live in a world where males remain chastely aloof until overtly invited to engage.\n\nIt is a grotesque inversion of the proper hierarchy between public accomplishment and private sexual behavior to sacrifice an artist of Domingo’s stature for the sake of 20 disgruntled bit players, laboriously harvested from thousands of professional interactions characterized by graciousness and consideration. Put simply, the discomfort of these belated accusers decades ago is not worth Domingo’s head. Civilization rests on the realm of public achievement in ideas, politics, and art. The private realm of Eros should be subordinate to the public realm; how someone behaves in or getting to the bedroom is irrelevant to his achievements in the public square, absent criminality. If we discovered that James Madison, say, was a skirt-chaser, that fact should have no bearing on his achievements as a political theorist and statesman.\n\nIt is part of the messiness of human existence that the public and erotic realms are not wholly distinct, and they have become even less so with the sexual integration of the workplace. The same drive for mastery that propels feats of public glory animates much sexual conquest as well.\n\nBut the brittle rigidity of contemporary feminism does not recognize nuance or shades of fault and responsibility. It has no tolerance for human diversity. Drunk on its own power, it is turning its massive armamentarium of narcissistic grievance on male success with an ever more neurotic standard of transgression. Italian tenor Vittorio Grigolo has been suspended from future performances at the Metropolitan Opera and Britain’s Royal Opera for allegedly sexually assaulting a ballet dancer in full view of the audience during a curtain call in Japan on September 18 of this year. Grigolo had just finished a performance in the title role of Gounod’s Faust, whose staging in the touring Royal Opera production called for a pregnant woman to offer Faust her belly to touch. During the curtain call, Grigolo light-heartedly patted that same dancer’s prosthetic paunch. The dancer protested. Grigolo told her to “fuck off,” by his own admission. The tenor says that he was offered no opportunity to apologize, but was “put on a plane and sent . . . home like a killer.” If such adrenalin-fueled post-performance hijinks now constitutes sexual assault, the show may no longer go on.\n\nFederal appellate judge Alex Kozinski was destroyed by a handful of former female clerks, including Slate columnist Dahlia Lithwick, for his juvenile sense of sexual humor. He is now a pariah throughout the legal world. “It’s a tragedy,” his fellow Ninth Circuit Appeals Court Judge Stephen Reinhardt (for whom I clerked) told me shortly before he died. “Alex was so smart, so decent.” Reinhardt was a crusading left-winger but he regarded the libertarian Kozinski as “one of the best judges we had.”\n\nMichael Steinhardt, pioneering Wall Street entrepreneur and now full-time philanthropist, was denounced on the front page of the New York Times for his patently unserious sexual banter, banter that reflected his obsession with maintaining the world’s Jewish population. His public appeal for forgiveness—”In my nearly 80 years on earth, I have never tried to touch any woman or man inappropriately. [Provocative comments] were part of my schtick since before I had a penny to my name, and I unequivocally meant them in jest. I fully understand why they were inappropriate. I am sorry”—was unavailing. A frenzy broke out, with Jewish foundations and religious leaders bemoaning the “harrowing . . . degradation” which female grant-seekers allegedly had to endure from this open-hearted benefactor.\n\nThe feminist nostrum that “the personal is political” was false from its inception. It has now become a warhead aimed at the edifice of a civilization deemed too male. Institutions like the Metropolitan Opera, LA Opera, or the Philadelphia Orchestra should be the prime defenders of that civilization. When, instead, they surrender to furious irrationality and sacrifice our greatest artists to avoid a wholly imaginary threat, they betray their most fundamental mission. I am cutting off my support for the Metropolitan Opera; other donors who care about our musical inheritance should do the same.\n\nAt least cowardice in the face of feminist grievance appears to be predominantly an Anglo-American affliction. So far, Domingo’s future engagements in Moscow, Vienna, Hamburg, Valencia, Milan, Cologne, Krakow, Berlin, Madrid, and Munich have not been cancelled. The director of the Vienna State Opera, Dominique Meyer, said over the summer that Vienna would honor its contracts with Domingo, who is “valued both artistically and as a human being by all in this house.”\n\nI will remember Domingo for his stage descent from the Met’s empyrean rafters as a silver-spangled Neptune, surrounded in a sea of cerulean blue by undulating mermaids and glittering sea creatures in The Enchanted Island, as the triumphant crescendo of Handel’s Zadok the Priest reaches its glorious peak. Domingo’s English in this Baroque pastiche was still, after all these years, hilariously accented, but his suave shaping of the vocal line pulsed with an inner rhythm. Domingo brought beauty into the world. He inspired and helped thousands of female singers and instrumentalists. His demise won’t placate the resentment brigades; it will only embolden them for the next hit.\n\nHeather Mac Donald is the Thomas W. Smith fellow at the Manhattan Institute and the author of The Diversity Delusion. You can follow her on Twitter @HMDatMI\n\nShare this: Pocket\n\nWhatsApp\n\n\n\nEmail\n\nPrint\n\n", "description": "", "authors": ["Heather Mac Donald", "Heather Mac Donald Is The Thomas W. Smith Fellow At The Manhattan Institute", "The Author Of The Forthcoming The War On Cops."], "top_image": "https://i0.wp.com/d24fkeqntp1r7r.cloudfront.net/wp-content/uploads/2019/10/17073225/5556885295_9bc4969280_k.jpg?fit=1200%2C800&ssl=1", "published_at": "2019-10-18"}