{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/5/fromm-helps-no-3-georgia-trounce-tennessee-43-14", "downloaded_at": "2019-10-06 03:13:24.646579+00:00", "title": "Fromm helps No. 3 Georgia trounce Tennessee 43-14", "language": "en", "text": "KNOXVILLE, Tenn. (AP) - Jake Fromm threw two touchdown passes, Georgia’s defense delivered a dominant second-half performance and the No. 3 Bulldogs recovered from a slow start to beat Tennessee 43-14 on Saturday night.\n\nGeorgia (5-0, 2-0 Southeastern Conference) scored the final 33 points to earn its 15th straight victory over Eastern Division opponent. Georgia capped the onslaught when Tae Crowder scored on a 60-yard fumble return with 4:39 left after Eric Stokes sacked Brian Maurer to knock the ball loose.\n\nThe Bulldogs haven’t lost to an SEC East team since falling 24-10 to Florida on Oct. 29, 2016.\n\nFromm went 24 of 29 for 288 yards. Rodrigo Blankenship made field goals from 50, 34 and 27 yards to improve to 11 of 11 this season. Brian Herrien and D’Andre Swift combined to run for 160 yards and each had a 1-yard touchdown run.\n\nGeorgia trailed for most of the second quarter before scoring two touchdowns in the final two minutes of the first half to grab a 26-14 lead at the intermission. Georgia stayed in command the rest of the way.\n\nTennessee (1-4, 0-2) has lost its last six matchups with Football Bowl Subdivision teams and is off to its slowest start since 1988, when it dropped its first six games. Tennessee’s lone win this season was a 45-0 blowout of Football Championship Subdivision program Chattanooga.\n\nBut the Volunteers made this one interesting for a while.\n\nTennessee freshman quarterback Brian Maurer made his first career start and sparked an offense that had stumbled and staggered through the first month of the season. After gaining just 239 yards in a 34-3 loss to No. 10 Florida two weeks ago, Tennessee matched that total by halftime Saturday.\n\nMaurer electrified the crowd on Tennessee’s second series as he executed a play-action pass to a wide-open Marquez Callaway, who made the catch around the Georgia 30 and raced to the end zone for a 73-yard touchdown.\n\nThe touchdown marked Tennessee’s longest pass completion since Joshua Dobbs connected with Josh Malone on a 75-yarder against Kentucky in 2015.\n\nMaurer gave Tennessee a 14-10 lead on the opening play of the second quarter with a 12-yard strike across the middle to Jauan Jennings.\n\nJennings had seven catches for 114 yards, and Callaway caught three passes for 105 yards. Maurer was 14 of 28 for 259 yards with an interception to go along with his two touchdowns.\n\nGeorgia took the lead for good 20-14 on Fromm’s 3-yard touchdown pass to Lawrence Cager that put with 1:59 left in the half. After Tennessee drove into field-goal range, Brent Cimaglia’s 47-yard kick sailed wide left with 59 seconds remaining, his first miss of the season after nine straight successful attempts.\n\nRather than running out the clock, Georgia marched down the field and extended it is lead on Fromm’s 7-yard touchdown pass to George Pickens with nine seconds left. An unsuccessful two-point conversion attempt made the halftime score 26-14.\n\nTennessee never threatened again.\n\nTHE TAKEAWAY\n\nGeorgia: The Bulldogs had to come from behind for a second straight game after erasing a halftime deficit in a 23-17 victory over Notre Dame two weeks ago. Georgia made some uncharacteristic mistakes early but showed the poise of a veteran team by regaining the momentum quickly. It helps to have a quarterback the caliber of Fromm, who hasn’t thrown an interception all season.\n\nTennessee: The quarterback change gave Tennessee an energy boost to start the game and enabled the Vols to outplay Georgia for the first 25 minutes or so. But the offense slowed down quite a bit in the second half and the defense couldn’t put any pressure on Fromm.\n\nUP NEXT\n\nGeorgia hosts South Carolina on Saturday.\n\nTennessee hosts Mississippi State on Saturday.\n\n___\n\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25\n\n___\n\nFollow Steve Megargee at https://twitter.com/stevemegargee\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Jake Fromm threw two touchdown passes, Georgia's defense delivered a dominant second-half performance and the No. 3 Bulldogs recovered from a slow start to beat Tennessee 43-14 on Saturday night.", "authors": ["The Washington Times Http", "Steve Megargee"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/05/georgia_tennessee_football_96608_c0-80-3600-2178_s1770x1032.jpg?a700023bc707a85d8d03f0bce6feacad6e1bca74", "published_at": "2019-10-05"}