{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/who-x-factor-celebritys-love-20566850", "downloaded_at": "2019-10-12 17:49:19.360570+00:00", "title": "Who is in X Factor: Celebrity's Love Island supergroup? The band mates are revealed", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Daily Love Island stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe X Factor: Celebrity kicks off tonight and it's certain to bring drama as a few Love Island favourites are set to debut on the hit show.\n\nThe spin-off to the original X Factor will see a host of famous faces competing to impress judges Simon Cowell, Nicole Scherzinger and Louis Walsh.\n\nFrom soap stars and influencers to reality TV favourites, there will be 14 acts taking to the stage.\n\nThe stars actually auditioned separately for the hit show, but were merged together as a band.\n\nBut who is in the Love Island supergroup? Here's what we know.\n\n(Image: ITV)\n\nWes Nelson\n\nThe 21-year-old starred in series four of ITV2's Love Island in 2018.\n\nThe reality star has already made a name for himself as he appeared on the 11th series of Dancing On Ice - and is now a star on Celebrity X Factor.\n\nIt was reported this week that Wes wasn't happy with the band name, and that there was \"tension\" between the group.\n\nHowever he told Mirror Online that they were \"joking around\".\n\nDespite this, it seems that the star is feeling particularly confident in himself.\n\nHe told MailOnline: \"I've had so many in the DMs when I've shared it on my stories like 'oh my God, I'm so happy you're doing it, you're finally doing something with your voice'\".\n\n(Image: Instagram)\n\nSamira Mighty\n\nThe reality star sensationally quit Love Island back in 2018, as she starred in the same series as band mate Wes.\n\nShe's 22 and a West End performer, so she will be showing off her musical talent in the celebrity edition of X Factor.\n\nSamira has previously starred in roles for Mamma Mia!, Beauty and The Beast and Dreamgirls before entering the villa - so it seems she has a pretty solid singing background.\n\n(Image: Mike Marsland/WireImage)\n\nZara McDermott\n\nThe Instagram sensation, 23, will be joining her co-stars as band mates for their debut on Celebrity X Factor.\n\nShe took part in Love Island 2018, and caught the eye of Geordie hunk Adam Collard.\n\nZara took to Instagram to announce the news of going on X Factor, and revealed she has been singing since she was around 11-years-old.\n\nThe star also told her fans that she has had severe stage fright since she was around 14.\n\nBut it seems the beauty has musical talent to be proud of.\n\nShe admitted to MailOnline: \"This is the most terrifying thing we've ever done.\"\n\n(Image: instagram)\n\nEyal Booker\n\nFinally, the last band mate, Eyal, who is 24, will reunite with the islanders as he too is in the band.\n\n(Image: PA)\n\nHe was a bit of a heartthrob on Love Island when he made an appearance on the 2018 show.\n\nEyal revealed he has already had a small taste of the limelight with pop band EverYoung which formed in 2012.\n\nHe told Digital Spy that it won't give him an advantage over his fellow celebrity contestants, though.\n\n*Celebrity X Factor launches tonight at 8:40pm on ITV", "description": "Four contestants from Love Island 2018 will battle it out to impress the X Factor judges - here's a list of the band mates", "authors": ["Brogan-Leigh Hurst", "Image", "Itv", "Instagram", "Mike Marsland Wireimage", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20566936.ece/ALTERNATES/s1200/0_SycoThames.jpg", "published_at": "2019-10-12"}