{"pub": "yahoo", "url": "https://news.yahoo.com/1-protest-leaders-ecuador-accept-182830584.html", "downloaded_at": "2019-10-13 11:41:58.634018+00:00", "title": "UPDATE 4-Talks on austerity emerge from unrest in Ecuador as capital on lockdown", "language": "en", "text": "* First round of negotiations scheduled for Sunday\n\n* Moreno orders military-backed curfew amid unrest\n\n* Chief protest group says will keep protesting (New throughout)\n\nBy Alexandra Valencia and Mitra Taj\n\nQUITO, Oct 12 (Reuters) - An indigenous group in Ecuador behind mass protests against cuts to fuel subsidies agreed to hold talks with President Lenin Moreno, who ordered a curfew in the capital on Saturday after the latest wave of violence in the city.\n\nThe announcement by the group, Conaie, was the first sign of a possible breakthrough in a dispute that has sparked national security concerns and cast doubt on Moreno's ability to carry out an austerity plan that is still in early stages.\n\nBut the group was angered by Moreno's decision to impose a military-enforced curfew in Quito and surrounding valleys shortly after it signalled its willingess to talk. He also ordered the armed forces to restore order nationwide, blaming unrest on extremists he said had infiltrated protests.\n\nConaie - an umbrella organization of indigenous groups across Ecuador - stopped short of calling off talks and said its members would continue to protest.\n\n\"There's no real dialogue without necessary guarantees\" of physical safety, Conaie said on Twitter.\n\nIn a late-night speech to the nation, Moreno defended the curfew and thanked indigenous leaders for being open to dialogue and said together they would look at the impact of a law he passed last week that ended a decades-old fuel subsidy.\n\n\"Whoever has the disposition to talk, we’ll do it. This process has made advances and I hope to give you good news soon,\" he said.\n\nHe did not indicate any plans to repeal the law, which has triggered a backlash and protests that have spun out of control.\n\nOn Saturday, the tenth day of marches scheduled in Quito, police and protesters clashed amid clouds of tear gas as vandals set fire to the comptroller's office and a TV station.\n\nRoads to Quito's airport were blocked and flights cancelled.\n\nLocal media reported violent protests in other parts of the country, including the coastal city of Guayaquil, where Moreno has moved his government for safety reasons.\n\nThe United Nations in Ecuador, which has offered to mediate talks to end the unrest, announced late on Saturday that a first round of dialogue with indigenous groups would be held in Quito on Sunday at 3 p.m. local time (2000 GMT). It did not say if Moreno and Conaie would take part.\n\n\n\n\n\nPUBLIC TALKS\n\nEarlier on Saturday, one of Conaie's leaders told TV channel Ecuavisa that one of the group's conditions for talks included making them public.\n\n\"We're not going to talk behind closed doors,\" Leonidas Iza said. \"There has to be large screens so every bit of input from our members is heard.\"\n\nMoreno, 66, has defended his decision to slash fuel subsidies as a key part of his bid to clean up the country's finances, after signing a $4.2 billion loan deal with the International Monetary Fund (IMF) earlier this year.\n\nBut the measure has pushed up prices on other products and opponents say it will hit the poor the hardest.\n\nProtesters have taken aim at the IMF and Moreno's turn to the right since being elected in 2017 as the left-leaning successor to Rafael Correa.\n\nFive people have been killed in the unrest since it began on Oct. 3 and nearly 1,000 wounded, according to the latest report the office of the country's ombudsman, which monitors conflicts. More than a 1,100 people have been arrested.\n\nIt was unclear what impact the curfew had after it went into effect at 3pm (20:00pm GMT) on Saturday. In his late-night message, Moreno said it had yielded \"tangible\" results.\n\n\"We've recovered calm in a good part of the city,\" Moreno told Ecuadoreans.\n\nShuttered inside for several hours, many residents of the city of more than 2 million people banged on pots at night on their roofs in a collective call for peace.\n\n(Reporting By Alexandra Valencia and Alberto Fajardo, Additional Reporting and Writing By Mitra Taj; Editing by Bill Berkrot, Grant McCool and Deepa Babington)", "description": "An indigenous group in Ecuador behind mass protests against cuts to fuel subsidies agreed to hold talks with President Lenin Moreno, who ordered a curfew in the capital on Saturday after the latest wave of violence in the city.  The announcement by the group, Conaie, was the first sign of a possible", "authors": ["Alexandra Valencia", "Mitra Taj"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-12"}