{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7606845/National-Crime-Agency-told-ministers-three-years-ago-smugglers-targeting-Purfleet-port.html", "downloaded_at": "2019-10-24 02:41:08.364527+00:00", "title": "National Crime Agency told ministers three years ago smugglers were targeting Purfleet port", "language": "en", "text": "Ministers were warned three years ago about the port where 39 bodies were found in a lorry yesterday.\n\nThe National Crime Agency said people-smugglers were switching to Purfleet because it was 'less busy' than other UK entry points.\n\nThe bodies were found in a refrigerated shipping container that came through the Essex port.\n\nIt was picked up by a lorry and was parked on an industrial estate when police and paramedics arrived in the early hours to find a scene of horror.\n\nA lorry driver, Mo Robinson, was in custody last night on suspicion of murder. The stowaways are thought to have slowly frozen or suffocated in horrific conditions while trapped inside the metal container, which had come to the UK from Zeebrugge in Belgium.\n\nPolice officers bowed their heads as the truck passed. Detectives have begun the process of trying to identify 39 bodies found in a lorry on an industrial estate in Essex\n\nLorries are seen outside the Purfleet Thames Terminal on October 23. The NCA previously told ministers people-smugglers were targeting the port three years ago\n\nPolice and the NCA have started a massive hunt for the people smugglers behind the tragedy. Robinson, 25, from County Armagh in Northern Ireland, was being questioned by officers.\n\nAs Boris Johnson said the perpetrators 'should be hunted down and brought to justice':\n\nThe Home Office refused to discuss whether hi-tech detection equipment – such as heartbeat monitors or CO2 detectors – was deployed at Purfleet;\n\nAn MP called for an urgent increase in security measures to avoid a repeat of the tragedy;\n\nNine migrants were found in the back of a lorry on the M20 in Kent yesterday.\n\nThe incident raises questions about border checks and whether the authorities have done enough to tackle trafficking gangs. The NCA had warned in 2016 that smugglers were turning their attention to 'less busy' ports in Britain. Its report even named Purfleet as a target.\n\nIt said gangs were being 'displaced' from northern France because of tighter security there.\n\nThis May the NCA warned that Belgian ports such as Zeebrugge were becoming people-smuggling hotspots. An earlier report from the Border Force also said Zeebrugge was a key concern.\n\nTim Loughton, a Tory MP who sits on the Commons home affairs committee, said: 'We need the authorities in Britain and Belgium to urgently step up security measures to ensure that people traffickers are not going to profit from human misery. This is a human tragedy on a massive scale which raises serious questions about how human trafficking may have moved north from France.'\n\nToday officers were pictured bowing their heads after the discovery. As locals claimed there had been reports of people climbing out of lorries\n\nMo Robinson is the truck driver arrested after 39 people were found dead in the back of a lorry he was driving\n\nDetectives said the refrigerated trailer arrived at Purfleet from Zeebrugge at around 12.30am yesterday, while the tractor unit came from Northern Ireland. The lorry left the port shortly after 1.05am.\n\nAn ambulance was called to Waterglade industrial park in Grays half an hour later. The Bulgarian ministry of foreign affairs said the truck was registered in Varna 'under the name of a company owned by an Irish citizen'.\n\nPolice were last night working to identify the victims and their nationalities but do not think they were Bulgarian.\n\nDavid Wood, a former immigration chief at the Home Office, has said the route thought to have been taken by the lorry container was unusual.\n\nMr Wood told the BBC: 'It is an unusual route, of course, because Zeebrugge is a freight and container port so not a port where there would be a focus on immigration-type checks because that is not what the port is used for – for passengers as such – and nor would Purfleet be a port where they would be greatly geared up for immigration checks.\n\nOfficers (pictured above) who were keeping guard of the lorry before it departed had bowed their heads in respect for those who lost their lives in the vehicle\n\n'In terms of migrants wishing to get into the UK, it would be a fairly safe route if it wasn't for the tragedy that occurred. On the face of it, it would be a pretty clear route for organised criminals to use.'\n\nThurrock MP Jackie Doyle-Price said: 'To put 39 people into a locked metal container shows a contempt for human life that is evil. The best thing we can do in memory of those victims is to find the perpetrators and bring them to justice.'\n\nAsked about security arrangements at Purfleet, a Home Office spokesman said last night: 'I cannot comment on the specific deployment of Border Force staff and security technology.'\n\nBack door to Britain: How Belgian port is now a key target for people smugglers\n\nThe horrific lorry deaths yesterday exposed a 'back door' into Britain.\n\nOfficials have repeatedly warned about how human-traffickers are exploiting the route from Zeebrugge.\n\nIn May the National Crime Agency said gangs had turned their attention to Belgian ports after security was stepped up in France.\n\n'Belgium has become a location of greater focus for the activities of organised people smugglers in the past year where smugglers of various nationalities operate,' the agency's annual strategic report said.\n\n'The number of smugglers located there increased after the closure of the migrant camp at Dunkirk in March 2017.\n\nThe 39 desperate stowaway migrants were locked up in the cabin (above) and it is not yet clear how long they had been stored there for\n\n'The closure of the camps at Calais and Dunkirk has made it more likely that migrants who are still determined to reach the UK will turn to organised crime groups as the options for opportunist illegal migration are reduced.'\n\nIn 2016 the annual threat assessment published by the Border Force identified Zeebrugge as a key port of embarkation for clandestine arrivals, along with the Hook of Holland.\n\nThat same year the NCA warned that people smugglers were trying to bring migrants into the UK at 'less busy' ports including Purfleet in Essex. It was here that the refrigerated container was found yesterday.\n\nCharlie Elphicke, the MP for Dover, has campaigned for improved border controls and tougher action against people smugglers. He said: 'Everyone knows that security has been greatly stepped up between Calais and Dover.\n\n'It begs the question as to whether there is sufficient security in other ports like Zeebrugge to detect people being trafficked. It underlines the importance of targeting people traffickers and putting a stop to their evil trade.'\n\nOne of Britain's worst-ever migrant tragedies also involved Zeebrugge.\n\nRobinson arrived in the UK at the weekend. He picked up the trailer, which had been shipped from Zeebrugge to Purfleet, yesterday evening. Minutes later, he pulled into the Essex industrial estate and the alarm was raised\n\nIn June 2000, 58 Chinese migrants were found suffocated in a lorry that had crossed from the Belgian port to Dover. The driver, Perry Wacker, 33, from Rotterdam, was jailed for 14 years.\n\nFive years ago 35 people, including 13 children, were discovered locked in a shipping container at Tilbury port, a few miles from Purfleet, as a ship from Zeebrugge was unloaded.\n\nThe Afghan Sikhs, all thought to be from the same family, had been locked in the metal container for 18 hours and were said to be just 20 minutes from death. One man, Meet Singh Kapoor, died as his wife and sons, aged nine and 12, slept nearby.\n\nBritain is seen as a highly attractive destination for migrants heading for the West.\n\nIts draws include jobs, the English language, a reputation for fair treatment and many established immigrant communities.\n\nThe number of people being smuggled into the UK in containers and lorries has risen in the last year, according to the NCA. It said there had been 'increasing use of higher risk methods of clandestine entry' to the UK by organised immigration crime gangs, including using shipping containers and refrigerated HGVs.\n\nThe numbers of clandestine migrants found by the Home Office have not been made public, despite repeated requests from MPs.\n\nBut in a six-month period in 2015 6,429 illegal migrants were detected, compared with 2,411 in the same period the previous year. About 93 per cent of those discovered by the authorities claimed asylum. Those who are not detected often choose to stay under the radar and work in the black economy. Last year a former Home Office chief said Britain was hosting more than a million illegal immigrants and they are unlikely to be removed.\n\nDavid Wood, director-general of immigration enforcement until 2015, said vast numbers were living in the UK unlawfully. Alp Mehmet, chairman of MigrationWatch UK, said: 'This is horrific news of a sad and needless loss of life. People-trafficking is a sickening business. It continues not only because the traffickers make huge amounts of money from it but are also often able to get away with it.\n\n'The risk is that more such tragedies will occur for so long as the UK fails to properly resource the border and return those who have no right to be here, which all but encourages traffickers to ply their trade by exploiting people who put their lives in their evil hands.'", "description": "The National Crime Agency told ministers three years ago that people-smugglers were switching to Purfleet port in Essex because it was 'less busy' than other UK entry points.", "authors": ["David Barrett", "Arthur Martin For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/00/20108052-0-image-a-102_1571871839288.jpg", "published_at": "2019-10-23"}