{"pub": "cnn", "url": "https://bleacherreport.com/articles/2857036-the-worst-organization-in-football-has-finally-reached-rock-bottom", "downloaded_at": "2019-10-07 23:31:04.848643+00:00", "title": "The Worst Organization in Football Has Finally Reached Rock Bottom", "language": "en", "text": "Elsa/Getty Images\n\nIn Washington, it's never really about the football.\n\nCoach Jay Gruden was fired Monday morning after five full seasons of mediocrity and an 0-5 start. He was reportedly summoned to team headquarters at 5 a.m. for maximum \"firing squad at dawn\" effect after weeks of speculation in what sure looked like a WikiLeaks-style effort to humiliate him on his way out the door.\n\nTeam president Bruce Allen gave a rare and uninformative press conference Monday in the wake of Gruden's firing. Allen stressed repeatedly how hard everyone in the organization is working, from coaches to scouts to team senior vice president Doug Williams. (Allen even suggested that the press could look at Williams' \"time card.\") He said the team culture is \"actually damn good\" and emphasized that everyone in Washington cares about winning, including himself.\n\n\"The pieces are here for a winning team,\" Allen told reporters. \"We have to put them in the right place, and believe in each other, and keep fighting for our goal.\"\n\nIn truth, the pieces are not here: Interim head coach Bill Callahan takes over a directionless team with a bloated payroll and limited talent. Belief in each other and goal-oriented thinking is always in short supply in Washington. Yet Allen needs to try to reassure fans that the organization cares about winning because with Allen (who comes across as Jafar from Aladdin, but without the charisma) running the franchise for owner Daniel Snyder, winning on the field always appears to be secondary to winning the latest internal power struggle.\n\nThe Redskins are a perpetual motion machine of institutionalized dysfunction, a self-sustaining source of front-office machination and backroom intrigue that also, almost by accident, produces a football-like entertainment product every autumn.\n\nThe cycle has been in motion since 1999, when Snyder purchased the team and kicked off a generation of mismanagement, give or take a few brief eras of clarity. But with Gruden's firing and the shenanigans surrounding it, the Skins have finally bottomed out.\n\nOver the weekend, with Gruden's job security in critical condition, embarrassing and quasi-incriminating videos that appear to show the coach's off-hours carousing surfaced on social media. The timing was suspicious, and while the videos cannot be linked to the organization, Washington has a long history of strategically leaking information to embarrass employees who have fallen out of favor. (See: the sad, controversial ending to Scot McCloughan's regime as general manager.)\n\nBefore the Smokin' Jay videos made the rounds, Gruden reportedly distanced himself from the decision to draft rookie quarterback Dwayne Haskins, who looked bad in his first NFL action against the Giants, but not so bad that a coach or organization should be eager to orphan him six months after drafting him.\n\nWhile Allen said several times Monday that the organization is \"thrilled\" about Haskins and believes he has a \"bright future,\" he left the starting quarterback decision to Callahan, and the whole organization has been strangely ambivalent about Haskins since drafting him. (Allen also said \"everyone signed off\" on the Haskins selection, which is different from actually endorsing that decision.)\n\nNick Wass/Associated Press\n\nLike salting the earth behind departing decision-makers, bickering over quarterbacks is something the Skins front office has done for many years. This was the organization that turned the 2010 Donovan McNabb trade into a yearlong morality play, turned Robert Griffin III's career into a Greek tragedy and squandered three years and tens of millions of dollars on Kirk Cousins' premium-priced mediocrity.\n\nLike Haskins, none of the quarterbacks really mattered, except as pawns in the battle for organizational control.\n\nAllen and Mike Shanahan clashed over McNabb and then Griffin in a grinding war of attrition that Allen eventually won. Snyder then became enamored of the brilliant, troubled McCloughan; Allen won that power struggle as well. By last December, Allen had even subdued potential rivals in the team's business department.\n\nGruden's minor acts of civil disobedience—starting Colt McCoy on Sunday was either a protest or a cry for help—have now been dealt with. The team may stink, but Allen is the undefeated 1972 Dolphins of boardroom machinations.\n\nThroughout most of the Game of Thrones sagas, Washington remained competitive on the field. McCloughan's drafts helped. Gruden's crackerjack staff, including Callahan, Sean McVay and Matt LaFleur, also helped. Snyder's willingness to spend big bucks helped: NFL teams can't buy championships, but money can keep a team around .500.\n\nBut all of the smart decision-makers have either moved on or been purged, leaving Snyder and Allen to rule a smoldering empire with problems that extend well beyond this season:\n\nQuarterback Alex Smith, still hobbling after suffering one of the most gruesome injuries in NFL history last year, will cost the team $21 million in cap space next year. His contract guarantees make him more expensive to cut than keep. No one begrudges Smith some guaranteed dough after what he went through, but his contract was a massive miscalculation by Allen when he was desperate for a solution to the annual Kirk Cousins fiscal dilemma.\n\nLeft tackle Trent Williams, the best player on the payroll, refuses to play for the team because of a dispute with the medical staff. Allen said Monday there were no plans to trade Williams or otherwise resolve the situation; dissatisfied players, like front-office rivals, are treated as enemy combatants in Washington.\n\nCornerback Josh Norman, last seen being used as kindling by Julian Edelman on Sunday, eats up $14 million in cap space this year and is scheduled to occupy another $15 million next year. Norman was signed on what seemed like a whim by Allen in 2016, just as safety Landon Collins was signed for a reported six years and $84 million this offseason, despite the team's cap issues and more pressing needs at other positions.\n\nWashington has a total of $161 million in cap space already earmarked for 2020, per OverTheCap,com, most of it for players unlikely to play a single snap for them (Smith, Williams) or veterans with no place on a rebuilding team (Norman, Vernon Davis, Jordan Reed, etc.).\n\nWashington could cut or trade many of those expensive veterans and rebuild around Haskins, but A) no one in the organization has demonstrated the inclination/vision/patience to initiate a sweeping rebuild; B) cutting the veterans would leave the team with an expansion-caliber roster; and C) you can't rebuild around Haskins if it's not clear just who within the organization is eager to rebuild around Haskins.\n\nAlso, the sleazy optics surrounding the Gruden firing will likely scare off any top head coaching prospects who aren't scared off by the team's many other issues.\n\nLosing to the Dolphins next week and eventually securing the first overall pick will solve nothing. The Griffin experience is a reminder that Washington is the most likely organization in the NFL to miss on a can't-miss prospect.\n\nMark Tenally/Associated Press\n\nWashington is terrible in a way that will prevent it from becoming anything else but terrible. It is unlikely to attract anyone who can bring fresh ideas or energy to the organization, and if a true innovator does arrive, it surely will trigger a power struggle. Any top prospect or quarterback of the future within the organization will then be trapped in that power struggle, which could ruin him. Meanwhile, Snyder will sip wine, watch Imax movies on his yacht and wonder why so few people will purchase merchandise with the team's name on it.\n\nThe Skins aren't just the worst organization in the NFL, if not in American sports. They're an organization whose decisions only make sense if you assume winning is irrelevant to them. Allen may stress hard work and a positive culture, but the Skins are less like a football team than a reality series about pampered, attention-craving millionaires. Accomplishing anything isn't the point. The backstabbing, hair-pulling and interpersonal conflict itself is the point.\n\nBy that standard, the Skins are doing just great. And with Gruden gone, they're sure to find a way to get even better.\n\nMike Tanier covers the NFL for Bleacher Report. Follow him on Twitter: @MikeTanier.", "description": "In Washington, it's never really about the football.  Coach Jay Gruden was fired Monday morning after five full seasons of mediocrity and an 0-5 start. He was  reportedly  summoned to team headquarters at 5 a...", "authors": ["Mike Tanier"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/831/920/hi-res-d6b5ef9d92fb21c3525cdea7109645b8_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-07"}