{"pub": "metro", "url": "https://metro.co.uk/2019/10/12/7-casualty-spoilers-knife-attack-in-the-ed-and-ethan-is-falling-in-love-10875183", "downloaded_at": "2019-10-12 07:29:13.581103+00:00", "title": "7 Casualty spoilers: Knife attack in the ED, and Ethan is falling in love", "language": "en", "text": "Duffy finds herself in the middle of a Situation (Picture: BBC)\n\nA gripping and shocking story unfolds in tonight’s Casualty when the staff find out that one of their patients has a terrible secret in their past. It’s something so bad it makes some members of the team refuse to work on the case. Duffy (Cathy Shipton) finds herself in the middle of things when once again she’s at the ED as a patient – and gets some terrible news.\n\nEthan (George Rainsford), meanwhile, is growing ever closer to Effie (Abigail Hardingham), which gets him into trouble both at work and outside of it. And Archie (Genesis Lynea) is worried when the man whose car she threw acid over seems determined to find out the truth. Here are all the spoilers to look out for.\n\n1. The episode begins with a father and daughter walking on some cliffs. When the daughter seems to be about the fall, the father has some disturbing, violent flashbacks. There’s an accident and back in the ED a shocking secret is revealed.\n\nAdvertisement\n\nAdvertisement\n\n2. Vincent Millbank, whose car Archie threw acid over, has demanded the CCTV footage from the car park on the day of the incident. If Archie is found out her career is at risk. Will (Jack Nolan) wants to make it up to her for not supporting her during her troubles with Connie – but is there anything he can do?\n\n3. Duffy finds herself back in the ED after she has a worrying incident while she’s out driving. Could this be another setback for Duffy’s health?\n\nEthan has a request (Picture: BBC)\n\n4. Effie tries to persuade Ethan to take the day off work to spend time with her as the two of them realise there’s a mutual attraction. He’s very tempted – but he’s got to get past Dylan (William Beck) first.\n\n5. When Will sees a woman (Michelle Collins) shut her hand in her car door he brings her straight in to the ED. But why doesn’t she want her husband to know she’s there? Duffy tries to find out more, but even the legendary Duffy empathy doesn’t seem to be working – until she makes a shock discovery.\n\n6. Charlie (Derek Thompson) admits that Duffy isn’t doing well. She’s depressed and feeling useless. David (Jason Durr) offers to visit her – but maybe he can come up with an even better plan?\n\n7. The staff have to cope with a violent confrontation when someone decides to take the law into their own hands and avenge a crime. With lives at risk, who can keep a cool enough head to deal with the situation?\n\nSue Haasler is the author of the official Holby City book, which you can read about here. Her other TV books and novels are listed here\n\nAdvertisement Advertisement", "description": "Who will survive?", "authors": ["Sue Haasler"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/michelle-collins-casualty-8-72c1_1570450745.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-12"}