{"pub": "politico", "url": "https://politico.com/news/2019/10/26/china-trade-war-058425", "downloaded_at": "2019-10-27 00:03:15.874528+00:00", "title": "China, U.S. say good progress being made on phase-one deal to end trade war", "language": "en", "text": "According to a statement from Xinhua on Saturday, the two sides have reached consensus on U.S. imports of Chinese cooked poultry and a quality supervision system for catfish products, as well as China lifting a ban on U.S. poultry, and how to apply a public health information system for meat products.\n\n“Both sides agreed to appropriately resolve the core concerns of both parties,” it said. “Working-level deputies will speed up talks for the trade deal before the principals talk over the phone in the near future,” it said.\n\nThe Office of the U.S. Trade Representative, meanwhile, said on Friday that officials have “made headway on specific issues” and were “close to finalizing some sections of the agreement.”\n\nChen Fengying, a senior researcher at the China Institute of Contemporary International Relations in Beijing, said reaching a phase-one deal was “not a big problem” as some sections had been completed and China had begun to honor its commitments by purchasing more U.S. agricultural products.\n\n“It makes sense to start with the easy parts and then move on to the difficult ones,” she said. “It can’t be done overnight as the negotiation list is probably thousands of pages long.”\n\nHopes are rising that a deal will be ready for President Xi Jinping and President Donald Trump to sign when they meet on the sidelines of the Asia-Pacific Economic Cooperation summit in Chile on November 16-17.\n\nIn the past week, Beijing has promised to buy $40 billion to $50 billion worth of U.S. farm produce — partly in return for Washington suspending a planned tariff increase originally planned for October 15 — and further open its financial markets. However, it is still facing the prospect of the U.S. imposing a new 15 per cent tariff on about $160 billion worth of its goods on December 15.\n\nChen said the partial deal could pave the way for agreement on some of the trickier issues.\n\n“The two sides might have warmed up for the more difficult issues scheduled for the phase-two negotiations,” she said.\n\nPhase two is expected to cover a number of thorny issues, including intellectual property rights, forced technology transfers, and an enforcement mechanism.\n\nWang Yiwei, a professor of international relations at Renmin University of China, said Beijing was more wary of Washington’s demands for institutional reforms.\n\n“China is always willing to negotiate on technical issues such as trade, but it remains on high alert to some U.S. attempts to package strategic gaming into the negotiations and won’t make concessions,” he said.\n\n“But China is willing to make more reforms. The U.S.’s demands, such as on market opening and intellectual property protection, can be met.”\n\nComparing the ongoing talks to China’s 15-year effort to join the World Trade Organization, Chen said Beijing may decide to introduce more institutional changes after the Communist Party’s Fourth Plenum, a four-day event that gets under way on Monday, though any such moves would be gradual.\n\nAfter the central government formulated the policies, they would then be allowed to become “widely accepted before being implemented,” she said.\n\nTrump, who is facing the threat of impeachment at home, has not commented on China on Twitter since the latest round of trade talks in Washington almost two weeks ago.\n\nDespite the progress towards a trade deal, concerns remain as to whether consensus can be reached after Vice-President Mike Pence linked Xinjiang and Hong Kong to the trade war during a speech on Thursday that sparked criticism from China’s foreign ministry, which described it as “political bias and lies.”\n\n“[But] China must understand that Trump is trying to paint himself as a winner in the run-up to the [2020] presidential election, so it doesn’t need to overreact,” Chen said.\n\nChina’s state media have made repeated calls for the U.S. to create a good atmosphere for the negotiations.\n\n“The goal of cooperation and win-win can only be achieved on the condition of equality, mutual respect and appropriately addressing the core concerns of both parties,” the Communist mouthpiece People’s Daily said in an editorial on Saturday.\n\nAdditional reporting by Reuters.", "description": "", "authors": [], "top_image": "https://static.politico.com/e1/a9/a0715d2249708839a8559d412e20/191026-mnuchin-gty-773.jpg", "published_at": "2019-10-26"}