{"pub": "yahoo", "url": "https://sg.news.yahoo.com/austrian-railways-night-train-bookings-increase-195146578.html", "downloaded_at": "2019-10-24 00:39:10.645834+00:00", "title": "Austrian railways say night train bookings on increase", "language": "en", "text": "OeBB operates, either alone or in partnership, some 26 night train services to destinations in countries such as Italy, Germany, Switzerland, Croatia and Poland\n\nAustria's state rail operator, OeBB, said Wednesday that ticket sales for its long-distance night services were up substantially this year, as more and more passengers choose train travel as a more ecological alternative to flying.\n\nOeBB, one of Europe's leading operators of night rail services, said in a statement that bookings on both its regular seated and sleeper night trains were up 11 percent year-on-year in the period until mid-October.\n\nWith prices for seats alone as low as 19 euros ($21) to most destinations, the services were \"competitive with low-cost airlines,\" said OeBB chief Andreas Matthae.\n\nOeBB operates, either alone or in partnership, some 26 night train services to destinations in countries such as Italy, Germany, Switzerland, Croatia and Poland.\n\nIt is developing its network and is ordering new rolling stock, and at the end of 2016 bought the night trains of the state rail operator in neighbouring Germany, Deutsche Bahn.\n\nOeBB is planning to launch a new service between Vienna and Brussels starting from January and between Vienna and Amsterdam in 2021.\n\nAnd Matthae said additional destinations were set to follow.", "description": "Austria's state rail operator, OeBB, said Wednesday that ticket sales for its long-distance night services were up substantially this year, as more and more passengers choose train travel as a more ecological alternative to flying.  OeBB, one of Europe's leading operators of night rail services", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/9hsf0udJbQJagtxK.cnQBQ--~B/aD0zMzM7dz02NDA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_sg/News/AFPRelax/istock_23101667.f8f5b125807.w640.jpg", "published_at": "2019-10-23"}