{"pub": "investing.com", "url": "https://ca.investing.com/funds/ph-n-total-return-bond-a", "downloaded_at": "2019-09-04 04:50:50.003421+00:00", "published_at": "2019-09-04", "title": "Phillips, Hager & North Total Return Bond Fund A - Investing.com Canada", "language": "en", "text": "Phillips, Hager & North Total Return Bond Fund A (0P0000IL32) Toronto Add to/Remove from a Portfolio Add to Portfolio\n\n11.762 +0.020 +0.18% 02/10 - Closed. Currency in CAD Disclaimer ) - Closed. Currency in Type: Fund Market: Canada Issuer: RBC Global Asset Management Inc. Asset Class: Bond Morningstar Rating:\n\nTotal Assets: 9.88B\n\nPH N Total Return Bond A 11.762 +0.020 +0.18%\n\n0P0000IL32 Overview\n\nRating 1-Year Change 6.76% Prev. Close 11.741 Risk Rating TTM Yield 1.95% ROE N/A Issuer RBC Global Asset Management Inc. Turnover 141.40% ROA N/A Inception Date Nov 17, 2008 Total Assets 9.88B Expenses N/A Min. Investment 500 Market Cap N/A Category Canadian Fixed Income\n\nWhat is your sentiment on PH N Total Return Bond A? or Members' Sentiments: Bullish Bearish Market is currently closed. Voting is open during market hours.\n\nType Daily Weekly Monthly Moving Averages Buy Buy Buy Technical Indicators Strong Buy BUY Strong Buy Summary Strong Buy Buy Strong Buy\n\nStart Trading With Top Industry Brokers\n\nBrokers Regulation Minimum Deposit Malta Financial Services Authority (Malta), Dubai Financial Services Authority (United Arab Emirates), Financial Market Supervisory Authority (Switzerland), The Securities and Futures Commission (Hong Kong) $1000 Start Trading The Financial Conduct Authority (United Kingdom) $100 Start Trading\n\nYour ability to comment is currently suspended due to negative user reports. Your status will be reviewed by our moderators. Please wait a minute before you try to comment again.\n\nDisclaimer: Fusion Media would like to remind you that the data contained in this website is not necessarily real-time nor accurate. All CFDs (stocks, indexes, futures), cryptocurrencies, and Forex prices are not provided by exchanges but rather by market makers, and so prices may not be accurate and may differ from the actual market price, meaning prices are indicative and not appropriate for trading purposes. Therefore Fusion Media doesn't bear any responsibility for any trading losses you might incur as a result of using this data. Fusion Media or anyone involved with Fusion Media will not accept any liability for loss or damage as a result of reliance on the information including data, quotes, charts and buy/sell signals contained within this website. Please be fully informed regarding the risks and costs associated with trading the financial markets, it is one of the riskiest investment forms possible.", "description": "Find our live Phillips, Hager & North Total Return Bond Fund A fund basic information. View & analyze the 0P0000IL32 fund chart by total assets, risk rating, Min. investment, market cap and category.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investing_300X300.png"}