{"pub": "cbs", "url": "https://cbsnews.com/news/casei-jones-missing-florida-woman-her-4-kids-found-dead-husband-michael-wayne-jones-jr-arrested-pure-evil", "downloaded_at": "2019-09-17 10:38:15.006281+00:00", "title": "\"True evil\": Missing Florida woman and her 4 kids found dead and her husband arrested", "language": "en", "text": "Marion County, Florida — A Florida woman and her four children who had been missing for weeks have been found dead in Georgia, and now the woman's husband is facing a murder charge, reports CBS Orlando affiliate WKMG-TV.\n\nMarion County sheriff's deputies said Casei Jones, 32, was reported missing Saturday by family members who hadn't seen her or her four children -- Cameron Bowers, 10; Preston Bowers, 5; Mercalli Jones, 2; and Aiyana Jones, 1 -- for six weeks. The family lived in Summerfield.\n\nCasei Jones and her four children in undated family photo WKMG-TV\n\nDeputies said Monday that Casei Jones' body was found near Brantley County, Georgia. Details on the circumstances of her death were not immediately available.\n\nCasei Jones' husband, 38-year-old Michael Wayne Jones Jr., was found in Georgia and is being questioned in connection with his wife's death.\n\nAccording to the Brantley County Sheriff's Office in Georgia, Michael Jones was arrested after he was involved in a crash south of Hickox.\n\nDeputies said when they arrived at the scene of the crash, they smelled a foul odor.\n\nMichael Wayne Jones Jr., apparently after his arrest on September 16, 2019 WKMG-TV\n\nJones told deputies, \"You may want to put me in handcuffs because there was a dead body\" inside the car, according to a news release from the Sheriff's Office.\n\nJones told deputies that prior to the crash, he concealed other bodies in Charlton County. Authorities in Charlton went to the location Michael Jones mentioned and found bodies there, to the Brantley County Sheriff's Office said.\n\nMarion County Sheriff Billy Woods said the bodies are believed to be those of the four children.\n\n\"Unfortunately, true evil poked its head up here in Marion County. That's about the only best way to describe it,\" Woods said Monday afternoon.\n\nDetectives said they believe Michael Jones murdered the family in Marion County and stored the bodies at his home and in his van for several weeks before transporting them to Brantley County, Georgia.\n\nWoods said he hopes Michael Jones gets the punishment he deserves.\n\n\"He has no right to walk on the face of this Earth, and I'd hate to be him when he stands before the Lord,\" Woods said.\n\nDeputies said family members had been communicating with someone they thought was Casei Jones but it was probably Michael Jones using her phone, which is why they waited so long to report her and her children missing. Authorities are investigating the phone records.\n\nRecords show a second-degree murder warrant was issued for Michael Jones' arrest. Additional charges could be forthcoming.\n\nWoods told WKMG his deputies were on their way to Brantley County, where they were going to execute a search warrant on the van Casei's was found in.\n\nHe also said Michael was facing charges in Georgia, and his office was working with law enforcement there to bring Jones back to Marion County to be prosecuted for all five deaths.", "description": "Florida authorities call it case of \"pure evil\" as bodies of Casei Jones and her 4 children found weeks after they went missing", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/17/ff717fba-a2e9-4968-a9bd-4a9908c01111/thumbnail/1200x630/cf729f3069b0fb939597cfee8f80c615/casei-jones-and-her-4-kids.jpg", "published_at": "2019-09-17"}