{"pub": "cbc", "url": "https://cbc.ca/news/business/beyond-meat-mcdonalds-canada-1.5297923", "downloaded_at": "2019-09-26 15:07:16.957576+00:00", "title": "McDonald's picks Ontario as test market for new Beyond Meat sandwich starting next week | CBC News", "language": "en", "text": "Beyond Meat may have lost Tim Hortons, but it has partnered with another popular fast-food chain in Canada: McDonald's.\n\nThe iconic burger chain announced Wednesday it will test a new plant based burger known as the P.L.T. — plant, lettuce and tomato — in 28 McDonald's locations in southwestern Ontario starting Monday.\n\nThe patty would be made of Beyond Meat, the plant-based protein that entered the scene this year on grocery store shelves and in various fast-food chains. Canadian coffee and doughnut chain Tim Hortons launched several versions of the product earlier this summer, but has since scaled back availability from across the country to just Ontario and B.C.\n\nIt's not immediately clear why McDonald's has selected Canada alone to be the test market for its first plant-based sandwich for the North American market.\n\nPlant-based burger powers stocks\n\nCalifornia-based Beyond Meat Inc. went public earlier this year, and it quickly became one of the fastest-rising new stocks of the year, although it has pulled back from its recent highs over concerns its growth may be unsustainable, and some criticism over how healthy the patties are.\n\nShares in Beyond Meat jumped 13 per cent in premarket trading on the stock market when news of the McDonald's partnership came out.\n\nThe promotion, a pilot project set to last to the end of the year, would be the burger chain's first major push into plant-based eating. If successful, it could become a permanent offering at some of the chains 38,000 locations in more than 100 countries around the world\n\nThe burger will be priced at $6.49 Cdn.", "description": "Beyond Meat may have lost Tim Hortons, but it has partnered with another popular fast-food chain in Canada: McDonald's says it will sell a plant-based burger at 28 locations in Ontario starting next week.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5297938.1569500654!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/beyond-meat-mcdonalds-plt.JPG", "published_at": "2019-09-26"}