{"pub": "yahoo", "url": "https://news.yahoo.com/germany-eu-must-together-risk-100604949.html", "downloaded_at": "2019-10-06 11:33:32.274760+00:00", "title": "Germany: EU must work together or risk new migrant influx", "language": "en", "text": "Greece's Prime Minister Kyriakos Mitsotakis, right, German Interior Minister Horst Seehofer, center, and EU migration commissioner Dimitris Avramopoulos talk during their meeting at Maximos Mansion in Athens, Friday, Oct. 4, 2019. Greece said Friday it will call on the European Union to impose sanctions on member states that refuse to accept refugees, as senior European officials visited Ankara and Athens to try and stem a surge in migrant arrivals overwhelming Greek islands. (AP Photo/Thanassis Stavrakis)\n\nBERLIN (AP) — Germany's top security official says European Union nations need to work better together on the issue of migration or they risk facing a new flood of asylum-seekers that could rival that of 2015.\n\nFollowing a trip last week to Turkey and Greece, Interior Minister Horst Seehofer told the Bild newspaper Sunday \"we need to do more to help our European partners with the controls on the EU's external borders.\"\n\nHe says \"if we don't do that, we will experience a surge of refugees like 2015, perhaps even bigger.\" Germany alone took in 890,000 migrants in 2015.\n\nThe comments come ahead of meetings Tuesday with EU interior ministers on the issue.\n\nSeehofer also tells the Welt newspaper that Europe needs to do more to help Turkey in dealing with millions of Syrian refugees.", "description": "Germany's top security official says European Union nations need to work better together on the issue of migration or they risk facing a new flood of asylum-seekers that could rival that of 2015.  Seehofer also tells the Welt newspaper that Europe needs to do more to help Turkey in dealing with millions", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/vNMu18dGLP6pUR4jwZrBEg--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/e5bffdc48a41fadc2bea0035a6b8fbc0", "published_at": "2019-10-06"}