{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7622951/Bill-Barr-launches-fresh-attack-James-Comey-saying-failure-leadership-FBI.html", "downloaded_at": "2019-10-28 23:38:59.774899+00:00", "title": "Bill Barr launches fresh attack on James Comey saying there was a 'failure of leadership' at the FBI", "language": "en", "text": "Attorney General Bill Barr said Monday there was a 'failure of leadership' at the FBI under director James Comey – then said there had been a 'world of change' under his successor.\n\nBill built up Christopher Wray and credited the FBI director for helping career federal prosecutor John Durham in his probe of alleged FBI misconduct in the Russia probe.\n\nThe praise comes as Barr himself has come under scrutiny for his international travels to enlist other governments in the investigation.\n\nBarr launched a criminal investigation of his own department last week after reportedly learning information on his second trip to Rome this summer, where he reportedly had Italian authorities play the taped deposition of mysterious Maltese professor Josef Mifsud, who according to the Mueller report offered 'dirt' on Hillary Clinton to former Trump campaign advisor George Papadopoulos.\n\nHe initially asked Durham earlier this year to 'review' the origins of claims of Donald Trump's campaign colluding with Russia and turned it criminal last week, allowing Durham to impanel a grand jury and issue subpoenas.\n\nBarr himself came under fire for the move, being accused of using the Department of Justice as a weapon against Trump's political enemies.\n\nAttorney General Bill Barr says there was a 'failure of leadership at the bureau in 2016 and part of 2017' at the FBI –but now says there is 'steady professionalism' under FBI Director Christopher Wray\n\n'As you know, I've said previously that I felt there was a failure of leadership at the bureau in 2016 and part of 2017, but since Director Wray and his team have taken over there's been a world of change,' said, stating the time when Comey served before Trump fired him.\n\n'I think that he is restoring the steady professionalism that's been a hallmark of the FBI. I really appreciate his leadership there,' said Barr.\n\nBarr also rejected the idea that he was acting more like a personal lawyer representing Trump's interests as he stares down impeachment than as the nation's lawyer. Democrats have blasted the administration for frustrating their impeachment investigation.\n\nBut Barr defended Durham and his own probe Monday.\n\n'I do want to say that one of the reasons Mr. Durham is able to make the kind of progress he's making is because Director Wray and his team at the FBI have just been outstanding in support and responsiveness given to Mr. Durham,' Barr told Fox News in an interview in Chicago, where President Trump gave a speech to police chiefs and then attended a fundraiser for his campaign at the Chicago hotel he owns.\n\nHe rejected criticism of his own role.\n\n'That's completely wrong and there is no basis for it, and I act on behalf of the United States,' Barr said.\n\nHe called Durham, a career prosecutor, 'tough and fair,' adding: 'He is in charge of the investigation, I'm not doing the investigation.'\n\nBarr has traveled to the UK and Italy, and sought the assistance of Australia, in his 'investigate the investigators' probe.\n\nFormer FBI Director James Comey this weekend said Barr should tell the American people what, exactly, the Justice Department is investigating. Barr praised FBI Director Christopher Wray, who got the job after Trump fired Comey\n\nU.S. President Donald Trump reacts after signing an executive order during an appearance at the International Association of Chiefs of Police annual conference and expo in Chicago, Illinois, U.S., October 28, 2019. He is flanked on his left by Barr\n\nDurham and Barr reportedly heard a recording of Joseph Mifsud in Italy - the professor widely credited with sparking the counterintelligence probe into Trump campaign officials\n\nBarr visited and called world leaders from around the world over the summer, collecting evidence into how the FBI's probe of Donald Trump's connections to Russia got started\n\nBut he claimed in the interview that he was simply opening doors for Durham.\n\n'Some of the countries that John Durham thought might have some information or be helpful to his investigation wanted preliminary to talk to me about the scope of the investigation, the nature of the investigation, and how I intended to handle confidential information,' Barr said.\n\n'So I initially discussed these matters with those countries, then introduced them to John Durham and established a channel by which Mr. Durham can obtain assistance from those countries.'\n\nJohn H. Durham, U.S. Attorney for the District of Connecticut\n\nComey this weekend said Barr should tell the American people what, exactly, the Justice Department is investigating.\n\n'Don't drip it out, don't leak it out, give it out,' Comey advised Saturday at Politicon.\n\n'I can't tell what's going on with the attorney general and that investigation,' Comey said. 'I was deeply concerned with some things he said early on using the words 'spying' and saying there are things that just don't make sense. And at the time I said that's not the way pros operate.'\n\nComey suggested if there was a there-there Barr would have stayed mum.\n\n'If there's a reason to look at something you shut up and you try and gather the facts and then you share the facts with us. And I still feel that way,' Comey said. 'I don't know what they're looking at and so I'm not really in a position to say you shouldn't investigate.'", "description": "Attorney General Bill Barr says there was a 'failure of leadership' and defended the federal prosecutor conducting an inquiry about the origins of the Russia probe.", "authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/19/20293376-0-image-a-20_1572289651875.jpg", "published_at": "2019-10-28"}