{"pub": "atlantic", "url": "https://theatlantic.com/politics/archive/2019/09/kevin-hassett-trump-trade-war/597493", "downloaded_at": "2019-09-08 11:40:56.801081+00:00", "title": "Kevin Hassett Says Trump’s Trade War Is Worth the Cost", "language": "en", "text": "Lizzie O’Leary: We are in a new round of the trade war as of today. JPMorgan Chase just estimated that the tariffs will cost the average American household up to $1,000 a year. Is that acceptable collateral damage, in your opinion?\n\nKevin Hassett: I think that when you look at the literature on China’s behavior towards the U.S. over the last few decades, there’s ample evidence that it has behaved in a way that’s quite at odds with certain normal trading procedures. The IP Commission estimates that between $200 billion and $500 billion a year of intellectual property is stolen from the U.S. To put that in perspective, the Isabella Stewart Gardner Museum, the art museum, was part of the biggest heist in U.S. history, where [burglars] stole, tragically, $500 million worth of art. And the IP Commission’s estimates of how much China’s stealing from the U.S. mean there’s about a heist that big, every day, 365 days a year.\n\nThe issue is just that when you see these big numbers, it’s easy to just tune them out. And the fact is that the relationship with China is just utterly unacceptable because of their misbehavior. And the president is standing up to them. Absolutely there are going to be short-term costs associated with that. But I think that the long-run benefit could be enormous.\n\nO’Leary: Do you think the president understands the risks of his trade war?\n\nHassett: Yeah, I think that the president has fully discussed the Chinese situation and other aspects of his trade policy probably more than any other policy. When I started there a couple of years ago, we had weekly meetings that pretty much continue, I’m sure, to this day. And the president is a person that really likes to have diverse opinions in the room, so he’s seen just about every argument.\n\nRead: Trump passed the tax cuts. Now he’s undermining them.\n\nO’Leary: I think the question here is about the way policy is being conducted. I mean, Powell himself said, “Trade-policy uncertainty seems to be playing a role in the global slowdown, and in weak manufacturing and capital spending in the United States.” Is he wrong?\n\nHassett: I think that trade-policy uncertainty is a serious negative for the outlook right now. But I think uncertainty increases as [risk increases]. So if you and I are tossing a coin and betting $1 on it, and then we decide to increase the stakes to $10, then that’s sort of an increase in uncertainty, because the risk for you is $10 instead of $1. So I think that when people look at the trade negotiations with China, they tend to focus on the negative. But I think there’s a really massive upside. And I’m not alone in that.\n\nO’Leary: No matter what happens on the way to that point?\n\nHassett: Well, I think on the way, you’re right to highlight the uncertainty. But I think that when people go back and write the story of trade in the 21st century, they’re going to talk about a sea change that President Trump began. It happened because the 20th century was a story of rivalry between the Soviet Union and the United States. We wanted to get people under our umbrella, they wanted to get people under their umbrella. And we would give people access to our markets, bringing them into the western umbrella, without asking them to change their tariffs at all. And so we ended up with all these relationships where we gave unfettered access to the U.S. market and they kept their tariffs and nontariff barriers. And we didn’t really care, because we basically had a competition for effectiveness with the Soviet Union.", "description": "The former chairman of the Council of Economic Advisers is a free-trade devotee, but he thinks Trump’s skirmishes with China were long overdue.", "authors": ["Lizzie O'Leary"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTS2HB09/facebook.jpg?1567808397", "published_at": "2019-09-08"}