{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/22/canada-prime-minister-justin-trudeau-wins-tight-election-race", "downloaded_at": "2019-10-22 13:20:44.857314+00:00", "title": "Canada: Prime Minister Justin Trudeau Wins Tight Election Race", "language": "en", "text": "Oct. 21 (UPI) — Canadian Prime Minister Justin Trudeau’s Liberal Party won enough seats Monday night to secure him a second four-year term following a contentious election cycle. However, he lost his majority government and will lead a minority in Parliament instead.\n\nLiberals won 157 seats in the Canadian Parliament with 33 percent of the vote share or 5.62 million votes to Andrew Scheer’s Conservative Party’s 121 seats with 5.88 million votes or a 34.5 percent share.\n\nTrudeau, in Montreal, Que., told his supporters and staff Tuesday that this victory was because of them.\n\n“You did it, my friends. Congratulations,” he said. “From coast to coast to coast tonight, Canadians rejected division and negativity. They rejected cuts and austerity and they voted in favor of a progressive agenda and strong action on climate change.”\n\nPresident Donald Trump was quick to congratulate Trudeau on Twitter for his “wonderful and hard-fought victory.”\n\n“Canada is well served,” Trump said. “I look forward to working with you toward the betterment of both of our countries!”\n\nThe source of Trudeau’s drop this election could be that his image as the face of a liberal Canada that embraces all was tarnished shortly after the election campaign began in September when the first of three instances of the son of the former late Prime Minister Pierre Elliott Trudeau in brownface surfaced.\n\n“This is something I shouldn’t have done many years ago,” he said following the revelation of the picture of him dressed in brownface and a turban published in a 2000-2001 yearbook for a school he worked for at the time. “I take responsibility for my decision to do that. I didn’t think it was racist at the time. I now realize it was.”\n\nCandidates attacked Trudeau for it including Scheer who has repeatedly stated he won’t walk in Toronto’s LGBT Pride Parade and who has said he’d stand by Conservative candidates who apologize for past discriminatory remarks.\n\nScheer, 40, has also faced scandal during this campaign, as the right-wing candidate came under scrutiny for being a dual citizen holding a U.S. passport.\n\nWhen questioned during the campaign why he never mentioned his U.S. citizenship, he replied: “No one’s ever asked me before about it.”\n\nThough he has since said he will renounce the citizenship he received through his U.S.-born father.\n\nHowever, the Conservatives made substantial gains from 2015, earning some 20 seats more than last time around.\n\nIn his concession speech Tuesday, Scheer said the Conservative Party has put Trudeau and his Liberal Party “on notice.”\n\n“While tonight’s result isn’t what we wanted, I am also incredibly proud — proud of our team, proud of our campaign and proud of the bigger and stronger Conservative team that we will send to Ottawa,” he said. “Tonight, Conservatives have put Justin Trudeau on notice, and Mr. Trudeau, when you’re government falls, Conservatives will be ready and we will win.”\n\nMeanwhile, the left-wing NDP, led by Singh, who was seeking to build off 2015’s 44 seats, took a substantial hit, dropping by nearly half.\n\n“Thank you, Canada,” Singh, who won his seat in British Columbia’s Burnaby South riding, said early Tuesday on Twitter. “What a night — and what an unforgettable journey this campaign has been. With our new NDP caucus in Ottawa, I’m incredibly excited to continue our critical work to achieve the priorities that we’ve heard from people across this country.”\n\nAnd the minor though strong conservative Quebec party, the Bloc Quebecois, jumped by more than 20 seats from the 10 they garnered in the last election.\n\nElizabeth May’s Green Party won three seats, an increase of one from the election prior.", "description": "(UPI) -- Canadian Prime Minister Justin Trudeau's Liberal Party won enough seats Monday night to secure him a second four-year term.", "authors": ["Breitbart News"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1177523340-640x335.jpg", "published_at": "2019-10-22"}