{"pub": "reuters", "url": "https://uk.reuters.com/article/us-jd-com-moves/chinas-jd-com-reloads-deal-making-with-investment-head-appointment-idUKKCN1VW0CY", "downloaded_at": "2019-09-11 07:29:02.712083+00:00", "title": "China's JD.com reloads deal-making with investment head appointment", "language": "en", "text": "HONG KONG/BEIJING (Reuters) - China’s second-largest e-commerce firm JD.com Inc has appointed Jason Hu, a former managing director at Chinese private equity firm CDH Investments, as head of strategic investment to oversee deals both at home and overseas.\n\nFILE PHOTO: A sign of China's e-commerce company JD.com is seen at its shop at a mall in Shanghai, China October 26, 2018. REUTERS/Aly Song/File Photo\n\nHu, who joined the company in late July, was also named vice president reporting directly to Chief Strategy Officer Jon Liao.\n\nFilling the newly created role will beef up JD.com’s investment arm which has long been dwarfed by in-house deal teams at bigger rival Alibaba Group Holding Ltd as well as tech peer Tencent Holdings Ltd.\n\nJD.com has been seeking to diversify its business to deal with slowing growth in China’s broader e-commerce sector by venturing into areas such as offline stores, and investing in artificial intelligence to improve logistics and advertising capabilities.\n\nThe Beijing-based e-commerce firm has made about 50 investments at home and overseas over the past five years, showed data from Refinitiv.\n\nHigh-profile deals include a minority stake in London-based retailer Farfetch Ltd, and investments in Chinese luxury e-commerce platform Secoo Holding Ltd and apparel retailer Vipshop Holdings Ltd.\n\nPrior to joining JD.com, Hu, who began his career as a consultant with Bain & Company, held senior roles in investment management at PE firms CDH and Cathay Capital. At CDH, he was involved in investments in domestic couriers Deppon Logistics Co Ltd and Yimidida, and footwear retailer Belle International.\n\nA spokesman at JD.com said Hu’s appointment “further strengthens the company’s deep bench of investment and strategy leadership for continued growth”.\n\nReuters reported Hu’s role earlier on Wednesday citing sources. The spokesman later confirmed that Hu had been appointed as head of strategic investment.\n\nJD.com International’s president, Winston Cheng, who was responsible for the company’s overseas business including investments, left JD.com in September last year.\n\nVice President Chang Bin, who mainly oversaw the company’s domestic investments, took up a new role in September last year to lead JD.com’s own-brand business, in particular “Made by JD” or Jing Zao in Chinese.\n\nMade by JD launched early last year offering household basics as varied as hair dryers and suitcases, with the goal of competing with manufacturers that sell products through the country’s e-commerce platforms.\n\nCSO Liao had been overseeing strategic investments until Hu’s arrival, said a person with direct knowledge of the matter, who was not authorized to speak to the media and so declined to be identified.\n\nThe appointment comes after a troubled time for JD.com. Chief Executive Richard Liu was accused of rape last year in the United States, with investigations ending in December without charge. He denied wrongdoing.\n\nThe company also laid off staff earlier this year amid slowing e-commerce growth, though analysts regarded its cost-cutting measures as a reason behind better-than-expected second-quarter earnings.", "description": "China's second-largest e-commerce firm JD.com Inc has appointed Jason Hu, a former managing director at Chinese private equity firm CDH Investments, as head of strategic investment to oversee deals both at home and overseas.", "authors": ["Julie", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190911&t=2&i=1428570937&w=1200&r=LYNXNPEF8A08W", "published_at": "2019-09-11"}