{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/9/donald-trump-puts-america-first-shuns-taliban-iran", "downloaded_at": "2019-09-10 02:22:21.393277+00:00", "title": "'Leverage game': Trump puts America first by walking away from bad deals", "language": "en", "text": "Sometimes the art of the deal is turning down the deal on the table.\n\nCritics feared President Trump’s career as real-estate mogul turned reality-TV star would find him all too ready in the Oval Office to accept foreign policy offers that promised favorable coverage and won a few news cycles.\n\nBut some of the biggest calls of his presidency — from North Korea negotiations to the Iran nuclear deal and now the freeze on talks with the Taliban — have shown Mr. Trump’s ability to walk away from the table, even when it seems like a deal could be within grasp.\n\nWhile the president has drawn criticism, including from some in his own party, for being too erratic and for revealing things on Twitter that foreign policy conservatives would prefer be kept out of the headlines, many analysts were praising Mr. Trump’s shrewdness on Monday keeping U.S. interests above the desire to get a deal just for the sake of getting a deal.\n\n“He understands the leverage game and I don’t think he gets enough credit for it,” said Michael Pregent, a senior fellow at the Hudson Institute.\n\n“We’ve seen it with the nuclear deal with North Korea and now we’ve seen it now with the Taliban,” Mr. Pregent said in an interview. “He’s not going to simply agree to do something just to get a deal … He understands that if you want a deal too badly, you end up with a bad deal.”\n\nOn Saturday, Mr. Trump announced that he was pulling the U.S. back from the nearly year-old talks with the Taliban on grounds the Islamist terror group had crossed a line by boasting of gaining leverage against America through a series of attacks that have killed dozens of Afghan civilians and four U.S. service members.\n\nMr. Pregent suggested the Taliban should have known — based on the hard line Mr. Trump has towed on other foreign policy fronts, particularly having unilaterally pulled the U.S. out of the 2015 Iranian nuclear deal even as allies criticized the move — that the president wasn’t going to cave to their tactics.\n\n“The best thing Trump has going in the foreign policy realm is that he walked away from the Iran deal,” Mr. Pregent said. “It gave him leverage elsewhere. North Korea wanted an Obama-era kind of deal and Trump has shown he won’t give it to them.\n\n“The Taliban wanted the same thing. They wanted concessions, legitimacy and a U.S. exit in exchange for promises they won’t allow groups like Islamic State and al Qaeda to continue to exist, even though they can’t control those groups,” he concluded.\n\nWith regard to North Korea, Mr. Trump walked away from his second summit with North Korean leader Kim Jong-un in February, saying the terms just weren’t right — that Mr. Kim was demanding sweeping sanctions relief for only a limited commitment to destroy part of his nuclear weapons arsenal.\n\nTalks with the North Koreans have essentially stalled since. But Mr. Trump has sought to keep the door open. He held a surprise handshake meeting with Mr. Kim on the border between North and South Korea in June, and then dispatched his North Korea envoy, Stephen Biegun, to offer working level talks — all while keeping sanctions pressure in place against Pyongyang.\n\nThe same approach appears likely to take shape with regard to the Taliban.\n\nMr. Trump has recalled his Afghanistan envoy, Zalmay Khalilzad and also asserted in a Saturday night tweet that if the Taliban “cannot agree to a ceasefire … then they probably don’t have the power to negotiate a meaningful agreement anyway.”\n\nBut the administration also appeared to keep the door open a tiny bit. Secretary of State Mike Pompeo, for instance, told CNN on Sunday that U.S. officials are “going to keep driving” toward a deal with the Taliban, although it will be up to the Afghan guerrilla group to decide whether talks can resume.\n\nThe catch, according to some analysts, is that Mr. Trump’s approach puts his administration at risk of not having anything major to show in terms of foreign policy breakthroughs as it heads toward the end of its third year.\n\n“It’s hard to point to a major success from the method that Trump has used for his foreign policy and I don’t see one coming around the corner,” said Brian Katulis, a senior fellow at the Center for American Progress.\n\n“What we have is an unpredictable and disruptive style of foreign policy … in which Trump prides himself in making these reality-TV-show type of public revelations via Twitter that surprise some of America’s closest partners to a point they increasingly feel like they can’t rely on the United States,” Mr. Katulis said in an interview.\n\n“Trump’s own foreign policy team that is actually involved in sensitive negotiations is also being undercut by his zigzags on policy, and things that he appears to even be making up via Twitter,” he said.\n\nAt issue most recently was the president’s revelation in a tweet Saturday night that he had secretly planned to allow Taliban leaders to visit Camp David for what could have been breakthrough summit with Afghan President Ashraf Ghani.\n\nThe revelation, as well as the notion of allowing the Taliban to visit the presidential retreat where the U.S. campaign against the group was first planned in the wake of Sept. 11 terrorist attacks nearly 18 years ago, outraged some lawmakers from both parties.\n\n“Camp David is where America’s leaders met to plan our response after al Qaeda, supported by the Taliban, killed 3000 Americans on 9/11,” Rep. Liz Cheney, Wyoming Republican, tweeted. “No member of the Taliban should set foot there. Ever.”\n\nRep. Adam Kinzinger, Illinois Republican and an Air Force veteran of the Afghanistan War, spoke similarly, saying the Taliban should not be “allowed in our great country. NEVER. Full stop.”\n\nFrom the other side of the aisle Monday, Sen. Robert Menendez, New Jersey Democrat and ranking member of the Senate Foreign Relations Committee, told reporters that while Mr. Trump is “more about the sizzle than the result,” even his efforts at sizzle still result in legitimizing people whom the U.S. should not be legitimizing.\n\n“The Taliban, who were those gave refuge to Osama Bin Laden and the perpetrators of September 11th, should never be invited to Camp David, number one. There should not be a negotiation that provides for results for them, without a peace that comes before,” he said.\n\nBut some conservative analysts have come to Mr. Trump’s defense, asserting the president used the social media platform with skill to scorn the Taliban in real time on the international stage, while also showing the militants what might have been — or could still perhaps be — if they show more respect to his negotiating position.\n\n“What the tweets reflect is Trump trying to shape the negotiating environment,” said James Carafano, a long-time analyst with the Heritage Foundation.\n\n“Trump does deals. He doesn’t do bad deals. The fact is he’s just not going to do a deal for the sake of a deal. Its not like Obama and Iran, with the ‘Oh, I’ll take any deal just to get a deal’ approach,” Mr. Carafano said in an interview. “Trump is willing to take the criticism for holding the hard line, even if that means there is no deal. He’s willing to own it.”\n\n“The whole Trumpian strategy is that he kind of leads with a stiff arm and then says, ‘Look I’m going to protect my interests.’ This makes the other guy realize there’s nothing to be gained by trying to undercut that, and then when the other guy says, ‘OK, let’s talk,’ great. Our interests are protected.”\n\n“It’s right out of the [Ronald] Reagan playbook,” Mr. Carafano said, referring to the former Republican’s president’s success in negotiations with the former Soviet Union. “Reagan showed the Russians we mean business, and then we say, ‘OK, let’s talk.’”\n\nHe added that critics are going to pounce on Mr. Trump no matter what the president does.\n\n“Before, they would criticism him on grounds he might make a deal with the Russians, the Chinese, the North Koreans, saying he’s going to make a deal just to make a deal,” Mr. Carafano said. “Then they criticize him for not making a deal. The criticisms are either blatantly partisan or incredibly superficial.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Sometimes the art of the deal is turning down the deal on the table.", "authors": ["The Washington Times Http", "Guy Taylor"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/09/Trump_51191.jpg-95ea9_c0-0-5472-3190_s1770x1032.jpg?84283544d3cc688d49296344fdb2455c1a0f271f", "published_at": "2019-09-09"}