{"pub": "huffpost", "url": "https://huffpost.com/entry/paul-rudd-meme-hot-ones-wings-look-at-us_n_5db1ad43e4b0131fa99ac121", "downloaded_at": "2019-10-24 23:52:28.015468+00:00", "title": "Paul Rudd Has A Hilarious New Meme That’s As Snarky As He Is", "language": "en", "text": "Paul Rudd eating spicy meatless wings has become a hot new meme.\n\nLast week, the ageless 50-year-old actor appeared on the popular YouTube series “Hot Ones.” On the show, celebrities eat progressively spicier and spicier chicken wings — or in the “Ant-Man” star’s case, spicier and spicier cauliflower — while answering questions.\n\nDuring the interview, Rudd (who says he’s not a vegetarian, but is trying to “become better” about eating so much meat) and host Sean Evans talk about what makes things funny, inadvertently creating a hilarious meme in the process.\n\nToward the end of the interview, Rudd gets the idea to put a little bit of every sauce on a cauliflower wing and eat it. As he preps a bite that may put him “in the hospital,” the “Living with Yourself” star says, “Look at us. Hey, look at us.”\n\n“Look at us,” Evans responds. “Who would have thought?”\n\n“Not me,” Rudd sarcastically retorts.\n\nTwitter users really latched on to the short exchange and with a few clever captions made it into one snarky meme that pretty much delivers the sentiment of being surprised by accomplishing a goal.\n\nTo check out some of the best spins on it, just scroll down.\n\nMe and my bank account after I've made $50 stretch for a week and a half pic.twitter.com/OrG3eIKkjp — DJ Suge Henry (@DJJordanJetson) October 20, 2019\n\nWhen you and your boo finally decide on a place to eat pic.twitter.com/fEdlU5T8EV — Anthony Rodriguez (@saint_papii) October 21, 2019\n\nwhen u end up in a whole 2 year relationship after what was supposed to be just a hook up pic.twitter.com/cVgEI4XN3F — unity (@unitycitlali) October 21, 2019\n\nMe and my sister hanging out like normal adults after beating the shit out of each other daily throughout our entire childhood pic.twitter.com/H4WCxeXXiX — Tinderella (@ballerguy) October 22, 2019\n\nWhen divorced parents come to their child's graduation pic.twitter.com/31HJr634Zo — Scuba Gooding Jr. (@scuba718) October 22, 2019\n\nAny time I actually have sex pic.twitter.com/QivUSd5uIL — ANW Pizza Parker 🏁🇹🇹 (@ShowofTheColton) October 19, 2019\n\nme at 7pm: guys i’m not going out again for awhile i can’t afford it\n\n\n\nme at 4am talking to myself in the club bathroom mirror: pic.twitter.com/hoVelgOxHE — luke (@houlets) October 22, 2019\n\nWhen you make next morning brunch plans when you’re hammered and then actually follow through with them pic.twitter.com/dWu31q0CQe — ry (@Mr__Tweeets) October 20, 2019\n\nWhen you both said “no strings attached” and end up catching feelings pic.twitter.com/iBVDLQBbRD — CONEJO LOCO (@FULLSENDMIGUEL) October 22, 2019\n\nme and my friends drunkenly eating McDonald’s at 3am after one of us threw up, one of us lost our ID and another texted their ex pic.twitter.com/lhw8TDnZe0 — kat (@_thegreatkatsby) October 22, 2019\n\n\"Bethesda announces a monthly subscription service for Fallout 76.\"\n\n\n\nThe last two remaining people playing the game: pic.twitter.com/z0DJxVYgL9 — SHARKK (@SHARKK_TOOTH) October 23, 2019", "description": "The “Ant-Man” star delivers the world’s most sarcastic affirmation in a funny clip from “Hot Ones.”", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5db1c59c210000d428ad3cf0.png?cache=4genv0f7q9&ops=1778_1000", "published_at": "2019-10-24"}