{"pub": "financialpost", "url": "https://business.financialpost.com/entrepreneur/small-business/how-these-small-businesses-are-making-money-while-working-to-transform-the-world-into-a-better-place", "downloaded_at": "2019-10-16 13:32:20.781370+00:00", "title": "How these small businesses are making money while making the world a better place", "language": "en", "text": "Jeff Ward was not familiar with the term “social enterprise” when he launched Victoria-based Animikii Indigenous Technology, his award-winning technology and digital media company in 2003.\n\nHe was 23 and recently returned home to Canada after living through the tech boom and bust in Silicon Valley.\n\n“I’m Ojibwe and Métis. As a technologist and Indigenous person in that environment and then seeing all the layoffs, I knew I wanted to do things differently,” Ward said.\n\nDifferent meant building a values-based for-profit business that would allow him to use his skill set and technology to support and advance Indigenous peoples.\n\n“There was and is a digital divide between Indigenous people and the rest of Canada,” he said. “I thought, our people need to get online and I can help them do that.”\n\nSocial enterprises are broadly defined as revenue-generating for-profit or not-for-profit organizations that want to be good citizens and make a positive social, economic or environmental impact. Their numbers are on the rise, largely due to two key trends: Growing consumer/investor awareness around the social impact of their spending and investing, and the increasing access to capital for social enterprise entrepreneurs.\n\nThe number of socially conscious consumers has risen by 170 per cent in the past 20 years and the global social finance market is projected to reach $1 trillion by 2020, according to Making an Impact: Ontario’s Social Enterprise Progress Report, a report by the province’s previous Liberal government.\n\nFor Ward, the timing of his business idea was right and the need was there. Ward incorporated Animikii, which means thunderbird in Ojibwe and is also his spiritual name, and began working with non-profits, First Nations and Métis communities on Indigenous-focused projects that in some way improve their lives.\n\nThat focus continues to advance Animikii’s growth across its service lines — software development, websites, graphic design and digital communications — turning the digital agency into a one-stop shop to help people get online.\n\n“Many Indigenous entrepreneurs are already running a social enterprise. They just aren’t calling it that,” said Ward, a Business in Vancouver 2019 40 under 40 Award winner and sought-after speaker on social enterprise. “This country was founded on business and social enterprise. The fur trade was an economic relationship where Indigenous people were exporting goods internationally for the benefit of our people and community.”\n\nAnimikii also funds a scholarship for Indigenous youth in technology and entrepreneurship.\n\n“That aspect of giving back for the benefit of community is ingrained in how many Indigenous people do business,” Ward said. “That’s also true of First Nations communities, which have an economic development focus. Individuals and entire communities are running social enterprises.”\n\nOf course, it’s not just Indigenous people who are interested in social enterprises.\n\nFor example, Umang Dua founded Mississauga, Ont.-based TrySight Inc., which develops products and technologies for people with low vision — defined as visual impairment that can’t be fully corrected with glasses, contact lenses, medication or eye surgery.\n\nDua launched TrySight in 2008 when he was 25 years old with the goal of making a social impact, having been inspired by his grandmother, who was losing her sight from low vision. The software engineer, who had worked as a consultant for IBM and become disillusioned with the corporate world, decided to solve her problem.\n\nAs a student at the Georgia Institute of Technology in Atlanta, he had designed a technology to help people living with amyotrophic lateral sclerosis, (also known as Lou Gehrig’s disease), who are unable to move or speak, to communicate. He wanted to have that same impact in his working life.\n\n“I wanted to know that I was making someone’s life better in some way,” he said.\n\nDua’s first product was computer screen magnification software that also read out emails, so anyone with low vision could access their computer. But it wasn’t until he attended a trade show in Florida in 2009 and landed a $500,000 order from the United Kingdom government that he knew the business could be a success.\n\nI wanted to know that I was making someone’s life better in some way TrySight founder Umang Dua\n\nTrySight recently received a $1-million grant from the federal government’s new Accessible Technology Program, which invests in hardware and software solutions that help Canadians with disabilities overcome barriers, to develop artificial intelligence-based glasses that will tell users what’s around them, and it has also benefited from tax credits from the Scientific Research and Experimental Development program.\n\nToday, Dua has eight employees and a suite of 10 products and four technologies used by 800,000 people in more than 16 countries. His clients are largely institutional — the Toronto District School Board is a significant client — and TrySight has increased revenues by 25 to 30 per cent increase each year over the past five years.\n\nSimilarly, Animikii during the past four years has grown to 11 full-time staff, five contractors and is hiring for three open positions. In 2016, Animikii became the first Indigenous company in Canada and second in North America to become a B Corporation, certifying it as a company whose entire social and environmental performance meets the highest standards.\n\n“Before that, it was, ‘Oh, you’re doing a niche thing.’ Now I’m receiving interest and validation from the mainstream social impact world,” Ward said.\n\nAnimikii this year received funding from Raven Indigenous Capital Partners, a new Indigenous-led venture fund that invests in Indigenous social enterprise.\n\n“We’re developing a new product focused around Indigenous data sovereignty that will allow people to design data sets, control their own data access and possess their own data,” Ward said. “We’re building a tool that will bridge that digital divide and hopefully scale Indigenous technology in a way never before seen.”\n\nFinancial Post", "description": "Social enterprises are on the rise amid growing consumer awareness around the impact of spending and increasing access to capital", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/social-enterprise.jpg", "published_at": "2019-10-16"}