{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/03/eugenics-francis-galton-science-ideas", "downloaded_at": "2019-10-03 07:11:08.968868+00:00", "published_at": "2019-10-03", "title": "In the twisted story of eugenics, the bad guy is all of us | Angela Saini", "language": "en", "text": "How should we remember historical figures who we know have done terrible things? It’s a dilemma we face more often, as universities and public institutions critically examine their histories, reassessing the past with 21st-century eyes. And over the last year, University College London has been in the midst of a historical inquiry into its role as the institutional birthplace of eugenics – the debunked “science” that claimed that by selectively breeding humans we could improve racial quality.\n\nWe tend to associate eugenics with Nazi Germany and the Holocaust, but it was in fact developed in London. Its founder was Francis Galton, who established a laboratory at UCL in 1904. Already, some students and staff have called on the university to rename its Galton lecture theatre.\n\nGalton’s seductive promise was of a bold new world filled only with beautiful, intelligent, productive people. The scientists in its thrall claimed this could be achieved by controlling reproduction, policing borders to prevent certain types of immigrants, and locking away “undesirables”, including disabled people.\n\nFacebook Twitter Pinterest University College London is investigating its role as the birthplace of eugenics. Photograph: Martin Godwin/The Guardian\n\nIn hindsight, it’s easy to say that only a moral abyss could have given rise to such a pseudo-scientific plan, not least because we have borne witness to its horrifying consequences through the 20th century, when it was used to justify genocide and mass sterilisations. And by the standards of today, Galton does resemble a monster. He was a brilliant statistician but also a racist (not just my assessment, but that of Veronica van Heyningen, the current president of the Galton Institute). He was obsessed with human difference, and determined to remove from British society those he considered inferior.\n\nYet as our critical gaze falls on Galton, are we losing sight of just how popular his idea was among so many Britons? In the early 20th century, a surprisingly broad roster of public figures aligned themselves with Galton’s vision. It attracted people on the left and right, prominent writers and intellectuals, leading scientists and politicians. Virginia Woolf, TS Eliot, DH Lawrence, Julian Huxley, Winston Churchill, Marie Stopes – all held eugenic views. Churchill was vice-president of the first International Eugenics Conference, held in London in 1912. Although there were notable critics, to be a eugenicist was to be firmly in the mainstream.\n\nThis was an age in which it was not unusual for scientists to believe that humans were divided into different species, some more advanced than others. Biologists proclaimed that it would be better for society if disabled and “mentally feeble” people hadn’t been born. Eugenics made it into government policy: the Mental Deficiency Act of 1913 institutionally separated those whom the state considered “mentally feeble” or “morally defective” from the rest of society, effectively preventing them from having children.\n\nTop university split in row over erasing ‘racist’ science pioneers from the campus Read more\n\nFrom our 21st-century vantage point, what do we do with this knowledge? Whom do we keep and whom do we condemn? The moral boundaries may feel clear. A eugenicist is a eugenicist. A racist is a racist. But if Galton is out, where does that leave everyone else? The guilty party isn’t merely Galton, or even eugenic ideology – it’s also the age in which he lived. The sad saga of eugenics teaches us not only that scientists can be wrong, but that the promise of a better, brighter future at the cost of innocent individual lives can be all too tempting to many. Teamed with the prejudices of the time, it can be devastating.\n\nPrimo Levi, corresponding with a German scientist he had worked under while imprisoned in Auschwitz decades earlier, wrote that he couldn’t accept the man’s plea that he hadn’t known what was happening around him. To cast Galton as the evil figure pushing eugenics may be to overlook the bigger truth that thousands were freely buying into his flawed theories, and that Britain was remarkably receptive to them. Too many happily ignored, and some even enthusiastically embraced, the implications of his plans – namely, that they might require innocent people to make sacrifices against their wishes.\n\nTempting as it is to single out Galton for condemnation, that instinct should be tempered by the sober understanding that the slope that sends society towards moral shame is built by many. We must remember Galton as who he really was, and see him in full glare with nothing erased. But dividing the world into good guys and bad guys allows us to wash our hands of moral complexity. The danger lies not just with the bad guys but with every one of us, and it is always there.\n\n•Angela Saini is a science journalist and author. Her two-part documentary series, Eugenics: Science’s Greatest Scandal begins on BBC Four on 3 October at 9pm", "description": "Francis Galton is rightly criticised for advancing this immoral, racist non-science. But his ideas were mainstream, says science journalist Angela Saini", "authors": ["Angela Saini"], "top_image": "https://i.guim.co.uk/img/media/6a927ea2b81747a22bc09a59942c204cd915eb9d/0_147_1373_824/master/1373.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=ca5a2f09ed9ad7909237f93926e295e3"}