{"pub": "nyt", "url": "https://nytimes.com/2019/09/14/business/chinese-train-national-security.html", "downloaded_at": "2019-09-15 10:55:55.953307+00:00", "title": "Fearing ‘Spy Trains,’ Congress May Ban a Chinese Maker of Subway Cars", "language": "en", "text": "President Trump and lawmakers from both parties are increasingly anxious about the economic and technological ambitions of China, which has built cutting-edge global industries, including those that produce advanced surveillance technology. Those fears have prompted Washington to take an expansive view of potential risks, moving beyond simply trying to curtail Chinese imports.\n\nIn addition to slapping tariffs on $360 billion worth of Chinese products, the administration has banned Chinese companies like Huawei, the telecom giant, from buying sensitive American technology. It is moving to curb the ability of firms to export technology like artificial intelligence and quantum computing from the United States to China. And Congress has given the administration expansive power to block Chinese investment on national security grounds.\n\nNow lawmakers have added a provision to a military spending bill that would prevent the use of federal grants to buy subway trains from state-owned or state-controlled companies, a measure that would effectively block CRRC’s business.\n\nThe bill has gained bipartisan support from lawmakers who say companies like CRRC pose a threat to the United States. Part of the concern is economic: Flush with cash from its rapid growth, China has pumped money into building globally competitive businesses, often creating overcapacity in markets like steel, solar panels and trains.", "description": "A Chinese train maker, the world’s largest, has contracts in Chicago, Los Angeles and Boston, but Congress may block it from securing any new contracts in the United States.", "authors": ["Ana Swanson"], "top_image": "https://static01.nyt.com/images/2019/09/15/business/14DC-CHINATRAIN-1/00DC-CHINATRAIN-01-facebookJumbo.jpg", "published_at": "2019-09-14"}