{"pub": "cbc", "url": "https://cbc.ca/news/canada/new-brunswick/chicken-recall-listeria-cooked-diced-cfia-1.5304034", "downloaded_at": "2019-10-02 02:28:21.350810+00:00", "title": "Cooked diced chicken recall over possible Listeria contamination now national | CBC News", "language": "en", "text": "A recall warning about imported cooked diced chicken meat due to possible Listeria contamination has been expanded to include more than 50 products supplied to hotels, restaurants, hospitals and other institutions across the country.\n\nThe Canadian Food Inspection Agency (CFIA) issued the updated advisory late Monday as part of an ongoing food investigation after a handful of reported illnesses in Ontario, Manitoba and British Columbia in recent months.\n\nThe brands involved include: AlimPlus Inc., Centennial Foodservice, Flamingo, Reuven International Ltd., Rosemount, Rosemount Sales & Marketing, Sysco Co., and Tip Top Poultry Inc.\n\nThe affected products were packaged between Jan. 22 and Sept. 24 and sold in sizes of 4, 4.54 and 13.64 kilograms, according to the CFIA.\n\nA detailed list of the recalled products, including the common names and Universal Product Codes (UPC), as well as photos of the labels, are available on the CFIA website.\n\n\"Consumers should not consume and distributors, retailers and food service establishments such as hotels, restaurants, cafeterias, hospitals and nursing homes should not sell or use the recalled products,\" the advisory states.\n\nFood contaminated with Listeria monocytogenes may not look or smell spoiled but can still make people sick, the health agency warns.\n\nFive people fell ill between April and June, and two additional cases dating back to November 2017 have also been genetically linked, according to the Public Health Agency of Canada.\n\nSix of the seven individuals, who are aged between 51 and 97, have been hospitalized.\n\nListeriosis can be treated with antibiotics.\n\nSymptoms of listeriosis can start within three days of eating contaminated food and may include fever, nausea, cramps, diarrhea, constipation, vomiting, headache or muscle ache.\n\nIn severe cases, the bacteria can spread to the nervous system, and it can be fatal. Symptoms of severe listeriosis usually begin within two or three weeks after exposure and can include severe headache, confusion, neck stiffness and loss of balance.\n\nPeople with weakened immune systems, over the age of 65 or pregnant are considered most at risk, according to the CFIA. Listeriosis during pregnancy can lead to premature delivery, infection of the newborn and stillbirth.\n\n\"The CFIA is verifying that industry is removing recalled product from the marketplace.\"\n\n5 chicken recalls since August\n\nAnyone who has any of the recalled products is advised to throw them out, or return them where they were purchased.\n\nThis recall update was triggered by CFIA \"surveillance activities,\" according to the advisory.\n\nIt comes on the heels of a previous recall issued on Sept. 27, which included fewer products. At that time, the extent of the distribution was listed as \"retail\" in Alberta, British Columbia, Manitoba, Nova Scotia, Ontario, Quebec, Saskatchewan and \"possibly national.\"\n\nThree other chicken product recalls were issued in August.\n\nAll five are related to the ongoing investigation. Based on the findings to date, Rosemount brand cooked diced chicken has been identified as a \"likely source of the outbreak,\" according to the Public Health Agency of Canada.\n\n\"Rosemount cooked diced chicken was supplied to institutions (including cafeterias, hospitals and nursing homes) where many of the individuals who became sick resided, or visited, before becoming ill,\" the website states.", "description": "A recall warning about imported cooked diced chicken meat due to possible Listeria contamination has been expanded to include more than 50 products supplied to hotels, restaurants, hospitals and other institutions across the country.", "authors": [], "top_image": "https://i.cbc.ca/1.5305189.1569969914!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/cooked-diced-chicken-meat-recall.jpg", "published_at": "2019-10-02"}