{"pub": "axios", "url": "https://washingtonpost.com/climate-environment/trump-pushes-to-allow-new-logging-in-alaskas-tongass-national-forest/2019/08/27/b4ca78d6-c832-11e9-be05-f76ac4ec618c_story.html", "downloaded_at": "2019-10-15 23:08:26.594658+00:00", "title": "Trump pushes to allow new logging in Alaska’s Tongass National Forest", "language": "en", "text": "Trump has taken a personal interest in “forest management,” a term he told a group of lawmakers last year he has “redefined” since taking office.\n\nAD\n\nPoliticians have tussled for years over the fate of the Tongass, a massive stretch of southeastern Alaska replete with old-growth spruce, hemlock and cedar, rivers running with salmon, and dramatic fjords. President Bill Clinton put more than half of it off limits to logging just days before leaving office in 2001, when he barred the construction of roads in 58.5 million acres of undeveloped national forest across the country. President George W. Bush sought to reverse that policy, holding a handful of timber sales in the Tongass before a federal judge reinstated the Clinton rule.\n\nAD\n\nTrump’s decision to weigh in, at a time when Forest Service officials had planned much more modest changes to managing the agency’s single largest holding, revives a battle that the previous administration had aimed to settle.\n\nIn 2016, the agency finalized a plan to phase out old-growth logging in the Tongass within a decade. Congress has designated more than 5.7 million acres of the forest as wilderness, which must remain undeveloped under any circumstances. If Trump’s plan succeeds, it could affect 9.5 million acres.\n\nAD\n\nTimber provides a small fraction of southeastern Alaska’s jobs — just under 1 percent, according to the regional development organization Southeast Conference, compared with seafood processing’s 8 percent and tourism’s 17 percent.\n\nBut Alaskans, including Gov. Mike Dunleavy (R) and Sen. Lisa Murkowski (R), have pressed Trump to exempt their state from the rule, which does not allow roads except when the Forest Service approves specific projects. It bars commercial logging.\n\nAD\n\nIn a statement, Murkowski said Alaska’s entire congressional delegation and the governor have sought to block the roadless rule.\n\n“It should never have been applied to our state, and it is harming our ability to develop a sustainable, year-round economy for the Southeast region, where less than one percent of the land is privately held,” she said. “The timber industry has declined precipitously, and it is astonishing that the few remaining mills in our nation’s largest national forest have to constantly worry about running out of supply.”\n\nAD\n\nAlaskan leaders have found a powerful ally in the president. Speaking to reporters on June 26, after meeting with Trump during a refueling stop at Elmendorf Air Force Base, Dunleavy said of the president, “He really believes in the opportunities here in Alaska, and he’s done everything he can to work with us on our mining concerns, timber concerns; we talked about tariffs as well. We’re working on a whole bunch of things together, but the president does care very much about the state of Alaska.”\n\nAD\n\nTrump expressed support for exempting the Tongass from the roadless rule during that conversation with Dunleavy, according to three people who spoke on the condition of anonymity to discuss internal deliberations. Earlier this month, Trump told Perdue to issue a plan to that effect this fall, these individuals said.\n\nIt is unclear how much logging would take place in the Tongass if federal restrictions were lifted because the Forest Service would have to amend its management plan to hold a new timber sale. The 2016 plan identified 962,000 acres as suitable for commercial timber and suggested no more than 568,000 acres of that should be logged.\n\nAD\n\nJohn Schoen, a retired wildlife ecologist who worked in the Tongass for the Alaska Department of Fish and Game, co-authored a 2013 research paper finding that roughly half of the forest’s large old-growth trees had been logged last century. The remaining big trees provide critical habitat for brown bears, Sitka black-tailed deer, a bird of prey called the Northern Goshawk and other species, he added.\n\nAD\n\nTrump has frequently talked with his advisers about how to manage the nation’s forests and signed an executive order last year aimed at increasing logging by streamlining federal environmental reviews of these projects. The president was widely ridiculed after suggesting during a visit to Paradise, the California community devastated by a 2018 wildfire, that the United States could curb such disasters by following Finland’s model, claiming that nation spends “a lot of time on raking and cleaning and doing things, and they don’t have any problem.”\n\nThe president has peppered Perdue with questions about forest management and has indicated that he wants to weigh in on any major forestry decision, according to current and former aides. Trump wanted to deprive California of federal funds in retaliation for the way officials managed the state’s forests, but he did not follow up on the plan.\n\nAD\n\nOne former Trump staffer, who spoke on the condition of anonymity to avoid retaliation, said forest policy has become “an obsession of his.”\n\nAD\n\nWhite House and Agriculture Department officials referred questions this week to the Forest Service, which declined to comment. But the three people who spoke on the condition of anonymity said it was forging ahead with an exemption at Perdue’s instructions.\n\nChris Wood, president of the environmental group Trout Unlimited, joined with local business owners and conservation and outdoors organizations in urging federal officials to make more limited changes to the rule. He said the shift could jeopardize the region’s commercial, sport and subsistence salmon fishing industry.\n\nAD\n\nAbout 40 percent of wild salmon that make their way down the West Coast spawn in the Tongass: The Forest Service estimates that the salmon industry generates $986 million annually. Returning salmon bring nutrients that sustain forest growth, while intact stands of trees keep streams cool and trap sediment.\n\nAD\n\nWood, who worked on the Clinton rule while at the Forest Service, said that in recent years, agency officials have “realized the golden goose is the salmon, not the trees.”\n\n“They need to keep the trees standing in order to keep the fish in the creeks,” Wood said.\n\nThe question of what sort of roads should be built in the United States’ remaining wild forests sparked intense battles in the 1990s, culminating in the 2001 rule affecting a third of the Forest Service’s holdings in a dozen states. Some Western governors, including in Idaho and Wyoming, challenged the restrictions.\n\nAD\n\nIn some cases, conservationists and developers have forged compromises. A decade ago, Idaho officials opened up roughly 400,000 acres of roadless areas to ease operations for a phosphate mine while protecting 8.9 million acres in exchange.\n\nAD\n\nBut in Alaska, consensus has been more elusive, with many state officials arguing that the limits have hampered development.\n\nThe Forest Service has approved at least 55 projects in roadless areas, according to the agency, including 36 for mining and 10 related to the power sector. Most win approval “within a month of submission,” according to an agency fact sheet.\n\nBut Robert Venables, executive director of the Southeast Conference, said permitting for some projects has taken years and made them too costly to complete. A proposal that would have lowered electricity costs in the Alaskan community of Kake by connecting its supply to neighboring Petersburg, he said, won approval only after a lengthy review, which imposed requirements that boosted the price tag into the tens of millions.\n\nAD\n\n“The roadless rule has shown itself to be very arbitrary and cumbersome,” Venables said in a phone interview. “Many projects have proven to be uneconomic because of the constraints here.”\n\nAD\n\nA number of businesses operating in the region back the current restrictions, arguing that the forest’s rugged landscapes, abundant wildlife and pristine terrain draw visitors.\n\nDan Blanchard, owner and CEO of the ad­ven­ture travel firm UnCruise Adventures , said in an interview that when he was working as a boat captain in the 1980s, “we had a difficult time avoiding clear cuts in southeast Alaska.”", "description": "The policy shift would reverse a 2001 rule curbing development in the world’s largest temperate forest.", "authors": ["Juliet Eilperin", "Reporter Covering Domestic Policy", "National Affairs", "Josh Dawsey", "Reporter Covering The White House"], "top_image": "https://www.washingtonpost.com/resizer/BfjpRbtAMVw2FueE-e3SZJ52u8E=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IMFOYHGILII6TFQVR4NDFFROAQ.jpg", "published_at": "2019-08-27"}