{"pub": "metro", "url": "https://metro.co.uk/2019/10/23/elderly-couple-refuse-move-pregnant-womans-reserved-seats-10969230", "downloaded_at": "2019-10-23 16:04:47.624640+00:00", "title": "Elderly couple ‘refuse to move out of pregnant woman’s reserved seats’", "language": "en", "text": "The couple allegedly said seat reservations ‘didn’t matter’ (Picture: @Manda_like_wine/Twitter)\n\nAn elderly couple refused to budge from seats a pregnant woman and her family had reserved, it is claimed.\n\nAmanda Mancino-Williams posted a photo online after she said she asked them to move from the table seats she had booked.\n\nThe 37-year-old said she had reserved the four seats on the Cheltenham to Nottingham route.\n\nShe claims the couple told her seat reservations ‘didn’t matter’.\n\nAmanda said the couple were also aware she was six and a half months pregnant.\n\nHer three children had to squeeze into two seats opposite the couple on the CrossCountry train.\n\nAmanda’s tweet (Picture: Manda_like_wine/Twitter)\n\nShe wrote on Twitter: ‘If a mum with 3 kids and bags has 4 reserved seats for a long train journey, and you’re sitting in their seats on a full carriage, don’t tell them that their tickets don’t matter in a posh voice and then say you’re not moving and refuse to make eye contact. Don’t be these people.’\n\nAdvertisement\n\nAdvertisement\n\nThe conductor helped them out by giving them the last remaining seat in first class, but Amanda said the situation should never have occurred.\n\nShe added: ‘I’d like to know what happens to those who remain in a spot that isn’t theirs. Are there no penalties?’\n\n‘This situation is not about my children not having manners enough to stand for the elderly. This is about a culture of bullying and entitlement.\n\n‘My kids and I were being fair and following rules and these two were not. They immediately switched into bully mode as they saw us approach, clearly aware that those seats were ours.\n\nHer three children had to squeeze into two seats (Picture: Manda_like_wine/Twitter)\n\n‘Given how easy it was for the conductor to move us to another carriage to diffuse the situation, had they been in real need, I’m sure they would have gotten moved as well. Instead they broke the rules and tried to make my children and I feel powerless. I don’t have time for that.’\n\n‘I would always give up a seat, reserved or not, for someone who needed it more. But for her to tell me that my tickets meant nothing and then refuse to acknowledge me? Do people just expect you to slink away?’\n\nA spokesperson for CrossCountry trains said: ‘It’s a shame when a family has reserved seats to travel together, to be let down by others who ignore the labels in the back of their chairs.\n\nAdvertisement\n\nAdvertisement\n\n‘However, we’ll be thanking our conductor for quickly resolving the situation and hope they all enjoyed the extra space in First Class.’\n\nThey added that people would be entitled to compensation if they reserved seats and were not able to use them or find alternatives.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "An elderly couple refused to budge from seats a pregnant woman and her family had reserved, it is claimed. Amanda Mancino-Williams posted a photo online after she said she asked...", "authors": ["Jen Mills"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_91467153_1571834350.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-23"}