{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/ap/article-7561303/Delle-Donne-leads-Mystics-WNBA-title.html", "downloaded_at": "2019-10-11 02:27:33.626432+00:00", "title": "Delle Donne leads Mystics to first WNBA title", "language": "en", "text": "WASHINGTON (AP) - The Washington Mystics have won their first WNBA championship, getting 22 points from Emma Meesseman and 21 from banged-up league MVP Elena Delle Donne to beat the Connecticut Sun 89-78 in Game 5 of the Finals on Thursday night.\n\nIt was a fitting conclusion to an entertaining series and WNBA season. This was the seventh series in league history that had gone to a deciding Game 5, and the home team has won five of them.\n\nDelle Donne, who has been dealing with a herniated disk in her back, scored four points during a decisive 8-0 run that gave the Mystics an 80-72 lead with under three minutes left.\n\nDelle Donne came to Washington three years ago in a trade from Chicago, hoping to get the Mystics their first title. She grew up about an hour from the city in Delaware and wanted to be closer to home. She's been battling injuries and illnesses all season, breaking her nose early on in the year. She still wears a mask to protect it. Delle Donne also wears a knee brace on her right knee after suffering a bone bruise last year in the WNBA Finals.\n\nThe victory gave coach Mike Thibault his first WNBA championship. The league's all-time winningest coach had reached the Finals three times in his career - twice with Connecticut - and last season with Washington, but fell short each time.\n\n___\n\nWashington Mystics forward Elena Delle Donne, right, drives against Connecticut Sun forward Alyssa Thomas during the first half of Game 5 of basketball's WNBA Finals, Thursday, Oct. 10, 2019, in Washington. (AP Photo/Alex Brandon)\n\nFollow Doug Feinberg on Twitter at https://twitter.com/DougFeinberg\n\n___\n\nMore AP sports: https://apnews.com/apf-Sports and https://twitter.com/AP_Sports\n\nWashington Mystics forward Elena Delle Donne, right, dribbles the ball next to Connecticut Sun forward Alyssa Thomas, left, during the first half of Game 5 of basketball's WNBA Finals, Thursday, Oct. 10, 2019, in Washington. (AP Photo/Nick Wass)", "description": "WASHINGTON (AP) - The Washington Mystics have won their first WNBA championship, getting 22 points from Emma Meesseman and 21 from banged-up league MVP Elena...", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/03/wire-19568258-1570760630-376_636x382.jpg", "published_at": "2019-10-11"}