{"pub": "fox", "url": "https://foxnews.com/world/boris-johnson-father-stanley-climate-change-activists", "downloaded_at": "2019-10-09 18:59:42.753321+00:00", "title": "Boris Johnson’s father joins climate activists his son panned as being ‘uncooperative crusties’", "language": "en", "text": "Boris Johnson’s father is joining the climate protesters that his British prime minister son has panned as being “uncooperative crusties\" living in “hemp-smelling” tents.\n\nStanley Johnson, speaking to a crowd of Extinction Rebellion demonstrators in London on Wednesday, said the activists have \"exactly the right things in mind\" with their demand to slash carbon emissions to zero.\n\nHe added that the eco-movement was \"tremendously important” and that “it is absolutely clear to me that we have been moving far too slowly on the climate change issue.\"\n\nThe elder Johnson’s comments come a day after his son called the protesters \"uncooperative crusties\" who should abandon their \"hemp-smelling bivouacs.\"\n\nCLIMATE PROTESTS RESULT IN HUNDREDS OF ARRESTS, CRITICISM FROM GERMAN OFFICIAL\n\nThe Oxford English Dictionary definition of crusties is a “group of homeless or vagrant young people, generally living by begging in cities, and characterized by rough clothes, matted, often dreadlocked hair, and an unkempt appearance,” the BBC reports.\n\n“On the point of non-cooperative crusties, I wear that badge with pride,” Stanley Johnson told the crowd Wednesday, according to The Guardian. “It’s one of the nicest things that has been said about me for a long time. A non-cooperative crusty, absolutely superb – do they taste good? That’s my thought, I think they do.”\n\nMore than 600 people have been arrested in London since protesters began blocking roads and bridges on Monday, part of a global wave of protests that have also hit New York, Paris, Berlin and Madrid.\n\n“If you want to protest, you can go to Trafalgar Square,” Metropolitan Police Commissioner Cressida Dick said in a video posted on Twitter. “If you act unlawfully we will arrest you and we will seize things that you are using to obstruct the highways in London.”\n\nBORIS JOHNSON'S BROTHER QUITS PARLIAMENT OVER BREXIT IMPASSE\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nPolice also posted a video Wednesday showing makeshift structures and other items that authorities have seized from the protesters.\n\n“We carried out proactive operations before the protest began and continue to remove equipment to ensure disruption to London is kept to a minimum,” the Metropolitan Police said.\n\nThis is not the first time a member of the prime minister's family has broken ranks with him in recent weeks. In early September, his brother, Jo Johnson, quit Parliament over the ongoing divide over the Brexit impasse in the legislature.\n\nThe Associated Press contributed to this report.", "description": "Boris Johnson’s father is joining the climate protesters that his British prime minister son has panned as being “uncooperative crusties\" living in “hemp-smelling” tents.", "authors": ["Greg Norman"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/stanley-johnson.jpg", "published_at": "2019-10-09"}