{"pub": "metro", "url": "https://metro.co.uk/2019/10/04/financial-security-buying-property-top-list-things-people-twenties-worry-10859185", "downloaded_at": "2019-10-05 05:48:51.839967+00:00", "title": "What people in their twenties worry most about", "language": "en", "text": "What’s keeping you up at night? (Picture: Ella Byworth for Metro.co.uk)\n\nWhat do you worry about?\n\nIf you’re in your twenties, the answer is probably ‘all sorts of things, all the time’.\n\nNew research from life insurance broker LifeSearch reveals that our 20s are the most worrying times of our lives, with three-quarters of those in their twenties saying they feel worried ‘all the time’.\n\nSo the good news is that if you’re feeling anxious, you’re not alone.\n\nMore than 2,000 adults aged 16 and above were asked about how often they worried and what exactly kept them up at night.\n\nThe things we’re currently worrying about in our twenties are a little different to the generations before us.\n\nWhile our baby boomers worried about nuclear war when they were in their twenties, today’s twenty-somethings are more concerned about climate change.\n\nBut other worries take up brain space across every generation, including financial security and mortality (nothing like the thought of the inevitable march towards death to add some cheer to your morning).\n\nWhat are we worried about? Top worries for those in their twenties today: The future Financial security The health/mortality of my loved ones My own health Getting on the property ladder Job security Climate change The economy Crime Violence My own mortality Political instability Top worries for baby boomers (51+) at the same age: Financial security Job security The future The health/mortality of my loved ones Getting on the property ladder My own health Violence Nuclear war My own mortality Crime Global conflict Societal tensions\n\nA little bit of worrying is normal. It’d be a bit weird to go through life completely stress-free.\n\nAdvertisement\n\nAdvertisement\n\nBut if you find your worries taking up your life or causing you intense distress, it’s important to reach out for support with your mental health. That might mean just chatting with a friend, speaking to a therapist, or going to your GP to talk about possible treatment options.\n\nThere are simple things you can do that we know reduce stress, too, so make sure you’re ticking all those key points off.\n\nEasy ways to reduce stress: Talk about your worries\n\nMake sure you’re sleeping well\n\nEat regular meals that make you feel good\n\nCut down on things that make you jittery, like coffee, energy drinks, and booze\n\nTry meditation or mindfulness\n\nDo some gentle exercise\n\nNeed support? Contact the Samaritans For emotional support you can call the Samaritans 24-hour helpline on 116 123, email jo@samaritans.org, visit a Samaritans branch in person or go to the Samaritans website.\n\nMORE: Natural treatments that can help with seasonal affective disorder\n\nMORE: Adorable dog’s face looks very human and people can’t get enough\n\nMORE: BrewDog launches a 50% beef, 50% vegan burger and it’s got people talking\n\nAdvertisement Advertisement", "description": "New research suggests that the majority of those in their twenties feel worried 'all the time'.", "authors": ["Ellen Scott"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/03/SEI_57643944_1570171636.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-04"}