{"pub": "investing.com", "url": "https://in.investing.com/news/commodities-news/preciousgold-firms-as-uschina-trade-dispute-worsens-ahead-of-talks-2001702", "downloaded_at": "2019-10-09 02:13:26.588471+00:00", "title": "PRECIOUS-Gold firms as U.S.-China trade dispute worsens ahead of talks", "language": "en", "text": "© Reuters. PRECIOUS-Gold firms as U.S.-China trade dispute worsens ahead of talks\n\nOct 9 (Reuters) - Gold prices firmed on Wednesday as tensions between the United States and China ratcheted up ahead of crucial trade talks later this week, sapping risk appetite, while concerns over Brexit added to bullion's safe haven appeal.\n\nFUNDAMENTALS\n\n* Spot gold rose 0.1% to $1,505.95 per ounce as of 0027 GMT. U.S. GCcv1 gained 0.5% to $1,511.40.\n\n* Asian stocks fell the most in a week, with MSCI's broadest index of Asia-Pacific shares outside Japan down 0.3%. MKTS/GLOB\n\n* Ahead of trade talks later this week, the U.S. government widened its trade blacklist to include some of China's top artificial intelligence startups, punishing Beijing for its treatment of Muslim minorities and ratcheting up tensions. U.S. President Donald Trump also said he hoped Beijing would find a humane and peaceful resolution to political protests in Hong Kong, adding that the situation had the potential to hurt their trade discussions.\n\n* The talks are getting underway ahead of a scheduled increase in U.S. tariffs on $250 billion worth of Chinese goods, to 30% from 25% on Oct. 15.\n\n* The U.S. Treasury yield curve steepened, driven by a falling two-year yield after Federal Reserve Chairman Jerome Powell flagged openness to further rate cuts and said the Fed would expand its balance sheet to ensure money markets function smoothly. Uncertainties on the U.S. political outlook supported bullion, after the White House said on Tuesday it would refuse to cooperate with an \"illegitimate, unconstitutional\" congressional impeachment inquiry, setting Trump on a collision course with the Democratic-led House of Representatives. Outside of the United States, the European Union accused Britain of playing a \"stupid blame game\" over Brexit on Tuesday after a Downing Street source said a deal was essentially impossible because German Chancellor Angela Merkel had made unacceptable demands. AHEAD (GMT)\n\n1200 Brazil IPCA Inflation Index MM\n\n1800 US\n\nFederal Open Market Committee releases\n\nminutes from its Sept. 17-18 policy meeting", "description": "PRECIOUS-Gold firms as U.S.-China trade dispute worsens ahead of talks", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC3L0HO_L.jpg", "published_at": "2019-10-09"}