{"pub": "hotair", "url": "https://hotair.com/archives/jazz-shaw/2019/10/22/six-months-jail-saying-bitch", "downloaded_at": "2019-10-23 12:18:45.231099+00:00", "title": "Six months in jail for saying “b*tch”", "language": "en", "text": "That’s the penalty you may face in Massachusetts next year if you utter the word “b*tch.” And/or a two hundred dollar fine, as well. But only if you say it in a negative tone. Presumably, dog breeders will still be allowed to say it, along with some of the more crude references to life being a b*tch, etc.\n\nSound crazy? Of course it does. But this is the Bay State we’re talking about and their legislators are going to bring back the age of civility even if they have to lock up half their population in the slammer. (Reason)\n\nMassachusetts is taking the fight against nasty words to the next level with a new state bill that would ban the use of the word bitch in certain contexts. State Rep. Daniel Hunt (D–Boston) has put forward H. 3719 that would prohibit the use of the big, bad b-word when deployed to “to accost, annoy, degrade or demean” another person. Anyone who did so would be considered a “disorderly person” under state law. Penalties could include fines of up to $200 or six months in jail. Hunt’s bill specifies that either the person called a bitch or a witness to the bitch-calling could report the crime to the police.\n\nThe Reason article does a good job of outlining the massive holes in this particular bill from a constitutional standpoint. As they point out, the Supreme Court has already ruled that there is no “happy talk requirement” in the First Amendment. You can’t ban people from saying a certain word if it’s being done with the intent of annoying or insulting them, but then let them use the exact same word in a different context. And it’s simply a suppression of unpopular speech.\n\nBesides, we’re talking about a word that, while unpleasant, shows up on network television shows during prime time. It didn’t even make George Carlin’s list of seven dirty words back in the day.\n\nI’m not defending the use of the word in reference to women, obviously. It’s highly inappropriate. I still remember my father’s tales about my grandfather when he was a young man. He wound up in a number of ugly fights based on this. You could call my grandpa quite a few insulting names and get nothing more than an argument. But if you called him a “son of a b*tch” he would start swinging without warning because he considered it an offense to his mother.\n\nThe bottom line here is that you can’t make everything that bothers you illegal. This much should be clear to state representative Hunt, who is engaging in a huge waste of time and resources trying to push through something that the courts will just immediately shoot down anyway. I’d go up there and tell him myself but he’d probably just tell me to stop b*tching.", "description": "Seriously?", "authors": ["Jazz Shaw", "John Sexton", "Karen Townsend", "Ed Morrissey"], "top_image": "https://hotair.com/wp/wp-content/uploads/2017/03/prison.jpg", "published_at": "2019-10-22"}