{"pub": "businessinsider", "url": "https://businessinsider.com/converse-renew-denim-chuck-70-review", "downloaded_at": "2019-09-14 01:51:13.091782+00:00", "title": "Converse is upcycling old jeans to make these sneakers, so no two pairs are identical", "language": "en", "text": "As brands and consumers become more aware of the negative impact that sneaker production has on the planet, sustainably made sneakers are becoming increasingly popular.\n\nThat's why back in June, Converse launched a new initiative (and product lineup) called Converse Renew, which set out to further reinvent and improve the brand's already iconic sneakers with more sustainable materials and production methods.\n\nRather than recycling plastic water bottles to create some sort of canvas or textile upper — as seen in its Renew Canvas collection— the second collection upcycles existing materials to create something new. The Converse Renew Denim collection takes old jeans that would overwise end up in a landfill and repurposes them into the uppers of the sneakers.\n\nConverse\n\nHow they're made:\n\nTo make the new collection happen, Converse teamed up with UK-based sustainable fashion brand and vintage retailer Beyond Retro to pick out used jeans in dark, medium, and light washes. One pair of jeans makes at least one pair of sneakers, and since the jeans aren't all the same, no two pairs of Renew Denim Chuck 70s are identical.\n\nSince the materials don't need to be broken down to be repurposed, a simple cut-and-sew technique is all it takes to produce the shoes. That means they're much more sustainable — and far more unique — than a basic canvas shoe.\n\nConverse/Amir Ismael/Business Insider\n\nConverse sent me a pair of the Renew Denim Chuck 70s to check out and they're easily my favorite pair of sustainable sneakers (and I've tried plenty for the sake of sharing the best brands with our readers).\n\nWhat makes the Converse Chuck 70 such a cool sneaker?\n\nYou don't have to be a sneaker expert to recognize the significance and impact the classic Converse Chuck Taylor All-Star has had on sneaker culture and footwear in general. It's been around for over 100 years and there's no chance it'll ever go out of style. With that said, it's a really good shoe — and in my opinion (and the opinion of many Converse collaborators), the Chuck 70 is even better.\n\nIt has a higher rubber outsole with rubber foxing around the perimeter, smaller rubber toe caps, and extra cushioning on the insoles. Other small but notable changes include additional stitching on the lateral and medial sides of the shoe, and a black heel logo. The changes make it more comfortable and better-looking than the original — and with unique denim uppers, the Renew Denim Chuck 70s feel more special.\n\nSizing and fit:\n\nBefore you order yourself a pair of Chuck 70s (or Chuck Taylor All-Stars), it's important to know that they run very big. You'll want to go a full size down for a good fit. I'm a true size 8 and after trying on that size, I went with a size 7 — even a 7.5 would have been too big.\n\nThe bottom line:\n\nPriced at $85 for low tops and $90 for high tops, the Renew Denim Chuck 70s only cost $5 more than original Chuck 70s, which is a small price to pay for a unique and sustainable style. We should all care about the impact the sneaker industry has on the planet — and the Converse Renew Denim Chuck 70s collection is a solid way to be a more mindful consumer without compromising style.", "description": "Converse's Renew Denim line uses upcycled jeans that would otherwise end up in a landfill to create the uppers of the sneakers. Here's what they're like.", "authors": ["Amir Ismael"], "top_image": "https://amp.businessinsider.com/images/5d7a7fcb2e22af079c7cafa6-1536-768.jpg", "published_at": "2019-09-13"}