{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/omotoso-trial-this-is-what-happens-when-a-judge-is-recused-20190214", "downloaded_at": "2019-10-07 20:08:50.528607+00:00", "title": "Omotoso trial: This is what happens when a judge is recused", "language": "en", "text": "The rape case against Nigerian pastor Timothy Omotoso is far from over; in fact, it will soon have to start all over again.\n\nThis is because the recusal of Judge Mandela Makaula will have the matter against Omotoso and his co-accused, Lusanda Sulani and Zukiswa Sitho – who are facing 63 charges and 34 alternative charges, which include rape, sexual assault and racketeering – restarted before a new judge, legal experts have told News24.\n\nPractically, this means a new judge and a completely new trial.\n\nAnd all evidence that has so far been heard by the court - including the stirring evidence given by Cheryl Zondi - will have to be presented afresh.\n\nThroughout the controversial trial, Omotoso's defence lawyer Peter Daubermann has attempted to have Makaula recuse himself.\n\nInitially, Daubermann pushed for the recusal of Makaula, accusing the judge of \"being biased\" following the testimony of Zondi, the first witness. He claimed he was \"too friendly\" with her.\n\nZondi testified that her life and those of about 30 others were those of sex slaves who would be called into Omotoso's bedroom, as and when he had interest in a particular woman, at a specific time.\n\nShe described Omotoso as a demanding, selfish predator who demanded that she perform \"horrible sexual acts\".\n\nThe 22-year-old has been hailed for her bravery and holding her own against what many supporters found to be an \"inhumane and unnecessary style of cross-examination\" by Daubermann.\n\nDuring cross-examination Daubermann at some point asked her just how deep she believed Omotoso had penetrated her and why she didn't scream.\n\nWhile Daubermann could not succeed in having Makaula recuse himself based on \"bias\" toward Zondi, he played his trump card when he confirmed to News24 last week that Makaula had agreed to recuse himself from the case and would provide reasons for the recusal on March 15.\n\nDaubermann said that he had a meeting with the State as well as Makaula in the judge's chambers on February 6, where he agreed to Daubermann's request to remove him from presiding over the trial.\n\n\"The judge has further agreed that his decision to recuse himself may be published,\" Daubermann told News24.\n\nIn a letter to the Director of Public Prosecutions in the Eastern Cape, Daubermann alleged that the State informed Omotoso's defence team that, during the trial, certain state witnesses had stayed in a guesthouse owned by Makaula.\n\nWhen can a judge be recused?\n\nAccording to former magistrate and practising advocate Deon Pool, the Omotoso matter is not an everyday recusal.\n\n\"This is quite unusual because a judge would normally not indicate [beforehand] that they were going to recuse themselves. Usually, a presiding officer recuses themselves when there is a perception of bias,\" Pool told News24.\n\n\"In other words, it's got to do with the eye of the beholder. If I as a layperson in court get the impression, from the manner in which the case is being conducted, that the presiding officer [judge] is being biased, then that is the test,\" Pool said.\n\n\"It is a very subjective test, but the purpose thereof is that, although it is a fine line to tread, it's still a judicial exercise. The presiding officer has to decide whether the perception that has been created by the proceedings can create the impression that there was bias against the accused or his/her defence,\" Pool emphasised.\n\nGiven the circumstances in the Omotoso case, considering the witnesses' sleeping arrangements, Pool said it was \"perfectly within reason\" to demand a recusal. \"That would create a perception of bias.\"\n\nWhat happens now?\n\nSo, once the judge is recused and a new judge takes over - does the trial just continue where it left off? Not so simple, says advocate James Grant.\n\n\"If a judge revises him/herself, the trial must start afresh. All evidence must be led again,\" Grant told News24.\n\nPool agrees. \"The trial starts again from the beginning as if nothing has happened before.\n\n\"But the record of the proceedings up to [the recusal] will be admissible in the coming proceedings.\"\n\nIn other words, if a witness has already testified, and that witness deviates from their earlier testimony, they can be cross-examined based on the previous court record, Pool said.\n\n\n\nPhephelaphi Dube, director at the Centre for Constitutional Rights, told News24 it would make sense to start a new trial.\n\n\"It would be difficult to separate which issues would have been impartial and which not - so it would be prudent to begin afresh,\" Dube said.\n\nThe Office of the Chief Justice told News24 that the case, which was initially postponed to April 16, will now be brought forward to March 15 by agreement between the State, the defence and the judge himself.\n\nA new judge will then have to be appointed before the trial can resume.\n\n\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "The rape case against Nigerian pastor Timothy Omotoso is far from over; in fact, it will soon have to start all over again.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/6486/04e886c142e4455987d2aabe6abd5486.jpg", "published_at": "2019-02-14"}