{"pub": "guardian", "url": "https://theguardian.com/careers/2019/sep/24/techs-diversity-push-is-it-making-a-difference-for-interns", "downloaded_at": "2019-09-24 13:38:36.334560+00:00", "title": "Tech's diversity push - is it making a difference for interns?", "language": "en", "text": "Internships remain a popular route into the tech industry. But male-dominated screening panels and gender-biased questions make it tough for women to land that all-important internship\n\nAny one of us could probably recall a depressing “women in tech” headline. Wise (Women in Science and Engineering) says that 23% of the people working in Stem roles in the UK are female, while PwC states that just 5% of leadership positions in the technology industry are held by women. In a sample of 1,000 US consumers by LivePerson, a US software company, only 8.3% could name a famous woman in tech; that fell to just 4% when LivePerson discounted any responses naming Siri or Alexa.\n\nHowever things are changing for women in tech, says Anna Brailsford, CEO at Code First: Girls, which works with companies and women to increase the numbers of women in tech. “Many established companies have made bold commitments to hiring a more balanced workforce,” she says. “Some have gone as far as committing to a 50:50 split.”\n\nBut how will they do this when there are simply more qualified male candidates in the sector? One way is to poach workers with some relevant skills from other companies and develop them internally. The second is to invest money into talent earlier, at the graduate recruitment stage, or before they enter the workforce at internship stage.\n\nYet even at internship stage, there are raised flags about gender discrimination.\n\n“Internships at popular technology companies are hyper-competitive and frequently awarded to those who have completed two years at university,” says Brailsford. “Currently, there is a disproportionate focus on computer science degrees, mainly because it is one of the few degree disciplines that will actually teach students how to code in some capacity. When we ask women what is inhibiting them from applying for an internship, they will often say entry requirements.”\n\nAccording to recruitment organisation Stem Women, the percentage of women graduating in computer science in 2016-17 was just 15%.\n\nRituja Rao was a journalism student who wanted to get some work experience before venturing into a career in tech. “I was sending out 50 applications a week, tweeting and emailing people for a weeklong shadowing or internship experience, but I found nothing,” she says, “I just wanted to get an insight before committing to a Stem degree, but I got turned down for any beginner opportunities.”\n\nEventually she was hired by London-based tech consultant Sparta Global, who took her on despite her non-technical background. “Diversity and inclusion are beyond what meets the eye,” says Rao. “As a young girl, I just didn’t think of Stem as a career, and I carried that with me into my adult life, because I felt that I didn’t have what it needs.”\n\nYet the tech industry depends on more young women to diversify its heavily male workforce. “Teaching them to code is one step, but getting them through the interview process for industry opportunities is another,” says Sparta Global’s diversity and inclusion lead, Gaia Caruso. “Many young women express a fear of coming across as ‘cocky’ or ‘demanding’ in the workplace, particularly if they are working in a temporary intern position.”\n\nThe perception is that their appointment is a box-ticking exercise, says Caruso. “Yes, many companies promote diverse workforces, but they don’t represent this with their interview panels.”\n\nBrailsford believes that many internships are still too hyper-competitive “and appear to value attributes more often associated with men”. We all accept that internships are a kind of extended job interview. “In my experience, internships that value teamwork, authenticity and project-based outcomes over competition and constant hard code testing stand a much better chance of creating an environment in which young women thrive.”\n\nThe tech companies have a job to do, Caruso suggests: “When promoting internships, use gender-neutral job descriptions to reduce impostor syndrome among women looking to enter a male-dominated industry. When screening potential interns, use diverse hiring panels, remove gender-biased interview questions, and actively report diversity and inclusion for hiring. When interns are on site, don’t allow your commitment to promoting a culture of gender-equality slide. Continued mentorship opportunities during internship experiences are also undervalued.”\n\nIncreasingly, companies are opting for sponsored education programmes in place of internships. Code First: Girls is partnering with a number of companies to co-create and deliver bespoke, company-accredited coding programmes for women. This, Brailsford says, offers companies the opportunity to invest in women from a wide variety of backgrounds, “not just those that have taken a coveted computer science degree”.\n\n“One common problem all women in tech face is peers treating women as if they’re not as knowledgeable or experienced as male colleagues,” says Lauren Allison, CEO of online course provider #techmums, “and I’m sure that is compounded for women in learning positions such as placements or internships.”\n\nShe adds: “It’s appalling that it’s 2019 and the small changes in statistics are seen as the situation ‘getting better’. There’s still a long way to go and the pace of change is disappointing. ‘Getting better’ isn’t good enough, and things need to change at a grassroots level.”\n\nBut for intern Lauren Ward the changes are being felt. She’s in the third year of her PhD and is interning in the audio team at BBC Research & Development at MediaCityUK in Salford. “The industry is still male dominated, but the fact that my PhD student cohort is currently female dominated indicates it might be shifting,” she says. “From the different organisations I’ve worked for, I’ve seen that a lot of the things necessary to support all different types of people pursuing a technical career are already in place, such as flexible working, a focus on good mental health in the workplace, and establishing good work-life balance.”\n\nCaruso says companies and individuals who follow this advice will reap the benefits: “A community of women who feel supported and treated fairly is the most effective PR tool to inspire future women in tech.”", "description": "Male-dominated screening panels and gender-biased questions make it tough for female interns to land that all-important internship", "authors": ["Hazel Davis"], "top_image": "https://i.guim.co.uk/img/media/229b46ca65c48f471ed12cc49809549a40cd3de5/0_0_4600_2760/master/4600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=25dccb1c4814bc27207faa5108848948", "published_at": "2019-09-24"}