{"pub": "yahoo", "url": "https://sports.yahoo.com/fantasy-sit-start-lineup-advice-for-every-week-5-game-214237573.html", "downloaded_at": "2019-10-06 07:24:57.481988+00:00", "title": "Fantasy Sit-Start: Lineup advice for every Week 5 game", "language": "en", "text": "Sit and start is relative and league dependent, so consider these suggestions more “fliers” and “fades” (note that some are targeted for DFS).\n\nGood luck with your Week 5 lineups.\n\nNew York Jets @ Philadelphia Eagles\n\nScroll to continue with content Ad\n\nStart: Jordan Howard\n\nSit: Robby Anderson\n\nIt’s never safe using a back in a committee, but Howard saw 18 touches last week, has scored four touchdowns over the last two games and should benefit from a positive game script with Philly nearly two-TD favorites at home and with this week’s biggest mismatch at the line of scrimmage.\n\n[Play in Yahoo’s NFL $350K Baller. $10 entry fee and $35K to first place]\n\nIt's tempting to use Anderson against an Eagles secondary that’s been lit up for the most fantasy points by outside receivers this season, but he’ll continue to be hindered by Luke Falk with Sam Darnold ruled out again. With his schedule and QB situation, few players have had a rougher beginning to the year than Anderson.\n\nTampa Bay Buccaneers @ New Orleans Saints\n\nStart: Jameis Winston\n\nSit in DFS: Alvin Kamara ($33)\n\nSince a poor Week 1 against a 49ers defense that currently ranks No. 2 in DVOA, Winston has gotten 9.4 YPA with eight TD passes over three games (averaging 324.3 passing yards) despite two road outings versus tough Rams and Panthers secondaries. He now gets a Saints defense that’s been ripped for the second-most fantasy points by quarterbacks this season, so Winston’s a borderline top-five QB option this week.\n\nKamara is a tackle-breaking monster but continues to be hampered by Drew Brees’ absence and gets a Tampa Bay defense that ranks No. 1 against the run in DVOA and has been the absolute worst matchup for fantasy backs. Temper your expectations for Kamara in Week 5.\n\nBaltimore Ravens @ Pittsburgh Steelers\n\nStart: Willie Snead\n\nSit: Jaylen Samuels\n\nStory continues\n\nSnead doesn’t see a ton of volume, so this is a flier recommendation for deep leagues, but he’s lined up in the slot 82% of the time this season, where Pittsburgh has allowed the most fantasy points in the entire NFL this year.\n\nSamuels is coming off a productive game and is a big lottery ticket to own right now, but James Conner appears good to go Sunday, and this week Pittsburgh’s game script will likely be different as underdogs.\n\nChicago Bears @ Oakland Raiders\n\nStart: Javon Wims\n\nStart in DFS: Darren Waller ($20)\n\nWith Taylor Gabriel ruled out again with a concussion, Sims is a deep sleeper this week facing a funnel Oakland defense that ranks 27th against the pass and top-10 versus the run in DVOA. This looks like a good week to fire up Allen Robinson in DFS ($19) as well.\n\nWaller leads all tight ends in target share and WOPR, and he’ll remain plenty busy Sunday with Tyrell Williams and J.J. Nelson banged up against a Bears defense that’s ceded just 3.0 YPC this season. The possible weather situation in London is somewhat mitigated thanks to Oakland’s short passing attack.\n\nArizona Cardinals @ Cincinnati Bengals\n\nStart in DFS: David Johnson ($30)\n\nStart: Auden Tate\n\nJohnson’s getting just 3.7 YPC this year but has seen 20 targets over the last two games. He’s benefited from Arizona’s league-leading pace and gets a Bengals front seven that’s been gashed for the second-most fantasy points by running backs.\n\nTate has seen 16 targets over the last two weeks (one game against Buffalo’s stingy secondary) and should remain active with John Ross and A.J. Green sidelined. The depleted Arizona secondary has been shredded for 8.5 YPA with a 10:0 TD:INT ratio while ceding a Passer Rating (118.4) only beaten by the tanking Dolphins.\n\nJacksonville Jaguars @ Carolina Panthers\n\nSit: D.J. Chark\n\nStart: Curtis Samuel\n\nChark has been terrific and has emerged as Jacksonville’s clear WR1, but he faces a tough matchup on the road as underdogs in a game with an over/under hovering around just 40 points. The Panthers have allowed only 5.2 YPA while recording an NFL-high 18 sacks this season, and Chark will likely see a lot of James Bradberry (who’s playing well) on Sunday.\n\nSamuel ranks top-10 in air yards, averaging nearly 25 fewer fantasy points than the rest of the group, suggesting some big positive regression is coming. He gets a Jaguars secondary that’s struggled covering wide receivers this season and will once again be missing Jalen Ramsey.\n\nCurtis Samuel is looking like a plus-play in Week 5, especially with Jalen Ramsey out. (Photo by Jennifer Stewart/Getty Images)\n\nMinnesota Vikings @ New York Giants\n\nStart: Kirk Cousins\n\nSit: Sterling Shepard\n\nThe Giants have defended the run better than the pass, as they’ve allowed the second-highest YPA (9.3) behind only the Dolphins this season, while DeAndre Baker and Janoris Jenkins both rank bottom-three in yards allowed in coverage. Both Adam Thielen and Stefon Diggs have “Squeaky wheel gets the grease” situations this week as well, so Cousins may also throw more than usual Sunday.\n\nShepard will start losing targets to Golden Tate now that he’s back from his suspension, moving him away from the slot and to the perimeter, where he’ll be matched up frequently with Xavier Rhodes on Sunday.\n\nNew England Patriots @ Washington Redskins\n\nStart: Phillip Dorsett\n\nSit: All Redskins\n\nDorsett didn’t produce last week, but it came against a tough Buffalo secondary, and most importantly, he saw nine targets with Antonio Brown gone. He and the rest of New England’s wide receivers have arguably the week’s most favorable matchup.\n\nTerry McLaurin is by far the most interesting fantasy property in Washington, but he’s banged up and a game-time decision. The Patriots have allowed just 6.8 ppg with a 0:10 TD:INT ratio and are off to one of the most dominant defensive starts to a season in NFL history (an easy schedule has helped). Colt McCoy gets the start Sunday, so wish him luck.\n\nAtlanta Falcons @ Houston Texans\n\nStart: Calvin Ridley, Will Fuller\n\nRidley has been a major disappointment, seeing just 23 targets (eight fewer than Mohamed Sanu despite Matt Ryan averaging 44 pass attempts per game, which is one fewer than the NFL record). Ridley remains plenty talented and gets a Texans defense that’s allowed the third-most fantasy points to outside receivers while being incredibly stingy against tight ends.\n\nBack to the well with Fuller, who was just overthrown on a would-be 75-yard touchdown last week and has more air yards this season than Tyler Lockett, Chris Godwin, Davante Adams, Amari Cooper, and Michael Thomas. Moreover, after three straight quiet weeks from DeAndre Hopkins, now is a good time to pay up in DFS ($33).\n\nBuffalo Bills @ Tennessee Titans\n\nStart: John Brown\n\nSit: Delanie Walker\n\nBrown hasn’t reached the end zone since Week 1 but saw 11 targets last game against a tough New England secondary and gets a boost this week after Josh Allen returned to a full practice Friday. He ranks top-10 in air yards and this week faces Malcolm Butler and company, who’ve ceded the fifth-most fantasy points to Brown’s primary side this season.\n\nWalker took a backseat in Tennessee’s passing game last week, seeing just two targets, and Sunday he faces a Buffalo defense that’s been the toughest against tight ends so far this season.\n\nDenver Broncos @ Los Angeles Chargers\n\nStart: Emmanuel Sanders, Austin Ekeler\n\nCourtland Sutton is coming off a big two-touchdown game and is in the middle of a breakout season, but Sanders is also playing well. He’s surpassed 85 yards in three of four games and should benefit Sunday from Casey Hayward shadowing Sutton, whereas the Chargers have allowed the sixth-most fantasy points to Sanders’ primary side.\n\nMelvin Gordon returns for real this week, but his role is unclear, and there’s no way Ekeler doesn’t remain heavily involved after leading all RBs in yards per route run this season and being close to the top in broken tackle percentage. The Broncos rank 26th in run defense DVOA, have yielded the fifth-most fantasy points to running backs and just lost Bradley Chubb for the season, so treat Ekeler as a borderline top-10 RB this week still.\n\nGreen Bay Packers @ Dallas Cowboys\n\nStart: Jimmy Graham\n\nStart in DFS: Ezekiel Elliott ($36)\n\nGraham saw nine targets last game and should be heavily involved Sunday with Davante Adams very iffy to play, Byron Jones draped on Marquez Valdes-Scantling and Dallas vulnerable against tight ends.\n\nElliott has started off somewhat slow after his holdout but encouragingly saw seven targets last week and sets up favorably for a huge breakout game against Green Bay’s run-funnel defense that clocks in No. 5 against the pass and No. 27 versus the rush in DVOA. The Packers have allowed 5.0 YPC and the third-most fantasy points to RBs this season, while Amari Cooper and Michael Gallup both aren’t 100% and face tough matchups. Dallas will miss LT Tyron Smith, but Elliott is the top running back on the board in Week 5.\n\nIndianapolis Colts @ Kansas City Chiefs\n\nStart: Jacoby Brissett, Damien Williams\n\nBrissett should hopefully get T.Y. Hilton back and faces a Kansas City team that’s allowed the ninth-most fantasy points to quarterbacks. The Chiefs defense plays better at home, but this game has by far the week’s highest total (56 points), and Brissett was quietly tied for the NFL lead with 10 TD passes before Russell Wilson played his fifth game Thursday night. That TD production isn’t sustainable with a 6.6 YPA, but Brissett should see good volume Sunday night (especially with a banged-up Marlon Mack) and should be treated as a top-10 QB this week.\n\nWilliams practiced fully all week and is expected to return Sunday night, and while his role isn’t totally clear, he doesn’t need to be KC’s lead back to still produce plenty of fantasy value (Darrel Williams either eclipsed 100 scrimmage yards or scored two touchdowns the last two games while never seeing 15 touches). The Chiefs are 11-point home favorites against a Colts defense that’s actually played terribly this season, ceding 5.5 YPC and ranking last in run defense DVOA (and ahead of only the Dolphins in overall defense). Damien is a flex option this week, while LeSean McCoy is a slam dunk RB1.\n\nCleveland Browns @ San Francisco 49ers\n\nSit in DFS: Nick Chubb ($26)\n\nStart: 49ers defense\n\nChubb is coming off a monstrous performance and is being treated as a true workhorse in Cleveland, but he has an extremely tough matchup this week on the road against a 49ers defense coming off their bye that’s allowed the fewest fantasy points to running backs this season. San Francisco is loaded on the defensive line but will be missing some components in its secondary Monday night, so paying up for Odell Beckham Jr. ($31) during the primetime DFS slate makes more sense.\n\nBaker Mayfield looked great last week against a depleted and disappointing Baltimore defense but gets a different beast Monday night versus San Francisco’s rested and No. 2 ranked unit in DVOA. The bye helped Nick Bosa get healthy (first time not on the injury report), and Cleveland’s shaky offensive line may be forced to pass protect more than wanted as underdogs who might again be without Greedy Williams and Denzel Ward on defense.\n\nFollow the Yahoo fantasy football crew on Twitter: Andy Behrens, Dalton Del Don, Brad Evans, Matt Harmon, Liz Loza, Scott Pianowski and Tank Williams\n\nListen to the Yahoo Fantasy Football Podcast", "description": "Dalton Del Don delivers his Week 5 Sits-Starts, including Curtis Samuel, who is continuing to build his rapport with Kyle Allen.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/6NitLkvWstYQTekc_K3MKQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/j69JCCkuA7_tOK3P2gQWtQ--~B/aD0xNTk3O3c9MjM5NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/6cbcde40-e6ef-11e9-aee7-375d1d6bbb4d", "published_at": "2019-10-04"}