{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/10/10/reporters-cnbc-nbc-news-become-tangled-leak-investigation", "downloaded_at": "2019-10-10 15:05:46.335823+00:00", "title": "Reporters at CNBC and NBC News become tangled in leak investigation", "language": "en", "text": "As the Justice Department made clear on Wednesday, Sessions meant business. It announced the indictment of 30-year-old Henry K. Frese of Alexandria on charges that he used his position at the Defense Intelligence Agency to pass along “TOP SECRET information regarding a foreign country’s weapons systems to a journalist,” according to a department press release on the matter.\n\n“As laid out in today’s indictment, Frese was caught red-handed disclosing sensitive national security information for personal gain,” Assistant Attorney General for National Security John C. Demers said in the release. “Frese betrayed the trust placed in him by the American people — a betrayal that risked harming the national security of this country. This is one of six unauthorized disclosure cases the Department has charged in just over two years, and we will continue in our efforts to punish and deter this behavior.”\n\nAD\n\nAD\n\nAccording to a search-warrant affidavit connected to the case, so-called “News Outlet 1” published eight stories between early May and mid-July of 2018, which contained “classified national defense information that relates to the capabilities of certain foreign countries’ weapons systems.” The court documents identify two reporters — “Journalist 1” and “Journalist 2” — with whom Frese allegedly communicated over the relevant period of time.\n\nThough the names are omitted, the clues are not: “In early July 2019, Journalist 1 and Journalist 2 co-authored an article related to topics similar to Journalist 1’s article containing classified NDI,” reads the search warrant affidavit. “On Journalist 1’s personal Twitter page, Journalist 1 Tweeted a link to the early July 2019 article, noting it was the first co-authored piece of the pair. On Journalist 2’s personal Twitter page, Journalist 2 Tweeted a link to the article and stated Journalist 1 was a ‘colleague’ who helped co-author the news article.”\n\nThose references appear to correspond with these tweets, from CNBC national security reporter Amanda Macias:\n\nAD\n\nAD\n\nNBC's @ckubeNBC and I break in our first shared byline.\n\n\n\nBeijing is in the midst of conducting a series of anti-ship missile tests in the South China Sea.\n\n\n\nThese contested waters serve as a gateway to global sea routes where approximately $3.4 trillion in trade pass annually. https://t.co/G6srwEoUbl — Amanda Macias (@amanda_m_macias) July 1, 2019\n\nAnd one from her counterpart at NBC News, Courtney Kube:\n\nWith my colleague @amanda_m_macias: Chinese military conducts anti-ship missile tests in South China Sea https://t.co/n5KD4c3MUi via @nbcnews — Courtney Kube (@ckubeNBC) July 1, 2019\n\nThe court documents suggest that the central figures in the indictment missed the rising paranoia among journalists and government sources that followed the Obama administration’s investigative overreach into leaks to the Associated Press and Fox News; its work in going after leakers from all corners of the government; and the Trump administration’s intensification of these tactics. For a half-decade or so, Beltway journalists — and national security types, as well — have obsessed over how to communicate with sources beyond the reach of search warrants, wiretaps and the like.\n\nAD\n\nIn this case, the communications presented law-enforcement authorities with a hanging curveball. For instance, the affidavit declares that Macias followed Frese on Twitter and Frese followed Macias on Twitter. “Search warrant returns from Twitter show that, seven days after FRESE accessed Intelligence Report 1 for the second time, Journalist 1 wrote a Twitter Direct Message (“DM”) to FRESE in which she asked whether FRESE would be willing to speak with Journalist 2.\"\n\nAD\n\nThe Erik Wemple Blog asked CNBC about the network’s source-protection methods. We haven’t received a response. A spokesman for NBC News declined to comment.\n\nIt gets worse, though: The affidavit states that via “open source records” search, the authorities were able to determine that Frese followed Macias on Twitter and Macias followed Frese on Twitter. That makes sense, especially when considering this additional fact: “Public records checks also show that FRESE and Journalist 1 had the same residential address from August 2017 through August 2018. Based on reviews of FRESE’s and Journalist 1’s public social media pages, it appears that they were involved in a romantic relationship for some or all of that period of time.”\n\nAD\n\nInstant conflict of interest. No journalist can report objectively on the defense establishment if he or she is involved romantically with a key source employed therein. Though court documents don’t explicitly cite all the stories that allegedly stemmed from Frese, there are several stories that rely on deep intelligence sourcing, including:\n\nAD\n\nCourt records make clear that law enforcement secured an order for electronic and wire monitoring of Frese’s phone, though there’s no indication the authorities sought to secure records from the journalists’ devices. “There’s nothing I’ve seen in there suggesting that they got records or content from reporters,” says Gabe Rottman, the director of the technology and press freedom project at the Reporters Committee for Freedom of the Press.\n\nThat bit of forbearance differentiates this investigation from the aforementioned AP and Fox News cases — in which the government seized records of journalistic communications — as well as the 2018 case involving New York Times reporter Ali Watkins. In that case, the FBI grabbed records of Watkins’ communications with James Wolfe, who’d served as security director for the Senate Intelligence Committee. Charged with lying to law enforcement about his communications with reporters, Wolfe carried on a romantic relationship with Watkins while she covered the committee for several publications. Wolfe pleaded guilty to one count of lying to the FBI.\n\nAD\n\nAll of which is to say that leak prosecutions are a serious business in Washington. In August 2018, former intelligence contractor Reality Winner was slapped with the longest sentence ever — five years and three months in federal prison — for leaking to the media. Frese faces a maximum of 10 years in prison under each of the two counts of “willful transmission of national defense information to persons not entitled to receive it,” according to the Justice Department release.\n\nAD\n\n“You’ve got 18 or 20 of these cases out there,” says Rottman, referring to the combined Obama-Trump tally. Along with the uptick in the number of cases, there’s an “increase in the severity of punishment,” as well. “Aggressive leak prosecutions chill news-gathering because they dissuade sources from coming forward with newsworthy information,” he says.\n\nRead more from Erik Wemple:\n\nAD", "description": "Prosecutions for divulging government secrets to the media are a serious business in Washington.", "authors": ["Erik Wemple", "Media Critic With A Focus On The Ups", "Downs", "Downs Of The Cable-News Industry.", "Media Critic"], "top_image": "https://www.washingtonpost.com/resizer/spgc1n-Pa0_SYySWqAYu4czz3P8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7Q4TOG2ZBJGFJOKQON5V2ULF3E", "published_at": "2019-10-10"}