{"pub": "mirror", "url": "https://mirror.co.uk/news/reggae-musician-caught-up-windrush-20573027", "downloaded_at": "2019-10-13 23:34:44.025308+00:00", "title": "Reggae musician caught up in Windrush scandal dies after battle for citizenship", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA man who spent years fighting for British citizenship has lost a battle with cancer, before satisfying his wish for one final holiday.\n\nReggae musician Jashwa Moses had hoped to travel freely with his British passport, which he was granted just months before his death in July.\n\nJashwa, who left Jamaica aged 12, spent years fighting for the right to call the UK home.\n\nThe musician had stopped travelling with his music back in the 90s - due to the possibility of deportation or being refused re-entry into the UK.\n\nThe 'Windrush generation' was named after the Empire Windrush - a ship that brought one of the first groups of West Indian migrants to the UK in 1948.\n\n(Image: BBC)\n\n(Image: BBC)\n\nWhile some individuals from this group were wrongly deported, others were wrongly detained, lost their jobs or homes or were denied legal rights.\n\nJashwa, who was a St Paul's resident, was forced to jump through hoops and made to sign stacks of official forms. It was eventually with the help of Bristol City Council deputy mayor Asher Craig that he was finally granted citizenship.\n\nBut Jashwa has died aged 64, before he had the chance to take advantage of his citizenship.\n\nA special edition of BBC Inside Out airing today follows Jashwa during his battle to call Britain home.\n\nHe told the BBC: “I’ve never felt as if I was accepted by the system.”\n\n“In the ‘90s I was travelling but then all of a sudden I hear of people and know people who went out of the country and somehow could come get back in,” he told the BBC. “As a musician what do you do? You travel.”\n\n(Image: BBC)\n\nJashwa moved to Southmead, Bristol, in 1968, where he worked as an apprentice for Rolls Royce before jumping into a career in music.\n\nHe started his solo career in St Pauls as Joshua Moses, recording singles like \"Pretty Girl\" and \"Rise Up\" and releasing three albums.\n\nThe father of five frequently went abroad to perform - but when the UK tightened its borders, all of this stopped.\n\nBack in November Jashwa told the BBC he was confident he would be granted citizenship.\n\nIt better be soon ‘cos you know I’m an ill man right now. I’m kind of diagnosed with the big C. And even the big C don’t frighten me.\n\n(Image: BBC)\n\n“But I really need my citizenship fast because I would like to go on holiday somewhere. I don’t know where. Doesn’t matter.\n\n“But just to be free and not burdened with the complexities of politics and politicians.”\n\nBut Jashwa would never get his holiday, nor see the Government compensation promised to victims of the 'Windrush scandal'.\n\nSpeaking to the BBC at a celebration of Jashwa's life, Bristol deputy mayor Asher Craig said she was \"really really shocked\" Jashwa passed away so quickly after being granted citizenship.\n\n(Image: BBC)\n\n“One thing about Jashwa was that he didn’t want to bring his burden to anybody. So at no time did I even consider that he would be passing away so quickly,\" she said.\n\n“This whole Windrush situation completely stressed him out and the fact that he was already suffering from cancer with that added pressure on top of it.\n\nAsher said despite Jashwa not being able to use his British passport in life, he would fly \"all over the world\" now.\n\n\"He has been set free,\" she said.", "description": "Jashwa Moses, who was unable to travel for decades through fear of being denied entry back into the UK, has passed away - just months after receiving citizenship", "authors": ["Alice Peacock", "Image", "Bbc"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20573317.ece/ALTERNATES/s1200/0_Jashwa-Moses-who-died-just-months-after-finally-being-granted-British-citizenship1.jpg", "published_at": "2019-10-13"}