{"pub": "zdnet", "url": "https://www.zdnet.com/article/in-nostalgic-move-microsoft-brings-back-powertoys-for-windows-10", "downloaded_at": "2019-09-07 02:09:41.592358+00:00", "title": "In nostalgic move, Microsoft brings back PowerToys for Windows 10", "language": "en", "text": "\n\nIt's hard to imagine now, but Windows PCs were once expensive and hard to use.* Ironically, that complexity and the geeky challenge of mastering PC technology was part of the appeal of PCs a quarter-century ago, when hobbyists made up a core part of the market.\n\nIn a bid to recapture some of that hobbyist enthusiasm, Microsoft this week released a Windows 10 version of one of the most beloved artifacts of that era. The 21st Century version of the old Powertoys project doesn't have nearly the breadth of its predecessor (yet), but it certainly has the 16-bit logo down cold.\n\nFor those who are too young to remember the original PowerToys, these were little utilities developed by the Windows 95 shell team and distributed free of charge to the community. The first collection included shell extensions that improved the Windows Explorer experience (like Command Prompt Here and Send To X, which eventually became an official part of Windows 10's File Explorer) and CabView (which allowed you to view the contents of compressed Windows setup files).\n\nThe Windows 10 reboot, now available at GitHub as version 0.11.0, so far includes only two actual utilities, but another four are on deck (see the PowerToys Backlog at GitHub) and another 10 are under active consideration.\n\nOf the two that are shipping now, the more interesting by far is FancyZones, which goes beyond the standard Windows Snap window-arrangement features to create customizable zones for dragging windows into neatly organized alignments. On wide desktop displays, for example, the option to place three windows side by side can be very useful.\n\nI suppose it's in keeping with the original spirit of the PowerToys brand, but I found the FancyZones utility a bit fiddly to set up and confusing to use, and it makes me wonder why something like this isn't already included in Windows itself.\n\nThe other PowerToy is more prosaic. Shortcut Guide offers a full-screen display of all the keyboard shortcuts associated with the Windows key. You hold down the Windows key and after a second a display pops up showing all the keys you can tap to accomplish a specific task. Cleverly, the guide positions the numbers 1 through 9 and 0 above the corresponding taskbar buttons.\n\nFor someone who's recently upgraded to Windows 10 from Windows 7, the Shortcut Guide could be a valuable learning tool.\n\nUnlike the original PowerToys, which were written by power users on the Windows Shell team and then shared with power users in the wider world, the 2019 version is open source. What remains to be seen is whether there are enough Windows 10 enthusiasts to keep that momentum going.\n\nStranger things have happened, though, so we'll see.\n\n*That's a joke, obviously.", "description": "At the dawn of the Internet era, developers on the Windows Shell team created some nifty utilities and shared them with power users in the Windows community. A quarter-century later, PowerToys are back, and this time they're open source.", "authors": ["Ed Bott"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/09/06/efc39192-2c3b-49a6-837c-47b856c6060e/thumbnail/770x578/bb03e2b49117bf619b81bb197be1b30b/powertoys-logo.jpg", "published_at": "2019-09-06"}