{"pub": "businessinsider", "url": "https://businessinsider.com/mick-mulvaney-trouble-white-houseukraine-scandal-2019-10", "downloaded_at": "2019-10-22 13:48:37.874248+00:00", "title": "The White House is 'trying to put the toothpaste back in the tube' after Mick Mulvaney's disastrous press conference", "language": "en", "text": "Acting White House chief of staff Mick Mulvaney is on thin ice after acknowledging last week that President Donald Trump held up Ukraine military aid because he wanted a politically motivated investigation into Democrats.\n\nThe White House has been doing damage control since then, but one Republican strategist in frequent contact with the White House told Insider its efforts were like \"trying to put toothpaste back in the tube.\"\n\nStill, Mulvaney is unlikely to be axed anytime soon for two main reasons.\n\nFirst, the White House is reportedly struggling to find people to replace Mulvaney. Second, Trump is likely aware that he's better off having Mulvaney on the inside rather than the outside.\n\n\"The calculus right now for the White House is they want to be on the outs with as few people as possible,\" the GOP strategist said. \"A couple of days of negative press is preferable to handing the Democrats another cooperating witness.\"\n\nVisit Business Insider's homepage for more stories.\n\nMick Mulvaney is on thin ice.\n\nThe acting White House chief of staff sparked a public firestorm when he acknowledged last week that President Donald Trump held up nearly $400 million of taxpayer-funded military aid for Ukraine in part because he wanted the Ukrainian government to launch a politically motivated investigation into Democrats.\n\nThe acknowledgment sent shockwaves through the White House and among the president's allies on Capitol Hill, who for weeks had said Trump did nothing wrong by pressing for the investigation because there was no quid pro quo involved.\n\nMulvaney's acknowledgment explicitly tying the aid to Trump's demand for investigations — and his defiant command that the public \"get over it\" — threw a wrench into every defense that had been trotted out in the wake of the controversy. It resulted in a hasty walk back from Mulvaney during the Sunday talk shows, and it also prompted the Justice Department and Trump's lawyer to release rare statements distancing themselves from Mulvaney's claims.\n\nThe White House has been in damage-control mode since then, but one Republican strategist in frequent contact with the White House told Insider that its efforts were like \"trying to put toothpaste back in the tube.\"\n\nRead more: 8 Trump officials made stunning revelations about how the president and Giuliani weaponized the State Department\n\n'What is Mulvaney even talking about?'\n\nMulvaney's job was in peril even before his disastrous press briefing. The Atlantic reported that the president had been souring on Mulvaney for weeks since the Ukraine controversy erupted, and his unforced error only exacerbated his situation.\n\nIndeed, the acting chief of staff's acknowledgment threw White House insiders into a frenzy, The Associated Press' Jonathan Lemire said on MSNBC Monday morning.\n\nLemire said people in Trump's inner circle were unhappy with the way Mulvaney was handling the impeachment inquiry, and his comments about the quid pro quo \"threw gasoline on that fire\" and left them wondering whether Mulvaney would be the next official to be shown the door.\n\nAt the heart of the scandal is a July 25 phone call Trump had with Ukrainian President Volodymyr Zelensky, during which the US president repeatedly pressed his Ukrainian counterpart to investigate former Vice President Joe Biden and his son, and help look into a debunked conspiracy theory involving a \"DNC server\" that would help discredit the FBI's Russia probe.\n\nTrump ordered a hold on the military aid days before that phone call. And while he never directly mentioned the aid during his conversation with Zelensky, the president said the US \"does a lot for Ukraine\" and then asked Zelensky to \"do us a favor, though,\" and look into the Bidens and the DNC server.\n\nRead more: 3 big reasons why Rudy Giuliani is the weakest link in Trump's inner circle as the Ukraine scandal widens\n\n\"Did he also mention to me in the past the corruption related to the DNC server?\" Mulvaney said last week, referring to Trump's reasons for withholding aid. \"Absolutely. No question about that. But that's it. And that's why we held up the money.\"\n\nABC News' Jonathan Karl immediately followed up and asked Mulvaney to confirm that \"the demand for an investigation into the Democrats was part of the reason that he ordered to withhold funding to Ukraine.\"\n\nMulvaney replied affirmatively, saying that \"the look back to what happened in 2016 certainly was part of the thing that he was worried about in corruption with that nation.\"\n\nMulvaney's statements landed with such a bang that they even drew a rare rebuke from the Fox News host and Trump loyalist Sean Hannity.\n\n\"What is Mulvaney even talking about?\" Hannity asked on his radio show shortly after the press briefing. \"I just think he's dumb. I really do. I don't even think he knows what he's talking about. That's my take on it.\"\n\n'A couple of days of negative press is preferable to handing the Democrats another cooperating witness'\n\nBut according to The New York Times, despite the negative press coverage, Trump wasn't angry enough to ax Mulvaney, a sentiment that shocked White House aides and prompted some to think the president wasn't fully grasping the gravity of the situation.\n\nMulvaney, meanwhile, also went about his business as usual in the chaotic aftermath of the press briefing. That might be because despite growing concerns about Mulvaney's usefulness, he's unlikely to lose his job anytime soon for two reasons.\n\nFirst, according to media reports, the White House is having a hard time finding candidates who could replace Mulvaney, who has held the \"acting\" title for nearly a year now.\n\nRead more: Mick Mulvaney publicly confirms Trump held up Ukraine aid for political gain\n\nSecond, and perhaps more importantly, the president and his confidants are likely aware that they're better off having Mulvaney on the inside rather than the outside.\n\nMulvaney has in recent weeks emerged as a central figure in the Ukraine controversy. In addition to being privy to the president's thinking, and speaking directly with Trump about issues at the heart of the impeachment inquiry, Mulvaney has also been named by several witnesses as being intricately involved in the president and Rudy Giuliani's pressure campaign on Ukraine.\n\nIf he were to start working with Congress, the ramifications could be hugely damaging for the White House.\n\n\"The calculus right now for the White House is they want to be on the outs with as few people as possible,\" the Republican strategist, who requested anonymity to discuss internal deliberations, told Insider. \"A couple of days of negative press is preferable to handing the Democrats another cooperating witness.\"\n\nA former White House official echoed that sentiment, telling The Atlantic that Trump \"will be feeling the pain of having pushed out Bolton at a very inopportune time.\"\n\n\"He won't make the same mistake with Mulvaney, however frustrated he may be with him,\" the official added. \"Now their interests are aligned. They sink or swim together.\"\n\nThat mind-set appears to have permeated through to staffers in recent days as well. According to The Times' Maggie Haberman, Mulvaney got significant support from a number of people at the White House senior staff meeting on Monday, including a round of applause.", "description": "The knives are out for Mick Mulvaney after he essentially acknowledged in a press conference that Trump promised a quid pro quo with Ukraine.", "authors": ["Sonam Sheth"], "top_image": "https://image.businessinsider.com/5d9006ec2e22af33b03176d5?width=1200&format=jpeg", "published_at": "2019-10-21"}