{"pub": "telegraph", "url": "https://telegraph.co.uk/rugby-world-cup/2019/10/26/south-africa-defence-coach-jacques-nienaber-remains-rassie-erasmus", "downloaded_at": "2019-10-26 11:15:56.899204+00:00", "title": "Why South Africa defence coach Jacques Nienaber remains Rassie Erasmus’ most trusted sounding board", "language": "en", "text": "Jacques Nienaber’s job description is South Africa defence coach. More frequently he is referred to as Rassie Erasmus’ right-hand man. In reality, their connection runs even deeper,.\n\nIt goes back to their days before professional rugby when they were in the army together and then studying at the University of Free State. \"In the army, you get fairly tight and then we went to university together,” Neinaber said. “Rassie stayed on in the army a little longer, he was much better in the army than I was. He was a very good tactician as you can see.”\n\nErasmus also made it as a player with Free State and then the Cats (now the Lions) in Super Rugby while Nienaber became a physiotherapist. Their bond only deepened as they would share wide-ranging discussions as Nienaber worked over Erasmus’ body. “Obviously when you’re a player and you’re lying on the bed you have a lot of discussions with the physio because you’re 45 minutes there and there was a lot of rugby discussions then,” Erasmus said. As soon as Erasmus moved into coaching with the Free State Cheetahs in 2004, he appointed Nienaber on his strength and conditioning staff. Slowly, Nienaber was able to shift his focus across to coaching defence, at a time when few teams employed a specialist in that position.", "description": "Jacques Nienaber’s job description is South Africa defence coach.", "authors": ["Daniel Schofield", "Maggie Alphonsi", "Danny Cipriani"], "top_image": "https://www.telegraph.co.uk/content/dam/rugby-world-cup/2019/10/26/TELEMMGLPICT000213184747-xlarge_trans_NvBQzQNjv4BqPSGJeyftEP9WNF5nKPELKYi42McaMWzoNEemnW6g8vI.jpeg?imwidth=1200", "published_at": "2019-10-26"}