{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/its-time-to-listen-to-the-teens", "downloaded_at": "2019-09-20 08:17:23.478351+00:00", "title": "It's Time To Listen To The Teens", "language": "en", "text": "Photo: AP\n\nSwedish teen activist Greta Thunberg landed in the U.S. earlier this month and has since injected a much-needed sense of urgency into the climate conversation. Her climate strike movement is gearing up for a huge global climate strike on Friday and Saturday. Thunberg will be in New York, but she’s taken to Washington, D.C. this week, including a stop by Capitol Hill to testify before U.S. Congress.\n\nThere’s one thing that’s become clear listening to her and other youth activists on the Hill: The world needs to listen to them and start acting like — in Thunberg’s words — our house is on fire. Because it is, and the time to put the flames out is dwindling.\n\nThe teen climate movement has had quite the impact in just a little more than a year. Thunberg’s solitary strike outside the Swedish parliament has morphed into a global juggernaut. More than 1.5 million young adults turned out for a global climate strike in March, and they’ll be in the streets again on Friday and Saturday at more than 3,000 planned strikes in 150 countries around the world.\n\nTheir five core demands are aimed at rapidly changing the world to avert climate catastrophe, and they’re asking adults to join them. Thunberg has clarified what those demands look like in the halls of power in the U.S. for the week leading up to the strike.\n\nIn a speech before Congress on Thursday, Thunberg delivered a more thorough accounting of her vision for the world, borrowing language from Martin Luther King Jr.’s “I Have a Dream” speech (emphasis added):\n\n“I am grateful for being with you here in the USA. A nation that, to many people, is the country of dreams. “I also have a dream: that governments, political parties and corporations grasp the urgency of the climate and ecological crisis and come together despite their differences as you would in an emergency and take the measures required to safeguard the conditions for a dignified life for everybody on earth. Because then we millions of school striking youth could go back to school. “I have a dream that the people in power, as well as the media, start treating this crisis like the existential emergency it is. So that I could go home to my sister and my dogs. Because I miss them. “In fact I have many dreams. But this is the year 2019. This is not the time and place for dreams. This is the time to wake up. This is the moment in history when we need to be wide awake.”\n\nFor decades, we’ve had scientific clarity about climate change: Its causes, its impacts, how to solve it, all of it. And yet, the world has failed to take heed of the facts. Instead, world governments have delayed action and in some cases, exacerbated the crisis by investing in natural gas, burning down the rainforest, and rolling back even limited climate regulations.\n\nWhat Thunberg and other teen activists have done is marry that scientific clarity with moral clarity, putting a face and a voice to the future generations who will suffer or be saved depending on the choices made by adults today.\n\nThunberg’s marriage of science and morality was on full display on Wednesday when she entered as her Congressional testimony last year’s report from the Intergovernmental Panel on Climate Change’s showing we have 11 years to get the world on track to averting climate disaster. And it was likewise in her speech, which shows she is just a teenager who wants to hang with her dogs instead of swatting away Republican hand-wavy bullshit.\n\nIt’s extremely relatable and also a stark reminder of how much adults and previous generations have failed the teens.\n\nNone of this is to say nobody has made a clear moral argument for addressing the climate crisis before. Small island states and frontline communities have been doing it for years. It’s worth having a conversation about why it took until now for people to start listening, but we’ll save that for another time.\n\nThe point is, it’s time to listen to the teens. Hell, it’s time to join them because doing so puts you on the right side of history and science.\n\n“I don’t want you to listen to me, I want you to listen to the scientists,” Thunberg said during her appearance before the House Climate Crisis Committee. “I want you to unite behind the science, and I want you to take real action.”", "description": "Swedish teen activist Greta Thunberg landed in the U.S. earlier this month and has since injected a much-needed sense of urgency into the climate conversation. Her climate strike movement is gearing up for a huge global climate strike on Friday and Saturday. Thunberg will be in New York, but she’s taken to...", "authors": ["David Tracy", "David Nield"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/c5jckbgyooky25l3phbl.jpg", "published_at": "2019-09-20"}