{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7564525/England-news-Roy-Keane-hits-Danny-Roses-abysmal-performance-Czech-Republic-defeat.html", "downloaded_at": "2019-10-12 00:42:35.447709+00:00", "title": "England news: Roy Keane hits out at Danny Rose's 'abysmal' performance in Czech Republic defeat", "language": "en", "text": "Roy Keane has lambasted Danny Rose for his performance in England's 2-1 defeat to Czech Republic on Friday evening.\n\nGareth Southgate's side surrendered their early lead to allow the hosts to get back into the game before Zdenek Ondrasek delivered the killer blow in the 85th minute to condemn the Three Lions to their first tournament qualifying defeat in 10 years.\n\nEngland's sloppy defending for both goals didn't go unnoticed and Keane was quick to point the finger at the Tottenham man for losing his concentration on multiple occasions.\n\nDanny Rose was the target of criticism for his role in the 2-1 defeat by Czech Republic on Friday\n\nRoy Keane labelled Rose's performance as 'shocking' and 'abysmal' after the defeat in Prague\n\nKeane said after the game: 'My concern always for these players, like [Harry] Maguire and [Michael] Keane – they’re in their mid-20s.\n\n'Sometimes these players don’t learn, you can’t keep waiting for these lads. Rose gave a performance tonight… my goodness. Someone’s got to get hold of that guy.\n\n'He was shocking, abysmal. I think he’ll be the same in another three or four years. Some players don’t learn from their mistakes. That’s the biggest problem. At the highest level you will suffer for it.'\n\nSouthgate admitted his side were dealt a reality check but ordered an immediate response from the Three Lions.\n\n'In terms of a wake up call we have had a lot of plaudits but there is a lot of work to be done to be a really top team – tonight was clear evidence of that.\n\nGareth Southgate said his side were dealt a reality check but ordered an immediate response\n\n‘Clearly that is not a night we wanted to be a part of. We did not play well enough, we conceded possession too cheaply, we did not create chances, we did not take good chances and we were too open out of possession, we gave the ball away,’ said Southgate.\n\n‘We have to respond in the right way, we have a couple of days to prepare and we have to reward our supporters with a better performance. There were not many positives. We accept defeat, and accept we have to be better than we were. We weren’t good enough.\n\n‘It is going to be an interesting couple of days because we have not had a result like that or a performance like that and we will learn a lot about ourselves over the next 48 to 72 hours.\n\n‘We have to respond in the right way.’", "description": "England's sloppy defending for both goals didn't go unnoticed and Keane was quick to point the finger at the Tottenham man for losing his concentration on multiple occasions.", "authors": ["Sam Mcevoy For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/22/19609582-0-image-a-30_1570831133504.jpg", "published_at": "2019-10-11"}