{"pub": "businessinsider", "url": "https://businessinsider.my/trump-ukraine-call-abuse-power-former-security-officials-statement-2019-9", "downloaded_at": "2019-10-03 23:44:53.765000+00:00", "published_at": "2019-09-27", "title": "About 300 former national security officials and ex-White House staff sign open letter accusing Trump of possible ‘unconscionable abuse of power’ over Ukraine call", "language": "en", "text": "caption President Donald Trump at the CIA headquarters in Langley, Virginia, on January 21, 2017. source Olivier Doulier/Getty Images\n\nAbout 300 former national security officials, White House staffers, and other ex-officials signed a letter describing President Donald Trump’s actions in a call with Ukraine as possibly constituting “an unconscionable abuse of power.”\n\nThey said Trump, in a call with Ukrainian President Volodymyr Zelensky, “appears to have leveraged the authority and resources of the highest office in the land to invite foreign interference into our democratic processes.”\n\nA White House memo summarizing the call shows that Trump asked Zelensky to investigate former Vice President Joe Biden and his son Hunter Biden.\n\nThe letter was coordinated by National Security Action, a pressure group that has long criticized Trump. Its signatories include many officials who served under Democratic presidents but also former Republican-era officials.\n\nVisit Business Insider’s homepage for more stories.\n\nAbout 300 former national security officials, diplomats, and ex-White House staff have signed a letter saying President Donald Trump appears to have committed “an unconscionable abuse of power” in a call with the leader of Ukraine and applauding the launch of impeachment proceedings against him.\n\nThe statement is signed by former intelligence officers, ambassadors, secretaries of state, major generals, chiefs of staff, and advisers from the US’s leading defense and security bodies including the CIA, the Department of Defense, and the State Department.\n\nIt was organized by National Security Action, an activist group that opposes what it calls Trump’s “reckless leadership.”\n\nThe statement said the many signatories had “long been concerned with President Trump’s actions and their implications for our safety and security.”\n\nIt noted that some had spoken out against Trump before while others were publicly doing so for the first time in the letter.\n\nRead more: The US’s top intelligence watchdog found Trump’s conduct so alarming it could expose him to blackmail\n\nThe document said new revelations that Trump asked Ukrainian President Volodymyr Zelensky to investigate former Vice President Joe Biden – a 2020 election rival – meant Trump “appears to have leveraged the authority and resources of the highest office in the land to invite foreign interference into our democratic processes.”\n\nIt added: “That would constitute an unconscionable abuse of power.”\n\ncaption The CIA logo. source Saul Loeb/AFP\n\nThe roughly 300 signatures, which take up 13 pages of the document, include those of former officials from:\n\nDepartment of Defense\n\nCIA\n\nOffice of the Director of National Intelligence\n\nWhite House\n\nDepartment of Homeland Security\n\nNational Security Council\n\nDepartment of Justice\n\nState Department\n\nHouse Armed Services Committee\n\nNavy\n\nArmy\n\nUSAID\n\nFEMA\n\nMarine Corps\n\nInternational Rescue Committee\n\nTreasury Department\n\nDepartment of the Air Force\n\nOffice of Naval Intelligence\n\nDefense Intelligence Agency\n\nNational Counterterrorism Center\n\nMany signatories are people who served under Democratic presidents, especially Barack Obama.\n\nBut the statement says it includes people who “worked across administrations of both parties to uphold and advance those national interests.”\n\nAmong those who signed are Nancy McEldowney, the ambassador to Bulgaria under President George W. Bush, and Matthew Olsen, who led the Justice Department’s national security division under Bush and the National Counterterrorism Center under Obama.\n\ncaption Ukrainian President Volodymyr Zelensky met with US President Donald Trump at the United Nations General Assembly in New York City on Wednesday. source REUTERS/Jonathan Ernst\n\n“Having worked across administrations of both parties to uphold and advance those national interests, we consider the President’s actions to be a profound national security concern,” the statement said.\n\nSome of its members have previously spoken out, the statement said, but “many of us have eschewed politics throughout our careers and, as a result, have not weighed in publicly.”\n\nThe statement was released in response to an explosive whistleblower complaint that forced the White House to publicly release a memo summarizing a phone call in which Trump asked Ukraine’s president to investigate Biden as well as aspects involving the 2016 US election.\n\nRead more: A timeline of Trump’s campaign to pressure Ukraine’s president into investigating Joe Biden\n\nThe complaint, from an anonymous intelligence officer, also alleged that White House officials were alarmed by Trump’s comments in the call, prompting them to try to “lock down” the statement and store it in a secure system typically used only for issues concerning national security.\n\nDemocrats launched a formal impeachment inquiry into Trump in response.\n\nThe National Security Action statement said that its signatories did not want to “prejudge the totality of the facts of Congress’ deliberative process” but that “there is no escaping that what we already know is serious enough to merit impeachment proceedings.”\n\nRead more: Trump is facing the biggest firestorm of his presidency because his own White House staffers blew the whistle on him\n\nIt said “all of us recognize the imperative of formal impeachment proceedings to ascertain additional facts and weigh the consequences of what we have learned and what may yet still emerge.”\n\n“We applaud those Members of Congress, including Speaker Pelosi, who have now started us down that necessary path,” it said.\n\nIt said using the office of the president to encourage foreign election interference “would represent an effort to subordinate America’s national interests-and those of our closest allies and partners-to the President’s personal political interest.”\n\nRead more: Trump officials were reportedly so alarmed by his Ukraine call that the transcript had to be printed out and passed around by hand\n\n“The introduction of any other considerations of the President debases our democracy, has the potential to make us more vulnerable to threats, and sends a message to leaders around the world that America’s foreign policy can be dangerously corrupted by catering to a single individual,” the statement said.\n\n“If we fail to speak up-and act-now our foreign policy and national security will officially be on offer to those who can most effectively fulfill the President’s personal prerogatives.”", "description": "Business Insider - The statement was signed by former officers, ambassadors, and secretaries of state from leading agencies including the CIA and the State Department.. Read more at businessinsider.my", "authors": ["Sinéad Baker", "Business Insider Us"], "top_image": "https://static.businessinsider.my/sites/3/2019/09/5d8df4982e22af135047781c.png"}