{"pub": "yahoo", "url": "https://finance.yahoo.com/news/apple-aapl-stock-buy-ahead-221252888.html", "downloaded_at": "2019-09-08 11:48:47.851584+00:00", "title": "Apple (AAPL) Stock Is a ‘Buy’ Ahead of Its September Event, Says Wedbush", "language": "en", "text": "Apple (AAPL) is expected to unveil a new line of iPhones next Tuesday at its annual September event, where the company reveals a slew of upcoming products. The company is not expected to announce a 5G iPhone just yet, but many look to see an improved camera, faster processor and new technology in its screen.\n\nWedbush analyst Daniel Ives has been looking forward for this day for months now. Ahead of the big event, Ives maintains an Outperform rating (i.e., 'buy') on Apple stock, with $245 price target, which implies about 15% upside from current levels. (To watch Ives' track record, click here)\n\nIves estimates about 300 million active iPhone users are in the \"window of an upgrade opportunity\" over the next 12 to 18 months. With this being the case, the analyst says Apple “recognize[s] this will be a crucial product cycle on the horizon,” and could “translate into roughly 180 million iPhone units sold in FY20.” Ives’ estimates shows iPhone demand increasing since last year, with the company planning on 75 million units for the initial iPhone 11 launch period, with the ability to raise to 80 million.\n\nFrom a product point of view, the analyst believes “the video capability on iPhone 11 Pro versions will be significantly stepped up with real time re-cropping technology,” while the iPhone 11 should be more durable with shatter resistant technology. Besides iPhone, Ives says Apple CEO Tim Cook could “tip the hand on the new AirPods version 3 set to be launched towards year-end ahead of (the) holiday season with these AirPods expected to have some design enhancements and will be waterproof with slightly higher price points expected.”\n\nOverall, Ives remains a bull on Apple. He says “the installed base of Apple remains the golden jewel and key to the valuation and our bullish thesis with iPhone 11 representing a key opportunity to catalyze these consumers into their next iPhone.” Its Services segment, which produces high-margin revenue, “is worth between $400 billion and $450 billion and still in the early days of being fully monetized,” as the company prepares to launch its streaming service this year.\n\nHow does Ives' bullish bet weigh in against the Street? It appears the analyst is not the only one enthusiastic on the giant’s prospects, with TipRanks analytics demonstrating AAPL as a Buy. Out of 28 analysts polled in the last 3 months, 16 are bullish on Apple stock while 11 remain sidelined, and only one is bearish. (See AAPL’s price targets and analyst ratings on TipRanks)", "description": "Apple (AAPL) is expected to unveil a new line of iPhones next Tuesday at its annual September event, where the company reveals a slew of upcoming products. The company is not expected to announce a 5G iPhone just yet, but many look to see an improved camera, faster processor and new technology in its", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/DryX.DBeA.TFfD12OM2dqw--~B/aD00ODI7dz0xNTA3O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/38dfa4c5c18c53764188bd9073b67fab", "published_at": "2019-09-06"}