{"pub": "yahoo", "url": "https://news.yahoo.com/turkeys-refugee-plan-met-widespread-085344382.html", "downloaded_at": "2019-10-11 12:55:05.325155+00:00", "title": "Turkey's refugee plan met with widespread skepticism", "language": "en", "text": "Turkey's President Recep Tayyip Erdogan speaks to his ruling party officials, in Ankara, Turkey, Thursday, Oct. 10, 2019. Erdogan says that there have been 109 \"terrorists killed\" — a reference to Syrian Kurdish fighters — since Ankara launched an offensive into Syria the previous day. Erdogan also warned the European Union not to call Ankara's incursion into Syria an 'invasion,' and renewed his threat of letting Syrian refugees flood Europe. (Turkish Presidency Press Service via AP, Pool)\n\nIn the face of widespread international criticism for his military foray into northern Syria, President Recep Tayyip Erdogan remains defiant, standing by his pledge to return as many refugees as possible to a border corridor that will be carved out by force.\n\n\"We will rebuild an area for 1 million people, for those who want to return to their country and don't have a home to go back to,\" he told members of his governing party on Thursday to widespread applause.\n\nOn Wednesday, Turkey sent its military into northern Syria after announcing plans to create a buffer zone which pushes back Kurdish militants and potentially allows some of the 3.6 million Syrian refugees settled in the country to return. The offensive was launched after U.S. President Donald Trump ordered the withdrawal of American forces in northern Syria, a decision that has been fiercely criticized around the world and within his Republican Party.\n\nOpponents of Turkey's offensive into northern Syria argue that the assault is purely aimed at driving out Kurdish fighters and U.S. lawmakers have warned of potential sanctions. The word betrayal is doing the rounds as Kurdish fighters proved pivotal in the fight against the Islamic State group.\n\nBut Erdogan's stated reason, according to Turkey observers who spoke to The Associated Press, faces overwhelming financial, political and practical obstacles.\n\n\"Calculate it: A bus carries about 50 passengers. How many buses would it take to drive them into this area? And how many housing units would you need to make sure that they are not just dumped out in the cold?\" Kemal Kirisci, a senior fellow at the Brookings Institution, said.\n\n\"These people have children in school, sick people in hospitals, jobs, some are married to Turkish nationals. All this complicates things. And where would the organizational and financial capacity all for this come from?\"\n\nAccording to the United Nations refugee agency, there 3.6 million Syrians registered in Turkey — a number that has risen steadily throughout the war — as well as more than 350,000 refugees from Afghanistan, Iraq, and elsewhere. Most are protected under Turkish law banning the forced return to a dangerous country.\n\nThe proposed security strip, 20 miles deep, would span across most of Syria's multi-ethnic northern border areas and rival administrations created by nearly nine years of civil war.\n\n\"Northeast Syria is a rural, underserviced region that can barely meet the needs of its already existing 5 million people. Turkey's campaign could devastate large areas of northeast Syria, making the Turkish plan all the more impractical,\" said Nicholas A. Heras, a senior fellow at the Center for New American Security, a Washington-based think-tank.\n\n\"Turkey's timeline for resettling refugees is both ambitious and impractical. This would be a project that would require billions of dollars of support for infrastructure, security, and housing.\"\n\nThe European Union has urged Turkey to halt its offensive while the prime minister of neighboring Greece, Kyriakos Mitsotakis, has accused Ankara of trying to impose \"a violent transformation of the demographic makeup of the region.\"\n\nTurkish officials say the returns would be voluntary, insisting that the operation will provide the stability needed to create an environment for resettlement.\n\nErdogan has accused the EU of failing to fully honor a 6 billion-euro ($6.6 billion) funding deal reached in 2016 to stop migrants from traveling westward to the Greek islands and European mainland. Erdogan angrily rejected international criticism of his military campaign.\n\n\"Hey, European Union!\" he said Thursday. \"Come to your senses. I repeat: Don't call this an invasion, it's not. If you persist, we will open the gates and send 3.6 million refugees your way.\"\n\nIt's a threat likely to have an impact, says Janroj Yilmaz Keles, senior research fellow in Politics at Middlesex University in London. \"Because of the refugee crisis, Europe is soft with Turkey. To prevent the refugees from coming to Europe, the price is being paid by the Kurds, and Europe knows this very well,\" he said.\n\nThe Brookings Institution's Kirisci adds: \"I hope I'm wrong but I have a sinking feeling: I think the European Union has a converging interest with (Erdogan). When it comes to refugees, the West may look the other way.\"\n\n___\n\nFollow Gatopoulos at https://twitter.com/dgatopoulos", "description": "In the face of widespread international criticism for his military foray into northern Syria, President Recep Tayyip Erdogan remains defiant, standing by his pledge to return as many refugees as possible to a border corridor that will be carved out by force.  On Wednesday, Turkey sent its military into", "authors": ["Derek Gatopoulos"], "top_image": "https://s.yimg.com/uu/api/res/1.2/oGd2P4rHSIyY.6QZQku5ZQ--~B/aD0zNjQ4O3c9NTQyODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/48505b14810926a53bf420d783f548e3", "published_at": "2019-10-11"}