{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/match-reports/liverpool-5-5-arsenal-5-20760126", "downloaded_at": "2019-10-30 23:28:17.144023+00:00", "title": "Liverpool 5-5 Arsenal (5-4 on pens): 7 talking points as Reds claim bonkers Carabao Cup win", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFootball. Bloodyhell.\n\nJurgen Klopp and Unai Emery both made 11 changes apiece to their starting lineups and Liverpool and Arsenal's respective 'B' sides duly went and produced one of the most ridiculous football matches you are ever likely to see in their Carabao Cup clash.\n\nLiverpool ran out victorious on penalties, but that barely told the story on a night where the opening goal was scored in the sixth minute, the final strike found the net in the 94th and there were eight goals in between.\n\nOn penalties, Dani Ceballos was the only man to miss, leaving Reds youngster Curtis Jones to find the inside of the post, the back of the net and send Liverpool into the quarter-finals.\n\nHere are seven talking points from a bonkers night on Merseyside.\n\n1. Hello, old friend\n\n(Image: AFP via Getty Images)\n\nSightings of Mesut Ozil have become increasingly infrequent this season, so much so that the in-joke on social media among Arenal fans during the match was 'this Ozil kid looks decent'.\n\nEmery has used five different players in the No.10 position in recent matches, at a time when the German hasn't even made the Gunners squad.\n\nBut here he was, back in the centre of the field at one of Europe's most famous stadiums, given the opportunity to do what used to mark him out as one of the world's elite: play football.\n\nThe 30 year-old certainly had an influence on proceedings here, as he brought craft and experience to a young Gunners attack.\n\nIt was his ball back into the area that saw a shot spilled and turned home by Torreira to get Arsenal level, and his cute through ball while under pressure to set Saka through to tee up Martinelli for the third.\n\nThere were other lovely touches and smart well-weighted passes too - not least the backheel for Maitland-Niles tap in as the ball was about to run out of play. Of course there were those moments where he looked disinterested; heck, they've been there throughout his career, they aren't going to stop now.\n\nBut if this was to be one of his final outings in a Gunners shirt, it was one to be enjoyed and rather fitting that, amid the waves of attack after attack, there was absolutely nothing going on defensively.\n\nHe was hooked just after the hour mark, at 4-4, with the more defensively-minded Matteo Guendouzi introduced; seemingly he wasn't doing something that was to Emery's liking (defending?) again.\n\nOr maybe, just maybe, his display had given Emery such food for thought ahead of the weekend meeting with Wolves that he's set to return to Premier League action.\n\n2. Bring back VAR?\n\n(Image: Getty Images)\n\nLiverpool made a good start to the game and duly took the lead thanks to Mustafi's own goal.\n\nThen Arsenal equalised, Torreira turning home despite being offside. In the Carabao Cup, there is no assistance for match officials and thus, the goal stood.\n\nAnd it was such a clear and obvious error that this is precisely why VAR has been introduced and you say 'see, this is why VAR is good for the game'.\n\nBut, alas, then you remember the other stuff.\n\n3. Martinelli proves dangerous in both boxes\n\n(Image: Getty Images)\n\nThe young Brazilian is making quite a splash since his summer arrival.\n\nTwo more predatory finishes in the penalty area mean the 18 year-old is up to seven in seven this season, and his movement was too good for Sepp Van den Berg.\n\nIt's probably best Arsenal keep him out of their own penalty area given his swipe at Harvey Elliott that handed the home side a spotkick.\n\nRegardless, he again showed more than enough to suggest he's got a very big future ahead of him in north London.\n\n4. Keita disappoints\n\n(Image: REUTERS)\n\nNaby Keita played his part in Liverpool keeping up their unbeaten record at Old Trafford with a smart cameo appearance 10 days ago and produced a fine display in the Champions League last weekend.\n\nBut on a night where the ex-RB Leipzig man was one of the senior men for the Reds, Klopp can only have been disappointed with the Guineans' display.\n\nHe was actually quite tidy with his passing all told, but too often Arsenal players were allowed to run off the back of him and, in a game that was utterly bonkers, he just looked well off the pace.\n\nHe's only just back from injury of course, but it was disappointing.\n\n5. Manic Mustafi\n\n(Image: Action Images via Reuters)\n\nShkodran Mustafi is a World Cup winner. Just let that sink in for a moment.\n\nArsenal paid £35million to sign him from Valencia. Now let that sink in.\n\nThis was another game where you see why the club's hierarchy are keen to sell. Unfortunately, they need to find a buyer.\n\n6. Oxlade-Chamberlain rising again\n\n(Image: PA)\n\nThere will be few better feel-good stories in football this season than the return of Alex Oxlade-Chamberlain to something like his very best.\n\nIt's easy now, 18 months removed from him suffering his injury in the Champions League semi-final against Roma, to forget just how good he was playing back then.\n\nHe had carved out a handy niche for himself in the centre of midfield, balancing with Mo Salah and Trent Alexander-Arnold down the Reds' right side. He had also won a starting spot in Gareth Southgate's England side - and would have been a starter at the World Cup.\n\nHis two goals and overall performance against Genk last week was splendid and this was another big step in the right direction.\n\nIt was not just about another terrific goal - an absolute rocket from 25 yards - but more about the speed at which he played and the sign that he is back trusting his body again.\n\n7. Stat attack\n\nAccording to Opta, Liverpool have only conceded five times at home twice in the last 66 years.\n\nThis was one of those occasions, with the other happening back in 2007.\n\nThe opposition then? Yep, Arsenal.\n\nThe competition? Yep, another bonkers League Cup night.", "description": "An utterly crazy night at Anfield ended with 10 goals, a penalty shootout and Liverpool heading into the last eight", "authors": ["Alex Richards", "Image", "Afp Via Getty Images", "Getty Images", "Reuters", "Action Images Via Reuters", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20760971.ece/ALTERNATES/s1200/0_Carabao-Cup-Fourth-Round-Liverpool-v-Arsenal.jpg", "published_at": "2019-10-30"}