{"pub": "guardian", "url": "https://theguardian.com/books/2019/sep/16/wont-stick-reports-of-margaret-atwoods-2019-booker-prize-greatly-exaggerated", "downloaded_at": "2019-09-16 23:14:47.867231+00:00", "title": "Won’t stick: reports of Margaret Atwood’s 2019 Booker prize win greatly exaggerated", "language": "en", "text": "Organisers rush to clarify that judges have not yet decided beyond the shortlist after bookshop brands copies of The Testaments as the winner\n\nThe Booker prize has stressed that it has not – yet, anyway – selected Margaret Atwood’s much-heralded sequel to The Handmaid’s Tale as this year’s winner, after a bookseller mistakenly displayed copies declaring it the 2019 victor.\n\nNovelist and academic Matthew Sperling posted an image from an unnamed bookshop of Atwood’s The Testaments on Twitter on Monday. Pictured alongside Lucy Ellmann’s Ducks, Newburyport, which bore a sticker highlighting its shortlisting, The Testaments instead boasted a sticker branding it the winner. “Don’t think you were supposed to use those stickers yet, lads...” wrote Sperling.\n\nMatthew Sperling (@matt_sperling) Don’t think you were supposed to use those stickers yet, lads... pic.twitter.com/cuiKJCV7AC\n\nThe Testaments is currently 2/1 to win at William Hill bookmakers, behind favourite Ducks, Newburyport at 7/4. Before news had a chance to get round to gamblers that the jury had made up its mind a month ahead of the prize ceremony, organisers were quick to clarify that the panel headed by Peter Florence had not yet ruled.\n\n“It will not be decided until the judges meet on 14 October 2019,” they said in a statement.\n\n“At shortlist stage for the Booker prize, display packs including shortlist sticker sheets and a winner sticker sheet are provided to booksellers and libraries across the UK. It seems that in this case a winner rather than shortlist sticker has been mistakenly applied.”\n\nA spokesperson added that they had not yet identified which bookshop had been overeager with their Booker winner stickers. “I’m afraid that we don’t yet know which shop it is. Once we do, we will ask them to remove the winner stickers to be replaced with shortlist stickers (though they may well have done so already),” they said.\n\nIn 2008, Will Self was inadvertently revealed as winner of the Wodehouse prize for comic fiction in the Hay festival programme – the same day the shortlist for the prize was announced.", "description": "Organisers rush to clarify that judges have not yet decided beyond the shortlist after bookshop brands copies of The Testaments as the winner", "authors": ["Alison Flood"], "top_image": "https://i.guim.co.uk/img/media/559686a8daca4fb1bd6a6bdf755553fd1a5d0acb/0_167_5004_3002/master/5004.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2fc6e9c36c24ebe733864441692197ee", "published_at": "2019-09-16"}