{"pub": "news24", "url": "https://news24.com/World/News/search-for-survivors-as-anger-mounts-over-italy-bridge-collapse-20180817", "downloaded_at": "2019-10-11 12:46:14.078621+00:00", "title": "Search for survivors as anger mounts over Italy bridge collapse", "language": "en", "text": "Rescue workers in Genoa toiled for a third night in the wreckage of a collapsed bridge, continuing the desperate search for people still missing after the accident, which left at least 38 people dead.\n\nItaly's populist government intensified its attacks on the viaduct operator amid rising anger over the tragedy and the structural problems that have dogged the decades-old Morandi bridge, which buckled without warning on Tuesday, sending about 35 cars and several trucks, along with huge chunks of concrete, plunging 45m onto railway tracks below.\n\nThe chance of finding survivors at this stage was slim and the unstable mountains of debris made the search operation dangerous, but rescue workers said they had not given up hope.\n\n\"We are trying to find pockets in the rubble where people could be - alive or not,\" fire official Emanuele Gissi told AFP.\n\nGenoa's chief prosecutor has said that between 10 and 20 people could still be missing under the huge piles of concrete.\n\nCranes and bulldozers are working to help clear the site as rescuers try to cut up and remove the biggest slabs of concrete.\n\n\"We will then send in dogs and rescue workers to see if we can find any signs of life,\" Gissi added.\n\nGovernment anger\n\nThe government has accused infrastructure giant Autostrade per L'Italia of failing to invest in sufficient maintenance - a claim the company denies - and said it would seek to revoke its lucrative contracts.\n\nShares in Atlantia, the holding company of Autostrade, slumped 22% by Thursday in the wake of the barrage of criticism.\n\nInterior Minister Matteo Salvini demanded that the company offer up to $570m to help families and local government deal with the aftermath of the disaster.\n\n\"If we've put up five million euros, they should offer 500 million,\" he told reporters.\n\n\"There needs to be an immediate, concrete and tangible signal for these families: they should put their hands on their hearts and in their wallets.\"\n\nThe collapse has prompted fears over other ageing infrastructure in Italy and abroad.\n\nAt least 38 people were killed, according to an update by Prime Minister Giuseppe Conte on Thursday.\n\nThe dead include children aged eight, 12 and 13, according to Salvini, while three Chileans and four French nationals are among those killed. Sixteen people were injured.\n\nOn Thursday evening the first residents of some buildings in the affected area were allowed to return home, though others are too badly damaged to save.\n\nRiddled with problems\n\nGenoa's Morandi viaduct was completed in 1967 and has been riddled with structural problems for decades, leading to expensive maintenance and severe criticism from engineering experts.\n\nIts collapse prompted the government to announce a year-long state of emergency in the region and day of mourning on Saturday.\n\nThe government, in power since June, has pinned the blame on Autostrade, which operates and maintains nearly half of Italy's motorways.\n\nAutostrade, which estimates it will take five months to rebuild the bridge, denies scrimping on motorway maintenance, saying it has invested over one billion euros a year in \"safety, maintenance and strengthening of the network\" since 2012.\n\nWith pressure mounting, it released a statement on Thursday saying ambulances would be able to travel on its roads toll-free from now on to \"further enable the precious rescue and aid operations\".\n\nAtlantia has slammed the threats to revoke its concessions and warned that the government would have to refund the value of the contract, which runs until at least 2038.\n\nThe disaster is the latest in a string of bridge collapses in Italy, where infrastructure generally is showing the effects of a faltering economy.\n\nSenior government figures have also lashed out at austerity measures imposed by the European Union, saying they restrict investment.\n\nBut the European Commission said it \"will not engage in any political finger pointing\".\n\nIt said Italy is set to receive around 2.5 billion euros of European funds for investments in network infrastructure, such as roads or rail, in the period from 2014 to 2020.\n\nMore than 600 people were evacuated from around a dozen apartments beneath the remaining shard of bridge.\n\nSalvini has said the buildings would have to be pulled down.\n\nWith little hope of returning home soon, many are staying with relatives, while local hotels and individuals have offered free lodging to those displaced.", "description": "Rescue workers in Genoa toiled for a third night in the wreckage of a collapsed bridge, continuing the desperate search for people still missing after the accident, which left at least 38 people dead.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7805/dc09a01270ee4972ba5c6ccedac1f7b4.png", "published_at": "2018-08-17"}