{"pub": "thehill", "url": "https://thehill.com/polls/248369-the-hill-poll-voters-say-presidential-election-more-a-choice-than-referendum", "downloaded_at": "2019-10-05 13:36:36.375168+00:00", "title": "The Hill Poll: Voters see election as choice, not Obama referendum", "language": "en", "text": "A clear majority – 61 percent – of likely voters consider the presidential election to be more of a choice between President Obama and Mitt Romney than a referendum on the president’s first term in office, according to a new poll for The Hill.\n\nJust over one-third — 34 percent — of voters said they considered the election to be a judgment on Obama’s job performance in the White House.\n\nThe results offer a measure of good news for Democrats, who have sought to frame the Nov. 6 election primarily as a choice between two candidates with different visions for the country.\n\nADVERTISEMENT\n\n“It is critical for the president that this is a choice, not a referendum,” said Wayne Lesperance, a political scientist at New England College in Henniker, N.H.\n\n“If your reelection is based on answering the question, ‘are you better off than four years ago,’ you can’t say ‘yes’ with a straight face. A lot of people are still hurting.”\n\nThe survey also includes some sobering findings for the Obama campaign.\n\nA majority of voters say their opinion of Obama has gotten worse since he took office, the poll found.\n\nForty-one percent said they have a “much worse” view of Obama now than in 2008; 11 percent said their opinion is “slightly worse,” while 38 percent overall said their view of him had improved.\n\nBy contrast, a near-majority of voters — 47 percent — say their view of Romney has improved as they have learned more about him, compared to 39 percent who said their opinion of the GOP candidate has become worse.\n\nThe poll findings may offer some comfort to Republicans because, even if the fall contest is a “choice election,” Romney has polled stronger than Obama on who is best to handle the economic recovery.\n\nRomney, who faced skepticism from the Republican right during the GOP primaries, has also grown on conservative voters as time has passed, the poll found.\n\nSeventy-three percent of self-identified conservatives said their view of Romney has improved the more they have heard and learned about him.\n\nThe poll of 1,000 likely voters was conducted for The Hill by Pulse Opinion Research on Sept. 6, the final day of the Democratic convention in Charlotte, N.C.\n\nIt is considered accurate within 3 percentage points.\n\nDemocrats devoted much of their time and effort in Charlotte to drawing contrasts between Romney and Obama — painting the Republican as inexperienced on foreign policy and out of touch with the concerns of average voters.\n\nObama, in his convention speech last Thursday, stressed several times to voters “you have a choice” in the direction the country takes for the next four years.\n\nRepublicans, meantime, have sought to define the election as a verdict on Obama, whose approval ratings overall wallowed below 50 percent until he got a post-Democratic convention bump. The president’s approval rating has been below 40 percent on his handling of the economy. Romney has repeatedly said, “this president cannot tell us that you’re better off today than when he took office.”\n\nThe Hill Poll found 67 percent of centrist voters — who are key to victory for both candidates — consider the vote a choice rather than a referendum. Among those who said they were neither Republican nor Democrat, 65 percent considered the election a choice.\n\nDemocrats would likely greet the poll results as “fantastic,” Lesperance said.\n\nWhile the Democratic convention showed Obama would be comfortable with the election being a referendum on some issues, his campaign is less interested in having voters passing judgment on him based on the economy’s overall performance.\n\n“To some extent the president is fine with the election being a referendum on getting (Osama) bin Laden and some of the other successes — but not on the economy,” Lesperance said.\n\nAccording to the poll, voters paid close attention to both the Democratic and Republican conventions. Thirty-seven percent of voters said they are more likely to vote for Obama after seeing the political conventions, while 37 percent said they are more likely to vote for Romney. Another 25 percent said the conventions made no difference.\n\nThe majority of the poll was conducted on Thursday before Obama’s primetime speech, but 7 percent of the voters were polled during the president’s remarks.\n\nAmong women, 39 percent said they were more likely to vote for Obama because of the conventions while 35 percent said they were more likely to vote for Romney.\n\nBoth Republicans and Democrats made explicit appeals to female voters at their conventions.\n\nThe poll offers a mixed view of how centrist voters, and those who are neither Republican nor Democrat, responded to the events in Tampa, Fla., and Charlotte.\n\nForty-four percent of centrists said they were more likely to vote for Obama because of what they saw and heard at the conventions, while 22 percent said they were more likely to vote for Romney.\n\nForty-two percent of voters who identified themselves as being neither Republican nor Democrat said they were more likely to vote for Romney after seeing the conventions, while 27 percent chose Obama.\n\nClick here to view data from The Hill Poll.", "description": "A clear majority consider the election a choice between Obama and Romney, rather than a referendum on the president’s term.", "authors": [], "top_image": "https://thehill.com/sites/default/files/thehill_logo_200.jpg", "published_at": "2012-09-10"}