{"pub": "zdnet", "url": "https://www.zdnet.com/article/dfat-seeks-to-upgrade-its-digital-asset-management-system-with-saas", "downloaded_at": "2019-09-30 05:29:47.424300+00:00", "title": "DFAT seeks to upgrade its digital asset management system with SaaS", "language": "en", "text": "The Department of Foreign Affairs and Trade (DFAT) wants to replace its existing digital asset management system (DAMS) with a singular, secure, centralised Software-as-a-Service (SaaS) DAMS that can be used to create, share, and access existing and future digital assets such as images, videos, audios, multimedia items, and documents.\n\nThe department said its current DAMS faces several issues and limitations, as it is not centralised, and materials are generally stored in non-digital formats in the department's electronic document and record management system or on unapproved systems.\n\nIt adds that its current system doesn't meet the requirements for information, records, and privacy management, nor is its current collection of audio-visual materials complete, both in volume and associated metadata.\n\nOn the security front, DFAT said the current system \"does not have good security controls\", highlighting how materials that are locked down should be more widely available and that the current decentralised system has made it difficult to achieve this.\n\nAt the same time, audio-visual materials cannot be accessed beyond the work area that it's currently stored in and there is only a very limited public-facing collection, the department outlined in its request for tender (RFT) document.\n\nSee also: Top 5 ERP systems that will help your enterprise digitally transform (TechRepublic)\n\nDFAT said the new system needs to be accessible to all DFAT staff and portfolio agency -- including approved public users, such as non-government organisation staff -- in over 180 locations across 87 countries.\n\nOther requirements that DFAT is looking for in its new system include: Search functionality that is based on metadata and integrated with the DFAT website; being able to have all files stored within the audio-visual library be unclassified; DFAT staff accessibility for all content that is cleared for internal and public use through the intranet; for all systems to be easily grouped in sub-libraries; the ability to see upload size information as well as instructions on next steps clearly; and to be able to upload files to a secure storage container that can be used to store or transfer content for up to 30 days prior to making it accessible to users through a preconfigured workflow, among others.\n\n\"It is expected that the system will deliver a centralised, accessible system that offers security, structure, and ease of use,\" the document stated.\n\n\"It will also introduce new features to address issues that have arisen with the current system. The cloud-based System will need to enforce comprehensive metadata, enforce appropriate role-based security, be easily accessed around the world by posts through any device (mobile and desktop), track usage of materials (analytics), have an advanced search capability, interact/interface with other websites, as well as meet the requirement of a minimum of WCAG 2.0 AA, and information, records and privacy management.\"\n\nThe new system also cannot restrict content and file size, DFAT said, as it pointed out that the current system does not have any scalable option to \"enable future growth\".\n\nThe RFT is open until 28 October 2019, with an initial one-year contract on offer to 30 June 2021 and the option to extend it twice for one-year periods.\n\nRelated coverage\n\nForeign Affairs and Trade to split SAP and PeopleSoft ERP suppliers\n\nIt currently contracts a single supplier for both ERP systems, but now it wants to separate it.\n\nAmazon Web Services scores Australia-wide government cloud deal\n\n\n\nFollows the cloud giant in January receiving the green light to store highly sensitive workloads for Australian government entities on its platform.\n\nAustralia-wide AWS deal could signal the end for legacy IT procurement\n\n\n\nThe whole-of-government deal with Amazon Web Services highlights a new approach to IT procurement and a better level of understanding where cloud is concerned.\n\nForeign Affairs and Trade on the hunt for collaboration-as-a-service platform\n\nThe Australian-hosted 'collaboration' platform will be used to work on national security, global economic developments, and international aid policy.", "description": "New system be used to create, share, and access existing and future digital assets such as images, videos, audios, multimedia items, and documents.", "authors": ["Aimee Chanthadavong"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/01/24/923a3095-a9f8-4297-aa7b-c3e4780aeabb/thumbnail/770x578/ede46b8dfa9d9aeba2c37e2a3ef4e35a/documents.jpg", "published_at": "2019-09-30"}