{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7607613/Carrie-Bickmore-lined-host-2DayFMs-breakfast-show.html", "downloaded_at": "2019-10-26 00:33:09.461835+00:00", "title": "Carrie Bickmore is 'lined up to host 2DayFM's breakfast show'", "language": "en", "text": "The radio industry is abuzz with rumours that Carrie Bickmore will front 2Day FM's Sydney breakfast show next year.\n\nAccording to Radio Today, the popular TV personality 'is in negotiations' to join current host Jamie Angel on the program in 2020.\n\nCarrie already hosts an afternoon show for the SCA-owned Hit Network alongside comedian Tommy Little.\n\nCan she break the 2DayFM curse? The radio industry is abuzz with rumours that Carrie Bickmore will front 2Day FM's Sydney breakfast show next year. Pictured on The Project\n\nIt comes amid rumours that Channel 10 executives will soon be meeting with the longtime host of The Project to renew her contract.\n\nSome sources have indicated that Carrie's estimated annual salary of $750,000 may double to $1.5million in order for Channel 10 to keep her exclusively.\n\nMeanwhile, there has been speculation Carrie could potentially join Nine's struggling Today show next year - but Radio Today insists this isn't going to happen.\n\nPart of the family: Carrie already hosts an afternoon show for the SCA-owned Hit Network alongside comedian Tommy Little (left). Pictured at the ACRAs in Brisbane last week\n\nThe industry website quoted a source as saying: 'Ignore the Channel Nine rumours.\n\n'[The] new 2DayFM Breakfast show for 2020 is Carrie Bickmore and Jamie Angel. SCA wants a younger version of [WSFM breakfast show] Jonesy & Amanda. It will take time, but this should work well.'\n\nWhen contacted for comment, Hit Network boss Gemma Fordham said: 'Carrie and Tommy are part of the Hit Network's Drive plans for 2020 and beyond.'\n\nCarrie, a mother-of-three, has previously said she could not handle the workload of hosting The Project and a breakfast radio show.\n\nWill she stay or will she go? It comes amid rumours that Channel 10 executives will soon be meeting with the longtime host of The Project to renew her contract\n\nThe Project airs from 6:30pm to 7:30pm weekdays on Channel 10. Breakfast radio shows begin airing at 6am, but hosts are expected to be in the studio much earlier.\n\n2Day FM has been struggling to find a successful format for Sydney breakfast since the departure of Kyle and Jackie O in late 2013.\n\nIts most recent attempt, Grant, Ed & Ash, was axed in August and replaced by a music-only program hosted by former Triple M content director Jamie Angel.", "description": "The radio industry is abuzz with rumours that Carrie Bickmore will front 2Day FM's Sydney breakfast show next year.", "authors": ["Tom Place", "Jo Scrimshire For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/21/20151624-0-image-a-4_1571948351505.jpg", "published_at": "2019-10-24"}