{"pub": "cbc", "url": "https://cbc.ca/kidsnews/post/is-this-fake-or-real-tips-on-how-to-spot-fake-news-election-edition", "downloaded_at": "2019-10-03 23:30:03.104547+00:00", "published_at": "2019-09-23", "title": "Is this fake or real? Tips on how to spot fake election news", "language": "en", "text": "The facts about disinformation and misinformation\n\nYou’ve heard the saying “fake news” tossed around in the media, on social platforms and the web.\n\nIt’s been used to describe all sorts of things, from conspiracy theories to political spin.\n\nFake news, also known as disinformation, is often circulating around us.\n\nPoliticians have even used the term to damage the reputations of media outlets they don’t like.\n\nNow that the race to elect the next prime minister is underway, Canadians should keep a sharp eye out for what’s real and what’s not.\n\nPeople on all sides of the political divide will be blasting information to influence public opinion and the vote.\n\nSo it’s important to keep in mind that some of what you’re seeing might not be true.\n\nWhy care if you’re not old enough to vote?\n\nWhat you learn now will help you make informed decisions when you are old enough to vote.\n\nPlus, fake news is everywhere, not just in politics.\n\nKnowing how to detect it affects everything you read or hear.\n\nHow can we tell the difference between what’s fact or fiction?\n\nThere are two ways the truth gets distorted. Disinformation and misinformation.\n\nDisinformation is false information spread deliberately to mislead people.\n\nMisinformation is when a person or group shares information without realizing it’s not true.\n\nBoth can show up in a number of ways.\n\nA good example would be the use of memes.\n\nMemes can include a false quote or made-up fact pasted on an image, and since memes are easy to share online, it can be spread quickly.\n\nBecause memes are not linked to any sources, they can’t be fact-checked, making it easy to use to fool people into believing they're true.\n\nFake memes\n\nA meme that circulated online earlier this year claimed Prime Minister Justin Trudeau spent Victoria Day at a mosque. In reality, the image used of Trudeau was captured at an Eid al-Adha celebration in September 2016.\n\nEid al-Adha is celebrated in Muslim communities throughout Canada around the 10th to the 13th days of the final month of the Islamic calendar.\n\nThis meme used an image of Justin Trudeau attending Eid al-Adha, an annual Muslim celebration, in September 2016 to spread false information about the prime minster visiting a mosque on Victoria Day of this year. (Facebook)\n\nThe purpose of the fake meme was to create the impression that Trudeau favours Muslim Canadians over other Canadians, which is not true.\n\nThis in turn could sway those who are anti-Muslim to stop supporting Trudeau and the Liberal Party.\n\nOld stories being shared online like they are new\n\nAnother way to spread falsehoods is to share information out of context, causing people to misunderstand its meaning.\n\nFor example, sharing old news stories as if they're new.\n\niPolitics published a story in 2016 featuring Andrew Scheer, now leader of the Conservative Party, saying he supported cancelling government funding for CBC's news division.\n\nThe comment was made before Scheer was elected leader of the Conservatives.\n\nDespite that, it was shared by multiple Facebook groups as recently as May of this year.\n\nWithout noting the original date of the story when shared, it gave the appearance that Scheer made the comment recently, making it seem like it’s part of his election platform.\n\nEven though this iPolitics story is three years old, it was re-posted and shared many times without mention of the original publishing date, which made an old story seem like it was new. (iPolitics)\n\nBe wary of fake thumbnails\n\nA fake news article, posted on Sept. 2, that accused Jagmeet Singh of being wanted for terrorism in 15 countries, was shared more than 5,000 times online.\n\nIt was posted on an obscure blog called NBCM News.\n\nThe article itself isn’t real.\n\nApart from the title, photo and the first line of the text, the body of the false story was cut and pasted from the Wikipedia article on the 1985 Air India bombing.\n\nA blog called NBCM News posted this fake news story about NDP Leader Jagmeet Singh.\n\nAltered videos\n\nSomething else to look out for are videos posted online that are edited in a way that leaves out important details.\n\nOn Sept. 5, just days before the election was called, Canada Proud, a group that supports conservative politicians, posted a video on their Facebook page that was edited to look like Trudeau bought favourable coverage from journalists.\n\nCanada Proud posted this edited video of Justin Trudeau on their Facebook page. (Facebook)\n\nThe video was altered so that it ended at a point that made it seem like Trudeau was admitting to a bribe, when, in fact, the rest of his comment was cut out.\n\nHe was actually making a joke about the accusations.\n\nHere’s the original unedited video so you can see the difference.\n\nJustin Trudeau speaking at the Parliamentary Press Gallery Dinner at the Canadian Museum of History on May 4, 2019.(CBC)\n\nStephane Perault, Canada’s chief electoral officer, says there’s not much Elections Canada can do to stop fake news circulating about a candidate in the middle of an election.\n\nThat means it’s up to us to be extra careful in keeping an eye out for what’s fact or fiction.\n\nTips on detecting fake news\n\nMake sure to check the publisher’s credibility even if the information was shared by a friend.\n\nBe cautious of content in your social media feed or being promoted on a website known for clickbait.\n\nLook out for weird-looking domain names. For example, if you see something like “cbcnews.ca.co,” it’s designed to appear similar to “cbc.ca,\" but it’s not a legitimate site.\n\nCheck if the information you are reading is available on other sites or reported by credible news sources.\n\nCredible journalism is backed by fact-gathering, so a lack of quotes and contributing sources means the information might not be fact-based.\n\nUse fact-checking websites like snopes.com and eufactcheck.eu.\n\nWith files from CBC News", "description": "What is fake news, disinformation and misinformation and how to detect fact from fiction, what’s real or not.", "authors": [], "top_image": "https://www.cbc.ca/kidsnews//content/_card_resize/FakeNews_thumbnail.jpg"}