{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/british-police-a-man-and-woman-arrested-in-connection-with-39-bodies-found-in-truck-container/2019/10/25/558f91e8-f713-11e9-8cf0-4cc99f74d127_story.html?tid=pm_pop", "downloaded_at": "2019-10-26 07:46:11.105777+00:00", "title": "‘I’m dying because I can’t breathe’: Vietnamese families fear relatives among 39 bodies in truck container in Essex, U.K.", "language": "en", "text": "The text, released to media outlets by Tra My’s family, was received at 10:28 p.m. London time, which would coincide with when the container is thought to have been crossing the North Sea from Belgium on its way to Britain.\n\nThe truck was found early Wednesday morning by local ambulance services, at an industrial estate in Essex, about 25 miles east of central London. The gruesome discovery has turned into one of Britain’s largest homicide cases.\n\nAD\n\nAD\n\nFour people, including the driver of the truck, have been detained.\n\nA spokesman for the Vietnamese Embassy in London confirmed to The Washington Post that Tra My’s family had contacted officials there over fears that she was among the dead.\n\nIn a separate statement, the embassy said three Vietnamese families had contacted its consular protection hotline for help verifying whether their relatives were among the victims. Embassy officials were communicating with British police and had requested a visit to Essex, where the truck was found.\n\nPolice had said Thursday that the victims were believed to be Chinese nationals, but in an update Friday, they cautioned that “the picture may change regarding identification” as the investigation continues.\n\nAD\n\nAs that investigation progressed Friday, police arrested a man and a woman, both 38, from Warrington, England, and later in the day, a 48-year-old man from Northern Ireland, whom they stopped at Stansted Airport. All three were held “on suspicion of conspiracy to traffic people and on suspicion of 39 counts of manslaughter.”\n\nPolice also continued to question the 25-year-old driver of the refrigerated truck, who was arrested Wednesday on suspicion of murder.\n\nIn addition to determining the identities of the victims — eight women and 31 men — authorities are trying to figure out how they died and whether organized crime groups were involved. Postmortem examinations of 11 of the dead were due to start Friday afternoon.\n\nAD\n\nAD\n\nExperts who follow human trafficking trends suggested that the Essex victims could have been compelled into forced labor. Or they could have been migrants who paid their way for the dangerous journey gone horribly wrong.\n\nTra My’s brother, Pham Ngoc Tuan, told the BBC that his sister had paid 30,000 pounds ($39,000) to smugglers and that her last known whereabouts had been Belgium.\n\n“My sister went missing on 23 October on the way from Vietnam to the U.K., and we couldn’t contact her. We are concerned she may be in that trailer,” he said.\n\nEssex police and Belgian prosecutors said the refrigerated container arrived by sea from Zeebrugge, a Belgian port, and docked at Purfleet, a small port in Essex on the Thames, shortly after 12:30 a.m. Wednesday.\n\nAD\n\nPolice said the truck that picked up the container at Purfleet entered Britain separately, via ferry from Dublin, at Holyhead port in North Wales on Sunday.\n\nAD\n\nBritish media outlets, citing unnamed sources, reported that GPS tracking data showed the refrigerated container made its way from Dublin to Wales to Calais, France, on Oct. 16; moved between France and Belgium over several days; and then returned to Britain on Tuesday.\n\nA spokesperson for Global Trailer Rentals in Dublin confirmed to RTE News that it owned the container and said it had been rented out Oct. 15.\n\nPolice have not named the driver, although several British media outlets have identified him, citing sources in Northern Ireland, and posted photos from what were said to be his social media accounts. Several of his friends have defended him. Some suggested he could have been the one who called the ambulance services.\n\nAD\n\nBritish officials have previously warned that the route the container took across the North Sea was a launching point for “clandestine arrivals” into Britain. And National Crime Agency statistics show that Albanians and Vietnamese are the most common foreign nationals represented among those reported as victims of trafficking.\n\nAD\n\nLast year, 21 Vietnamese, including 11 children, were found alive in a refrigerated truck carrying sparkling water at the port of Newhaven, on England’s south coast. The driver, a Romanian, was sentenced to six years in prison.\n\n“There is no doubt the traffickers will have charged the group significant sums of money to reach the U.K.,” the prosecutor in that case argued, “only to put vulnerable children and young adults at risk of death.”\n\nAD", "description": "British police have arrested four people.", "authors": ["Karla Adam", "London Correspondent Covering The United Kingdom"], "top_image": "https://www.washingtonpost.com/resizer/xONPaOHB0cOrwrEfGvW-KDQyahQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5SQNQYXXE4I6TIUFRAVI4ODKSY.jpg", "published_at": "2019-10-25"}