{"pub": "businessinsider", "url": "https://businessinsider.com/navy-drone-delivers-supplies-to-submarine-for-first-time-2019-10", "downloaded_at": "2019-10-30 00:09:17.851540+00:00", "title": "The Navy just used a drone to deliver supplies to a submarine at sea for the first time", "language": "en", "text": "Submarines with the US Navy's Pacific Fleet rigged a drone and the sail of a submarine into a package delivery and receiving platform.\n\nA drone-based delivery system could bring parts and other supplies to subs, saving time and money and \"allowing us to stay in the fight,\" the commander of Pacific Fleet's submarine force said.\n\nVisit Business Insider's homepage for more stories.\n\nCommander, Submarine Force, US Pacific Fleet (COMSUBPAC) in partnership with the University of Hawaii, tested their unmanned aerial vehicle (UAV) capabilities by delivering supplies onto a submarine off the coast of Oahu, Hawaii, October 10.\n\nThe UAV took a 5-pound payload consisting of circuit cards, medical supplies, and food to the Virginia-class fast-attack submarine USS Hawaii (SSN 776) while it was underway.\n\n\"What started as an innovative idea has come to fruition as a potentially radical new submarine logistics delivery capability,\" said Lt. Cmdr. Christopher Keithley, assigned to COMSUBPAC. \"A large percentage of parts that are needed on submarines weigh less than 5 pounds, so this capability could alleviate the need for boats to pull into ports for parts or medical supplies.\"\n\nAn unmanned aerial vehicle delivers a 5-pound package to the USS Hawaii during an exercise off the coast of Oahu, October 10, 2019. US Navy/Mass Comm Specialist 1st Class Michael B. Zingaro\n\nThe concept itself came from the Commander, Submarine Force Innovation Lab (iLab) one year ago. Since then the iLab, in partnership with the University of Hawaii Applied Research Lab, has worked on developing the means to make it possible.\n\n\"Our sailors are visionaries. Their ideas benefit the submarine force, making an incredible difference,\" said Rear Adm. Blake Converse, commander, Submarine Force, US Pacific Fleet. \"We are already seeing the impact that this one idea can have on the entire fleet. The joint effort between the sailors at COMSUBPAC and the University of Hawaii has resulted in delivering necessary supplies to submarines that can save time and money, allowing us to stay in the fight.\"\n\nThis idea led to the creation of the Submarine Force's first UAV squadron at CSP. Submarine sailors stationed at Pearl Harbor volunteered to attend weekly training at Bellows Air Force Station, in Waimanalo, Hawaii, to become proficient drone pilots and to develop the concept of converting a UAV and a submarine sail into a package delivery and receiving platform.\n\nOutrigger Canoe Club members escort the USS Hawaii as it arrives at Joint Base Pearl Harbor-Hickam, June 6, 2019. Navy Photo by Mass Communication Specialist 2nd Class Charles Oki\n\n\"Members of University of Hawaii Applied Research Lab worked alongside COMSUBPAC sailors to develop a 'snag' pole and payload release mechanism from the drone, practicing the concept using the prototypes on the back of trucks and jeeps,\" said Keithley. \"As the training progressed and the drone innovations became more reliable, the team was able to demonstrate the capability onto a small patrol boat out of Pearl Harbor.\"\n\nAfter final adjustments and last-minute training, the team assembled on the shore of western Oahu and flew a small 5-pound payload over a mile offshore to USS Hawaii.\n\n\"The snag pole and drone delivery mechanisms performed perfectly as the payload of parts was safely delivered onboard the submarine, making history as the first ever drone delivery onboard an underway submarine,\" said Keithley.\n\n\"I am very proud of the joint effort and the capability they have created out of nearly thin air. The success of this project is a true testament to the ingenuity of our team and I am very thankful for them and our submarine sailors, who volunteered their time to make it a success.\"", "description": "A drone-based delivery system could bring parts and other supplies to a sub, saving time and money and \"allowing us to stay in the fight.\"", "authors": ["Petty Officer Class Amanda Gray", "Us Navy"], "top_image": "https://image.businessinsider.com/5db88215dee0192015447493?width=1200&format=jpeg", "published_at": "2019-10-29"}