{"pub": "npr", "url": "https://npr.org/sections/goatsandsoda/2019/09/29/764638760/photos-the-dead-live-with-their-loved-ones-on-this-indonesian-island", "downloaded_at": "2019-09-29 23:29:35.019572+00:00", "title": "PHOTOS: The Dead Live With Their Loved Ones On This Indonesian Island", "language": "en", "text": "PHOTOS: The Dead Live With Their Loved Ones On This Indonesian Island\n\nEditor's note: This story contains images that some readers may find disturbing.\n\nAs a host, 90-year-old Alfrida Lantong is somewhat passive. Lying resolutely on her back and gazing up through a pair of thick, dusty spectacles, she roundly ignores her son's murmured greeting as he enters the room, and she pays little heed to the gaggle of grandchildren clustered around her.\n\nBut Alfrida can hardly be blamed for her unresponsiveness. After all, she has been dead for the last seven years.\n\nEnlarge this image toggle caption Tommy Trenchard and Aurélie Marrier d'Unienville Tommy Trenchard and Aurélie Marrier d'Unienville\n\nAlfrida is of the Toraja people of southern Sulawesi in Indonesia, for whom the line between life and death is not black and white. Though her heart stopped beating in 2012, as far as her family is concerned, she is only to macula, which translates loosely as \"sick.\" They still visit her regularly, talk to her and bring her three meals a day, which they leave on the floor.\n\nAfter saying goodbye, Alfrida's son, Mesak, covers her with a light veil and closes the lid of her coffin before exiting the room. He will visit her again at supper time. \"We would miss her if she didn't still live here,\" says the 47-year-old. \"She looked after us our whole lives, so now it is important that we look after her too.\"\n\nEnlarge this image toggle caption Tommy Trenchard and Aurélie Marrier d'Unienville Tommy Trenchard and Aurélie Marrier d'Unienville\n\nBeyond her silent companionship, one of the reasons Alfrida still lives with her family is that even after seven years, preparations for her funeral are not yet complete. In Torajan culture, a person's funeral is the most important day of his or her life. Funerals can be so expensive that successive generations will be saddled with crippling debt. The events can last a week and involve the slaughter of hundreds of livestock.\n\n\"We need more time to save,\" says Mesak, whose family belongs to what he calls the \"noble\" class in the stratified Torajan caste system. \"The community would not respect us if we did a small funeral. We must sacrifice many buffalo.\"\n\nToraja country stretches for hundreds of miles across the mountainous interior of Sulawesi, a land of verdant hills and scattered villages connected by a network of dirt tracks that wind their way through lush rice paddies and patches of thick forest. It is an enclave of Christianity in a predominantly Muslim country, although traditional beliefs remain prevalent. Especially when it comes to death.\n\nThroughout most of the world, death is a topic that generally inspires dread. It marks the sudden and irreversible rupture of a person from their loved ones. Even if one believes in an afterlife, the immediate severing of the connection between the dead and the living is absolute. When anthropomorphized in popular culture, death is often depicted as a malevolent entity, the sinister black-cloaked figure clutching a scythe.\n\nNot so in Tana Toraja, the land where the Torajans live. Here, death is not something to shy away from. It is an all-pervading presence in day-to-day life, inscribed into the landscape in eerie wooden tau-tau statues, commissioned by the bereaved to remember the dead, and into the social calendar, which revolves heavily around funerals.\n\nDeath is even central to the economy: Families often save for years so they can afford the elaborate exchanges of gifts, money and freshly slaughtered meat that take place during the events, which are seen as a key means of redistributing wealth in Torajan society.\n\nDeath provides livelihoods for thousands of people here, both in the tourism sector and in funeral-related businesses. That includes the farmhands who look after the exorbitantly expensive sacrificial buffaloes, the restaurants and hotels springing up in the town of Rantepao and the artisans who craft the wooden tau-tau statues that adorn graves.\n\nThese statues — which range in appearance from highly stylized to disconcertingly lifelike — are a prominent feature of the caves, outcrops and escarpments that dot the countryside. For Jeffrey Maguling, a young tau-tau carver whose family has been in the business for four generations, the statues are an art form as well as a source of income.\n\nEnlarge this image toggle caption Tommy Trenchard and Aurélie Marrier d'Unienville Tommy Trenchard and Aurélie Marrier d'Unienville\n\n\"I don't just copy photos of the dead person,\" says Maguling, who works from a small wooden shack by the roadside south of Rantepao. \"I try to capture the person's character. It takes me about 10 days to make one.\" And he can sell a statue for about 15 million rupiah, or $1,100.\n\n\"There's more demand than in my father's time,\" he adds. \"The population has grown, so there are more people dying. It makes me happy when my clients like the tau-tau. But I will always share their sadness.\"\n\nIt's not that Torajans don't mourn their loved ones. But the process is softened by the gradual — and never-ending — nature of the transition from one world to another in Torajan cosmology. Even after people are buried, they are not really gone. Their tau-tau statues continue to stand tall on their cliff-top perches, eternally surveying the bustling land of the living below.\n\nIn some communities, to show respect, the dead are exhumed every few years and dressed in fresh clothes, often with a new pair of sunglasses, as if their pride over their appearance had not expired with their bodies.\n\nAnd when a baby dies, the body is sometimes buried in a hole carved out of the trunk of a tree so that the two may live on and grow together.\n\nEnlarge this image toggle caption Tommy Trenchard and Aurélie Marrier d'Unienville Tommy Trenchard and Aurélie Marrier d'Unienville\n\nIn a village near Alfrida Lantong's home, set on a steep hillside above a sea of brilliant apple-green paddies, another Torajan family is making last-minute preparations for its big day. The \"sick\" man, Lucas Ruruk, was a farmer from one of the middle social classes. His funeral will be of average size by Torajan standards. Yet the family is still expecting 5,000 guests and estimates that the event, which will last several days, will cost roughly 250 million rupiah (around $18,000). That's roughly five times the average yearly income in Indonesia.\n\nEnlarge this image toggle caption Tommy Trenchard and Aurélie Marrier d'Unienville Tommy Trenchard and Aurélie Marrier d'Unienville\n\n\"We're sad about the funeral,\" says Ruruk's 28-year-old son, Izak Sapan. \"But it is the most important day in my father's life. It is when his soul will make the journey to heaven.\"\n\nHis father lies upstairs in his bedroom, dressed immaculately in a dark suit and tie and a white shirt with floral designs on the collar. He died the previous month and has been lying here receiving visitors ever since. Shortly after death, his body was injected with a formaldehyde solution to prevent it from decomposing, as is the local custom.\n\nEnlarge this image toggle caption Tommy Trenchard and Aurélie Marrier d'Unienville Tommy Trenchard and Aurélie Marrier d'Unienville\n\nThe next morning, Ruruk's home is a scene of pandemonium. Trussed-up pigs are carried in squealing on bamboo stretchers while vendors set up stalls by the entrance selling soft drinks, snacks and cigarettes to the arriving guests. As the event gets underway, buffaloes are led out to have their throats slit in front of a transfixed crowd. A DJ plays local ballads, and a group of women performs traditional dances as the ground slowly turns scarlet with blood. A video crew hired by the family records the scene.\n\nEnlarge this image toggle caption Tommy Trenchard and Aurélie Marrier d'Unienville Tommy Trenchard and Aurélie Marrier d'Unienville\n\nSo too do approximately 100 tourists, both local and international, clutching cameras as they trail behind their guides. The idea of tourists traveling hundreds of miles to attend a stranger's funeral may seem somewhat jarring. But on the whole, their presence is welcomed by Torajan families, who believe that a well-attended funeral bestows honor on the deceased.\n\n\"We are happy that many foreigners have come,\" says the dead man's nephew, Suande. \"It means we can share our sadness with many people, and it shows respect for my uncle.\"\n\nEnlarge this image toggle caption Tommy Trenchard and Aurélie Marrier d'Unienville Tommy Trenchard and Aurélie Marrier d'Unienville\n\nThe area has become one of the biggest tourist destinations on the island of Sulawesi. August is a particularly busy time for local guesthouses, with a surge of tourists turning up to watch the manene event, during which bodies are removed from their graves, redressed in fresh clothes and sometimes carried around the village before being laid back to rest for another few years.\n\nOn a recent Monday, tourists streamed like ants up and down a steep track clinging to the side of a cliff in the village of Kete Kesu, where hundreds of bodies are buried. They ogled the piles of skulls and bones that lay in hollowed-out tree trunks along the route and used their cellphones to light up the inside of burial caves. Some posed for photos beside the remains, unsure whether to smile or look serious.\n\nBack in Alfrida Lantong's household, the endless saving continues. Her son estimates that the event will cost over a billion rupiah (about $73,800).\n\n\"But we don't even think about the cost,\" Mesak, her son, says. \"She will be traveling to the realm of the soul, and we must send her off in our own way. It is our Torajan culture. It is what we do.\"\n\nTommy Trenchard and Aurélie Marrier d'Unienville are independent photojournalists based in Cape Town, South Africa. They have previously collaborated on projects ranging from conservation gone wrong in Uganda to the changing lives of Indonesia's sea nomads to the fight against ISIS in Iraq.", "description": "The Toraja people of Indonesia keep the preserved bodies of their deceased relatives at home for years. They're saving up for a big funeral. But there's a deeper reason for the custom.", "authors": ["Tommy Trenchard", "Aurélie Marrier D'Unienville"], "top_image": "https://media.npr.org/assets/img/2019/09/26/toraja-death----14_wide-04278966575bf60eb76399667bc7b85aeb752e83.jpg?s=1400", "published_at": "2019-09-29"}