{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/16/WS5da679cfa310cf3e35570b94.html", "downloaded_at": "2019-10-16 03:57:54.530145+00:00", "title": "Students gear up for jobs in race car industry", "language": "en", "text": "By Liu Kun in Wuhan and Zou Shuo in Beijing | China Daily | Updated: 2019-10-16 10:00\n\nA racing team attends a job fair held at Guangdong Communication Polytechnic in Guangzhou, Guangdong province, to recruit racing talent from the vocational school. [Photo by Tan Qingju/For China Daily]\n\nChina's first school catering to the race car industry has welcomed its inaugural intake of 48 students.\n\nThe China Racing Car School, which is affiliated to Jianghan University in Wuhan, Hubei province, will focus on race car technology and personnel training.\n\nIt offers two majors to the students-race event management and race car electronics engineering, said Xia Hongwu, deputy head of the school.\n\nThe students will learn about racing culture, event and arena management and race car driving over four years of undergraduate studies. Tuition fees are 10,000 yuan ($1,408) a year, Xia said.\n\nHe said the school will gradually increase enrollment to around 3,000 students, mostly undergraduates and a small number of graduates and vocational students.\n\nXia said that although car racing has become increasingly popular in the country in recent years, there is a great lack of racing talent, and the country depends on foreigners to meet the large demand in the sector.\n\nA total of 26 car-racing-related businesses have signed cooperation agreements with the school for talent cultivation.\n\nStudents will be able to intern at the companies and have priority over other candidates for future employment at the companies, he said.\n\nDu Feifei, 18, is a freshmen majoring in racing event management. \"There are 30 students in my class and only five female students. I chose the major because it sounds very cool,\" she said.\n\nDu's classmate Lyu Hu said he has been a fan of car racing since he was a child and likes to play all kinds of racing games. A good racing event manager should know how to drive race cars because he or she needs to think from a racer's point of view, he said.\n\nDu said: \"I know about all kinds of race cars and their specifications and performance. We will learn race craft in the first two years and start to drive race cars in the third and fourth years.\"\n\nIn 2014, Jianghan University initiated the idea of building a race car school in Wuhan, where automobile manufacturing is a pillar industry, to meet the demand.\n\nZhan Guojun, head of the China Federation of Automobile and Motorcycle Sports, said it is natural that commercial interest in racing is quickly developing in China, a country with tremendous resources and a huge population.\n\nAs the sport becomes more popular, the demand for technicians will also increase. Zhan said there should be more schools offering majors in training car racing talent.", "description": "China's first school catering to the race car industry has welcomed its inaugural intake of 48 students.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/16/5da679cfa310cf3e97a16bb8.jpeg", "published_at": "2019-10-16"}