{"pub": "reuters", "title": "Prague opera lovers watch 'Don Giovanni' on rooftop - and in bath tubs", "url": "https://af.reuters.com/article/oddlyEnoughNews/idAFKCN1VK1D3", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:45:38.431328+00:00", "text": "PRAGUE (Reuters) - Mozart’s “Don Giovanni” has been a favorite among opera lovers since it premiered in Prague in 1787 but it is unlikely that any have ever watched it on a rooftop in the Czech capital while submerged in a bath tub, a glass of bubbly in hand - till now.\n\nThat’s how Prague cafe owner and culture promoter Ondrej Kobza arranged his performance, delivered by top Czech opera singers, including soloist Adam Plachetka from the Vienna Opera, as the sun set over the historic city center on Thursday night.\n\nThe stunt, comprising selected arias rather than the entire opera, was based around an anagram - Don Giovanni turned into the Czech “John do vany” which means “John into the tub”.\n\n“It seemed a daring step for me because this is something very untraditional. But I like new challenges and to try something that has not been here before,” Plachetka said.\n\nKobza said he thought the future lay in presenting culture in more innovative ways.\n\n“Mozart composed and premiered the opera in Prague, I think he is watching us today,” Kobza said, sitting in a tub on the rooftop of the Lucerna Palace - just off Prague’s central Wenceslas Square - that was built by the grandfather of former Czech president Vaclav Havel.\n\n“I think things like this will be popular - doing quality events but shifting the way they are presented.”\n\nThe spectators, who sat in their bath tubs in full evening attire, ended up very wet but were happy with the performance as well as the view from the rooftop, and the air temperature was fortunately around 30 degrees Celsius.\n\n“The water was warm. This was very pleasant, and a great performance by the soloists. This is something I will remember,” Martin Zvonicek said.\n\n“Don Giovanni”, which tells the story of a sexually promiscuous nobleman whose past finally catches up with him, premiered in Prague, then part of the Austrian Hapsburg Empire, on Oct. 29, 1787.", "description": "Mozart's \"Don Giovanni\" has been a favorite among opera lovers since it premiered in Prague in 1787 but it is unlikely that any have ever watched it on a rooftop in the Czech capital while submerged in a bath tub, a glass of bubbly in hand - till now.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png"}