{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7618703/Girl-five-left-scarred-life-strangers-dog-pounced-bit-face.html", "downloaded_at": "2019-10-27 12:59:46.699745+00:00", "title": "Girl, five, is left scarred for life after a stranger's dog pounced on her and bit her face", "language": "en", "text": "A five-year-old girl has been scarred for life after a stranger's dog 'ripped off her face' and left her needing 36 stitches.\n\nCharmaine Beresford took her daughter Molly to a stranger's house to buy some furniture advertised on Facebook when the dog pounced on the little girl.\n\nThe dog's owner, Juliet Marsh, was found guilty of being the owner of a dog dangerously out of control at Cheltenham Magistrates Court on September 19.\n\nNow Ms Beresford, from Honeybourne, Worcestershire, has spoken out and said her daughter is lucky to be alive.\n\nMolly Beresford, five, has been scarred for life and needed 36 stitches after a stranger's dog 'ripped off her face'. Charmaine Beresford took her daughter Molly to a stranger's house to buy some furniture advertised on Facebook when the dog pounced on the little girl\n\nShe said: 'It was absolutely horrendous. It was awful. My daughter gets called 'scar face'. She says, ''mummy am I still beautiful?'''\n\nMolly had gone with her mother and father, Lee, to collect some bunk beds they had seen for sale on Facebook, from the seller's home in Chipping Campden.\n\nMs Beresford said: 'The room was a box room, there was not much space. She (the seller) said ''I'll take Molly downstairs to get a drink.''\n\n'It was safe as far as me and Lee were concerned.'\n\nCharmaine said she did not know there was a dog in the house.\n\nThe dog's owner, Juliet Marsh, was found guilty of being the owner of a dog dangerously out of control at Cheltenham Magistrates Court on September 19. Now Ms Beresford, from Honeybourne, Worcestershire, has spoken out and said her daughter is lucky to be alive\n\nMolly had gone with her mother and father, Lee, to collect some bunk beds they had seen for sale on Facebook, from the seller's home in Chipping Campden when Milo the dog (pictured) attacked her\n\nShe added: 'She left Molly unattended.'\n\nShe said that after a few minutes they heard a scream and rushed downstairs, where she said she saw: 'Molly had had her face ripped off by the dog.'\n\nMs Beresford said the dog's owner was reluctant to call for help and that she had to repeatedly ask for help.\n\nShe added: 'Four or five times I asked her to phone the ambulance. I had to scream at her.\n\nMs Beresford said the dog's owner was reluctant to call for help and that she had to repeatedly ask for help\n\n'I wasn't going to prosecute or anything like that. But then the surgeon who treated Molly said ''this is a dangerous dog. You need to prosecute''.'\n\nMarsh, appeared at Cheltenham Magistrates Court on September 19 and was found guilty of being the owner of a dog dangerously out of control.\n\nThe court ordered that the dog is kept under control and fitted with a muzzle in a public place and is never left alone in the company of children under 17.\n\nThe dog's owner appeared at Cheltenham Magistrates Court on September 19 and was found guilty of being the owner of a dog dangerously out of control. The court ordered that the dog is kept under control and fitted with a muzzle in a public place and is never left alone in the company of children under 17\n\nMarsh must carry out 60 hours of unpaid work in the next 12 months. She was fined £775 with a surcharge of £85.\n\nMs Beresford said: 'We were kind enough to let her keep the dog. I just want to make other people aware.\n\n'I have got two dogs and Molly is fine with them and with family members' dogs but if we see strangers dogs out in public she'll cling to me like a leech.\n\n'But other than that she is coping really well. We are lucky because that dog could have taken her life that night. Even though she is scarred we are lucky.'", "description": "WARNING: GRAPHIC CONTENT. Molly Beresford was left unattended at a stranger's house in Chipping Campden when she was mauled by the dog.", "authors": ["Isabella Nikolic For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/12/20243278-0-image-a-51_1572179880515.jpg", "published_at": "2019-10-27"}