{"pub": "huffpost", "url": "https://huffpost.com/entry/sean-hannity-donald-trump-sworn-duty-crimes_n_5d946729e4b0e9e760552218", "downloaded_at": "2019-10-02 12:46:00.116244+00:00", "published_at": "2019-10-02", "title": "Sean Hannity: Donald Trump Had 'Sworn Duty To Investigate Crimes' On Ukraine Call", "language": "en", "text": "Maybe Sean Hannity isn’t reading the same summary of President Donald Trump’s phone call with Ukrainian President Volodymyr Zelensky.\n\nThe Fox News personality on Tuesday dismissed Trump’s apparent repeated pressuring of Zelensky in the July call to investigate presidential election rival Joe Biden and his son after halting American military aid.\n\nA government whistleblower’s complaint about Trump’s behavior has led to a House impeachment inquiry.\n\n“The president, by the way, will not be removed from office,” Hannity declared on his prime time show. “His call with the Ukrainian president ― there was nothing wrong with it. Zero. No misconduct. No quid pro quo.”\n\nHannity said the “only favor Trump requested” in the conversation was an inquiry into what The Associated Press has called a “long-discredited conspiracy theory” about Democratic National Committee election hacking in 2016. The U.S. intelligence community has blamed Russia for hacking DNC servers in a bid to help elect Trump, but Trump ― and apparently Hannity ― are pushing a baseless conspiracy theory that the “deep state” framed Russia in the plot.\n\n“Let’s be clear, the president of the United States has a sworn duty, a constitutional duty, to investigate crimes,” Hannity, an ardent Trump chum, said on his show. “The United States has a treaty with Ukraine, and several other countries like Australia, Italy, and Great Britain that requires cooperation in criminal investigations, and that’s not all.”\n\nThe pundit quoted the Constitution and continued to push unfounded claims that Biden urged the ouster of a Ukrainian prosecutor in 2016 to further the business interests of his son there. He also resurrected Trump’s disproven claim that Hunter Biden accompanied the then-vice president on a 2013 trip to China to get rich in a fishy equity deal.\n\nAnd, of course, what would a Fox News commentary be without invoking “deep state bureaucrats” who are really stirring up the trouble.", "description": "The Fox News personality cited Trump's mention of a long-discredited claim to make his point.", "authors": ["General Assignment Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d9468ed2200005200dc3a77.png?cache=nbdnij4wcn&ops=1778_1000"}