{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/15/WS5da53d78a310cf3e355708ea.html", "downloaded_at": "2019-10-15 04:26:06.364199+00:00", "title": "Curfew lifted in Ecuador after deal between govt, protesters", "language": "en", "text": "Xinhua | Updated: 2019-10-15 11:31\n\nPeople holding an Ecuadorian flag are seen in a truck in front of the National Assembly building, in the aftermath of the last days' protests, after the government of Ecuadorian President Lenin Moreno agreed to repeal a decree that ended fuel subsidies, in Quito, Ecuador Oct 14, 2019. [Photo/Agencies]\n\nQUITO - The curfew on Ecuador's capital Quito was lifted on Monday after an agreement reached between the government and indigenous leaders on Sunday put an end to more than 10 days of turbulent protests.\n\nThe Defense Ministry said residents were free to move about again, and life was gradually returning to normal in the city.\n\nThe curfew was imposed on Saturday, following a particularly violent day of demonstrations that saw protesters set fire to a government building.\n\nThe wave of protests was sparked by an Oct 1 presidential decree eliminating fuel subsidies, which caused the prices of gasoline and diesel to shoot up as well as an increase in public transit fares just days later.\n\nEcuadorian President Lenin Moreno agreed to repeal the decree on Sunday, after officials met with protest leaders for several hours.\n\nThe two sides agreed the government will work on a new subsidy scheme that helps vulnerable groups.\n\nThe clashes between protesters and police left at least 10 people dead, more than 2,000 injured, 100 missing and led to more than 1,000 arrests, indigenous representatives said.\n\nScrapping fuel subsidies was part of a package of austerity measures the government had agreed to when it secured a $4.2-billion loan from the International Monetary Fund.", "description": "The curfew on Ecuador's capital Quito was lifted on Monday after an agreement reached between the government and indigenous leaders on Sunday put an end to more than 10 days of turbulent protests.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/15/5da53d78a310cf3e97a14afa.jpeg", "published_at": "2019-10-15"}