{"pub": "metro", "url": "https://metro.co.uk/2019/10/27/meghan-markles-former-suits-co-star-says-he-warned-her-life-would-change-forever-with-prince-harry-10990346", "downloaded_at": "2019-10-27 00:30:12.513034+00:00", "title": "Meghan Markle warned life would 'change forever' with Prince Harry", "language": "en", "text": "Meghan Markle and Wendell Pierce in Suits (Picture: USA)\n\nMeghan Markle’s former Suits co-star Wendell Pierce has said he warned her that her world would be ‘forever changed’ during their last chat.\n\nThe pair were co-stars on the US courtroom drama, with Wendall playing Robert Zane, the successful lawyer and protective father of Meghan’s character Rachel.\n\nHowever during an appearance on Desert Island Discs he recalled how he had saved Meghan, 38, from being photographed wearing a costume ring, after filming scenes in which her character had become engaged.\n\n‘It was great. She’s a really good actress and was always sweet, always kind. We were shooting one day, before the engagement. In the show she was engaged, and she had a ring on,’ he said.\n\n‘We were about to get out of the car and I said: “Don’t get out. Give us the ring. There’s a paparazzi down the street. If a photograph got out with you with a ring on it, it would explode all over the world.”\n\nAdvertisement\n\nAdvertisement\n\n‘Then when we had the final scenes I said: “Look, listen, your world is going to be forever changed and no matter where you are, you can always know that you have a friend in me.”\n\n‘That was the last time I got to speak to her – and it was great.’\n\nThe pair were co-stars on the US courtroom drama (Picture: USA)\n\nMeghan and Prince Harry’s relationship has been under close scrutiny following an ITV documentary which followed their tour across southern Africa.\n\nDuring the programme both the Duke and Duchess of Sussex revealed the struggles they have faced being under media scrutiny and as members of the Royal family.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nMeghan told ITV News At Ten host Tom Bradby: ‘Any woman, especially when they are pregnant, you are really vulnerable and so that was made really challenging.\n\n‘And then when you have a newborn, you know? And especially as a woman it’s really, it’s really a lot.’\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nWhen asked if she was ok, Meghan said: ‘Well, I guess, and also thank you for asking, because not many people have asked if I’m okay, but it’s a very real thing to be going through behind the scenes.’\n\nAdvertisement\n\nAdvertisement\n\nPrince Harry voiced his fears of ‘a repeat of the past’ and said he wanted to protect his family from the media.\n\nPrince Harry and Meghan Markle’s documentary aired to criticism (Picture: Getty)\n\nHarry also opened up about his relationship with his older brother, saying he and William have ‘good days’ and ‘bad days’ but are on ‘different paths’.\n\nPrince William was said to have been left ‘very worried’ about his brother and sister-in-law following the emotional documentary.\n\nA Kensington Palace source is said to have told the BBC there is a view that the couple are currently in a ‘fragile place’.", "description": "Meghan Markle was warned by her Suits co-star Wendell Pierce that life would be forever changed if she married Prince Harry.", "authors": ["Rebecca Lewis"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/suits-meghan-wendall-e869_1572128963.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-27"}