{"pub": "yahoo", "url": "https://finance.yahoo.com/news/pixel-4-review-141134256.html", "downloaded_at": "2019-10-21 15:15:39.694880+00:00", "title": "The Pixel 4 could be a breakout hit for Google", "language": "en", "text": "Google's (GOOG, GOOGL) $799 Pixel 4 and $899 Pixel 4 XL smartphones hit store shelves Oct. 24, and when they do they'll be going toe-to-toe with Apple's (AAPL) $699 iPhone 11 and Samsung's $749 Galaxy S10. And like its competitors, Google is putting much of the focus on its new phones' photography chops with a slew of new features.\n\nTo be sure, the Pixel has never been a volume seller for Google. The company doesn't even break out its hardware sales in its quarterly earnings report. Instead, it falls under \"Other revenue\" and is lumped in with app sales and Google Cloud subscriptions.\n\nBut with the company's decision to finally bring its phones to all of the major U.S. carriers rather than relying solely on Verizon, Google could finally have a breakout hit on its hands.\n\nPixel 4 cameras\n\nThe biggest improvements to the 5.7-inch Pixel 4 and 6.3-inch Pixel 4 XL come in the form of their new wide-angle and telephoto cameras. Yes, Google has finally added a second camera to its phone and both are fantastic.\n\nOnce again, Google is touting its computational photography capabilities, which is a fancy way of saying there's a lot of machine learning and software magic going on behind the scenes that enhances your shots.\n\nThe company has brought back its Super Res Zoom, which takes multiple shots when zoomed in on a subject and combines them to improve clarity and cut down on that grainy pixelation you get when using software zoom on a phone. In my testing, the feature allowed the Pixel 4 to pull off impressive shots while zoomed in to 10x. Compared to the iPhone 11 Pro's shots, the Pixel 4's were clearer and offered more detail.\n\nNew to the Pixel 4 is Google's dual exposure control, which lets you adjust both an image's brightness and shadows in real-time. As a result, you can pull off some truly artistic shots, though it takes a bit of practice to figure out how to dial in the right level of light and dark. Google's improved white balance also helps ensure your photos' colors reflect real-world colors.\n\nThe Pixel 4 sports two cameras: a wide-angle option, and a telephoto lens. (Image: Daniel Howley) More\n\nIn a demonstration, Google reps showed how snow can look blue when you take a photo of it, because of how it absorbs light. The white balance feature on the Pixel 4, however, corrects that, ensuring that snow looks pure white.\n\nFinally, there's the return of Google's Night Sight. The standout feature from the Pixel 3, Night Sight put Google's Pixel line on the map as the best camera phone available. Apple has since caught up with its own low-light photo mode in the iPhone 11, but Google still has the edge.\n\nA shot I took of a Halloween display using the low-light mode on the Pixel 4 and the iPhone 11 showed how the Pixel 4 is able to better brighten scenes that would otherwise appear too dark. Google even added the ability to use Night Sight for astrophotography, ensuring you can take pictures of the stars and galaxies by simply keeping the Pixel 4 stable on a tripod or even a rock and shooting in Night Sight mode. Apple showed off a similar feature during its iPhone 11 reveal.\n\nOverall, I found the Pixel 4's camera tended to take darker photos than the iPhone 11. Both produced crisp images with sharp details, and vibrant colors, but the iPhone's pictures were a hair brighter overall.\n\nThis is all a bit of nitpicking, though, as both phones truly capture gorgeous photos. It really comes down to which brightness level you appreciate more between the two.\n\nMy main issue with the Pixel 4 is that it includes a telephoto camera rather than ultra-wide option. Apple's $699 iPhone 11 also has two cameras, but instead of a telephoto camera, it has a wide-angle camera and ultra-wide angle lens.\n\nThe iPhone's low-light shot is stunning, but the Pixel 4 pulls in just a bit more light. (Image: Daniel Howley) More\n\nStory continues", "description": "Google's Pixel 4 packs two exceptional cameras and enough slick features to make it a top pick for Android lovers.", "authors": ["Daniel Howley", "Technology Editor"], "top_image": "https://s.yimg.com/uu/api/res/1.2/AQS28lUPazB.e5i_SPHcPg--~B/aD03NTA7dz0xMDAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/068703c0-f40b-11e9-bfee-5a00dba1b1a0", "published_at": "2019-10-21"}