{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/this-elderly-couple-from-pune-has-set-up-an-oxygen-generation-plant-for-indian-soldiers-in-siachen-377368.html", "downloaded_at": "2019-10-08 12:10:05.911201+00:00", "title": "Siachen:This Elderly Couple From Pune Has Set Up An Oxygen Generation Plant For Indian Soldiers In Siachen", "language": "en", "text": "This Elderly Couple From Pune Has Set Up An Oxygen Generation Plant For Indian Soldiers In Siachen\n\nThis Elderly Couple From Pune Has Set Up An Oxygen Generation Plant For Indian Soldiers In Siachen\n\nAt an altitude of 5,400 m above the sea level, Siachen is the world's highest battlefield, where the weather conditions can be unforgiving for the soldiers standing guard there.\n\nAt such high altitude, one of the challenges our soldiers face is the shortage of oxygen. But now an elderly couple from Pune has done their bit to make the lives a litter easier for our soldiers in Siachen.\n\nANI\n\nFour years after they undertook the work of setting up an oxygen-generation plant in Siachen for the Indian Army, the couple has fulfilled their commitment with the inauguration of the camp this month.\n\nYogesh Chithade and Sumeedha Chithade who have been running the Soldiers Independent Rehabilitation Foundation (SIRF) since 1997 for the welfare of soldiers, collected the funds of approximately Rs 2 crore for the plant through crowdfunding.\n\nDon't Miss 331 SHARES 2.6 K SHARES 794 SHARES 41.6 K SHARES\n\nThe couple also sold off their jewellery last year to help build the plant to enable soldiers to protect themselves in the frigid weather of Siachen, located in the eastern Karakoram range in the Himalayas.\n\nANI\n\nYogesh Chithade, a former Air Force official, said that he got the idea of the plant from Paramveer Chakra awardee Captain Bana Singh after the latter mentioned about the breathing problems faced by soldiers in Siachen.\n\n\"The idea came from Captain Bana Singh who was posted in Siachen. There was a post which was captured by Bana Singh and renamed Bana Post. Singh had once visited our house and celebrated Raksha Bandhan. He narrated about the lack of oxygen in Siachen,\" he told ANI.\n\n\"We made up our mind in 2015 that we had to fulfil our commitment to the brave soldiers of the country. We even had planned to sell the house to arrange funds. Around 20,000 people will be benefitted,\" Chithade told ANI.\n\nThe oxygen plant was officially inaugurated in Siachen on October 4.\n\nANI\n\nChithade said the aim of SIRF is to help people in armed forces and their families.\n\n\"We will do anything for them. They don't ask for anything from us. But it is our duty. We have to help him after identifying their needs. We give financial help and moral support. We send boxes of 15-kilogram sweets on border posts on Diwali every year,\" he said.\n\nSumeedha, a teacher by profession, has been working for army welfare since 1999 said that she was inspired by the work armed forces do for the country and she started thinking about the plant when she got to know about breathing problem in Siachen.\n\n\"We have been working for families of armed forces. They are working in extreme working conditions When we came to know of the problems faced by the soldiers, we started mulling about installing an oxygen generation plant in 2015. There is no place for religion in armed forces, there is only humanity,\" she said.\n\nWith ANI inputs", "description": "At an altitude of 5,400 m above the sea level, Siachen is the world's highest battlefield, where the weather conditions can be unforgiving for the soldiers standing guard there. At such high altitude, one of the challenges our soldiers face is the shortage of oxygen. But now an elderly couple from Pune has done their bit to make the lives a litter easier for our soldiers in Siachen.", "authors": ["Bobins Abraham"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/siachen_oxygen_1570531381_800x420.jpg", "published_at": "2019-10-08"}