{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-49760165", "downloaded_at": "2019-09-20 22:50:28.159134+00:00", "title": "Modi visit to US: Trump appearance signals importance of India", "language": "en", "text": "Image copyright Getty Images\n\nFive years ago, when Narendra Modi first stepped on US soil as India's prime minister to chants of his name and \"Hail Mother India\", many called it audacious.\n\nThe rock star reception at New York's Madison Square Garden resembled a victory lap for a leader who had been denied entry into the US for almost a decade.\n\nThis Sunday, the Indian leader will address a far bigger crowd of supporters at an event in Houston, Texas, and standing next to him will be the president of the United States - a visual that many believe will help Mr Modi shrug off some of the international criticism over his controversial move on Kashmir.\n\nThe event, aptly titled \"Howdy, Modi!\", is expected to attract a crowd of more than 50,000, the largest gathering of Modi supporters outside India, at the NRG Stadium.\n\nThe first-of-its-kind joint appearance is being hailed as a PR triumph for Mr Modi, but it also testifies to the growing importance of US-India relations.\n\n\"I think this was in some ways inevitable and reflects the strength of the Indian-American community,\" says Nisha Biswal, former Assistant Secretary of State in the Obama administration.\n\nShe says it's a good thing that the president has decided to go to Texas.\n\n\"This relationship now transcends individuals and it transcends politics,\" added Ms Biswal, who now heads the US-India Business Council.\n\nThe organisers, Texas India Forum, have tried to emphasise the bipartisan nature of the event by inviting prominent Democrats including the House Majority Leader Steny Hoyer, several other Congressmen, US elected officials, and governors.\n\nThe choice of Houston as the spot for this rally is not surprising either.\n\nIndia is Houston's fourth-largest trading partner and its growing energy demand is expected to further boost the sale of American oil and gas. For India, it's also an opportunity to bring down the trade deficit with the United States - a major issue for Mr Trump.\n\nImage copyright Getty Images Image caption Modi speech as he celebrates Independence Day\n\nThere are also strong indications to suggest that the two countries may announce some progress toward ironing out the strong trade differences witnessed in the last year-and-a-half.\n\n\"If this happens, there will be talks about winning and the President would want to take credit for that,\" says Tanvi Madan, India Project director at Washington's Brookings Institute.\n\nFor President Trump, who himself is a big fan of spectacles and huge crowds, the mega event also provides an opportunity to court Indian-Americans for next year's Presidential election.\n\nTalking to reporters, the President said: \"He's got a big crowd coming and I guess the crowd just got a lot bigger because they just announced - he asked, would I go, and I will go\".\n\nWith a population of more than 3.2 million, Indian-Americans comprise 1% of the US population and are also among the wealthiest communities in the US.\n\nMore on Modi's election win\n\nThe majority are Democrat leaning and voted for Hillary Clinton in the 2016 elections, according to polling by the Asian American Legal Defense and Education Fund.\n\nModi enjoys strong support here for his nationalist views and his promise to restore India's greatness.\n\n\"I'm sure Republicans are hoping that it might also help many of these voters to switch sides,\" says Ms Madan.\n\nWhile many analysts are calling the event a win-win for both the leaders, not everyone is as thrilled.\n\nThe visit comes weeks after the Modi government revoked the partial autonomy enjoyed by Muslim-majority Kashmir and imposed a communication blackout in the region.\n\nImage copyright Getty Images Image caption Tensions have risen in Kashmir\n\nIt aggravated tensions with neighbouring Pakistan, which also lays claim to the region, and drew sharp criticism from Muslim bodies and human rights activists.\n\nMany Congress representatives including Indian-American Congresswoman Pramila Jayapal have expressed their concern against the move.\n\nActivists are worried that as leader of the free world, President Trump joining hands with Modi will be seen as an endorsement of his policies.\n\n\"It's a mistake, Trump shouldn't be there,\" says Arjun Sethi, human rights lawyer and community activist.\n\n\"Instead of saying Howdy Modi, we should be saying Adios Modi,\" he adds.\n\n\"I don't know what's more embarrassing - that Modi will appear beside Trump or that Trump will appear beside Modi,\" tweeted Rutgers University professor Audrey Truschke. \"Both countries have my condolences.\"\n\nMore on Kashmir\n\nThousands of protesters, mostly from the Muslim community, plan to assemble and protest against the Indian Prime Minister near the venue.\n\nJust days after he takes the stage in Houston, Mr Modi is poised to receive an award from the Gates Foundation for his major \"Clean India\" campaign that has built millions of toilets across the country.\n\nProtesters are using this award to draw attention to Modi's actions on Kashmir.\n\nThey have submitted a petition with 100,000 signatures at the Gates Foundation's headquarters in Seattle urging it to rescind the award.\n\n\"If you build a toilet in one room and torture a person in another room, you are undeserving of human rights recognition,\" says Mr Sethi, referring to allegations of torture in Kashmir by Indian security forces.\n\nThe Gates Foundation hasn't agreed to retract the honour and its founder, Bill Gates, told the Washington Post in an interview: \"We think the head of government that took these moves on sanitation, that's worthy of note.\"", "description": "Indian Prime Minister Modi will address supporters in Houston, where he will be joined by Donald Trump.", "authors": ["Brajesh", "Bbc News"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/9357/production/_108891773_trump_modi_976getty.jpg", "published_at": "2019-09-20"}