{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7605053/Flavored-tobacco-products-lead-DAILY-smoking-vaping-teens-young-adults.html", "downloaded_at": "2019-10-23 17:20:52.191700+00:00", "title": "Flavored tobacco products can lead to DAILY smoking or vaping in teens and young adults", "language": "en", "text": "Flavored tobacco products are more likely to get teenagers and young adults hooked to smoking or vaping than non-flavored products, a new study says.\n\nResearchers found that the first use of a menthol or mint flavored cigarette placed teens and young adults at high risk of subsequent cigarette smoking.\n\nWhat's more, trying flavored or menthol cigarettes for the first time was associated with an eventual progression to daily cigarette use.\n\nThe team, from the University of Vermont, says flavored cigarettes and vapes are what get teens hooked to tobacco in the first placed, leading to a potential lifelong addiction.\n\nIn the last several months, there has been a push to ban flavored e-cigarettes, which are being blamed for addicting teens and being responsible for the slew of vaping-related illnesses sweeping across the US.\n\nA new study from the University of Vermont the first use of a flavored tobacco product - cigarette or vape - placed teens and young adults at high risk of using it frequently in the future (file image)\n\nFor the study, published in JAMA Network Open, the team analyzed data from the Population Assessment of Tobacco and Health (PATH) Study.\n\nData was collected on nearly 12,000 teenagers and about 26,500 adults during a initial study period (2013 to 2014) and a follow-up (2014 to 2015).\n\nIn the first period, participants were asked if they had first tried any tobacco products including cigarettes, e-cigarettes, traditional cigars, hookah tobacco, pipe tobacco, smokeless tobacco and dissolvable tobacco.\n\nThen, in the follow-up, they asked if they were current users and how frequently they were using the products.\n\nResearchers found that, the first flavored e-cigarette use was linked to more frequently using e-cigarette among young adults and adults aged 25 years and older.\n\nAdditionally, those who first tried a menthol- or mint-flavored cigarette during the initial study period were more likely to say they'd smoked cigarettes in the last month or year when asked about their use in the second wave of questions.\n\nAdditionally, trying flavored or menthol cigarettes for the first time during wave 1 was linked to a progression to daily cigarette use in all age groups during the follow-up periods.\n\nTeens and young adults who were new users of any tobacco products were found to be more likely to try flavored products than adults older than age 25.\n\nThe same association was not seen among users whose first tobacco product was non-flavored, according to the researchers.\n\n'Flavors in tobacco products were associated with youth and young adult tobacco experimentation,' the authors wrote.\n\n'First use of a flavored tobacco product may place youth, young adults, and adults at risk of subsequent tobacco use.'\n\nIt comes on the heels of a federal investigation into a slew of vaping-related illnesses, which health officials say affected teens and young people the most because flavored e-cigarettes were marketed towards them.\n\nNearly 1,500 people had developed EVALI (e-cigarette or vaping product use-associated lung illness) and 33 people have died in 24 states, according to the Centers for Disease Control and Prevention.\n\nMost of the victims are under the age of 35 and the youngest was just 13 years old.\n\nAbout 78 percent of people who've fallen ill have reported using products that contain THC, the main psychoactive component in marijuana.\n\nAmid pressure, e-cigarette company JULL announced it will no longer sell flavored pods like creme brulee, cucumber, mango, mint and fruit anywhere.\n\nMeanwhile, New York, Michigan, Montana, Rhode Island, Utah and Washington have enacted temporary bans on flavored e-cigarette products.\n\nMassachusetts outdid them all and has enacted a ban all vaping products, flavored or non-flavored.", "description": "A new study from the University of Vermont the first use of a flavored tobacco product - cigarette or vape - placed teens and  young adults at high risk of  using it frequently in the future.", "authors": ["Mary Kekatos Health Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/15/19791036-0-image-a-2_1571840736360.jpg", "published_at": "2019-10-23"}