{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/being-able-to-play-mario-maker-online-with-friends-makes-it-even-better", "downloaded_at": "2019-10-08 06:32:22.141411+00:00", "title": "Being Able To Play Mario Maker Online With Friends Makes It Even Better", "language": "en", "text": "Last week, Super Mario Maker 2 finally received an update that enabled players to matchmake with friends online, a much-requested feature that was missing when the game launched in June. Over the weekend, I played a few courses with two friends, and it was probably the most fun I’ve had with an online game in a good while.\n\nPreviously, the only way to play through Mario Maker levels with friends was to do so locally, on the same Nintendo Switch. If you wanted to play with others online, you had to do it with strangers, making two-person kaizo runs online extremely unlikely. Four months later, you can finally play online with friends.\n\nTo get started, all you have to do is jump into Course World from the Play menu, then select Network Play. Select the Play With Friends option and you’ll be able to either create a room or join any previously existing rooms made by people on your friends list.\n\nThe room’s host is in charge of picking what course everyone will play. They can set certain parameters (difficulty level, co-op vs. competitive), and the game will spit out a random course for everyone. If they want to have everyone play a specific course, they’ll have to have downloaded it to their Switch first. From there, everyone is along for the ride, playing course after course together until they decide to leave. It’s refreshingly simple, and a bit like Super Smash Bros. Ultimate.\n\nMario Maker can be a game that you don’t really know you want until you spend some time with it. I didn’t think I wanted an endless stream of Mario in my life — Nintendo’s irregular-but-always-worth-it release schedule of Mario platformers was working just fine for me, thank you very much. Now that I have Mario Maker in my life, though? I love it. It’s wonderful, being surprised by the cuckoo-bananas creations made by its community, with levels both traditional and inventive. Doing that with friends online? It’s sublime.\n\nIt’s easy to forget how funny a Mario level can be once you add other people. Solo, they can be quirky things, the charming look and satisfying feel of Mario jumping on things being one of video games’ most perfect achievements. With other people, that perfection becomes a vector for chaos — players jumping on each other, impeding each others’ progress, scrambling to dominate a screen that they had previously thought of as belonging to themselves alone.\n\nPlaying with my friends, switching between competitive and cooperative play, was a blast. Even when the courses were bad, we had a good time. We failed to navigate a course with a race car, we clumsily hopped our way through a boss rush, we raced to beat each other to goals. I, naturally, won the most, and if Scott and Kevin disagree they can write their own articles.\n\nLook, it’s honestly kind of nuts that something this integral to the Mario experience had to wait so long to be properly implemented. But now that it is, it’s almost like a brand new game, and a tremendously fun one. If you, like me, have some trouble getting friends over for some couch co-op due to busy schedules, I can’t recommend this enough.", "description": "Last week, Super Mario Maker 2 finally received an update that enabled players to matchmake with friends online, a much-requested feature that was missing when the game launched in June. Over the weekend, I played a few courses with two friends, and it was probably the most fun I’ve had with an online game in a good...", "authors": ["Kotaku Australia", "Luke Plunkett"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/hq5ag5ieeqzbxpmluknz.jpg", "published_at": "2019-10-08"}