{"pub": "news24", "url": "https://city-press.news24.com/News/ancs-big-effort-to-reclaim-joburg-from-da-20191028", "downloaded_at": "2019-10-28 00:32:06.478989+00:00", "title": "ANC’s big effort to reclaim Joburg from DA", "language": "en", "text": "News ANC’s big effort to reclaim Joburg from DA\n\nThe governing party is working quickly to get support from kingmakers EFF and IFP, as well as several smaller parties, to take the city back\n\nThe ANC in Johannesburg has positioned itself to take advantage of the DA’s meltdown and the resignation of mayor Herman Mashaba to recapture control of the country’s wealthiest metro.\n\nMashaba resigned last week, saying he could not align himself with the right wing direction the DA was heading in after Helen Zille was elected as federal council chairperson. He will vacate his post on November 27.\n\nThe ANC is courting smaller parties that have been in cooperative governance alliances with the DA to jump ship and partner with it instead.\n\nANC Johannesburg spokesperson Jolidee Matongo told City Press that the ANC was working hard to woo the DA’s coalition partners away from its cooperation agreement, and had thus far managed to entice the African Independent Congress and Al Jama-ah.\n\nThis was confirmed by Al Jama-ah leader Ganief Hendricks, who said: “We have a working relationship with the ANC all over the country, so we do not have a quarrel working with the ANC. As far as Johannesburg is concerned, our position at the moment is that we will support whatever the ANC comes up with, but we will push strongly for there to be a multiparty mayoral committee.”\n\nHendricks said it was now up to the governing party to put its internal battles aside and choose the most suitable candidate to lead Johannesburg.\n\n“The ANC can’t agree who of them should take the mayoral post, so the factional battles in the ANC are also an issue,” he said.\n\nThe African Independent Congress was not available for comment.\n\nAccording to Matongo, the ANC was also in advanced talks with the Congress of the People, the United Democratic Movement and the Patriotic Alliance, and the “discussions with these three parties were ongoing”.\n\nYet another positive for the ANC in its quest to regain control of the metro it lost in 2016 is the fact that kingmakers the EFF and the Inkatha Freedom Party (IFP) are willing to listen to other offers.\n\nThe ANC has 122 seats in council, the DA has 103, the EFF has 30, the IFP has five, the African Independent Congress has four and the six smaller parties have one seat each.\n\nThe IFP has long expressed a wish to reconcile with the ANC and took a resolution during its elective conference in August to making this a reality.\n\nAt the same time, the EFF appears to be strongly opposed to working with what it sees as a different DA under Zille.\n\nIFP provincial leader Bonginkosi Dhlamini told City Press that, although the IFP was still committed to its long-standing coalition with the DA and other cooperative partners in the Johannesburg Metropolitan Municipality, the party was also open to listening to proposals from the ANC.\n\nThis was confirmed by IFP national spokesperson Mkhuleko Hlengwa, who told City Press that the IFP was indeed conducting talks with the governing party.\n\n“The discussions that the IFP is having with the ANC are about the long outstanding reconciliation agenda between the two parties, which is well documented,” said Hlengwa.\n\nHe maintained that the discussions had nothing to do with issues of governance, and reiterated that the IFP had gotten into a coalition with the DA in Johannesburg and not with an individual in the DA, so the recent exodus of DA members did not affect the cooperative agreement.\n\nHowever, Dhlamini said there were ongoing negotiations between the IFP’s national leadership and the ANC, and that the discussions included issues of governance and the Johannesburg mayoral position.\n\n\n\nMatongo said one stumbling block for the ANC was that the DA was already supporting the IFP in some municipalities in KwaZulu-Natal, “so the argument is, if they support us here in Johannesburg, the DA will then pull the plug and not support them in the municipalities in KwaZulu-Natal, where they are currently governing with the help of the DA”.\n\n“Now they [the IFP] want assurance from the ANC that the status quo in KwaZulu-Natal will remain and they will continue to govern with our full support for them to support us here in Johannesburg – that is the issue now that is a point of discussion,” he said.\n\nA source told City Press that the ANC was hoping to keep the Gauteng matter separate to any disputes in KwaZulu-Natal, however, the IFP wanted to look at the matter holistically.\n\nAlthough the EFF indicated in July that it would no longer be voting with the DA or the ANC in municipalities, City Press has been reliably told that the EFF’s stance could change because of its leadership’s distaste for the ideological centre that has taken control of the DA.\n\nThe IFP has long expressed a wish to reconcile with the ANC and took a resolution during its elective conference in August to making this a reality\n\nA source told City Press that the red berets were expected to discuss how the party would vote when the time came to replace Mashaba.\n\n\n\nMatongo confirmed that “there had been no formal approach from the ANC to them [the EFF] about the coalition government so far because we are waiting for guidance from the national office on whether we should go ahead and talk to them”.\n\nThe ANC regional executive committee will meet next week Tuesday to discuss and recommend three names for the mayoral position.\n\nThose names will be sent to the provincial executive committee, where a final decision will be made.\n\n\n\nA source within the ANC told City Press that one of Mashaba’s possible replacements is the party’s regional chairperson, Geoffrey Makhubo.\n\nThe DA has several people in mind to succeed Mashaba, including DA member of the Gauteng provincial legislature Makashule Gana and Johannesburg member of the mayoral committee Funzi Ngobeni.\n\nInternal DA nominations for the position close on Thursday.", "description": "The governing party is working quickly to get support from kingmakers EFF and IFP, as well as several smaller parties, to take the city back.", "authors": ["Juniour Khumalo", "Queenin Masuabi"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9523/5f84926862584b9e88d8215c2d223a98.jpg", "published_at": "2019-10-28"}