{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/7/redskins-not-planning-trade-trent-williams", "downloaded_at": "2019-10-07 20:01:53.442687+00:00", "title": "Redskins not planning to trade Trent Williams", "language": "en", "text": "ASHBURN — The Washington Redskins have not backed down their stance of not trading Trent Williams.\n\nThe star left tackle is still holding out five games into the season and on Monday, team president Bruce Allen said he would not consider trading Williams “at this time.”\n\n“Really, there’s been no dialogue with any other team,” Allen said.\n\nAllen took questions from reporters Monday afternoon after the Redskins announced earlier they had fired coach Jay Gruden. Washington named offensive line coach Bill Callahan as its interim coach.\n\nWilliams has not reported to the Redskins this season. The seven-time Pro Bowler is disgruntled over his contract situation and the way Washington’s medical staff handled a benign tumor on his scalp, which had to be surgically removed.\n\nWith the Redskins 0-5 and going nowhere, some experts have advocated for the team to trade Williams. Even at 31 years old, Williams would likely fetch a decent return. Multiple teams like the New England Patriots, San Francisco 49ers and Kansas City Chiefs could use an upgrade at left tackle.\n\nBut for now, Allen seems steadfast in his position.\n\nAnd according to ESPN, Williams has no plans to show up anytime soon.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "On Monday, team president Bruce Allen said he would not consider trading Williams \"at this time.", "authors": ["The Washington Times Http", "Matthew Paras"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/07/Redskins_Gruden_Fired_Football_19356.jpg-3291e_c0-145-3424-2141_s1770x1032.jpg?ca8c14d7a607acd13529a83110cbf742f09487e5", "published_at": "2019-10-07"}