{"pub": "metro", "url": "https://metro.co.uk/2019/10/04/pedophile-mother-admits-sex-daughters-underage-boyfriends-10862683", "downloaded_at": "2019-10-05 05:46:11.781469+00:00", "title": "Pedophile mother admits having sex with her daughter’s underage boyfriends", "language": "en", "text": "Coral Lytle has admitted sexually abusing two boys aged 14 and 15, after grooming the youngsters, who were her daughter’s friends (Pictures: Visalia PD/KTLA)\n\nA pedophile mother faces years in jail after she admitted having full sex with her daughter’s underage boyfriends.\n\nCoral Lytle, 42, admitted 21 felony offenses on Tuesday, including sexual intercourse, oral copulation and showing porn to a child.\n\nThe child abuser, of Visalia in California, began molesting one of the boys, who was 15 at the time, in September 2017.\n\nLytle then turned her perverted attentions to a 14 year-old boy during the first week of October 2017.\n\nShe would meet them in parks and parking lots, or even pick them up from their homes and then drive them back to hers for sex.\n\nOn one occasion, one of the boys sneaked out of his home after being picked up by Lytle.\n\nParis knifeman who killed four colleagues linked to Islamic extremist group\n\nThen then drove to the pervert’s house, where she sexually abused him, before she drove him back at 5am the next morning before his parents woke up.\n\nAdvertisement\n\nAdvertisement\n\nThe victims were school friends of Lytle’s daughter, who attended Redwood High School in Visalia.\n\nLytle, whose husband Eric has now divorced her, worked as a masseuse at the time of the abuse, the Visalia Times Delta reported.\n\nShe blamed her behavior on low self-esteem and the death of her sister, which she says made her feel depressed.\n\nLytle’s crimes were exposed after one boy’s parents saw the nude photos she’d sent their son, and contacted police.\n\nIn April, Lytle had been offered a plea deal which would see her handed a six year suspended jail sentence – meaning she’d serve no time behind bars – if she admitted her crimes.\n\nBut presiding Judge Joseph Kalashian ditched that agreement after reading a probation report and discovering the full extent of Lytle’s abuse.\n\nLytle, who goes by the surname Blain since being divorced, is currently on bail.\n\nPreliminary reports suggest she could get as little as four years jail when she’s sentenced on November 4.", "description": "Coral Lytle admitted her crimes at a hearing in Visalia, California, on Tuesday", "authors": ["Jimmy Mccloskey"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/comp-1570193955_1570194340.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-04"}