{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7572013/Tafida-Raqeebs-parents-prepare-fly-severely-disabled-daughter-five-Italian-hospital.html", "downloaded_at": "2019-10-14 23:33:19.882261+00:00", "title": "Tafida Raqeeb's parents prepare to fly their severely disabled daughter, five, to Italian hospital", "language": "en", "text": "The parents of a severely disabled five-year-old girl are preparing to move her to an Italian hospital tomorrow - after winning a historic legal battle earlier this month.\n\nTafida Raqeeb will be flown to the Gaslini children's hospital in Genoa, Italy, three weeks after her parents Shelina Begum, 39, and Mohammed Raqeeb, 45, won a High Court fight with hospital bosses on October 3.\n\nHer solicitor mother, and father, a construction consultant, say plans are in place to fly Tafida from the Royal London Hospital in an air ambulance tomorrow.\n\nTafida Raqeeb (pictured), five, is expected to be flown to the Gaslini children's hospital in Genoa, Italy, tomorrow, according to her parents Shelina Begum and Mohammed Raqeeb\n\nDuring the court case the couple, from Newham in east London, argued against specialists who suggested further treatment would be futile because their daughter had permanent brain damage and was in a minimally conscious state.\n\nTafida's parents thought life-support treatment should continue and asked to move their daughter to a hospital of their choice.\n\nMr Justice MacDonald ruled it was right that difficult decisions should ‘be taken by a parent in the exercise of their parental responsibility’. As Tafida was not suffering, it was vital for him to consider ‘the sanctity of life’.\n\nTafida (pictured), an outwardly healthy, happy little girl who had just started school, was left brain damaged in February when a blood vessel burst in her brain\n\nThe couple’s lawyers — who spent five days arguing in the High Court in London last month — say the ruling establishes that parents know best what care is right for their child.\n\nIt is in the starkest contrast to the tragic cases of Charlie Gard and Alfie Evans, where judges sided with the NHS. Yesterday, the hospital announced it would not pursue an appeal.\n\n‘I am still in shock,’ Shelina, 39, told the Mail at the time. ‘When the judge gave his verdict, I burst into tears. It’s the first time I’ve allowed myself to cry in public. I was overwhelmed. All the stress and tension just poured out.\n\n‘We have waited over three weeks for the verdict and it has been horrific — even harder than when this all started. Privately, I’ve wept every night. On Wednesday I was so petrified that I paced all night.\n\n‘I couldn’t banish the fear that Tafida was going to get a death sentence. I kissed her goodbye and all I could say was, “Pray for life, baby.” ’\n\nThe youngster's solicitor mother Shelina Begum, 39, and father Mohammed Raqeeb, 45, a construction consultant, say plans are in place to fly Tafida in an air ambulance tomorrow\n\nHer mother Shelina Begum (pictured) and father Mohammed Raqeeb won a historic legal victory which will allow them to take their little girl to Italy for treatment\n\n‘I knew the judge had listened very carefully to all our arguments and I have great faith in the justice system — I’m a lawyer. But I was in such a state it took seconds for the verdict to sink in.\n\n‘We aren’t deluded. We know that — even with treatment — Tafida is very unlikely to ever be the same. But this gives her the best chance.\n\n‘She was such an energetic, happy girl with a big smile and a huge heart. I don’t know whether she will ever tear around on her bike again with her dad or whirl around the kitchen showing off her ballet steps.\n\n‘But I hope and pray that one day she will run into my arms. Just to hear her call me “Mummy” again would be magical.\n\n'Whatever happens — whatever adaptations we have to make — we will bring her home and love her.\n\nTafida is pictured in hospital with her mother Shelina Begum and surrounded by uplifting balloons. The parents were overjoyed to win their legal battle\n\n'Her life is precious and our love for her is unconditional. It isn’t based on what she can or can’t do.’\n\nTafida, an outwardly healthy, happy little girl who had just started school, was left brain damaged in February when a blood vessel burst in her brain.\n\nShe had been born with the rare and undiagnosed condition AVM (arteriovenous malformation), which causes a tangle of blood vessels with abnormal connections between the arteries and veins.\n\nFor eight months Tafida's family were forced to fight through the courts to give her a chance of life.\n\nDoctors at the specialist Gaslini children’s hospital in Italy, who have studied her case and seen 11,000 images, are confident they can offer treatment and are now poised to send an air ambulance to collect her.\n\nGaslini, on the northern Italian coast, is one of the top children’s hospitals in Europe.\n\nIn its neurology department Tafida will get an advanced rehabilitation programme, including hydrotherapy and state-of-the-art robot technology, to help her to walk again.\n\nShelina says: ‘Tafida will paddle in the sea and even swim if she’s strong enough . . . She will get to feel the breeze on her face. It will be the first time she will have been in the fresh air since February.’\n\nBut the move will take a financial toll on the family - who have set up a crowdfunding page which has so far raised more than £35,000.\n\nNeither parent has been able to work for months and they are seeking to raise £400,000 for the costs of treatment.\n\nWhile they are in Italy, their 14-year-old son, who has not been named, will stay behind with family members.\n\n‘It’s not ideal but he understands it’s necessary. He adores his little sister so much he even wanted to make his own appeal to the judge,’ says Shelina. ‘We will miss him desperately. But he will fly out to see us at weekends.’\n\nHer parents have spent eight months camping out beside her and have described the 'agony' of every-day as their daughter has only a one per cent chance of living\n\nOn February 8 Tafida was rushed to hospital after collapsing at just after 5am. She told her mother her head was hurting before losing consciousness and her 14-year-old brother performed CPR as they waited for an ambulance.\n\nTafida went through a seven-hour operation at London’s King’s Hospital and was in a coma. Outside the operating theatre, the consultant was frank.\n\n‘He told us: “She only has a one per cent chance. Most likely, she is going to die on the table” ’ recalls Shelina. ‘We were in agony.’\n\nBut while Tafida survived, her condition has been unpredictable.\n\nThe morning after the operation her heart stopped. She went into a coma and the family were told if she had not died by noon, she would die within 24 hours.\n\nBut to the family’s joy a brain stem test showed that, although Tafida had sustained a brain injury, she was not brain dead. ‘That was the best moment,’ recalls Shelina.\n\nAfter two weeks, Tafida opened her eyes for the first time. The family started researching the condition. A birth defect, AVM is caused where blood vessels do not form correctly and can rupture.\n\nIn the brain, the effects are similar to a huge stroke. Around ten babies a year in England are affected, although the condition may not be picked up until later in life.\n\nThe family learned that AVM patients like Tafida go into a deep coma but can slowly emerge as the brain builds new connections.\n\nIn April, Tafida was transferred to Royal London Hospital. In June the medical staff concluded that any more treatment was pointless. ‘They sat us down and said, “Look, we are taking the decision away from you. Any more treatment is futile,” ’ recalls Shelina. ’They would take her breathing tube out and that would be it.’\n\nThe couple have spent eight months camping out beside Tafida. Their ‘home’ is a single bedroom with shared facilities in a house provided by a charity. Shelina has not been home since February.\n\n‘Most days I am with Tafida from 8am until midnight when Mohammed takes over,’ she says. ‘If I can’t be there — because of seeing lawyers — family step in. We don’t want her ever to wake up and feel frightened or wonder, “Where’s Mummy and Daddy?”\n\n‘This has been a victory for all parents. It shows that parents’ rights won’t be taken away. And it recognises the value of disabled children. Tafida might be profoundly disabled but her life is still of value.’\n\nFor more information or to donate to the fund, click here.", "description": "Tafida Raqeeb will be flown to the Gaslini children's hospital in Genoa, Italy, three weeks after her parents Shelina Begum, 39, and Mohammed Raqeeb, 45, won a High Court fight.", "authors": ["Emer Scully For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/18/19702608-0-image-a-2_1571072432690.jpg", "published_at": "2019-10-14"}