{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/speed-up-your-internet-by-limiting-bandwidth-hungry-apps", "downloaded_at": "2019-09-12 07:32:10.502480+00:00", "title": "How To Speed Up Your Internet Connection [Updated]", "language": "en", "text": "You might be paying your ISP for a certain service tier, but that doesn’t mean that you’re getting those speeds both ways — the fine print will likely indicate that your upload speeds are much, much slower than your download speeds.\n\nThough it’s true that you likely spend most of your time on the internet downloading this and that, maxing out your uploads can impact your overall performance. This is a problem that’s easy to check and limit for all the bandwidth-hungry apps you use. But first, it's worth taking a look at the actual speeds that your ISP is offering.\n\nNBN's speediest plans\n\nAustralia's National Broadband Network (NBN) is divided into three main speed tiers, with 'NBN 100' being the fastest. ISPs use their own naming conventions for these plans, so you might see names like 'Premium', 'Unlimited' and 'Limitless'. Whatever the plans are called, they promise to provide speeds above 50 megabits per second.\n\nYou can see the average speeds a plan offers during peak usage hours via each telco's website. (TPG, for example, claims evening speeds of 88.1Mbps on NBN 100 plans.) The Australian Competition and Consumer Commission (ACCC) also provides a quarterly report on real-world NBN speeds.\n\nHere’s a look at NBN 100 plans with the most reliable speeds, according to the ACCC. (Click on the interactive table below for the full list of inclusions.)\n\nThat's all well and good, but what if you're on a fast plan and are still getting sluggish speeds? It that case, it's time to do a little DIY troubleshooting.\n\nWhat’s eating up your background bandwidth?\n\nI’ve recently fallen in love with Glasswire, a freemium tool you can use to see exactly how much you’re downloading and uploading over minutes, hours, days, weeks, and months. This is important, because it’s a great way to see if you’re doing way too much uploading, be it BitTorrent, computer backups, or even synchronising lots of data to a cloud service, that could impact your download speeds.\n\nIf your uploads are interfering with your downloads, or if you want to get ahead of these issues before they become one, it’s easy to set speed limits for the apps that might be eating up most of your bandwidth.\n\nHow to restrict apps’ upload (and download) speeds\n\nIf I notice I have a BitTorrent app running in the background that’s seeding files to everyone around the web — well, first of all, I probably shouldn’t let that run unchecked 24/7. Once I’ve made sure to disable this app from launching at startup (via its settings), I can also pull up the “Speed” section in its settings screen and slap a hard limit on its upload bandwidth. Great apps will even allow you to schedule these limits, in case you want your uploads to go wild during times you aren’t using your PC, but need to pull them back a bit when you’re working or gaming.\n\nThe same is true for the many, many apps I use to sync various parts of my desktop to different services on the web. Don’t laugh; here’s my taskbar:\n\nScreenshot: David Murphy\n\nIn case you don’t want to play the guessing game, that’s Google Backup and Sync, iCloud, OneDrive, Backblaze, and Dropbox. Yes, there are probably all-in-one apps I can use to manage most of those, but I like my buffet of icons.\n\nIf you’re feeling like one (or more) of your cloud-themed apps are responsible for eating up a lot of your upload bandwidth, you might be able to limit their speeds. In Dropbox, for example, this is as easy as pulling up the app’s preferences, navigating to its bandwidth section, and setting some limits for its upload and download rates:\n\nScreenshot: David Murphy\n\nFor a service like Backblaze, which dumps much of what’s on my PC to some magical server in the cloud, limiting the app’s upload speeds during a normal day is critical. You can do this via a slider on its Performance tab:\n\nYou can also schedule the app to only back up your system during certain times of the day:\n\nSome apps, like iCloud, don’t let you limit their bandwidth within the app itself — an annoyance. Instead, you’ll need to use a separate app like TMeter (free) or the ever-popular NetLimiter. The latter will set you back about $43 if you want a licence for the pro version, but comes with a trial version so you can check out its capabilities before you pay up.\n\nThough expensive, the app makes it incredibly easy to restrict the upload and download speeds of any application on your PC:\n\nAnd don’t forget; Windows itself might be to blame, too. Try throttling its updates (or disabling its P2P-like sharing mechanism) and that might help free up some bandwidth for everything else you want to do.", "description": "You might be paying your ISP for a certain service tier, but that doesn’t mean that you’re getting those speeds both ways -- the fine print will likely indicate that your upload speeds are much, much slower than your download speeds....", "authors": ["Alex Walker", "Chris Jager"], "top_image": "https://edge.alluremedia.com.au/m/l/2017/11/speedtest.jpg", "published_at": "2019-09-12"}