{"pub": "reuters", "url": "https://in.reuters.com/article/hongkong-protests-gold/hong-kong-gold-market-losing-shine-amid-political-unrest-idINKCN1VX30U", "downloaded_at": "2019-09-13 01:06:36.553847+00:00", "title": "Hong Kong gold market losing shine amid political unrest", "language": "en", "text": "BENGALURU/HONG KONG (Reuters) - Long-running and sometimes violent street protests in Hong Kong are helping tarnish its lustre as the main physical gateway of gold to China, the world’s top bullion buyer.\n\nFILE PHOTO: A sales assistant takes out gold ornaments for a customer at Caibai Jewelry store, in Beijing, China, August 6, 2019. REUTERS/Jason Lee\n\nClashes between anti-government activists and police in the regional financial hub are spooking tourists and subduing jewellery sales amid concerns about the logistics of shipping the precious metal out of the city.\n\nThat’s squeezing a market already pressured by Beijing’s decision to step up direct gold imports as it seeks to restrict outward capital flows.\n\nThe risk for Hong Kong is that it loses further control of a liquid and portable asset that is traditionally a major conduit of capital flight during periods of economic uncertainty.\n\n“On the individual investor level, we see more clients opting to store their gold in what they consider as safer jurisdictions,” said Joshua Rotbart of J. Robart & Co, a Hong Kong-based bullion house that helps high net worth individuals buy, store and transport precious metals.\n\n“We know at least hundreds of millions worth of gold has left Hong Kong, mostly to Singapore, but some to Switzerland,” Rotbart added.\n\nIn July, the second month of major protests in Hong Kong, and two months after Beijing imposed import restrictions, China’s imports of gold from Hong Kong dropped to 8.085 tonnes. That was their lowest level in at least eight years, according to official Hong Kong records.\n\n(GRAPHIC: China gold imports via Hong Kong seasonally - here)\n\nHong Kong has traditionally been one of the world’s most active physical gold markets, with long-established trade routes through its historic jewellery district making it the Asian hub for bullion banks and dealers.\n\nBut the latest political unrest, fuelled by anger over planned legislation to allow extraditions to China, is weakening already faltering trade winds. Hong Kong’s share of China’s gold imports has dropped to just under 40% currently, from around 70% in 2014, according to consultants GFMS Refinitiv and official Hong Kong data.\n\nGFMS Refinitiv data also shows Hong Kong bullion flows to mainland China plummeted 45% in the first half of this year to 175.7 tonnes, compared with 321.1 tonnes a year ago.\n\n(GRAPHIC: China gold imports from Hong Kong vs other top suppliers by share - here)\n\n(GRAPHIC: China gold imports from Hong Kong vs other top suppliers by month - here)\n\nQUIET TRADE\n\nEconomists have warned the current series of violent anti-government protests is already taking a heavier toll on Hong Kong’s economy than 2014’s ‘Umbrella revolution’. Official data showed visitor arrivals plunged nearly 40% in August from a year earlier.\n\nRotbart said the disruption to flights as demonstrators closed down the international airport was a major concern as gold is usually shipped via commercial passenger flights.\n\nOn a recent visit to Hong Kong’s Causeway Bay district, gold shops were quiet, many with few to no customers and sales staff phone surfing or idly chatting.\n\n“The Hong Kong (gold) market is quiet and a big mess, with the violence,” said Ronald Leung, chief dealer at Lee Cheong Gold Dealers in Hong Kong.\n\nOf two dozen gold stores visited by Reuters, retailers said shoppers from the mainland had dropped off by between 10% and 50% because of the protests.\n\n“Usually there would be more people around, especially in the afternoon and evening,” said the manager for Garman Jewellery store, a man surnamed Hi. “You can see it when you look outside, there’s less people walking on the streets.”\n\nAlan Wang, a Daigou shopper from Shenzhen who purchases goods in Hong Kong for mainland customers, said orders for gold products had dropped around 20%, due also to Beijing’s import changes.\n\nSlideshow (3 Images)\n\n“In the past usually I will take some gold products because they are light and have higher spread on price,” Wang said. “But now, there are increasingly more gold shops in mainland China and gold price spreads are narrowing.”\n\nRotbart said his firm still considered Hong Kong a safe location for storing gold, but the jury was out.\n\n“Further disruptions, either from the protestors side or the government’s side will encourage us revisit our recommendations to clients, and consider moving assets away from the city,” he said.", "description": "Long-running and sometimes violent street protests in Hong Kong are helping tarnish its lustre as the main physical gateway of gold to China, the world's top bullion buyer.", "authors": ["Sethuraman N R", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429248696&w=1200&r=LYNXNPEF8C001", "published_at": "2019-09-13"}