{"pub": "vice", "title": "Japanese Stamps That Identify Gropers Sold Out in Minutes", "url": "https://vice.com/en_asia/article/zmjn89/japanese-stamps-that-identify-gropers-sold-out-in-minutes", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 06:59:40.497961+00:00", "text": "Japanese women now have an extra line of defense against chikan (public sexual harassment) that they can carry in their purses. It’s an anti-groping stamp that marks perpetrators with invisible ink.\n\nCreated by stationery company Shachihata Ink, the device launched on the company’s online store on Aug. 27 with 500 units and sold out after just 30 minutes of going on sale, CNN reported. The product was first announced in May 2019 as a response to women detailing horrific sexual harassment stories on Twitter.\n\nWomen can pull out the stamp to mark attackers with an image of an open palm. The mark is invisible and only shows up under an ultraviolet light attached to the device. This way, others who have the stamp can identify the perpetrators, reported by Japan Today. It costs 2,500 Japanese yen, which is about $24 USD.\n\n“It should have a big impact on society,” Yayoi Matsunaga, director of the Groping Prevention Activities Center in Osaka, told The Japan Times.\n\nHowever, the device also has its critics. Some question its effectivity, while others say that anyone could stamp the wrong person.\n\nPublic transport in Japan is notorious for chikan. Newsweek reported that 70 percent of young women in the country say they’ve been fondled on public transportation.\n\nA report by the Mainichi Shimbun found that over 50 percent of sexual harassment cases in Japan occur on trains. Another 20 percent take place in train stations. In 2017, the Metropolitan Police Department report found that the victims ranged from less than 10 years old to over 50 years old, according to The Japan Times.\n\nJapan has been criticized for its slow adoption of the #MeToo movement but awareness on sexual harassment has grown in the past year. It started in April 2018, when female journalists came forward with stories of abuse they’ve faced.\n\nFind Meera on Twitter and Instagram.", "description": "About 70 percent of Japanese women have reported being groped on public transport.", "authors": ["Talia Slonim", "David Gilbert", "Meera Navlakha"], "top_image": "https://video-images.vice.com/articles/5d6786913f33970008661beb/lede/1567065794081-liam-burnett-blue-qwEUsg7UbI-unsplash.jpeg?crop=1xw:0.3746xh;0xw,0.4037xh&resize=1200:*"}