{"pub": "huffpost", "url": "https://huffpost.com/entry/white-house-john-kelly-trumps-genius_n_5db4eecbe4b05df62ec04e6b", "downloaded_at": "2019-10-27 03:59:33.903398+00:00", "title": "White House Denies John Kelly's Impeachment Remark: He Can't Handle Trump's 'Genius'", "language": "en", "text": "John Kelly, former White House chief of staff, said at a political conference on Saturday afternoon that he warned President Donald Trump against hiring a “yes man,” telling him that he would get impeached if he did.\n\nBut later Saturday, in a statement to CNN, Trump denied that such a conversation took place and said if Kelly had, he would have “thrown him out of the office.”\n\nWhite House press secretary Stephanie Grisham elaborated on that with another statement to CNN.\n\n“I worked with John Kelly,” Grisham said. “and he was totally unequipped to handle the genius of our great President.”\n\nThe White House confirmed both of the statements to HuffPost.\n\nKelly, a retired four-star Marine Corps general, was speaking at Sea Island Summit political conference in Georgia hosted by the Washington Examiner when he opened up about regretting leaving the administration now that Trump’s facing an impeachment inquiry.\n\nHis remarks, as reported by the Examiner, hinted at his opinion of the current administration and the White House’s acting chief of staff Mick Mulvaney.\n\n“Someone has got to be a guide that tells [the president] that you either have the authority or you don’t, or Mr. President, don’t do it,” Kelly said, according to the political magazine. “Don’t hire someone that will just nod and say, ‘That’s a great idea Mr. President.’ Because you will be impeached.”\n\nThe Trump administration has been on the defensive for months since two whistleblower reports accused him of illegally seeking a foreign country’s help to meddle in the U.S. election by calling the Ukranian president and asking him to investigate his political rival, former Vice President Joe Biden.\n\nEarlier this month, Mulvaney admitted, then denied, that Trump withheld $391 million in foreign aid to Ukraine as he made his request to investigate his rival. However, in his admission, Mulvaney said Trump wanted Ukraine to investigate the Democratic National Committee’s computer server over an unfounded conspiracy theory.\n\nRecalling a conversation he had with Trump before leaving office, Kelly said he urged the president not to hire someone who would tell him the truth.\n\n“I said, whatever you do — and we were still in the process of trying to find someone to take my place — I said whatever you do, don’t hire a ‘yes man,’ someone who won’t tell you the truth — don’t do that,” Kelly said. “Because if you do, I believe you will be impeached.”\n\nKelly also said that the current administration doesn’t have a proper system to prevent Trump from being vulnerable to impeachment probes.\n\n“The system that should be in place, clearly — the system of advising, bringing in experts in, having these discussions with the president so he can make an informed decision — that clearly is not in place. And I feel bad that I left,” the New York Times quoted Kelly as saying at the event.\n\nS.V. Date contributed to this report.", "description": "The former chief of staff said earlier that he warned Trump against hiring a \"yes man\" because it would get him impeached.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5db4f115200000da29506e11.jpeg?ops=1778_1000", "published_at": "2019-10-27"}