{"pub": "independent", "title": "More than three-quarters of young people who seek mental health support have to cope on their own, study finds", "url": "https://independent.co.uk/life-style/health-and-families/mental-health-young-people-depression-support-therapy-uk-charity-a9087726.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:09:09.099443+00:00", "text": "Almost one in eight young people who have sought mental health support have had to manage on their own, new research has found.\n\nA major new study conducted by child and adolescent mental health charity YoungMinds has highlighted the “huge gaps” that exist within early support for young people who are experiencing mental health problems.\n\nIn August, the charity surveyed more than 7,000 people across the UK, all of whom were under 25 and had previously attempted to search for mental health support.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe participants were asked questions including what factors they believe have affected their mental health, who they are likely to turn to for support, how accessible they believe mental health support is in the UK and how self-assured they feel taking care of their mental health on their own.\n\nAccording to the researchers’ findings, more than two-thirds of the respondents said that they were unable to find mental health support when they were first in need of it.\n\nFurthermore, 78 per cent of those surveyed said they had to figure out how to cope without any help as they were unable to successfully find support.\n\nDespite this high statistic, only 17 per cent of the young people questioned stated that they felt confident managing their mental health on their own.\n\nEmma Thomas, chief executive of YoungMinds, explained the significance of the illuminating results of the charity’s survey.\n\n“These results show how hard it can be for young people to get help when they first start to struggle – and we know that the impact of leaving it too late can be devastating,” she said.\n\n“It’s vital that we ensure that the right help is available when young people first need it. We know that local support, through youth clubs or local charities, can be incredibly helpful – but this is something only a small number of young people are able to get.”\n\nThomas added that it’s “far better” that young people are able to access help as early as possible, “rather than add to the numbers needing specialist support”.\n\nShape Created with Sketch. Sow Ay illustrations on mental health Show all 18 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Sow Ay illustrations on mental health 1/18 2/18 3/18 4/18 5/18 6/18 7/18 8/18 9/18 10/18 11/18 12/18 13/18 14/18 15/18 16/18 17/18 18/18 1/18 2/18 3/18 4/18 5/18 6/18 7/18 8/18 9/18 10/18 11/18 12/18 13/18 14/18 15/18 16/18 17/18 18/18\n\nThe factor that respondents said was most likely to affect their mental health was the pressure to perform well at school or at college, with 77 per cent of the participants saying so.\n\nThe second most impactful factor was worrying about their appearance, which affected 69 per cent of those surveyed, followed by familial issues, which impacted 62 per cent of those questioned.\n\nMore than one in seven of those who took part in the study said they turned to their friends for help while they were waiting for mental health support.\n\nSome 63 per cent said they turned to their parents for assistance, while 53 per cent said they turned to the internet for guidance.\n\nYoungMinds published the findings of the study to coincide with the launch of its Act Early campaign, an initiative that is urging the government to adopt a new strategy when it comes to ensuring that young people are provided with mental health support as early as possible.\n\n“We’re seeing welcome investment in NHS mental health services and some positive initiatives in schools, but, with rising demand, it won’t be enough to meet the need,” Thomas said.\n\n“The government must also take action to address the factors that can affect young people’s mental health – like academic pressure and how we support children who’ve lived through traumatic experiences.”\n\nIf you are a young person in need of mental health support, you can contact the free YoungMinds Crisis Messenger service by texting YM to 85258 or contact Childline by calling 0800 1111 for free.\n\nIf you are an adult in need of mental health support, you can contact the free Samaritans helpline on 116 123.", "description": "Almost one in eight young people who have sought mental health support have had to manage on their own, new research has found. A major new study conducted by child and adolescent mental health charity YoungMinds has highlighted the “huge gaps” that exist within early support for young people who are experiencing mental health problems.", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/01/16/istock-976103260.jpg"}