{"pub": "americanconservative", "url": "https://theamericanconservative.com/dreher/bless-me-ficus-for-i-have-sinned", "downloaded_at": "2019-10-05 13:38:20.545626+00:00", "title": "‘Bless Me, Ficus, For I Have Sinned’", "language": "en", "text": "A reader sent this story from Sojourners magazine, the stalwart journal of progressive Christianity, saying that they appear to have left Christianity behind. Why? Because they published this cockamamie piece by Claudio Carvalhaes, the Union Seminary professor who led a class to confess their sins to a synod of houseplants. Carvalhaes explains himself thus:\n\nLast week our chapel service was called Temple of Confessions. As we gathered in the narthex of James Chapel, I gave an introduction that included these words: Many of us have a disconnected relationship with nature and relate to nature as outside things, as “it.” Today we will try to create new connections by talking to the plants, soil, and rocks and confess how we have related with them. Confessions are also forms of mending relations, healing, and changing our ways. We are all manifestations of the sacredness of life and the “we” of God’s love is way beyond the human, so let us confess to “each other” including plants, soil, rocks, rivers, forests. We processed into the chapel carrying plants and placed them on soil. Immediately people started to come to the plants, to confess their forms of relation or non-relation. One student said something that stuck with me: “I don’t know how to relate to you in this subjective way. I am afraid that if I do I might discover a level of pain that I don’t know whether I can bear.”\n\nHoo boy. Sounds like As The Orchid Turns up in that hysterical hothouse.\n\nMore:\n\nWhen we confess to plants, to forests, to each tree, every meadow, to birds, fish, rocks, animals, rivers, and mountains, we repent, mourn and reconnect ourselves to a much larger web of life, made of people, animals, creatures, and ecosystems that we have lost, taken away from our common home. This understanding demands a reinterpretation of democracy. When are we going to consider the seeds and the panther and the zebras and the cows and horses as part of our democracy?\n\nAmen! My elderly dog Roscoe deserves a vote! So does the rosemary bush on the back porch. Sorry to tell you, Prof. Carvalhaes, but they’ll probably go Trump.\n\nI’m all for being more ecologically sound in our theology — the Catholic and Orthodox churches, for example, have strong teaching in this area — but this is nuts.\n\nProf. Carvalhaes is a teaching elder in the Presbyterian Church (USA). Whee!\n\nHere’s a video from the seminary in which Prof. Carvalhaes explains it all:", "description": "", "authors": ["Rod Dreher"], "top_image": "https://www.theamericanconservative.com/wp-content/uploads/2019/10/Screen-Shot-2019-10-04-at-7.21.48-PM.png", "published_at": "2019-10-04"}