{"pub": "realclearpolitics", "url": "https://msn.com/en-us/news/politics/opinions-is-trump-a-president-or-a-timeshare-salesman/ar-AAGmCLn", "downloaded_at": "2019-09-04 04:10:29.830130+00:00", "published_at": "2019-09-04", "title": "Opinions | Is Trump a president or a timeshare salesman?", "language": "en", "text": "Editor’s note: The opinions in this article are the author’s, as published by our content partner, and do not necessarily represent the views of MSN or Microsoft.\n\nThe Amazon is burning, a trade war is escalating, and the world economy is deteriorating.\n\nEnter President Trump, taking the stage on Monday at the Group of Seven gathering of world leaders in Biarritz, France, to assure an anxious world that . . . his golf resort in Miami is just tremendous!\n\n“With Doral, we have a series of magnificent buildings — we call them bungalows — they each hold from 50 to 70 very luxurious rooms with magnificent views,” Trump said at the closing news conference of the international gathering.\n\nSubscribe to the Post Most newsletter: Today’s most popular stories on The Washington Post\n\nTrump, who had been asked to clarify his earlier (inappropriate) remarks promoting his Miami-area property at the international gathering, instead expanded on them: “We have incredible conference rooms, incredible restaurants. And we have many hundreds of acres so that in terms of parking, in terms of all of the things that you need, the ballrooms are among the biggest in Florida, and the best.”\n\n“We.” With that pronoun, Trump spoke not as president of the United States but as de facto head of the Trump Organization. And he now endeavors to abuse his status as host of next year’s G-7 summit to force foreign countries and U.S. taxpayers to pump millions more dollars into one of his properties.\n\nTrump is essentially requiring foreign governments to pay him the very definition of unconstitutional emoluments. Is this a president or a timeshare salesman?\n\nTrump is often criticized for representing only those who voted for him, but even that description seemed generous Monday. On French soil, Trump seemed to be representing only himself.\n\nThis isn’t the first time Trump has been unable (or unwilling) to distinguish the national interest from his own. And his l’etat-c’est-moi routine isn’t just for the French. After meeting recently with mass-shooting victims, he rhapsodized about their “love for me — and me, maybe, as a representative of the country — but for me.”\n\nHe has badgered the Federal Reserve chairman to reduce interest rates, which would benefit him as a huge borrower. The president has made untold millions from his tax cuts and from foreign governments booking rooms and meals at his properties.\n\nTrump makes geopolitical decisions based on how he’s treated personally. It’s no mere coincidence that Japan, which nominated Trump for the Nobel Peace Prize and gave him a fancy state visit, has escaped the worst of his trade wrath. By contrast, he canceled a visit to Denmark and claimed the prime minister had insulted the United States by labeling “absurd” his (absurd) plan to buy Greenland: “You don’t talk to the United States that way!”\n\nAccordingly, Trump’s peers at the G-7 were careful to stroke his ego with talk of his powerful traits, his lovely wife, his new grandchild. Even so, no one praised Trump as much as Trump.\n\nOn the environment: “I think I know more about the environment than most people.”\n\nOn oil drilling in the Arctic National Wildlife Refuge: “I was able to get ANWR approved. Ronald Reagan wasn’t able to do it.”\n\nOn trade: “We never had a president that understood this.” Until now!\n\nAsked about Russia rejoining the G-7, Trump found himself boasting: “I ran one election and I won. Happened to be for president.”\n\nAsked about his mixed messages on trade, he replied: “It’s done well for me over the years, and it’s doing even better for the country.”\n\nHe said he’d accept an invitation to visit Berlin, not because Germany is a key ally but because “I have German in my blood.”\n\nAbove all, he celebrated the greatness of Trump Organization holdings.\n\n“I own great property in the U.K.” he said when asked about new Prime Minister Boris Johnson, adding, “I own Turnberry and I own in Aberdeen and I own in Ireland, as you know, Doonbeg and great stuff.”\n\nGreat stuff! His travels to his properties in Ireland, Scotland, Virginia, New Jersey, Florida and elsewhere (on 255 days of his presidency, The Post calculated in June) have funneled them a fortune in taxpayer dollars.\n\nNow, it’s Doral’s turn. Seated earlier Monday with German Chancellor Angela Merkel, Trump gave a hard sell for the resort: “Great place.” “Tremendous acreage.” “Next to the airport.” Nothing “close to competing with it.” Later, he explained that “my people” looked at potential G-7 locations and — surprise! — “they came back and said, ‘This is where we’d like to be.’ ”\n\nIt would be a nice boost for the underperforming resort, yet Trump believes he is the one making a sacrifice. The presidency has cost him more than $3 billion, he lamented on Monday, from lost income from giving motivational speeches, for example.\n\n“I don’t care about making money,” Trump claimed Monday. What’s more, “I’m not going to make any money” from hosting the G-7 at Doral.\n\nOf course not. And if you don’t believe him, you can check his tax returns.\n\nTwitter: @Milbank\n\nRead more from Dana Milbank’s archive, follow him on Twitter or subscribe to his updates on Facebook.\n\nRead more:\n\nMax Boot: Is Trump a liar or a fantasist? Neither option is good.\n\nJennifer Rubin: Trump’s unhinged display should frighten everyone\n\nEugene Robinson: Trump is increasingly untethered from reality\n\nFred Hiatt: There’s never been a president like Trump. Just look at his gun-control record.\n\nThe Post’s View: Trump gives a stunning display of incoherence at the G-7", "description": "Is this a president or a timeshare salesman?", "authors": [], "top_image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAGmA1F.img?h=202&w=300&m=6&q=60&o=f&l=f&x=1429&y=1365"}