{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7581441/Scientists-FLOOD-Bioshphere-2-CO2-climate-change-impact-rain-forest.html", "downloaded_at": "2019-10-16 23:18:29.338031+00:00", "title": "Scientists FLOOD the Biosphere 2 with CO2 to see how climate change will impact the rain forest", "language": "en", "text": "In Arizona, scientists have commenced a new six-week experiment to learn more about how climate change will effect rain forests.\n\nThe group of researchers, led by a physiologist from the University of Freiburg, flooded the Biosphere 2 with approximately $12,000 worth of carbon dioxide.\n\nThe spike in CO2 levels will be accompanied by a planned six week drought to test how the different trees and plants will manage their own stored CO2 levels under worsening climate change conditions.\n\nScroll down for video\n\nA group of researchers sealed the Biosphere 2 in Arizona and flooded it with carbon dioxide to test what will happen to the stored CO2 in rain forest trees and plants as climate change accelerates\n\nResearchers have observed that as climate change has accelerated, droughts will become more frequent, which in turn could trigger even greater concentrations of CO2 gas to be released from plant life.\n\nCO2 is a greenhouse gas that traps heat in the environment that accelerates climate change.\n\n'You need these experiments to unlock the physiology and add it into the models,' William Anderegg, one of the researchers, told Science Magazine.\n\n'It gets us much more mechanistic and rigorous projections of how tropical trees and forests might respond to climate change.'\n\nThe Biosphere 2 was originally built in the 1980s at a cost of more than $150 million\n\nThere are 90 different plant species currently living in the Biosphere 2\n\nTrees absorb CO2 from the atmosphere and store it, and different species release it under different circumstances.\n\nCO2 concentration in the atmosphere has risen by 24 percent since 1958.\n\nResearchers are interested in testing what rain forest plantlife will do with its stored CO2 during drought or periods of spiking CO2 concentration in the atmosphere.\n\nThe Biosphere 2 contains around 90 plant species similar to what could be found in a rain forest.", "description": "Scientists are taking advantage of the Biosphere 2's unique enclosures to test how climate change might affect rain forests, which store enormous amounts of CO2.", "authors": ["Michael Thomsen For Dailmail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/22/19808188-0-image-a-62_1571262069722.jpg", "published_at": "2019-10-16"}