{"pub": "yahoo", "url": "https://sg.news.yahoo.com/maid-stole-employers-chanel-bags-to-use-on-her-off-days-122853968.html", "downloaded_at": "2019-10-24 15:03:19.584947+00:00", "title": "Maid stole employer's Chanel bags to use on her days off", "language": "en", "text": "Onita, 28, pleaded guilty to two out of four theft charges. (Photo: Getty)\n\nSINGAPORE — A 28-year-old maid from Indonesia who stole her employer’s branded bags to use on her days off was on Thursday (24 October) jailed for six months at the State Courts.\n\nOnita, who goes by one name and is 28, pleaded guilty to two out of four theft charges.\n\nThe remaining counts were considered in sentencing as part of her plea bargain.\n\nIn early February, Onita was cleaning her 40-year-old female employer’s room when she saw a pink Chanel bag worth $6,000. It was stored on a shelf in the victim’s walk-in wardrobe, along with other branded bags.\n\nOnita intended to steal the bag. She took it and kept it in her room. Later, she used the bag during her outings on her days off. She even posted a photo on Facebook on 18 February of her carrying the pink bag slung over her shoulder.\n\nIn May, the maid was cleaning her employer’s room again when she saw a brand new black Chanel model 2.55 bag worth $8,500 in a dust cover on a shelf in the walk-in wardrobe.\n\nShe intended to steal the bag and replaced it with the pink bag. She kept the black bag in her room.\n\nThree months later, on 16 August, the victim realised that her black bag was missing. She found her pink bag in its place and searched for the black bag in her house with Onita’s help but to no avail.\n\nIn desperation, the victim told Onita that she would report the matter to the police. Panicking, Onita went to fetch the bag from her room and admitted to her deeds.\n\nA week later, on 24 August, the victim scrolled through Onita’s Facebook page and saw the photo she posted on 18 February posing with the pink bag.\n\nThe victim made a police report about the thefts the same day.\n\nIn March, Onita also stole a $1,000 Louis Vuitton wallet belonging to her employer. The next month, she stole $800 in cash.\n\nThe maximum punishment for theft as an employee is up to seven years’ jail and a fine.\n\nOther Singapore stories:\n\nMan fined for masturbating and urinating in female residents' shoes\n\n1.4M Singaporeans to receive Bicentennial Bonus\n\nLotte Duty Free awarded deal to run liquor and tobacco stores in Changi Airport, launch in June 2020", "description": "SINGAPORE — A 28-year-old maid from Indonesia who stole her employer’s branded bags to use on her days off was on Thursday (24 October) jailed for six months at the State Courts.", "authors": ["Amir Hussain", "Senior Reporter"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.pDTs2OWxTZ0Vi3pnDHdbQ--~B/aD0zNTk1O3c9NTM5MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/4d2af490-f653-11e9-bf57-7ca6da40c694", "published_at": "2019-10-24"}