{"pub": "investing.com", "url": "https://uk.investing.com/analysis/opening-bell-dollar--yields-drop-on-renewed-sinous-tension-futures--slip-200433511", "downloaded_at": "2019-10-16 14:13:49.834043+00:00", "title": "Opening Bell: Dollar, Yields Drop on Renewed Sino-U.S. Tension; Futures Slip", "language": "en", "text": "China warned it would take 'strong measures' after U.S. Congressional lawmakers expressed support for Hong Kong protestors\n\nYesterday, U.S. stocks climbed to four-week high on earnings optimism, with the S&P 500 topping 3,000 intraday\n\nGold falls despite U.S. asset risk-off\n\nKey Events\n\nWith tensions increasing between the U.S. and China over in Hong Kong, U.S. futures contracts are slumping. Asian stocks ignored geopolitics during this morning's trade and instead followed yesterday’s U.S. session higher, focusing on optimism regarding corporate earnings results and a potential Brexit deal.\n\nContracts on the , and have recouped some of their losses, but remain lower nonetheless. The unease ahead of the U.S. open comes after China threatened countermeasures in response to a U.S. House bill supporting Hong Kong protestors.\n\nGlobal Financial Affairs\n\nEuropean futures were flat today, as if traders were clinging to a middle ground, unable to decide between the rallies in Asia or the losses in U.S. futures.\n\nExcept for China’s (-0.4%), all Asia-Pacific benchmarks were in the green. , (+1.27%), beat regional indices. South Korea's advanced 0.71%, maintaining gains after the country's central bank for the second time in three months, matching a record low in order to combat increasing deflationary pressures.\n\nDuring yesterday’s U.S. session, stocks hit a four weak high on earnings beats. and shares tracked the broader equity activity. The jumped more than 1.2%, while the topped 3,000 on an intraday basis for the first time in three weeks.\n\nU.S. yields, including for the Treasury note, dropped along with global rates, as Brexit deal optimism increased.\n\nUST 10-Y Daily\n\nTechnically, yields met with resistance at the top of a symmetrical triangle—a pattern illustrating a stand-off between Treasury buyers and sellers—and the 100 DMA. The triangle’s development below the downtrend line since November 2018 gives Treasury bulls an edge, suggesting yields will break to the downside of the triangle.\n\nDXY Daily\n\nOn an intraday basis, the has broken the bottom side of a rising channel, falling to its lowest point since August.\n\nGBPUSD Daily\n\nmaintained gains after surging yesterday, as the UK and EU appear to be come to the brink of a Brexit deal\n\nGold Daily\n\nDespite lower U.S. futures, falling yields and a sagging dollar, has edged lower earlier today. Technically, the yellow metal has been trading within a falling channel since early September.\n\nBTC/USD Daily\n\n's slump continues. For added bearish emphasis it slipped below its rising channel whose upper boundary is also the cryptocurrency's 200 DMA. However, because of the digital currency’s volatile nature, we’re not calling a downside breakout yet. That would occur when a full, long red candle develops on its downside.\n\nUp Ahead\n\nU.S. , released today, are forecast to increase for a seventh straight month.\n\nChina releases third-quarter , September and data on Friday.\n\nMarket Moves\n\nStocks\n\nJapan’s rose 0.7%, after climbing as much as 1.6% earlier.\n\nAustralia’s gained almost 1.3%.\n\nKorea’s KOSPI rose 0.71%.\n\nHong Kong's was up 0.61%.\n\nwere up 0.1%.\n\nCurrencies\n\nThe Dollar Index rebounded to 98.25 from 98.17, paring a decline to less than 0.05%.\n\nThe rose 0.2% to 108.68 per dollar.\n\nThe fell 0.3% to 7.1036 per dollar.\n\nThe traded at $1.1036, little changed.\n\nThe was at $1.2768, down 0.1% after jumping 1.4% overnight.\n\nBonds\n\nThe yield on 10-year Treasuries fell three basis points to 1.74%.\n\nAustralia’s bond yield rose four basis points to 1.05%.\n\nCommodities\n\nrose 0.5% to $53.06 a barrel.\n\nGold edged lower to at $1,481.13.", "description": "Market Overview Analysis by Investing.com (Pinchas Cohen/Investing.com) covering: EUR/USD, GBP/USD, USD/JPY, XAU/USD. Read Investing.com (Pinchas Cohen/Investing.com)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://uk.investing.com/analysis/not found", "published_at": "2019-10-16"}