{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/27/gunman-loose-after-2-killed-14-wounded-college-homecoming-party", "downloaded_at": "2019-10-28 00:34:29.539111+00:00", "title": "Gunman on Loose After 2 Killed, 14 Wounded at College Party", "language": "en", "text": "A gunman is on the loose after allegedly killing two persons and wounding numerous others at an off-campus homecoming party in Greenville, Texas.\n\nThe Associated Press reports the party was attended by students from Texas A&M University-Commerce, but “it was not a school-sanctioned event.”\n\nShots rang out around midnight Saturday, when an attacker allegedly using a handgun opened fire.\n\nThe party drew a crowd of roughly 750 people, and three law enforcement officers were present when the shooting occurred. The attacker is believed to have entered through a back door.\n\nThe two deceased individuals were both males and the 14 people wounded included some who were not wounded by gunshots, but were hurt during the rush for windows and doors after shots rang out.\n\nCNN reports that party attendees have been “reluctant” to provide Hunt County Sheriff Randy Meeks with a description of the attacker.\n\nMeeks commented on the situation, saying, “It appalls me that, as many folks that were there, (they) have not been able to give us a better description of this shooter. Due to the many different descriptions being provided by those in attendance at that party, we unfortunately do not have any solid suspect information to provide at this time.”\n\nAWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.", "description": "A gunman is on the loose after allegedly killing two persons at an off-campus homecoming party in Greenville, Texas.", "authors": ["Awr Hawkins"], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/27/c9d7c3_texas-shooting-84767-officials-work-crime-scene-shooting-party-venue-on-e1572212240880-639x335.jpg", "published_at": "2019-10-27"}