{"pub": "cnbc", "url": "https://cnbc.com/2019/09/27/russia-and-chinas-relationship--how-deep-does-it-go.html", "downloaded_at": "2019-09-27 07:15:40.582074+00:00", "title": "Are Russia and China the best of friends now? It's complicated, analysts say", "language": "en", "text": "Russian President Vladimir Putin and his Chinese counterpart Xi Jinping enter a hall during a meeting at the Kremlin in Moscow on June 5, 2019. MAXIM SHIPENKOV | AFP | Getty Images\n\nRussia and China appear to be increasing their economic, political and military ties amid poor relations with the West. But the relationship is far more nuanced than it first appears with strengths and weaknesses on both sides, experts note. While U.S. trade relations with China have soured, as each slap billions of dollars' worth of tariffs on each other's goods, trade relations between China and Russia are blossoming. Chinese President Xi Jinping even called Russian President Vladimir Putin his \"best friend\" in an uncharacteristic display of warm relations during a state visit to Russia this summer. Xi also promised Putin that China was \"ready to go hand in hand with you\" and the leaders signed statements committing to \"the development of strategic cooperation and comprehensive partnership\" between their nations and \"strengthening strategic stability (which) includes international issues of mutual interest, as well as issues of global strategic stability.\"\n\nEconomic ties\n\nStrengthening economic ties is a large part of warm Sino-Russia relations. Last week, Russian and Chinese news agencies reported that the two countries want to double their trade over the next five years, to $200 billion by 2024 — up from $107 billion worth of trade in 2018 — by implementing joint projects in fields of energy, industry and agriculture. Despite making vows to increase bilateral trade, the economic relationship between Russia and China is not a marriage of equals. The International Monetary Fund expects Russia's economy to grow 1.2% in 2019; China, meanwhile, is expected to 6.3%. It's no surprise then that Russia sees China as a massive growth market at a time when its trade with western nations is sorely restricted. Russia is still subject to economic sanctions for its annexation of Crimea from Ukraine in 2014, as well as interference in the 2016 U.S. election and the nerve agent poisoning of a former double agent in the U.K. With that in mind, it makes sense that Russia is seeking an economic — and geopolitical — partner and ally to the East. Their pledge to increase trade comes amid \"a bifurcation in the U.S. and China's spheres of influence,\" Cailin Birch, global economist at the Economist Intelligence Unit, told CNBC Thursday. \"Obviously, the U.S. and China have no love lost between them and it would make much more sense for Russia to seek to build ties with this massive emerging market which will be a source of growth, in the way that the U.S. won't be going forward, and with whom they don't have the same political conflicts, and that presents a lot more opportunities to the Russian market for Russian energy products and developing their economic ties,\" she noted. For China, a partner like Russia that would \"set the U.S. slightly ill at ease would be hugely beneficial,\" she added. Russia also has something that China needs in abundance – energy. Russia is among the world's top three producers of oil and natural gas whereas China is the second largest crude oil importer in the world. \"China is the main source of new energy consumption for fossil fuels particularly, and having a strong partner on its doorstep that's ramping up its production of crude oil, the fabrication of LNG (liquefied natural gas) and the shipping of that all around the world, would also be beneficial to China,\" Birch said.\n\nRussia-China war games\n\nSecurity and defense is another area where Russia and China have ostensibly sought to build ties and experts agree that Russia has more practical military experience than China. Just last week, China's 'People's Liberation Army' was one of seven foreign forces (including India and Pakistan) invited to join Russia's \"Tsentr 2019\" massive military drills that took place across a swathe of Russia. It was the second year China has participated, and its continued involvement is seen as significant by experts like Richard Weitz, senior fellow and director of the Center for Political-Military Analysis at Hudson Institute. \"Chinese and Russian national security communities share common objectives that can be promoted through further cooperation, such as border security, military technology development, and counterterrorism,\" he told CNBC on Monday. \"They also perceive threats from U.S. and allied positions and policies that they can cooperate to thwart, such as U.S. missile defenses and Western military intervention in regional hotspots. They conversely see opportunities to expand their influence at the expense of the United States, including by undermining U.S. bilateral and multilateral alliances.\"\n\nBest of enemies?\n\nThe old adage that \"my enemy's enemy is my friend\" could be applied currently when it comes to China and Russia's relationship with the U.S. right now. Sino-U.S. relations are currently more acrimonious than those between Russia and the U.S, given the lack of resolution to the trade dispute,. For China, President Trump's decision to up-end the status quo when it came to Sino-U.S. trade — because of what he has seen as unfair trade practices — and to impose billions of dollars' worth of tariffs on Chinese imports as a result, has dented its economic growth and potential. Against this backdrop, boosting Sino-Russia bilateral trade could open a door to growth for both Moscow and Beijing as lawmakers and officials confront trade barriers like sanctions and imports tariffs elsewhere. \"There's a growing consensus that a partnership between Russia and China is quite a powerful force, led by China rather than Russia, but that between the two of them they could represent quite a powerful bloc and I think the U.S. is growing increasingly concerned by that,\" the EIU's Birch noted. She added that \"Russia would be the junior partner based on size of market and its prospect for growth so obviously in that sense, Russia would be pulled into China's sway slightly.\"\n\nChina-Russia: A threat or not?", "description": "Russia and China appear to be increasing their economic, political and military ties amid poor relations with the West.", "authors": ["Holly Ellyatt"], "top_image": "https://image.cnbcfm.com/api/v1/image/106150452-1569504089453gettyimages-1148110865.jpeg?v=1569504118", "published_at": "2019-09-27"}