{"pub": "fox", "url": "https://foxbusiness.com/markets/ford-stock-falls-amid-disappointing-third-quarter-sales", "downloaded_at": "2019-10-03 07:30:33.106362+00:00", "published_at": "2019-10-02", "title": "Ford's phase-out of US cars drags down summer sales", "language": "en", "text": "Ford Motor Company's stock tumbled on Wednesday after the automaker's phase-out of models including the Taurus sedan in the U.S. curbed sales during the last three months of summer.\n\nContinue Reading Below\n\nThe losses may exacerbate worries over the effects of trade friction between the U.S. and China, which economists have warned will curb consumer spending by driving up prices. The decline was countered., however, by exceptional growth in van and pickup sales, on which the automaker is focusing after an overhaul by CEO James Hackett.\n\nTicker Security Last Change Change % F FORD MOTOR COMPANY 8.61 -0.29 -3.26%\n\nTotal vehicle sales fell 4.9 percent to 580,251, compared with the same period in 2018.\n\nPassenger car sales plummeted 29 percent to just over 77,000, and SUV sales dropped 10.5 percent to 193,100. Truck sales rose 8.8 percent to just over 309,000.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nFord vans sales set an all-time record for the July-to-September period, rising 21 percent to 65,288. Transit sales surged 25 percent, while Transit Connect sales surged 49 percent.\n\nMeanwhile, Ford’s total pickup sales increased 5 percent, marking their best third-quarter performance in 14 years, the company said.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nU.S. automakers are facing the likelihood of a weaker market as President Trump's tariffs on billions of dollars in Chinese imports drive up supply costs and the country's economic growth slows.\n\nRetail executives fear that consumers might pull back on spending, which accounts for roughly 70 percent of economic activity.\n\nThe Trump administration delayed most of the tariff increases it planned to impose on Chinese products in August and dropped others altogether, responding to pressure from businesses.\n\nThe Associated Press contributed to this article.", "description": "Ford Motor Company saw their stock fall Wednesday after releasing disappointing third-quarter sales.", "authors": ["Daniella Genovese"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/ford-dealership-iStock.jpg?ve=1&tl=1"}