{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/lvmh-looking-to-buy-tiffany-for-14-billion-2019-10", "downloaded_at": "2019-10-28 09:51:16.336451+00:00", "title": "Tiffany is set to soar nearly 20% after Louis Vuitton made a $14.5 billion bid for the company", "language": "en", "text": "LVMH, the luxury brand that owns Louis Vuitton, Moët and Hennessy, is reportedly making a $14.5 billion offer to buy Tiffany & Co.\n\nTiffany is now set to soar, with the stock rising more than 19% in premarket.\n\nAt $14.5 billion, the offer would value Tiffany at $120 a share, which is about 22% higher than Friday's closing price for the jewellery stock.\n\nAccording to the Financial Times, Tiffany is set to reject the offer, as it considers it undervalued.\n\nView Business Insider's homepage for more stories.\n\nLVMH, the luxury brand that owns Louis Vuitton, Moët and Hennessy, is reportedly making a $14.5 billion deal to buy jeweller, Tiffany & Co, sending its stock soaring in pre-market trading.\n\nThe luxury group first approached Tiffany earlier this month in a bid to expand its access to US luxury shoppers, as reported by Bloomberg Saturday, with Tiffany confirming the talks on Monday.\n\nCiting people familiar with the matter, Bloomberg reported that though there's no guarantee a deal will be reached, the current offer values Tiffany at $120 a share, 22% higher than Friday's closing price.\n\nTiffany's share price was up 19.2% in premarket on the news at 9:00 a.m. in London (5:00 a.m. ET), while LVMH's stock rose 1% on Monday morning,\n\nHowever, according to the Financial Times, Tiffany is set to reject the offer, which is all cash, with the report saying the offer was too low, according to people familiar with the matter.\n\nLVMH and Tiffany have had differing experiences in the last year, both being heavily affected by the Hong Kong protests.\n\nLouis Vuitton, reported its third-quarter earnings earlier this month, boasting better than expected sales despite the disruption, with overall revenue rising 16% in the first nine months of the year.\n\nMeanwhile, Tiffany lost six full days of sales due to the Hong Kong protests, a market which according to CEO Alessandro Bogliolo is \"critically important\" for the business.", "description": "The bid would put Tiffany at $120 a share according to Bloomberg.", "authors": ["Yusuf Khan"], "top_image": "https://image.businessinsider.com/5db6a7a9dee019107b2dd662?width=1200&format=jpeg", "published_at": "2019-10-28"}