{"pub": "marketwatch", "url": "https://marketwatch.com/story/why-the-fire-movement-leaves-me-cold-2019-09-09", "downloaded_at": "2019-09-09 23:20:02.915950+00:00", "title": "Why the FIRE movement leaves me cold", "language": "en", "text": "Although it’s only been a few months since I first heard the term, I’m already tired of all the chatter about the financial independence/retire early (FIRE) movement. This so-called movement is so irrelevant that I don’t know why anybody, including me, writes about it—and yet my curmudgeonly instincts compel me to do so.\n\nDon’t characterize me as a movement hater. To each his own. But consider a recent story in MarketWatch about a couple—he’s age 44, she’s 33, plus they have a small child—who plan to retire next year. My reaction: Simply being frugal for the next 45 years isn’t enough. There’s a lot more you need to think about. For instance, if you’re truly retired, what are you going to do, sit on a beach for eight hours a day?\n\nI’m all for frugality. But then I read about FIRE devotees giving up luxury items and it all seems a bit pompous to me. Let me get this straight: You give up stuff to live on a tiny percentage of what you make—but that tiny percentage turns out to be pretty close to what the average American earns in total.\n\nRead: Early retirement sounds amazing, but it can take a toll on your mental health\n\nThen there’s the family thing. Are you thinking what I’m thinking? Those FIRE folks aren’t couples with three kids to schlep from soccer to dance class. Often, they aren’t funding 529 plans, because there are no children or they’re planning to make the kids take out loans.\n\nRead: How to raise frugal kids as you save for early retirement\n\nI love the simplicity of FIRE thinking: Save 40% to 70% of your income for several years. The goal: Accumulate enough funds so that 4% of your nest egg equals what you spend each year. Bingo, you’re set for life. That 4% rule is supposed to keep 65-year-olds from running out of money during a 25- or 30-year retirement. But is it enough to keep up with the vicissitudes of life from age 40 onward? In addition, aren’t these dropouts effectively giving up much of their Social Security safety net, even if they do collect some modest benefit based on their relatively short earnings history?\n\nHey FIRE folks, have you been listening? There’s talk about a wealth tax, free tuition, baby bonds, free child care and more. We have lots of government debt, that debt is growing rapidly and we still need to fix Social Security. Can you say, “higher taxes”? I’m thinking that might affect your plan to live off your nest egg for 40 or 50 years.\n\nRead: 10 things holding you back from financial independence\n\nIf you’re living on $40,000 in 2019, do you still want to live on the same inflation-adjusted amount when you’re 70? Is the goal to be mega-frugal forever? I don’t get it.\n\nThe FI part of FIRE is just fine. Who can argue against financial independence? Go for it. But dropping out—the RE, or retire early, part—to pursue a dream of leisure, travel and a stress-free life strikes me as childish. But in many cases, it seems retiring doesn’t really mean stopping work. It just means doing something that doesn’t sound like work. Writing a blog, perhaps?\n\nOver half a million Social Security recipients live outside the U.S. Some of the FIRE folks look abroad for the good life, mostly seeking a lower cost of living. If you want to live outside the U.S. because that’s your dream, great. If you must live in a place because your budget dictates it, maybe not so much.\n\nRichard Quinn blogs at QuinnsCommentary.com. Before retiring in 2010, he was a compensation and benefits executive. Follow him on Twitter @QuinnsComments.", "description": "Dropping out to lead a stress-free life seems childish", "authors": ["Richard Quinn"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ933_blizza_ZG_20190909111330.jpg", "published_at": "2019-09-09"}