{"pub": "guardian", "url": "https://theguardian.com/tv-and-radio/2019/sep/10/the-french-fleabag-camille-cottin-interview-mouche-call-my-agent", "downloaded_at": "2019-09-10 23:30:45.570890+00:00", "title": "The French Fleabag: 'Viewers in France are shocked by the sexuality'", "language": "en", "text": "Mouche, or the French Fleabag, is a near replica of Phoebe Waller-Bridge’s hit TV series, with Paris taking the place of London and Camille Cottin in the title role. “We made Mouche for people who hadn’t seen Fleabag,” Cottin explains. “If you’d already seen the original, I’m not sure you would bother watching ours.”\n\nThis is an interview first: getting told not to bother with the show you’re both here to talk about. It’s also exactly the kind of thing French Fleabag would say. What Cottin delivers, though, is by no means a tribute act to Waller-Bridge. To call her elegant would be insufficient. Cottin has a whole munitions depot of self-possession and chicness that gives her performance a more knowing, and also more mournful, edge. At 40, she’s older than Waller-Bridge was, but she doesn’t have more maturity – just less goofiness.\n\nTalking about the role, Cottin instinctively amplifies its desperation over its comedy: “Fleabag is completely emancipated but, at the same time, she’s a slave to her impulses, she’s not free at all. It leads her to destruction. She knows it and she can’t stop. All there is that way is addiction and death.”\n\nFrance is not accustomed to dark comedy. Everybody calls me and says: 'This is really hard to watch'\n\nAnd that’s nothing to how audiences on the other side of the Channel have taken to it. “France is not accustomed to dark comedy. Everybody calls me and says, ‘This is really hard to watch. Now you’ve made me depressed.’ Everybody reacts to the darkness rather than the comedy. And they are shocked by the role in terms of sexuality. They all told me, ‘You have to have bollocks to do this.’ No, bollocks is not correct. ‘You have to have balls to do this.’”\n\nThe actor spent her teenage years in London, hence her easy navigation of the exact right word. But her professional life has been lived almost entirely on the French stage. “It was really a do-it-yourself scene. You’d find a small theatre, 30 seats. They were never filled, but those five or six people really lost themselves.”\n\nShe was well regarded but little enough known that when her breakthrough show, Connasse, came out in 2013, viewers struggled to understand exactly what they were watching: a prank TV show, an edgier Trigger Happy TV. “Connasse means bitch – it’s quite hard. Because it was hidden cameras, people didn’t know at all that I was an actress, that I’d been an actress for 15 years. Everybody, even in the industry, thought I was like that, that I was really a bitch. I thought it was clear it was a character, not even a real character, basically a clown. But when I met people in the industry, they’d say ‘Hello’ in the manner of, ‘Don’t try any of your shit with me.’ And I was so surprised. Because I’m nice.”\n\nFacebook Twitter Pinterest Range … Cottin in Call My Agent (Dix Pour Cent) on Netflix. Photograph: France 2/Netflix\n\nThe timing of her next TV show, Call My Agent, was fortuitous: with the benefit of subtitles and Netflix distribution, Cottin reached an international audience for the first time – unless you count her role in 2016’s second world war film Allied, with Brad Pitt, of which she mourns: “My hair! I was so happy, I was in Hollywood. Then at the last minute, they spent hours making me look like Marge Simpson.”\n\nCall My Agent, about a talent agency, has been a fantastic calling card, illustrating how much greater Cottin’s range was than “clown”. It generated a lot of discussion, partly by being great, and partly because it was, as she says, the first prime-time French drama to feature a lesbian whose “homosexuality was not the subject. The subject is how it is hard for her to commit to a relationship, because what she likes is the act of seduction. The fact that she likes women is completely accepted.”\n\nCottin plays one of four showbiz agents, variously betraying, bolstering, spying on and supporting one another, while dealing with the carousel of egos that is their clientele. The fact that Cottin stands out is extraordinary, firstly because the core cast is magnetic, and secondly because the cameos are gobsmacking – from Isabelle Adjani to Beatrice Dalle and Guy Marchand.\n\nCottin just seems to inhabit the part completely: deal-maker, firer of assistants, sexual predator, trickster. “It’s awkward,” she says. “I’m not like her, but I loved being in her shoes. I learned a lot concerning seduction. She never puts herself as the object of desire, she is always the one who desires. I think it moved me a little bit in terms of relationships. I mean, I’m married, so I’m not out flirting every day. Also, she’s much smarter and stronger and more courageous than I am. But it’s a pleasure to act characters more intelligent than oneself.”\n\nThe day we meet, she has just landed a major Hollywood part – amazing director, incredible co-star. She is so delighted, it intrudes into her every thought. “I don’t wanna be naked in a movie,” she says at one point. “I mean, if I can avoid it. Although that was before I knew who my partner was.”\n\nWe talk about French feminism, or rather French depictions of femininity in culture. I couldn’t imagine Fleabag, with all her disarray and independence, translating into a culture that never embraced the ladette, that never really brooked the hard-drinking, promiscuous, chain-smoking chaos-monkey as part of any feminine ideal. Which leads us to the #MeToo movement – or, as they call it in France, #moncochon (my pig).\n\n“I was, of course, really happy that the silence was broken. But what is interesting in France is that no one was ever named. Is it a Vichy thing? We’re so traumatised by the Nazis, so ashamed of having been collaborators, that we can’t name anyone.” Which, I have to say, is not the perspective I was expecting.\n\nWhile Cottin agrees that TV and film have changed, and that acting careers last longer now that scripts are more interesting, she thinks the main evolution is from within. “When you’re young, you’re always projecting yourself into the eyes of others. It is not important how you look – it’s more important to keep filling yourself with what surrounds you. If you’re not curious about how people are living, if you’re not moved by what they’re living for, you’re dry. And you don’t want to be dry.”\n\n• Call My Agent is on Netflix.", "description": "Camille Cottin, France’s Fleabag and the standout star of showbiz comedy Call My Agent, talks about seduction, ruthless women and the power of chic destructiveness", "authors": ["Zoe Williams"], "top_image": "https://i.guim.co.uk/img/media/9dd1c8b362ad867dba4e34a48c66ec3c3514a2af/0_363_2657_1594/master/2657.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=909b10dfbdc917f13d0184c6f498e410", "published_at": "2019-09-10"}