{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/how-manchester-united-rochdale-cup-penalties-exposed-ole-gunnar-solskjaer-problems-a9120936.html", "downloaded_at": "2019-09-26 15:10:23.815677+00:00", "title": "How Man Utd's Rochdale scare exposed Solskjaer’s biggest problems", "language": "en", "text": "When a pundit is asked to identify what’s gone wrong with a particular team and responds with words to the effect of “not enough goals for me, Gary”, you can rightly feel somewhat short-changed. No team scores enough goals. Everybody would like to score more. It is the simplest, least sophisticated criticism you can level at any group of players and their manager. In some cases, though, it is appropriate.\n\nManchester United have scored more than one goal in just one of their eight games at the start of this new season. That 4-0 victory over Chelsea on the opening weekend was only the third games in which they have scored twice or more since Ole Gunnar Solskjaer’s permanent appointment as manager back in March. Even two generous cup games in quick succession this past week have not produced goals.\n\nLast week, Kazakhstani champions Astana limited a youthful United to just one second-half strike from Mason Greenwood. On Wednesday night, Rochdale managed to do the same. Currently 17th in League One after shipping 14 goals in nine games, Brian Barry-Murphy’s side were far more resolute against a United attack which was often disjointed and happy to speculate from range.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nUnited ultimately needed a penalty shoot-out to beat their neighbours, who cancelled out Greenwood’s goal through 16-year-old Luke Matheson. “We go 1-0 up in many games,” Solskjaer said post-match. “Today again, you go 1-0 up and you think: ‘Come on then, get the second’... At this club you don’t just sit back and hope that is enough. If you settle for good enough, that is not what we want.”\n\nBut in order to score more goals, you need to create better quality chances. That is a problem for United, even if it would be wrong to suggest they failed to create any openings whatsoever against Rochdale. An unmarked Paul Pogba spurned one decent opportunity by heading over the crossbar. Similarly, Marcos Rojo ended one quick counter-attack by nodding wide. On another night, perhaps those opportunities are seized upon.\n\nShape Created with Sketch. Manchester United player ratings vs Rochdale Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Manchester United player ratings vs Rochdale 1/11 Sergio Romero - 5 out of 10 Manchester United Getty Images 2/11 Aaron Wan-Bissaka - 6 out of 10 Manchester United Getty Images 3/11 Axel Tuanzebe - 6 out of 10 Manchester United Getty Images 4/11 Phil Jones - 4 out of 10 Manchester United Getty Images 5/11 Marcos Rojo - 5 out of 10 Manchester United Getty Images 6/11 Fred - 4 out of 10 Manchester United Getty Images 7/11 Paul Pogba - 5 out of 10 Manchester United Getty Images 8/11 Andreas Pereira - 6 out of 10 Manchester United Getty Images 9/11 Jesse Lingard - 5 out of 10 Manchester United Getty Images 10/11 Tahith Chong - 4 out of 10 Manchester United Getty Images 11/11 Mason Greenwood - 7 out of 10 Manchester United Getty Images 1/11 Sergio Romero - 5 out of 10 Manchester United Getty Images 2/11 Aaron Wan-Bissaka - 6 out of 10 Manchester United Getty Images 3/11 Axel Tuanzebe - 6 out of 10 Manchester United Getty Images 4/11 Phil Jones - 4 out of 10 Manchester United Getty Images 5/11 Marcos Rojo - 5 out of 10 Manchester United Getty Images 6/11 Fred - 4 out of 10 Manchester United Getty Images 7/11 Paul Pogba - 5 out of 10 Manchester United Getty Images 8/11 Andreas Pereira - 6 out of 10 Manchester United Getty Images 9/11 Jesse Lingard - 5 out of 10 Manchester United Getty Images 10/11 Tahith Chong - 4 out of 10 Manchester United Getty Images 11/11 Mason Greenwood - 7 out of 10 Manchester United Getty Images\n\nBut few of United’s 31 attempts on goal were of any real quality, which is maybe why only eight of them were on target. The fact that Rojo - who spent much of the night at centre-half - had seven of those 31 shots feels instructive. He attempted as many as centre-forward Greenwood, but the majority were taken from a distance and as a last resort after his team-mates had failed to break through Rochdale’s lines.\n\nThis is nothing new. Look at any game in which United have dropped points since the start of August and identify big, clear-cut opportunities aside from penalty kicks. There are not many and far fewer than the top-six rivals. When able to play on the counter-attack against a young Chelsea side lining up under Frank Lampard for the first time, it suited them. They had ample space to play in. That has not been the case in the majority of their games since.\n\nAltogether, it adds up to a side which still does not appear to know how to overcome an organised defence. The draw with Rochdale was the 22nd game of Solskjaer’s tenure in which United have dominated possession. They have failed to win 13 of those 22 games, losing eight. Of the nine victories, four came last Christmas. There has been only one - last week’s 1-0 against Astana - since Solskjaer took permanent charge.\n\nAs pointed out previously, if you let Solskjaer’s United have the ball, they probably will not beat you. We can now add to this rule: United might score one, but they will seldom score more. Both those things need to change if the Norwegian’s first full season at Old Trafford is to be considered a success. And sometimes, it really is that simple.", "description": "When a pundit is asked to identify what’s gone wrong with a particular team and responds with words to the effect of “not enough goals for me, Gary”, you can rightly feel somewhat short-changed. No team scores enough goals. Everybody would like to score more. It is the simplest, least sophisticated criticism you can level at any group of players and their manager. In some", "authors": ["Mark Critchley"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/26/08/solskjaer-united-rochdale.jpg", "published_at": "2019-09-26"}