{"pub": "metro", "url": "https://metro.co.uk/2019/10/18/boy-6-thrown-tate-modern-viewing-platform-hospital-10941234", "downloaded_at": "2019-10-18 10:38:08.803655+00:00", "title": "Boy, 6, ‘thrown from Tate Modern viewing platform’ is out of hospital", "language": "en", "text": "A boy was thrown from the viewing platform as his mother screamed ‘my son’ and a teenager was held by witnesses\n\nA six-year-old boy seriously injured after allegedly being thrown from the viewing platform of the Tate Modern art gallery has been moved out of intensive care, his family said.\n\nThe French youngster, who cannot be named because of his age, is now in a rehabilitation centre and looks like ‘a little knight’ with splints keeping many of his limbs in place as he recovers from the ordeal.\n\nIn a post on the GoFundMe page, which has raised more than £107,000 for his care, the injured boy’s family said he was making progress but had not yet been able to speak.\n\nThey said: ‘He is now in a rehabilitation centre.\n\n‘He still has some metal in his body but instead of plasters he has got a full armour of splints: legs, feet, hands, arms, neck and torso.\n\nAdvertisement\n\nAdvertisement\n\n‘It is impressive – he looks like a little knight, and we can take these splints off sometimes.\n\nThe boy was treated at the scene after allegedly being thrown from the viewing gallery (Picture: PA)\n\nThe Air Ambluance was called to the scene to take the boy to hospital (Picture: Twitter/AlexFallis)\n\n‘He also makes some little progresses – he moves his right hand more and more and arm on command (he catches us most of the time when we are nearby!) even if he feels sometimes a little bit sad when he doesn’t manage to do what he tries.\n\n‘We really hope he will speak and eat again as soon as possible, but we know that it can take months.\n\n‘Thank you so much all of you again to help us in our fight, our little boy doesn’t give up, and we neither!’\n\nSuspect Jonty Bravery, 18, is accused of attempted murder after allegedly throwing the boy from the 10th floor of the London tourist attraction on August 4.\n\nBravery, from West London, is due to appear in court for a plea hearing next month.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "A six-year-old boy seriously injured after allegedly being thrown from the viewing platform of the Tate Modern art gallery has been moved out of intensive care, his family said. The...", "authors": ["Richard Hartley-Parkinson"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_789070961_1571393724.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-18"}