{"pub": "americanconservative", "url": "https://theamericanconservative.com/urbs/a-stronger-america-needs-strong-towns-first", "downloaded_at": "2019-10-05 13:45:21.421016+00:00", "title": "A Stronger America Needs ‘Strong Towns’ First", "language": "en", "text": "Strong Towns: A Bottom-Up Revolution to Rebuild American Prosperity, Charles Marohn, Wiley, 256 pages\n\nCharles Marohn saw the light on a road in Pequot Lakes, Minnesota. Before him were two paths, a highway through town or a bypass around it—which one shall we build, the city asked? Marohn, a planner and engineer, was startled by what he saw. Every road led to civic suicide, either losing money or surrendering to the state’s control. He began modeling dozens of other streets, including his own—none of them could be built from their own tax base, let alone repaired.\n\nWhat followed for Marohn was “six years in the intellectual wilderness” whereupon the revelation came on the eve of the 2008 financial crisis: “the more our cities build, the poorer they become.” From this insight emerged a grassroots media network and now a book, Strong Towns: A Bottom-Up Revolution to Rebuild American Prosperity. It distills years of writing on how communities of all sizes can draw on the “spooky wisdom” of the past to become solvent and resilient.\n\nMarohn wasn’t always a prophet or a revolutionary. As a municipal engineer in his hometown of Brainerd, Minnesota, he helped lay the roads, pipes, and wires to sustain the booming 1990s. “I built sprawl,” he once confessed. Every new mile was to be paid for by the next mile’s promised growth. Yet somehow their dollars always fell short of their debts.\n\nWhat he began to see was an America living in a post-World War II experiment to pour trillions of dollars into new homes and highways for the middle class. Gone were the small steps of man; this was one giant leap for mankind. We drove this growth machine out from old downtowns to shiny new suburbs, and when they faded we fashioned new rings of neighborhoods. On and on we went, easy money rolling out new towns preserved by regulation in their finished, “perfect” state.\n\nIn one example, in 1949, the city of Lafayette, Louisiana, had five feet of underground pipe per person. By 2015, each resident claimed 50 feet of pipe, a growth of 1,000 percent. The number of fire hydrants per thousand residents grew by 2,140 percent over the same period. Yet median household income grew by just 160 percent from 1949, while personal savings fell and debt ballooned. Today, Lafayette has one dollar of taxable wealth for every two dollars spent in public investment.\n\nThis is why America’s experiment in sprawl has failed, in Marohn’s view. His judgement is not of markets, but math. “New growth provides local governments an opportunity to receive additional cash in the short term in exchange for taking on unpayable, long-term liabilities,” which in turn can only be paid for by yet more outward growth. City leaders are often so desperate to cover their “Municipal Ponzi Scheme” that they throw tax subsidies at “shiny and new” fast-food joints and strip malls whose value per acre is a fraction of what the “old and blighted” blocks boasted. And in the end, it’s the public that pays for private overreach.\n\nSo why haven’t more cities gone belly up? For one thing, state and federal government largesse has long helped paper over local financial shortfalls. And for another, infrastructure is accounted as an asset, not a liability. “With this approach, the more roads a city has, the more pipes in the ground, the more public buildings and pumps in its inventory, the richer that city is. It’s backward.”\n\nAmerica is, in short, becoming Detroit. Our decline will, like all bankruptcies, happen slowly and then all at once, in Marohn’s view. The signs are there, for those with eyes to see. Take any big city in America today and watch as growth becomes a zero-sum equation, with battles over the protected classes of renter and homeowner alike—as the NIMBYs cry “Not In My Backyard!” There is now a “malaise that creeps across society,” Marohn writes, and somewhere Jimmy Carter smiles.\n\nThere is something very American about these fears. Every generation since this country’s founding has worried that we are on an “unsustainable economic path” whose fiscal sins we will pay for, one way or another. The fact that Marohn is writing after the 2008 recession makes these fears all the more salient. This impression of Americana is aided by Marohn’s folksy writing style, sprinkled with homespun wisdom and timeless truths.\n\nAmerica has always been saved by its frontier, and when one closed another opened; first the West, then the industrial city, and now followed by the suburb and the gentrifying urban neighborhood. These American frontiers are closed now, and there is little chance of going back. But Strong Towns still answer to the past. What this democracy of the dead gifts us is a certain small-c conservative vision of society emergent from a complex order, an arrangement that we barely understand and therefore must respect. For the first time in our nation’s history, by this light, the frontier starts at our front porch.\n\n***\n\nIf, dear reader, you are looking for a grand solution or big idea from Charles Marohn, you will be sorely disappointed. The Strong Towns book is bereft of the hard data or models that we moderns delight in. You will not find out, for instance, how many cities are functionally insolvent and by how much. As this is a book built from the bottom-up—over years of observations poured into blog posts—it reads more as a series of insights strung together by an ethos, a belief. To tell towns what to do would be to deny them the bottom-up innovation they will need to minimize risks and maximize their strengths. “Building a prosperous America is a hyper-local undertaking,” and this is the heart of the Strong Towns approach.\n\nNevertheless, Charles Marohn gives readers rules of thumb to govern their towns. The greatest of these is profit: every community must operate in the black, with wealth exceeding liabilities and revenues surpassing expenses. Every dollar of public infrastructure liability must be backed by 20 to 40 dollars of private wealth. And the best way to determine if a new investment will sustain its infrastructure is measuring its projected value per acre. Even better, put infrastructure to the market test; if a public project costing a million dollars can easily recoup that sum (and more) through tolls, value capture, or some other levy on its actual users, all the better.\n\nMarohn further calls for “triage” on infrastructure, starting with fixing up and maintaining the roads, sidewalks, pipes, and wires in high-value-added neighborhoods, which are invariably the older ones closer to the core. “We’re done adding new infrastructure,” he proclaims, though just how politically feasible such a proclamation will be remains an open question. Nevertheless, to the cycles of growth, stagnation, and decline afflicting America’s cities, Marohn would like to add another: renewal.\n\nYet too many neighborhoods are sealed in regulatory amber. Zoning codes do not allow places to naturally, incrementally evolve, let alone renew or reinvent themselves. So Marohn proposes a modest form of the pro-growth faction known as YIMBYism: for the next increment of development in a neighborhood to be allowed “by right, but no more.” That is, a single-family home should be able to add an accessory dwelling unit or convert to a duplex without any special approvals or conditions. Allowing such evolution in our regulatory code should be true for businesses too, whether it’s the brewery struggling to renovate an old warehouse or a food truck seeking to vend in a vacant lot.\n\nSuch reforms will be hard to achieve because the will of local governments to survive is greater than the desire for their own towns to endure. Which is why Marohn concludes with a simple plea for subsidiarity: “Instead of policies, how about talking to your neighbor?” Decisions should be devolved to the “smallest, lowest, or least-centralized level of decision-making” that can competently handle a decision. Of course, such subsidiarity runs against the liberal individualism that entrusts our communities and markets to lawyers and regulators; liberalism demotes our neighbors or family, enriching economic man whilst starving the social animal.\n\nStrong Towns is then, perhaps unwittingly, written for a post-liberal moment questioning the atomism, materialism, short-termism, and civic infantilism that is the corrosive logic of our age. Every ideal of stability and tradition extolled by Marohn is a gift of our pre-modern or unchosen inheritances, as Patrick Deneen’s Why Liberalism Failed has written and Alexis de Tocqueville cautioned before him. Strong Towns also then risks catching the ill afflicting liberalism’s critics; that is, its specific cures are rarely cited or risk being worse than the liberal disease.\n\nWhich is why Charles Marohn concludes that redemption for America’s towns must ultimately well up from some vision of the common good, one that historically has only come from religious roots. As a professed Catholic, Marohn writes that while he would never “seek to structure my city to reinforce Catholic practices,” he sees how “it’s clear that as our religiosity fades, there is no cultural structure providing equivalent meaning and guidance for our lives.” Somehow then, we must still “bind us together as people” in the pursuit not of consumption but of virtue. It is the “burden” of every strong town, Marohn believes, and “it’s also our path to salvation.”\n\nNo prophet is welcomed in his hometown. But if Marohn’s message of financial strength and resilience resonates in this time and place, it is because we feel something is deeply amiss in the American experiment, and that a solution is to be found somewhere at home. Strong Towns is a conservative vision for community that has not been tried and found wanting, but found difficult and left untried. It’s time we tried.\n\nMichael Hendrix is director of state and local policy at the Manhattan Institute. This New Urbanism series is supported by the Richard H. Driehaus Foundation.", "description": "", "authors": ["New Urbs"], "top_image": "https://www.theamericanconservative.com/wp-content/uploads/2019/09/strongtowns.jpg", "published_at": "2019-09-04"}