{"pub": "townhall", "url": "https://townhall.com/tipsheet/alexnitzberg/2019/10/15/trump-campaign-to-fly-message-through-the-skies-ahead-of-tonights-dem-debate-n2554783", "downloaded_at": "2019-10-15 23:04:33.988069+00:00", "title": "Trump Campaign To Fly Message Through The Skies Ahead of Tonight’s Dem Debate", "language": "en", "text": "Twelve presidential primary candidates will vie for the Democrat Party’s nomination during a debate tonight in the Buckeye State. The CNN/New York Times debate at Otterbein University kicks off at 8: pm ET and will last until 11: 00 pm. While the candidates will almost certainly lob attacks against President Trump during the course of the evening, the president’s campaign will launch a message of its own before the event.\n\nAccording to Trump campaign Director of Communications Tim Murtaugh, the president’s campaign will fly a banner through the Ohio skies that reads “Socialism Destroys Ohio Jobs. Vote Trump.” The sign will fly for a total of six hours with a break between the first and second three-hour flights. The banner will also invite readers to “Text ‘USA’ 88022.”\n\nIf you’re near Westerville, Ohio today - site of another calamitous Dem debate - look up!@TeamTrump is flying another aerial banner warning voters of threatened big government socialism.\n\n\n\nFrom noon-3 and from 3:45-6:45, this 35-foot by 105-foot banner will dominate the skies. pic.twitter.com/gWfzXGWfRJ — Tim Murtaugh (@TimMurtaugh) October 15, 2019\n\nThe president’s campaign flew a banner ahead of the Houston Democrat debate last month. It delivered a similar message: “Socialism Will Kill Houston’s Economy! Vote Trump 2020”\n\nTrump campaign flies “Socialism will kill Houston’s economy! Vote Trump 2020” banner over Houston before the debate tonight pic.twitter.com/fGQgaE9Fia — Daily Caller (@DailyCaller) September 12, 2019\n\nTonight’s debate is the fourth installment of the 12 Democratic presidential primary debates.\n\nFormer Vice President Joe Biden and Massachusetts Senator Elizabeth Warren currently place first and second in the RealClearPolitics poll average.", "description": ".10/15/2019 19:02:37PM EST.", "authors": ["Alex Nitzberg", "Beth Baumann", "Matt Vespa", "Julio Rosas"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/283/6a11a7b9-fc41-43a5-a398-31c610458c0d.png", "published_at": "2019-10-15"}