{"pub": "yahoo", "url": "https://sports.yahoo.com/biggest-blown-call-of-season-may-prove-nfl-officials-are-ignoring-new-pass-interference-rule-065812051.html", "downloaded_at": "2019-10-11 08:16:38.554835+00:00", "title": "Biggest blown call of season may prove NFL officials are wrecking new pass interference rule", "language": "en", "text": "After five weeks of essentially ignoring the most controversial rule change of the offseason, NFL officials have given fans the evidence to prove a growing theory: The new pass interference challenge is failing and it’s because officials are refusing to admit a mistake.\n\n\n\nThat’s the only logical explanation coming out of the New England Patriots’ 35-14 win over the New York Giants on Thursday night, when officials missed a clear defensive pass interference call in the fourth quarter and upheld the wrong ruling after Giants coach Pat Shurmur used a coach’s challenge on the blatant mistake.\n\nThe moment unfolded late in the fourth quarter, when Giants wideout Golden Tate first appeared to be held by Patriots cornerback Jonathan Jones. One second later, Jones wrapped his arm around Tate’s chest and right arm well before a pass from Daniel Jones arrived. The interference seemed obvious in real time. In slow motion, it looked nothing less than indefensible.\n\n\n\nThe officials disagreed. The call went to vice president of officiating Al Riveron for review in New York and it stood. And just like that, one mistake showcased one huge mess that is getting under the skin of head coaches.\n\nGiants head coach Pat Shurmur reacts after losing a challenge in the first half against the Patriots. He would be just as upset in the second half after losing a challenge over a non-pass interference call (AP)\n\nScroll to continue with content Ad\n\n[Watch live NFL games on the Yahoo Sports app, download it here.]\n\nIt was the kind of call that left Shurmur giving a resigned explanation: “We see that replay doesn’t overturn much, so I’m not surprised.”\n\nMeanwhile, Tate could only offer, “I’m not the referee and I don’t make the rules.”\n\nStory continues\n\n#NFL officials have gone rogue. 100-percent. This wasn’t called on the field and then wasn’t changed after it was flagged by the #Giants. So they ruled TWICE that this wasn’t defensive pass interference. Which is just blatantly wrong and a purposeful refusal to change the call. pic.twitter.com/BY2rRE6gQc — Charles Robinson (@CharlesRobinson) October 11, 2019\n\nThe way pass interference challenges have been called this season looks like the league’s officials (and Riveron specifically) are thumbing their noses at coaches. To the New Orleans Saints’ Sean Payton, who championed the pass interference challenge in the offseason. To the Dallas Cowboys’ Jason Garrett, who delivered an impassioned speech to help drive it though. And also to guys like the Kansas City Chiefs’ Andy Reid and Patriots’ Bill Belichick, who urged coaches to work hard on getting some kind of rules resolution to the problem of blown calls.\n\n\n\nAfter all that work, after the debacle in the NFC title game that arguably cost the New Orleans Saints a Super Bowl berth, after everything that could have gone wrong with these challenges, it’s the least expected breakdown that’s causing a ruckus: The NFL’s officials aren’t just getting things wrong with pass interference — it looks like they’re upholding the wrong call out of sheer stubbornness after being challenged.\n\nThe NFL’s coaches raised hell in the offseason to get an opportunity to correct mistakes on the field and now they’re being blunted by some of the same officials they were trying to overcome. To the point that in the first month of the season, only seven reversals were made in 31 pass interference challenges. A 22.6 percent reversal rate through four games wouldn’t be so bad — except that in bouts of ridiculously poor judgement, some officiating crews are doing things like what we saw Thursday night between the Patriots and Giants.\n\n\n\nSimply put, they’re ignoring the right call and sending a message to coaches that even obvious penalties aren’t going to be called right. Why? Because it’s a judgement call.\n\n\n\nThat’s the get-out-of-jail-free card for officials in this fiasco: Not only is the initial pass interference call (or non-pass interference) based on an official’s judgment — the replay is, too. That means officials can get something wrong in real time and then get it wrong again via instant replay, merely because they’re given the latitude to do it.\n\n\n\nHow’s that for an effective rule?\n\n\n\nHere’s the truth: It’s not. If anything, it’s a bigger problem than it was when the NFC title game mistake occurred. At least in that debacle, you didn’t know if the official meant to get the call wrong. What happened Thursday was clear. It was the wrong call once. Then it was the wrong call twice. And now the system looks like it’s broken. Or worse, corrupted by humans who can’t accept their own failure.\n\n\n\nIf the NFL thought it had a mess on its hands last January, then it should be hitting a panic button right now. It’s one thing to get something wrong and accidentally change the outcome of history. If something like Thursday night’s mistake repeats itself in a game that matters — or heaven forbid, in the postseason — the league will have given the ultimate unchecked freedom to officials.\n\n\n\nThe ability to acquit themselves of their own mistakes simply because they can.\n\n\n\n\n\nMore from Yahoo Sports:", "description": "The way pass interference challenges have been called this season looks like officials are thumbing their noses at coaches.", "authors": ["Charles Robinson"], "top_image": "https://s.yimg.com/ny/api/res/1.2/bN6KdbaktqADTijUAV5XAA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NDYuOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/WqR8SvRqt54eqaj9qqcS4w--~B/aD0zMTU4O3c9NDc3MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/f9880470-ebf0-11e9-bf5b-795dac675d84", "published_at": "2019-10-11"}