{"pub": "yahoo", "url": "https://finance.yahoo.com/news/analysts-react-pepsicos-q3-beat-200309924.html", "downloaded_at": "2019-10-05 00:01:41.735478+00:00", "title": "Analysts React To PepsiCo's Q3 Beat", "language": "en", "text": "PepsiCo, Inc. (NASDAQ: PEP) shares moved higher after reporting a third-quarter earnings and sales beat on Thursday morning.\n\nCredit Suisse analyst Kaumil Gajrawala said better top-line growth is allowing PepsiCo to accelerate and pull-forward near-term spending.\n\nDespite two home-run innovations from Gatorade Zero and Bubly, the analyst thinks growth is coming entirely from pricing and volumes have been flat for four quarters.\n\n“The firm is going into a period of difficult comps, lapping price increases and successful innovations. It remains to be seen if lower pricing is met with improving volumes,” he wrote in a note.\n\nThe analyst raised 2020 EPS on positive trends but remains below consensus and says despite improving trends, he raised the price target from $117 to $126 but maintains an Underperform rating.\n\nView more earnings on PEP\n\nSee Also: Why Macquarie Prefers Pepsi Over Coca-Cola\n\nBank of America analyst Bryan Spillane has a more bullish stance, maintaining a Buy rating with a $142 price target.\n\nSpillane says although organic sales growth was tilted towards pricing, he expects a healthier mix between volume and price growth.\n\n“PepsiCo’s outlook for FY19 remains unchanged, although the company expressed in the press release and on the earnings call that they expect to meet or exceed its full-year organic revenue growth target of 4%,\" Spillane wrote in a note\n\nSpillane believes the company didn't revise guidance upwards as any upside will be reinvested back into the business.\n\nPepsiCo's stock closed Friday's session higher by 1.7% at $140.28 per share.\n\nLatest Ratings for PEP\n\nDate Firm Action From To Oct 2019 Maintains Overweight Oct 2019 Maintains Market Perform Oct 2019 Maintains Underperform\n\nView More Analyst Ratings for PEP\n\nView the Latest Analyst Ratings\n\nSee more from Benzinga\n\n© 2019 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "description": "PepsiCo, Inc. (NASDAQ: PEP ) shares moved higher after reporting a third-quarter earnings and sales beat on Thursday morning. Credit Suisse analyst Kaumil Gajrawala said better top-line growth is allowing ...", "authors": ["Brett Hershman"], "top_image": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "published_at": "2019-10-04"}