{"pub": "arirang", "url": "https://arirang.com/News/News_View.asp?nseq=246280", "downloaded_at": "2019-10-25 16:07:07.833809+00:00", "title": "News View :: The World On Arirang", "language": "en", "text": "The second round of defense cost-sharing talks between South Korea and the United States wrapped up on Friday in Hawaii.The two sides met for the second time since last month's talks in Seoul to negotiate a new Special Measures Agreement on cost-sharing for some 30,000 U.S. troops stationed in South Korea.Details of the talks are not disclosed, but it's expected that it won't be easy for the two sides to reach a compromise as Washington has been pressuring Seoul for a sharp increase in contributions. The two sides are to meet again in South Korea next month for another round of talks.As well as pushing for South Korea to contribute more, the U.S. has been pressuring its NATO allies to up their defense spending.The U.S. Defense Secretary Mark Esper brought up the issue when speaking to reporters in Saudi Arabia on Tuesday on his way to Brussels for a meeting with NATO defense ministers.\"We expect of all of our partners and allies, whether it's Asia or Europe, is to help share the cost, to share the burden of either housing, hosting our troops on or on their land or supporting them in deployments where the case may be.\"When he arrived in Brussels, Esper said there can be no free riders to their shared security. He added that all must do their part to deter war and defend the alliance regardless of geographic location, size, or population.The U.S. had taken the burden of paying for 70 percent of the NATO defense expenditure because European countries have felt burdened by defense spending and have been reluctant to increase their defense spending since the end of the Cold War.And the pressure from the U.S. for those countries to increase their share of defense costs is getting stronger.U.S. Secretary of State Mike Pompeo said in an interview with a Kansas newspaper on Thursday local time that other countries must share the burden for not just the security of the world, but for the security of their own countries.Lee Min-sun Arirang News.", "description": "한국을 대표하는 글로벌 방송! The World On Arirang!", "authors": ["The Korea International Broadcasting Foundation"], "top_image": "http://www.arirang.com/arirang_blue.png", "published_at": "2019-10-25"}