{"pub": "thehill", "url": "https://thehill.com/homenews/campaign/464928-sanders-says-hell-slow-down-on-campaign-trail-after-heart-attack", "downloaded_at": "2019-10-09 00:52:35.907322+00:00", "title": "Sanders says he'll slow down pace on campaign trail after heart attack", "language": "en", "text": "Sen. Bernie Sanders Bernie SandersLobbyists pan Sanders proposal to end corporate donations for party conventions Klobuchar pulls in nearly million in third quarter, campaign says Democratic candidates' polling and fundraising numbers don't quite match up MORE (I-Vt.) said Tuesday that he plans to slow down his pace on the presidential campaign trail after suffering a heart attack last week.\n\nSanders spoke to reporters outside his home in Burlington, Vt., after going to see his cardiologist, saying he plans to do fewer events in the near future.\n\n\"I certainly intend to be actively campaigning,\" he said. \"I think we can change the nature of the campaign a bit, make sure that I have the strength to do what I have to do.\"\n\nJUST IN: After returning from his visit to the cardiologist @BernieSanders tells us he is prepared to change the \"nature\" of his campaign. He said he plans to scale back his travel and the number of events he participates in. pic.twitter.com/IqUzM9stRN — Ryan Nobles (@ryanobles) October 8, 2019\n\nThe Democratic presidential candidate said he had been doing \"in some cases five or six meetings a day, three or four rallies and town meetings and meeting with groups of people.\"\n\n\"I don't think I'm going to do that,\" he said.\n\nWhen asked what would change about the \"nature\" of his campaign, Sanders replied, \"Probably not doing four rallies a day.\"\n\nSanders suffered a heart attack last week in Las Vegas, prompting his campaign to cancel his events until further notice.", "description": "Sen. Bernie Sanders (I-Vt.) said Tuesday that he plans to slow down his pace on the presidential campaign trail after suffering a heart attack last week.", "authors": [], "top_image": "https://thehill.com/sites/default/files/sandersbernie092919getty.jpg", "published_at": "2019-10-08"}