{"pub": "abcnews", "url": "https://abcnews.go.com/US/14-year-killed-playing-basketball-queens-york/story?id=66607554", "downloaded_at": "2019-10-29 23:56:36.652693+00:00", "title": "14-year-old killed while playing basketball", "language": "en", "text": "New York City police are investigating two instances of teens shot by stray bullets in the same Queens neighborhood over the weekend.\n\nA 14-year-old boy died after he was struck in the neck while playing basketball near the Baisley Houses in the Jamaica neighborhood on Saturday night, ABC New York station WABC reported.\n\nAamir Griffin, a freshman at Cardozo High School, had just scored the winning 3-pointer for his team days before his death, according to the station. Known as \"Buddy\" in his circle of friends, he was already being scouted by college recruits and dreamed of playing in the NBA.\n\nHe was not the intended target of the shooting, police said.\n\nWABC\n\nEarlier in the day, a 16-year-old girl was shot in the shoulder in front of the New Dawn Charter High School nearby, WABC reported.\n\nThe intended target in that shooting was a student of the school who was at a basketball court after a large fight broke out, police said. The girl suffered non-life threatening injuries.\n\nPolice are investigating whether the shootings are related and searching for two suspects seen on surveillance video running away from the scene after Griffin was shot.\n\nGriffin's coach, Ron Naclerio, described him to WABC as having a passion for basketball that would have eventually landed him on the varsity team. A friend, who was not named, described him as a \"great kid\" with positive energy.\n\nWABC\n\nSome of his classmates were not in school on Monday to attend his funeral.\n\n\"These kids are probably missing school later today for a really wrong reason, to bury a teammate,\" Naclerio said.\n\nNeighbors expressed concern that the kids who live nearby \"can't even play in the playground anymore.\"\n\n\"What happened to him was senseless,\" Lisa Lewis said regarding Griffin's death.\n\nJoan Rickets, who lived a block away from his family, told WABC, \"Something needs to be done. It has to stop. The guns gotta come out of the streets and out of these kids' hands.\"", "description": "New York City police are investigating two instances of teens shot by stray bullets in the same Queens neighborhood over the weekend.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/teen-shot-queens-abc-aa-191029_hpMain_16x9_992.jpg", "published_at": "2019-10-29"}