{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/emmerdales-cain-murders-injured-son-20717252", "downloaded_at": "2019-10-25 00:44:41.073363+00:00", "title": "Emmerdale's Cain 'murders' injured son Nate in hospital bed in terrifying twist", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nCain Dingle look set to murder his own son at the end of tonight's dramatic first visit to Emmerdale.\n\nThe fallout from Nate Robinson revealing Cain is his father was almost as explosive as that fireball that ripped apart the boat.\n\nStill hellbent on getting revenge, Cain decided to pay a visit to his newly discovered son in hospital.\n\nBeckoning Cain over to his bedside, injured Nate sarcastically said: \"Daddy's here. My hero.\"\n\nFurious Cain told Nate that he should have let him drown, then in a terrifying twist seemingly decided to smother him with a pillow.\n\n(Image: ITV)\n\n(Image: ITV)\n\nGoading his dad over killing him, Nate said: \"You couldn’t do it. Not man enough. That's why I was sleeping with your wife.\"\n\nFed up with hearing how his own son had slept with his wife, Moira Barton, Cain completely lost his rag.\n\n\"You really don’t know how to shut your mouth,\" warned fuming Cain. \"So let me do it for you...for good.\"\n\n(Image: ITV)\n\n(Image: ITV)\n\nCain calmly shut door, then grabbed hold of a large pillow, which he looked at menanincly.\n\nThe episode ended on a dramatic cliffhanger as Cain shut the blinds to make sure nobody could see them.\n\nIs Cain about to murder his own son in a hospital bed?\n\n(Image: ITV)\n\n(Image: ITV)\n\nThe mystery of the identity of Nate's mother was not revealed - but there were some more hints as to who she may be.\n\nFaith Dingle made a panicked call to Zak Dingle - leaving a voicemail revealing there was something she had to tell him.\n\nBack in the hospital, the nurse told Nate that he had a nasty chest infection but the outcome could have been a lot worse.\n\nWhen she asked if he had any family to call, smiling Nate replied: \"No. All alone.\"\n\n(Image: ITV)\n\n(Image: ITV)\n\nThis came after Moira and Nate's affair was finally exposed - with Matty Barton left sickened by his mother's actions.\n\nHe said: \"It's disgusting. Apart from anything else you’re old enough to be his mum.\"\n\nMoira then pointed out the irony of that comment as she revealed Cain was Nate's biological father.\n\n(Image: ITV)\n\n(Image: ITV)\n\nFurious Matty headed to Cain's hospital room to ask his 'friend' why he had been sleeping with his mum.\n\nClaiming it wasn't personal, Nate said: \"He's scum. You should have seen his face when I told him I'm his son.\n\nMatty was quick to point out that Kyle and Isaac are his half-brothers and he was ruining their lives as well.\n\n*Emmerdale airs weekdays on ITV at 7pm with an extra episode on Thursdays at 8pm", "description": "Cain Dingle grabbed hold of a pillow and shut the blinds as he told Nate Robinson he would \"shut his mouth\" in a dramatic cliffhanger", "authors": ["Kyle O'Sullivan", "Image", "Itv"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20717927.ece/ALTERNATES/s1200/0_Emmerdale.jpg", "published_at": "2019-10-24"}