{"pub": "thehill", "url": "https://thehill.com/policy/international/465002-nba-fan-event-cancelled-in-china-amid-uproar-over-hong-kong-tweet", "downloaded_at": "2019-10-09 18:43:30.846507+00:00", "title": "NBA fan event canceled in China amid uproar over Hong Kong tweet", "language": "en", "text": "A Chinese sports federation has canceled a fan event ahead of an NBA exhibition game, blaming comments made by league commissioner Adam Silver and Houston Rockets general manager Daryl Morey.\n\nThe Shanghai Sports Federation said in a statement obtained by Reuters that the event was canceled in response to an \"inappropriate attitude\" exhibited by Silver in response to a now-deleted tweet sent by Morey expressing support for protesters in Hong Kong.\n\nADVERTISEMENT\n\nThe issue threatens to divide the NBA between support for free speech and attempts to appease angry U.S. lawmakers and the Chinese government, which has slammed the NBA in official state-run newspapers for supposedly supporting \"secessionist\" protesters.\n\n“If Silver thinks endorsing the indiscriminate violence the radical Hong Kong protesters are resorting to in their bid to 'liberate' the city, a secessionist pipe dream they are peddling to justify their summer hooliganism, is supporting freedom of expression then he should think again,” read an editorial in China Daily published Wednesday.\n\nSilver attempted to diffuse the controversy in a statement on Tuesday, explaining that it was not the NBA's job to adjudicate political differences.\n\n\"It is inevitable that people around the world — including from America and China — will have different viewpoints over different issues. It is not the role of the NBA to adjudicate those differences,\" Silver said.\n\n\"However, the NBA will not put itself in a position of regulating what players, employees and team owners say or will not say on these issues. We simply could not operate that way,\" he added.\n\nThe league has faced bipartisan criticism in Washington over the issue, with lawmakers demanding the NBA stand up for free expression following an initial statement from Silver in which he apologized for upsetting Chinese fans.", "description": "A Chinese sports federation has canceled a fan event ahead of an NBA exhibition game, blaming comments made by league commissioner Adam Silver and Houston Rockets general manager Daryl Morey.", "authors": [], "top_image": "https://thehill.com/sites/default/files/chinanba1_100919getty.jpg", "published_at": "2019-10-09"}