{"pub": "reuters", "url": "https://reuters.com/article/us-westpac-divestment-insurance/australias-westpac-considers-sale-of-life-insurance-unit-sources-idUSKBN1WF0FV", "downloaded_at": "2019-09-30 06:36:49.571016+00:00", "title": "Australia's Westpac considers sale of life insurance unit-sources", "language": "en", "text": "SYDNEY (Reuters) - Westpac Banking Corp (WBC.AX), Australia’s second-largest bank, is considering selling its life insurance business, two sources told Reuters, in what could be the last of the Big Four lenders to exit the industry.\n\nFILE PHOTO: A pedestrian looks at his phone as he walks past a logo for Australia's Westpac Banking Corp located outside a branch in central Sydney, Australia, November 5, 2018. REUTERS/David Gray\n\nWestpac has not made a final decision to divest the unit, but it has received some interest and discussions are at a preliminary stage, one of the sources said.\n\nThe sources declined to be identified because the plans are private. A Westpac spokesman declined to comment.\n\nA deal would likely involve a long-term partnership with the buyer, rather than a clean asset sale, that could value the unit at close to A$2 billion ($1.35 billion), the first source said.\n\nThe Australian newspaper reported earlier this month that insurer American International Group Inc (AIG.N) was interested in the business and had held talks with Westpac, putting the potential value of a deal at A$1.5 billion to A$2 billion.\n\nRepresentatives of AIG did not immediately return requests for comment.\n\nThe other three major Australian banks - Commonwealth Bank of Australia (CBA.AX), National Australia Bank Ltd (NAB.AX) and Australia and New Zealand Banking Group (ANZ.AX) - have all sold most of their life insurance units in a back-to-basics trend towards core mortgage lending.\n\nWestpac had A$6.9 billion in life insurance liabilities as of June, and yearly revenue of A$988 million, according to Australian Prudential Regulation Authority (APRA) statistics.\n\nIn late December 2017, Zurich Insurance agreed to buy ANZ’s life insurance arm for A$2.85 billion, a deal that was followed by Hong Kong-based AIA Group’s purchase of CBA’s life insurance unit in 2018.\n\nNAB had earlier sold 80% of its life insurance arm to Japan’s Nippon Life for A$2.4 billion.", "description": "Westpac Banking Corp , Australia's second-largest bank, is considering selling its life insurance business, two sources told Reuters, in what could be the last of the Big Four lenders to exit the industry.", "authors": ["Paulina Duran", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190930&t=2&i=1435412833&w=1200&r=LYNXMPEF8T09Q", "published_at": "2019-09-30"}