{"pub": "yahoo", "url": "https://news.yahoo.com/stephan-balliet-loser-neo-nazi-113639388.html", "downloaded_at": "2019-10-11 05:15:18.130251+00:00", "title": "Stephan Balliet: The 'loser' neo-Nazi suspected of deadly attack on German synagogue", "language": "en", "text": "The neo-Nazi who murdered two people in a marauding shooting attack in Germany has been named as Stephan Balliet.\n\nThe 27-year-old German man is suspected of storming a synagogue in Halle on Wednesday and shooting a female passerby, before attacking a nearby Turkish kebab shop where a man died.\n\nBalliet broadcast a live video of the attack on the Twitch streaming platform and published an antisemitic and racist “manifesto” online, echoing the Christchurch terrorist and other recent far-right attackers.\n\nHe repeatedly called himself a “loser” in the footage for failing to break into the synagogue or kill more people, after his homemade gun repeatedly jammed.\n\nThe livestream stopped after Balliet dumped the helmet-mounted camera and his car while fleeing Halle, before hijacking a taxi and being arrested following a crash around 10 miles south of the city.\n\nGermany’s federal public prosecutor said it had applied for a court warrant to arrest Balliet, who it named as Stephan B under privacy laws.\n\nA statement said he was a German citizen and that the justice minister and attorney general would give further details at a press conference on Thursday afternoon.\n\nLocal media reported that Balliet is from the Saxony-Anhalt region of Germany, and a document posted online said he had driven 45 minutes to the synagogue from his home.\n\nDer Spiegel reported that he had no criminal record and lived with his mother in Benndorf, where neighbours described him as a lonely figure who lived an “isolated life”.\n\nBalliet’s livestream and online documents seen by The Independent suggest he was deeply embedded in online forums, gaming culture and had a fascination with Japan.\n\nHe called himself a “weeb”, denoting an obsession with Japanese culture, and an “anon” – the term used to describe users of 4chan, 8chan and other imageboards that were used by previous mass shooters to share manifestos.\n\nOne of three documents Balliet posted online before the attack was entitled “manifesto” in Japanese and included an image of a sexualised anime “cat-girl”.\n\nThe tongue-in-cheek message said that readers could get a free cat-girl or “waifu” if they “kill at least one Jew”.\n\nThe document, written in English, called for “discontent white men” to murder Jews, non-whites, communists and “traitors”.\n\nAnother document linked to Balliet’s livestream on Twitch, which is predominantly used by gamers to broadcast online play.\n\nStephan Balliet, 27, has been arrested on suspicion of carrying out the Halle attack on 9 October 2019 More\n\nThe third, also written in English, contained details of Balliet’s preparations for the attack and included images of his six guns, which he claimed to have made or modified himself.\n\nBalliet also listed homemade ammunition and improvised hand grenades, smoke grenades, pipe bombs and small explosives, which he said he had “prepared months in advance”.\n\nThe document said he aimed to inspire other attacks by “other suppressed whites” by livestreaming his attack, kill as many “anti-whites” as possible, and that he would wear protective clothing and aimed not to die.\n\nIt included a score sheet of “achievements” for the attack, including numbers of kills and methods, but few were met.\n\nThe documents appear to have been originally posed on the Kohlchan website, which is a predominantly German-language “chan” imageboard whose name translates as “cabbage chan” or “nonsense chan”.", "description": "The neo-Nazi who murdered two people in a marauding shooting attack in Germany has been named as Stephan Balliet.The 27-year-old German man is suspected of storming a synagogue in Halle on Wednesday and shooting a female passerby, before attacking a nearby Turkish kebab shop where a man died.", "authors": ["Lizzie Dearden"], "top_image": "https://s.yimg.com/uu/api/res/1.2/gUO3IKQY1_J6KmH6ZmBguA--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/093431bab4917aa7b48ea7da9d2a4aa3", "published_at": "2019-10-10"}