{"pub": "yahoo", "url": "https://finance.yahoo.com/news/latest-lender-hit-india-shadow-200011662.html", "downloaded_at": "2019-10-07 09:11:59.646855+00:00", "title": "Latest Lender Hit by India Shadow Bank Stress Says Worst Is Over", "language": "en", "text": "(Bloomberg) -- IndusInd Bank Ltd., which saw a fifth of its market value wiped out over the past week on concern about its creditors, says the crisis of confidence engulfing India’s financial system is fading away.\n\nOutstanding loans to overstretched borrowers dipped at the Mumbai-based bank last quarter, lenders including IndusInd are working to resolve defaults at Dewan Housing Finance Ltd., and Indian authorities are taking steps to contain future delinquencies at shadow banks, IndusInd’s Chief Executive Officer Romesh Sobti said in an interview in Mumbai on Friday.\n\nREAD: $63 Billion of Zombie Buildings Sound Alarm For Indian banks\n\n“All we need now to turn the tide of caution completely is a resolution of a large delinquent account,” Sobti said. “Banks are already beginning to look more positively at lending to non-bank financiers and the real estate segment as the worst is behind us.”\n\nIndusInd joins Axis Bank Ltd. and Edelweiss Financial Services Ltd. in predicting that the Indian financial sector’s woes will ease soon. Most banks have been beaten down for more than a year since the collapse of Infrastructure Leasing & Financial Services Ltd. and defaults by other shadow lenders including Dewan and Altico Capital India Ltd.\n\nShares of IndusInd have fallen more than 20% over the past week amid speculation that it was owed money by Indiabulls. As of Sept. 29, gross exposure to the housing finance company concerned, its units and associate finance companies stands at about 0.35% of the loan book and is backed by adequate collateral, IndusInd said in a Sept. 30 filing without naming any firm.\n\nConcerns over exposure to the troubled companies have also dragged another lender Yes Bank Ltd. shares by 81% in the past year, prompting the bank to lodge a complaint with the police on the dissemination of fake news and rumors about its financial health on social media platforms.\n\nIndusInd’s gross bad loan ratio stands at about 2.2% as of June end, compared with more than 9% for the nation’s banking system. Its return on assets rose to 2.1% in June from 1.9% in the year-ago period, filings show.\n\nIL&FS group is seeking to resolve most of its debt obligations by March, chief operating officer of the company said this month. Meanwhile, Dewan, the largest mortgage lender to default so far, has prepared a plan to resolve stress on its books. IndusInd, which has exposures to Dewan, IL&FS and Indiabulls, has seen repayments from some embattled borrowers in the September quarter, Sobti said, without providing further details.\n\n“The elephant has passed through, though the tail is still wagging,” Sobti said. “As far as most of the big risks to the system are concerned, whether from non-bank financing companies or real estate, we have turned the corner.”\n\n(Updates with shares in fifth paragraph.)\n\n--With assistance from Divya Patil.\n\nTo contact the reporters on this story: Suvashree Ghosh in Mumbai at sghosh186@bloomberg.net;Anto Antony in Mumbai at aantony1@bloomberg.net\n\nTo contact the editors responsible for this story: Marcus Wright at mwright115@bloomberg.net, Jeanette Rodrigues, Arijit Ghosh\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- IndusInd Bank Ltd., which saw a fifth of its market value wiped out over the past week on concern about its creditors, says the crisis of confidence engulfing India’s financial system is fading away.Outstanding loans to overstretched borrowers dipped at the Mumbai-based bank last quarter", "authors": ["Suvashree Ghosh", "Anto Antony"], "top_image": "https://s.yimg.com/uu/api/res/1.2/2CTB610u4RU9zgqpZ9L8YA--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/8b002ea63a398417388e6c4f46551693", "published_at": "2019-10-07"}