{"pub": "businessinsider", "url": "https://businessinsider.com/early-retirement-downsides-challenges-losing-money-community-identity-2019-9", "downloaded_at": "2019-09-22 15:16:37.443863+00:00", "title": "Two world travelers who retired at 31 as millionaires say there's a 'dark side' to early retirement. Here's how they tackled the 3 biggest downsides.", "language": "en", "text": "Getting through a day of work can be challenging. But it can also be challenging not having to work.\n\nTake it from Kristy Shen and Bryce Leung of Millennial Revolution. The two former computer engineers quit their jobs at 31 as millionaires to travel the world. In their book, \" Quit Like a Millionaire,\" they said they needed to first overcome the three most common fears surrounding early retirement: running out of money, loss of community, and loss of identity.\n\n\"Fear is necessary for survival,\" they wrote. \"But the point of life isn't to hide under your bed and never take any risks. The point of life is taking the leap but bringing a parachute — just in case.\"\n\nHere's how they tackled the \"dark side\" of early retirement.\n\nTo avoid running out of money, they were strategic about their savings\n\nThe easiest way to run out of money during early retirement is to deplete your investment portfolio during the first five years by selling stock into a down market, according to Shen and Leung. To deal with this, they suggest using a cash cushion — a reserve fund of savings you can draw from to avoid a full portfolio withdrawal during the down years.\n\nThey also suggest having a yield shield, which is a combination of dividends and interest from exchange-traded funds (ETFs) — a collection of investments such as stocks and bonds — that can be delivered as cash without selling any assets.\n\nRead more: 8 people who retired before age 45 reveal how the decision changed their money habits\n\nUnexpected health care costs and inflation could also factor into running out of money, they said. But traveling has helped them sidestep inflation, since it's a per-country effect. They also purchased expat insurance, which is less expensive than domestic insurance plans if you're an American retiring abroad.\n\n\"Our experience, after being retired for three years and having gone through a market crash in year one, has taught us that the fear of running out of money is overblown,\" they wrote. \"Not only has our net worth grown by $300,000, our expenses continue to drop. We're safer and richer than when we left.\"\n\nThey made friends at conferences and meet-ups\n\nEarly retiree Tony went back to work a year and a half after retiring early, partly because he missed social interaction. In a podcast with fellow early retiree Brandon of The Mad Fientist, he said that aspiring early retirees need to prepare for how they'll build human connection once they leave work.\n\nShen and Leung put it simply: When you're working, colleagues are your social circle. And others may not understand your decision to retire, they said.\n\n\"The confident ones will be happy for you,\" they wrote. \"The unhappy ones will blame you for invalidating their own path.\"\n\n\"The longer you're retired, the more confident you become,\" they continued. \"And if you lose friends by choosing a different path, those friendships weren't worth keeping in the first place.\"\n\nBut you also gain a new community by joining the FIRE movement. It opens up opportunities to meet new people — something Shen and Leung said they barely had time to do when working. Since retiring early, they've made genuine friendships with people all over the world from FIRE-related conferences and meet-ups.\n\nJohn from ESI Money also suggests joining a club or gym and volunteering to meet people and connect socially.\n\nRead more: What 8 people wish they knew before retiring in their 20s and 30s\n\nEarly retirement allowed them to build a better identity\n\n\"For some people what they do is who they are,\" John wrote. \"Then when the job is over, they don't know who they are any more.\"\n\nHe said that to get through early retirement, people need to find new activities to replace the time and meaning they got from work. Those could be recreational (hobbies, traveling, etc.), volunteering (church, non-profits, etc.), or occupational (a part-time job to help them feel productive again), he said.\n\nAs Shen and Leung put it: \"Lose one identity, build a better one.\"\n\nBeing financially independent, they said, doesn't have to be about quitting your job and traveling the world — it's about choices.\n\n\"Becoming financially independent is about designing the life you want,\" they wrote. \"Once you've built a portfolio large enough that 4% of it covers your expenses each year, work is an option, not a mandate. If you want to fully retire like us and travel the world, do that. If you like your job, continue working with a more flexible schedule.\"\n\nThey advise getting rich and then following your passion so you don't have to worry about when or where your next payout is coming from. If your passions lead to failure, it will only hurt emotionally, not financially — if, that is, you have a portfolio to rely on that pays your expenses, they said.\n\nThey added: \"There will always be worries when you go against the norm. But just like the perceived danger during a turbulent plane ride, they're mostly in your head.\"", "description": "People have three common fears about retiring early, according to two early retirees: running out of money, loss of community, and loss of identity.", "authors": ["Hillary Hoffower"], "top_image": "https://amp.businessinsider.com/images/5d7523fd2e22af4f7b1f94a2-1136-568.jpg", "published_at": "2019-09-22"}