{"pub": "yahoo", "url": "https://news.yahoo.com/1-climate-change-protesters-disrupt-064747579.html", "downloaded_at": "2019-10-17 09:17:27.078152+00:00", "title": "UPDATE 3-Climate-change protesters disrupt London rush hour sparking ire of commuters", "language": "en", "text": "* Extinction Rebellion targets public transport on Thursday\n\n* Angry commuters pull protester off Underground train\n\n* London mayor condemns London Underground, DLR protests (Recasts headline and lead)\n\nBy Matthew Green and Paul Sandle\n\nLONDON, Oct 17 (Reuters) - Climate change activists disrupted rail services in London on Thursday, sparking a physical confrontation between angry commuters and a protester who had climbed onto the roof of a London Underground train during the rush hour.\n\nExtinction Rebellion is in the second week of civil disobedience that has targeted government buildings, a local airport and financial institutions such as BlackRock to highlight the threat posed by climate change.\n\nThe London mayor, police and commuters scolded the group for its tactics, arguing that public transport was one of the greenest methods of travel.\n\n\"Arrests have already been made and officers are working to quickly resume services,\" the police said in a statement.\n\nRising to prominence in April when it sparked travel chaos in London for 11 days, Extinction Rebellion wants to promote a rebellion against the political, economic and social structure of the modern world to avert the worst case scenarios outlined by scientists studying the climate.\n\nCritics say the group is proposing what amounts to the overthrow of capitalism without any clear idea of what would follow, and that the world needs fossil fuels to satisfy current energy consumption.\n\nBritish Transport Police said they had responded to incidents on the rail network at Shadwell, Stratford and Canning Town, near to London's Canary Wharf financial district.\n\nFootage showed protesters unfurling an Extinction Rebellion protest group banner on top of a stationary London Underground train at Canning Town before one was pelted with food and physically dragged off by angry commuters.\n\nExtinction Rebellion launched a wave of civil disobedience on Oct. 7 to highlight the accelerating loss of plant and animal species.\n\nLondon Mayor Sadiq Khan said he \"strongly condemned\" protests targeting the London Underground and Docklands Light Railway (DLR).\n\n\"This illegal action is extremely dangerous, counterproductive and is causing unacceptable disruption to Londoners who use public transport to get to work,\" he said.\n\n\"It is also an unfair burden on our already overstretched police officers.\"\n\nPolice said four arrests had been made at Stratford and Canning Town stations, while specialist teams were working to remove four other protesters at Shadwell DLR station.\n\nIn a bid to stop the disruption, police in London ordered a halt to all of the group's protests on Monday.\n\nThey said on Wednesday that 1,642 had been arrested following action targeting the Treasury building, companies such as Google, financial institutions also including Barclays and asset manager BlackRock, and city airport. (Reporting by Andrew MacAskill and Paul Sandle; editing by Kate Holton, Shri Navaratnam and Guy Faulconbridge)", "description": "Climate change activists disrupted rail services in London on Thursday, sparking a physical confrontation between angry commuters and a protester who had climbed onto the roof of a London Underground train during the rush hour.  Extinction Rebellion is in the second week of civil disobedience that has", "authors": ["Matthew Green", "Paul Sandle"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-17"}