{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7555681/Ferrari-driver-WRECKS-200K-sports-car-spins-control-smashes-concrete-barrier.html", "downloaded_at": "2019-10-10 00:12:54.845264+00:00", "title": "Ferrari driver WRECKS £200K sports car as he spins out of control and smashes into concrete barrier", "language": "en", "text": "A Ferrari driver was caught on camera wrecking his £200,000 super car when he spun out of control and smashed into a concrete barrier.\n\nThe footage was captured near a junction in PalaFlorio in the district of Japigia, Italy, as rain is pouring down.\n\nIn the video that has recently re-emerged online, the red Ferrari F458 Spider can be seen up ahead as the driver indicates left to join a motorway.\n\nThe sports car slows down and forces the driver in the vehicle behind to overtake it to get on to the carriageway.\n\nThe passenger in that car, who is recording the events, tries to turn around to carry on recording the super car as they pass.\n\nThe Ferrari driver can be heard stepping on the gas as he accelerates toward their boot before pulling out to overtake them.\n\nBut as he attempts to complete the manoeuvre he veers out of control and swings back toward the car he is trying to overtake.\n\nA Ferrari driver was caught on camera wrecking his £200,000 supercar at a junction in PalaFlorio in the district of Japigia, Italy\n\nThe Ferrari driver can be heard stepping on the gas as he accelerates toward the boot of the car in front before pulling out to overtake it. But as he attempts to complete the manoeuvre he veers out of control\n\nHe narrowly avoids smashing into the back of them as he continues to skid across the track.\n\nThe driver of the car that is continuing to record lets out expressions of disbelief as the Ferrari smashes into the guardrail at the side of the motorway.\n\nThe car then spins around twice as debris is flung across the major road.\n\nOncoming traffic is forced to slow down to delicately weave its way through the remains of the wrecked car.\n\nThose recording slow down and pull up on the side of the road, still in shock.\n\nThe Ferrari smashes into the guardrail at the side of the motorway and then spins around twice as debris is flung across the major road\n\nIn the distance, the driver can faintly be seen opening his car door and getting out. It is thought he had been travelling with a passenger but both were unharmed\n\nIn the distance, the driver can faintly be seen opening his car door and stepping out.\n\nIt is thought he had been travelling with a passenger but both were unharmed.\n\nThe car that had witnessed it all then begins to reverse, presumably to help the driver, which is where the video ends.\n\nThe driver of the car who recorded the footage said: 'I was catching the video about Ferrari F458 Italia Spider [because] I'm a fan of those.\n\n'When the Ferrari was passing me in full thrust, the forward wheel did not take adhesion due to wet asphalt...\n\n'The Ferrari crashed against a wall of the highway.\n\n'After stopping [the] video, I went near the Ferrari to make me sure that the guy and the Ferrari technician were good.\n\n'Fortunately, no injuries occurred but the car disappear after ten minutes and police [had no] further info about the accident.'\n\nIt is thought that the footage was originally taken in 2013.\n\nThe Ferrari driver had been on his first trip in his new car, according to the Italian newspaper 'La Repubblica', as it had been registered on the morning of the crash.\n\nWith a 4.5 litre V8 engine, the Ferrari F458 Spider can reach a top speed of 202mph and the model can achieve 0-62mph in under 3.4 seconds.", "description": "The footage was captured in the pouring rain at a junction in the district of Japigia, Italy. It is thought that the driver was on his first trip behind the wheel of the super car when the crash happened.", "authors": ["Raven Saunt For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/19/19505830-0-image-a-28_1570647175108.jpg", "published_at": "2019-10-09"}