{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/10/three-paths-ahead-republicans/601039", "downloaded_at": "2019-10-30 14:16:04.382228+00:00", "title": "Republicans Have Only Three Choices", "language": "en", "text": "Each new damning piece of testimony adds to the evidence that Trump abused his power, demanding that Ukraine intervene in American electoral politics in return for diplomatic attention and congressionally appropriated aid. For people who are willing to consider the evidence, each new account is useful as both confirmation and texture—Vindman, for example, offers a new firsthand account of a call between Trump and the Ukrainian president—but not novel. A few people refuse to listen, and no account could persuade them.\n\nYet the armory full of smoking guns will eventually matter. In earlier stages of the process, Republicans and Trump defenders could hide behind a series of excuses: The whistle-blower didn’t have firsthand knowledge, or there wasn’t really a quid pro quo, or the Ukrainians didn’t understand it as a quid pro quo, or maybe Trump didn’t know what was going on.\n\nBut the testimony has shredded each of these, as witnesses with direct knowledge speak and more becomes clear about the Ukrainian side and Trump’s own involvement. Process questions have now been at least partly disposed of. And while some Trump defenders are craven enough to mount baseless accusations of treason against witnesses, that’s unlikely to stand for long either.\n\nThat means Republican members of Congress will have to grapple with the substance of the impeachment inquiry, and they will have three options:\n\nTrump did it, and there was nothing wrong with that; Trump did it, and it was bad, but it wasn’t an impeachable offense; or Impeachment, and perhaps removal, are warranted.\n\nTrump himself has been espousing the first strategy. On Monday, the president urged Republicans to move past process complaints and dig into the substance of the accusations against him. “I’d rather go into the details of the case rather than process,” he said this morning. “Process is wonderful … but I think you ought to look at the case. And the case is very simple; it’s quick. It’s so quick.” He repeated the request on Twitter Tuesday morning:\n\nHow many more Never Trumpers will be allowed to testify about a perfectly appropriate phone call when all anyone has to do is READ THE TRANSCRIPT! I knew people were listening in on the call (why would I say something inappropriate?), which was fine with me, but why so many? — Donald J. Trump (@realDonaldTrump), October 29, 2019\n\nThe problem is that reading the transcript isn’t really helpful to his case at all, as it shows the president indulging in what his own former aides have called bogus conspiracy theories and pressuring Ukrainian President Volodymyr Zelensky. (In a sense, Trump has been right to dismiss the whistle-blower complaint; the transcript itself offers a more direct account, and it’s incriminating.) What few doubts there might be about his intentions have been put to rest by testimony from career diplomats, political ambassadors, National Security Council staff, and news reports from Ukraine.", "description": "As the evidence mounts against President Trump, the GOP faces three unpalatable options.", "authors": ["David A. Graham", "Staff Writer At"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/RTS2T9Z2/facebook.jpg?1572439676", "published_at": "2019-10-30"}