{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7545931/Scientists-discover-water-created-space-solar-winds-blast-meteorites-crash.html", "downloaded_at": "2019-10-07 20:50:16.453599+00:00", "title": "Scientists discover water is created in space when solar winds blast meteorites as they crash", "language": "en", "text": "Water can be created on asteroids, and maybe even on the moon, by the combination of solar winds and meteorites, scientists say.\n\nA team of researchers has discovered that correctly-timed solar winds can bind together loose hydrogen and oxygen atoms to create H2O.\n\nThis process can work even in an airless vacuum, they said, which is important because water is so vital for the survival of living things.\n\nScientists have long believed meteorites –which often contain the common elements oxygen and hydrogen – were the source of Earth's water supply, and this research sheds more light on how they could create it elsewhere.\n\nResearchers from Australia blasted a laser at a piece of an asteroid in conditions which mimicked space and, when they had the heat of a solar wind on them, loose hydrogen and oxygen atoms reacted to produce water molecules (stock illustration of meteorites)\n\nThe scientists, from Curtin University in Perth, Australia, made their discovery in experiments on a piece of a meteorite which landed in Australia 50 years ago.\n\n'This complex process to regenerate surface water molecules could be a possible mechanism to replenish water supplies on other airless bodies, such as the Moon,' said Dr Katarina Miljkovic, from Curtin's Science and Technology Centre.\n\n'This research finding has potentially significant implications because we all know the availability of water in the solar system is an extremely important element for habitability in space.'\n\nThe research comes just weeks after researchers revealed they had found evidence of a 'super Earth' planet with a lot of water some 110 light years away from us.\n\nThat was among one of the most promising signs of other planets being able to spot life that space explorers have ever seen, they said at the time.\n\nDr Miljkovic and her team, looking on a much more minute scale, explained that electrons – such as those from oxygen and hydrogen – and a sudden change in temperature were necessary for water to be created in the vacuum of space.\n\nFor their research they used a sample of the Murchison meteorite, a 220lbs (100kg) space rock which landed in Murchison, Victoria, on September 28, 1969.\n\nThey monitored the levels of water molecules on the rock while simulating solar winds and using lasers to mimic small meteorite impacts.\n\nWhen flying rocks such as meteors and asteroids slam into one another, or other bodies such as the moon, they scatter smashed fragments of the elements they contain around them.\n\nMost are made of minerals which probably have hydrogen and/or oxygen inside them in some form.\n\nDr Miljkovic and her team found the impact began a chemical reaction which released free-floating hydrogen and oxygen molecules.\n\nThe combination of this and a solar wind – which can reach temperatures of 1,800,000°F (1m°C) – managed to bind the hydrogen and oxygen together.\n\nThis successfully created molecules of water – H2O contains two parts hydrogen and one part oxygen.\n\nWater in the form and quantities that we know it is rare in space – around 71 per cent of the Earth's surface is covered in it.\n\nIce, however, is common – Mercury, Mars, Uranus, Neptune, the Moon, Jupiter's moons Europa, Callisto, Enceladus and Ganymede all contain water ice.\n\nDr Miljkovic and her colleagues' work was published in the journal Nature Astronomy.", "description": "Researchers from Curtin University in Perth, Australia, tested their theory in a vacuum on a piece of meteorite which landed in Victoria in 1969 and they successfully made water molecules.", "authors": ["Sam Blanchard For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/15/19399964-0-image-a-6_1570458646592.jpg", "published_at": "2019-10-07"}