{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/man-utd-star-daniel-james-20536597", "downloaded_at": "2019-10-08 11:39:44.078557+00:00", "title": "Man Utd star Daniel James explains why he never declared for England", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nManchester United star Daniel James says he was never contacted about the prospect of playing for England.\n\nJames has become a crucial part of Ryan Giggs' Wales squad, making his senior debut in November last year after going through the youth ranks.\n\nHis fine form for club and country saw him switch Swansea for Manchester United , where he has been a bright spark in a tough start to the season at Old Trafford.\n\nJames, born in Hull but with a Welsh father, revealed he never had any contact about playing for the country of his birth as he gets set for two huge Euro 2020 qualifiers for Wales against Slovakia and Croatia.\n\n(Image: REUTERS)\n\n\"[My father] took me to a camp in north Wales when I was 12. Ever since then I've always played for Wales age groups growing up,\" James said.\n\n\"I can't say England have ever tried to pick me.\"\n\nMeanwhile, James has backed United's youngsters to end their poor run of form and ensure they pull off a momentum shift - just like he did with former club Swansea.\n\n(Image: Getty Images)\n\nHe stated: \"In the Premier League this season a lot of clubs have young squads showing what they can do. I've always dealt with things in exactly the same way.\n\n\"It was the same when I was at Swansea and things weren't going so well.\n\n\"It's important in football to react when things aren't going so well. It's alright when things are going good, but it's important to deal with things when it's bad.\"\n\n(Image: Getty Images)\n\nWales take on Slovakia in Trnava on Thursday before hosting Croatia on Sunday.\n\nThe Red Devils host rivals and Premier League leaders Liverpool after the international break on October 20.", "description": "Man Utd ace Daniel James is already a star for Wales on the international scene - despite being born in Hull", "authors": ["Rich Jones", "Image", "Reuters", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20532301.ece/ALTERNATES/s1200/1_Premier-League-Newcastle-United-v-Manchester-United.jpg", "published_at": "2019-10-08"}