{"pub": "marketwatch", "url": "https://marketwatch.com/story/doing-this-one-simple-thing-would-take-a-huge-bite-out-of-poverty-new-study-shows-2019-10-11", "downloaded_at": "2019-10-11 12:53:11.795000+00:00", "title": "Doing this one simple thing would take a huge bite out of poverty, research shows", "language": "en", "text": "U.S. taxpayers spend about $878 billion a year on benefits and services for people with low incomes, according to the federal government.\n\nThat’s nearly a quarter of the entire federal budget.\n\nAnd they spend another $284 billion at the federal, state and local level on policing, justice and law and order, including $87 billion a year just on prisons, much of which is devoted to people who grew up in poor and at-risk circumstances.\n\nIf that sounds like a dismal situation in which everybody loses, here is some cheerful news.\n\nOne simple fix could take a big chunk out of that spending, lift many more people into the middle class, and pay big dividends all around, researchers have just found.\n\nThe solution? Providing better quality and more intensive public education for children, especially from poor and at-risk backgrounds, that lasts from age 3 through third grade.\n\nResearch conducted on a unique long-term data set from some of Chicago’s most-challenged neighborhoods has found that four to six years of educational interventions in a child’s life ended up producing enormous benefits by the time the children made it into early adulthood.\n\nTheir average incomes were a remarkable 25% higher than peers who didn’t get the intervention. They were 30% more likely to earn more than a basic $20,415 threshold. They were 50% more likely to make it into the top 25% of earners, and less likely to end up in deep poverty.\n\nThe biggest gains were seen among those who had been growing up in circumstances that were most at risk.\n\nSome 62% said they were better off than their parents.\n\nThe findings, conducted by psychologists Arthur Reynolds, Suh-Ruu Ou, Christina Mondi and Alison Giovanelli at the University of Minnesota, are being published in the journal “American Psychologist.”\n\nThe study looked at the CPC P-3 program, which stands for Child-Parent Center Preschool-to-Third Grade. The researchers looked at 1,329 former students who were born in 1979 and 1980, including 553 who benefited from four or more years in the program, and looked at where they had ended up 30 years later.\n\nResearchers examined the program’s impact in 20 Chicago public schools in the city’s poorest neighborhoods. Some 93% of the pupils were African-American and the remainder were Hispanic.\n\nThe program “had smaller classes, more intensive and active learning for students, and family outreach and workshops for parents,” Reynolds told MarketWatch. It also included GED classes. All teachers had bachelor’s degrees, each class had a teaching assistant, and a leadership team ran the program in each school.\n\nThe cost? About $2,000 extra per pupil a year.\n\nThe U.S. Census says there are about 24 million children in the U.S. aged 3 to 8, so the annual cost would be a maximum of $50 billion a year — which sounds like a lot, until you look at the annual cost of dealing with poverty.\n\nCritically, the benefits came from keeping the children in the program for four to six years. Just intervening at the preschool level didn’t work nearly as well. Children from poor and at-risk backgrounds benefited so long as they got at least four years of the program.\n\nIt is more than 50 years since the federal government launched early intervention programs such as Head Start as part of President Lyndon Johnson’s “War On Poverty.” Debate has raged about what has worked, what hasn’t, and why.\n\nThe programs have now been around long enough to analyze long-term outcomes: Not merely whether a program helped children have better reading levels at age 12, or jobs at 18, but how they fare well into middle age. The latest study is a case in point.\n\nIt is already known that early interventions can have big effects. Those who are behind by the time they make it to school have trouble catching up, experts have found. The latest study, however, shows that it’s not enough to improve pre-kindergarten education or to intervene for one or two years. However, what is remarkable is that just four to six years — a drop in the bucket compared with a lifetime — is enough to make huge chances in life chances.\n\nFor everyone else, that also means more people able to help pay taxes, and fewer people on welfare. Which compares favorably with a poverty burden that is nearly $1 trillion a year.", "description": "And it would end up saving taxpayers a bundle, too.", "authors": ["Brett Arends"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT093_arends_ZG_20191010145012.jpg", "published_at": "2019-10-11"}