{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7600277/NGolo-Kante-ruled-Chelseas-trip-Ajax-Ross-Barkley-absent.html", "downloaded_at": "2019-10-22 14:05:00.497102+00:00", "title": "N'Golo Kante ruled out of Chelsea's trip to Ajax with Ross Barkley also absent", "language": "en", "text": "N'Golo Kante will miss Chelsea's trip to Ajax in the Champions League with Ross Barkley also out.\n\nThe pair of midfielders missed the final training session on Tuesday morning in Cobham ahead of the flight to Amsterdam after failing to recover in time from their injuries.\n\nBarkley limped off before half-time against Newcastle on Saturday after damaging his ankle.\n\nN'Golo Kante will miss Chelsea 's trip to Ajax in the Champions League due to his injury\n\nChelsea's players share a joke while taking part in a sprinting drill during their training session\n\nFrank Lampard watches on as his players prepare for the Champions League clash with Ajax\n\nKante, meanwhile, has been out since picking up a groin injury while on international duty with France.\n\nChelsea were handed a boost as defender Emerson Palmieri took part in the session, warming up with his team-mates before doing some ball work.\n\nAntonio Rudiger was also involved after Frank Lampard made it clear on Friday that there was still 'work to be done' before he reached match fitness.\n\nMarcos Alonso, who scored against Newcastle, takes part in a passing drill on Tuesday\n\nTammy Abraham and Jorginho jog at the training centre in Stoke d'Abernon in Surrey\n\nAbraham and team-mate Olivier Giroud share a joke as they walk over to the pitches\n\nRudiger has been out of action for most of the season, managing just 45 minutes during the game against Wolves in September so far.\n\nLong-term absentees Andreas Christensen and Ruben Loftus-Cheek were also not involved on Tuesday morning.\n\nBut there was a place in the session for young Scottish midfielder Billy Gilmour, who is working his way into the first-team picture under Lampard.\n\nAfter facing Ajax, Chelsea travel to Turf Moor to take on Burnley in Saturday's late game.\n\nKepa Arrizabalaga stretches as he prepares for the clash with Ajax on Tuesday morning", "description": "The pair of midfielders missed the final training session on Tuesday morning in Cobham ahead of the flight to Amsterdam after failing to recover in time from their respective injuries.", "authors": ["Amitai Winehouse For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/13/20034262-0-image-a-200_1571746662680.jpg", "published_at": "2019-10-22"}