{"pub": "businessinsider", "url": "https://businessinsider.com/video-woman-climbs-into-lion-enclosure-at-new-york-zoo-2019-10", "downloaded_at": "2019-10-02 12:52:50.690575+00:00", "published_at": "2019-10-02", "title": "A woman climbed into the lion enclosure at a New York zoo, then posted videos of it on Instagram", "language": "en", "text": "A woman who visited The Bronx Zoo on Saturday climbed over a fence into the lion enclosure.\n\nThe woman, who identifies herself as Queen Empress Myáh Lareé Israelite on Instagram, posted several videos of the incident on her page.\n\nThe footage captured her climbing over the fence, as well as waving at and speaking to the animal while stood just meters away from it.\n\nThe Bronx Zoo filed a complaint for criminal trespass, the New York Police Department told CNN.\n\nVisit Insider's homepage for more stories.\n\nA woman climbed over a fence into the African lion enclosure at The Bronx Zoo, then posted videos of the incident on her Instagram page.\n\nThe footage, posted by the woman, who calls herself Queen Empress Myáh Lareé Israelite on Instagram, appears to have been captured by someone accompanying her.\n\nShe is seen climbing over the fence into the enclosure and standing just metres away from the male lion.\n\nIn response to a voice in the background heard saying: \"You aren't supposed to do that.\"\n\nThe woman responds: \"I want to get closer to him, sorry.\"\n\nRead more: A photographer captured a tender, bromantic nose rub between two male lions, and people are stunned\n\nA second video shows her in the enclosure standing opposite the lion, which stares directly at her.\n\nIn the caption for the video she wrote: \"My soul is pure this is why I made it out.\"\n\nAnother video posted on her page captured her waving to the lion, who is stood still staring at her.\n\nThe footage captured her speaking to the lion, in what looks like an attempt to provoke a reaction from it.\n\nShe refers to the animal as \"baby\" and says: \"I love you baby.\"\n\nThe incident was also caught on camera by another visitor at the zoo.\n\nPart 3 That happen yesterday at the @bronxzoo #bronxzoo #realsobrino A post shared by Real Sobrino (@realsobrino) on Sep 29, 2019 at 6:49pm PDT Sep 29, 2019 at 6:49pm PDT\n\nThe videos from the woman were posted on Sunday on her Instagram page, although the incident happened on Saturday, according to The Wasahington Post.\n\nA spokesperson from The Bronx Zoo told CNN: \"The action was a serious violation and unlawful trespass that could have resulted in serious injury or death.\"\n\nThe Bronx Zoo filed a complaint for criminal trespass, the New York Police Department told CNN.", "description": "The woman's is filmed climbing over a fence into the African lion enclosure at The Bronx Zoo and is heard saying: \"I want to get closer to him.\"", "authors": ["Sahar Esfandiari"], "top_image": "https://image.businessinsider.com/5d9486a7695b58000f66aa5b?width=1200&format=jpeg"}