{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/mums-kiss-warning-after-toddler-20583172", "downloaded_at": "2019-10-15 11:23:46.911429+00:00", "title": "Mum's kiss warning after toddler son catches 'life-threatening' herpes", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA mum has issued a warning after her toddler contracted herpes when he was kissed by someone with a cold sore .\n\nCharlotte Jones says she was devastated to find out the cause of little Ellis' condition and posted a series of photos showing his condition deteriorating.\n\nOne-year-old Ellis was first taken to their GP who thought he had tonsillitis or a bad case of ulcers, his mum said.\n\nBut within days the tot was diagnosed with the herpes, type 1, virus.\n\nMum Charlotte from Abergavenny, Wales, said: \"People really don't realise how a kiss or a touch from someone with a cold sore can be life threatening for a little body.\n\n(Image: Facebook)\n\n\"With temperatures reaching 40° nasal drips and two cannulas, two lots of bloods and numerous medication, no food for over a week and barely any juice via bottle.\n\n\"We've been lucky and Ellis is pulling through it like a boss, but for a baby with a low immune system the outcome could be very different.\"\n\nIn a warning to others, she added: \"Please do not kiss a baby or toddler if you have any symptoms of a cold sore, sanitise your hands before you touch the child!\n\n\"In a week Ellis's lips have changed so much, hes still got a way to go yet but is on the mend.\"\n\nNeonatal herpes can be deadly for very young children. The younger the baby, the more vulnerable they are to the harmful effects of infection, according to the NHS website.\n\n(Image: Facebook)\n\nIt reads: \"The herpes simplex virus can be passed to a baby through a cold sore if a person has a cold sore and kisses the baby.\n\n\"A baby is most at risk of getting a herpes infection in the first 4 weeks after birth.\n\n\"You should not kiss a baby if you have a cold sore to reduce the risk of spreading infection.\n\n\"Sometimes neonatal herpes will only affect the baby's eyes, mouth or skin.\n\n\"In these cases, most babies will make a complete recovery with antiviral treatment.\n\n\"But the condition is much more serious if it's spread to the baby's organs.\n\n\"Nearly a third of infants with this type of neonatal herpes will die, even after they have been treated.\n\n\"If widespread herpes is not treated immediately, there's a high chance the baby will die.\"", "description": "Little Ellis Edwards, from Abergavenny, Wales, was kissed by someone with a cold sore and could have lost his life as the herpes virus took hold", "authors": ["Kelly-Ann Mills", "Image", "Facebook"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20583422.ece/ALTERNATES/s1200/0_Herpes-son.jpg", "published_at": "2019-10-15"}