{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/4/bill-flores-texas-republican-announces-retirement-", "downloaded_at": "2019-09-04 23:48:12.634065+00:00", "published_at": "2019-09-04", "title": "Rep. Bill Flores announces retirement from House", "language": "en", "text": "Rep. Bill Flores announced his plans to retire on Wednesday, becoming the fifth Texas Republican to leave Congress.\n\nMr. Flores, elected in 2010, said when he first ran for Congress, he planned to only serve at most six terms. He wants to honor that commitment by ending his time in office on his fifth term.\n\n“Following the end of my current term in January 2021, I look forward to spending much more time with my family and our grandchildren. I also intend to resume business activities in the private sector and to stay politically active on a federal, state and local level,” he wrote in a statement.\n\nSo far in 2019, about a dozen Republicans have already announced their plans not to run for reelection, including several from Texas.\n\nThe Democratic campaign arm has dubbed the surge “Texodus” as the party eyes vulnerable purple districts.\n\n“Congressman Flores is now the fifth Texas Republican to retire as the DCCC’s early and aggressive investment in Texas’s swing districts lays the groundwork for victory in 2020,” DCCC Chairwoman Cheri Bustos said in a statement. “As more and more of their colleagues consider leaving Washington early, it’s become increasingly clear that the Texodus will continue.”\n\nMr. Flores‘ seat, in a solidly Republican district, should be safe for the GOP.\n\nHowever, according to The Cook Political report, three Texas districts — currently held by Reps. Pete Olson and Kenny Marchant — are toss-ups, while Rep. Will Hurd’s district is leaning Democratic.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Rep. Bill Flores announced his plans to retire on Wednesday, becoming the fifth Texas Republican to leave Congress.", "authors": ["The Washington Times Http", "Gabriella Muñoz"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/04/Texas_Congressman_Retires_34811.jpg-558f8_c0-0-5094-2970_s1770x1032.jpg?1ef403072de4fe7438c56beca45525768ff95b49"}