{"pub": "nytimes", "url": "https://nytimes.com/2019/10/30/technology/twitter-political-ads-ban.html", "downloaded_at": "2019-10-30 23:18:59.239413+00:00", "title": "Twitter Will Ban All Political Ads, C.E.O. Dorsey Says", "language": "en", "text": "The move is likely to pressure Facebook, which has lately faced heat for allowing politicians to run any claims — even false ones — in political ads on the social network. Mark Zuckerberg, the Facebook chief executive, has taken a stand on political advertising in recent weeks, saying that he would not police politicians’ ads even if they lied in them. He said that was because Facebook had been founded to give people a voice and because the social network stood for free expression. Politicians’ ads, he said, were newsworthy and added to public discourse.\n\nThat position has been highly unpopular among lawmakers, presidential candidates and even some of Facebook’s own employees. The campaign of the former vice president Joseph R. Biden Jr. recently blasted Facebook for its refusal to remove a false ad about Mr. Biden that was being run by President Trump’s campaign. Senator Elizabeth Warren, a Democrat who is also running for president, has called out Mr. Zuckerberg for running a “disinformation-for-profit machine.” And over the last two weeks, hundreds of employees at Facebook signed a letter to Mr. Zuckerberg asking him to reconsider how Facebook treats political ads.\n\nIn a veiled dig at Mr. Zuckerberg, Mr. Dorsey said that the fight against online disinformation is hampered if technology companies accept payment for misleading political content. Without naming Mr. Zuckerberg, Mr. Dorsey said it was not credible for tech companies to say they were working hard against misinformation “buuut if someone pays us to target and force people to see their political ad…well...they can say whatever they want!”\n\nPolitical ads make up only a small portion of the company’s advertising business, Twitter said.", "description": "The social media company’s action is a stark contrast to Facebook, which is taking a hands-off approach to political advertising.", "authors": ["Kate Conger"], "top_image": "https://static01.nyt.com/images/2019/10/30/business/30twitter/merlin_159753426_6bb65afc-cda3-4ef2-a2a8-575c45f1e342-facebookJumbo.jpg", "published_at": "2019-10-30"}