{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/15/WS5da5275fa310cf3e3557083f.html", "downloaded_at": "2019-10-15 02:18:10.428069+00:00", "title": "UK, US colleges reach students on Douyin", "language": "en", "text": "By ANGUS McNEICE | China Daily Global | Updated: 2019-10-15 09:56\n\nDouyin is called TikTok outside China. [DANISH SIDDIQUI/REUTERS]\n\nUniversities in the United Kingdom and the United States are using the popularity of social media platform Douyin to recruit students from China.\n\nEight UK and US universities have trialed a service run by student marketing agency Natives in collaboration with video-sharing app Douyin, which is called TikTok outside China.\n\nThe service posts university ads on Douyin, and Chinese users who interact with the posts are then connected to university customer relations systems as well as to a marketing platform operated by Natives.\n\nDouyin and Natives trialed the program for six months before officially launching it this month.\n\nWang Zheng, marketing manager at Natives, said the partnership with Douyin will generate \"quality targeted enquiries from Chinese students\" for foreign institutions.\n\nNatives has offices in Changsha, which is the capital of central China's Hunan province, as well as the US city of New York, and both Brighton and Portsmouth in the UK.\n\nZheng said the service will enable universities abroad to compete with those in China, which are already using Douyin as a recruitment tool. Top Chinese institutions Tsinghua University and Peking University have nearly 3.5 million Douyin followers between them.\n\nPhillip Gray, international director at York St John University in the English city of York, said Natives and Douyin have already generated a sizeable list of prospective Chinese recruits for his department.\n\n\"We couldn't have generated the volume and quality of leads without their insight, knowledge and experience,\" said Gray.\n\nThe UK ranks second in popularity among Chinese students studying abroad. The US is first. More than 106,500 Chinese students were enrolled in the UK last year, and applications from China increased by 30 percent for the 2019/20 academic year, according to the UK Universities and Colleges Admissions Service.\n\nForeign universities have long used Chinese social media platforms WeChat and Weibo to attempt to reach Chinese students, and Douyin now offers a particularly strong new channel for student recruitment due to its young users.\n\nDouyin was launched in 2016 by Chinese tech company ByteDance and was released globally as TikTok the following year. Users shoot, edit, and share short-form videos on the app, which is most popular among people younger than 25.\n\nThe app caught fire in 2018 when it was installed 663 million times, according to app analysts Sensor Tower, gaining more new downloads than Instagram. In February, the app surpassed 1 billion downloads globally, said Sensor Tower, whose data does not include Android users in China.", "description": "Universities in the United Kingdom and the United States are using the popularity of social media platform Douyin to recruit students from China.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/15/5da5275fa310cf3e97a141a0.jpeg", "published_at": "2019-10-15"}