{"pub": "dailymail", "url": "https://dailymail.co.uk/debate/article-7615555/PLATELLS-PEOPLE-Paul-Hollywoods-half-baked-diabetes-joke-told-truth-obesity.html", "downloaded_at": "2019-10-26 06:53:58.160463+00:00", "title": "PLATELL'S PEOPLE: Paul Hollywood's half-baked diabetes joke told the truth about obesity", "language": "en", "text": "Were that unfaithful scoundrel Paul Hollywood put in the stocks, the queue lining up to pelt him with rotten food would be longer than the one outside Madame Tussauds.\n\nYet here I am defending The Great British Bake Off judge after he was pilloried on social media for saying a Gâteau St-Honoré dessert made of caramelised, cream-filled choux buns, puff pastry and Chantilly cream was ‘diabetes on a plate’.\n\nOne Twitter follower said he should ‘make amends for his ignorant, hurtful and uneducated comment . . . you just made it harder for type 1 children’.\n\nThe fact is Hollywood’s diabetes joke spoke to an incontrovertible truth. There are far too many people who have the type 2 condition due to an irresistible urge to eat too much and a refusal to exercise\n\nIn his ham-fisted way, Hollywood had managed to highlight the huge distinction between type 1 and type 2 diabetes.\n\nThe former is an auto-immune condition where the body attacks its own insulin-producing cells; it often strikes in childhood and has nothing to do with lifestyle.\n\nType 2 tends to develop later in life, affects 90 per cent of all diabetes sufferers and is commonly brought on by obesity and a bad diet.\n\nOf course, I understand why those living with type 1 vented their fury — after all, their suffering isn’t connected in any way with how many creams buns they might have eaten.\n\nYet here I am defending The Great British Bake Off judge after he was pilloried on social media for saying a Gâteau St-Honoré dessert made of caramelised, cream-filled choux buns, puff pastry and Chantilly cream was ‘diabetes on a plate’\n\nBut I do believe the social media storm is an over-reaction. We all knew what Hollywood meant.\n\nHe was simply saying in a jocular manner that eating vast numbers of calories is bad for you.\n\nIt’s common parlance to describe a full English breakfast — fried bread, black pudding, the lot — as a heart attack on a plate. Is this really offensive to people who suffer from a heart condition unrelated to their diet?\n\nPerhaps in an age devoid of humour, one where outrage and victimhood are the default positions, it will be deemed so.\n\nOf course, I understand why those living with type 1 vented their fury — after all, their suffering isn’t connected in any way with how many creams buns they might have eaten\n\nThe fact is Hollywood’s diabetes joke spoke to an incontrovertible truth. There are far too many people who have the type 2 condition due to an irresistible urge to eat too much and a refusal to exercise.\n\nThe cost last year to the NHS of treating overweight or obese people was a fat-shaming £6.1 billion.\n\nRecent studies confirm obesity is responsible for more cases of bowel, kidney, ovarian and kidney cancer than smoking.\n\nYet we now have the ridiculous situation in which patients complain they have been victimised when doctors point out that they’d be better off dropping a few pounds.\n\nObesity is in danger of pulling down the whole NHS. And if one of TV’s pantomime villains makes a crass joke pointing out the problem, it’s no reason to throw the kitchen sink at him.\n\nMeanwhile, Paul Hollywood’s former girlfriend Summer Monteys-Fullam, 24, says she’s hurt by claims she only bedded a rich, famous older guy for his money.\n\n‘That’s so far from the truth. I worked so hard in the pub then I’d go home and be a horse whisperer.’ Nice work if you can get it.\n\nElle Macpherson reveals the secrets of keeping The Body bikini-ready at 55\n\nEllie's slim pickings\n\nElle Macpherson reveals the secrets of keeping The Body bikini-ready at 55.\n\nShe starts the day with hot water and lime, then fruit or raw oatmeal, washed down with one and a half pints of kale, cucumber, turmeric, garlic and lettuce juice from her organic garden.\n\nHer guilty secret is an occasional gluten-free vegetable pizza for supper.\n\nCrikey, if that’s what it takes, I’ll settle for a tummy-sucking-in one-piece — and keep going with the Quattro Formaggio pizzas.\n\nSilence is golden, Meg\n\nA bad week for the Sussexes after they tearfully railed against the pressure they suffer in their royal lives.\n\nMeghan said she ‘really tried to adopt the British stiff upper lip’ but gave up because it was ‘probably really damaging’.\n\nJolly good. Yet can I offer a sisterly tip as a fellow foreigner who made her home here?\n\nIf she can’t do the stiff upper lip, perhaps she could try another British quirk — biting her lip.\n\nIn other words, as we say in Oz: ‘Stop whingeing, Sheila.’\n\nPrue sails into the sunset\n\nTimothy West and Prunella Scales have putt-putted through their last TV canal trip, her advancing Alzheimer’s making it their final public voyage together.\n\nWhat a wonderful and loving insight this couple has given to those of us who have witnessed this disease first hand.\n\nAnd how sad that a new drug that can slow the disease came too late for Prunella or my Mum, who could both have had a few extra years knowing who their loved ones were and, more importantly, who they were.\n\nTimothy West and Prunella Scales have putt-putted through their last TV canal trip, her advancing Alzheimer’s making it their final public voyage together\n\nDistraught when John Humphrys retired from Radio 4’s Today, I’m overjoyed to discover he’s now doing a stint on Classic FM’s morning show.\n\nIt means once again I will be able to wake up to the dulcet — or should that be hectoring? — tones of my most constant bedroom companion.\n\nHowever brave it was of Strictly’s Shirley Ballas to reveal she was having her breast implants removed, I wonder whether she was wise to announce on The Jonathan Ross Show that after the operation on Tuesday, she’ll be back in her head judge’s seat for next Saturday’s show.\n\nMay I humbly suggest that four days to recover from a serious procedure is not enough for any woman.\n\nAnd if there’s one Strictly to miss it’s the dreadful Halloween one with it’s contrived theme of ghouls and goblins — we all hate it anyway.\n\nPictures of jihadi bride Shamima Begum in a Syrian refugee camp pleading to come home are enough to melt the heart. Yet still I’m undecided as to what should happen to her.\n\nAged just 20, she has lost three children, which is surely enough punishment for any soul.\n\nOn the other hand, we learned this week the Met has foiled 16 Islamist terrorist plots in Britain in the past two-and-a-half years.\n\nMaybe Shamima should stay there until we’re sure who’s side she’s really on.\n\nPictures of jihadi bride Shamima Begum in a Syrian refugee camp pleading to come home are enough to melt the heart. Yet still I’m undecided as to what should happen to her\n\nKeep it hidden, Arnie\n\nAhead of the premiere of Terminator: Dark Fate, Arnold Schwarzenegger insisted he is as fit now at 72 as he was for the original and was desperate to reprise his opening scene back in 1984 when he arrived on planet Earth unclothed.\n\n‘I can still do that. I can still arrive naked.’ Yes, Arnie, we’re sure you could do it, but do we want to see it?\n\nArnold Schwarzenegger insisted he is as fit now at 72 as he was for the original and was desperate to reprise his opening scene back in 1984 when he arrived on planet Earth unclothed. He is pictured above in the new movie\n\nWestminster Wars\n\nLabour has me on its mailing list, and I was sent an email from Diane Abbott saying: ‘Amanda, if like me you’re from an ethnic minority background I want to speak to you personally now.’\n\nPerhaps she got confused thinking I was a Patel — as opposed to Platell. Alas, Diane, I’m not BAME, although we do have one thing in common: an irresistible urge to slurp a tinny of mojito or G&T on public transport.\n\nTen points ahead in the polls, Boris is pushing for a December 12 election to end the parliamentary gridlock.\n\nGood luck with that, BoJo. Mrs May had a 20-point lead when she called the 2017 snap election — and lost her majority.\n\nOne result of an election will be that we see the back of two referendum betrayers.\n\nSpeaker John Bercow, who shamelessly colluded with Remainers to thwart Brexit is standing down as an MP. So is Oliver Letwin, who took a wrecking ball to both the May and Johnson deals.\n\nTeach ghouls respect\n\nAs the lorry which contained the 39 migrants who froze to death in unimaginable suffering passed by, Essex police officers lined the route and bowed their heads in respect — while onlookers filmed the poignant journey on their iPhones.\n\nEvery one of these voyeuristic ghouls should bow their heads — in shame.\n\nIn Germany recently, a traffic cop stopped a driver filming a fatal road crash, made him get out of his car to look at the broken body up close, before issuing him with a fixed penalty charge — then posting his own video of the driver on social media.\n\nA tough lesson, but perhaps the only way to teach mobile-obsessed morons the importance of respect.\n\nWayne Rooney celebrates his 34th birthday with three of his four sons in Barbados while long-suffering wife Coleen stays at home in Cheshire with their youngest.\n\nA bad infection stopped Col from travelling. Not too sick to be snapped out shopping, though, was she?", "description": "PLATELL'S PEOPLE: There are far too many people who have the type 2 condition due to an irresistible urge to eat too much and a refusal to exercise.", "authors": ["Amanda Platell For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/01/20203314-0-image-a-34_1572051057854.jpg", "published_at": "2019-10-26"}