{"pub": "arynews", "url": "https://arynews.tv/en/trade-wars-us-top-spot-wef", "downloaded_at": "2019-10-09 07:45:56.664833+00:00", "title": "Trade wars lose US its competitiveness top spot: WEF", "language": "en", "text": "GENEVA: The United States fell to second place behind Singapore in the World Economic Forum’s (WEF) flagship Global Competitiveness Report, with the slippage linked in part to President Donald Trump´s trade wars.\n\nThe Forum, organisers of the glitzy annual gathering of business and political elite in Davos, have released an annual competitiveness report since 1979 that assesses which economies are well placed to see productivity and long-term growth.\n\nWhile the report noted that the US “remains an innovation powerhouse” and the world’s second most competitive economy, some trouble signs have emerged, the Forum said.\n\n“There are no two ways (about) it. It is important to ensure the countries are being open to trade,” said Saadia Zahidi, a Forum managing director, when asked to comment on the impact of the tariffs imposed by the Trump administration.\n\nShe noted the lack of “hard data” on the impact of US tariffs imposed on several of its main economic partners, as the set of products impacted remains limited compared to overall trade.\n\nBut, she said, “the sentiment” surrounding investing in the US “has been going down,” she told reporters in Geneva.\n\n“That will end up impacting long-term investment; that will end up impacting how decision-makers are thinking; that will end up impacting the view of non-American business leaders (of) the United States. So it does matter in the long-term,” she added.\n\nThe Forum’s competitiveness report relies on part of executive surveys, in addition to hard economic data.\n\nZahidi said that the US had also fallen in the rankings because a healthy life expectancy in the country was now lower than in China.\n\nIn data published last year, the World Health Organization said that a newborn in China could expect 68.7 years of healthy living, compared to 68.5 for American newborns.\n\nSingapore surge\n\nThe report measures competitiveness on a scale of zero to 100 based on factors that include infrastructure, health, the labour market, the financial system, quality of public institutions and economic openness.\n\nSingapore scored 84.8 out of 100, but the Forum noted that the country had benefited from trade diversion through its ports triggered by the tariff battles between the world´s top economies.\n\nAt 83.7 the US slipped from a score of 85.6 in 2018.\n\nHong Kong rose four spots to claim third place with a score of 83.1, but the Forum said the data used in the report was collected before waves of pro-democracy protests began shaking the financial hub.\n\nThe Netherlands finished fourth — up two slots from last year — while Switzerland came in fifth place.\n\nComments\n\ncomments", "description": "The US fell to second place behind Singapore in the WEF Global Competitiveness Report, with the slippage linked in part to President Trump´s trade wars.", "authors": [], "top_image": "https://arynews.tv/wp-content/uploads/2019/10/250522_8965355_updates.jpg", "published_at": "2019-10-09"}