{"pub": "usatoday", "url": "https://usatoday.com/story/news/world/2019/10/21/canada-justin-trudeau-tight-race-conservative-party-rival/4026536002", "downloaded_at": "2019-10-21 07:37:22.733087+00:00", "title": "Justin Trudeau locked in tight race with Conservative Party rival as Canadians vote Monday", "language": "en", "text": "MONTREAL -- Four years removed from an election that brought him to power and international renown, Canadian Prime Minister Justin Trudeau is locked in a dead heat as Canadians head to the polls Monday.\n\nWhen Trudeau’s Liberal Party took power in 2015, it ended almost a decade of rule by the rival Conservative Party. Recent polls show the two parties in a neck-and-neck race.\n\nSeveral photos of Trudeau wearing blackface when he was younger surfaced in September but political analyst P.J. Fournier, who runs the poll tracking website 338Canada, said the scandal had little effect on public opinion.\n\n“The blackface really didn’t hurt Trudeau that much. It confirmed the biases of everybody,” he said. “Most Liberals said it’s not a big deal while Conservatives called Trudeau a hypocrite.”\n\nWhile Trudeau’s government has passed some popular legislation such as the legalization of cannabis, the administration has been plagued by several controversies and scandals. Most notably, earlier this year Canada’s former attorney general was expelled from Trudeau's Liberal Party caucus, amid a controversy about Trudeau's administration pressuring her to intervene in a criminal case against engineering firm SNC-Lavalin to ensure the company would still be eligible for government contracts awarded by Ottawa.\n\nMore: Justin Trudeau says he'll ban assault rifles amid backlash to blackface controversy\n\nGuy Lachapelle, a professor at Montreal’s Concordia University, said Canadians are relatively more concerned with kitchen-table issues like the economy and health care than Trudeau’s controversies and some Canadians felt betrayed by the results of negotiations that have yielded a replacement for NAFTA.\n\nDespite recent challenges, a spokesperson for Trudeau's party said he remains the best choice.\n\n\"Justin Trudeau and the iberal team have delivered real change for Canadians in our first 4 years of government,\" said Pierre-Olivier Herbert. \"The Liberal Party of Canada is the only party with a credible plan to fight climate, make life more affordable for middle class Canadians and grow the economy.\"\n\nHerbert added: \"On October 21st, Canadians will have a choice between moving forward with a progressive Liberal team, or go back to reductive Conservative policies.\"\n\nOver the course of Trudeau's tenure, relations between Canada and the United States have often been unusually contentious. While Trudeau had a close working relationship with former President Barack Obama, who tweeted his support on Oct. 16, he has had numerous conflicts with President Donald Trump over trade and Canada's military commitments. Conservative Party leader Andrew Scheer, Trudeau's top rival in Monday's election, has gently rebuked Trump in the past on topics such as protectionist policies and Trump's attacks on four American congresswomen while Jagmeet Singh, leader of Canda's left-wing National Democratic Party, has openly called for Trump's impeachment. Trump remains an unpopular figure in Canada and whoever wins will be under pressure from voters to not cave to the U.S. on economic matters.\n\n\"The agricultural sector, with the new free trade agreement, they're pretty mad. Those people who are working in these industries are pretty unhappy with the outcome and are voicing their discontent in their regions,\" said Lachapelle. \"The bottom line is their economic well-being and the Liberals didn't deliver on many of those questions.\"\n\nAnother issue on which Trudeau’s popularity has taken a major hit is on climate change. Last year the government approved the $4.5 billion purchase of a pipeline to shore up the energy sector, a move that critics said was at odds with Trudeau’s progressive rhetoric on the environment. Lachapelle said this has particularly hurt Trudeau in the key province of Quebec, where polls show growing support for the nationalist Bloc Quebecois party. Around 500,000 were present for a Montreal climate march attended by both Trudeau and famed teen activist Greta Thunberg in September.\n\nMore: 9 things to know about teenage climate change activist Greta Thunberg\n\n“The environment is an issue that really concerns Quebecers and they aren’t very satisfied with the Liberal government,” said Lachapelle. “They felt the promises of Trudeau were he was going to act more promptly on that issue and they’ve been disappointed over the past four years on the environment and the credibility of his government.”\n\nFrank Graves, founder of political research firm Ekos, attributed part of the dip in Trudeau’s popularity to the rise of a populist movement similar to those that led to Brexit and the election of Trump in the United States. Populist parties in Canada have won several elections at the provincial level over the past two years.\n\n“He was operating at almost celestial heights of approval and voter intention as little as two years ago,” said Graves. “I think people focus on a number of factors -- they didn’t like his personal style, all the selfies and the socks and the stumbles in terms of outfits in India. A lot of the people who lost confidence in Mr. Trudeau have moved away because they found more comfort in an authoritarian populist outlook on issues like immigration and climate change.”\n\nShould the Conservatives win more parliamentary seats, Fournier pointed out there is still a chance Trudeau could stay in power by forming a coalition with the New Democratic Party. While NDP leader Singh has hinted he’d be open to such a power-sharing measure, Trudeau has played coy on the matter.\n\n“Contrary to popular opinion, coalitions are very rare in Canada. The last one was in 1972,” said Fournier. “Since the NDP is generally more to the left of the spectrum, they have nothing in common with the Conservatives. If they don’t form a government it’s because they have nobody to bring with them. They have no natural allies.”\n\nRead or Share this story: https://www.usatoday.com/story/news/world/2019/10/21/canada-justin-trudeau-tight-race-conservative-party-rival/4026536002/", "description": "Donald Trump remains an unpopular figure in Canada and whoever wins will be under pressure from voters to not cave to the U.S. on economic matters.", "authors": ["Adam Kovac", "Special To Usa Today", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/sites/usatoday/images/favicon.png", "published_at": "2019-10-21"}