{"pub": "bbc", "url": "https://bbc.com/news/world-asia-49758043", "downloaded_at": "2019-09-20 22:37:38.530408+00:00", "title": "'It's a dominatrix with an onion': Japan’s mad mascots", "language": "en", "text": "Image copyright Getty Images\n\nWhen the mascots of the 2019 Rugby World Cup had their big reveal on Twitter, the reaction was… well, mixed:\n\n\"Is it supposed to be a cat?\"\n\n\"Rugby mascot should be burly, surly, and have a pint.\"\n\n\"I'll send you my therapist's bill.\"\n\n…and the outright murderous: \"Kill it with fire.\"\n\nPoor Ren-G (that's their name; weirdly they share one), dismissed as badly-drawn felines when they are in fact \"shishi\", lion-like animals from Japanese mythology that attract happiness and ward off evil.\n\nNow, there's an argument that it's traditional to hate sporting mascots. Just ask Whatizit, the mascot for the 1996 Summer Olympics - who was branded \"a sperm in sneakers\". But since Ren-G are a lynchpin of the World Cup merchandising programme, you might think the Twitter reception would worry World Rugby.\n\nNot a bit of it. Why? Because they're big in Japan. And Japan, as well as being the tournament's host nation, is the home of Hello Kitty and Pokemon - the ultimate market for mascots.\n\nHere, nothing's too random or revolting to have a joyful character promoting it. Shops, trains, airports, foodstuffs, public baths, medical procedures… There's a furry for everything. Often, they're anthropomorphised fruits, or surreal mash-ups of animals and objects.\n\nKan-chan, for example, is the mascot of Ichijiku Pharmaceuticals. The firm makes fig-based laxatives and enemas, so Kan-chan is a mixture of a fig, an enema, and a penguin.\n\nThen there's Waka-P, the mascot for Wakayama Women's Prison, who has an orange for a head.\n\n(Author's note: these are not the weirdest ones. Most of those work for the government or finance. Like Amazones, a mascot in Ama City, a masked dominatrix with huge teeth who whips bottoms using regional veg.)\n\nHow did Japan get obsessed with mascots, to the point where handmade Ren-G dolls sell for $1,849 (£1,490)?\n\nAccording to Chris Collier, a Brit in Tokyo and mascot superfan, the craze started about a decade ago when Japanese regions started promoting themselves with costumed characters.\n\n\"The first ones to make a splash were a samurai cat named Hikonyan, from Hikone City, and Kumamon [a black bear-like creature], from Kumamoto,\" he says.\n\nThese creatures, known as yuru-chara, or \"laid-back characters\", moved their home towns up the tourism rankings, and so \"mascots of varying quality began to emerge all over the country\".\n\nIt's hard to pin down how many exist now, but one database counting just the municipal mascots lists 3,482.\n\nImage copyright JIJI PRESS/AFP/Getty Images Image caption Kumamon (L) meets former Japanese Emperor Akihito and Empress Michiko in 2013\n\nIf they have a king, it's probably Kumamon, who won the first \"Yuru-Chara Grand Prix\" to choose the country's most popular local mascot in 2011. He resembles a wide-eyed black bear (but is NOT a bear, his website insists). He also has 800,000 Twitter followers, and a staff that includes choreographers. In 2018, his product portfolio - everything from cremation urns to toilet seats - made more than 150bn yen ($1.4bn). When Japan's recently retired Empress Michiko met the… bear-like-monster… she reportedly asked him: \"Are you single?\"\n\nChris Collier - who wryly documents mascot encounters on his website, Mondo Mascots - says the Kumamon cash helped fund reconstruction work in Kumamoto after a deadly earthquake struck in 2016.\n\nNot all regional mascots are controlled by the government, though.\n\nImage copyright Chris Collier Image caption Mascot spotter Chris Collier pictured with Unari-kun, the mascot of Narita City (but not the airport), who is a cross between an eel and an aeroplane\n\n\"Funassyi, the anarchic pear fairy from Funabashi city, is equally popular, and is an unofficial mascot,\" the mascot man says. \"So the character's creator/performer gets all the money. He is very philanthropic, though, and donates much of it to charity.\"\n\nFunassyi is big on personality, and sings in an all-mascot heavy-metal band. That's a winning formula, as it's the quirky ones that endure in this game.\n\nA mischievous streak can get a mascot a long way - and while they may win hearts by charming children, terrifying them isn't always frowned on.\n\nMelon Kuma, the mascot of Yubari City in Hokkaido, is a ferocious bear with a melon for a head whose brief appears to be \"eat people, but make it playful\". Should other mascots cross his path, he merrily attacks them.\n\nHow does it feel to be the person inside Melon Kuma, whose workday involves being assaulted by screaming kids from inside a sweaty suit, in a country whose summers hit 35C (95F)?\n\nOne man who might know is actor Ken Imae, a huge rugby fan who designed his own mascot - a dog named Ragamaru-Kun - to promote the sport ahead of the 2019 World Cup. He wears the suit himself, and has been to 130 events so far.\n\nImage copyright Oscar Promotions Image caption Ken Imae designed his own mascot for the Rugby World Cup\n\nMr Imae says he was inspired by the 2015 World Cup match where Japan's team, the Brave Blossoms, felled the giants South Africa in one of rugby's biggest ever upsets.\n\n\"I wanted to make Japanese rugby more exciting,\" the former college player said. \"In order to spread rugby, children and women need to be interested. Japan has an anime culture, and the power of mascots is great.\"\n\nThe name \"Ragamaru-Kun\" combines the words for \"rugger\" and \"round\", according to Japan's Kyodo News, while \"kun\" stands for \"boy\".\n\nMr Imae took his creation from 2D to 3D in May 2017, and the loveable ear-flapping dog is now the unofficial rugby mascot for the cities of Fuchu, Chofu, and Mitaka, in Tokyo's western suburbs.\n\nImage copyright Ken Imae\n\nWith their support, the actor wrote a \"rugby rule book\" featuring Ragamaru, and printed 80,000 copies. He gave it out free to schoolkids - all to spread the Gospel of Rugby.\n\n\"One day, I want to change the jersey worn by Ragamaru to a jersey from each country, so that I can play an active part in the world,\" says Mr Imae.\n\nHow high is he aiming? Think Disney.\n\n\"Like the world-famous Mickey Mouse,\" he says. \"Although this is a big dream, Ragamaru-Kun is aiming for it.\"\n\nIf the cuddly dog endures past the Rugby World Cup, he will probably outlast the official mascots, Ren-G.\n\nLike shooting stars, World Cup and Olympic mascots shine brilliantly but briefly. Mr Collier reckons the red-and-white pair will quietly retire when their immediate money-making duties are done.\n\nAnd then? Well, then Japan's attention turns to the 2020 Tokyo Olympics. Take a good look at this odd couple. You'll be seeing them again. And if Olympic officials are correct, they're about to make $130m.", "description": "The land that brought you Hello Kitty has been hiding a few skeletons in its closet…", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/17211/production/_108873749_gettyimages-910390380.jpg", "published_at": "2019-09-20"}