{"pub": "guardian", "url": "https://theguardian.com/food/2019/sep/18/savoury-spicy-beetroot-salmon-chive-cheese-choux-people-kim-joy", "downloaded_at": "2019-09-18 12:48:49.529890+00:00", "title": "Savoury spicy beetroot, salmon and chive cheese choux people", "language": "en", "text": "These tasty little treats are fun to make and are bound to prove a hit at parties\n\nTasty and fun, these make great starters or canapes. You will have leftover beetroot filling, but you can use this for something else – maybe alongside a salad.\n\nMakes: 15-20\n\nFor the choux:\n\n56g unsalted butter\n\n150g water\n\nPinch of salt\n\n33g plain flour\n\n33g strong white flour\n\n2 medium eggs\n\nFor the beetroot filling:\n\n½ small clove of garlic\n\n250g cooked beetroot (without vinegar)\n\n1 tbsp chopped coriander\n\n½ tsp chopped fresh mint\n\nJust under 1 tsp of balsamic vinegar\n\n2 tsp sriracha sauce\n\n1 tsp olive oil\n\n1 tsp horseradish\n\n1 tbsp Greek yoghurt\n\nSalt and pepper\n\nFor the cream cheese and chive filling:\n\n200g full-fat cream cheese\n\n110g double cream\n\n2 tbsp finely snipped chives\n\nPlus:\n\n1 pack of smoked salmon\n\n30-40 capers\n\nCucumber, radish and nori sheets to decorate\n\nHeat the oven to 200C/180C fan/400F/gas mark 6.\n\nFirst make the choux pastry. Chop the butter and put it in a small saucepan with the water and salt. Heat until the butter has melted and the mixture starts to bubble, remove it from the heat and add both flours in one go. Stir with a wooden spoon until it forms a smooth ball that pulls away from the sides very easily.\n\nTransfer to a stand mixer bowl with a paddle attachment. Leave to cool for 5-10 minutes. Add one egg, mixing on slow speed until just combined. Whisk the second egg in a separate bowl and add gradually, a tablespoon at a time, mixing well after each addition. You are looking for a glossy consistency that leaves a V when a spoon is lifted out of the dough. You may not need all of the second egg.\n\nTransfer to a piping bag and cut a medium tip. Pipe 15-20 choux pastry blobs on to a lined baking tray, place in the oven. Bake for 30 minutes until brown and crisp, then allow to cool on a wire rack.\n\nMeanwhile, make the beetroot puree. Crush the garlic and roughly chop the beetroot. Put all the ingredients, apart from the yoghurt, salt and pepper, in a food processor and blitz until smooth. Then add the yoghurt, salt and pepper (to taste) and blitz for a few seconds until combined. Transfer to a piping bag.\n\nNext make the cheese filling. Put the cream cheese, cream and chives in a bowl and whisk on medium/high speed until thick and fluffy. Transfer to a piping bag.\n\nTo assemble, cut the top off a choux pastry. Pipe half a teaspoon of the beetroot filling into the base, add a small piece of smoked salmon and a couple of capers, then pipe in the cream cheese filling. Top with the choux lid, repeat for all the choux, then decorate. For the eyes, use star-shaped cutters to trim cucumber slices, and give each one a bit of nori seaweed as a pupil. Cut little bits of radish for the mouths.\n\nBaking with Kim-Joy: Cute and Creative Bakes to Make You Smile is published by Quadrille. To order for £15.84 (RRP £18), go to bookshop.guardian.com or call 0330 333 6846.", "description": "These tasty little treats are fun to make and are bound to prove a hit at parties", "authors": [], "top_image": "https://i.guim.co.uk/img/media/52f31481c96cd5b48bf1b622cb02b8923b03bc28/0_354_6570_3942/master/6570.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=afe9baef78dce25b3dc08175f3d7179e", "published_at": "2019-09-18"}