{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/insecticides-bees-deaths-sulfoxaflor-court-lawsuit-a9096826.html", "downloaded_at": "2019-09-08 23:29:16.874421+00:00", "title": "Beekeepers are suing Trump administration over decision to allow wider use of insecticides", "language": "en", "text": "Beekeepers are suing the Trump administration over its decision to allow the wider use of an insecticide linked to the deaths of entire honeybee colonies.\n\nThe Environmental Protection Agency (EPA) removed restrictions on sulfoxaflor in July and approved a host of new uses for the chemical.\n\nAccording to environmental organisation Earthjustice, when honeybees return to their hives with pollen and nectar tainted with sulfoxaflor “the effect on the entire colony can be catastrophic”.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe court action, filed by Earthjustice lawyer Greg Loarie on behalf of the Pollinator Stewardship Council and American Beekeeping Federation, argues that the EPA decision was “contrary to federal law and unsupported by substantial evidence.”\n\nMr Loarie, who filed the lawsuit at the Ninth Circuit Court of Appeals on Friday, said: “Honeybees and other pollinators are dying in droves because of insecticides like sulfoxaflor, yet the Trump administration removes restriction just to please the chemical industry.\n\n“This is illegal and an affront to our food system, economy, and environment.”\n\nSulfoxaflor is produced by Corteva, formerly Dow AgroSciences.\n\nThe chemical can kill adult bees at low doses and when brought back to the hive it can impair the colony’s ability to breed, forage, fight disease and survive the winter, according to Earthjustice.\n\nMichele Colopy, of Pollinator Stewardship Council, said: “It is inappropriate for EPA to solely rely on industry studies to justify bringing sulfoxaflor back into our farm fields.\n\n“Die-offs of tens of thousands of bee colonies continue to occur and sulfoxaflor plays a huge role in this problem.\n\n“EPA is harming not just the beekeepers, their livelihood, and bees, but the nation’s food system.”\n\nIn the US, pollinators are thought to provide about $200 billion a year to the economy.\n\nAccording to the US Department of Agriculture, the number of honeybee hives in the country has decreased from six million in the 1940s to about 2.5 million today.\n\nIn the last year alone, beekeepers in the US have lost four in 10 honeybee colonies.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nA study in 2018 found that sulfoximine-based treatments reduced both the overall size of bumblebee colonies and the number of male offspring they produced.\n\nResearchers at Royal Holloway University of London found that in colonies exposed to sulfoxaflor – the first branded sulfoximine-based insecticide – the number of sexual offspring produced fell by over a half.\n\nWhile the chemical does not directly kill bees, it is likely to trigger harmful long-term effects in colonies as their health depends on having a complete workforce.\n\nThe decline of bee numbers is also an issue in other countries, such as Brazil.\n\nAbout 500 million bees died in four of the country’s southern states in the first three months of this year, sparking concerns over the use of pesticides, Bloomberg reported.\n\nMost of the insects were reportedly found to have traces of insecticides containing neonicotinoids and fipronil, which are banned in Europe.\n\nAccording to a global study published in the journal Biological Conservation, more than 40 per cent of insect species are at risk of extinction within decades unless there is an overhaul of the agricultural industry.\n\nThe Independent has approached the EPA for a response.", "description": "Beekeepers are suing the Trump administration over its decision to allow the wider use of an insecticide linked to the deaths of entire honeybee colonies. The Environmental Protection Agency (EPA) removed restrictions on sulfoxaflor in July and approved a host of new uses for the chemical. According to environmental organisation Earthjustice, when honeybees return to their", "authors": ["Chiara Giordano"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/08/17/bees.jpg", "published_at": "2019-09-08"}