{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7562451/Shaman-trek-Moscow-exorcise-Vladimir-Putin-vows-start-journey.html", "downloaded_at": "2019-10-11 13:17:22.127508+00:00", "title": "Shaman on trek to Moscow to 'exorcise' Vladimir Putin vows to re-start his journey", "language": "en", "text": "A Siberian shaman who was arrested during a 5,000 mile trek from Siberia to 'kick the demons' out of Vladimir Putin has vowed to resume his journey.\n\nAlexander 'Sasha' Gabyshev, 60, nicknamed the 'new Rasputin,' in reference to the crazed monk who took a malevolent hold over the last tsar of Russia, had his journey halted six months in on September 19 when he was arrested on extremism charges.\n\nThe determined shaman was flown back to his home city in Far East Russia and released from jail, after he was was reportedly declared 'insane' by psychiatric evaluators.\n\nHe has now promised to restart his mission, according to the Moscow Times.\n\nGabyshev making his way down the road to Moscow, he was halted at Lake Baikal in Siberia, on the border between Buryatia and Irkutsk\n\nOn the road: Gabyshev making his way from Yakutsk to Moscow, he started in March and expected to finish in early 2021\n\nAlexander 'Sasha' Gabyshev, 60, poses with a woman while on the road to Moscow, he has vowed to resume his journey after being arrested\n\nThe planned exorcism involves lighting a bonfire near the Kremlin wall on Red Square and feeding it horsehair and fermented mare's milk.\n\nThe process will also involve banging a leather drum and performing a prayer, the New York Times reported.\n\nThe shaman had originally set out from his native republic of Sakha to Moscow in March with the clear aim of his two-year pilgrimage 'to drive Russian president Vladimir Putin out of the Kremlin'.\n\nHe explained before his detention: 'God told me that Putin is not a human but a demon, which I must expel. This is why I am walking there, to expel the demon.\n\n'At first I will try with peaceful methods like gatherings of people and rallies. Should it not happen by peaceful ways, there will be others.'\n\nGabyshev, who had aimed to arrive in Moscow by early 2021, was held by heavily armed masked police at a camp site near Lake Baikal in Siberia last month.\n\nGabyshev greets locals on the way to Moscow - he was stopped six months into the trek, the Ministry of the Interior confirmed and will face charges in his hometown for unspecified crimes\n\nGabyshev shakes a woman's hand while journeying to find Vladimir Putin\n\n'A man born in 1958 was on a search list for committing crime in the Sakha Republic,' said a spokesman at the time of his arrest. 'The man will be transported to Yakutsk on the next plane.'\n\nHis arrest came six months into his journey. As he had moved along his route, people began to join him while others offered food, shelter and money to help his cause.\n\nVideos about him started clocking up millions of views.\n\nThe widower explained: 'The aim of what I am doing is to create a different Russia which has to be young, new, and open to the world.\n\n'Power has to be with local communities, everybody has to be equal.\n\n'It's time to create new history of planet Earth.'\n\nLocals take photos of the mysterious shaman who was to carry out a holy mission to the Kremlin before he was intercepted\n\nVladimir Putin was targeted by Russia's 'new Rasputin' - Rasputin was a holy wanderer who gained a malevolent hold over the Russian imperial family prior to the Revolution\n\nPeasant Grigory Rasputin, described as a holy wanderer, arrived in royal capital St Petersburg and became a favourite of Russian empress Alexandra, wife of last tsar Nicholas II.\n\nHe was 'healer' to their sickly son Alexei, the crown prince, shot by a Bolshevik firing squad with the rest of the imperial family in 1918.\n\nRasputin was killed in December 1916 by Russian noblemen fearful at his sway in the royal family.", "description": "Siberian shaman Alexander 'Sasha' Gabyshev, 60, nicknamed the 'new Rasputin' has vowed to restart his two-year journey to 'exorcise' Vladimir Putin after he was arrested last month.", "authors": ["Sophie Tanno", "Will Stewart In Moscow For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/11/19582146-0-image-a-7_1570790284042.jpg", "published_at": "2019-10-11"}