{"pub": "news24", "url": "https://city-press.news24.com/Sport/side-entry-felix-jones-needs-to-keep-up-with-boks-other-jones-20191013", "downloaded_at": "2019-10-13 18:47:57.963689+00:00", "title": "Side Entry: Felix Jones needs to keep up with Boks’ other Jones", "language": "en", "text": "Sport Side Entry: Felix Jones needs to keep up with Boks’ other Jones\n\nIt’s probably not the thing to suggest about a team that put 66 points on the board the last time they played and are sitting on a mountainous points difference of 149 from the four matches they’ve played, but we need to talk about the Springboks’ attack at the Rugby World Cup.\n\nRassie Erasmus’ men have scored 27 tries – an average just shy of seven a match – in their four games in Pool B, yet all they’re remembered for is the eye-watering physicality of their pack and a defence so suffocating that playing against them equates to workplace harassment.\n\nIt’s not that they can’t score tries, it’s just that they struggle to do it against a team whose defence is a bit firmer than wet toast.\n\nIn all fairness to the Boks, said firm defence was that of defending champions New Zealand, who have conceded just one try (against the South Africans) in the tournament so far.\n\nBut even against the so-called minnows, the Boks haven’t exactly cut loose in Japan.\n\nNamibia coach Phil Jones looked happier after keeping the South Africans under 50 points than he has after winning games, and the results against Italy and Canada were achieved against sides that played with a red card for a significant amount of time in those encounters.\n\nOf course, with the play-offs sidling into view, the more cerebral among us will point out that the double skip passes will now be shelved in favour of exactly the kind of game the Boks have been playing, which is basic suffocation from an aggressive pack of forwards and a similarly rabid defence.\n\nFair enough, but there was something concerning in both the games the Boks have played against the All Blacks – when their forwards were on top and their defence was presenting the world champions with nothing but blind alleys, they could do little to cash in on that other than the occasional goal kick.\n\nTranslated, once a team matches the Bok forwards’ physicality and exploits the risk part of its high-risk defence, their go-to play is an incessant kicking game.\n\nAs we’ve all been educated by now, there’s nothing wrong with kicking the ball – as long as you’re sure you’ll get it back, which, due to their iffy execution, is something the Boks aren’t always sure of doing when they hoof it away.\n\nGiven how impressive the Bok pack has been, some may not think finding a way, attack wise, does not matter.\n\nRead: Rassie’s Boks eye World Cup smash and grab\n\nBut if they are not careful, this could be 2011 all over again, where they dominated their quarterfinal against the Wallabies, but a combination of the Aussies’ stubbornness and Bryce Lawrence officiating meant they went home from a tournament they could have won.\n\nSon\n\nThis is where Felix Jones, Swys de Bruin’s replacement, comes in.\n\nThe last time a Jones (Eddie) joined the Boks at the last minute, he cleared their heads around attack and they ended up winning the 2007 World Cup.\n\n\n\nWe’ve seen little of the new Jones, or indeed of the Irishman’s influence, since he arrived.\n\nIn all fairness, his role was described as analysing the opposition defences of the Six Nations sides for weaknesses the Boks may exploit.\n\nWith the Boks still flirting with the possibility of a last-eight clash against Ireland – depending on whatever permutations Typhoon Hagibis turns up in Pool A – Jones may still prove Erasmus to be a genius for making the call to hire him.\n\nAs a former Ireland player and a coach on Joe Schmidt’s staff, Jones should have some usable insights into a team that has beaten the Boks three times in the past five games they’ve played them.\n\nAdd the likelihood of a Wales semifinal, and a possible England final, and Jones may well keep up with the exploits of the Boks’ other Jones.\n\n. Follow me on Twitter @simxabanisa", "description": "It’s probably not the thing to suggest about a team that put 66 points on the board the last time they played and are sitting on a mountainous points difference of 149 from the four matches they’ve played, but we need to talk about the Springboks’ at", "authors": ["Simnikiwe Xabanisa"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8113/9ac522c19def49948511a089bd776b19.jpg", "published_at": "2019-10-13"}