{"pub": "theverge", "url": "https://theverge.com/2019/10/14/20913502/microsoft-surface-book-2-firmware-update-fix-nvidia-gpu-windows-10-may", "downloaded_at": "2019-10-14 23:21:58.994143+00:00", "title": "Microsoft’s latest Surface Book 2 update fixes its dreaded Nvidia GPU bug", "language": "en", "text": "Microsoft’s recent firmware updates for the Surface Book 2 seem to have fixed a big issue that, for the past few months, has prevented some users from being able to update to the latest version of Windows 10.\n\nThe problems started following the release of Microsoft’s May 2019 Update. Some users reported that their high-end Surface Book 2 configurations no longer detected their dedicated Nvidia graphics card in the device manager. This was a big issue if you wanted to play games or run any other GPU-intensive application that relied on the Nvidia hardware. Since then, affected users haven’t been able to update their systems to the latest Windows 10 May 2019 Update.\n\nIf you’re one of the people whose machine was impacted, you should download the trio of firmware updates below from Microsoft. Thurrott first indicated last Friday that these should be the fix we’ve been waiting for, and now, The Verge can confirm that these updates address the long-running issues.\n\nWhen you go to update your machine, here’s what to look for:\n\nSurface - System - 1.75.139.0 , Surface Base 2 Firmware Update - Firmware, 1.75.139.0 improves battery stability\n\n, Surface Base 2 Firmware Update - Firmware, 1.75.139.0 improves battery stability Surface - Firmware - 182.1004.139.0 , Surface System Aggregator - Firmware, 182.1004.139.0 resolves an issue where the CPU will throttle down to .4GHz, and improves battery stability\n\n, Surface System Aggregator - Firmware, 182.1004.139.0 resolves an issue where the CPU will throttle down to .4GHz, and improves battery stability Surface - Firmware - 389.2837.768.0, Surface UEFI - Firmware, 389.2837.768.0 resolves an issue where the display adapter disappears from Device Manager\n\nOnce these updates are complete, you’ll be able to update your Surface Book 2 to the latest version of Windows 10 “in the coming weeks.”", "description": "Microsoft issued a few firmware updates for the Surface Book 2 on October 11th. Some users experienced issues with their machine’s Nvidia graphics card not being recognized, and these updates appear to have fixed the issue.", "authors": ["Cameron Faulkner", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/U8_lWfhuar1Yzs9zAjKM2Xa7T3k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9687307/akrales_171115_2141_0006.jpg", "published_at": "2019-10-14"}