{"pub": "mirror", "url": "https://mirror.co.uk/news/us-news/breaking-greenville-homecoming-shooting-two-20734444", "downloaded_at": "2019-10-27 12:13:15.017479+00:00", "title": "Greenville homecoming shooting: Two dead and 14 injured after 'parking row'", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nTwo people have died and multiple others been injured in a mass shooting at a homecoming party in Texas.\n\nA major manhunt is underway for the gunman who police say used a semi-automatic rifled to inflict terror and devastation.\n\nEmergency services were called just before midnight to The Party Venue in Greenville, near Dallas, where a celebration was taking place to welcome back Texas A&M Commerce College students.\n\nThe shooting happened 15 minutes after officers arrived on the scene following reports of a parking dispute. It is not clear if the two incidents are connected.\n\nOfficials found two bodies and 14 others suffering various injuries.\n\nHave you been affected by this story? Email webnews@trinitymirror.com\n\n(Image: LARRY W SMITH/EPA-EFE/REX)\n\n(Image: LARRY W SMITH/EPA-EFE/REX)\n\nAround 750 students had been inside the venue at the time celebrating the start of the school year.\n\nThe victims were taken to several hospitals by land ambulance, air ambulance or private transport.\n\nWFAA-TV reporter Jason Whitely tweeted earlier: “At least two fatalities. More than a dozen injured. A .227 caliber rifle is believed to be used. Motive unknown.\"\n\nHe added: \"The confirmed mass shooting is on US380 in Hunt County, outside of Caddo Mills at a place called The Party Venue. Texas A&M Commerce students were attending.\n\n\"This is homecoming weekend at the university.\"\n\n(Image: LARRY W SMITH/EPA-EFE/REX)\n\n(Image: Hunt County Theft Reports)\n\nCBS 11 News reporter J.D Miles also tweeted: \"Reports from Greenville of a mass shooting at a party venue with several casualties.\n\n\"Multiple first responders on the scene. I’m told it was a homecoming party and there are fatalities.\"\n\nPolice were alerted just before midnight, with a Hunt County Sheriff scanner stating “multiple people shot” and “multiple victims.\"\n\n(Image: Hunt County Theft Reports)\n\n(Image: LARRY W SMITH/EPA-EFE/REX)\n\nOne person was shot in the neck, scanner traffic stated.\n\nThe official twitter of the Texas A&M-Commerce University Police Department tweeted: “There has been no active shooter situation in Commerce.\n\n\"There was an event outside Greenville, TX that may or not have involved students at this time. Further information will be posted when known.”", "description": "Police were called to The Party Venue in Greenville, near Dallas, in Texas, over a parking row - 15 minutes before gunshots were heard", "authors": ["Amber Hicks", "Image", "Larry W Smith Epa-Efe Rex", "Hunt County Theft Reports"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20734477.ece/ALTERNATES/s1200/1_Greenville_17958JPG.jpg", "published_at": "2019-10-27"}