{"pub": "thehill", "url": "https://thehill.com/policy/finance/465111-lawmakers-blast-nba-for-outrageous-response-to-chinese-boycott", "downloaded_at": "2019-10-10 00:07:32.241678+00:00", "title": "Ocasio-Cortez, Ted Cruz join colleagues blasting NBA for 'outrageous' response to China", "language": "en", "text": "A bipartisan group of eight lawmakers fiercely criticized the NBA in a Wednesday letter to commissioner Adam Silver, demanding the league scale back its operations in China and take a stronger stand against Chinese government pressure.\n\nThe ideologically diverse coalition of lawmakers — including Sen. Ted Cruz Rafael (Ted) Edward CruzGOP requests update on criminal referrals prompted by 2018 Kavanaugh probe Three 2020 candidates have missed about half of Senate votes NBA commissioner seeks to shift message on China with new statement MORE (R-Texas) and Rep. Alexandria Ocasio-Cortez Alexandria Ocasio-CortezOcasio-Cortez taps supporters for donations as former primary opponent pitches for Kennedy Trump's immigrant health care proclamation is aimed at the wrong problem Ocasio-Cortez demands authorities 'get to the bottom' of Joshua Brown's murder MORE (D-N.Y.) — blasted Silver for the NBA’s initial response to China after the Houston Rockets' general manager expressed support for demonstrators in Hong Kong.\n\nADVERTISEMENT\n\n“It is outrageous that the Chinese Communist Party is using its economic power to suppress the speech of Americans inside the United States,” wrote the lawmakers. “It is also outrageous that the NBA has caved to Chinese government demands for contrition.”\n\nJoining Cruz and Ocasio-Cortez on the letter were Democratic Rep. Tom Malinowksi (N.J.) and Sen. Ron Wyden Ronald (Ron) Lee WydenHillicon Valley: Senate Intel report urges action to prevent 2020 Russian meddling | Republicans warn Microsoft of 'urgent' Huawei threat | Court rules FBI surveillance violated Americans' rights Treasury considering rolling back Obama-era offshore tax rule: report Court rules FBI surveillance violated Americans' rights MORE (Ore.), Republican Reps. Mike Gallagher Michael (Mike) John GallagherShowing consumers health care pricing could lower costs 2020 Democrats raise alarm about China's intellectual property theft Bipartisan panel to issue recommendations for defending US against cyberattacks early next year MORE (Wis.) and Jim Banks (Ind.), and GOP Sens. Tom Cotton Thomas (Tom) Bryant CottonHillicon Valley: Senate Intel report urges action to prevent 2020 Russian meddling | Republicans warn Microsoft of 'urgent' Huawei threat | Court rules FBI surveillance violated Americans' rights Top Democrats warn against withdrawing from treaty that allows observation flights over Russia GOP senators warn Microsoft of 'urgent' threat from Huawei MORE (Ark.), and Ben Sasse Benjamin (Ben) Eric SassePolls flash warning signs for Trump on impeachment GOP senator: 'Not appropriate' to ask foreign governments to investigate Biden Republicans urge Trump to reverse course on Syria withdrawal MORE (Neb.).\n\nThe bipartisan letter marks the latest escalation in congressional backlash to the NBA’s handling of a controversy involving a now-deleted tweet from Houston Rockets general manager Daryl Morey.\n\nMorey on Friday tweeted, then deleted a picture declaring \"Fight for freedom. Stand with Hong Kong.\" The tweet drew an immediate condemnation from the Chinese government, while several Chinese businesses and media outlets cut ties or blacklisted the organization.\n\nThe NBA initially responded with a widely-panned Monday statement expressing its regrets to offended Chinese fans, and spurred even more U.S. anger with a stronger statement in Mandarin condemning Morey.\n\nDemocrats and Republicans alike have accused the NBA and Silver for prioritizing the league’s lucrative presence in China over human rights and free speech.\n\nThe lawmakers wrote that the NBA’s response “not only sold out an American citizen,” but also “reinforces the Chinese Communist Party view that those who point to Chinese repression in Hong Kong are as best stating opinions, not facts.”\n\n“Hundreds of millions of people within China will read your statements as an admission that their government’s propaganda is correct,” the lawmakers continued. “That you have more potential fans in China than in Hong Kong is no excuse for bending over backwards to express ‘sensitivity’ only to one side.”\n\nWhile Silver on Tuesday pledged to defend the freedom of expression for all NBA players and personnel, the statement did little to appease the NBA’s critics in Washington and Beijing.\n\nThe Chinese government canceled an NBA fan event, along with a media availability with players on the Brooklyn Nets and Los Angeles Lakers, who are scheduled to play games in Shenzhen and Shanghai this week.\n\nChina has also canceled the broadcast of all NBA games, stripped promotional ads for the Nets-Lakers games, and threatened the league with starker penalties for criticizing the Chinese government.\n\n“We voice our strong dissatisfaction and opposition to Adam Silver offering as an excuse the right to freedom of expression,” said state-run China Central Television in a statement.\n\n“We believe that no comments challenging national sovereignty and social stability fall within the scope of freedom of expression.”\n\nA fan was also ejected from a Tuesday game in Philadelphia between the Philadelphia 76ers and the Chinese Basketball Association’s Guangzhou Loong Lions for shouting “Free Hong Kong” from the stands.\n\nSeveral U.S. politicians have also criticized the NBA’s decision to yield to China despite the league’s support for players and coaches who have spoken out against racial disparities within the criminal justice system, LGBTQ rights and other political issues.\n\nThe lawmakers urged Silver on Wednesday to make an explicit statement supporting the rights of NBA employees and fans “to express their opinions no matter the economic consequences,” and urging China to respect the league’s commitment to free speech.\n\nThey also asked the NBA to suspend all activities in China until the country’s government and businesses reverse their boycott, and reconsider the location of a training camp in the Xinjiang region, where the Chinese government has conducted mass oppression and of more than 1 million Uyghur Muslims.\n\n“NBA players have a rich history of speaking out on sensitive topics of social justice and human rights inside the United States, and the NBA takes pride in defending their right to do so,” wrote the lawmakers Wednesday.\n\n“Yet while it easy to defend freedom of speech when it costs you nothing, equivocating when profits are at stake is a betrayal of fundamental American values.”", "description": "A bipartisan group of eight lawmakers fiercely criticized the NBA in a Wednesd", "authors": [], "top_image": "https://thehill.com/sites/default/files/cruzted_ocasiocortezalexandria_061419gn.jpg", "published_at": "2019-10-09"}