{"pub": "yahoo", "url": "https://sg.sports.yahoo.com/celtic-fight-back-beat-lazio-212057420--spt.html", "downloaded_at": "2019-10-25 03:34:59.873032+00:00", "title": "Celtic fight back to beat Lazio", "language": "en", "text": "Christopher Julien's header a minute from time handed Celtic a vital 2-1 victory over Lazio as the Scottish champions took a huge step towards the last 32 of the Europa League.\n\nThe Italians took the lead five minutes before half-time when Manuel Lazzari fired in from a narrow angle.\n\nCeltic levelled midway through the second half when Ryan Christie turned home Odsonne Edouard's pass before Christie turned provider for centre-back Julien to nod home the winner.\n\nVictory takes Neil Lennon's men to the top of Group E with seven points from their first three games.\n\n\"It's a great position to be in,\" said Lennon.\n\n\"It's so important to win your home games. That, to me, was a Champions League game tonight with the quality that was on show from both sides and the tempo that the game was played at.\n\n\"Lazio came to really play. So for us to get on the positive side of that result was fantastic.\"\n\nLazio drop to third in the group, three points behind second-placed Cluj after the Romanian champions beat nine-man Rennes 1-0 in France.\n\nBoth sides struggled to create chances early on with Christie firing the first warning shot with a fiercely struck effort that came back off the outside of the post.\n\nHowever, one piece of slack defending cost Celtic as Joaquin Correa freed Lazzari down the right and the Italian international's shot had too much power for Fraser Forster.\n\nThe on-loan Southampton goalkeeper may have been at fault, but more than made up for that error in a frantic finale.\n\nCorrea should have put Lazio out of sight when he burst through on goal but hit the base of the post to give Celtic life and they took full advantage two minutes later.\n\nEdouard and Christie combined once more and this time the Scottish international's strike had the power and accuracy to beat Thomas Strakosha.\n\nLazio seemed the side more likely to take all three points in the latter stages as Forster redeemed himself with a brilliant save from Marco Parolo at point-blank range.\n\nSimone Inzaghi then sent on Serie A's top scorer Ciro Immobile for the final 17 minutes and he also missed a huge chance before Celtic took the lead when Julien rose unmarked to head home Christie's corner.\n\nThere was still time for another twist when Danilo Cataldi's sweetly struck volley arrowed towards the top corner five minutes into stoppage time, but Forster made another stunning save as Celtic held on.", "description": "Christopher Julien's header a minute from time handed Celtic a vital 2-1 victory over Lazio as the Scottish champions took a huge step towards the last 32 of the Europa League.  The Italians took the lead five minutes before half-time when Manuel Lazzari fired in from a narrow angle.  Celtic levelled", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/ifjqTuPSoctwEDNrZpv1Kw--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_sg/News/AFP/ec825d5004fbcbce8aca2d48a84f520240af771c.jpg", "published_at": "2019-10-24"}