{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7600473/Cody-Simpson-defends-girlfriend-Miley-Cyrus-against-furious-LGBTQ-backlash-gay-comments.html", "downloaded_at": "2019-10-22 14:04:18.774498+00:00", "title": "Cody Simpson defends girlfriend Miley Cyrus against furious LGBTQ backlash over gay comments", "language": "en", "text": "Cody Simpson has defended his new girlfriend Miley Cyrus as she faces backlash from the LGBT community after telling her fans in an Instagram Live chat that 'you don't have to be gay.'\n\nThe 22-year-old singer appeared on Australia's The Project program on Tuesday night and was asked to clarify Miley's comments.\n\nCody, who also appeared in Instagram Live video, was played a clip of the controversial 'gay' comments by the show's hosts.\n\n'I think people took that the wrong way': Appearing on Australia's The Project program on Tuesday, Cody Simpson (right) defended his new girlfriend Miley Cyrus (left) against furious LGBTQ backlash after she told fans 'you don't have to be gay'\n\nWearing a serious expression, he said in response: 'Yeah she.... people took that the wrong way I think.'\n\nHost Carrie Bickmore then said that Miley had since clarified her comments, with the American star stating in part, 'you don't choose your sexuality' in a new Tweet.\n\nCarrie then went on to ask Cody: 'Have you had a chance to talk to her [Miley] today?'\n\nThe 22-year-old singer appeared on Australia's The Project program on Tuesday night (pictured) and was asked to clarify Miley's comments. Wearing a serious expression, he said in response: 'Yeah she.... people took that the wrong way I think'\n\nThe Australian singer added: 'Absolutely you don't choose who you fall for or who you love, whatever gender or who you are'\n\nCody did not answer that part of the question, and did not reveal if he'd spoken to Miley about the issue, but he did back up her apologetic Twitter statement.\n\nHe said: 'Absolutely you don't choose who you fall for or who you love, whatever gender or who you are'.\n\nThe young singer added of Miley: 'But no, she's wonderful. So...' before trailing off, with the show's hosts moving onto another topic.\n\nDefence: Miley has faced backlash from the LGBT community after telling her fans in an Instagram Live chat on Sunday night that 'you don't have to be gay'\n\nBacktracking: The singer, who came out as bisexual four years ago, defended herself on Twitter on Monday, after the comments attracted criticism\n\nMiley, who came out as bisexual four years ago, defended herself after the comment attracted criticism during the social media talk on Sunday night.\n\nAttempting some damage control, a repentant Miley later clarified her controversial comments in a tweet posting Monday, but she couldn't resist making another comment about her 'sucky' exes.\n\n'I was talking s**t about sucky guys, but let me be clear, YOU don't CHOOSE your sexuality,' she tweeted. 'You are born as you are. It has always been my priority to protect the LGBTQ community I am a part of'.\n\nComments: Addressing her 100 million followers on Instagram Live, the singer implied she was gay because she thought 'all men were evil' and 'gave up' on finding a good one\n\nOn the chat: The couple took part in the split-screen Instagram Live session, with Miley at her Los Angeles home and Cody at a hotel in Sydney, where he has flown out for work\n\nHer backtracking came after she used Instagram to take a swipe at her estranged husband Liam Hemsworth on Sunday evening.\n\nAddressing her 100 million followers, the 26-year-old singer implied she was gay because she thought 'all men were evil' and 'gave up' on finding a good one.\n\nShe mused: 'There are good men out there, guys, don't give up. You don't have to be gay, there are good people with d**ks out there, you've just got to find them. You've got to find a d**k that's not a d**k, you know.\n\nLoved up: The pop singer debuted her romance with Cody on October 4, just two months after announcing her separation from Liam in August\n\n'I always thought I had to be gay, because I thought all guys were evil, but it's not true. There are good people out there that just happen to have d**ks. I've only ever met one, and he's on this live,' she said referring to new beau Cody Simpson who appeared on the Live with her.\n\nThe pop singer debuted her romance with Cody on October 4, just two months after announcing her separation from Liam in August.\n\nThe couple took part in the split-screen Instagram Live session, with Miley at her Los Angeles home and Cody at a hotel in Sydney, where he has flown out for work on the Masked Singer Australia and promotional duties.", "description": "Cody Simpson has defended his new girlfriend Miley Cyrus as she faces backlash from the LGBT community after telling her fans in an Instagram Live chat that 'you don't have to be gay.'", "authors": ["Marta Jary For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/14/20036832-0-image-a-72_1571750902976.jpg", "published_at": "2019-10-22"}