{"pub": "atlantic", "title": "The Hemingway Scene That Shows How Humanity Works", "url": "https://theatlantic.com/entertainment/archive/2019/08/tea-obreht-inland-interview-by-heart/597103", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:12:26.218499+00:00", "text": "As readers, we’ve been close to Santiago’s perspective for many pages, but in the book’s final moments we pull out and spend time with other people on the beach, including his fellow fishermen, who are measuring the carcass to estimate what the great fish must have been like. Later, we pull out even further to the tourists sitting on the boardwalk, overlooking the spine and tail of the now-decapitated fish:\n\n“What’s that?” [a woman] asked a waiter and pointed to the long backbone of the great fish that was now just garbage waiting to go out with the tide. “Tiburon,” the waiter said. “Eshark.” He was meaning to explain what had happened. “I didn’t know sharks had such handsome, beautifully formed tails.” “I didn’t either,” her male companion said. Up the road, in his shack, the old man was sleeping again. He was still sleeping on his face and the boy was sitting by him watching him. The old man was dreaming about the lions.\n\nThe book ends there. From a craft perspective, what strikes me most is the boldness of this kind of perspective shift so late in the game, when your reader has been accustomed to one lens for so long. There’s tremendous risk of creating a distancing effect. And yet somehow Hemingway manages to make the whole thing much more intimate. Because he shows you, in the briefest of maneuvers, the whole scope of how humanity works.\n\nBy the final lines, Santiago’s epic battle is already being misconstrued and misunderstood. And so, as the novella ends, you sense that Santiago’s story doesn’t have much of a future: It’s going to dissolve with the tide; it’s already being carried out to sea. That’s the fate of all life, and the fate of all stories. The truth of what really happened out there in the Gulf Stream belongs only to us, the readers, because we watched the old man’s struggle with his fish.\n\nBut in the end, even our memories don’t seem to matter. We’re left with an image that seems to transcend that epic battle: the lions on the beach, which Santiago dreams of as the story closes. Somehow, these lions he glimpsed as a boy capture the essence of his humanity. They remain, even when everything else has been eroded. Even the life-changing brutality of his experience at sea can’t change that.\n\nBy ending on that image, Hemingway suggests that what matters most is the preservation of a person’s sense of self—which only that person can know in life, and which a reader can know through the intimacy of fiction. To a degree, you get the whole story of the battle with the marlin in order to be able to come back to this image. It’s an utterly inactive moment—Santiago is asleep, after all—and yet it reveals what his soul is all about. The lions are the door into his personhood.\n\nOne of the things that has struck me as I get older is that as more and more information fills your brain, you have less control over what you remember. Your ability to access the things that remind you of you becomes less reliable. It would be wonderful to have complete recall of the moments I think should be most meaningful to me—some great moment in my family, or the instant I met my husband, or some fantastic exchange that I had with another writer. But those memories often fray, leaving only their essence. When people do remember specifics, the sharpest, most luminous details are often strange, or surprising. We all have our lion moments.", "description": "The novelist Téa Obreht describes how a single surprising image in The Old Man and the Sea sums up the main character's identity.", "authors": ["Joe Fassler"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/08/Obrecht_Thumb2/facebook.jpg?1567103272"}