{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/28/another-brexit-deal-fails", "downloaded_at": "2019-10-29 00:23:02.851208+00:00", "title": "Another Brexit deal fails", "language": "en", "text": "ANALYSIS/OPINION:\n\nNo one over here is surprised that the U.K. will not be leaving the European Union at the end of this week, but how humiliating it must be to have to now beg Brussels to stay in for longer — for the third time. What kind of government and Parliament does that?\n\nWell, this is a political class that, mostly, never wanted Brexit in the first place. Lucky for them that Brits are slow to anger.\n\nSo how did they get into this pitiful position?\n\nBack in June 2016, the Remainer establishment faced the painful but undeniable reality that the biggest voter turnout ever had just seen 52 percent of them — that’s 17.4 million people with a winning majority of 1,269,501 — vote to leave the European Union.\n\nTheir remedy was to redefine what these revolting peasants had voted for. They would begin arguing the referendum was not just about leaving, but about getting a new deal. Leaving the EU would now become contingent upon getting a deal, which they failed to agree on.\n\nYet, the ballot paper could not have been clearer. The only two voting options were: “Remain a member of the European Union” or “Leave the European Union.” Nowhere did it mention anything about leaving with or without a deal.\n\nBut, ever since, Remainer politicians and their media sycophants have pushed their claim that of course the public wanted a new deal with the EU. Voters must have assumed there would be one, or they would never have voted to leave in the first place … yada, yada.\n\nThis was a very clever piece of sophistry. By retrospectively inserting this spurious clause, Remainers have succeeded in spinning the process out for almost three-and-a-half years and there is no end in sight.\n\nDeep down Remainers believe Brexiteers should never have been allowed to vote in a referendum as they are too stupid to know all the facts — sounds familiar to you Trump voters?\n\nThe left always demeans and patronizes those they disagree with. Yet, the entire population was fully informed of the consequences in a robust campaign.\n\nDavid Cameron’s government even exceeded the legally-binding expenditure limit and sent out a last-minute, shamelessly partisan leaflet to every household, explaining why remaining in the EU would be best for the U.K.\n\nIt put its own position in bold print: “The Government believes it is in the best interests of the UK to remain in the EU. This is the way to protect jobs, provide security, and strengthen the U.K.’s economy for every family in this country – a clear path into the future, in contrast to the uncertainty of leaving.”\n\nThe pamphlet ended with a flat out lie, “The Government will implement what you decide.” Demanding that a deal is struck first has been the Remainers ultimate wrecking amendment.\n\nFar better would still be to leave the EU using World Trade Organization tariffs and then negotiate a genuine free trade agreement later, from a position of strength.\n\nJust imagine if this had been a national election and the party that won was told that before inauguration it had to first get its legislative program accepted by 27 neighboring nations that can also make changes. If not, then the previous administration remains in power.\n\nThis would be utter madness. I mean, what if the 27 asked for money — say $50 billion — and also imposed ongoing regulatory controls? Now, wait a minute … isn’t that exactly what both Brexit deals allowed them to do?\n\nSome Conservatives accused Theresa May’s deal of turning Great Britain and Northern Ireland into a vassal state, but those same people later voted for Boris Johnson’s deal, which contained most of the same features.\n\nThis was probably due to Brexit fatigue. “Leave” MPs in all parties had become so depressed by the lack of progress that they decided his deal was the last chance of the U.K. ever leaving the EU.\n\nBut, in accepting the notion that a deal is the prerequisite to leaving, Brexiteer MPs have become complicit in neutering the referendum result.\n\nHave no doubts, the Remainers are winning the Brexit struggle and there are no guarantees now that it will even happen. They have won every battle since losing the referendum.\n\nYet, despite their clever maneuvering, a general election will have to be called at some point and British citizens will finally get the chance to vote on their MP’s Brexit record.\n\nMeanwhile, a certain Nigel Farage and his merry band of Brexiteers have been keeping their electoral powder dry. They have even, magnanimously, offered to help Mr. Johnson win big.\n\nThe Conservatives have twice rejected that idea, but it is highly unlikely they can achieve a decent working majority without their help.\n\nSo, go on Boris, and no ifs or buts. Brexit depends on it.\n\n• Andrew Davies is a U.K.-based video producer and scriptwriter.\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "No one over here is surprised that the U.K. will not be leaving the European Union at the end of this week, but how humiliating it must be to have to now beg Brussels to stay in for longer -- for the third time. What kind of government and Parliament does that?", "authors": ["The Washington Times Http", "Andrew Davies"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/28/B1-DAVI-Brexit-Anvi_c1-0-1423-830_s1200x700.jpg?0355bc503674b9b4f26b3b6a02e27799bbc5ba32", "published_at": "2019-10-28"}