{"pub": "metro", "url": "https://metro.co.uk/2019/10/18/youll-soon-be-able-to-rent-a-malibu-barbie-dreamhouse-on-airbnb-10940488", "downloaded_at": "2019-10-18 10:37:50.332061+00:00", "title": "You’ll soon be able to rent a Malibu Barbie Dreamhouse on Airbnb", "language": "en", "text": "Come on Barbie, let’s go party (Picture: Airbnb)\n\nAirbnb will be turning childhood dreams into reality later this month, by offering the chance to stay inside a real-life Barbie Dreamhouse.\n\nTo mark the 60th anniversary of Barbie, Airbnb has teamed up with the iconic toy company to give a group of four the chance to stay in the life-size version of the Dreamhouse, for two nights.\n\nThe dollhouse-style mansion, located in the heart of Malibu, will be opening its pink and white doors for three days only – from 27-29 October.\n\nDoll enthusiasts will be able to book at 7pm on 23 October for just $60 per night – a price that pays homage to the landmark birthday.\n\nSoak up the pink and white decor (Picture: Airbnb)\n\nImagination, life is your creation (Picture: Airbnb)\n\nThe oceanfront villa (Picture: Airbnb)\n\nThe impressive three-story oceanfront villa has two bedrooms and comes with an infinity pool, outside dining area and – in true Barbie style – multiple walk in wardrobes, which feature outfits from the past six decades. So you can brush your hair and undress everywhere.\n\nAdvertisement\n\nAdvertisement\n\nTemporary residents will also find a movie theatre, sports court, DJ booth, meditation area and hobby studio.\n\nThe Malibu pad (Picture: Airbnb)\n\nRelax in the meditation area (Picture: Airbnb)\n\nTo make the luxury Barbie experience as authentic as possible, organisers have revealed that guests will also receive a cooking lesson with Gina Clarke-Helm of Malibu Seaside Chef, a behind-the-scenes tour of Columbia Memorial Space Centre and will be treated to a meet-and-greet with top hair stylist, Jen Atkin.\n\nFollowing the two-night extravaganza, the Malibu property will return to Airbnb without the Barbie-inspired decor.\n\nThe home rental platform will also be making a donation to The Barbie Dream Gap Project GoFundMe initiative, which provides resources to make things more equal for young girls, so they can ‘follow their dreams’.\n\nMORE: Milwaukee tops the list of the best travel destinations for 2020, according to Airbnb\n\nMORE: Couple turn up to luxury £10,000 Ibiza Airbnb apartment to find it doesn’t exist\n\nMORE: Airbnb is sending five people on a free month-long climate research trip to Antarctica\n\nAdvertisement Advertisement", "description": "The home rental platform has teamed up with the iconic toy company to offer the chance to stay in a life-size Barbie Dreamhouse.", "authors": ["Lizzie Thomson"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90432983_1571391213.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-18"}