{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/kalidou-koulibaly-responds-new-manchester-united-transfer-rumours-10894894", "downloaded_at": "2019-10-10 15:20:37.646667+00:00", "title": "Kalidou Koulibaly responds to new Man Utd transfer rumours", "language": "en", "text": "Kalidou Koulibaly has been linked with a move to Manchester United (NurPhoto/PA Images)\n\nKalidou Koulibaly insists he is fully focused on Napoli after being linked with a move to Manchester United.\n\nEarlier this week reports claimed that the Senegal international will be one of United’s priority signings next summer along with West Ham midfielder Declan Rice.\n\nBut Koulibaly is keen to play down talk of a potential switch to Old Trafford.\n\n‘I’m used to it. So many [stories] come out each day, which say I’m leaving,’ said Koulibaly.\n\n‘Right now, my only objective is to win with Napoli. I don’t care about the rest.\n\nKoulibaly is reportedly one of Manchester United’s top targets for next summer (NurPhoto/PA Images)\n\n‘Our objective remains to beat the best teams in Italy and win the title.\n\nThis season is more difficult because all the teams have got stronger and Serie A has become more competitive.\n\nAdvertisement\n\nAdvertisement\n\n‘I haven’t made the best start to the season. Juventus remain the team to beat.\n\nFor our part, we must work even harder, improving our game to get closer to them.\n\n‘Our objective is to qualify for the Champions League knockout stage as soon as possible.\n\n‘We started well by beating Liverpool with a top performance. We regret not beating Genk, but that’s football.\n\n‘We must think positively and be aware that we can do well. My objective is to help the club and team win a trophy now.’", "description": "Kalidou Koulibaly insists he is fully focused on Napoli after being linked with a move to Manchester United. Earlier this week reports claimed that the Senegal international will be one...", "authors": ["Metro Sport Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_86941738_1570706966.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-10"}