{"pub": "yahoo", "url": "https://news.yahoo.com/hiker-digs-1-000-old-144900723.html", "downloaded_at": "2019-10-16 04:01:24.491572+00:00", "title": "Hiker Digs Up 1,000-Year-Old Iron Weapon", "language": "en", "text": "From Popular Mechanics\n\nA Norwegian hiker uncovered an ancient arrowhead.\n\nDiscoveries like these are uncommon in Norway, where harsh winters have either hidden away or destroyed many artifacts.\n\nSome archaeologists credit climate change for the discovery.\n\nA hiker traversing mountainous Norway made an astonishing find by chance: a 4.6-inch arrowhead that possibly dates back 1,000 years to the Iron Age. Hordaland County, home of the Store Ishaug mountain where the blade was uncovered, announced the discovery.\n\nA local man named Ernst Hagen dug up the blade near his cabin. \"In the nice weather in mid-September I went for a walk and discovered with one arrow point just beside a snowflake,\" he said on the county's website. \"I immediately realized that it was something special, something even before they used rifles.\"\n\nPhoto credit: HORDALAND COUNTY MUNICIPALITY More\n\nStore Ishaug, which has an elevation of 4,869 feet, isn't a typical hot spot for ancient artifacts. However, local experts point toward an unlikely source responsible for the discovery: climate change.\n\n\"This is an unusual finding and a bit of a hit,\" archaeologist Tore Slinning told Hordaland's site. \"It's like finding the needles in the haystack. Fundamental climate change melts and forms, and such discoveries may emerge. This arrowhead would have been covered by snow in the winter if it had not been found.\"\n\nThe arrowhead is made out of iron, while the wooden arrow that once held it has long dissolved. It's something of a surprise that the arrowhead itself was able to last so long in the harsh environment.\n\n\"In soil, everything is rotten,\" Slinning said. \"The arrow may have been rotten for a long time if it was in soil. If the doctor has encased in snow and ice, it may have rot in recent times when the snow has melted. Those who are in the close proximity of the foundations and glaciers that melt should look for such ancient finds.\"\n\nOf course, there are many concerns about glaciers melting, which could increase due to manmade climate change. Recently, scientists held a funeral service for an Icelandic glacier that melted and lost its status as such.\n\nYou Might Also Like", "description": "Climate change melted away the ancient arrowhead.", "authors": ["David Grossman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ZJAWwyE1EaZXR5tHu4pCKQ--~B/aD00MDA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/popular_mechanics_642/e244af827e8b2dab1a64b8cba44fa624", "published_at": "2019-10-15"}