{"pub": "foxbusiness", "url": "https://foxbusiness.com/features/roll-with-the-tide-alabama-and-not-clemson-best-historic-bet-to-win-championship", "downloaded_at": "2019-09-08 12:53:28.829962+00:00", "title": "Alabama or Clemson: Roll with the Tide, or not?", "language": "en", "text": "Betting the top college football team in the nation to win the national championship, at least this time of the year, may not be the wisest of picks if a dive into history is any indication.\n\nContinue Reading Below\n\nThat’s certainly bad news for Clemson, who won the No. 1 team in the Associated Press Preseason Poll and remain the top-ranked team in the nation heading into the second week of the season. Since 1998, the preseason top team in the AP Poll has won the national championship only 14.29 percent of the time, according to a study conducted by Brendan Meehan of SportsBetting3.\n\nThe best pick, according to Meehan, is second-ranked Alabama. He notes that the second-ranked team in the preseason poll has won the national championship one-third of the time since 1998. Only three teams ranked atop the preseason poll have won the national title since the study began. Alabama, in 2017, was the last team to start and end the year as the nation’s No. 1.\n\n“The No. 1 team's difficulty closing the deal and the No. 2 team's apparent advantage are most likely due to the poll's inaccurate performance assessment,” Meehan told FOX Business.\n\n“Teams ranked No. 2 or higher have won 47.62 percent of championships since 1998 … Poll members may be biased towards perennial powerhouses like Alabama, ignoring the potential of other likely contenders. That, and a team ranked No. 2, gets underdog status for the season. With the pressure off, lower-ranked teams can comfortably cruise to victory.”\n\nAdvertisement\n\nIronically, Alabama is ranked second this year, making the perennial national title contenders an underdog to Clemson.\n\nInterestingly enough, the fifth-ranked team in the preseason poll has won the national championship 14.29 percent of the time during this stretch, the same as the preseason No. 1. Big Ten program Ohio State was ranked fifth in this year’s AP preseason poll.\n\nGeorgia (No. 2) and Oklahoma (No. 4) rounded out the top five of the poll.\n\nOf course, there are always outliers. In 2010, preseason No. 22 Auburn won the national championship.", "description": "Clemson may have been the preseason favorite to be the national champion, but one study says that another team has a historic edge to be the best team in college football this year.", "authors": ["Kristian Dyer"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2017/11/0/0/CFP20NC202017.jpg?ve=1&tl=1", "published_at": "2019-09-06"}