{"pub": "cnn", "url": "https://cnn.com/2019/09/10/football/racism-in-football-tammy-abraham-chris-hughton-spt-intl/index.html", "downloaded_at": "2019-09-10 23:30:58.854450+00:00", "title": "How the scourge of racism continues to tarnish English football", "language": "en", "text": "(CNN) Joel Mannix shook hands with the club's chairman and watched as he immediately, instinctively, wiped his palm on his trousers.\n\nAs a black referee in England's football pyramid, Mannix says such incidents of discrimination towards minority officials are commonplace.\n\nSometimes these experiences can range from the mistaken assumption he's one of the opposition players to those that are more sinister.\n\n\"I was like: 'Wow!'\" Mannix recalls. \"2018, it's still happening. I looked at him while he was wiping his hand and he kind of stopped and didn't know what to do.\n\n\"I knew my hands were fresh, I'd just cleaned my hands. I knew there was no residue or dirt on my hands -- and then it was quite funny counting on his team six or seven black players. They're there to do a job, I wonder if you shake their hands as well.\"\n\n'Horror stories'\n\nFor a number of years, Mannix has received calls and messages every weekend from current or aspiring referees, seeking advice on everything from how to climb the ladder to how to deal with incidents of discrimination.\n\nCertain phone calls -- or \"horror stories,\" as he refers to them -- linger in his memory more than others. \"Some will be upset, some have been in tears,\" he says.\n\nOn one such occasion, a referee returned to his changing room after a match to find a player he had sent off had defecated on his clothes and destroyed his belongings.\n\n\"I'm just refereeing a game,\" he recalls the distraught official telling him. \"I'm just refereeing a game. I may have got it wrong, I may not have got it wrong, but is there any reason to act like that?\n\n\"He just said it was awful. Came in, saw it, reported it and then the secretary was like: 'Well how do we know it was him?' And the referee said: 'I haven't said who it was, all I've said is look what's happened.'\"\n\nMannix says the club secretary was entirely dismissive of the incident and left the referee to deal with it on its own.\n\nIncidents such as these, along with the hundreds of other messages he'd received, has prompted Mannix to create a support group for minority referees, with the first meeting scheduled to take place in October.\n\n\"This is what it's there for,\" says Mannix, referring to the official's case.\n\nRacism on the rise\n\nIncidents involving Raheem Sterling in the Premier League last season and Romelu Lukaku in Serie A recently only serve as ugly reminders that racism remains entrenched in the sport, but Mannix's experiences -- and those of the ethnic minority referees he mentors -- show its a disease that runs deep, even when the cameras are not there to pick it up.\n\nAccording to Kick It Out, a UK organization that works to tackle discrimination in professional and grassroots football, reports of discrimination rose by 32% in 2018/19 compared to the previous season.\n\nRacism remains the most common form of discrimination and has risen \"alarmingly,\" Kick It Out says, with reports increasing by 43%.\n\nThe advent of social media has provided racists with a way of targeting football stars seemingly with the safety of anonymity and far away from the public view of a stadium's CCTV.\n\nIn response to The Times' manifesto earlier this year on how to fight racism in football, England's Football Association (FA) called social media \"a common vehicle for racist and discriminatory abuse.\"\n\nOnly this season, Chelsea's Tammy Abraham and Manchester United's Paul Pogba and Marcus Rashford have been subjected to vile abuse on Twitter after missing penalties for their teams.\n\nTammy Abraham received racist abuse on social media after the Super Cup final.\n\nAbraham believes the organization needs to do more to protect players from the \"fake accounts\" that allow racists to abuse players behind the safety of anonymity.\n\n\"It just gives everyone an excuse to go online, behind their laptops, behind their phones, to say what they want,\" he told CNN on Monday. \"Some people might not think we see it, but we do see it -- and they just want to get reaction.\n\n\"So Twitter needs to understand that. They talk a lot about cyber bullying and in a way that is, that is bullying over social media.\n\n\"I think some people just don't think footballers are humans, that they have personalities. We are humans, we do see it and it does affect us. Now Twitter needs to do something about it.\"\n\nLast season, Kick It Out say it received 159 reports of discrimination from social media, with the most common form being racism at 62%.\n\nIn a thread last week, Twitter said it had taken action against more than 700 incidents of abuse related to British football and has met with the The Professional Footballers' Association (PFA) and Kick It Out.\n\nThe organization reemphasized the same statement when contacted by CNN.\n\nLack of representation\n\nDespite the fact that 25% of professional footballers in the UK are black and minority ethnic, this figure has never been mirrored in senior positions or positions of authority within the sport.\n\nJust four of the 92 managers (4.3%) in England's professional divisions are black, Asian and minority ethnic (BAME): Nuno Espirito Santo of Wolves, Nottingham Forest's Sabri Lamouchi, Doncaster's Darren Moore and Keith Curle of Northampton.\n\nBorn to an Irish mother and a Ghanaian father, Chris Hughton became the first mixed race player to represent the Republic of Ireland in 1979 and has gone on to coach three different sides in the Premier League during his managerial career.\n\nWolves boss Nuno Espirito Santo is one of just four BAME coaches in England's top four leagues.\n\nHe says stereotypes of black footballers in his era have deprived the sport of an entire generation of minority managers.\n\n\"The disappointing fact is that we haven't made that progress,\" Hughton told CNN. \"In particular in an era where it's been spoken about more than any other time.\n\n\"I came through an era where the perception of black individuals in football was good center forwards, good wingers, fast and strong but not really captain or management material.\n\n\"We lost a generation of really influential black players that we feel could have made very good managers and I think after that never allowed the game to have them as black role models and as managers for the next generation behind them.\"\n\nLast week, the FA began putting steps in place to address the issue at the top end of coaching in the country with a program designed to \"solve the challenge of under-representation.\"\n\nChris Powell, the former manager of Charlton and Huddersfield, was hired onto the coaching staff of England manager Gareth Southgate, while four other BAME coaches were brought in at various age group levels.\n\nHughton says he has seen first hand an improvement at the lower levels of English football, though that still hasn't been reflected at the top end of the game.\n\nFormer Brighton manager Chris Hughton says football lost an entire generation of black managers.\n\n\"If we speak about an enthusiasm for things to change, then the hard miles need to put in,\" he says. \"What I am seeing now is at grassroots level, academy level, there are far more coaches from black and ethnic backgrounds than ever before -- coaches perhaps more than managers.\n\n\"If we're particularly saying there hasn't been so much change at that level -- I think there has been at Under-18 and Under-23 level, which is good -- but of course the more visual change, which is at first team level, there hasn't been.\"\n\nReferees and the boardroom\n\nThe figures are no better when looking at BAME referees in the FA. As it stands, there aren't any black referees in England's top four divisions and, according to the organization, just 2,000 of 28,000 (7.1%) in the country's non-professional leagues.\n\n\"The FA recognises the value of a diverse group of referees and we continue to offer support and development opportunities for referees from all backgrounds and across all levels of the game,\" an FA spokesperson told CNN.\n\n\"The face of refereeing is continually changing and becoming a better representation of the football community. We continue to see a rise in the number of women and BAME referees in English football and we encourage people of all backgrounds to join the refereeing community.\"\n\nTo date, Uriah Rennie remains the only black referee to officiate in the Premier League and Mannix says his presence and success in the league did not have the trickle-down effect it perhaps should have.\n\n\"When Uriah was coming through, I don't believe there was [much of an impact],\" Mannix says. \"If it we were now, there would be a lot more because of social media but it was just Uriah Rennie who?\n\n\"Where did he come from? He was just there, but how did he get get there? No one had heard of him before, no one. It was just, there's Uriah Rennie but no one knew his struggle, how he got there or what he did.\n\nUriah Rennie remains the only black referee to have officiated in the Premier League.\n\n\"But he's a magistrate, he was a kickboxing champion and was the first black Premier League referee.\"\n\n'Rooney rule'\n\nBut the issue of under-representation doesn't just impact refereeing and coaching, it's also noticeable in senior business roles in football.\n\nAt the English Football League's (EFL) general meeting in June, it was announced that the 'Rooney rule' would be officially introduced after an 18-month trial period.\n\nNamed after NFL diversity committee chairman Dan Rooney, it requires clubs to interview at least one BAME candidate for vacant managerial or senior club operation positions.\n\nCurrently, less than 1% of senior roles involved in the running of football clubs are held by an individual of a black or minority ethnic background.\n\nOne of those is former England striker Les Ferdinand, who holds the position of Director of Football at former club Queens Park Rangers.\n\nLes Ferdinand alongside former QPR owner Tony Fernandes.\n\n\"I am in favor of whatever form the Rooney rule takes,\" Hughton says. \"I absolutely understand the critics of it, that feel it [hiring a BAME candidate] should be very much on merit -- but the rule is not giving an individual job.\n\n\"All the rule is doing is putting that individual in a position where he can at least go through an interview process. So that's the balance, and I suppose there is the argument that it could be used as a quota thing, that it's something that we have to do.\n\n\"But we're not really going to give them the job because of a regulation. For such a long period of time, we've looked for some change in the game and we've spoken about that enthusiasm for change in the game.\n\n\"I think what we have to accept is that by the authorities putting this rule in place, that is recognizing some way towards some change.\"", "description": "Joel Mannix shook hands with the club's chairman and watched as he immediately, instinctively, wiped his palm on his trousers.", "authors": ["Matias Grez", "Zayn Nabbi", "Darren Lewis"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190505153852-paul-pogba-manchester-united-super-tease.jpg", "published_at": "2019-09-10"}