{"pub": "yahoo", "url": "https://news.yahoo.com/1-britain-pledges-help-finance-094950418.html", "downloaded_at": "2019-10-28 10:01:01.198879+00:00", "title": "UPDATE 1-Britain pledges to help finance flourish after Brexit", "language": "en", "text": "(Adds more detail)\n\nLONDON, Oct 28 (Reuters) - Britain will do whatever it can to ensure that its financial sector remains a major global player after Brexit, financial services minister John Glen said on Monday.\n\n\"This government absolutely believes in the City,\" Glen told a conference in London, adding that revenues from finance were key to Britain's ability to fund healthcare, police and regional development. \"We will strain every sinew to help you flourish.\"\n\nFinancial firms in Britain lose unfettered direct access to investors in the bloc after Brexit and will instead have to rely on the EU's system of equivalence.\n\nUnder this system, Brussels grants market access if it deems that a foreign financial firm's home rules are strict enough to ensure that EU customers are well protected.\n\nGlen said that Britain stood ready to start negotiating equivalence \"in key areas\" with the EU as soon as Brexit has happened.\n\nBritain, however, does not want to be a permanent \"taker\" of EU rules to maintain financial market access and Glen said the issue was how to find a more \"enduring mechanism\" that recognises that changes in rules can occur on both sides.\n\n\"We have got to weigh the issue up very carefully,\" Glen said, adding it was difficult to know \"where it would land\" until equivalence negotiations with Brussels started.\n\nBritain needs to be able to set its own rules and Glen hinted that some of the EU's capital rules for insurers could be amended, given what he called \"pressure\" in Britain for changes.\n\n\"We need an agile and responsive regulatory approach,\" Glen said.\n\nFinancial services are more dependent than any other economic sector on being able to hire highly-skilled staff from across the world and Britain would introduce a post-Brexit immigration system that supported competitiveness, Glen said.\n\nBanks, insurers and asset managers in Britain have opened over 300 hubs in the EU to deal with whatever form Brexit takes. (Reporting by Huw Jones; Editing by Peter Graff and Alison Williams)", "description": "Britain will do whatever it can to ensure that its financial sector remains a major global player after Brexit, financial services minister John Glen said on Monday.  \"This government absolutely believes in the City,\" Glen told a conference in London, adding that revenues from finance were", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-28"}