{"pub": "vice", "url": "https://vice.com/en_asia/article/evjvke/tasmanian-farmer-jailed-smuggling-dangerous-garlic-into-australia", "downloaded_at": "2019-09-11 13:49:58.454285+00:00", "title": "Farmer Jailed for Smuggling ‘Outstandingly Dangerous’ Batches of Garlic into Australia", "language": "en", "text": "This article originally appeared on VICE Australia.\n\nA Tasmanian woman has been jailed for importing an “outstandingly dangerous” batch of garlic bulbs into Australia, marking them as “office supplies” in order to avoid detection. Former chairwoman of the Australian Garlic Industry Association, Letetia Anne Ware, will spend at least two months behind bars after pleading guilty to 10 charges including aggravated illegal importation of plant material, the ABC reports.\n\nThe 2000-plus bulbs she imported from Canada and the United States were of a variety of garlic known to potentially carry the invasive plant disease Xylella fastidiosa — listed as the biggest threat to Australian biosecurity. Agricultural consultant and former head of the Tasmanian Farmers and Graziers Association, Jan Davis, described it as “the plant equivalent of foot-and-mouth disease for animals” and declared that Letetia’s actions were “outrageous” and “outstandingly dangerous.\"\n\n\"If those garlic bulbils carried that disease, worst-case scenario it could have wiped out Tasmania's vineyards,” she said.\n\nThe Federal Minister for Agriculture, Bridget McKenzie, meanwhile suggested in a statement that Letitia’s smuggling enterprise showed \"a blatant disregard\" for Australia’s biosecurity laws and, in the event of an outbreak, could have impacted more than 350 Australian plant species.\n\n\"Any incursion would significantly impact Tasmania’s international reputation and market access as well as the incomes of farming families and regional communities,\" she said.\n\nWhile handing down the sentence this week, Justice Gregory Geason told Letitia that her \"conduct created risk to all agricultural activity\" and said a \"strong message\" must be sent \"to deter others from engaging in similar behaviour.\" Letitia reportedly instructed suppliers to misdeclare the contents of packages as \"office supplies\" when sending them to Australia, and to break up the quantities into amounts of less than 150 grams each so as to evade quarantine detection. In some cases she \"even chastised\" suppliers for failing to mislabel the packages as per her instructions, the court heard.\n\nIn addition to her sentence, Letitia was also fined $AU2,000 (US$1,370.66).\n\nThe Australian Garlic Industry Association attempted to distance itself from the scandal, stating on social media that it was unaware of Letitia's illegal activities and \"strongly condemns any behaviour that jeopardises biosecurity or the Australian agricultural industry.\" They accepted Letitia’s resignation as chairwoman.\n\nFollow Gavin on Twitter or Instagram", "description": "Thousands of garlic bulbs imported under the guise of 'office supplies' could have contained the single biggest threat to Australian biosecurity.", "authors": [], "top_image": "https://video-images.vice.com/articles/5d784f883a67f500084d67e3/lede/1568166447244-pjimage-2019-09-11T114713453.jpeg?crop=0.9486xw:0.9481xh;0.0493xw,0.0519xh&resize=1200:*", "published_at": "2019-09-11"}