{"pub": "cbs", "url": "https://secure-fly.cbsnews.com/news/impeachment-inquiry-tim-morrison-key-witness-in-ukraine-case-to-leave-white-house", "downloaded_at": "2019-10-30 23:18:59.411247+00:00", "title": "Key witness in Ukraine investigation leaving White House post", "language": "en", "text": "White House — A White House official who has emerged as a central witness in the Ukraine scandal is leaving his post, senior administration officials tell CBS News.\n\nTim Morrison, the senior director of European and Russian affairs at the National Security Council, is scheduled to testify before the House committees leading the impeachment inquiry on Thursday.\n\nMorrison's departure was first reported by NPR. An official said the departure has been in the works \"for some time\" and that he is leaving of his own accord.\n\n\"After more than a year of service at the National Security Council, Mr. Morrison has decided to pursue other opportunities — and has been considering doing so for some time,\" the official said. \"We wish him well.\"\n\nMorrison's testimony on Thursday is highly anticipated, as he was repeatedly mentioned by Bill Taylor, the top U.S. diplomat in Kiev, during a closed-door interview with the committees last week.\n\nTaylor wrote in his opening statement that he was prepared to resign by mid-August over a delay in U.S. aid to Ukraine. The committees are investigating whether the administration withheld the aid to pressure Ukraine to investigate a company that had employed former Vice President Joe Biden's son, as well as conspiracy theories about the 2016 election.\n\nTaylor said Morrison told him the president \"doesn't want to provide any assistance at all,\" which Taylor found \"extremely troubling.\"\n\nTaylor also testified that Morrison told him that Gordon Sondland, the E.U. ambassador, had told an aide to Ukrainian President Volodymyr Zelensky that the military assistance funds would not be released until Zelensky committed to investigating Burisma, an energy company that employed Hunter Biden.\n\n\"This was the first time I had heard that the security assistance — not just the White House meeting — was conditioned on the investigations,\" Taylor wrote.\n\nLawmakers on the committees are likely to ask Morrison about Taylor's testimony, and see how information provided by Morrison corresponds with Taylor's statement.\n\nBen Tracy, Olivia Gazis and Weijia Jiang contributed reporting.", "description": "Tim Morrison is scheduled to testify before the House committees leading the impeachment inquiry on Thursday", "authors": ["Grace Segers", "Grace Segers Is A Politics Reporter For Cbs News Digital."], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/30/68f02355-5d4c-4933-88a0-1c6d21ef1225/thumbnail/1200x630g1/caf7dea737baf348faa12e442d488bb1/screen-shot-2019-10-30-at-5-59-14-pm.png", "published_at": "2019-10-30"}