{"pub": "fox", "url": "https://foxnews.com/sports/munoz-wins-sanderson-farms-in-playoff-for-1st-pga-tour-title", "downloaded_at": "2019-09-23 10:34:32.369091+00:00", "title": "Munoz wins Sanderson Farms in playoff for 1st PGA Tour title", "language": "en", "text": "Sebastian Munoz of Colombia didn't think he was good enough for the PGA Tour unless he watched Carlos Ortiz of Mexico, his teammate at North Texas, reach the big leagues. He wasn't sure he was good enough to win until watching Joaquin Niemann of Chile win last week.\n\nMunoz was on his own late Sunday afternoon in the Sanderson Farms Championship, and he delivered all the right shots.\n\nDown to his last stroke, Munoz holed a 15-foot birdie putt for a 2-under 70 to force a playoff with Sungjae Im. And in the playoff, he let Im make the more crucial mistake. Munoz hit a chip-and-run to just under 4 feet and made the par for his first PGA Tour victory.\n\n\"Jaco's win gave me the belief I needed, the little extra belief I'm good enough, I'm here,\" Munoz said.\n\nIt was the first time in tour history that players from different South American countries won in successive weeks. Camilo Villegas of Colombia won the final two events of the FedEx Cup playoffs in 2008.\n\nMunoz not only has a two-year exemption, he will start next year on Maui at the Sentry Tournament of Champions, compete at The Players Championship for the first time and then head to Augusta National for the Masters.\n\nHe knew everything that was at stake. He just tried to forget about it when he reached the 18th green knowing he needed birdie.\n\n\"I was lucky enough to keep my focus on 18,\" Munoz said. \"I was just thinking about striking it, not on the perks. Not on how it could change my life.\"\n\nNiemann won by six shots at the Greenbrier. Munoz had it far more difficult.\n\nHe was among four players in the mix over the back nine at the Country Club of Jackson, and it looked as though the 21-year-old Im would snatch his first victory when he made a 12-foot birdie putt on the par-5 14th, got up-and-down from a bunker on the reachable 15th for birdie, and made it three straight birdies with a 12-foot putt.\n\nHe closed with a 66, and that looked like it might be enough.\n\nByeong Hun An made consecutive bogeys to fall out of the mix. Ortiz, who played with Munoz in the final group, couldn't get a putt to fall.\n\nMunoz lost two good scoring opportunities with a drive well right of the fairway on the 14th, and then flubbing a lob shot left of the 15th green that went into the bunker, leading to bogey. Down to his last hole, he played it to perfection with a big drive, an approach to 15 feet below the hole and the most important putt of his young career.\n\nThe 26-year-old from Bogota, who played his college golf at North Texas, poured in the birdie putt to join Im at 18-under 270.\n\n\"We just decided on a line, keep it as simple as we can and just strike the putt,\" Munoz said.\n\nThe playoff on the 18th hole wasn't as clean.\n\nIm went left into the Bermuda rough and caught a flier, sending the ball well over the green against the grandstand. Munoz was in the right rough and, expecting the ball to come out hot, he abbreviated his swing and it came out some 30 yards short. His chip-and-run rolled out to just under 4 feet. Im did well to pitch out of rough to just over 6 feet by the hole, but his par putt didn't even touch the cup and he started walking soon after he hit it.\n\nMunoz rolled in the par putt and the celebration was on.\n\n\"I'm speechless,\" he said.\n\nThis is the first time since the tournament began in 1986 that it was not held the same week as another PGA Tour event with a stronger field. That means it gets full FedEx Cup points, and Munoz earned a spot in the Masters for the first time.\n\nIm, voted PGA Tour rookie of the year last season for reaching the Tour Championship, is still looking for his first win.\n\nAn wound up alone in third with a birdie on the final hole for a 69, while Ortiz had to settle for a 71 and a tie for fourth with Kevin Streelman (64).\n\nThe playoff ended a peculiar streak of 38 consecutive PGA Tour events that were decided in regulation, dating to Charles Howell III winning in a playoff at Sea Island at the end of last year.", "description": "Sebastian Munoz of Colombia didn't think he was good enough for the PGA Tour unless he watched Carlos Ortiz of Mexico, his teammate at North Texas, reach the big leagues. He wasn't sure he was good enough to win until watching Joaquin Niemann of Chile win last week.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/GOLF-Sebastian-Munoz.jpg", "published_at": "2019-09-23"}