{"pub": "npr", "url": "https://npr.org/sections/altlatino/2019/10/30/774439227/alt-latino-playlist-a-trap-corrido-new-music-from-a-cuban-pioneer-and-latin-jazz", "downloaded_at": "2019-10-30 23:18:52.756562+00:00", "title": "Alt.Latino Playlist: A Trap Corrido, New Music From A Cuban Pioneer and Latin Jazz", "language": "en", "text": "Alt.Latino Playlist: A Trap Corrido, New Music From A Cuban Pioneer and Latin Jazz\n\nEnlarge this image toggle caption Titina/Vistar/Courtesy of the Artist Titina/Vistar/Courtesy of the Artist\n\nListen to this playlist on Spotify or Apple Music.\n\nThe bountiful collaborations coming from Latin urban artists are not as random as they seem: a music industry insider tells me that a lot of thought goes into artistic compatibility. This week's latest collabo finds Puerto Rican trap star Bad Bunny donning a metaphorical cowboy hat for a go-around with Natanael Cano; he helps the Mexican regional star remix the acoustic guitar-driven corrido Cano released back in May. The other notable collaboration this week features Spain's Mala Rodriguez teaming up with rising rapper Guaynaa and Big Freedia.\n\nWe also want to call special attention to a new single from Cuban hip-hop pioneer X Alfonso, who is on an ambitions journey — Alfonso challenged himself to release one song per week ahead of his forthcoming full album in January. His latest song is an astounding addition to his first drop last week.\n\nNatanael Cano & Bad Bunny, \"Soy El Diablo (Remix)\"\n\nI yelled. 18-year-old Mexican singer Natanael Cano has been refining the formula for corrido tumbado infused with hip-hop and trap for a minute now, but this remix, featuring el conejo malo as the literal devil, was the co-sign \"Soy El Diablo\" needed to reach the world. And though the corrido is a new genre for Bad Bunny, the intensity and vindication of its narratives seem tailor-made for a flow like Benito's. Here he brings that same transgressive spirit: \"Esto es pa' toda mi raza, América es nuestra casa / Aunque pongan más alto el muro, comoquiera se traspasa.\" — Stefanie Fernández\n\nYouTube\n\nX Alfonso, \"Reflexión\"\n\nX (Equis) Alfonso has only released a handful of albums under his own name since 2000, but each one has been worth the wait.\n\nOne of the true visionaries of Cuban music, Alfonso came of age under the tutelage of his parents, Carlos Alfonso and Ele Valdés, who were members of the genre-breaking band Síntesis. His 2001 album, X-Moré, was a pioneering statement that cemented the compatibility of Cuban music and hip-hop. Along the way, Alfonso has explored Cuban folkloric music through the lens of his singular musical vocabulary.\n\n\"Reflexión\" is the second single from his forthcoming album, Inside, and it is a stunning musical and visual treat. As you would expect from a deep thinker like Alfonso, the song uses what he calls a \"fusion of poetry and hip-hop\" over a minimalist drum beat to call on people of consciousness to resist the corrupting influence of unbridled power.\n\nAlfonso's plan, by the way, is to release one single per week, then release the entire album in early 2020. He released \"Cambio\" last week. Stay tuned to this space for future releases. — Felix Contreras\n\nYouTube\n\nJuana Molina, \"Un Día Punk\"\n\nJuana Molina's genius is in her control. So when Molina and her band lost all control over their July 2018 set at Denmark's Roskilde Festival after their airline lost their gear, Molina improvised with a guitar, keyboard and drum kit. Out of that incident came the dark magic of Forfun, an EP that transmutes four of Molina's experimental, forested tracks into \"punk\" versions with an execution verging on the supernatural. Molina's 2008 album title track, \"Un Día,\" is almost unrecognizable in \"Un Día Punk,\" transformed by a kicking riff and suffused with the magic of hearing a song for the first time, again. — Stefanie Fernández\n\nYouTube\n\nRoberto Fonseca, \"Cadenas\"\n\nOne of Cuba's greatest exports are pianists — of all stripes and styles — and Roberto Fonseca perfectly fits that catch-all category. He has accompanied the legendary Cuban diva Omara Portuondo on stage (and at a 2010 Tiny Desk Concert) and has established himself among the young vanguard of musicians expanding our notions of Cuban music.\n\n\"Cadenas,\" from Fonseca's lastest album, Yesun, features Alt.Latino fave Danay Suárez, who lends her distinct mix of poetry and hip-hop flow to make the track unmistakably Cuban and undeniably Fonseca.\n\nYesun is a combination of acoustic and electric expression of Cuban music, featuring jazz sensibilities that help his music stand apart. From beginning to end, Yesun is a major statement on the state of Cuban music from Roberto Fonseca. \"Cardenas\" is only the tip of the iceberg. — Felix Contreras\n\nYouTube\n\nMala Rodríguez & Guaynaa feat. Big Freedia, \"Dame Bien\"\n\nMala Rodríguez has been teasing her next album (the first since 2013's Bruja) over the past year, with a handful of gems dropped every few months. \"Dame Bien\" is the first truly stellar collaboration we've seen so far — Mala's undeniable flow paired with this infectious perreo hits heavy. Featuring the raunch of \"Rebota\" rapper Guaynaa and the Queen of Bounce, Big Freedia, drawling a perfect \"lo siento, yo hablo con mi c*lo,\" \"Dame Bien\" is more than I could have asked for. — Stefanie Fernández\n\nYouTube\n\nSan Cha, \"Que Me Hiciste\"\n\nLos Angeles' San Cha has had a vision for her debut album, La Luz de la Esperanza, since she first watched telenovelas as a kid. It's become a common trope in Latinx media to reference this well-loved form, but San Cha's interpretation is uniquely inventive. \"Que Me Hiciste\" follows the story of Dolores, a housekeeper who falls in love with a charming, yet malicious, prince named Salvador. Dolores eventually meets an apparition named Esperanza who helps her escape this abusive relationship and embrace her freedom. \"Que Me Hiciste\" is a tormented, lovelorn excerpt that maxes out that high drama, luxuriating in the anticipation of grief. — Stefanie Fernández", "description": "Two head-turning collaborations dominate this week's playlist, but we also have a bit of Latin jazz and something new from Cuban hip-hop pioneer X Alfonso.", "authors": ["Felix Contreras", "Stefanie Fernández"], "top_image": "https://media.npr.org/assets/img/2019/10/29/x-alfonso-high-rez_wide-c446ad6fc4d329129fd1fc0fa71dd411c134bca9.jpg?s=1400", "published_at": "2019-10-30"}