{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/09/patient-zero-of-the-next-false-equivalence-epidemic/598573", "downloaded_at": "2019-09-22 23:11:01.506441+00:00", "title": "The Press Is Embracing False Equivalence—Again", "language": "en", "text": "These two specific failings of Clinton’s—with no connection in substance, but subsumed as “the email question”—will, in any historical reckoning, seem of the mundane, “every campaign has its problems” scale. I am aware of zero evidence, from anyone, that any of the private-server emails ever had a damaging impact on U.S. security or national interest. Every candidate has his or her flaws and mistakes; these were among hers. They could be handled by “normal” press means.\n\nBut because the instinct toward structural balance is so powerful in the press—and because several institutions, notably NPR and The New York Times, seem so hyperaware of the criticism they receive for having a “liberal bias”—much of the press presented things that were not similar as if they were. For instance, on the one hand, there were deals and donations that could “raise questions” about the Clinton Foundation and Hillary Clinton’s own business life. On the other hand, Donald Trump flat-out refused to release his tax returns or any honest information about his business deals, so the press and public could not get even to the “raise questions” stage.\n\nOn the merits, Donald Trump’s finances were a hundred times as suspicious as those of other candidates, and his statements about anything were a hundred times as likely to be false. But it went against the nature of most news organizations to run a hundred times as many articles about his lies and shadiness as his opponents’. Or even twice as many. By the time of the general election, it seemed “fairest” and most comfortable to aim for something more like 50-50.\n\nWhen it came to Hillary Clinton, the clearest manifestation of that was vast over-coverage of “her emails,” most famously exemplified in this front page of The New York Times, 10 days before the election:\n\nJames Comey, when big-footing his way into the final stage of the election, expected that Hillary Clinton was on her way to victory. No doubt the Times’s editors must have thought the same, and that they were showing their tough-mindedness about her. But the result is what people mean by “false equivalence.” Two things that were different—the weaknesses of each candidate—were presented as if they were similar.\n\nAs an Atlantic colleague puts it: Journalism is hard; criticizing journalism is easy. In this business we’re all doing our best, and we all make mistakes in real time. But the very difficulty of these calls is why it’s worth noting a similar, as-if-we’d-learned-nothing-from-2016 case of false equivalence, which is unfolding before our eyes. This is “the Ukraine problem.”", "description": "Coverage of the president’s pressure on Ukraine suggests the media learned nothing from 2016.", "authors": ["James Fallows", "National Correspondent At"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTX2T7IJ/facebook.jpg?1569127648", "published_at": "2019-09-22"}