{"pub": "businessinsider", "url": "https://businesstimes.com.sg/companies-markets/singapores-most-active-construction-stocks-hold-firm-with-11-ytd-return-sgx", "downloaded_at": "2019-10-15 09:43:09.839004+00:00", "title": "Singapore's most active construction stocks hold firm with 11% YTD return: SGX", "language": "en", "text": "THE 10 most actively traded stocks with a construction focus on the Singapore bourse generated an average total return of 11 per cent in the year till Oct 11, amid growth in the sector.\n\nThis is also in line with the 11 per cent average total return for the five largest listed Singapore-focused real estate developers in the 2019 year to date (YTD), the Singapore Exchange (SGX) said on Tuesday.\n\nWith a combined market value of S$2.1 billion, the 10 construction stocks were ranked by the highest trading turnovers in the first nine months of 2019.\n\nThey include Chip Eng Seng, which was among the 100 most active stocks by turnover on the SGX in the nine-month period, as well as Lian Beng Group and KSH Holdings which were in the top 200.\n\nsentifi.com Market voices on:\n\nPan-United Corporation (PanU) was the best performer among the 10 stocks, bringing a 42 per cent total return in 2019 YTD, rebounding from a 43 per cent drop in return in 2018 when it was the second-worst performer out of the 10.\n\nSGX noted that PanU recorded a net attributable profit of S$9.1 million from continuing business for its half-year ended June 30, up from S$600,000 a year ago. The concrete and logistics-focused technology group posted a 16 per cent year on year increase in revenue from its concrete and cement business on stronger sales volume growth and higher selling prices of ready-mix concrete in Singapore.\n\nOf the 10 construction stocks, four saw net institutional inflows in the first nine months of 2019: International Cement Group, Lum Chang Holdings, Lian Beng and Hock Lian Seng Holdings.\n\nThe 10 also averaged a 4 per cent indicative dividend yield. The stock with the highest indicative yield is Chip Eng Seng at 6 per cent, based on its annual S$0.04 per share dividend distributed in May and its closing share price of S$0.625 on Friday.\n\nMeanwhile, Boustead Projects, Chip Eng Seng and Lian Beng maintained the lowest 12-month volatility among the 10 stocks.\n\nThe average 11 per cent total return of the 10 stocks in 2019 YTD is in contrast to the 28 per cent decline in their average total returns in 2018 and after the 43 per cent gain in 2017.\n\nThese trends were likewise observed across the world and region, SGX noted. Of the approximate 3000 stocks in the Asia-Pacific that involved in both real estate development and construction, their YTD median total return was a one per cent decline, following a 20 per cent decline in 2018 and a median total return of 7 per cent in 2017, SGX added.\n\nIn Singapore, the construction sector has posted three straight quarters of growth, after 10 quarters of declines. Based on advance estimates for Q3 2019, the sector grew by 2.7 per cent year on year in July to September, extending Q1’s and Q2’s expansions of 2.8 per cent and 2.7 per cent respectively. This was supported by a pick-up in both public and private sector construction activities, according to the Ministry of Trade and Industry.\n\nMeanwhile, the Building and Construction Authority (BCA) also estimates the city-state’s construction demand – measured by the value of awarded contracts – to total around S$27-32 billion this year, comparable to the S$30.5 billion in 2018.\n\nKey ongoing or upcoming transportation construction projects in Singapore include MRT line extensions and new stations, the North-South Corridor expressway, Changi Airport Terminal 5, and the Tuas Mega Port.", "description": ": THE BUSINESS TIMES Companies & Markets - THE 10 most actively traded stocks with a construction focus on the Singapore bourse generated an average total return of 11 per cent in the year till Oct 11, amid growth in the sector. . Read more at The Business Times.", "authors": ["Fiona Lam"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-15"}