{"pub": "townhall", "url": "https://townhall.com/tipsheet/guybenson/2019/10/29/here-we-go-democrats-signal-new-public-phase-in-impeachment-inquiry-n2555512", "downloaded_at": "2019-10-29 23:56:31.200848+00:00", "title": "Here We Go: House Democrats Preparing for New, Public Phase of Impeachment Inquiry", "language": "en", "text": "Amid loud GOP complaints about the secrecy of the process, reports started to emerge last week that Democrats were shooting to commence the public phase of impeachment as soon as November. Lo and behold, late yesterday, House Speaker Nancy Pelosi revealed that she will finally call for a floor vote on the impeachment inquiry this Thursday, 'formalizing' the exercise in a way that Republicans have long demanded:\n\nHouse Speaker Nancy Pelosi has revealed that Democrats are moving forward on a vote on impeachment procedures against President Trump on Thursday. \"This week, we will bring a resolution to the Floor that affirms the ongoing, existing investigation that is currently being conducted by our committees as part of this impeachment inquiry, including all requests for documents, subpoenas for records and testimony, and any other investigative steps previously taken or to be taken as part of this investigation,\" Pelosi said in a statement on Monday.\n\nThe GOP's 'too little, too late' rejoinder doesn't seem to have much mileage in it, but that's the placeholder for now. Republicans understandably wanted an impeachment inquiry vote, and now they're finally getting one. They can argue that it was delayed too long, but I'm not sure how compelling of an argument that will be moving forward. It won't even be a process complaint anymore; it'll be a past process complaint. And the 'secrecy' talking point -- which has also been largely fair, if somewhat overblown -- appears to be on the brink of expiring, too. Once witnesses are called in public, with cameras rolling, voters will be able to see the testimony and evidence for themselves. Adam Schiff has slanted the coverage with targeted and limited leaks thus far; those machinations will hit a dead end once the (apparently) forthcoming public hearings are underway, with full Republican participation.\n\nAmong the interesting elements of Pelosi's decision is the fact that a federal judge just recently ruled that a full House vote wasn't legally necessary for the exercise to be constitutionally valid, though she may have been concerned that the ruling wouldn't hold up on appeal. Also, as Allahpundit points out, Democrats appear to be setting the stage to treat any future lack of cooperation from the administration (with the thin reed of 'no formal vote' objections snapped) as de facto evidence of a cover-up, as opposed to fighting them tooth and nail in court:\n\nPer the NYT, the reason Pelosi stressed in her letter that the administration has no power amid a formal impeachment inquiry to withhold evidence isn’t because she’s planning to fight Trump in court on that point, it’s because she isn’t planning to. “House Democrats will forgo using the federal courts to try to compel testimony from recalcitrant witnesses in their impeachment inquiry,” says the Times, and will “instead use the lack of cooperation to bolster their case that President Trump has abused his office and obstructed Congress’s investigation.” Pelosi isn’t going to sue Trump over this, in other words, she’s going to add obstruction of justice to the articles of impeachment and force Senate Republicans to vote on that. If nothing else, impeaching Trump for blocking evidence instead of suing him over it will speed the process up.\n\nThere's also this detail, via Politico:\n\nOne of the more significant changes, described by three Democratic sources, would allow lawmakers and staff to question witnesses for longer than House rules typically allow. Under existing House rules, lawmakers typically get five minutes apiece to question witnesses, with Republican and Democratic members alternating. The resolution would permit each side a longer, uninterrupted round of questioning that can be divided up among lawmakers and staff — similar to the way witnesses have been questioned in closed-door depositions...One option being discussed is providing more time for legal counsel on the committee to question witnesses once the House begins to have open hearings. Many Democrats have said the only bright spot of the Lewandowski hearing was when a Democratic lawyer for the Judiciary Committee, Barry Berke, forced Lewandowski to admit episodes of dishonesty.\n\nBecause so many elected members are incapable of resisting the temptation to grandstand, or too dumb to formulate incisive questions, Democrats appear poised to designate lawyers to drill down with prosecutorial precision. Meanwhile, Republican Senators Susan Collins and Lisa Murkowski have announced that they won't co-sponsor Lindsey Graham's resolution blasting House Democrats over impeachment process complaints. Neither one defended Pelosi and Schiff's handling of matters thus far, with Murkowski explicitly criticizing it, but both said it wasn't the Senate's place to condemn the House for moving forward under the lower chamber's rules. Note that 50 of the 53 Senate Republicans have signed onto Graham's resolution at this point:\n\n50 Republican senators have now signed on to @LindseyGraham's impeachment resolution complaining about the House process, he announces.\n\n\n\nThe only three who haven't:\n\n\n\nSusan Collins\n\nLisa Murkowski\n\nMitt Romney — Sahil Kapur (@sahilkapur) October 25, 2019\n\n\n\nWill the resolution be altered or pulled, given House Democrats' change in approach? I wouldn't hold my breath. Finally, last evening, portions of sworn testimony from another witness was made public; this time, it was a White House NSC staffer and decorated war hero who testified that he was disturbed in real time by President Trump's requests of the Ukrainian leader, confirming that quid pro quo's were placed onto the negotiating table. He had a front row seat to what went down:\n\n9/ The NSC's Fiona \"Hill then entered the room and asserted to Amb. Sondland that his statements were inappropriate. Following the debriefing meeting, I reported my concerns to the NSC’s lead counsel. Dr. Hill also reported the incident to the NSC’s lead counsel.\" — Jake Tapper (@jaketapper) October 29, 2019\n\n\n\nThis account buttresses Amb. Taylor's testimony, and suggests that Amb. Sondland may be in some hot water here. Rather than attacking Lt. Col. Vindman's integrity and honor (including baselessly insinuating that he is undermining Trump foreign policy on behalf of his birth country), Trump defenders should offer substantive defenses of the administration's actions...the dearth of which seems a bit telling. I'd add that despite having mounting evidence of sketchy dealings and apparent abuses of power, we have yet to see concrete proof of what I'd flat as a clearly impeachable offense: Erecting a quid pro quo under which Congressionally-approved military aid was withheld (we know this was the case for a period of time) until and unless a foreign government launched a public investigation into the incumbent American president's top domestic political challenger. I'll leave you with this:\n\nYes, it is absolutely unacceptable to use foreign powers to fabricate dirt on your political opponent to get a bad faith investigation going-\n\n\n\nAnd that’s why we must all hold Hillary Clinton, the DNC, Christopher Steele and their deep state allies accountable for their misdeeds — Buck Sexton (@BuckSexton) October 29, 2019\n\n\n\nAs we've been covering, that reckoning is also coming. We may be in for a very ugly few months.", "description": "Process..10/29/2019 19:52:26PM EST.", "authors": ["Guy Benson", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/269/cbdd4545-da47-4e1c-bf44-7886ee50587a.png", "published_at": "2019-10-29"}