{"pub": "independent", "url": "https://independent.co.uk/sport/football/live/real-madrid-club-brugge-live-stream-prediction-team-news-how-to-watch-champions-league-2019-a9128306.html", "downloaded_at": "2019-10-02 00:37:39.537970+00:00", "title": "Real Madrid vs Club Brugge LIVE: Stream, latest score and goal updates from the Champions League", "language": "en", "text": "Real Madrid rallied from two goals down to salvage a 2-2 home draw against Club Brugge on Tuesday, avoiding a second consecutive loss in the Champions League.\n\nYoung Nigerian forward Emmanuel Bonaventure scored two first-half goals for the Belgian club but Madrid recovered with headers by Sergio Ramos in the 55th and Casemiro in the 85th.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nCasemiro's header came from a free kick straight after Brugge went down to 10 men as captain Ruud Vormer was sent off for a second yellow card.\n\nMadrid stayed last in Group A, two points behind leader Paris Saint-Germain, which visits Galatasaray later Tuesday. Brugge, which has never advanced to the knockout round, has two points, one more than Galatasaray.\n\nPSG defeated Real Madrid 3-0 in the first round.\n\nAP\n\nHello and welcome along to live coverage of Real Madrid vs Club Brugge in the Champions League. Callum will be along shortly with all the build-up and team news as Zinedine Zidane's aim to bounce back from a 3-0 thrashing at the hands of Paris Saint-Germain in the opening round. Team News The Real Madrid starting XI is in! Team News Isco and Marcelo return for Real Madrid but are only fit enough to make the bench. There's a first start in two months for Luka Modric, though, back from injury. Gareth Bale is rested and not involved in the squad. And here's the Brugge team! Advertisement Real Madrid know the importance of a victory tonight. Their 3-0 defeat against Paris Saint-Germain in the opening game of Group A has left them playing catch up, and they can't afford any more slip ups. Club Brugge, meanwhile, will hope to frustrate Zinedine Zidane's side. The fans at the Bernabeu are notoriously impatient, and things might get edgy if the game doesn't go as planned for Real Madrid. Here's Dermot Corrigan's piece on the weekend's Madrid derby, which ended goalless: How Real and Atletico cancelled one another out in Madrid phoney war Eden Hazard has yet to really get going as a Real Madrid player. He starts again tonight, and has highlighted the importance of making an impact: \"I'm not a Galactico yet. I have to show that I can be one,\" said Hazard. \"We all know the history of the number seven shirt at this club and I want to show I can be the best in the world. I want to give my all, not just in matches but in training too. \"I can do better, I'm critical of myself as well, but working every day we will change things. \"Not everything is perfect but we're first in La Liga, we lost in Paris, maybe I was set back because of the injury but now I'm at 100% and hope to give my all in the coming games.\" Advertisement Zidane has backed Hazard to find his feet at the Bernabeu, too. \"I know he will triumph here but the important thing is to be calm and back him,\" said the Frenchman. \"I know how it works, I was worse when I arrived in Italy. There, I took three months [to hit form], at Madrid a bit less.\" Real Madrid last played Club Brugge way back in the 1976-77 season in the European Cup. And it was the Belgian side that came out on top, progressing to the quarter-finals with a 2-0 aggregate victory. Karim Benzema has enjoyed an excellent start to the season, scoring five goals in six La Liga appearances and reestablishing himself as Real Madrid's leading man. Advertisement The teams are out at the Bernabeu! Just a couple of minutes until kick-off now... KICK OFF Real Madrid, all in white, get us underway! Real Madrid 0-0 Club Brugge 3 minutes The hosts, as expected, are seeing most of the ball early on but Brugge look a capable side on the break. Tau very nearly races clear, but he's brought down on halfway and the chance of a counter attack is ended. Advertisement Real Madrid 0-0 Club Brugge 5 minutes Benzema finds space on the left and drives into the box. He spots the overlapping run of Nacho, feeding the ball into the path of the full back. His ball across is blocked behind for a corner, from which Benzema heads just wide. Real Madrid 0-0 Club Brugge 9 minutes Brugge have the ball in Real Madrid's net! But the flag is up. An impressive spell of possession from the visitors ends with a through ball into the path of Tau, who races in behind the Real Madrid defence and squares for Dennis. He miscontrols and watches as the ball rolls past Courtois and in. VAR will check it. GOAL! GOAL! Real Madrid 0-1 Club Brugge (Dennis) 11 minutes The goal is given! A long VAR check eventually leads to the conclusion that Dennis was onside. So Brugge lead at the Bernabeu, and now the pressure is really on the hosts. Real Madrid 0-1 Club Brugge 14 minutes There are already a few signs of discontent around the Bernabeu. As it stands, Real Madrid have no points from two games, with no goals scored and four conceded. Brugge look increasingly dangerous when they look to go in behind Real's high line too. Advertisement 1 2 3 4 Next\n\nPREVEW\n\nPrediction\n\nDefeat against PSG was a setback for Real Madrid, but they remain strong favourites to progress from this group. And they should have far too much for their visitors on Wednesday evening.\n\nLos Blancos have, according to Opta, won all three of their previous Champions League home games against Belgian opposition by an aggregate score of 14-2.\n\nThey will need to be wary of Brugge, though, who are currently unbeaten domestically and top of the Belgian first division.\n\nZinedine Zidane will hope his side’s improved defence – Real have not conceded in three games since the PSG loss – lays the foundation for an important victory.\n\nReal Madrid 2-0 Club Brugge\n\nWhen is it?\n\nKick-off at the Bernabeu is at 5:55pm on Tuesday October 1.\n\nHow can I watch it?\n\nThe match will be broadcast live on BT Sport, with coverage starting at 5:30pm.\n\nTeam News\n\nGareth Bale will be rested for the visit of Brugge, while Isco and Marcelo are expected to return to the squad following injuries.\n\nJames Rodriguez is likely to miss out with a knock, but there could be a first start since August for Luka Modric.\n\nThe visitors, meanwhile, will start with former Liverpool man Simon Mignolet in goal.\n\nPredicted Line-ups\n\nReal Madrid: Courtois; Carvajal, Varane, Ramos, Marcelo; Casemiro, Kroos, Modric; Lucas Vazquez, Benzema, Hazard\n\nClub Brugge: Mignolet, Mata Pedro Lourenco, Mitrovic, Deli, Rits, Diatta, Vormer, Vanaken, Ricca, Okereke, Dennis\n\nOdds\n\nReal Madrid 1/4\n\nDraw 5/1\n\nClub Brugge 9/1", "description": "Real Madrid rallied from two goals down to salvage a 2-2 home draw against Club Brugge on Tuesday, avoiding a second consecutive loss in the Champions League. Young Nigerian forward Emmanuel Bonaventure scored two first-half goals for the Belgian club but Madrid recovered with headers by Sergio Ramos in the 55th and Casemiro in the 85th. Casemiro's header came from a free", "authors": ["Callum Rice-Coates", "Lawrence Ostlere"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/01/19/Sergio-Ramos.jpg", "published_at": "2019-10-01"}