{"pub": "scmp", "url": "https://yp.scmp.com/go-to-gurus/advice/article/114550/dress-success-job-or-university-interview-tips-experts", "downloaded_at": "2019-10-25 16:14:14.605986+00:00", "title": "Dress for success for a job or university interview: tips from the experts", "language": "en", "text": "Dressing appropriately for an interview – whether for university or a job – is always a good idea. But what counts as “appropriate” can be confusing. And for girls, who typically have more options than the standard suit and tie, it might feel like there’s a higher risk of getting it wrong.\n\nTo help ease these fears, Young Post turned to the experts for some tips on dressing professionally.\n\nMay Chan, the founder of Spark Image Consultancy, explains that there is no fixed rule when it comes to dress codes – it all depends on the context, and the image you want to present.\n\nA guide to dressing appropriately - and stylishly - to formal events\n\n“For example, if you want to get into financial or professional services, formal dress is a must. But for marketing or creative industries, a full suit set isn’t necessary. Lots of companies are semi-formal or even smart casual,” she says.\n\nBut while suits aren’t the only way to look smart, owning at least one is a good idea, says Bernice Lee from The Etiquette and Leadership Institute.\n\n“For a student just entering the workplace, a suit is essential.” she says. “I would say it’s important to have no matter what, because if you have a job interview at somewhere more conservative, you’ll need to wear one.”\n\nFashionable and functional: explaining those misunderstood elements on your clothes\n\nBut something both Chan and Lee advise against is wearing a black suit and white shirt – it has a “fresh graduate” look that might make you seem inexperienced, and so is best avoided.\n\nA good rule of thumb is the darker the colour, the more formal the suit. Chan recommends opting for blue, tan or grey, while Lee adds that charcoal and navy work well too. She also points out that shirts are where you can add colour to your outfit, such as pale pinks and blues, or patterns such as checks and stripes. This allows you to inject a bit of personality into your clothes.\n\nWomen looking to venture away from suits will find structured dresses are a good alternative.\n\nHow to buy your first suit: an expert's guide\n\n“Like a suit, a one piece dress looks more continuous and professional,” says Chan. “It’s also easy to mix and match the two: if you want to look less formal, a dress alone is fine; to smarten it up, add a suit jacket.”\n\nLee also suggests pairing a skirt with a shirt or blouse and a blazer. “Knee length is best,” she notes.\n\nMeanwhile, Chan warns against buying clothes with overly bold designs or too many patterns. She explained that patterned items are more memorable, which means they would be harder to repeat without anyone noticing. “Simple and elegant is safer,” she said.\n\nRumble Box: ties vs bow ties\n\nChan adds that these kind of staple wardrobe items are good value for money as they can last for years – great for students looking to build their professional wardrobe on a budget.\n\nAs dress codes become less traditional, one thing you may not have to worry about any more is wearing a pair of tights. Chan and Lee say they’re still recommended for very formal occasions, but otherwise, it’s fine to ditch them.\n\nAnother contentious issue surrounding dress codes is whether it’s necessary to wear heels. Obviously, your comfort comes first, and most companies will not insist that you wear them. Garie Yau, a director at recruitment agency Adecco Hong Kong and Macau, says that formal shoes can include pumps, flats and heels, but not platforms or heels higher than two inches.\n\n8 items of clothing every guy needs; and one important tip\n\nAs for where to buy all these items, Chan recommends sticking to large chain stores, as they tend to have better return policies than smaller boutiques. She is also wary of online shopping, as you can’t try on anything before you buy, and it may be difficult to return things later.\n\nTaking a bit of time to learn these rules and figure out your own work style can help set you on the right path at an interview, internship or new job, helping you feel more confident and showing others that you care about your career.\n\n“How you present yourself and how you show your abilities are both important statements – but the first impression people get of you is visual,” says Chan. “So in addition to showing your skills, putting some effort into your image can help your career.”\n\nEdited by Charlotte Ames-Ettridge", "description": "Do you need a full suit? Should girls wear heels or flats? Figuring out what to wear can be a real headache, but we're here to help.", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/shutterstock_405678160.jpg", "published_at": "2019-10-25"}