{"pub": "dailybeast", "url": "https://thedailybeast.com/stephen-colbert-rips-trump-for-gaslighting-media-on-ukraine-call", "downloaded_at": "2019-10-03 07:12:51.070533+00:00", "published_at": "2019-10-03", "title": "Stephen Colbert Rips Trump for Gaslighting Media on Ukraine Call", "language": "en", "text": "During his Late Show monologue Wednesday night, Stephen Colbert went off on President Donald Trump for a press conference performance earlier in the day that was unusually unhinged, even for him.\n\nStanding next to the Finnish president, Trump once again defended his call with the Ukrainian leader as “perfect,” and as Colbert put it, “kept insisting” that “the document that proves he’s guilty doesn’t say what we all see that it says.”\n\nThe president told the press that the summary of the phone call released by his White House is an “exact transcript” when it is really nothing of the sort. “OK, let’s take a look at this exact transcript and see what the talented people wrote,” Colbert said, before revealing the first page, which states, “not a verbatim transcript of a discussion.”\n\n“Mr. President, is it possible that you can’t read?” Colbert asked, echoing a theory popularized by his former Daily Show colleague Samantha Bee. “Because I’ve got bad news for you, the American people can.”\n\nTrump went on to talk about “how hard this impeachment inquiry has been on him as a president,” Colbert added, “the most powerful victim in the world.” The president suggested that he only got “three days of peace” between the Mueller investigation and this current impeachment push, asking himself, “What did I do now?”\n\n“Well, it’s good to know even you can’t keep track of your crimes,” Colbert joked before lamenting the fact that Trump got “three days of peace” when he hasn’t “had a good night’s sleep since you were elected.”", "description": "“The Late Show” host labeled the president “the most powerful victim in the world.”", "authors": ["Matt Wilstein", "Senior Writer"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1438,w_2556,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1570083187/SC_wyxefy"}