{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7545557/Frustrated-Tottenham-players-feel-untrusted-overworked-underpaid.html", "downloaded_at": "2019-10-07 09:11:03.017017+00:00", "title": "Frustrated Tottenham stars 'feel untrusted, overworked and underpaid'", "language": "en", "text": "Tottenham's miserable start to the season continued with a 3-0 turnover at Brighton and players are reportedly starting to tire of Mauricio Pochettino's mood swings.\n\nA shell of the side that reached the Champions League final back in June, Tottenham have failed to win on the road since January 20, the worst record of anybody in the Premier League.\n\nThe Athletic report that the squad are feeling both untrusted to implement their game and also overworked and underpaid compared to many of their top six rivals.\n\nTottenham players feel overworked and underpaid, according to a revealing report on the side\n\nMauricio Pochettino is under the most pressure he has been under since taking on the job\n\n'The place is a regime and they're sick of him,' one dressing room source said in the report. 'It's his way or nothing, there is no balance. The players don't get the impression they are trusted at all.'\n\nChristian Eriksen pushed for a move away in the summer, only to fail to secure one. Jan Vertonghen is in the final year of his career and Danny Rose has spent multiple summers flirting with a Tottenham exit.\n\nThe report details how the players bemoan the 'same old sessions and messages' while another source went on to add 'the place is a regime' as results have faltered badly.\n\nTottenham's poor start to the season continued at Brighton and they now slump in ninth\n\nRESULTS THIS SEASON Tottenham 3-1 Aston Villa Man City 2-2 Tottenham Tottenham 0-1 Newcastle Arsenal 2-2 Tottenham Tottenham 4-0 Crystal Palace Olympiacos 2-2 Tottenham (Champions League) Leicester 2-1 Tottenham Colchester 0-0 Tottenham - Lost 4-3 on penalties (Carabao Cup) Tottenham 2-1 Southampton Tottenham 2-7 Bayern Munich (Champions League) Brighton 3-0 Tottenham All results from the Premier League unless stated otherwise\n\nTottenham are ninth after eight games, 13 points adrift of league leaders Liverpool, the side they lost to in the Champions League final in Madrid.\n\nForm has been particularly striking since the turn of the year with Crystal Palace and Leicester City earning more than Pochettino's side.\n\nDefeat to Brighton capped off a miserable week where they shipped 10 goals in two matches.\n\nA 7-2 demolition at home to Bayern Munich in the Champions League was followed up by a miserable performance against Brighton where teenage striker Aaron Connolly, making his first Premier League start, netted a brace.\n\nClub captain Hugo Lloris looks to have dislocated his elbow in the Brighton defeat and was left needing oxygen to ease the pain as he was stretchered off leaving Paulo Gazzaniga as the first choice goalkeeper for now.\n\nThe Athletic report goes on to detail how players, who feel 'underpaid', were left jealous when it emerged that chariman Daniel Levy earns an annual salary of £6million.\n\nHarry Kane, Dele Alli and Erik Lamela have all signed new contracts in recent months as the club look to secure their assets, having lost star full-back Kyle Walker to Manchester City back in 2017.\n\nTottenham chairman Daniel Levy's £6m annual salary is reported to have upset some players\n\nHeading into the international break in such poor form could prove a welcome distraction for Tottenham.\n\nUpon returning to domestic action, they take on rock-bottom Watford knowing a defeat will only intensify the pressure on Pochettino, with some critics suggesting the squad are at the end of their cycle under him.\n\nSportsmail revealed recently that some Tottenham players have started jokingly referring to Pochettino as 'Big Brother' due to the manager's habit of watching training sessions on the club's CCTV system.\n\nThe Argentine has become increasingly detached from his players at the start of this campaign and often stays inside to monitor training remotely, hence his new nickname.\n\nMood swings have also become a key talking point around Pochettino with reports that players are bemused by his 'up and down' moods.\n\nOne example used was that he was so angry following the defeat to Liverpool in Madrid, he opted to go to Barcelona, rather than travel back to London with his players.", "description": "Tottenham's miserable start to the season continued with a 3-0 turnover at Brighton and players are reportedly starting to tire of boss Mauricio Pochettino's mood swings.", "authors": ["Nathan Salt For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/09/19386356-0-image-a-4_1570437703212.jpg", "published_at": "2019-10-07"}