{"pub": "yahoo", "url": "https://finance.yahoo.com/news/makes-boston-private-financial-holdings-121441851.html", "downloaded_at": "2019-09-04 23:48:13.743182+00:00", "published_at": "2019-09-03", "title": "What Makes Boston Private Financial Holdings, Inc. (NASDAQ:BPFH) A Great Dividend Stock?", "language": "en", "text": "Is Boston Private Financial Holdings, Inc. (NASDAQ:BPFH) a good dividend stock? How can we tell? Dividend paying companies with growing earnings can be highly rewarding in the long term. On the other hand, investors have been known to buy a stock because of its yield, and then lose money if the company's dividend doesn't live up to expectations.\n\nA high yield and a long history of paying dividends is an appealing combination for Boston Private Financial Holdings. It would not be a surprise to discover that many investors buy it for the dividends. The company also bought back stock equivalent to around 2.1% of market capitalisation this year. Some simple research can reduce the risk of buying Boston Private Financial Holdings for its dividend - read on to learn more.\n\nExplore this interactive chart for our latest analysis on Boston Private Financial Holdings!\n\nNasdaqGS:BPFH Historical Dividend Yield, September 3rd 2019 More\n\nPayout ratios\n\nCompanies (usually) pay dividends out of their earnings. If a company is paying more than it earns, the dividend might have to be cut. So we need to form a view on if a company's dividend is sustainable, relative to its net profit after tax. In the last year, Boston Private Financial Holdings paid out 43% of its profit as dividends. A medium payout ratio strikes a good balance between paying dividends, and keeping enough back to invest in the business. One of the risks is that management reinvests the retained capital poorly instead of paying a higher dividend.\n\nRemember, you can always get a snapshot of Boston Private Financial Holdings's latest financial position, by checking our visualisation of its financial health.\n\nDividend Volatility\n\nFrom the perspective of an income investor who wants to earn dividends for many years, there is not much point buying a stock if its dividend is regularly cut or is not reliable. For the purpose of this article, we only scrutinise the last decade of Boston Private Financial Holdings's dividend payments. The dividend has been stable over the past 10 years, which is great. We think this could suggest some resilience to the business and its dividends. During the past ten-year period, the first annual payment was US$0.04 in 2009, compared to US$0.48 last year. Dividends per share have grown at approximately 28% per year over this time.\n\nWith rapid dividend growth and no notable cuts to the dividend over a lengthy period of time, we think this company has a lot going for it.\n\nDividend Growth Potential\n\nDividend payments have been consistent over the past few years, but we should always check if earnings per share (EPS) are growing, as this will help maintain the purchasing power of the dividend. It's good to see Boston Private Financial Holdings has been growing its earnings per share at 13% a year over the past 5 years. Earnings per share have been growing at a good rate, and the company is paying less than half its earnings as dividends. We generally think this is an attractive combination, as it permits further reinvestment in the business.\n\nConclusion\n\nDividend investors should always want to know if a) a company's dividends are affordable, b) if there is a track record of consistent payments, and c) if the dividend is capable of growing. We're glad to see Boston Private Financial Holdings has a low payout ratio, as this suggests earnings are being reinvested in the business. Second, it has a limited history of earnings per share growth, but at least the dividends have been relatively stable. Overall, we think there are a lot of positives to Boston Private Financial Holdings from a dividend perspective.\n\nStory continues", "description": "Is Boston Private Financial Holdings, Inc. (NASDAQ:BPFH) a good dividend stock? How can we tell? Dividend paying...", "authors": ["Simply Wall St"], "top_image": "https://s.yimg.com/uu/api/res/1.2/wc26NuJTrhupt8O7jeI0sw--~B/aD00MzI7dz0xMTk0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/simply_wall_st__316/30af439113bd92d0031862598a322bf1"}