{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/25/WS5db2b92ea310cf3e35573b00.html", "downloaded_at": "2019-10-25 16:12:32.597266+00:00", "title": "China's agriculture expands steadily", "language": "en", "text": "Xinhua | Updated: 2019-10-25 16:58\n\nVillagers dry corn in Zhangye, Gansu province, in September. [Photo by Wang Jiang/ For China Daily]\n\nBEIJING - China's agricultural sector expanded steadily during the first three quarters of the year, with a stable increase in farmers' incomes, an official said Friday.\n\nThe added value of the country's primary industry hit 4.3 trillion yuan (about $614.3 billion) during the period, up 2.9 percent year-on-year, Wei Baigang, an official with the Ministry of Agriculture and Rural Affairs, told a press conference.\n\nDisposable incomes of farmers jumped 6.4 percent year-on-year to 11,622 yuan. The growth rate was down from a 6.6-percent increase seen in the first half.\n\nRetail sales in rural areas gained 9 percent to 4.315 trillion yuan, contributing 16 percent to the country's consumption growth.\n\nGiven downward economic pressures and other factors, it's getting difficult to bring about a continuous increase in farmers' incomes, Wei said.\n\nThe ministry will adopt a slew of measures in the near future to sustain farmers' income growth, including offering more job opportunities and increasing investment in rural and agricultural infrastructure.\n\nSTABLE GRAIN OUTPUT\n\nChina's grain output is expected to reach over 650 billion kg for a fifth straight year in 2019, sustaining 16 consecutive years of a bumper harvest.\n\nThe country has intensified its efforts to expand soybean production to ensure stable supplies and reduce reliance on imports.\n\nTo this end, the central government provided over 17 billion yuan in subsidies for soybean growers in northeastern regions this year, up nearly 4 billion yuan from last year.\n\nSoybean acreage is expected to exceed 8.67 million hectares this year, up 666,667 hectares from a year earlier.\n\nPIG PRODUCTION RECOVERS\n\nPig production is likely to rebound by year-end and recover to normal levels next year, as pig herds are increasing month on month in many provinces, Wei said, adding that the output and sales of hog feed also picked up in September.\n\nThe output of poultry, beef and mutton all rose during the nine-month period, reaching 15.39 million metric tons, 4.58 million tons and 3.3 million tons, respectively, he said.\n\nIn the midst of an outbreak of African swine fever, data from the National Bureau of Statistics showed that the country's pork prices shot up nearly 70 percent year on year last month, driving overall consumer prices up 3 percent. China is currently the world's largest consumer of pork.", "description": "BEIJING - China's agricultural sector expanded steadily during the first three quarters of the year, with a stable increase in farmers' incomes, an official said Friday.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/25/5db2b92ea310cf3e97a2fece.png", "published_at": "2019-10-25"}