{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/philips-twin-turbostar-xxl-airfryer-review", "downloaded_at": "2019-10-03 07:48:10.140496+00:00", "published_at": "2019-10-01", "title": "I didn’t believe the hype around the Philips air fryer until I tried it myself — here’s why I’m a convert", "language": "en", "text": "A high-quality air fryer can be used to make a variety of dishes, cooks food efficiently without heating your house, and is easy to clean.\n\nI like the Philips Twin TurboStar XXL Airfryer because it has a spacious interior that holds up to 3 pounds or 4 quarts of food, cooks quickly, and is dishwasher safe.\n\nThough it's one of the most expensive air fryers on the market (currently $349.93 on Amazon), it comes with a full-color booklet and app with hundreds of recipes and is backed by a one-year limited warranty.\n\nIn 2010, Philips introduced the first air fryer at a consumer electronics fair in Berlin, Germany. Since then, the appliance has taken off with dozens of brands introducing different styles.\n\nI was hesitant to try the Philips air fryer for several reasons, including the price — it's one of the most expensive options. Yet after using the Twin TurboStar XXL dozens of times over the past two months, I can say unequivocally that it's the best air fryer on the market. Below, I will explore what makes it better than the competition.\n\nSpecs\n\nThe Twin TurboStar XXL lives up to the XXL in its name with a footprint of 12 inches wide, 17 inches deep, and 12 inches tall. It has an impressive temperature range of 175 to 400 degrees Fahrenheit, and you can adjust the temp in 25-degree increments using the dial on the front.\n\nThe dial lets you set the timer (between 1 and 60 minutes) and choose among presets, including defrost, chicken, steak, fish, and cake. And a large, LCD screen display shows you the temp and time remaining in the cooking process.\n\nThe air fryer comes with a beautiful recipe book complete with full-color photos. There are more than 30 recipes. Plus, you can access over 200 more by downloading the app.\n\nPhilips backs this air fryer with a one-year limited warranty.\n\nSet-up process\n\nThe set-up process was effortless. After removing the packaging, I washed the basket and pan with soap and water. I then let the air fryer run for a few minutes to warm up. Within 10 minutes of opening the box, I had potstickers baking. They came out pretty good, but I think I'll stick with the stovetop method. Despite being healthier, they were missing the steamed goodness. However, there were several other plates the air fryer knocked out of the park.\n\nWhat makes the Philips air fryer stand out\n\nWhat impresses me most about the Philips Twin TurboStar XXL Airfryer is that it combines size with fast cooking. The stated capacity of the air fryer is 3 pounds or 4 quarts of food, and in my experience, this is conservative. I had no problem fitting 3 pounds of chicken breasts in the basket without crowding.\n\nThere are three food items I test in all air fryers: toast, french fries, and boneless, skinless chicken breasts. The chicken breasts were safe to eat in 25 minutes, and they tasted juicy and delicious.\n\nTo test the french-fry capabilities, I cut up 2 pounds of yellow potatoes, tossed them with a tablespoon of olive oil and some seasoning, and put them in the air fryer. Every 10 minutes, I'd shake the basket up and see if they were done. The fries took a little less than 30 minutes, which is impressive compared to other models.\n\nThe toast was also quite fast by air fryer standards. In less than four minutes, the Twin TurboStar XXL evenly toasted a giant slice of my homemade bread.\n\nYou can also tell how well an air fryer bakes by how much heat it puts off. If the air fryer is emitting a lot of heat around the exterior, then it's heating your house and not cooking efficiently. The Philips air fryer stays cool to the touch everywhere except the back of the appliance, where it's incredibly hot.\n\nI've tested a dozen air fryers in the last year, and the recipe books always underestimate how long the dishes will take to cook. This is not the case with the Philips recipe book. I tried recipes for fries, drumsticks, and fish, and they were all accurate and scrumptious.\n\nI love that the parts of the air fryer that get the dirtiest — the basket, mesh bottom, \"fat reducer\" tray, and pan — are dishwasher safe. They cleaned up nice and tidy in my dishwasher, and I haven't noticed any wear from using this cleaning method.\n\nCons to consider\n\nI did have a little issue with the Twin TurboStar XXL releasing a fair amount of smoke while cooking. This likely had to do with me going a little overboard with the amount of olive oil I used for a recipe. After thoroughly cleaning the unit, the smoke problem went away. So, the moral of the story is to go light on the oil. I recommend picking up an oil mister.\n\nUnlike most air fryers, the Philips air fryer doesn't come with accessories, such as a rack or skewers. The company sells these separately. I didn't miss having accessories, but if you're paying $350 for a small appliance, you'd expect it to come with plenty of extras.\n\nThe bottom line\n\nFrom cooking family-size meals efficiently to cleaning up easily, the Philips Twin TurboStar XXL Airfryer hits all the right notes. But should you buy it? Are there more affordable and perfectly serviceable alternatives? Let's explore your options.\n\nShould you buy the Philips air fryer?\n\nEven though it's the best I've tested, $250 is a lot to spend on an air fryer. However, if you have the money and want to have the best, the Twin TurboStar XXL is the model to buy, especially if you want a unit that can cook larger quantities of food quickly. Due to its size, it may not be ideal for individuals with smaller kitchens, but it could be a good alternative if you don't have room for an oven.\n\nWhich model should you get?\n\nYou can save $50 off the price of the digital XXL by choosing the analog model. The only difference is you don't get the convenient digital interface. Instead, you set the appliance by manually adjusting the time and temperature dials.\n\nPhilips makes a few other air fryer models, including its XL Collection and compact solutions, but we don't feel they provide as strong of a balance of price and cooking abilities as the XXL air fryers. However, if you really want a Philips air fryer but want to limit your spending, consider the compact Philips Starfish Technology Airfryer, which only costs $150 and has a smaller footprint than the XXL.\n\nWhat are your alternatives?\n\nIf the Philips air fryer doesn't appeal to you, I've found the following to be excellent alternatives:\n\nSecura Extra Large Capacity Air Fryer ($70.95) : At less than a third of the price of the Twin TurboStar XXL, the Secura air fryer is a workhorse that can hold 4.2-quarts of food. The oven is 1,500 watts and cooks quickly. The controls are basic analog. Still, this is a terrific alternative if you want to see what air frying is all about but aren't ready to commit to a more expensive unit. You can read my full review here .\n\nChefman Rotisserie Programmable Air Roaster ($99) : One of the best-tasting and healthiest foods you can make in an air fryer is chicken. And the Chefman Roaster evenly roasts a whole chicken on a rotisserie spit. While this unit has an impressive capacity, digital controls, and a helpful window for tracking the progress of your food, it heats slowly and inefficiently. You can read my full review here .\n\nTobox Electric 1500W Digital Air Fryer ($90) : The Tobox air fryer stands out because it has digital controls, preprogrammed settings, and can hold 3.8 quarts of food. Also, thanks to the well-ventilated design of the basket, the hot air flows freely to efficiently air fry your meal. Unfortunately, the vents make the basket hard to clean.\n\nOverall, there are several outstanding alternatives available, but if you have it in your budget, we strongly recommend picking up the Philips Twin TurboStar XXL Airfryer. You will appreciate how quickly it cooks large meals and how effortless it is to clean up.\n\nPros: 4-quart capacity, TurboStar design facilitates faster cooking, dishwasher safe, digital interface, full-color recipe book\n\nCons: Expensive, doesn't come with accessories, smoking may occur if too much oil is used", "description": "The Philips air fryer can make a number of delicious dishes without heating your house. Its spacious interior can hold up to 3 pounds or 4 quarts of food.", "authors": ["James Brains"], "top_image": "https://image.businessinsider.com/5d63f4c72e22af0a5d507476?width=1200&format=jpeg"}