{"pub": "arstechnica", "url": "https://arstechnica.com/gaming/2019/10/star-wars-jedi-fallen-order-hands-on-tried-true-and-tough", "downloaded_at": "2019-10-18 01:04:14.805921+00:00", "title": "Star Wars Jedi: Fallen Order hands-on: Tried, true, and tough", "language": "en", "text": "EA\n\nEA\n\nEA\n\nEA\n\nEA\n\nEA\n\nEA\n\nIt has been far too long since Star Wars fans got a true, triple-A, single-player campaign experience. With exclusive access to the Star Wars license, publisher EA and its stable of studios have largely been content to release multiplayer games-as-a-service like Battlefront or, well, multiplayer games-as-a-service for mobile like Galaxy of Heroes. Given that the appeal of Star Wars is in the stories, places, and characters for most people, I've long found that a bit tragic.\n\nBut enter Respawn Entertainment, the original developer behind the Call of Duty franchise. The previously shooter-focused studio is coming hot off the big commercial success of free-to-play battle royale Apex Legends , as well as Titanfall 2, which many critics (myself included) deemed one of the greatest single-player shooters of all time, even though it didn't achieve widespread popularity or especially strong sales numbers.\n\nRespawn has been working on Star Wars Jedi: Fallen Order, a third-person action-adventure game in which players play as a young Jedi attempting to rebuild the Jedi Order after the events of Revenge of the Sith. Respawn, EA, and Disney held a press preview event this week at which I played the game for almost three hours, and I'm here to share some impressions.\n\nI played Fallen Order at 60 frames per second and 1440p on a desktop gaming PC with an Xbox One controller. The game is also coming to Xbox One and PlayStation 4. Game Director Stig Asmussen told me that Fallen Order will target 30fps on the base consoles but provide multiple performance profile options for the Xbox One X and PlayStation 4 Pro.\n\nBased on my time with it, Fallen Order isn't a very original game. But it combines elements from some of the most popular single-player triple-A titles of the past few years in a familiar cocktail mixed for the modern core gamer's palate. The narrative is strong, the visuals are appealing, the lightsaber combat is tight, and the target audience is going to gobble that up, I suspect.\n\nFor once, “It's like Dark Souls” actually applies\n\nIt's the cliché to end all clichés to compare a game to Dark Souls, and I think most of those comparisons are thin. But in Fallen Order's case, Dark Souls was obviously an explicit design inspiration to a degree I haven't yet seen in any other triple-A title that wasn't made by FromSoftware. The comparison is so obvious and central I feel I can't even avoid raising it, as cliché as it is.\n\nOnce you're on a planet, the structure is quite similar to that of Dark Souls. You discover secret passages, unlock doors that allow easier backtracking, and explore interlocking sections of a pseudo-open area with scattered save points. You do it all while fighting varied enemies in the paths between.\n\nThe death, saving, and progression systems borrow from Souls as well. You accumulate XP (though in this case it converts to skill points, which you spend on an ability tree instead of base stats) as you defeat enemies. But dying, unfortunately, causes you to lose all the XP you gained since you overtook your last skill point.\n\nWhen you reach a save point, you can sit at it to save your game or spend ability points. But to recover your health and refill your stims (basically health potions), you have to meditate. Meditate does those things, but it also respawns all the enemies in the area. In other words, it's a softened version of the Souls design.\n\nOn numerous occasions, I came out victorious in a battle but decided I had lost too much health to safely proceed without major risk of losing XP progress. So I backtracked to a save point to meditate and then tried to fight the enemies again, hopefully losing less health this time around. Sometimes I did this a half-dozen times on the same fight.\n\nI was surprised at how challenging Fallen Order was. While it is certainly not as difficult as Bloodborne or Sekiro, it combines an unusually unforgiving saving and death system with combat that is rooted in difficult enemy patterns. Precise timings are also a thing. It was very clear to me during my three hours with the game that its designers explicitly sought out to soften some of the Soulslike genre's harshest inclinations while retaining the spirit of what some people like about those games. I wasn't expecting this because I imagined Disney and EA would try to make this game as broadly appealing as possible.\n\nThe companies may have decided that casual players are largely on mobile anyway, so they might as well go all in with the core crowd on console and PC.\n\nUnlike those FromSoftware titles, though, Fallen Order has multiple difficulty levels, including Story, Jedi Knight, Jedi Master, and Grand Master. I played the majority of the demo on Jedi Knight but found it quite challenging—not savagely unfair but far from chill. I tried dropping the difficulty to Story for a bit, but that made the game very trivial, as it's clearly meant as a \"just mash to keep seeing the story\" difficulty. Given my struggles with counter timing and health management on Jedi Knight, I dared not attempt the higher difficulty levels.\n\nI think no shortage of casual players will wish there was something between Story and Jedi. I think this because it's an odd idea that, when you're playing as a Jedi, you can be repeatedly owned by a couple of stormtroopers wielding stun batons. This is especially odd after other Jedi games (like the outstanding Jedi Academy and the mediocre Force Unleashed) made the player feel like a god among insects except when facing either truly overwhelming numbers or other Jedi. We've been conditioned that that's what playing as a Jedi is all about.\n\nI'm not saying this is a bad thing for Fallen Order! A lot of people will love this about Fallen Order—and I'm sure plenty of them will be better at it than I am, anyway. If you're the type of player who's in it for the challenge, I think this will deliver for you. But if you just want to zone out and relax and feel that inevitable march to greatness while remaining barely engaged enough to be a little excited, as some players do, Fallen Order might not scratch your itch as well.\n\nThese are the game-design tropes you’re looking for\n\nIn general, Fallen Order borrows liberally from other successful triple-A games—not just Soulslikes. While the studio behind it, Respawn, is best known for its work on the Call of Duty and Titanfall/Apex Legends franchises, Fallen Order was developed largely from scratch by a new team within Respawn. Its team members have worked before on games like God of War, Uncharted, and Tomb Raider.\n\nAsmussen told me that members of the team bulk-bought the entire Star Wars game library in a Steam sale and took a week off to play through them for inspiration.\n\nHowever, I didn't see much DNA from Jedi Knight, Tie Fighter, or Shadows of the Empire in the game. I saw much more of those previously mentioned, more recent triple-A games. Like Uncharted, it sees you climbing predefined routes up walls, sliding down hills while dodging hazards, and enjoying interactive cutscenes. Like Tomb Raider, it sends you to underground temples to solve elaborate environmental physics and exploration puzzles. The game does all these things quite well—especially the puzzles.\n\nThere are some refinements going on here, though. Aside from the well-thought-out, slightly more casual take on the Dark Souls structure, Fallen Order is a real technical marvel. For example, the game has virtually no loading screens outside of death. It achieves this in part with the classic \"elevator method\" we all know (and, err, love?) from Mass Effect and others. But it does a good job of keeping you doing something even while loading is happening, making the illusion much more effective.\n\nWhen you select a planet to travel to, your shipmates begin a conversation as the outside of the ship animates the jump to hyperspace. During the trip, your character participates in the conversation, and you can go to a workbench to customize your light saber in transit, among other things. The game is loading in the background, but you wouldn't know it. Next thing you know, you're walking out onto the planet surface.\n\nAsmussen named this as one of the things the development team was most proud of.\n\nThe lack of really inventive game design was a little disappointing for me personally, though. Titanfall 2 took one of the most comically overplayed, by-the-numbers genres (the military shooter campaign) and injected new life into it with delightfully innovative ideas in level design and other areas. It was one of the best shooters ever made, and that was partly because it was inventive in ways that other entries in the genre generally are not. The same could be said to a lesser degree of Apex Legends, which injected new ideas into the battle royale genre with an innovative communications system and strong design choices oriented around team play. My personal expectations for Fallen Order on this front were very high.\n\nHowever, Fallen Order is a remix of past third-person action successes. It's polished, it's fun, it's challenging, and it's presented with a whole lot of style. From my three hours with it, it seems like a rock-solid game. But don't expect to see any new ideas—just old ideas executed with panache. Sometimes that's all you want, though.\n\nListing image by EA", "description": "The first big Star Wars single-player campaign in years focuses on the familiar.", "authors": ["Samuel Axon"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/Jedi-Fallen-Order-rder-temple-760x380.png", "published_at": "2019-10-17"}