{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/controversial-legging-trend-already-celebrity-050000654.html", "downloaded_at": "2019-09-06 12:16:44.961807+00:00", "title": "This Controversial New Legging Trend Is Already Celebrity Approved", "language": "en", "text": "Truth be told, leggings in the spring and summer can be tricky. Your black and gray ones have probably been glued to your body for months now, and you're ready for a change. And while you likely don't want to give up leggings completely until fall, thick, dark, constricting fabric against your skin doesn't really scream \"fun in the sun.\" But trendsetting celeb-favorite activewear brand Alo (i.e., the creators of those moto leggings that are always everywhere) may have just presented a solution.\n\nAlo, loved by legging-obsessed celebs like Gigi and Bella Hadid, Selena Gomez, Lily Collins, and Kylie Jenner, released its spring collection, and one thing is clear: They're heavily endorsing nude leggings for the season. We counted five pairs in the Gravel hue, which we first spotted on Bella Hadid last summer. The brand clearly saw a hit on their hands and created even more nude-colored leggings, tanks, and sports bras for this summer. While the look, which can almost appear as if you're wearing nothing from far away, isn't for the faint of heart, we're guessing directional celebs will continue to embrace the alluring trend now that Alo is fully supporting it.\n\nShop the latest controversial legging trend to hit the scene below.\n\nView photos\n\nOn Bella Hadid: Quay sunglasses; Alo Lush Bra ($54) and High Waist Airbrush Leggings in Gravel ($82); Saint Laurent bag; Adidas sneakers\n\nShop the Nude Legging Trend\n\nView photos\n\nAlo High-Waist Moto Leggings in Gravel/Gravel Glossy ($114)", "description": "Are you brave enough?", "authors": ["Allyson Payer"], "top_image": "https://s.yimg.com/uu/api/res/1.2/rr5SIKMU2j77g6PoDAFQ9A--~B/aD05MzM7dz03MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/who_what_wear_581/693f80f15f90592909ffb321985b2a7f", "published_at": "2019-09-06"}