{"pub": "reuters", "url": "https://in.reuters.com/article/britain-eu-ireland/irish-pm-says-open-to-northern-ireland-focused-brexit-solution-idINKCN1VT0PJ", "downloaded_at": "2019-09-08 23:31:13.662009+00:00", "title": "Irish PM says open to Northern Ireland-focused Brexit solution", "language": "en", "text": "DUBLIN (Reuters) - Irish Prime Minister Leo Varadkar plans to discuss whether regulatory alignment between Ireland and Northern Ireland might form the basis of a Brexit deal when he meets British counterpart Boris Johnson on Monday.\n\nFILE PHOTO: Ireland's Prime Minister (Taoiseach) Leo Varadkar arrives to take part in a European Union leaders summit, in Brussels, Belgium July 2, 2019. Geoffroy Van Der Hasselt/Pool via REUTERS/File Photo\n\nBut Varadkar said a breakthrough was unlikely during Monday’s talks with the EU summit on Oct. 17-18 providing the most likely venue for any agreement.\n\nTalks to secure an orderly British exit from the European Union have floundered on the question of how to avoid infrastructure along the border between EU member Ireland and the British region of Northern Ireland.\n\nThe so-called “backstop” protocol in the current withdrawal agreement mandates regulatory alignment between Ireland and the whole of the United Kingdom, which Brexit supporters say would complicate new trade deals.\n\nAsked by journalists whether Ireland would consider a return to earlier proposals of Northern Ireland specific solutions, Varadkar said this was something Ireland had always been open to.\n\n“It will be interesting to see whether we can explore tomorrow whether we could find some common ground on a Northern Ireland specific solution, but I will have to judge that tomorrow,” he said.\n\nBritain’s Brexit negotiator David Frost proposed in Brussels on Friday that common rules for checking animals and animal products be established across the whole island of Ireland as an alternative to the Irish backstop.\n\nVaradkar rejected the suggestion that all-Ireland system of sanitary and phytosanitary (SPS) checks on agricultural products might provide a solution, saying such issues only account for around 30% of border checks.\n\n“It’s not enough on its own. We would need a single Irish economic zone, or whatever you would like to call it, to cover more than agriculture and food,” Varadkar said.\n\nVaradkar said he was not expecting a big breakthrough in the talks with Johnson in Dublin, but said he saw the meeting as “an opportunity to establish a relationship to see what common ground might exist”.\n\n“If we come to an agreement that will happen most likely in October at the EU summit,” he said.", "description": "Irish Prime Minister Leo Varadkar plans to discuss whether regulatory alignment between Ireland and Northern Ireland might form the basis of a Brexit deal when he meets British counterpart Boris Johnson on Monday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190908&t=2&i=1427676318&w=1200&r=LYNXNPEF870WK", "published_at": "2019-09-08"}