{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-6330407/Red-Dead-Redemption-2-cheat-codes-uses-revealed.html", "downloaded_at": "2019-10-05 08:09:06.729077+00:00", "title": "Red Dead Redemption 2 cheat codes and their uses revealed", "language": "en", "text": "Red Dead Redemption II has already taken the video game charts by storm and earned rave reviews from critics.\n\nBut what about fans of the blockbuster video game looking for that extra edge while playing? Fortunately for gamers, Forbes has assembled a large and running list of cheat codes for the new game and their uses.\n\nWhile cheat codes have largely fallen by the wayside in recent years, Rockstar Games is still part of that unapologetic old guard of video game developers who’ve stuck with them even as they’ve gone out of style – and Red Dead Redemption II is no exception to their rule.\n\nThe cheat codes for Red Dead Redemption II allow players to obtain new modes of transportation, attain additional weapons, alter their stats and Honor level and more\n\nHere’s a look at all of the known Red Dead Redemption II cheat codes and their uses. The cheat codes usable without a newspaper are signified with an asterisk next to them.\n\n*Keep your dreams simple - Spawns a one-horse Wagon\n\n*I shall be better - Set Deadeye level to 3, allowing for manual painting of targets\n\n*I seek and I find - Set Deadeye level to 5, showing all weak spots\n\nAbundance is the dullest desire - Infinite Ammo\n\nGreed Is American Virtue - Pump-Action Shotgun, Bolt Action Rifle, Mauser Pistol, and Semi-Automatic Pistol all added to inventory\n\n*Death is silence – Adds all stealth weapons to inventory\n\n*A simple life, a beautiful death - Basic weapons all added to inventory\n\n*A fool on command – Causes player to become drunk\n\nVanity. All is Vanity - Awards all outfits\n\nKeep your dreams light - Spawns a Buggy\n\nVirtue unearned is not virtue - Sets your Honor high with a bunch of unearned virtue\n\n*Run! Run! Run! - Spawns a Racehorse\n\nYou are a beast built for war - Spawns a War Horse\n\n*Better than my dog - Infinite horse whistle distance\n\nYou seek more than the world offers - Fill and fortify all status meters\n\n*You want punishment - Increases Wanted Level\n\n*You Want Freedom - Decreases Wanted Level\n\nThe Lucky be strong evermore - Grants infinite stamina\n\n*Balance. All Is Balance - Sets Honor to neutral\n\nWould you be happier as a clown? - Spawns a Circus Wagon\n\n*You Flourish Before You Die - Fills all status meters\n\nYou long for sight but see nothing - Reveals map\n\nRed Dead Redemption 2 release date\n\nThe video game was released on Friday, October 26 and is now available to play worldwide.\n\nHow to play Red Dead Redemption 2\n\nRed Dead Redemption II can currently be played on both PlayStation 4 and Xbox One.\n\nWhat is Red Dead Redemption 2?\n\nRed Dead Redemption II is an action-adventure game featuring an Old West theme.\n\nDeveloped and published by Rockstar Games, the video game is the third entrant into the popular Red Dead video game franchise, following 2004’s Red Dead Revolver and 2010’s Red Dead Redemption and its expansion pack Undead Nightmare.\n\nServing as a prequel to Red Dead Redemption, the game is set in 1899 and revolves around its main character Arthur Morgan, a fictional outlaw in the Old West.\n\nReleased on October 26, 2018, Red Dead Redemption II has praise from critics for its vast open world environment, engaging storyline, excellent writing and striking graphics.", "description": "The cheat codes for the hit video game Red Dead Redemption 2 have just been revealed by Forbes. Here's all you need to know about them and the popular new video game itself.", "authors": ["Steve Longo"], "top_image": "https://i.dailymail.co.uk/1s/2018/10/29/18/5543098-0-image-a-9_1540837159337.jpg", "published_at": "2018-10-29"}