{"pub": "abcnews", "url": "https://abcnews.go.com/US/teen-charged-impersonating-sheriffs-deputy-traffic-stop/story?id=66013938", "downloaded_at": "2019-10-03 07:15:08.336029+00:00", "published_at": "2019-10-02", "title": "Teen charged with impersonating sheriff's deputy during traffic stop", "language": "en", "text": "An 18-year-old in New Mexico has been charged with impersonating a sheriff's deputy after he allegedly conducted a traffic stop using police lights he outfitted on his car, police said.\n\nAn Albuquerque Police officer happened upon the scene Monday just after 12:30 a.m. and saw a vehicle without any police markings but outfitted with red and blue flashing lights, according to a criminal complaint.\n\nAs the officer was driving by, a man standing outside the stopped vehicle waved at him as he was passing, which prompted him to turn around and stop next to the unmarked car.\n\nThe man, who was wearing plain clothes but had a star-shaped badge on his belt, identified himself as Brenden Wysynski and told the officer that he had worked for the Bernalillo County Sheriff's Office for the past three years, according to the complaint.\n\nBody camera footage from the scene shows Wysynski saying, \"This is all I got,\" and gesturing to the badge when the officer ask if he had identification on him.\n\nAlbuquerque Police Department\n\nWhen the officer asked why he pulled the SUV over, Wysynski allegedly replied that it had been traveling on the highway at 120 mph. He then advised Wysynski to return the documents to the driver, who left the area.\n\nThe officer then expressed concern to Wysynski against conducting a traffic stop without the proper attire and equipment and contacted dispatch to have the supervisor for the sheriff's office come to the scene.\n\nWhile questioning Wysynski, the teen told the officer that his birth year was 1994, but the birth year for the registration listed on the vehicle stated 2001, which the officer then confirmed through the police database, according to the complaint.\n\nThe officer then placed Wysynski in the back of his police vehicle as they waited for the BCSO supervisor to arrive, and Wysynski \"without being asked any questions\" confessed that he had bought the badge online and did not work for the sheriff's office, the complaint states.\n\n\"I'm just gonna be straight-up with you. I'm not a cop,\" Wysynski is seen saying on bodycam footage. The officer then had Wysynski step out of the vehicle and handcuffed him after informing him that he was under arrest.\n\nAlbuquerque Police Department\n\nWhen the supervisor for the sheriff's office arrived, he asked Wysynski for the badge and stated that the badge appeared to be real but was not a current badge, according to the complaint. Wysynski then stated that the badge belonged to his father, but the sergeant stated he did not recognize the name as a prior deputy.\n\nOnce at the police station, Wysynski allegedly stated that he was on his way to his actual job at Albuquerque Courtesy & Parking when he saw the SUV he pulled over speeding. Wysynski said that the driver of the SUV stated that his sister was in trouble and admitted that he identified himself as a deputy for the sheriff's office because he \"got scared\" when he saw the Albuquerque Police officer approaching him.\n\nWysynski also later admitted that he bought the badge online, despite stating again during his interview that the badge once belonged to his father, who had died.\n\nHe's been charged with impersonating a police officer.\n\nABC News' Sabina Ghebremedhin contributed to this report.", "description": "An 18-year-old in New Mexico has been charged with impersonating a sheriff's deputy after he allegedly conducted a traffic stop using police lights he bought.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/police-ht-er-191002_hpMain_16x9_992.jpg"}