{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1WE01N-OCASP", "downloaded_at": "2019-09-29 05:06:34.507945+00:00", "title": "Agassi finds few places of comparison in modern 'aggressive' field", "language": "en", "text": "NEW YORK (Reuters) - As a tennis player, Andre Agassi defied comparison. And as a retiree, the eight-times Grand Slam champion would rather not try himself.\n\nTennis - Australian Open - Fourth Round - Melbourne Park, Melbourne, Australia, January 20, 2019. Andre Agassi, coach of Bulgaria's Grigor Dimitrov, watches Dimitrov's match against Frances Tiafoe of the U.S. REUTERS/Edgar Su\n\nReflecting on his career on Saturday, at the Longines Global Champions Tour in New York, Agassi said the game today had simply changed too much for him to find an analog among the sport’s current top performers.\n\n“The truth is, some of them do what I did – but they do other things too,” said Agassi, pointing to reigning Wimbledon champ Novak Djokovic as someone “who can take the ball early and redirect pace or control points from the middle of the court,” but also brings an added defensive edge.\n\n“These guys, they can do everything I did on a return, except they have even a little more coverage.\n\n“When I was really at my best, it was a risk to play aggressive ... (today) people play aggressive.”\n\nHaving shifted his post-tennis career toward business and philanthropy, Agassi appeared on Saturday as the appointed “ambassador of elegance” for the luxury watch-maker Longines, the title partner of the competition, with which he has formed a kind of symbiotic relationship.\n\nMost notably the former world No. 1, who described his exit from tennis as “like Christmas,” said the partnership helps him pursue the cause of youth education.\n\n“It seems to push my buttons,” said Agassi, talking with passion about the latest advancements in technology for childhood literacy.\n\nBut he acknowledged moving from the pro sport isn’t quite so simple for everyone.\n\n“I don’t know if you can prepare somebody for it because it all depends on what it’s meant to them and how much of their identity is tied up in it,” said Agassi. “When you do something for the first third of your life and then you have two thirds of your life to go, it can be a tough transition.”\n\nHe heaped praise on Russia’s Daniil Medvedev, this year’s U.S. Open villain turned unlikely hero who gave eventual champ Rafa Nadal a run for his money in a five-set final thriller.\n\n“A guy like that stays healthy, he’s probably the best 6’6” mover we’ve ever seen in tennis,” Agassi said of the 23-year-old. “He knows when to press, when to put a little urgency into your game and he knows when to sort of let you implode.\n\n“His tennis IQ is really high, his offensive skill set is there, his defensive skill set is there. So he’s got everyone’s attention.”", "description": "As a tennis player, Andre Agassi defied comparison. And as a retiree, the eight-times Grand Slam champion would rather not try himself.", "authors": ["Amy Tennery", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190929&t=2&i=1435057959&w=1200&r=LYNXMPEF8S01Q-OCASP", "published_at": "2019-09-29"}