{"pub": "metro", "url": "https://metro.co.uk/2019/10/28/hubble-telescope-spots-spooky-alien-face-formed-two-galaxies-colliding-10998303", "downloaded_at": "2019-10-28 23:32:12.460897+00:00", "title": "Nasa spots spooky Halloween alien face formed by 2 galaxies colliding", "language": "en", "text": "The ring galaxy Arp-Madore 2026-424 looks a bit like a whopping great cosmic countenance (Image: ESA)\n\nThe European Space Agency has released pictures of a ‘ghostly face’ which formed after two galaxies smashed into each other.\n\nAstronomers used the Hubble Telescope to zoom in on the Arp-Madore 2026-424 system, which is located 704 million years away from Earth.\n\n‘Although galaxy collisions are common – especially in the early universe – most are not head-on impacts like the collision that likely created this Arp-Madore system 704 million light-years from Earth,’ ESA wrote.\n\n‘This violent encounter gives the system an arresting ring structure, but only for a short amount of time.\n\n‘The crash has pulled and stretched the galaxies’ discs of gas, dust, and stars outward, forming the ring of intense star formation that shapes the “nose” and “face” features of the system.’\n\nThe face is actually a ‘ring galaxy’ which are quite rare, with only a few hundred spotted in Earth’s ‘larger cosmic neighbourhood’.\n\nAdvertisement\n\nAdvertisement\n\n‘The galaxies have to collide at just the right orientation so that they interact to create the ring, and before long they will have merged completely, hiding their messy past,’ ESA added.\n\n‘The side-by-side juxtaposition of the two central bulges of stars from the galaxies that we see here is also unusual. Since the bulges that form the “eyes” appear to be the same size, we can be sure that the two galaxies involved in the crash were of equal size. This is different from the more common collisions in which small galaxies are gobbled up by their larger neighbours.’", "description": "The creepy-looking visage is a rare ring galaxy which formed during an epic galactic crash.", "authors": ["Jasper Hamill"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/heic1919a-d440_1572274240.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-28"}