{"pub": "cbs", "url": "https://cbsnews.com/news/the-new-face-of-racial-segregation-school-secession", "downloaded_at": "2019-09-06 12:15:08.467866+00:00", "title": "The new face of racial segregation: School \"secession\"", "language": "en", "text": "School districts in a growing number of U.S. states are trying to break off from existing districts.\n\nThese \"seceding\" areas, as experts refer to the practice, tend to be wealthier and whiter than the \"left behind\" district, raising questions about educational segregation and equality.\n\nA court ruling last year found that an Alabama school secession was driven by a \"discriminatory purpose to exclude black children.\"\n\nRacial segregation of America's schools was banned 65 years ago in the landmark \"Brown vs. Board of Education\" ruling. But a different wall that separates children is emerging today that reflects the nation's growing economic inequality: \"secession\" by wealthier school districts.\n\nSecession occurs when communities carve out a new school district from an existing one, often on the grounds of keeping local control over education. New research that focuses on seven counties in Alabama, Louisiana and Tennessee finds that the impact is often racial, with the new splinter schools having a student body that ends up being wealthier and whiter than the \"left behind\" district.\n\n\"School segregation is becoming more entrenched, with potential long-term effects for residential integration patterns as well,\" Erica Frankenberg, a co-author of the study and a professor of education and demography at Penn State, said in a statement, calling the implications \"profound.\"\n\nThe findings raise questions about fairness and equality in education, as well as the ultimate objectives of the communities that cleave off from larger school districts. The issue is also attracting judicial scrutiny, with a federal appeals court ruling earlier this year that a plan by a mostly white Alabama city to create a new school district was driven by a \"discriminatory purpose to exclude black children from the proposed school system.\"\n\nSchool gerrymandering\n\nThe study zeroes in on a number of counties in the South where local communities have split off: Jefferson, Marshall, Mobile, Montgomery and Shelby counties in Alabama; East Baton Rouge Parish, Louisiana; and Shelby County, Tennessee.\n\nIn the Tennessee county's case, six Memphis suburbs broke away from the Memphis City Schools system in the 2014-2015 school year, carving out a new school district with a poverty rate of 11% — far lower than the 31% overall county rate, according to data from EdBuild, an organization that studies school funding. About half the students in the new school district are white, compared with 7% at the county level.\n\nSchool segregation in on the rise across the U.S., 65 years after Brown v. Board of Education\n\nIn the Louisiana county's case, the town of St. George in the East Baton Rouge Parish is trying to secede and form a new school district, following three other communities that have split off. Median household income in St. George, which is 71% white, is $79,524, compared with $55,326 for the entire parish, according to Data USA.\n\nTypically, the proponents of school secession frame the issue as one of maintaining local control and providing better educational opportunities for students.\n\n\"The city of St. George will provide the opportunity for parents and children within its borders to have a first-class public school system,\" a website that supports the secession efforts says. \"St. George's taxpayers provide two-thirds of the revenue to the East Baton Rouge Parish government with only one-third of that government's expense in return.\"\n\nMaine to Utah\n\nYet school secession is happening more widely, affecting school districts in states from Maine to Utah. About 128 communities have attempted school secession since 2000, according to an analysis by EdBuild.\n\nUnder federal law, it is illegal to create a school specifically for the purpose of excluding students based on race. But secessions are becoming more common due to state and local laws that make it easier to carve out a new school, EdBuild noted. According to the Brookings Institution, 30 states have laws that outline how schools can split off from their school districts.\n\nThe problem, critics say, is that affluent communities can effectively create what amounts to a gated educational community. That allows seceding school districts to keep tax dollars to themselves, rather than sharing revenue more widely with less affluent areas.\n\n\"If this trend continues, students of color increasingly will be sorted into schools with fewer resources, segregation will become more ingrained, and all students will have fewer opportunities to experience the educational benefits of a diverse learning environment,\" Frankenberg said.", "description": "School districts in a number of U.S. states are moving to split off from their neighbors, leaving schools whiter", "authors": ["Aimee Picchi"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/04/4177692b-df59-4b05-86a9-396e414b00eb/thumbnail/1200x630/3d9c18ab0ed9ac1d4d570ebcd1cb0a4f/rtx3fyrs.jpg", "published_at": "2019-09-05"}