{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7594671/US-Special-Forces-soldier-wears-BANNED-Kurdish-patch-troops-pull-Syria.html", "downloaded_at": "2019-10-21 01:36:10.529596+00:00", "title": "US Special Forces soldier wears BANNED Kurdish patch as troops pull out of Syria", "language": "en", "text": "A US Special Forces soldier was seen wearing a banned Kurdish patch in an apparent show of solidarity for fighters in northern Syria as American troops abandoned a key military base.\n\nA bright green patch bearing the letters YPJ - a symbol of the Syrian Kurdish Women's Protection Units - stood out on the soldier's shoulder as he sat atop a tank in a 70-strong convoy headed out of Tal Tamr on Sunday.\n\nThe patches were banned by officials in 2016 after they inflamed tensions between the US and Turkey because the Kurdish YPJ militia, a key American ally against the Islamic State in Syria, is considered a terrorist group by the Turkish government.\n\nThe soldier made a strong statement in wearing the patch as the majority of the 1,000 troops stationed in northern Syria approximately withdrew from the region under orders from US President Donald Trump.\n\nThe controversial pullout largely abandons Kurdish allies who have fought against ISIS alongside US troops for years, leaving them vulnerable to attacks from Turkey that have killed 114 civilians and displaced at least 300,000 people since October 9.\n\nVideos shared on social media showed protesters attempting to block military vehicles as they left the region.\n\nLater on Sunday a senior White House official indicated that Trump is considering a Pentagon plan to keep some 200 troops in eastern Syria, marking yet another strategy change by the seemingly indecisive president.\n\nScroll down for video\n\nA US Special Forces soldier was seen wearing a banned Kurdish patch in an apparent show of solidarity for YPJ fighters in northern Syria as American troops abandoned a key military base\n\nThe soldier made a strong statement in wearing the patch as the 70-strong military convoy (pictured) retreated from Tal Tamr in northern Syria\n\nHeartbreaking moments while US forces are ordered to leave N. Syria leaving behind defenseless Kurds, Arabs, Syriacs, Yezidis #SaveKurds pic.twitter.com/zdKJiODsKs — Mutlu Civiroglu (@mutludc) October 20, 2019\n\nYPJ is the all female counterpart to the Kurdish-led People's Protection Units (YPG) militia.\n\nAmerican soldiers were reprimanded for wearing YPJ patches in the spring of 2016 after Turkish officials branded them 'unacceptable'.\n\n'Wearing an insignia of a terrorist organization by US soldiers, who are our ally and are assertive about fighting against terrorism, is unacceptable,' Turkey's Foreign Minister Mevlut Cavusoglu said at the time.\n\nIn the face of fierce criticism, coalition spokesman Army Col Steve Warren announced that wearing the patches was 'unauthorized and it was inappropriate and corrective action has been taken'.\n\nAmerican soldiers were banned from wearing YPJ and YPG patches in 2016 after they inflamed tensions between the US and Turkey because the Kurdish militias - key American allies against the Islamic State in Syria - are considered a terrorist group by the Turkish government (file photo)\n\nWarren explained that it was common practice to wear patches supporting military groups they were working with on the ground.\n\n'[T]he special forces community has a long and proud history of wearing such patches when they are partnering with forces around the world, and you'll see examples of that in Afghanistan, in Iraq, in Latin America and all over the world where these special forces personnel train and conduct, you know, foreign internal defense type operations,' Warren said.\n\n'This is something that they often do, and it's an effort to, you know, just kind of connect with those that they're training.'\n\nYPJ has vowed to continue its fight against invading Turkish forces after the American retreat as air strikes have battered the vulnerable region.\n\nAnnouncing the withdrawal of troops last week, Trump declared that Washington had no stake in defending the Kurdish fighters who died by the thousands as America's partners fighting in Syria against ISIS extremists.\n\nUS and Turkish leaders hammered out a five-day ceasefire agreement late Thursday after Turkey conducted a weeklong offensive into northeastern Syria against the Kurdish fighters .\n\nTurkey has given the Syrian Democratic Forces, the de facto army of the Kurdish authorities in northeastern Syria, until Tuesday evening to withdraw from a 30-kilometer strip of Syrian land along its southern border.\n\nBoth sides accuse each other of violating the truce while the Kurds accused the US of abandoning them.\n\nProtesters blocked the path of US military convoys leaving the region on Sunday, begging them to stay.\n\n'Thanks for US people but Trump betrayed us,' one protester's sign read.\n\n'To the US army who are leaving northeast Syria: Tell your children that the children of the Kurds were killed by the Turks and we did nothing to protect them,' another read.\n\nProtesters blocked the path of US military convoys leaving the region on Sunday, begging them to stay. 'Thanks for US people but Trump betrayed us,' one protester's sign read\n\nAnother sign read: 'To the US army who are leaving northeast Syria: Tell your children that the children of the Kurds were killed by the Turks and we did nothing to protect them'\n\nUnder fierce criticism from former military leaders and politicians on both sides of the aisle, Trump appears to be reconsidering the swift retreat.\n\nOn Sunday, a senior official in the Trump administration told the New York Times that the president is leaning in favor of a new Pentagon plan that would keep a small group of American troops in eastern Syria to combat the Islamic State.\n\nIf approved, the move would mark the second time in 10 months that Trump has reversed his order to pull troops out of Syria. He initially directed 2,000 American troops to leave the war-torn country in December, but later backtracked and approved a more gradual withdrawal.\n\nThe senior official told the Times that the troops would likely be stationed along the Iraqi border with Syria, away from the cease-fire zone negotiated with Turkish President Recep Tayyip Erdogan.\n\nYPJ has vowed to continue its fight against invading Turkish forces after the American retreat as air strikes have battered the vulnerable region\n\nOn Sunday, a senior official in the Trump administration claimed that the president is leaning in favor of a new Pentagon plan that would keep a small group of American troops in eastern Syria to combat the Islamic State. Trump is pictured on Friday\n\nThe US troops that were pulled out of Sarrin - which served as the largest military base in northern Syria - over the weekend are headed to western Iraq, where they will continue to conduct operations against ISIS, Defense Secretary Mark Esper said Saturday.\n\nSpeaking to reporters traveling with him to the Middle East, Esper did not rule out the idea that US forces would conduct counterterrorism missions from Iraq into Syria. He said those details will be worked out over time.\n\nHis comments were the first to specifically lay out where American troops will go as they leave Syria and what the counter-ISIS fight could look like.\n\nThe developments made clear that one of President Trump's rationales for withdrawing troops from Syria was not going to come to pass any time soon.\n\n'It's time to bring our soldiers back home,' he said Wednesday.\n\nBut they are not coming home.\n\nThe US troops that were pulled out of Sarrin - which served as the largest military base in northern Syria - over the weekend are headed to western Iraq, where they will continue to conduct operations against ISIS, Defense Secretary Mark Esper (pictured) said Saturday\n\nEsper said he has spoken to his Iraqi counterpart about the plan to shift the more than 700 troops leaving Syria into western Iraq, where they will have two missions.\n\n'One is to help defend Iraq and two is to perform a counter-ISIS mission as we sort through the next steps,' he said.\n\n'Things could change between now and whenever we complete the withdrawal, but that's the game plan right now.'\n\nThe US currently has more than 5,000 American forces in Iraq, under an agreement between the two countries.\n\nThe US pulled its troops out of Iraq in 2011 when combat operations there ended, but they went back in after the Islamic State group began to take over large swaths of the country in 2014.\n\nThe number of American forces in Iraq has remained small due to political sensitivities in the country, after years of what some Iraqis consider US occupation during the war that began in 2003.\n\nEsper said he will talk with other allies at a NATO meeting in the coming week to discuss the way ahead for the counter-IS mission.\n\nAsked if US special operations forces will conduct unilateral military operations into Syria to go after IS, Esper said that is an option that will be discussed with allies over time.\n\nHe said one of his top concerns is what the next phase of the counter-IS missions looks like, 'but we have to work through those details.'\n\nHe said that if US forces do go in, they would be protected by American aircraft.\n\nWhile he acknowledged reports of intermittent fighting despite the cease-fire agreement, he said that overall it 'generally seems to be holding. We see a stability of the lines, if you will, on the ground'.", "description": "A bright green patch bearing the letters YPJ stood out on the soldier's shoulder as he sat atop a tank in a 70-strong convoy headed out of Tal Tamr, Syria, on Sunday", "authors": ["Megan Sheets For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/01/19969684-0-image-a-17_1571618949489.jpg", "published_at": "2019-10-21"}