{"pub": "nymag", "url": "https://vulture.com/2019/09/pete-davidson-not-on-snl.html", "downloaded_at": "2019-10-01 00:23:23.816064+00:00", "title": "Why Wasn’t Pete Davidson on SNL This Week?", "language": "en", "text": "Photo: Daniel Boczarski/Getty Images for New York Magazine\n\nA whole episode of Saturday Night Live aired this weekend, and it did not feature Pete Davidson oversharing about his newfound romance with showbiz royalty Margaret Qualley or breaking into the middle of a sketch because Kenan Thompson was there. The season premiere of SNL featured Larry David and Maya Rudolph, but current cast member Pete Davidson was nowhere to be found. The show’s young gun (not to be confused with Machine Gun Kelly, Pete’s BFF) was actually off pursuing another dream of his. He was filming the new Suicide Squad movie with director James Gunn and co-stars Margot Robbie, Jai Courtney, Daniela Melchior, Steve Agee, Sean Gunn, Joel Kinnaman, Flula Borg, and Nathan Fillion. And we know this thanks to Gunn’s social-media presence.\n\nOn Saturday, the squad (plus Pom Klementieff from Guardians of the Galaxy) saw a screening of Joker in Atlanta. Pete’s role in the new film still remains a mystery, so there is no telling when the prodigal son will return to 30 Rock. But are we that desperate to spend a portion of “Weekend Update” hearing how Andie MacDowell feels about her daughter dating Davidson? We can do that right now. “She has a beautiful relationship with him but I don’t want to step on her relationship too much,” Andie MacDowell told People at Paris Fashion Week. “They have a nice relationship.” That’s Pete Davidson, everyone! From “Weekend Update,” I’m Colin Jost! He’s Michael Che! Good night!", "description": "‘Saturday Night Live’ cast member Pete Davidson was missing from the season premiere this week because he was off filming ‘Suicide Squad’ with James Gunn.", "authors": ["Zoe Haylock"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/30/30-pete-davidson.w1200.h630.jpg", "published_at": "2019-09-30"}