{"pub": "investingcom", "url": "https://coindesk.com/alternative-crypto-season-ether-xrp-rise-to-1-month-highs-while-bitcoin-falls", "downloaded_at": "2019-09-18 05:15:06.335613+00:00", "title": "Ether, XRP Rise to 1-Month Highs While Bitcoin Falls", "language": "en", "text": "Demand for alternative cryptocurrencies has seen their performance rise over the last 24 hours despite bitcoin’s (BTC) failure to take another leg up.\n\nIt raises the question as to whether the “alt season”, a period where alternative crypto sees considerable growth regardless of BTC’s performance, is finally here.\n\nEther (ETH) and XRP (XRP) rose between six to 10 percent on the day backed by solid demand seen in large 24-hour trading volumes.\n\nThe event marks a divergence from recent weeks with BTC’s dominance rating, a share of the total crypto market value, having hit a 30-month high above 70 percent earlier this month.\n\nThat number has since dropped to 68.3 percent as interest in alternative cryptos begins to pick up once more.\n\nAs seen above, both XRP and ETH experienced swift rallies in their price between 10 pm on Sept. 17 and 3:00 am Sept. 18, while BTC was down 1 percent over the same period.\n\nOther notable crypto assets such as Stellar (XLM), Binance Coin (BNB) and Litecoin (LTC) are also up between 2.5 and nine percent.\n\nThe total market capitalization of all crypto, excluding BTC, also rose by more than $5.4 billion over 24 hours, while total trading volume was up $7.2 billion.\n\nIt could be a sign that investors are growing wary of any further potential gains in BTC’s growth and looking elsewhere, given that its price has remained within a $300 range for nearly 2 weeks.\n\nDisclosure: The author holds no cryptocurrency at the time of writing.\n\nXRP, ETH and BTC image via Shutterstock; charts via Trading View", "description": "", "authors": [], "top_image": "https://static.coindesk.com/wp-content/uploads/2019/09/shutterstock_1193685157.jpg", "published_at": "2019-09-18"}