{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7604919/Georgia-sex-offenders-suing-sheriffs-office-No-Trick-Treat-signs.html", "downloaded_at": "2019-10-23 17:22:02.731283+00:00", "title": "Georgia sex offenders are suing sheriff's office over 'No Trick-Or-Treat' signs", "language": "en", "text": "A group of registered sex offenders in Georgia are suing a local sheriff, accusing him of violating their constitutional rights by placing 'No Trick-Or-Treat At This Address!!' signs on their lawns.\n\nThree men who served time in prison for sexual offenses targeting children - and who now all reside in Butts County - on September 24 filed a federal lawsuit against Sheriff Gary Long and many of his deputies over the Halloween warning signs.\n\nThe complaint, which was brought by attorney Mark Yurachek on behalf of plaintiffs Christopher Reed, Reginald Holden and Corey McClendon, alleges that the signs violate their constitutionally protected rights to free speech and privacy.\n\nThis sign placed on the properties of registered sex offenders in Butts County, Georgia, is now the subject of a federal lawsuit accusing the sheriff of violating constitutional rights\n\nAccording to the court filing, in late October 2018, the sheriff’s office put up warning signs in the front yards of more than 200 registered sex offenders.\n\nAfter November 2, deputies went back to the offenders’ properties to collect the signs.\n\nYurachek argues that in doing so, the sheriff and his deputies violated the residents' rights by trespassing on their property to place and collect the signs without their consent.\n\nHe also maintains that Georgia's sex offender registry statue does not call for warning signs to be placed at the homes of offenders.\n\nAccording to the lawsuit, the signs inflicted ‘anxiety, embarrassment and humiliation’ on the offenders, and forced them to endorse speech in the form of the ‘No Trick-Or-Treat’ warning that they found objectionable.\n\n‘I understand that there are a lot of people who think this is a great idea, who think, “Yeah, this protects my kids,” but what they should be thinking about is, “Does this protect my rights?\"’ Yuracheck told Fox 5 Atlanta.\n\nYurachek noted that his clients’ names, photos and addresses are already displayed for the public to see on Georgia Bureau of Investigation’s online sex offender registry.\n\nHe says the offenders have paid their debts to society for their crimes, they are not on probation and they are complying with all the legal requirements.\n\nSex offenders Reginald Holden (left), Corey McClendon (center) and Christopher Reed (right) last month sued the sheriff and his deputies for placing the warning signs on their lawns\n\nThe lawyer cautioned that the sheriff’s decision to put up the signs alerting the public to the presence of sexual offenders in their midst could be a slippery slope.\n\n‘It’s easy to pick on these guys because nobody really wants to see anything done for a sex offender,’ Yurachek told 11Alive, ‘but I promise you if this goes by without a legal challenge and push-back, it’s going to get worse.’\n\nSheriff Long defended the practice in a Facebook post on Monday, explaining that he first introduced the signs last year, after the local chamber of commerce cancelled the annual ‘Halloween on the Square’ celebration, resulting in more local children going door-to-door to trick-or-treat.\n\n‘My office took precautions and placed signs indicating “No Trick or Treat” at each registered sex offender’s residence in the County,’ the sheriff’s statement read. ‘This was done to ensure the safety of our children.’\n\nIn addressing the federal lawsuit, Long said he plans to argue in federal court that his office is following state law by placing the warning signs.\n\n‘Regardless of the Judge’s ruling this Thursday, I WILL do everything within the letter of the Law to protect the children of this Community,’ the sheriff wrote, adding that he is asking the public for ‘prayers’ ahead of the hearing.", "description": "Registered sex offenders Christopher Reed, Reginald Holden and Corey McClendon have filed a federal lawsuit against Butts County Sheriff Gary Long and his deputies over the signs,", "authors": ["Snejana Farberov For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/14/20084588-0-image-a-5_1571837288871.jpg", "published_at": "2019-10-23"}