{"pub": "cnn", "url": "https://cnn.com/travel/article/most-beautiful-villages-greece/index.html", "downloaded_at": "2019-10-10 15:16:38.198449+00:00", "title": "Most beautiful Greek villages", "language": "en", "text": "(CNN) — Greece may be home to some of the most idyllic and secluded islands around, but the Mediterranean country also holds plenty of charming villages.\n\nFrom Pyrgi to Oia, here are some of the most beautiful to see when you travel there:\n\nStemnitsa, Arcadia\n\nAlong with Dimitsana and Andritsaina, Stemnitsa is one of three villages in mountainous Arcadia that once exemplified the Peloponnesian pastoral idyll.\n\nProud, independent villagers would tend their livestock here and live self-reliant lives.\n\nWhat makes Stemnitsa stand out, though, is the Silver and Gold Smithery School.\n\nNot only does it bring a bustling student community during term time, it also generates an abundance of handcrafted jewelry in workshops scattered along its narrow lanes.\n\nAgios Georgios Nilias, Pelion\n\nMount Pelion in Thessaly is home to some of the most picturesque villages in Greece, none of them more so than Agios Georgios Nilias.\n\nSet at an elevation of 700 meters, it's a place where old schist-stone houses with four-pitched roofs rise next to 19th-century neoclassical mansions.\n\nThe latter belonged to merchants who emigrated to Alexandria in Egypt and made their fortunes in cotton and textiles, before returning to their villages to build impressive summer residences.\n\nToday, the remaining inhabitants often congregate in the village square, the center of life in every Pelion village, under the shade of three plane trees.\n\nVisitors come here to enjoy the balmy evenings and dine on dishes that make use of obscure aromatic herbs foraged in the forest.\n\nArnea, Chalkidiki\n\nArnea is known for its pretty traditional villages. Shutterstock\n\nArnea is perhaps one of the most typical of all traditional villages in Greek Macedonia.\n\nBuilt at an altitude of 1,800 feet on thickly forested Mount Holomondas, it's filled with two and three-storied wood-and-stone houses with low doors to keep the heat in during bitterly cold winters, as well as unique \"hayat\" protrusions.\n\nThese are not open balconies as you might find in southern Greece, but closed overhanging rooms that increase the interior footprint of the upper floors.\n\nBrought in by the Ottomans and enthusiastically adopted in the colder regions of Greece, they led to a distinctive architecture typified by Arnea.\n\nAno Syros, Cyclades\n\nPositioned on a hilltop overlooking the island's capital Ermoupoli, the village of Ano Syros is a classical Cycladic medieval settlement.\n\nIts population is overwhelmingly Catholic Greeks who are descendants of Venetian settlers who arrived here in the late Middle Ages.\n\nAlthough the streets here are full of the familiar Cycladic whitewashed houses and narrow cobbled alleys, its monastery belongs to the Capuchin friars.\n\nThe priests are clean-shaven, the churches feature no icons, only statues of St. Francis or St. Benedict, while the handouts on the pews are Greek translations of papal speeches.\n\nIn the spirit of good neighborliness, residents celebrate Easter according to the Orthodox calendar, by special dispensation from the Vatican.\n\nRelated content Europe's most beautiful places\n\nPyrgi, Chios\n\nKnown as the \"painted village,\" Pyrgi belongs to the \"mastichochoria\" -- 24 medieval villages in Southern Chios where the aromatic resin of the mastic tree is cultivated.\n\nThe homes in Chios are decorated with grey-and-white geometric sgraffito decorations called \"xysta.\"\n\nPyrgi is the best place to appreciate them: There's barely a wall that's not been covered with some abstract designs.\n\nThe contrast between these monochromatic patterns and the colorful potted plants and creeping bougainvilleas is both a walker's delight and a photographer's dream.\n\nOia, Santorini\n\nOia is one of the most recognized places in Santorini. Alexey Vitvitsky/Sputnik/AP\n\nYes, Oia is expensive, overhyped and overcrowded, but for good reason.\n\nThis picturesque coastal village is undoubtedly the most celebrated spot in Santorini -- if not Greece.\n\nImages of almost every alley corner here have been shared so many times, they've shaped most people's idea of what a Greek island should look like.\n\nOia's enduring popularity means it attracts huge groups of tourists lured by the charm of its whitewashed houses with blue doors, the precipitous views over the volcanic caldera and the sheer vertical drop along the central walkway.\n\nTo avoid the crowds, it's best to come early in the morning, before the tour buses arrive, or late in the evening after the sunset-watchers have disappeared.\n\nLitochoro, Pieria\n\nLitochoro is a favorite with hikers due to its position at the entrance to Mount Olympus. John Malathronas\n\nThe location of a village can sometimes prove more important than its character, and this is certainly the case when it comes to Litochoro, with its celebrated views of Mount Olympus.\n\nWith its chalet-like buildings, wide streets and streams, it has the well-ordered, tidy vibe of a Swiss village. And yet, the smell in its main square is of souvlaki.\n\nLitochoro is also one of the departure points for the 9,577-feet-high peak of Mount Olympus, or the \"abode of the gods.\"\n\nLindos, Rhodes\n\nLindos is renowned for its ancient clifftop acropolis. Alexei Danichev/Sputnik/AP\n\nDuring the climbing season, the two-day trek to its 9,577-foot-high peak is mostly dry and sunny.\n\nHuddled under the ruins of an ancient acropolis, Lindos is a Greek village that should be on every traveler's bucket list.\n\nWith its car-free streets, sandy beaches and clear waters, and pathways so steep that beasts of burden are still used to negotiate them, it's easily one of the most idyllic places in Greece.\n\nBut word has leaked out and the summer crowds can be a turn off.\n\nThe only solution is to stay the night and head out outside the early afternoon tourist rush hour, when it's usually possible to roam the village calmly, climb the ruins unhurriedly, and swim in the coves unencumbered.\n\nRelated content 10 of the world's most beautiful islands\n\nChora, Folegandros\n\nPicking out the most beautiful capital in the Cyclades -- every single one of them called \"Chora\" on each island -- is a difficult task.\n\nThis choice will inevitably depend on individual taste and past personal experience.\n\nPutting all of that side, the Chora of Folegandros claims the most photographed lane in the Aegean.\n\nEasy to stumble into, the unnamed lane summarizes the charm of a village in which houses are wedged close together to avoid the marauding pirates of olden days, yet there's still enough space for several lively squares.\n\nAssos, Kefalonia\n\nThere's no better example of an Ionian fishing harbor than Kefalonia's Assos.\n\nBuilt among pines and cypresses on the craggy hillside of a jutting peninsula, the secluded village is part of the municipal unit Erisos.\n\nNot only is it picture perfect, with its vividly painted houses clashing with its lush green foliage and blue waters. It's situated close to Myrtos, which is arguably Kefalonia's finest sandy beach.\n\nTo top it all, the village is overlooked by the ruins of an atmospheric 16th-century Venetian castle that features superb sunset views.\n\nApiranthos, Naxos\n\nThis mountainous village in the island of Naxos is as picturesque as it gets. Shutterstock\n\nNaxos is the largest and the greenest of the Cyclades, with a mountain range that rises up to 3,000 feet.\n\nMeasuring around the same size as Barbados, it's home to several Cycladic mountain villages -- an apparent contradiction in terms -- but Apiranthos, built on the slopes of Mount Fanari, is the jewel in their crown.\n\nIts main serpentine thoroughfare features tall stone houses, marble street slabs and impressive inland views that miss out the sea for a change.\n\nApiranthos also proudly lays claim to no fewer than five quaint museums, Apiranthos Archaeological Museum, a Geological Museum, a Natural History Museum, a Visual Arts Museum and a Folklore Museum, some no bigger than a hotel room.\n\nRelated content 17 of the most secluded beaches in Greece\n\nPapingo, Pindos\n\nBased in the Pindos mountains, Papingo is made up of impressive stone architecture. Shutterstock\n\nThe gateway to the stunning Vikos Gorge in the Pindos mountains, Papingo is one of the 46 highland villages known as \"Zagorochoria.\"\n\nWhile its harsh mountain life led to mass emigration, the villages' scions include US presidential nominee Michael Dukakis.\n\nInterconnected by arched stone bridges and crisscrossed by mule tracks, the Zagorochoria are located in the middle of an area of outstanding natural beauty -- Greece's prime alpine tourist region.\n\nPapingo is particularly popular, partly due to the \"kolimbithres,\" huge granite rock formations naturally sculpted to create small pools, located within a short walking distance of the village.\n\nHikers heading to the nearby Vikos Gorge often go for a dip in the pools, which resemble baptismal fonts, to cool down in the summer.\n\nKalarites, Ioannina\n\nThe mountainous village of Kalarites in Ioannina, the capital of Epirus. Shutterstock\n\nSituated within Tzoumerka National Park in western Greece, Kalarites is filled with beautiful traditional gray stone houses.\n\nUnlike other mountain villages in Greece, the village lies in the middle of steppe-like grasslands perfect for the prevailing shepherding culture.\n\nIts inhabitants are mainly Vlachs, an ethnic group native to the southern Balkans who still speak a Latin-sounding language.\n\nIn fact, the name Kalarites itself means \"horsemen\" or \"horse riders\" and has the same root as \"caballeros.\"\n\nAs its livestock attracts and sustains predators, Tzoumerka is a region of Greece where you might spot bears and wolves that roam wild.\n\nGytheio, Laconia\n\nFishing boats in the charming village of Gytheio. Shutterstock\n\nAlthough it's more of a grownup seaside town nowadays, the attractive port of Gytheio still exudes a village atmosphere and charm, especially around its 19th-century waterfront.\n\nThe small harbor is joined through a jetty to the pine-clad islet of Marathonisi where, according to legend, Paris and Helen of Troy spent their first night after eloping from Sparta.\n\nIt's hard to choose between the views from Marathonisi to the mainland or vice versa, but the stroll around the waterside with its colorful fishing boats, solitary chapels and neoclassical facades is one of the most photogenic in Greece.\n\nKatastari, Zakynthos\n\nKatastari is based at the foot of the Vrachionas mountain. Shutterstock\n\nUnusually for a Greek village, Katastari isn't a huge tourist draw.\n\nThis is mainly because it lies around one and a half miles inland from beach resort Alykes, which attracts the package deal crowds.\n\nAs such, Katastari, built among olive groves and vineyards at the feet of Mount Vrachionas, is worth a visit, if only for observing the day-to-day Ionian village life undistracted by mass tourist trappings.\n\nThe twin-belfried Church of the Virgin Mary, far too big for such a small settlement, and the sweeping pelagic views from the monastery of St. John the Baptist are particular stand outs.\n\nRelated content World's best tidal and oceanside pools\n\nKastro, Sifnos\n\nIt's not often you'll find an abandoned Hellenistic-era marble sarcophagus used as a flower bed, but at least three adorn the lanes of Kastro.\n\nThis is one of many striking details about the pretty clifftop village set on the Aegean island of Sifnos.\n\nLike many islanders, Sifniots were regularly raided by pirates.\n\nHowever, the shape of Kastro, named after the castle that once stood here, created a strong defense.\n\nThe eastern side of the village, which was fortified by the Venetians in the 13th century, borders a steep, unassailable cliff.\n\nMeanwhile, on the inland side the outermost houses are built adjoining each other, thus forming a continuous barricade as good as a castle's curtain wall.\n\nAlthough you can spot similar building arrangements all over the Aegean, nowhere has it survived so pleasingly as here.\n\nArchanes, Crete\n\nArchanes is crammed with restored houses and quaint squares. Shutterstock\n\nLocated around 16 kilometers south of Heraklion, Archanes is considered one of the best restored villages in Greece.\n\nThe pale gray-green of its surrounding olive groves contrast wonderfully with the flamboyancy of its low-rise houses, creating a vibrant scene.\n\nWhite Aegean chic doesn't suit the Archanians, if the salmon pink, terracotta red and yolk yellow walls, brown wooden doors and blue or green window shutters embroidered by dashes of purple bougainvillea are anything to go by.", "description": "Greece may be home to some of the most stunning islands around, but the Mediterranean country also holds plenty of beautiful villages. From Oia to Kalarites, these are the standouts.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F191008114903-16-most-beautiful-greek-villages-super-tease.jpg", "published_at": "2019-10-10"}