{"pub": "reuters", "url": "https://in.reuters.com/article/pakistan-afghanistan-peace/pakistan-pm-to-urge-trump-to-restart-afghan-peace-talks-idINKBN1W31FG", "downloaded_at": "2019-09-18 23:32:06.172022+00:00", "title": "Pakistan PM to urge Trump to restart Afghan peace talks", "language": "en", "text": "Pakistan's Prime Minister Imran Khan gestures as he speaks during a rally in Muzaffarabad, Pakistan-administered Kashmir, September 13, 2019. REUTERS/Naseer Chaudary\n\nISLAMABAD (Reuters) - Pakistan Prime Minister Imran Khan said on Wednesday that he would urge U.S. President Donald Trump next week to revive Afghanistan peace talks with the Taliban militant group.\n\nTrump abruptly cancelled secret talks with the Taliban at his Camp David retreat that were planned for Sept. 8 and has since said the talks are “dead”.\n\n“It will be a big tragedy if these talks don’t make headway,” Khan said at a ceremony at Pakistan’s Torkham border crossing with Afghanistan.\n\nKhan said he would meet Trump in New York on Monday, and would emphasise that there had been “destruction and chaos in Afghanistan for the last 40 years”.\n\n“We will put our best (effort) that these talks are resumed again,” he said.\n\nKhan said Pakistan had directed Taliban leaders to participate in earlier peace talks in Qatar and only discovered too late that talks had broken down. He said his next role would have been to convince the Taliban to open talks with the Afghan government.\n\nKhan is scheduled to address the United Nations General Assembly while in New York.\n\nThe PM also said there was “no chance of talks” with India about its clampdown on the disputed territory of Kashmir until it lifted a curfew for people there.", "description": "Pakistan Prime Minister Imran Khan said on Wednesday that he would urge U.S. President Donald Trump next week to revive Afghanistan peace talks with the Taliban militant group.", "authors": ["Asif Shahzad", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190918&t=2&i=1431208805&w=1200&r=LYNXMPEF8H0TO", "published_at": "2019-09-18"}