{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/christie-brinkleys-ex-husband-peter-20755983", "downloaded_at": "2019-10-30 12:32:51.351534+00:00", "title": "Christie Brinkley's ex husband Peter Cook, 60, to marry 'soulmate' girlfriend, 21", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nChristie Brinkley 's ex husband Peter Cook, 60, is engaged to his 21-year-old student girlfriend and is set to marry her.\n\nHamptons-based architect Peter announced his engagement to college student Alba Jancou on Tuesday.\n\nThe pair have been dating for a year, and he split with Christie, 65, in 2006 when he was caught having an affair with his 18-year-old office clerk Diana Bianchi.\n\nCook shares daughter Sailor, 21, with his ex wife, and also adopted her son Jack, 24.\n\nHe popped the question to his girlfriend - who is the same age as his daughter - last month on the Greek island of Santorini, reported by Page Six .\n\nPeter called the 21-year-old his \"soulmate\" despite the 40-year-age gap between them.\n\n\"We consider ourselves incredibly lucky to have found, in each other, our soulmate,\" he told the publication.\n\n(Image: Getty Images)\n\nHe added: \"We are looking forward to many years of wedded bliss!\"\n\nA source said: \"They originally met two years ago at Le Bilboquet, but didn't start dating until a year ago. They are planning a destination wedding in Europe.\"\n\nThe bride-to-be is a psychology student in New York and Page Six were told she is Swiss, French and English.\n\n(Image: Getty Images for Manhattan Magaz)\n\n(Image: GC Images)\n\nIn photos of the engagement, the couple is dressed in all white in front of the Santorini backdrop, admiring her ring created by jewellery designer Glenn Bradford.\n\nHe proposed with a 6-carat diamond ring in front of a church on September 15.\n\n(Image: Getty Images)\n\n(Image: GC Images)\n\nHis second ex, Suzanne Shaw, who is in her 40s, accused him of having a \"secret pathological predilection\" for young women.\n\nThe pair divorced in 2014 after two years of marriage.", "description": "American star Christie Brinkley's ex husband is set to marry his girlfriend who is the same age as his daughter", "authors": ["Brogan-Leigh Hurst", "Image", "Getty Images", "Getty Images For Manhattan Magaz", "Gc Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20756322.ece/ALTERNATES/s1200/0_Manhattan-Magazine-And-Mensbookcom-Celebrate-Cover-Star-Aaron-Paul.jpg", "published_at": "2019-10-30"}