{"pub": "townhall", "url": "https://townhall.com/columnists/benshapiro/2019/09/18/the-alternative-history-of-the-united-states-n2553271", "downloaded_at": "2019-09-18 07:24:57.140018+00:00", "title": "The Alternative History of the United States", "language": "en", "text": "Last week, Democrats held their first true presidential debate. With the field winnowed down to 10 candidates -- three of them actual contenders for the nomination -- only one moment truly stood out. That moment came not from Joe Biden, Elizabeth Warren or Bernie Sanders but from a candidate desperate for attention: Beto O'Rourke.\n\nO'Rourke ran in 2018 for a Senate seat in Texas and lost in shockingly narrow fashion to incumbent Republican Sen. Ted Cruz. But his persona at the time was more Biden than Bernie: He ran as a unifying quasi-moderate, an Obama-esque figure determined to bring Americans together. In the early going of the presidential race, Beto was figured to be a prime contender: An April poll showed him in a solid third place. But he's faded dramatically; now the once-media darling is polling below 3 percent.\n\nSo O'Rourke has refashioned himself into a woke warrior. He's declared that he wants to forcibly remove guns from law-abiding Americans (\"Hell, yes, we're going to take your AR-15\"), that President Trump is a \"white supremacist\" posing a \"mortal threat to people of color\" and that the time has come for race reparations. Most dramatically, O'Rourke has refashioned his vision of American history. In this debate, he laid out his retelling of the American story, saying: \"Racism in America is endemic. It is foundational. We can mark the creation of this country not at the Fourth of July, 1776, but Aug. 20, 1619, when the first kidnapped African was brought to this country against his will and in bondage, and as a slave built the greatness and the success and the wealth that neither he nor his descendants would ever be able to fully participate in and enjoy.\"\n\nThis version of history is cribbed from \"The 1619 Project\" by The New York Times, a retelling of American history as a story rooted in white supremacy -- not colored by or affected by white supremacy but rooted in it. Capitalism, criminal justice, lack of universal health care, traffic patterns, Donald Trump's election -- all of it, according to \"The 1619 Project,\" is fundamentally based on America's legacy of slavery and racial discrimination.\n\nThat perspective on American history, in turn, is merely warmed over Howard Zinn. Zinn, the Marxist author of \"A People's History of the United States,\" sought to recast America's story as a story of hideous ugliness covered with the hypocritical facade of goodness. Never mind that \"A People's History\" is, in fact, rotten history -- factually inaccurate, wildly disjoined from a more comprehensive examination of time and place, near plagiarized from the work of better leftist historians. Zinn's history has now infused the teaching of American history in high schools and colleges across the country.\n\nBut that historical retelling is at odds with the better, truer story of America: the story of a nation founded on eternally good and true principles, principles only fully realized for many Americans at the cost of blood and sweat and death. Ex-slave Frederick Douglass's take on American history remains the most honest, as well as the most visionary. While acknowledging that to the American slave, Independence Day represents \"more than all other days in the year, the gross injustice and cruelty to which he is the constant victim,\" Douglass recognized that the Constitution is a \"glorious liberty document,\" the Declaration of Independence a charter of \"saving principles.\"\n\nAmerican history is our common history. O'Rourke's pathetic rewriting of American history is designed not to unify us as a nation but to divide us -- to call us away from the unifying principles that lie at the foundation of America, in favor of divisive principles of tribal partisanship. We must recognize the evils of American history -- that is part of our common story. In fact, our quest to rid ourselves of those evils is our common story. But if we wish to survive as a nation, we must also recognize that the story of America lies in the constant purification of our actions to align with our founding principles, not oppose them.\n\nBen Shapiro, 35, is a graduate of UCLA and Harvard Law School, host of \"The Ben Shapiro Show\" and editor-in-chief of DailyWire.com. He is the author of the No. 1 New York Times bestseller \"The Right Side Of History.\" He lives with his wife and two children in Los Angeles. To find out more about Ben Shapiro and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate website at www.creators.com.", "description": "Last week, Democrats held their first true presidential debate. With .09/18/2019 3:24:58AM EST.", "authors": ["Ben Shapiro", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/248/2f454db8-861c-48ac-bb4a-b1109ed0ae77.png", "published_at": "2019-09-18"}