{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/News/video/fallout-dni-testifies-whistleblower-report-65898099", "downloaded_at": "2019-09-27 11:58:39.218930+00:00", "title": "Fallout after DNI testifies on whistleblower report Video", "language": "en", "text": "Transcript for Fallout after DNI testifies on whistleblower report\n\nFirst to the latest on the white house and whistle-blower. The complaint now revealed showing president trump tried to pressure Ukraine to interfere in the 2020 election and that complaint alleges the white house tried to cover it up. The president cornered and furious right now. He unloaded on his staffers who cooperated with the whistle-blower. I want to know who's the person that gave the whistle-blower -- who's the person that gave the whistle-blower the information because that's close to a spy. Went on to say you know how we dealt with spies in the past. That was met by nervous laughter. Inside the white house confusion and worry after that explosive complaint that has created their biggest political battle yet. The impeachment threat is real. How fast it will go, how far it will go, two big questions this morning. Our senior congressional correspondent Mary Bruce starts us off from capitol hill. Good morning, Mary. Reporter: Good morning, George. Well, the revelations in this whistle-blower complaint have supercharged the impeachment fight on the hill. This investigation is now squarely focused on these allegations and Democrats here want to move quickly. Some telling us they want a vote on impeachment before the end of the year. The president of the united States has betrayed his oath of office. Betrayed his oath to defend our national security. This latest gambit to overturn the people's mandate is unhinged and dangerous. Reporter: This morning the whistle-blower complaint that sparked this controversy is sending shock waves through capitol hill. Do you solemnly swear -- Reporter: At the first major show down, Joseph Maguire defended the whistle-blower. I think the whistle-blower did the right thing. I think he followed the law every step of the way. You don't have any reason to accuse them of disloyalty to our country or suggest they're beholden to some other country, do you? Sir, absolutely not. Reporter: In the complaint, the whistle-blower claims multiple U.S. Government officials informed him that the president of the United States is using the power of his office to solicit interference from a foreign country in the 2020 U.S. Election referring to that July phone call where according to the white house summary the president asked his Ukrainian counterpart to investigate his political rival, Joe Biden. The whistle-blower was not a direct witness to most of the events described but says the white house officials who told me this information were deeply disturbed by the call and the likelihood that they had witnessed the president abuse his office for personal gain. Is it okay for a president to pressure, any president, to pressure a foreign government for help to win an election? It is unwarranted. It is unwelcome. It is bad for the nation to have outside interference. Reporter: And the whistle-blower goes on to allege that senior white house officials tried to cover it up. Writing that they intervened to, quote, lock down all records of the phone call, especially the official word-for-word transcript. That they were, quote, directed by white house lawyers to put that transcript in a separate electronic system typically used for classified information, and that this was not the first time under this administration that a presidential transcript was placed there solely for the purpose of protecting politically sensitive rather thank national security sensitive information. Mr. Maguire, do you agree that the definition of a cover-up is an attempt to prevent people from discovering a crime? I would say that's close. I mean, I'm sure there's others but I don't disagree with that. Reporter: It was submitted to the intelligence community's inspector general who determined it was credible and of urgent concern but the acting director refused to forward the complaint to congress, instead, he called the white house. So you went to the white house first. So you went to the subject of the complaint for advice first about whether you should provide the complaint to congress? There were issues within this, a couple of thing, one, it did appear that it has executive privilege. If it does have executive privilege, it is the white house that determines that. But in this case the white house, the president is the subject of the complaint. Reporter: Republicans were quick to denounce Democrats but they offered little defense of the president's actions. And now a growing number within trump's own party are voicing concerns. I want to say to the president, this is not okay. That conversation is not okay and I think it's disappointing to the American public when they read the transcript. Reporter: Now, even director Maguire says he does not know who the whistle-blower is and when pressed repeatedly he refused to say whether he's discussed this with the president saying only their conversations are privileged but we do know that the president was watching some of this hearing and, George, he was clearly not happy about it. Up and tweeting again this morning. Thanks very much.\n\nThis transcript has been automatically generated and may not be 100% accurate.", "description": "The acting director of national intelligence defended the whistleblower in the first major showdown of the impeachment inquiry.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/190927_gma_bruce3_hpMain_16x9_992.jpg", "published_at": "2019-09-27"}