{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/biden-defends-son-during-debate-hunter-did-nothing-wrong.html", "downloaded_at": "2019-10-16 03:55:36.386231+00:00", "title": "Joe Biden Sticks Up For Son in Debate: Hunter ‘Did Nothing Wrong’", "language": "en", "text": "Former Vice President Joe Biden during the Democratic Presidential Debate at Otterbein University on October 15, 2019 in Westerville, Ohio. Photo: Win McNamee/Getty Images\n\nJoe Biden stuck up for his son Hunter Biden at Tuesday night’s Democratic debate, saying that both he and his son “did nothing wrong” as it relates to the younger Biden’s former work in Ukraine.\n\nThe answer came in response to a question from moderator Anderson Cooper, who asked why it was permissible for Hunter Biden to be involved with a foreign business while his father was vice president.\n\n“My son did nothing wrong,” said Biden, who pledged Sunday that if elected, no one from his family will hold a job with a foreign government or a foreign corporation. “I did nothing wrong. I carried out the policy of the United States government in rooting out corruption in Ukraine. That’s what we should be focusing on.”\n\nBiden blamed “Rudy Giliani, the president and his thugs” for the attacks on his son. “I never discussed a single thing with my son about anything having to do with Ukraine. No one has indicated I have. We always kept everything separate.”\n\nBiden added that Trump, who is facing impeachment over his attempts to have Ukraine help him smear his potential 2020 opponent, is targeting him “because he knows if I get the nomination, I will beat him like a drum.”\n\n\"My son did nothing wrong. I did nothing wrong.\" Joe Biden defends himself and his son from President Trump's attack over Hunter Biden's business ties to Ukraine.\n\n\n\nThere has been no evidence of wrongdoing by either Joe or Hunter Biden. #DemDebate https://t.co/iHrlB317FI pic.twitter.com/a9TZI48JAQ — CNN (@CNN) October 16, 2019\n\nThe former VP’s defense of his son comes on the same day that Hunter Biden gave his first interview on the subject of Ukraine. In a sit-down with ABC News, after weeks of laying low, Hunter addressed his time on the board of the Ukrainian energy firm Burisma, which paid him as much as $50,000 a month. Biden admitted in the interview that taking the position was “poor judgment on my part.”\n\n“I gave a hook to some very unethical people to act in illegal ways to try to do some harm to my father,” he said. “That’s where I made the mistake. So I take full responsibility for that. Did I do anything improper? No, not in any way. Not in any way whatsoever.”", "description": "In the Ohio Democratic debate, Joe Biden defended his son Hunter, saying President Trump is attacking him and his family because he’s afraid to face him in the general election.", "authors": ["Adam K. Raymond"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/14/15-biden-debate-hunter.w1200.h630.jpg", "published_at": "2019-10-16"}