{"pub": "huffpost", "url": "https://huffpost.com/entry/trump-tries-to-make-nickelback-great-again-in-doctored-clip-attacking-joe-biden_n_5d954f95e4b0da7f66214441", "downloaded_at": "2019-10-03 07:06:50.913396+00:00", "published_at": "2019-10-03", "title": "Trump Just Politicized Nickelback And People Think We've Entered Another Universe", "language": "en", "text": "There’s bad news for those who were hoping the events involving President Donald Trump on Wednesday were part of an alternate timeline. They were very much real.\n\nFollowing a dramatic day of foul-mouthed tweeting, raging at reporters and awkward moments with visiting Finnish President Sauli Niinistö, Trump found time to drop a doctored version of Nickelback’s “Look At This Photograph” music video, which had been edited to include an image of Joe Biden and his son alongside two other men:\n\nLOOK AT THIS PHOTOGRAPH! pic.twitter.com/QQYTqG4KTt — Donald J. Trump (@realDonaldTrump) October 2, 2019\n\nThe video takes a swing at Biden for saying he never spoke with his son about his business dealings in Ukraine and follows up with an image of the father and son golfing with a man labelled as a “Ukraine Gas Exec.”\n\nThe gas exec is Devon Archer, Hunter Biden’s longtime American business partner. The two were both board members of Ukrainian gas company Burisma Holdings.\n\nThe president posted the video in response to the intensifying impeachment inquiry launched against him last week. A whistleblower complaint regarding his July 25 phone call with Ukrainian President Volodymyr Zelensky revealed that Trump asked Zelensky as a “favor” to investigate his 2020 rival and son based on unfounded corruption allegations relating to Burisma Holdings.\n\nTrump has accused Biden of seeking the removal of a prosecutor in Ukraine when he was Barack Obama’s vice president, supposedly in an attempt to quash an investigation into Burisma Holdings. Trump’s accusation was widely considered to be unfounded; numerous Ukrainian officials and independent media reports said there was no evidence Biden advocated for the prosecutor’s removal with his son’s interests in mind.\n\nPrior to posting the Nickelback tweet, Trump gave a press conference where he grew agitated while repeatedly refusing to answer a reporter’s question about what exactly he wanted to be investigated.\n\nPeople on social media were surprised by the Nickelback tweet for an array of reasons:\n\nThe writers of America have now unquestionably jumped the shark by having a Trump-Nickelback crossover in today's episode.\n\n\n\nIt's time to cancel this show and start from scratch. — Josh Jordan (@NumbersMuncher) October 2, 2019\n\nthe president is arguing against his impeachment by tweeting Nickelback memes\n\n\n\nwe are living in the shittiest Black Mirror episode of all time https://t.co/5JAsQxZpLl — Drew Landry (@MrDrewLandry) October 2, 2019\n\nImagine sitting in a coffee shop in 2014 and telling a friend that 5 years from now President Trump will try to buy Greenland, want to turn the border into an Indiana Jones-style snake pit and share Nickelback meme videos. The friend would drive you straight to a shrink’s office. — Adam Best (@adamcbest) October 2, 2019\n\nYou know your Presidency is over when you resort to tweeting Nickelback. — Nick Jack Pappas (@Pappiness) October 2, 2019\n\nhasn't nickelback suffered enough — Dave Itzkoff (@ditzkoff) October 2, 2019\n\nOur president is using Nickelback memes as political propaganda what the fuck is happening I must be dreaming — J (@JackJ) October 3, 2019\n\nTrump and Nickelback are trending and it's literally the end of civilization. RELEASE THE PEE TAPE. — Steve Silberman (@stevesilberman) October 2, 2019\n\nWe really live in a country where the president attacked a former Vice President by posting an altered Nickelback video. pic.twitter.com/La1kXDtAEM — Frederick Joseph (@FredTJoseph) October 2, 2019\n\nOnly one villain could make millions defend Nickelback — John Fugelsang (@JohnFugelsang) October 2, 2019\n\nWe're living in the dumbest timeline. https://t.co/Tjmz5Bbvda — Consequence of Sound (@consequence) October 2, 2019\n\nI have long warned you all about Nickelback, and I am now vindicated. — Charlotte Clymer🏳️‍🌈 (@cmclymer) October 2, 2019\n\nForcing the entire country to listen to Nickelback should be an impeachable offense. https://t.co/uErLemvH23 — Oliver Darcy (@oliverdarcy) October 2, 2019\n\nof course Nickelback is the official band of this era, of course it is — shauna (@goldengateblond) October 2, 2019\n\nI left Twitter for a couple of hours and came back to find that the President of the United States was continuing his #TrumpMeltdown by tweeting propaganda about Joe Biden's son and his business partner (before they went into business together in Ukraine) set to Nickelback. pic.twitter.com/scNBPdoIHb — Holly Figueroa O'Reilly (@AynRandPaulRyan) October 3, 2019\n\nI can’t think of anything more #MAGA than weaponizing Nickelback — John Cardillo (@johncardillo) October 3, 2019", "description": "Contrary to what some believe, we are not living in an alternate reality.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d9582ae2200005c01dc9408.png?cache=nk3o9uadiy&ops=1778_1000"}