{"pub": "reuters", "url": "https://ca.reuters.com/article/businessNews/idCAKCN1VP34J-OCABS", "downloaded_at": "2019-09-05 02:17:03.228442+00:00", "title": "Nissan CEO Saikawa admits to misconduct in compensation: Jiji", "language": "en", "published_at": "2019-09-05", "text": "FILE PHOTO: Nissan CEO Hiroto Saikawa attends a news conference to release first quarter earnings at the company headquarters in Yokohama, Japan July 25, 2019. REUTERS/Issei Kato\n\nTOKYO (Reuters) - Nissan Motor Co Chief Executive Hiroto Saikawa admitted to misconduct involving stock-related compensation and said he planned to return the portion he had wrongfully received, Jiji news agency reported.\n\nSaikawa made the comments to reporters on Thursday morning after media reported that an internal company probe had found he had received tens of millions of yen more than he should have through a stock appreciation rights (SAR) scheme.\n\n“I am deeply sorry for causing concern,” he told reporters, according to Jiji.\n\nThe company’s investigation came after former Nissan director Greg Kelly went public with the allegations earlier this year. Saikawa is expected to share the results of the probe at a board meeting to be held soon, the Asahi newspaper said.\n\nIn an interview with magazine Bungei Shunju published in June, Kelly said Saikawa was granted an exception in 2013 to reschedule a stock-linked bonus that bumped up the payout by 47 million yen ($445,962).\n\nThe admission is set to further erode confidence in Saikawa, already facing widespread accusations he was too close to ousted boss Carlos Ghosn, who, like Kelly, is awaiting trial on charges of financial misconduct. Both men have denied wrongdoing.\n\nDespite promising improved corporate governance and a better standing for Nissan in its relationship with top shareholder Renault SA, Saikawa was re-appointed by shareholders with the lowest approval rating among the 11 directors in June.\n\nNissan declined to comment on the reports of Saikawa’s misconduct or his comments to reporters on Thursday.", "description": "Nissan Motor Co Chief Executive Hiroto Saikawa admitted to misconduct involving stock-related compensation and said he planned to return the portion he had wrongfully received, Jiji news agency reported.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190905&t=2&i=1426341085&w=1200&r=LYNXNPEF832HW-OCABS"}