{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7598277/Unai-Emery-slams-VAR-Arsenal-boss-says-Mike-Dean-missed-clear-penalty-Sheffield-United-loss.html", "downloaded_at": "2019-10-22 15:16:30.018550+00:00", "title": "Unai Emery slams VAR as Arsenal boss says Mike Dean missed 'clear penalty' in Sheffield United loss", "language": "en", "text": "Arsenal manager Unai Emery was left berating VAR and ruing handing Sheffield United the ascendency at set-pieces after Monday night’s shock defeat.\n\nThe Gunners came crashing down to earth at Bramall Lane on a night they created little, with their manager suggesting inexperience hindered his side.\n\nA defiant Emery believes they should have headed back down to London with at least a point, however, and was incensed after John Egan’s apparent shirt pull on Sokratis Papastathopoulos was not reviewed.\n\nUnai Emery expressed his anger at a lack of intervention from VAR in Arsenal's loss on Monday\n\n‘It was a very clear the penalty with Sokratis. Very clear,’ Emery said. ‘I’ve watched it perfectly. The VAR is for this situation. It is to review and then decide.\n\n‘I’m very disappointing with the result. We created more chances, the best chances. We didn’t achieve that efficiency to win. But we didn’t deserve to lose.\n\n‘We conceded more corners than we wanted, a lot of corners in the first half and they scored in one action. Above all, we have to improve by not allowing balls like that.\n\n‘We are playing some young players who are taking experience but the most important thing is to win. The result is one thing, but we can analyse positively.’\n\nSokratis looked to be dragged back in the penalty box early on and Arsenal appealed for a foul\n\nThe former Dortmund player was running towards the front post when he was impeded\n\nThe defender waves his arms as he is dragged to the ground during a corner kick on Monday\n\nExperienced referee Mike Dean waved away penalty appeals to Arsenal's clear anger\n\nNo penalty... 🤔\n\n\n\nThe controversial weekend of refereeing and VAR continues as Arsenal are denied a penalty for what seems a clear pull of the shirt.\n\n\n\n📺 Watch on Sky Sports Premier League\n\n📱 Follow #SHUARS here: https://t.co/UXTjxqyPk6 pic.twitter.com/FI9b0C3adb — Sky Sports Premier League (@SkySportsPL) October 21, 2019\n\nLys Mousset’s winner came from a 30th-minute corner and Oli McBurnie revealed that the Blades had a gameplan to target Arsenal from set plays. Mousset’s goal was the 22nd time they have conceded from a set piece under Emery.\n\n‘I'm made up with the effort we put in,’ McBurnie said. ‘We knew they'd be vulnerable at set-pieces. We've said about matching performances to pick up points and we've done that.\n\n‘We knew it would be difficult for us this season. We're trying to play the way we did in the Championship and understand we're playing against a higher level opposition.’\n\nChris Wilder added: ‘It is absolutely crazy that we can open up against Arsenal. Whatever is put in front of us, we have to attack.\n\n‘To host a game like this, the magnitude, to play like that and get the win. We limited them to few chances and backed up a good performance with a good result. Every point is precious.’", "description": "Arsenal boss Unai Emery has added to a growing list of Premier League managers discontent with VAR after Arsenal were denied a penalty during their 1-0 defeat to Sheffield United on Monday night.", "authors": ["Jack Gaughan For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/23/20010674-0-image-a-36_1571696114947.jpg", "published_at": "2019-10-21"}