{"pub": "news24", "url": "https://fin24.com/News/move-past-the-three-minute-wow-factor-expert-warns-shopping-malls-20191025", "downloaded_at": "2019-10-25 21:57:43.487246+00:00", "title": "Move past the three-minute wow factor, expert warns shopping malls", "language": "en", "text": "The challenge in the changing retail sector is for shop owners and shopping malls to find ways to create spaces where people want to congregate, according to Lara Marrero, principal and global retail practice leader at global design and architecture firm Gensler.\n\n\"We are moving into the age of belonging.\n\n\"It is no longer enough to have a three-minute wow factor. At the end of the day people want to be part of a community.\n\n\"The age of belonging will yield an entirely different retail sector. It is about bringing people together in a space in a new and meaningful way,\" she told delegates at the annual conference of the SA Council of Shopping Centres (SACSC) in Cape Town.\n\nThe way people work and live is changing, she explained. Baby Boomers (those born between 1946 and 1964) designed cities and communities where there were barriers between working, living and playing. Generation X (those born from the mid-1960s to the early 1980s) questioned why those barriers existed, while Generation Z those born from the early 1990s to early 2000s) don’t even see any barriers.\n\n\"Today’s consumers take their best experience and make that the benchmark of for their next experience and time has become the most valuable commodity in the modern lifestyle,\" she said.\n\nIn her view, physical retail stores offer big opportunities.\n\nResearch by IHL Group indicated that for each company in the US closing a physical store, 2.7 companies are opening stores, because they realise the importance of a physical presence.\n\n'Touch and feel'\n\nIt was found that 86% of buyers will pay more for a better customer experience and 62% of shoppers still want to \"touch and feel stuff\" before buying.\n\nAbout 77% of Generation Z shoppers worldwide seem to actually prefer physical stores and 91% of shoppers actually do their research on products in stores.\n\nAn \"experience index\" compiled by Gensler found factors such as the social aspect, aspirations, entertainment and discovery were key factors determining the success of a retail space.\n\n\"Single-use spaces are becoming obsolete. The idea is to create communities around your brand. Ignore the social nature of a space at your own peril,\" Marrero told delegates.\n\n\"It is no longer a world of 'if you build it, they will come', but rather 'if you take care of it and constantly innovate, they will come.\"", "description": "The challenge in the changing retail sector is for shop owners and shopping malls to find ways to create spaces where people want to congregate, says and expert at a global design and architecture firm.", "authors": ["Carin Smith"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/4230/74fe9abab6684dd68c901e59a7ab77d3.jpg", "published_at": "2019-10-25"}