{"pub": "cbc", "url": "https://cbc.ca/sports/baseball/mlb/mlb-umprie-rob-drake-apology-tweet-1.5334821", "downloaded_at": "2019-10-25 21:58:33.362755+00:00", "title": "CBC Sports", "language": "en", "text": "Big league umpire Rob Drake has apologized for sending a politicized tweet this week that referenced an assault weapon and criticism of President Donald Trump.\n\nDrake unlocked his Twitter account on Thursday and posted several messages to say he was sorry.\n\nA day earlier, before Washington played at Houston in Game 2 of the World Series, commissioner Rob Manfred said Major League Baseball would investigate Drake's comments.\n\nDrake posted this message to Twitter on Tuesday: \"I will be buying an AR-15 tomorrow, because if you impeach MY PRESIDENT this way, YOU WILL HAVE ANOTHER CIVAL WAR!!! .MAGA2020\"\n\nDrake later deleted the post.\n\nIn a series of tweets, Drake apologized to victims of gun violence, fellow umpires and his family, and acknowledged he had caused a controversy for MLB.\n\nUmpire Rob Drake, whose viral tweet yesterday about buying a gun for a coming civil war led to an investigation by Major League Baseball that remains ongoing, sent along a statement to ESPN apologizing for the tweet. The full statement: <a href=\"https://t.co/jPYX8ZHpzO\">pic.twitter.com/jPYX8ZHpzO</a> —@JeffPassan\n\n\"I never intended to diminish the threat of violence from assault weapons, or violence of any kind,\" he said.\n\n\"I know that I cannot unsay the words, but please accept my apologies,\" he said.\n\nThe umpires' union, in a statement Wednesday, said: \"Rob is a passionate individual and an outstanding umpire. He chose the wrong way to convey his opinion about our great country.\"\n\nDrake, 50, has worked spring training or regular-season major league games since 1999 and joined the big league staff in 2010. He was not assigned to work the post-season this year.", "description": "Big league umpire Rob Drake has apologized for sending a politicized tweet this week that referenced an assault weapon and criticism of President Donald Trump.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5334823.1571976105!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/drake-rob-102519.jpg", "published_at": "2019-10-25"}