{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/07/medvedev-swats-aside-dimitrov-to-make-us-open-final-as-sublime-run-goes-on", "downloaded_at": "2019-09-07 02:12:15.537955+00:00", "title": "Medvedev swats aside Dimitrov to make US Open final as sublime run goes on", "language": "en", "text": "Medvedev swats aside Dimitrov to make US Open final as sublime run goes on\n\nThe glorious, unexpected summer of Daniil Medvedev continued as he marched to his first grand slam final with a 7-6 (5), 6-4, 6-3 victory over Grigor Dimitrov at Flushing Meadows, making him the first Russian male grand slam finalist since Marat Safin in 2005.\n\nMedvedev, who had never previously passed the fourth round of a grand slam, entered the match having won 19 of his past 21. The strain of the effort was reflected in the strips of tape lining his body throughout his run, addressing injuries to his shoulder, adductor and quadriceps.\n\nDaniil Medvedev beats Grigor Dimitrov to reach US Open final – as it happened Read more\n\nBut the effect was also mental. Throughout the first set Dimitrov dictated rallies as the Russian struggled to deal with his low, skidding backhand slice. Despite Dimitrov winning more points, hitting more winners and fewer errors, Medvedev won the big points and edged out the first set tiebreak 7-6 (5).\n\nAfter ample breaks and unforced errors from both, the second set culminated in a long game at 4-4 on Medvedev’s serve, where Dimitrov provided all of the inspiration with dropshots and flashy forehand winners, but Medvedev held firm. Predictably, the Russian then broke serve to take a two-set lead.\n\nBy the third set, Medvedev was relaxed and his landed the definitive break at 3-1, speeding through his service games to continue a summer that just won’t end.\n\nMedvedev will rise to a new ranking of world No 4 and he is only the third player in history, after former No 1 players Ivan Lendl and Andre Agassi, to reach finals in Washington, Canada, Cincinnati and the US Open in the same year.", "description": "Daniil Medvedev marched into his first grand slam final with a 7-6 (5), 6-4, 6-3 victory over Grigor Dimitrov at Flushing Meadows", "authors": ["Tumaini Carayol"], "top_image": "https://i.guim.co.uk/img/media/a47409baec3fa5666dc002e1a90d8735de3e286c/0_0_5137_3083/master/5137.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=36f7c7d62df9ebbf5d73282393cab8fa", "published_at": "2019-09-07"}