{"pub": "realclearpolitics", "url": "https://realclearpolicy.com/articles/2019/09/25/dont_let_a_worthy_immigration_reform_hurt_american_health_care_111278.html", "downloaded_at": "2019-09-25 13:39:17.908720+00:00", "title": "Don't Let a Worthy Immigration Reform Hurt American Health Care", "language": "en", "text": "Don't look now, but Congress is on the verge of actually passing bipartisan legislation — on immigration, no less.\n\nThe Fairness for High-Skilled Immigrants Act, which passed the House of Representatives in July by 365 votes to 65, is currently before the Senate with 35 cosponsors. The effort is spearheaded by Sens. Mike Lee (R-UT) and Kamala Harris (D-CA) who don't agree on much.\n\nThe legislation would eliminate the current country-specific quotas on employment-based green cards. These quotas, set at a maximum of seven percent per country of origin, mean that the same number of green cards are given out per country, regardless of size. It means China and India get the same number of green cards as Canada and Ireland. As Sen. Lee pointed out on the Senate floor last week, this status quo is de facto discrimination based on national origin, rewarding birthplace over merit.\n\nThe Fairness for High-Skilled Immigrants Act is exactly the type of commonsense legislation that Americans want to see from Washington. But there's a thorn in this legislative rose that must be addressed before this bill is passed. The bill would inadvertently threaten America's nurse supply, impacting the entire healthcare system.\n\nBy merging the many country-specific green card lanes into one, prospective immigrants from smaller countries would see their wait times increase as the backlog from China and India is cleared out. The biggest consequence of this wait line reorder is that Philippine nurses would see their immigration wait-times skyrocket.\n\nOf all the American industries that depend on immigrant labor, there's none as important as nursing. More than one in six registered nurses and one-quarter of nursing aides are immigrants.\n\nAnd just as immigrant tech workers disproportionately come from India, immigrant nurses tend to come from the Philippines. In California, for instance, 20 percent of all registered nurses are Filipino.\n\nCurrently, Philippine immigrants can get green cards relatively quickly, but if this legislation passes, their wait time will increase to seven or eight years.\n\nAmericans can't wait that long for new nurses. More than 10,000 people in the country turn 65 every day. With an aging and growing population, the demand for nurses is strong. And domestic supply can't meet it. Due to the rigors of the job, one-third of newly-licensed registered nurses in the U.S. leave the professions within two years. And one million registered nurses are expected to retire by 2030.\n\nAccording to the Bureau of Labor Statistics, the U.S. will need nearly two million net new registered nurses, nursing assistants, nurse practitioners, and home healthcare aides by 2028. Nurses are the lubricant of the healthcare system, and their shortage threatens to grind broader portions of American healthcare to a halt. Research suggests the patient-to-nurse ratio and mortality rates are positively correlated.\n\nFortunately, Sens. David Perdue and Rand Paul have recognized this unintended consequence in the bill and are working with Sen. Lee to address it. A fix isn't difficult. It simply involves including a substantial carveout for vital healthcare workers, so they're exempt them from the green card quota.\n\nWith such an uncontroversial amendment included in this bill, this bipartisan legislation can pass Congress with nearly unanimous support. Who knows, this legislation may even lay the groundwork for needed bipartisan action on the most pressing issues facing the country in the months and years to come.\n\n\n\nAlfredo Ortiz is the president and CEO of the Job Creators Network.", "description": "Don't look now, but Congress is on the verge of actually passing bipartisan legislation \u0097 on immigration, no less. The Fairness for High-Skilled Immigrants Act, which passed the House of...", "authors": [], "top_image": "https://assets.realclear.com/images/48/489372_5_.jpg", "published_at": "2019-09-25"}