{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-impeachment-house-congress-judiciary-committee-vote-pass-guidelines-2020-a9102776.html", "downloaded_at": "2019-09-12 23:44:58.036978+00:00", "title": "House moves closer to impeaching Trump after passing key vote", "language": "en", "text": "The Democratic-controlled House Judiciary Committee has passed a vote to set the rules for hearings on impeaching Donald Trump – a move seen as a major step forward in the panel’s investigations into the president.\n\nThe resolution passed on Thursday is a technical step, and the committee would still have to introduce impeachment articles against Mr Trump and win approval from the House to bring charges against him.\n\nIt’s unclear if that will ever happen, as house speaker Nancy Pelosi has urged caution on the issue, saying the public still isn’t yet supportive of taking those steps.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe president immediately responded on Twitter with a quote he attributed to Al Green, one of the first Democrats to call for an impeachment vote: “‘We can’t beat him, so let’s impeach him!’ Democrat Rep. Al Green,” Mr Trump wrote.\n\nIt was not immediately clear whether the congressman had in fact said that exact quote, though in a TV interview in May he said: “I’m concerned that if we don’t impeach the president, he will get re-elected.”\n\nDespite the Democratic leadership’s reticence, the committee pressed forward, with chair Jerrold Nadler saying: “We have a constitutional, historical, and moral obligation to fully investigate these matters.”\n\nBefore the vote, he said: “Let us take the next step in that work without delay. I urge my colleagues to adopt this resolution, and I yield back.”\n\nShape Created with Sketch. Trump protests: President visits Texas and Ohio after mass shootings Show all 31 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Trump protests: President visits Texas and Ohio after mass shootings 1/31 Miami Valley Hospital, Dayton Demonstrators chant as they protest the arrival of President Donald Trump outside Miami Valley Hospital after a mass shooting that occurred in the Oregon District AP 2/31 El Paso Trump headed to El Paso, after visiting Dayton, Ohio to offer a message of healing and unity, but he was met by hostility in both places by people who fault his own incendiary words as a contributing cause to the mass shootings AP 3/31 El Paso, University Medical Centre US President Donald Trump greets first responders as he visits El Paso Regional Communications Centre AFP/Getty 4/31 El Paso, University Medical Centre An anti-Trump protestor holds a sign as police are lined up outside University Medical Centre Getty 5/31 El Paso AP 6/31 El Paso AFP/Getty 7/31 Miami Valley Hospital, Dayton AP 8/31 El Paso Democratic presidential candidate Beto ORourke hugs a woman at a makeshift memorial outside Walmart honoring victims of the mass shooting there which left 22 people dead. Getty 9/31 El Paso AFP/Getty 10/31 El Paso AP 11/31 El Paso, University Medical Centre Reuters 12/31 El Paso, University Medical Centre President Trump and First Lady Melania Trump greet PFC Glendon Oakley (second right), who saved several lives during the mass shooting in Texas AFP/Getty 13/31 Miami Valley Hospital, Dayton AP 14/31 El Paso, University Medical Centre Reuters/Amanda Voisard 15/31 El Paso Beto ORourke consoles a man at the makeshift memorial outside Walmart Getty 16/31 El Paso, University Medical Centre An anti-Trump demonstrator yells near police outside the University Medical Centre Reuters 17/31 El Paso AFP/Getty Images 18/31 Dayton President Donald Trump and First Lady Melania Trump arrive at Wright-Patterson Air Force Base AP 19/31 El Paso Makeshift memorial for victims of the shooting that left a total of 22 people dead at the Cielo Vista Mall Walmart AFP/Getty Images 20/31 Miami Valley Hospital, Dayton AP 21/31 President Trump greets Dayton Mayor Nan Whaley as he arrives at Wright-Patterson Air Force Base AFP/Getty 22/31 Miami Valley Hospital, Dayton AP 23/31 Dayton Damon Smith presents a message to President Donald Trump beside a makeshift memorial in Dayton AP 24/31 Miami Valley Hospital, Dayton Demonstrators gather in front of an inflatable \"Baby Trump\" to protest the presidents arrival AP 25/31 Miami Valley Hospital, Dayton AP 26/31 El Paso A photo of victim Javier Amir Rodriguez, a 15-year-old sophomore Getty 27/31 Dayton AFP/Getty 28/31 El Paso A message is left for Donald Trump AFP/Getty 29/31 El Paso AFP/Getty 30/31 El Paso People hug at the makeshift memorial AFP/Getty 31/31 El Paso People pray at the makeshift memorial AFP/Getty 1/31 Miami Valley Hospital, Dayton Demonstrators chant as they protest the arrival of President Donald Trump outside Miami Valley Hospital after a mass shooting that occurred in the Oregon District AP 2/31 El Paso Trump headed to El Paso, after visiting Dayton, Ohio to offer a message of healing and unity, but he was met by hostility in both places by people who fault his own incendiary words as a contributing cause to the mass shootings AP 3/31 El Paso, University Medical Centre US President Donald Trump greets first responders as he visits El Paso Regional Communications Centre AFP/Getty 4/31 El Paso, University Medical Centre An anti-Trump protestor holds a sign as police are lined up outside University Medical Centre Getty 5/31 El Paso AP 6/31 El Paso AFP/Getty 7/31 Miami Valley Hospital, Dayton AP 8/31 El Paso Democratic presidential candidate Beto ORourke hugs a woman at a makeshift memorial outside Walmart honoring victims of the mass shooting there which left 22 people dead. Getty 9/31 El Paso AFP/Getty 10/31 El Paso AP 11/31 El Paso, University Medical Centre Reuters 12/31 El Paso, University Medical Centre President Trump and First Lady Melania Trump greet PFC Glendon Oakley (second right), who saved several lives during the mass shooting in Texas AFP/Getty 13/31 Miami Valley Hospital, Dayton AP 14/31 El Paso, University Medical Centre Reuters/Amanda Voisard 15/31 El Paso Beto ORourke consoles a man at the makeshift memorial outside Walmart Getty 16/31 El Paso, University Medical Centre An anti-Trump demonstrator yells near police outside the University Medical Centre Reuters 17/31 El Paso AFP/Getty Images 18/31 Dayton President Donald Trump and First Lady Melania Trump arrive at Wright-Patterson Air Force Base AP 19/31 El Paso Makeshift memorial for victims of the shooting that left a total of 22 people dead at the Cielo Vista Mall Walmart AFP/Getty Images 20/31 Miami Valley Hospital, Dayton AP 21/31 President Trump greets Dayton Mayor Nan Whaley as he arrives at Wright-Patterson Air Force Base AFP/Getty 22/31 Miami Valley Hospital, Dayton AP 23/31 Dayton Damon Smith presents a message to President Donald Trump beside a makeshift memorial in Dayton AP 24/31 Miami Valley Hospital, Dayton Demonstrators gather in front of an inflatable \"Baby Trump\" to protest the presidents arrival AP 25/31 Miami Valley Hospital, Dayton AP 26/31 El Paso A photo of victim Javier Amir Rodriguez, a 15-year-old sophomore Getty 27/31 Dayton AFP/Getty 28/31 El Paso A message is left for Donald Trump AFP/Getty 29/31 El Paso AFP/Getty 30/31 El Paso People hug at the makeshift memorial AFP/Getty 31/31 El Paso People pray at the makeshift memorial AFP/Getty\n\nThe vote passed on party lines, with all Democrats voting in favour of the resolution and all Republicans voting in opposition.\n\nHowever, even if the house does recommend impeachment charges against the president, the Republican-led Senate is unlikely to convict him and remove him from office. Mr Nadler has said that the committee will push forwards with impeachment hearings this autumn, bolstered by lawmakers on the panel who roundly support the move.\n\nThe vote on Thursday set rules for those hearings, empowering staff to question witnesses, allowing some evidence to remain private and permitting the president’s counsel to respond to testimony.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nThe committee says that the resolution is similar to procedural votes taken at the beginning of the impeachment investigations into presidents Richard Nixon and Bill Clinton.\n\n“The adoption of these additional procedures is the next step in that process and will help ensure our impeachment hearings are informative to congress and the public, while providing the president with the ability to respond to evidence presented against him,” Mr Nadler said in a statement. “We will not allow Trump’s continued obstruction to stop us from delivering the truth to the American people.”\n\nThe committee has also filed two lawsuits against the administration after the White House repeatedly blocked the panel from obtaining documents and testimony. Ms Pelosi has said she wants to see what happens in court before making any decisions on impeachment.\n\nThe first hearing under the new impeachment rules would be with Corey Lewandowski on 17 September.\n\nMr Lewandowski, the president’s former campaign manager, was frequently mentioned in former special counsel Robert Mueller’s report, which the committee has been investigating.\n\nAccording to the report, Mr Trump asked Mr Lewandowski to deliver a message to then-attorney general Jeff Sessions, asking him to limit the federal probe.\n\nThe committee has also invited two other witnesses mentioned in the report, former White House aides Rick Dearborn and Rob Porter. The White House has previously blocked former employees from testifying, but Mr Lewandowski never officially worked for the White House.\n\nAssociated Press contributed to this report", "description": "The Democratic-controlled House Judiciary Committee has passed a vote to set the rules for hearings on impeaching Donald Trump – a move seen as a major step forward in the panel’s investigations into the president.  The resolution passed on Thursday is a technical step, and the committee would still have to introduce impeachment articles against Mr Trump and win approval from", "authors": ["Chris Riotta"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/10/19/front-trump-11-september-5.jpg", "published_at": "2019-09-12"}