{"pub": "investing.com", "url": "https://newsbtc.com/2019/10/01/eos-price-surges-15-on-sec-settlement-where-will-it-go-next", "downloaded_at": "2019-10-01 04:29:58.941969+00:00", "title": "EOS Price Surges 15% on SEC Settlement, Where Will It Go Next?", "language": "en", "text": "Today has been a generally good day for most of the altcoins with decent gains all round following a week from hell. One of the top performers at the moment is EOS which has surged almost 15 percent on the news that Block.one has settled with the SEC.\n\nBig Pump For EOS\n\nMost of 2019 has been pretty miserable for altcoins, EOS included. A mid-year spurt had the crypto community chattering about altseason but all gains have been unceremoniously dumped over the past three months.\n\nEOS topped out at around $8.70 during this peak but has since fallen back 70 percent to a low of $2.60 last week. It is not far off the 2018 bottom at the moment and in need of some positive developments. A few hours ago things started to move for EOS as it lifted off an intraday low of $2.70 to top out just over $3.11 according to Tradingview.com.\n\nThe move takes the token back to a weekly high but there is a long way to go in the bigger picture. The daily chart still exhibits a strong down trend for this and all of the other altcoins. It was enough to enable EOS to flip BNB for seventh spot in terms of market cap which is currently $2.8 billion.\n\nBlock.one Fined 0.6% of ICO Funds\n\nThe news that Block.one has settled with the Securities and Exchange Commission over an unregulated token sale charge has provided the momentum today. The blockchain firm was charged for conducting an unregistered initial coin offering of crypto tokens between June 26, 2017 and June 1, 2018 according to the official announcement.\n\nAccording to co-director of the SEC’s Division of Enforcement, Steven Peikin;\n\n“Block.one did not provide ICO investors the information they were entitled to as participants in a securities offering,”\n\nThe fine, however, is a paltry $24 million which is just 0.6% of the $4 billion the firm raised during the year-long ICO. Naturally Block.one is happy with the outcome though it neither confirmed nor denied the allegations. The company responded stating;\n\n“We are excited to resolve these discussions with the SEC and are committed to ongoing collaboration with regulators and policy makers as the world continues to develop more clarity around compliance frameworks for digital assets.”\n\nAs some kind of justification it added that the ERC-20 tokens sold during the ICO are no longer traded or in circulation since the platform was migrated from Ethereum to EOSIO shortly after the sale concluded.\n\nToday has been a good day for Block.one and EOS but future price direction will depend largely on the general state of the altcoin market since none of them have managed to decouple from Bitcoin and make independent progress yet.\n\nImage from Shutterstock", "description": "Today has been a generally good day for most of the altcoins with decent gains all round following a week from hell. One of the top performers at the", "authors": [], "top_image": "https://www.newsbtc.com/wp-content/uploads/2019/10/eos-1200x780.jpg", "published_at": "2019-10-01"}