{"pub": "guardian", "url": "https://theguardian.com/travel/2019/sep/30/tokyo-japan-bar-martha-shibuya-ebisu-whisky", "downloaded_at": "2019-09-30 10:47:17.593150+00:00", "title": "Bar Martha, Tokyo, where the customer isn’t always right", "language": "en", "text": "Listen, don’t talk. And remember, the man behind the decks does not take requests. Follow these simple edicts and you’ll thoroughly enjoy this idiosyncratic bar\n\nThere are few places in Tokyo as polarising as Bar Martha. Online reviews congregate heavily around both ends of the scale and, depending which you listen to, it is either the “worst experience in Tokyo” or “brilliantly unapologetic” and “coolest place in the city”.\n\nThis is no accident – few things are at this bar. Rather it is the product of the take-no-prisoners attitude of the bar’s owner, Wataru Fukuyama, a 56-year-old visionary or tyrant, according to your take on him.\n\nFacebook Twitter Pinterest ‘Visionary or tyrant?’ … Wataru Fukuyama. Photograph: Oscar Boyd\n\nBar Martha is what is known in Japan as a listening bar, where music comes first and talking a definite second. Though there are others in the city – JBS and Grandfather’s are among the better-known – Bar Martha, in Tokyo’s Ebisu neighbourhood, is further off the beaten track, patronised by Japanese audiophiles and well-dressed locals.\n\nFacebook Twitter Pinterest Photograph: Oscar Boyd\n\nThose who talk too loudly or disturb the atmosphere are liable to be unceremoniously thrown out. This is not a place to visit in a large group ready for loud and lively conversation; groups larger than two or three should head instead to an izakaya (pub).\n\n“I have never run a bar that has considered what the customer wants,” says Fukuyama tells us one evening at his bar. “People often say that the customer is always right, but I’m not confident that’s true. I don’t do something just because it will attract customers. [Bar Martha] is about what I like doing and the kind of place I want to run.”\n\nWhat Fukuyama likes is music. Enter the softly lit, cavernous bar space and, after a brief explanation of the rules, you’ll be greeted by a vast wall of more than 6,000 vinyl records, which Fukuyama plays on twin turntables. Music is played across two 1960s Tannoy speakers, which Fukuyama chose for a vintage quality that sounds “akin to a rainy day in the UK”, where the speakers were originally built.\n\n“I look at the customers and think ‘who is listening?’” says Fukuyama. “Only 50 people can be in here at any one time. I often play music for the one person who is listening most intently. I think to myself, ‘How old are they? What would they want to listen to?’ I play something and watch for their reaction.”\n\nFacebook Twitter Pinterest The bar has more than 6,000 vinyl records. Photograph: Oscar Boyd\n\nOver the course of an evening, the soundtrack shifts from mellow Ella Fitzgerald to the raucous clang of The Clash’s “Should I Stay or Should I Go”, shifting with the flow of customers in and out of the bar. The music is never static, never dwells on one genre for too long.\n\nNestled between and in front of the speakers are rows of high-end bottles of whisky, glistening beneath spotlights. The spirit is Bar Martha’s main focus, but the menu is all-encompassing, and ranges from draft beer through to a very enjoyable mango mojito.\n\nThe 50 seats are spread between a long wooden counter (sit here to be closest to the bartenders, the vinyls and the watchful eye of Fukuyama) and more intimate hardwood tables in the recesses toward the back.\n\nFacebook Twitter Pinterest The modest, but stylish, exterior. Photograph: Oscar Boyd\n\nAll designed by Fukuyama, it is extraordinarily photogenic, but here comes the most frequent sticking point: photos are absolutely forbidden; Fukuyama doesn’t use the internet and has no desire for a presence on social media. If caught, you will be politely but firmly be asked to leave or have your next drinks order refused.\n\nCertainly, Bar Martha is not for everyone, but if you’re prepared to follow the rules, it could just be the best bar in Tokyo.\n\n• ¥800 (£6) per person cover charge (added to bill), 1 Chome-22-23 Ebisu, Shibuya City, martha-records.com/martha/\n\nOscar Boyd is the travel and food editor at The Japan Times. Nick Sinclair is a contributor to The Japan Times’ food section\n\nLooking for a holiday with a difference? Browse Guardian Holidays to see a range of fantastic trips", "description": "Listen, don’t talk. And remember, the man behind the decks does not take requests. Follow these simple edicts and you’ll thoroughly enjoy this idiosyncratic bar", "authors": ["Oscar Boyd", "Nick Sinclair"], "top_image": "https://i.guim.co.uk/img/media/8ec08f7e1c24eb968a392f7c61117af41ad21668/532_292_5227_3136/master/5227.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c3973750d78ab8989bdebe63db4aa79d", "published_at": "2019-09-30"}