{"pub": "reuters", "url": "https://reuters.com/article/us-mexico-violence/trump-lopez-obrador-agree-to-take-action-to-freeze-flow-of-weapons-to-mexico-idUSKBN1WY0IW", "downloaded_at": "2019-10-19 19:11:54.498560+00:00", "title": "Trump, Lopez Obrador agree to take action to freeze flow of weapons to Mexico", "language": "en", "text": "FILE PHOTO: U.S. President Donald Trump rallies with supporters in Dallas, Texas, U.S. October 17, 2019. REUTERS/Jonathan Ernst\n\nMEXICO CITY (Reuters) - Mexico’s foreign minister said on Saturday that President Andres Manuel Lopez Obrador and his U.S. counterpart Donald Trump had agreed to take swift action to stem the flow of illegal weapons from the United States into Mexico.\n\nLopez Obrador told Trump on a phone call that technology could be used to halt the weapons entering Mexico, to which Trump responded that it was a “good idea,” Foreign Minister Marcelo Ebrard told reporters.\n\nThe two leaders agreed that U.S. and Mexican officials would meet in the next few days to discuss options, and would announce actions to “freeze” illegal imports of weapons into Mexico through U.S. border crossings.\n\nThe discussion came in the wake of Mexican authorities’ bungled attempt to arrest a drug kingpin’s son, which prompted a wave of violence in the northwestern city of Culiacan.\n\nCartel gunmen surrounded about 35 police and national guard on Thursday in the capital of Sinaloa state and made them free Ovidio Guzman, one of jailed drug lord Joaquin “El Chapo” Guzman’s dozen or so children. Ovidio Guzman’s brief detention had set off widespread gun battles and a jailbreak that stunned the country.\n\n“If the order would have been given to continue with the operation in Culiacan we estimate that more than 200 people, mostly civilians, would have been killed,” said Ebrard, adding that so-called “collateral damage” was unacceptable to the Mexican government.\n\nThe chaos in Culiacan, a bastion of the elder Guzman’s Sinaloa cartel, has turned up pressure on Lopez Obrador, who took office in December promising to pacify a country weary of more than a decade of gang violence.", "description": "Mexico's foreign minister said on Saturday that President Andres Manuel Lopez Obrador and his U.S. counterpart Donald Trump had agreed to take swift action to stem the flow of illegal weapons from the United States into Mexico.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191019&t=2&i=1442719743&w=1200&r=LYNXMPEF9I0GN", "published_at": "2019-10-19"}