{"pub": "arynews", "url": "https://arynews.tv/en/imf-positive-outcomes-govt-economic-policies", "downloaded_at": "2019-10-29 23:58:51.001854+00:00", "title": "IMF lauds positive outcomes of govt’s economic policies", "language": "en", "text": "ISLAMABAD: An International Monetary Fund (IMF) mission lauded the positive results being yielded by the policies and strategies put in place by the government to remove imbalances in the economy.\n\nMiddle East and Central Asia Mission Chief Ramirez Rigo Ernesto, who led the missing during a meeting with Adviser to the Prime Minister on Finance Abdul Hafeez Shaikh in Islamabad, said the volatility in the exchange rate had been reduced while successes have also been achieved in other areas, especially on the fiscal front.\n\nHe said the IMF Mission was looking forward to having a meaningful and productive review by aiming at a forward-looking approach with a focus on the adjustments required till March, especially in the power sector and fundings from various bilateral and multilateral sources for boosting Pakistan’s foreign exchange.\n\nDr. Shaikh said: “The containment of current and fiscal deficits and stabilisation of exchange rate are indicative of the success of government efforts to put the economy on the long-term growth track.”\n\nHe told the visiting mission that Pakistan enjoyed a very cordial relationship with the IMF and it had been further strengthened during his recent visit to Washington where productive meetings culminating in fruitful discussions were held with the senior IMF management.\n\nHe said Pakistan valued the IMF support and financial assistance and Prime Minister Imran Khan was personally overseeing and monitoring the progress achieved in various sectors of the economy.\n\nState Bank of Pakistan Governor Reza Baqir, Secretary Finance Naveed Kamran Baloch, FBR Chairman Shabbar Zaidi, Special Secretary Finance Omar Hamid Khan and other senior officials of the Finance Division and the local IMF officials were also present.\n\nComments\n\ncomments", "description": "An International Monetary Fund (IMF) mission, led by its Middle East and Central Asia Mission Chief Ramirez Rigo Ernesto, lauded the positive results being produced by the policies and strategies put in place by the government to remove imbalances in the economy", "authors": ["Web Desk"], "top_image": "https://arynews.tv/wp-content/uploads/2019/10/IMF-4.jpg", "published_at": "2019-10-29"}