{"pub": "reuters", "url": "https://reuters.com/article/us-britain-eu-johnson/british-pm-johnson-i-want-a-brexit-deal-but-parliament-doesnt-daunt-me-idUSKCN1VU0VT", "downloaded_at": "2019-09-09 10:27:53.054594+00:00", "title": "British PM Johnson: I want a Brexit deal but parliament doesn't daunt me", "language": "en", "text": "Britain's Prime Minister Boris Johnson looks on during a meeting with Ireland's Prime Minister (Taoiseach) Leo Varadkar in Dublin, Ireland, September 9, 2019. REUTERS/Phil Noble\n\nDUBLIN (Reuters) - British Prime Minister Boris Johnson said on Monday he wanted a Brexit deal on Oct. 18 and that he was undaunted by attempts by parliament to block a no-deal exit.\n\n“I’m absolutely undaunted by whatever may take place in parliament,” Johnson said. “I think what the British people want us to do is to deliver a deal and to get on and take us out on Oct. 31.”\n\nSpeaking in Ireland alongside Irish Prime Minister Leo Varadkar, Johnson said he was bringing ideas on ways to resolve the Irish border backstop but that a breakthrough was unlikely on Monday.\n\n“I have one message that I want to land with you today, Leo, that is I want to find a deal, I want to get a deal,” Johnson said. “Like you I’ve looked carefully at no-deal, I’ve assessed its consequences both for our country and yours.”\n\n“And yes, of course, we could do it, the UK could certainly get through it but be in no doubt that outcome would be a failure of statecraft for which we would all be responsible,” Johnson said.\n\n“So for the sake of business, for farmers, and millions of ordinary people who are counting on us to use our imagination and creativity to get this done. I want you to know I would overwhelmingly prefer to find an agreement.”", "description": "British Prime Minister Boris Johnson said on Monday he wanted a Brexit deal on Oct. 18 and that he was undaunted by attempts by parliament to block a no-deal exit.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190909&t=2&i=1427894000&w=1200&r=LYNXNPEF880TR", "published_at": "2019-09-09"}