{"pub": "arstechnica", "url": "https://arstechnica.com/gaming/2019/09/jesse-pinkman-is-on-the-lam-in-first-official-el-camino-trailer", "downloaded_at": "2019-10-05 10:46:54.904142+00:00", "title": "First full trailer for El Camino picks up where Breaking Bad left off", "language": "en", "text": "Jesse Pinkman is on the lam and looking for revenge in the first full official trailer for El Camino: A Breaking Bad Movie, Vince Gilligan's much-anticipated coda to his seminal TV series, Breaking Bad. The series won multiple Emmys during its five-year run, among other awards, and the series finale, \"Felina,\" has been touted as one of the best series finales of all time by critics. The spinoff prequel series, Better Call Saul, saw national treasure Bob Odenkirk reprise his role as shady lawyer Saul Goodman and has also enjoyed critical acclaim. So it's not surprising that there was considerable interest in further exploring Breaking Bad's fictional world.\n\n(Major spoilers for Breaking Bad TV series below.)\n\nBreaking Bad starred Bryan Cranston as high school chemistry teacher Walter White, who is diagnosed with stage 3 lung cancer. Assuming his death is imminent, he frets about providing for his wife and kids, especially his oldest son, Walter Jr. (RJ Mitte), who suffers from cerebral palsy. So he decides to put his chemistry expertise to use making methamphetamine, with the help of his former student, Jesse Pinkman (Aaron Paul).\n\nInitially, they produce small batches of the stuff, but its high quality and telltale blue tinge soon mean White's product is in high demand. This naturally draws the attention of Albuquerque's criminal underworld: not just local dealers, but the Mexican drug cartels as well. Complicating matters even more is Walter's brother-in-law, Hank (Dean Norris), an officer with the Drug Enforcement Administration intent on tracking down this mysterious new player nicknamed \"Heisenberg.\"\n\nThe show quickly earned fans with its dark humor, memorably complicated characters (with equally complicated inter-relationships), and moments of crushing heartbreak. Over the course of five seasons, viewers witnessed Walter White's gradual transformation from a mild-mannered science teacher cooking meth in his tighty-whities to a manipulative, cold-blooded killer.\n\nThe science wasn't too shabby either, thanks to the efforts of Donna Nelson, an organic chemist at the University of Oklahoma, who consulted on many of the technical aspects of the series. Yes, certain liberties were taken, particularly when it came to how the meth was made. Prof. Nelson told NPR in 2011 that there are multiple pathways to make the drug, and Gilligan deliberately mixed up different aspects of each. \"If you just simply followed the one synthesis as it's presented, you wouldn't come out with methamphetamine,\" she said.\n\nGilligan was already thinking about a possible follow-up while filming the final season of Breaking Bad, but he didn't tell anyone about it until the 10th anniversary of the series premiere was approaching. He first approached Paul—since the film would focus on what happened to Jesse after the bloody finale—who eagerly signed on. Sony Pictures Television gave the project the green light, with Netflix and AMC signing on as distributors. But details were kept under wraps, even while filming took place in Albuquerque (under a working title of Greenbriar). Netflix didn't reveal the real title until last month, when it also released the first brooding teaser.\n\nA second teaser aired during the televised Emmy Awards ceremony last Sunday, but neither teaser revealed many details. It's reasonable to assume the few characters who survived the finale are likely to return, like Saul Goodman (who fled to Nebraska). Skinny Pete (Charles Baker) and Badger (Matt Jones), Jesse's friends, are listed among the cast, along with Mike Ehrmantraut (Jonathan Banks), who was mortally wounded by Walter in season 5. Perhaps he survived or will appear via flashback, raising the possibility that other fan favorites, presumed dead, might make cameos, too.\n\nThis latest spoiler-free trailer won't do much to assuage everyone's curiosity, since details are still scant. But it's clear that the film does indeed take place in the immediate aftermath of the Breaking Bad finale. As a refresher, the walls are closing in on an increasingly desperate Walter White, whose cancer has returned. A gang of white nationalist drug dealers has killed his brother-in-law Hank and kidnapped his estranged former partner, Jesse. Walter puts some affairs in order—including leaving $9 million in cash for Walt Jr. once he turns 18—and he rigs an M60 machine gun to open fire automatically. Then he goes to meet the gang that is holding Jesse. In the ensuing shootout, pretty much everyone is killed. Jesse strangles one surviving gang member, and Walt shoots the gang leader who killed Hank. He begs Jesse to shoot him, too, but Jesse refuses and takes off in a Chevrolet El Camino as sirens approach. The police arrive right after Walter dies from his gunshot wounds.\n\nScarred and bearded\n\nIn the trailer, we see a scarred and bearded Jesse fleeing the scene as the police approach. While the manhunt intensifies, he takes refuge with Badger and Skinny Pete. There's a brief glimpse of two men meeting secretly by a river, but their faces are too blurry to make out. Jesse makes a trip to the desert, possibly to dig up his hidden earnings from the meth business. And it looks like he's out for revenge against someone, with a showdown looming. About the only bit of meaningful information we learn is that Jesse's middle name is Bruce. And Breaking Bad fans wouldn't have it any other way.\n\nEl Camino will begin streaming on Netflix on October 11, 2019, with a limited theatrical release from October 11-13. It will air on AMC at an as-yet-unspecified later date.\n\nListing image by YouTube/Netflix", "description": "Breaking Bad creator Vince Gilligan has wanted to do a coda for the last 10 years.", "authors": ["Jennifer Ouellette"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/09/badTOP-760x380.jpg", "published_at": "2019-09-24"}