{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/elizabeth-warren-chastises-facebook-for-running-fake-advertisements-2019-10", "downloaded_at": "2019-10-12 06:54:37.832867+00:00", "title": "Elizabeth Warren expressed her ire over Facebook running fake ads for Trump — by running a fake ad", "language": "en", "text": "2020 presidential candidate Elizabeth Warren ran a fake advertisement on Facebook claiming that CEO Mark Zuckerberg endorsed Trump's re-election, taking a jab at the social media platform for allowing the same for President Donald Trump.\n\nNetworks like CNN and NBCUniversal have refused to run ads for Trump with \"demonstrably false\" claims about former Vice President Joe Biden, but Facebook did.\n\nThe ads began circulating starting Thursday, CNN reported, and it has already been displayed on tens of thousands of newsfeeds nationwide.\n\nFacebook spokesman Andy Stone issued a statement Friday in response to Warren's ad, saying that the social media platform seeks to protect free speech.\n\nVisit Business Insider's homepage for more stories.\n\n2020 candidate Elizabeth Warren has expressed her ire for big tech companies in the past, most recently amid reports that Facebook allows President Donald Trump to lie in ads. So how does she fight them?\n\nBy telling a lie, of course.\n\nHer campaign posted a fake advertisement on the social media platform claiming that Facebook CEO Mark Zuckerberg endorsed Trump's re-election. But she didn't run the ad without a disclaimer.\n\n\"You're probably shocked,\" the ad read. \"And you might be thinking, 'how could this possibly be true?'\"\n\n\"Well, it's not. (Sorry.)\"\n\nWarren's advertisement goes on to chastise Facebook for running false advertisements for Trump, while most television networks have denied to run the same advertisements. Networks like CNN and NBCUniversal have refused to run ads for Donald Trump with \"demonstrably false\" claims about former Vice President Joe Biden.\n\nRead more: Facebook confirms Donald Trump can lie in ads, but he can't curse\n\n\"If Trump tries to lie in a TV ad, most networks will refuse to air it,\" the ad stated. \"But Facebook just cashes Trump's checks.\"\n\nThe ads began circulating starting Thursday, CNN reported, and it has already been displayed on tens of thousands of newsfeeds nationwide. Facebook spokesman Andy Stone issued a statement Friday in response to Warren's ad, saying that the social media platform seeks to protect free speech.\n\n\"If Senator Warren wants to say things she knows to be untrue, we believe Facebook should not be in the position of censoring that speech,\" Stone said.\n\n—Julia Carrie Wong (@juliacarriew) October 11, 2019", "description": "The ads began circulating starting Thursday, CNN reported, and it has already been displayed on tens of thousands of newsfeeds nationwide.", "authors": ["Lauren Frias"], "top_image": "https://image.businessinsider.com/5da14900cc4a0a6c0447c8b3?width=1200&format=jpeg", "published_at": "2019-10-12"}