{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7563735/Slovenia-U21-2-2-England-U21-Eddie-Nketiah-Sam-Surridge-earn-Aidy-Boothroyds-victory.html", "downloaded_at": "2019-10-11 20:44:36.571473+00:00", "title": "Slovenia U21 2-2 England U21: Aidy Boothroyd's side surrender two-goal lead", "language": "en", "text": "Ultimately, there are no ramifications for England's brains freezing in the final 10 minutes of a friendly Aidy Boothroyd labelled a 'fact-finding mission,' but how it came about will doubtless irk.\n\nSlovenia are no great shakes, an unimaginative team who did not seem to have much desire to enter England's half, let alone score twice. The Young Lions enjoyed almost complete dominance for the majority of this – Eddie Nketiah and Sam Surridge the goalscorers – but left Maribor with only a draw.\n\nThat will draw obvious comparisons to the chastening summer in Italy, that European Championship group stage exit, where complacency and arrogance were both used as reasons for blame. Conceding late goals was a real problem there. While disappointed here, Boothroyd claimed a raft of substitutions and individual errors were at play.\n\nEngland Under-21s threw away a two-goal lead in Maribor against Slovenia on Friday night\n\nAidy Boothroyd's side were in control for much of the game before their late game collapse\n\nMATCH FACTS AND PLAYER RATINGS Slovenia: Frelih, Rogelj, Zec, Zalatel, Celar, Mlakar, Valencic, Sever, Stojinovic, Kryeziu, Rom. England (3-5-1-1): Ramsdale 6; Guehi 7, Panzo 6, Kelly 7.5 (Richards 62, 6); Aarons 7 (Justin 46, 6), Willock 6 (Gallagher 62, 6.5), Davies 7, Foden 8 (Skipp 62, 6), McNeil 6.5 (Wilmot 46, 6); Hudson-Odoi 7 (Brewster 46, 7); Nketiah 7 (Surridge 46, 7) Subs: Austin, Justin, Balcombe.\n\n'I'm not overly disappointed,' Boothroyd said. 'I've learnt quite a few things. Although it might not seem it, I'm quite happy with a lot of stuff but obviously disappointed to chuck away a two-goal lead.'\n\nSlovenia had barely registered a shot before Dejan Petrovic scored with nine minutes left, finishing a move that was manufactured from an Aaron Ramsdale mistake. Then in stoppage time, Janez Pisek's deflected free-kick wrong-footed Ramsdale.\n\n'Errors cost us but as daft as it sounds, they're good,' Boothroyd reasoned. 'I'd rather have an error like this here when we're experimenting with a couple of things because it means tomorrow I can use it in the context of not wanting to do that in the European Championships or a qualifier.'\n\nRamsdale attempted to coolly play out, only to under-hit his pass to Jonathan Panzo. Tomi Horvat seized on that, squaring for Petrovic and Slovenia had a foothold they barely merited. Then it got worse, Panzo committing a foul on the edge of the box and Janez Pisek somehow finding a way through.\n\nTuesday's qualifier against Austria in Milton Keynes is a much sterner test. How England threw this away - losing their shape and balance – will be of concern.\n\nBoothroyd named a strong side in front of what was a sparse crowd inside the stadium\n\nBefore all that, they were slick. Many of this group are fresh and do not carry the summer, with eight debuts on Friday night. There are high hopes for plenty, beyond the obvious in Callum Hudson-Odoi and Phil Foden. Supplementary to harnessing their talent is the insistence of finessing new formations in games such as this, in front of around 200 people.\n\nEngland will be pleased with the control they exerted for long spells but may feel more goals ought to have been forthcoming. Boothroyd has spoken passionately about the need to implement and subsequently become comfortable in different systems, citing Spain, Germany and France as examples. 'They can flip and change at any time,' he said. That will not happen overnight, of course.\n\nEngland have switched from three at the back, which they started with here, to a four or a five over the last month. The midfield is starting to rotate at a faster rate, ably anchored by Tom Davies, who cleared a stand of Maribor's Ljudski vrt with one first-half volley.\n\nThis tinkering is all for improved game management at tournaments but ultimately making sure these players become technically and tactically adaptable moving forward.\n\nSlovenia did not lose hope and worked hard to get at England in a bid to force a comeback\n\nThings clicked sporadically against an underwhelming and uninspiring Slovenia, certainly when England manoeuvred their hosts to find Max Aarons out on the right. The Norwich full back, acting as an auxiliary winger here, cut back for Foden, only for him to flash just over on the turn. The move was textbook until the finish.\n\nHudson-Odoi already has two senior caps but his attitude has been described as 'first class,' owning an infectious enthusiasm. Chelsea's 18-year-old was afforded a free role behind Nketiah and offered flashes, going close with a free-kick he won after slaloming around three defenders.\n\nFoden did similar six minutes before the break, jinking off from the left with Dwight McNeil's assistance and sliding an effortless ball into Nketiah. From there the on-loan Leeds striker turned his marker, Zan Zaletel, and was illegal thwarted from wriggling clear inside the box. Nketiah stroked home the resulting penalty, his fifth Under-21 goal in seven games. Aarons drove wide shortly after.\n\n'Gareth is very quick to point out that we don't have to do what he does,' Boothroyd said. 'He's quite happy for me to get on with it. It's great to have that trust.'\n\nThe pitch had not been watered but England were largely slick as they monopolised possession, albeit picking through a dogged team with 10 men behind the ball proved tricky.\n\nEddie Nketiah won a penalty before stepping up to finish it to give England the lead on Friday\n\nThis trip to Maribor was used to familiarise themselves with one host city of the 2021 European Championship but also to decipher how quickly these players are picking up new and effectively unfamiliar methods.\n\nEngland were lax thereafter but still fashioned the real openings. Foden, this week described by Pep Guardiola as David Silva's natural heir, was central to the chance again, skipping through the gears and finding Rhian Brewster, whose shot across goal was smartly stopped. Another off the bench, Ben Wilmot, headed against the post before Surridge nudged in the second with 19 minutes left.\n\nThey could not find another and succumbed late on. 'It's difficult when a team comes and sits like that and tries to stop us playing,' Boothroyd said. 'I could see everyone on the pitch getting frustrated because they were trying to block the centre.\n\n'We've got to be good enough to break that down. In a strange sort of way, these are good things because I want them to feel disappointed. We've got a few lessons to learn.'", "description": "JACK GAUGHAN AT THE STADION LJUDSKI VRT: It was looking like another positive night but ended rather sourly. England's Under 21s conceded twice in the final 10 minutes of a friendly they dominated.", "authors": ["Jack Gaughan For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/20/19604422-0-image-a-26_1570822418540.jpg", "published_at": "2019-10-11"}