{"pub": "businessinsider", "url": "https://businesstimes.com.sg/consumer/down-on-the-farm-brexit-casts-its-shadow", "downloaded_at": "2019-10-14 06:37:45.221881+00:00", "title": "Down on the farm, Brexit casts its shadow", "language": "en", "text": "United Kingdom] On the face of it, Ellie Woodcock's organic farm two hours south of London shouldn't be affected by Britain's impending departure from the European Union.\n\n[EAST GRINSTEAD, United Kingdom] On the face of it, Ellie Woodcock's organic farm two hours south of London shouldn't be affected by Britain's impending departure from the European Union.\n\n\"We don't export anything, so that wouldn't affect my farm. We sell very much directly to the English public and quite locally,\" she told AFP.\n\nBut even with no customs duties to pay or headaches at the border, Brexit can deliver an unexpected bite.\n\n\"I think for the farming community, Brexit will have quite a negative impact,\" said Ms Woodcock, who co-manages Brambletye Farm, near East Grinstead, in Sussex.\n\nsentifi.com Market voices on:\n\n\"The farming community around here really rely on foreign workers, so changes to the legislation and people movement could really affect them.\"\n\n\"There's not one positive thing that I can spring out of it, even if I was to twist my mind,\" added co-owner Stein Leenders, as he harvested the final fruits of the season.\n\n- Rising overheads -\n\nBrambletye grows apples, pears, raspberries and blackberries, and sells eggs laid by dozens of free-range chickens over its nearly 45 acres (18 hectares) of land.\n\nMs Woodcock, Mr Leenders and their 20-odd employees make or grow virtually everything on site, including fruit purees and bottled juice from a shed housing three busy workers.\n\n\"Some of the supplies I might buy from other European countries directly or indirectly through a third party,\" said Ms Woodcock.\n\n\"One of them would be corks. I also buy mushroom substrate, which comes directly from Holland.\"\n\nSuch products risk becoming more expensive because of Brexit, which has both made the pound weaker since the 2016 referendum and upped expectations of disruption at the border.\n\nWhere Brambletye has opted to focus on a few products, other smallholders bring in fruit from Spain, Portugal and other sunnier European countries to sell during the long rainy winter months.\n\nFans of organic produce wander among the stalls at The Spread farmers' market in the trendy Primrose Hill area of London. But the high spirits of the weekend hide a downbeat mood.\n\n\"Everything we plant is imported,\" said Dave Newton, from Brockmans Farm, at his stall opposite Brambletye's. \"Brexit is going to affect us a lot because prices are going to go up.\n\n\"Small farms are going to suffer the most.\"\n\n- 'They won't come back' -\n\nLarge farms which export most of their produce, and particularly livestock rearers, are facing the threat of financial ruin.\n\nThey could see the possible loss of European subsidies and huge customs duties while importers could be given tax free incentives.\n\n\"We don't know what's going to happen yet in terms of subsidies,\" said Mike Norledge, who helps run The Spread.\n\n\"A lot of workers have to go back to where they're from, so that's a worry,\" he added.\n\nMs Woodcock meanwhile said economic conditions since the landmark Brexit vote have not helped.\n\n\"It's not a particularly glamorous job to pick fruit for eight to 10 hours a day,\" she said.\n\n\"There was an incentive for workers from poorer countries when the pound was high as they made a lot of money quite quickly.\n\n\"With this sometimes xenophobic atmosphere, the big thing with Brexit is do (workers) feel welcome? If they don't feel welcome and if there's not a big incentive for the money, then they're not going to come.\"\n\nMs Woodcock herself only employs locally because she has no facilities to house seasonal workers but has faced great difficulties finding anyone.\n\n\"That makes me really worried for other farms. How are they going to manage?\" she said.\n\n- Less variety and quality? -\n\nBrexit supporters have said the country's exit from the European Union could spur demand for home-grown produce, but some fear it will simply open the door to less stringent checks on food.\n\n\"There's still a large part of the population that is interested in GM (genetically modified) food and (Brexit) leaves it more open to relaxing regulations,\" said Ms Woodcock.\n\n\"There is an impulse for 'let's find a quicker and easier food option' without thinking about the consequences,\" she added.\n\nCustomers at farmers' markets, for their part, also fear a loss of variety.\n\n\"There's a good argument being made for consuming local whenever possible and complementing it with imported goods,\" said Christian del Valle, as he shopped in Primrose Hill.\n\n\"There's no more responsible place for that than the EU, where the standards are high and the food miles are relatively short.\"\n\nAFP", "description": ": THE BUSINESS TIMES Consumer - [EAST GRINSTEAD, United Kingdom] On the face of it, Ellie Woodcock's organic farm two hours south of London shouldn't be affected by Britain's impending departure from the European Union. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/14/AK_brex2_1410.jpg?itok=RH7DEdLi", "published_at": "2019-10-14"}