{"pub": "yahoo", "url": "https://news.yahoo.com/texas-pastors-seek-federal-action-220753664.html", "downloaded_at": "2019-10-17 08:09:10.657182+00:00", "title": "Texas pastors seek federal action after police shoot black woman in her home", "language": "en", "text": "Fort Worth Police Department officer Aaron York Dean is seen in a booking photo at the Tarrant County Jail\n\nBy Andrew Hay\n\n(Reuters) - Black pastors in Fort Worth, Texas on Wednesday called for federal intervention to stamp out what they called systemic racism in their city's police force after a white officer shot dead black resident Atatiana Jefferson in her home.\n\nJefferson's killing on Saturday by a rookie Fort Worth officer was the latest in a string of fatal shootings that has made the city's African American community wary of police, said Pastor Kyev Tatum.\n\nHe called on Fort Worth to enter a federally-binding \"consent decree\" to overhaul a police force he said led the nation in police-involved shootings, most of them involving black residents.\n\n\"This is historic and its systemic and we understand that racism is at the heart of this,\" Tatum, of the New Mount Rose Missionary Baptist Church, told a news conference while flanked by dozens of other pastors and community leaders. \"We have lost trust in our police department.\"\n\nBlack leaders in Fort Worth, the 13th largest U.S. city with around 895,000 residents, said Jefferson's death fits into a nationwide pattern of police shootings, arrests, and use of tasers that disproportionately affect African Americans.\n\nJefferson, a 28-year-old pre-med graduate, was shot dead by Officer Aaron Dean through a window of her home after a concerned neighbor asked police to investigate why her front doors were open.\n\nDean, 34, was arrested on Monday and charged with murder, before being released from jail on a $200,000 bond.\n\nJefferson was the sixth person to be shot dead by Fort Worth police since June, putting the department on track to be the deadliest in the country, according to her family's lawyer, Lee Merritt.\n\nTatum said Jefferson's death was a familiar situation in a city where police justified excessive force due to \"fear for their lives.\"\n\nFort Worth Police Chief Ed Kraus on Tuesday said there was \"absolutely no excuse\" for Jefferson's death and that Dean violated a string of police policies.\n\nFort Worth Mayor Betsy Price vowed that independent experts would investigate police practices after the shooting.\n\nTatum said the mayor had not included him or other black leaders in her plans and they were requesting U.S. Attorney General William Barr step in and help oversee police reforms.\n\nUnder a consent decree, the U.S. Justice Department enters a binding agreement with an official entity, often after finding evidence of wrongdoing. Securing one could prove difficult under a Trump administration that has pushed back against their prior use to reform police departments, citing the burdensome costs.\n\nThe U.S. Justice Department and Price's office did not immediately respond to requests for comment.\n\n\n\n\n\n(Reporting by Andrew Hay; Editing by Bill Berkrot)", "description": "Jefferson's killing on Saturday by a rookie Fort Worth officer was the latest in a string of fatal shootings that has made the city's African American community wary of police, said Pastor Kyev Tatum.", "authors": ["Andrew Hay"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Kcbr6eKSii.WKqg73YJeUg--~B/aD0zMDI7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/27fcb3db48d5a7f5cf730c49122df4f8", "published_at": "2019-10-16"}