{"pub": "huffpost", "url": "https://huffpost.com/entry/ed-markey-donations-fossil-fuel-link_n_5dafae82e4b0f34e3a7e66ed", "downloaded_at": "2019-10-28 09:49:14.663672+00:00", "title": "Green New Deal Author Returns Fossil Fuel Donations, Highlighting A ‘Growing Pain’", "language": "en", "text": "Sen. Ed Markey (D-Mass.), a Green New Deal co-sponsor, last week returned $46,900 in donations after violating a pledge to reject money from the fossil fuel industry by accepting contributions from lobbyists who worked for oil and gas companies.\n\nIn the first six months of this year, the senator raised $10,000 from six lobbyists whose clients included oil giants Chevron and BP. His campaign received an additional $5,000 from four lobbyists who worked for fossil fuel companies, according to a third-quarter Federal Election Commission filing released last week.\n\nThe campaign contributions, activists said, violated the No Fossil Fuel Money pledge, a popular oath overseen by more than a dozen environmental groups, which Markey signed in December. Signatories to the pledge vow to turn down donations of “over $200 from oil, gas, and coal industry executives, lobbyists, and PACs.”\n\nBut a thorough review found 28 donations that violated the pledge, namely frolobbyists whose clients included, but were not primarily, fossil fuel firms. The loophole exposed a gap in a pledge that’s become a key litmus test for how seriously Democrats take the corrupting influence of an industry increasingly accused of crimes against humanity.\n\nMassLive first reported the campaign’s decision.\n\nThe activists who supervised the pledge last Wednesday sent an updated set of guidelines to the more than 1,800 campaigns who have signed, including a database of “politically active” fossil fuel companies to avoid.\n\n“Following this clarification, the campaign identified donors who met a technical requirement of the No Fossil Fuel Money Pledge, of which we were previously unaware,” John Walsh, Markey’s senior campaign director, said in a statement. “We quickly worked to ensure technical compliance with the pledge.”\n\nOil Change U.S., one of the main groups that control the pledge, offered forgiveness.\n\n“Campaign finance is a sticky wicket, so we understand that mistakes will be made,” Collin Rees, a senior campaigner with the nonprofit, said in an email. “Taking ownership of those mistakes and rectifying them quickly is precisely in the spirit of the pledge, and exactly what we need to see from politicians willing to stand up to the fossil fuel industry.”\n\nBoston Globe via Getty Images Sen. Ed Markey speaks during a community town hall discussion on the Green New Deal Resolution and solution to fighting climate change at Framingham High School in Framingham, Massachusetts, in August.\n\nBut Markey’s opponents looked poised to use the donations ― which were largely reported in the conservative press ― as ammunition as the senator heads into a primary election next year with three opponents, including a significant challenge from Rep. Joe Kennedy III (D-Mass.).\n\nMarkey, 73, an old-guard liberal first elected to Congress 40 years ago, boasts a lengthy record as a climate champion. A decade ago, he led the charge on Democrats’ last major effort to curb planet-heating emissions. But, earlier this year, he emerged as a key ally of the insurgent faction of left-wing Democrats, partnering with freshman Rep. Alexandria Ocasio-Cortez (D-N.Y.) to introduce a historic resolution outlining the core tenets of a Green New Deal. Markey is now counting on the grassroots network of young Green New Deal activists to undercut Kennedy’s message of generational change.\n\nThe right-wing site Breitbart identified the first round of fossil fuel donors in June, which included $2,800 from Steve Elmendorf, a former deputy campaign manager for John Kerry’s 2004 presidential bid who now lobbies for British oil giant BP; $2,700 from Susan Brophy, who represents YPF S.A., one of Argentina’s top petroleum producers; and $2,100 from David Castagnetti, another former Kerry aide who now lobbies for Chevron. Two other employees at Castagnetti’s firm who are also registered as Chevron lobbyists each gave $500, while another Chevron lobbyist, Brian Arthur Pomper of the lobbying giant Akin Gump, gave $2,000.\n\nThe conservative-leaning Boston Herald identified several more last week. Those included $1,500 from Akin Gump partner Sean D’Arcy, a lobbyist for the coal-fired utility FirstEnergy Solutions; $2,000 from Capitol Counsel founder Shannon Finley, who is registered to represent the American Fuel & Petrochemical Manufacturers, Exxon Mobil and Chevron; and $2,000 from Cassidy & Associates CEO Kai Anderson, who lobbied for the controversial Mountain Valley Pipeline.\n\nThe reports could dent Markey’s best shield against Kennedy, the four-term congressman and heir to a political dynasty so beloved by Bay State voters that a fictional member of the clan received high favorable ratings in a speculative 2011 poll. The 39-year-old has also signed the No Fossil Fuel Money pledge and is pitching his candidacy as a generational shift.\n\nMarkey isn’t the first high-profile signatory to violate the pledge. Despite signing it last year, Beto O’Rourke, the former Texas congressman who nearly unseated Sen. Ted Cruz (R-Texas) in 2018, received dozens of donations from oil and gas executives, according to a December report from the watchdog site Sludge. A week later, activists removed him from the No Fossil Fuel Money pledge website.\n\nFacing fierce criticism from groups including Sunrise Movement, O’Rourke, now running for the Democratic presidential nomination, signed the pledge in May.\n\nThe loophole exposed a gap in a pledge that’s become a key litmus test for how seriously Democrats take the corrupting influence of an industry increasingly accused of crimes against humanity.\n\nMarkey’s case was more nuanced, said Sunrise political director Evan Weber. The senator’s campaign set up “an extremely rigorous” system to vet donations from executives, trade groups and corporate political action committees working for the fossil fuel industry. But lobbyists whose clients include but are not primarily in the oil, gas or coal business fell through the cracks.\n\nThe issue, he said, demonstrated the “growing pains” within a movement that blossomed from a high-profile Capitol Hill protest last November into a global coalition backed by climate scientists and, in at least one case, a national government.\n\n“When we launched the No Fossil Fuel Money pledge, it was little more than a symbolic idea to really force a conversation about the role of fossil fuel money in politics,” Weber said. “Frankly, we hadn’t figured out all the minute details around campaign finance law.”\n\nSunrise Movement, which cut its teeth campaigning for climate hawks last year, made Markey one of its first 2020 endorsements in August, praising the senator for using “his experience and seniority to advance the movement, not [using] the movement to advance himself.” The Sierra Club followed suit. Markey has jointly announced a climate debate with two of his challengers, labor lawyer Shannon Liss-Riordan and businessman Steve Pemberton, scheduled for early November. Kennedy has not committed to joining, though the press release stated: “We are still hopeful that Congressman Kennedy will join us.”\n\nWhile Kennedy may attempt to seize on the snafu, the Green New Deal that Markey has championed represents a pressure point for the younger challenger. The Green New Deal movement is largely led by Democrats from the ascendant wing of hard-line progressives, such as Ocasio-Cortez and Rep. Rashida Tlaib (D-Mich.).\n\nKennedy endorsed the Green New Deal as a policy framework last year, but only after facing pressure. Since then, he’s allied himself with the movement’s natural opponents. Former Rep. Joe Crowley (D-N.Y.), the high-ranking nine-term incumbent Ocasio-Cortez unseated, hosted a fundraiser for Kennedy in October, The Boston Globe reported. While Sen. Elizabeth Warren (D-Mass.) and progressive Suffolk County District Attorney Rachael Rollins endorsed Markey, Kennedy secured the backing of Sen. Kyrsten Sinema (D-Ariz.), an avowed centrist who was one of just three Democrats to vote against the Green New Deal resolution in March.\n\nKennedy also owns as much as $1.75 million worth of stock in fossil fuel companies, including Exxon Mobil and Chevron, though his campaign said “these are family holdings over which the Congressman exercises no control.” And as progressive stalwarts such as Ocasio-Cortez and Sen. Elizabeth Warren (D-Mass.) endorse Markey, Kennedy secured the backing of Sen. Kyrsten Sinema (D-Ariz.), an avowed centrist who was one of just three Democrats to vote against the Green New Deal resolution in March.\n\n“He is proud of his strong record standing up to fossil fuel interests,” Emily Kaufman, a campaign spokeswoman, said by email.\n\nTo groups like Sunrise Movement, Markey’s record remains a safer bet.\n\n“We’re not really questioning Markey’s commitment,” Weber said. “He is one of the most outspoken champions for one of the most ambitious platforms on climate in American history.”", "description": "Sen. Ed Markey's fundraising debacle comes as he leans into his climate record to beat back three primary challengers.", "authors": ["Senior Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5dafaf2c210000a521ad39d5.jpeg?cache=zhfmbjewni&ops=1778_1000", "published_at": "2019-10-28"}