{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7630247/Unlucky-Study-reveals-having-door-number-13-knock-22-000-price-home.html", "downloaded_at": "2019-10-30 16:08:47.015106+00:00", "title": "Unlucky for some! Study reveals having the door number 13 could knock £22,000 off price of your home", "language": "en", "text": "The number 13 has long been associated with bad luck - and now it appears that superstition holds weight if it's on your front door.\n\nOf the 1.2 million homes sold across the UK every year, the value of houses with the door number 13 dropped dramatically.\n\nNew research has revealed they sold for an average of £22,006 less than other properties.\n\nThe analysis of official Land Registry data was conducted by property specialists Stone Real Estate and covers property sales in the UK over the past three years.\n\nThe number 13 has long been associated with bad luck - and now it appears that superstition holds weight if it's on your front door. Pictured: stock image\n\nThe 'number 13' effect is so damaging it has even seen some big housebuilders remove it completely from their new build developments.\n\nSince 2016, transactions involving the number 13 have accounted for just 0.8 per cent of new build sales and just 1.1 per cent of existing property sales.\n\nDespite this low volume of transactions, the impact on price is notable, with existing number 13 properties selling for an average of -£22,006 less than other properties sold during the same time period - a reduction of -8 per cent.\n\nThe average sale price of homes between 2016 to 2019 was £282,815 across the UK - but people living at number 13 only received £260,716 on average for their property.\n\nOf the 1.2 million homes sold across the UK every year, the value of houses with the door number 13 dropped dramatically. Pictured: stock image\n\nWhile new build homes have done a better job of overcoming the stigma, the average sold price since 2016 for number 13 new builds is still -2 per cent lower than new build homes with other numbers - a difference of £4,707 in price.\n\nThis is also the case when looking at the last 12 months, with existing properties numbered 13 also selling for -8 per cent (-£22,468) less.\n\nAround 10 per cent of people in the UK suffer from triskaidekaphobia - a phobia of the number 13.\n\nThe superstition, thought to stem from biblical tradition where Judas was the thirteenth disciple, stretches across the world.\n\nMany people admit to avoiding seats numbered 13 on coaches or planes - some airlines including Ryanair have ditched row 13 altogether - while Friday 13 is dubbed the unluckiest day of the year.\n\nWhile new build homes have done a better job of overcoming the stigma, the average sold price since 2016 for number 13 new builds is still -2 per cent lower than new build homes with other numbers. Pictured: stock image\n\nWhen it comes to property, the tide does seem to be turning in the new build sector, with a decline of just -0.4 per cent for number 13 new builds compared to those with other numbers.\n\nWhen looking at 2019 alone, new build homes with the number 13 have actually sold for 0.2 per cent more on average than those with different numbers.\n\nBut it's yet more bad news for those with an existing build so far this year, with number 13 properties again selling for -8 per cent less - wiping £21,908 off their property's value.\n\nFounder and CEO of Stone Real Estate, Michael Stone, commented: 'In this day and age, it's quite remarkable how ancient superstitions can still have such a detrimental impact on the price a property will sell for.\n\n'For many, the aspiration to own their home will no doubt rise above any such feelings around the number 13 and the figures show that as a first-time buyer, it's probably the ideal number due to the lower cost of getting on the ladder.'", "description": "Of the 1.2 million homes sold across the UK every year, the value of houses with the door number 13 dropped dramatically, selling for an average of £22,006 less than other properties.", "authors": ["Hayley Richardson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/12/20375002-0-image-a-371_1572439639117.jpg", "published_at": "2019-10-30"}