{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/douglas-murray-book-the-madness-of-crowds-gender-race-and-identity", "downloaded_at": "2019-10-05 06:56:45.434943+00:00", "title": "Douglas Murray Interview: 'The Madness of Crowds' Author on Gender, Race & Identity", "language": "en", "text": "Douglas Murray on Good Morning Britain (via YouTube)\n\nThe British author and journalist discusses themes from his new book.\n\nDouglas Murray is an author, journalist, and National Review Institute fellow based in Britain. His 2017 book, The Strange Death of Europe: Immigration, Identity, and Islam, spent almost 20 weeks on the Sunday Times of London’s bestseller list and was a No. 1 bestseller in nonfiction. It has subsequently been published in more than 20 languages worldwide and has been read and cited by politicians around the world. As well as regularly contributing to National Review, Murray is also an associate editor at The Spectator and has written regularly for other outlets including The Wall Street Journal, The Times and The Sunday Times of London, The Sun, Evening Standard, The Telegraph, and The New Criterion.\n\nAdvertisement\n\nAdvertisement\n\nIn his latest book, The Madness of Crowds: Gender, Race and Identity — released this month — he takes on the 21st century’s most divisive issues: sexuality, technology, and race. Here is the transcript from his discussion (available in audio below) with Madeleine Kearns.\n\nMadeleine Kearns: Douglas, first I want to embarrass myself and say on the record what a great pleasure it is to be interviewing you. I was a massive fan of your last book, The Strange Death of Europe — as were the other members of the secret nonconformist book club I founded while at New York University. And your new book, The Madness of Crowds, is just as juicy. So, thanks and congratulations. Because it is a really important, endlessly readable, well-written work.\n\nDouglas Murray: Thank you! [Laughs and continues to make a cup of tea.]\n\nAdvertisement\n\nMK: So, first of all, for our listeners who might not have had the chance to read it yet, I’ll quickly summarize what I think the gist of it is. In Indiana Jones fashion, Douglas’s book tiptoes through the landmines of contemporary politics. But he doesn’t just dodge them; he skillfully turns off the clock because they’re actually time bombs that are at present counting down to the destruction of the good, true and beautiful.\n\nAnd chapter by chapter, the time bombs you deactivate are “gay,” “women,” “race” and “trans.” We’ll get into all of that in a minute. But first of all, could you explain the actual minefield metaphor in your book’s introduction, which I’m worried I might’ve just ruined . . .\n\nAdvertisement\n\nDM: Yes. So, I’m interested in the subjects we all know about, or want to know about, but don’t talk about in public. The subjects which people discuss in private, and even then, often with considerable concern. Obviously, in my last book on immigration and more, I was aware that that was one of the issues where people were perennially fearful. But it has become clear to me in recent years that there were others. And specifically, there were issues over which people’s careers kept on being destroyed over. And it wasn’t that there was any one specific thing you said, but just that if you trod anywhere near really thinking aloud on a number of issues — everything to do with being gay, everything to do with being a woman (particularly relations between the sexes), everything to do with race, and absolutely everything to do with trans.\n\nAnd as I was researching the book and thinking about it and sort of formulating this, I spoke to a friend of mine who had been in the British armed forces for most of his career who told me about an anti-landmine device that the British army has. The American army has it as well. But in the British version, it’s called the Great Viper. And this is a device — and you can see this on YouTube, like everything — where the military pulls this thing on the back of the truck to the edge of a minefield, fires this big rocket, and the back of the rocket is a long tail which extends and draws out behind the rocket, and it’s a sort of hose filled with explosives. It goes across the entire minefield. And then once it’s across, it detonates it all in one go.\n\nAdvertisement\n\nAnd this, of course, this device cannot clear the minefield. But it can clear a path that makes it safer for other people thereafter to follow. And when this ex-military friend told me this, I just immediately said, “Oh, that’s what I’m trying to do.” Because I didn’t say I have by any means the final word on any of the subjects I tackle. I just think all of them are very, very interesting. And the contours of what we are and are not allowed to think and say out loud about them are absolutely fascinating. And so, I’ve on each of them tried to go for what I think is just the stuff we’re not meant to say or know. And try to inquire about them and talk about them. Really, as I say, with the aim that other people will find it a little bit safer to do so afterwards.\n\nAdvertisement\n\nMK: I want to get into the various controversies. But first, the other thing I wanted to ask you about was Foucault, who comes up a lot in your book. And I’m grateful that you make him so clear, because every time I read Foucault, I think, “Woah, this guy writes in unbelievably long sentences.” He’s actually a very stylish writer, but just hopelessly unclear. And yet he is the father, in many ways, the philosophical father, of a lot of these ideas we’re seeing. So, could you sort of help us out and explain who was Foucault and what was his deal?\n\nAdvertisement\n\nAdvertisement\n\nDM: Yeah. I’m interested in tracing, in all of these things, what the deep intellectual underpinnings are, what the presumptions are of our time, including the philosophical presumptions, and which follow on to cause, very often, political presumptions. And so, my technique with this book — as with the last one — is to try to go to everything from the metaphysics and the philosophy all the way through to the popular culture. And one of the names that just kept on cropping up all the time, as everywhere, was Foucault. And I suppose what I was struck by was, of course — he’s basically the most cited thinker in academia today. And in terms of citations, I think Foucault is cited something about four times more often than Einstein in academic papers still.\n\nPartly it’s because of interdisciplinary studies. People cite him across the disciplines, and that’s a great advantage for that. But I had not really taken him very seriously. I sort of read bits and pieces, but I sort of dismissed them. And I thought when I was researching this book, I really should read the foundational texts and various others who had such an impact on the movements that I was getting interested in. So, I went back, and I read Foucault seriously and I was overwhelmed by how much worse it was than I’d expected. Because the striking thing of course, is that you can absolutely see the appeal. He’s a terrific firework thrower. And he was obviously an incredibly lucid mind in all sorts of ways and an incredible sphere of reference.\n\nAdvertisement\n\nUnfortunately, the vision he gives of life, particularly in The History of Sexuality, is an extraordinarily perverted one. Specifically, I took an interest in his obsession with power and the significance of power in life. And I was underlining, as is my habit when going from a book, I was underlining and making notes of every time that particular thing comes up. And I realized that I had to stop with the power bit because every page was covered with underlinings under every line. And of course this interpretation of life, I realized, was absolutely significant. Absolutely crucial to the social-justice movements and the intersectionalists and others, because this is, to a great extent, that entire interpretation of the world.\n\nIt’s all to do with power. Power in politics, power in personal relations, power in life, power in knowledge. And this is, of course, as I say, a perverse way of looking at all human, any human relations really. And, as I say, I think this has been imbibed, incredibly deeply, including by people who’ve not read much more than a bit of him, but the interpretation of all of life through the lens of power. It certainly was one of the many things that struck me most about him. But — that among many other things — but yes, he’s had an incredible impact, and quite often people say, “It’s very hard, isn’t it, with ideas, that you simultaneously have to work out how an idea that seems demonstratively wrong can have spilled out in such an effective way across a culture. And then of course work out why the culture would have taken that onboard early on.” But anyhow, maybe that’s a different subject.\n\nAdvertisement\n\nMK: I find something so helpful that you did both in your chapter on “gay” and your “trans” chapter, was you provided this metaphor of something being a hardware versus a software issue.\n\nAnd the reason I thought this was so interesting was that I’ve been trying to make sense of that. So, for instance, with trans, which you give really significant attention to all the nuances within it. But the obsession with hardware to me, and I’d be really interested your thoughts on this, as I see it, was that basically post-Enlightenment, everything had to be scientifically provable and in order to be considered true. So, for instance, I’m thinking of this, like, “girl’s brain in a boy’s body” type of stuff. And I’ve spoken to a lot of scientists and neuropsychologists and psychiatrists and it seems to me that this is really little more than a metaphor.\n\nAnd the more accurate metaphor might be that of soul. A gendered soul. And actually, in religious terms, this harks all the way back to the ancient Gnostic heresies when people thought that all matter is evil, and the spirit is superior. And something that you tap into a lot is the kind of religious nature of these new ideologies. So, like, in your race chapter this kind of original sin, of being white — it used to be the original sin was if you were black. Now it’s if you’re white. Where is this kind of religious element kind of coming from and going, do you think?\n\nAdvertisement\n\nDM: Just to take them in order, I think that the hardware/software thing is a useful way to frame and understand this because, as I say, the sort of slur against homosexuality was always that it was a choice. In particular, the religious would say a lifestyle choice. And there was something very obviously untrue about that. Which was that if it was a choice and it was so difficult for most people’s lives, why would they choose it?\n\nAnd gradually people started to realize that lifestyle choice really wasn’t accurate. And in my view, gay-rights campaigners realized this and slightly overstressed it so that they went from lifestyle choice and countered it with the Lady Gaga option, “born this way.” And it makes, it makes total sense because I think, as it happens, homosexuality is more likely to be significantly hardware than mainly software. But it may have been leant on a bit too heavily, this claim of entirely hardware. And actually, the largest study of homosexuality, which has come out since my book was actually at the printers, and I’m very happy to say entirely vindicates what I say in my chapter about that: which is there is no one cause. There’s no gay gene. But there may well be certain genetic aspects which together could predispose somebody, and then there could be some environmental factors, et cetera, et cetera.\n\nBut anyhow, the point is, is that people learn that yes that that happened in the gay-rights movement. Which meant that other rights movements learned from it, which is why, as I say, that trans is trying to claim that it is absolutely a hardware issue. Because if it is, then the point is it’s like — I mean, I’m not saying that they’re exactly like disabled people, but you know one of the many reasons why people don’t tease disabled people is because they didn’t choose to be disabled. So why would you do that?\n\nSo if you can say you’ve got a hardware issue, then you get into that sort of category. Whereas software is choice. I mean it’s the same thing drunks and drug addicts are always hoping that there could be a hardware explanation because otherwise it’s a software thing. And again, that isn’t to put these things in the same category, but so I thought it was a useful way to see that, partly because when I was trying to work out why our age was dementing so much on these issues, one of the realizations that suddenly struck me from reading the gender theorists like Judith Butler of Berkeley was the realization that these two programs are being run simultaneously. And you could run one but not both.\n\nAnd the one you could run was that gay is hardware and trans is software, but you can’t run that simultaneously with “being a woman is a software choice.” So that being a woman is software being trans hardware. Nobody’s actually bought into their gender apart from trans people. [Laughs.] So anyhow, I found that a useful categorization. I hope it is useful for others.\n\nBut the religious aspect is, yes, it’s straightforward thing in a way, which I wrote about at more length in my last book. But yes, I mean when all the grand narratives fall away, including the religious narrative, you have all the same impulses as human beings. You just lack the structures and substructures but they’re still there. And that’s why I say that people should take the social-justice movement more seriously than I think it’s been taken. Because it is an attempt to do a totalistic interpretation of the world and what our purpose in the world should be and what action in the world should look like. So it’s no small thing. And obviously there have been a couple of repeated attempts to replace religiosity. I say that this is probably the most significant and serious attempt to come up with an entirely new worldview since the end of the cold war. But you know, there are other things that people have been trying most recently. Obviously, the green movement, which has many of the same hallmarks in attempt to find total meaning, remission for sins, and much more.\n\nMK: Yeah. And one of the things you do as well is you sort of repeatedly focus back on the human spirit and the human person as an individual. And at the beginning of your chapter on race, you invoke the words from Martin Luther King that really people ought to be judged not by the color of their skin, nor by any other attribute they can’t control, of course, but by the content of their character. So, do you think in one sense, even though it is a very, very interesting question, that difference between hardware and software, do you think maybe it’s not even the right question to begin with? Because, what does it matter?\n\nAdvertisement\n\nDM: Well, it does matter in a way because we need to work out where we can exercise prejudice. And I mean that in the neutral use of the term without any pejorative connotation. We need to work out what we can make judgments about, and in what circumstances making judgments is cruel and in what circumstances it might be kind. So, if we decide that trans is mainly a software issue, for instance, you would definitely not be experimenting on children.\n\nMK: Yeah, actually, this is a good — I mean, I had another question which I’ll just ask now. Which is, you know, at the beginning of the trans chapter, you say that every age does things that another age will look back on and say, what on earth were they thinking. Could you talk a bit more about some of the things you learned about in researching this book, because I think it’s actually very, very underreported.\n\n\n\nDM: I believe that this is one of the things that people should be doing. I mean, one of the great questions that comes towards the end of this book is: If we don’t do this, and I think we shouldn’t, what should we be doing? As people and as societies. But one that I think everybody interested in ideas should do is to presume and, I think a mutual friend of ours, Fraser Nelson, suggested to me years ago: Presume that all ages before this one has done things that make us coo and wow and what on earth were they thinking. And assume that ours is doing so too, unless we think we are the first people in human history to not make errors and to be pretty much perfect. It’s certain that there will be things we are doing which will be looked at back at by our successors with just horror and amazement.\n\nAnd here’s the thing: Most likely, like with our predecessors, they will not be things that they did in order to be evil, but are more likely to be things that they did in order to be good. And that’s the one of the fascinating things in history of why — of everything that goes wrong, is it’s almost always done in an effort to be good. And I think that among the things which future generations will look back at with amazement is a lot of what we’ve been trying to do about trans. And I give an example at the very beginning of that chapter of a very unfortunate case in Belgium earlier this decade, which I think I actually wrote about in a separate piece at National Review about euthanasia. But I approach it from the other aspect, which is the trans aspect to this poor young woman who in an all-male household with terrible, horrible parents and wanting to be like her brothers clearly.\n\nAnd for whatever reasons — not wanting to do psychology on her — thought she would be happier as a boy. And twice transitioned female to male, had three major operations on the Belgium health service. And it doesn’t work, not happy with the results, a lot of scarring and so gets euthanasia. And I think that a future generation will look back and think, “The Belgians did what in the 21st century in the name of kindness?” And so, I think one thing people should do and then say is to keep an eye out for these sorts of errors and mistakes. And just be very careful about them. And be very careful about what we’re doing. And not just to dismiss things as phobias and bigotries when there are questions, we need to be asking and have the ability to ask. As you mentioned, you make of Martin Luther King — I mean, the reason I cite him is because I think that something very profound has happened in my own adult lifetime and it is this unweaving of this dream — the moving away from, I say in the book at one point, in the moving away from the content of speech solely onto the characteristics of the speaker.\n\nSo that a word can be safe in one mouth and not in another. An idea can be expressed by one person and not by another, entirely dependent on the gender, sex, sexual orientation, or race. And this puts anyone searching for truth into a very difficult position because it puts other things as more significant than the search for truth. And I finished the race chapter obviously, as you know, with a demonstration of how that dream of Martin Luther King’s in 1963 is completely inverted within half a century by professors of whiteness studies who insist that to judge somebody by the content of their character rather than by their skin color is what’s problematic.\n\nAdvertisement\n\nMK: Is part of the problem, though, that with postmodernism and you mentioned Judith Butler — and the thing I really love about your writing, Douglas, is that you just have to quote people to prove your point. You’re not laboring the point . . .\n\nDM: Yes. She’s the best witness for her own prosecution as a writer.\n\nMK: [Laughs.] Quite. But there is this ultimate cynicism, and it’s the cynicism of Pontius Pilate when he says, “What is truth?” And if we’re starting from a position where we don’t really believe in truth, we only believe in power, how can we possibly take your good ideas and run with them? You’re saying the search for truth, but I feel that we’ve given up on that\n\n\n\nDM: Well to a great extent, yes. But it’s a very unhappy life that people live if they have no connection with truth or no search for it or no interest in it, because the more lies you live in, the more disorientating the world will be. I mean, you start from the absolute basics. Is it good to lie to people about what mortality is? Is it good to tell people as they’re forming that actually they will live forever? They’re gonna have a hell of a bad letdown at some point, if you did tell him that. Tell him that nobody they love will ever die and just keep telling them that. How are they actually going to live in the world and live their lives? Very unhappily.\n\nMK: It’s also really unjust. Because I mean, you hear this all the time with the “Me Too” stuff. People coming forward and saying,“Well, this is my truth. This is my truth.” It’s like, but what about the truth?\n\nDM: Yes. That’s been coming for a while — I would say since the ’90s. The idea of things being what the complainant identifies them as being. This is written into law in our country now, whereby the victim of a crime claims to be motivated by something if they feel it is. Which at any rate, means that justice is not blind, but favors certain people over others. My own view is that somebody who’s killed because of their sexuality or the race is no better or worse off than somebody killed for their handbag.\n\nBut yes, the idea of “my truth” — a lot of this talk comes about from the problem of dealing with incredibly diverse and pluralistic societies, which can now speak to and about each other all the time. So, you have to find ways to fudge, people think. And I think that’s — for some people — a little bit of a lie is just convenient to get through. But I do think that in general, we can persuade people that it’s just better to live your life with an interest in truth because otherwise you will not be able to orient yourself in the world, because the world . . . because the world will keep on throwing up surprises that shouldn’t come as surprises to you.\n\nMK: Yes. And also contradictions. I don’t understand how these people can live in such contradiction. It would drive me insane.\n\nDM: Well, that was one of the great breakthroughs for myself while writing this book. Because I had thought for a long time, surely this whole intersection nonsense will fall apart under the weight of its own contradictions. And then, of course, I realized that because of the Marxist substructure of a lot of this — which I go into in one of the interlude chapters — because of the Marxist substructure of some of this, actually the contradictions aren’t a problem. In a lot of Marxist thought the contradictions, of course, were there. They merely needed to be embraced and got through. But they weren’t a problem. They weren’t a problem in the way that you or I might see them as a problem. But if there’s a contradiction, it means that one of the things is wrong and we must work out what.\n\nBut that’s not how Marxists have thought, historically. And it’s a fascinating thing, this. There are several things like that in the book, which I think it’s really important for, as it were, outsiders of this thought system to realize. Because otherwise we might put our hope in hopeless things such as, as I say, the hope that these contradictions will at some point end the movement.\n\nAdvertisement\n\nMK: Yeah. Something you said, just to go back a little bit, you said about having the ability to ask — and I’m conscious that, not that I think either of us try to invoke this too much, but both of us have certain street cred because we belong to one of the victim groups. I’m a woman and you’re gay . . .\n\nDM: And you’re Scottish and I’m Scottish.\n\nMK: Oh, we’re not victims, Douglas. Come on!\n\nDM: Conquerors. Conquerors!\n\nMK: Exactly, basically invented the whole world — but anyway, the point is that I think that people listen to us and there’s a certain of street cred, like I said, that comes with that. And I’m wondering: If you’re a young, straight, white male, who has no claim to any sort of victim status, then it seems to me that, certainly not in public life, you actually don’t have the ability to even ask the question.\n\nDM: Yes. I’m very conscious of this. I actually don’t think that — although on the outside it might look like having the least usable minority card might bring some benefit — it never has to my knowledge. And that’s because I think if you play — and we should get onto the privilege game at some point. But if you play the privilege game that’s being played, any lack of privilege I have for being gay must be counted out by my privilege of being male and white and speaking the way I do, I suppose. And having learned to read and write . . .\n\nMK: To a very high level, I would say.\n\nDM: That’s very kind of you. And I would return the compliment.\n\nBut no, I think that — to give an example, actually, just fresh in my mind, I was on the television this morning on Piers Morgan’s program in the U.K. And I was discussing some subjects of my book with a black model, who’s Scottish herself, who just wouldn’t stop talking. And I thought she must have some circular breathing technique.\n\nAnd she was a very nice woman, but it was perfectly clear: She would not be interrupted by white people. And she made it clear at one point. She said, “There are three of you who are white and I’m the only black one, so I’ve got to talk.” And as I say, I don’t get any, it doesn’t give me 15 seconds more ’cause I’m gay. [Laughs.]\n\nSo my view is that yes, a hierarchy has been set up for the time being which is a sort of over-correction. And it’s very ugly and I want it to stop. Not because I myself want to be allowed to speak more or anything like that. None of this makes much of impact on me because I don’t regard my own right to speak or talk or think as being predicated on anyone else’s permission.\n\nAnd that’s not a white thing or a gay thing or a male thing. That’s just I have written a lot. I’ve written a lot of books. I’ve thought a lot about subjects. I’ve thought about them. So, I believe I’ve earned the right to speak about them for that reason. But I, it’s a slightly long-winded answer to your question, but I am very worried about precisely the thing you just put your finger on, because it’s true that historically there’s been sexism, there’s been homophobia, there’s been racism.\n\nIt’s true that there are expressions of that today. We don’t live in Nirvana. We almost certainly never will. But to think that the answer to that is to flip the hierarchy and oppress the white male for a bit, by way of revenge or correction, is something that worries me enormously because as you say, these things are not abstract. It is in the end; a young male being told to shut up about everything. Everything. And that’s the problem. And that’s why I’ve written the chapter I have on women and the relations between the sexes because I know from conversations that so many men and so many women want to be able to talk about this but are being stopped from doing so.\n\nMK: Yes. I also think it lowers the standard of public discourse a bit. Because, you know, our friend Freddy Gray talks about the dreaded “as a” essay. As a woman. As a gay person. As a whatever. And it seems to be every time I read an op-ed like that, I just think, Well, you don’t have to be a horse to be a vet! It is extraordinary. It’s an extraordinary idea, this “lived experience” thing.\n\nDM: Yes. And I mean, we know it from writers why it doesn’t work, because the old story that everyone has a novel in them, which is not true, as Martin Amis once said, maybe everyone has a memoir maybe. Maybe. But only some memoirs, given the number of people on the planet and the paucity of time, only some memoirs themselves actually break through because they are revealing of something wider about the human condition.\n\nNow that can come and could come from absolutely any direction. I have no doubt about that. And no particular prejudice myself about which directions I’d prefer it to come from. Great truths can come from anywhere. And that’s one of the great things about them. But to think that they are more likely to come from a specific minority or majority group is to fall into precisely one of the areas we might have thought we’d escaped.\n\nMK: And you know as a woman or, rather, as a person who has a claim to this victim thing (not that I want it and not that I intend to use it, because I think to do so is cynical), but sometimes it can be quite confusing. So, I’m just thinking of an example. I was once debating a trans woman who — and I can say this, Douglas, because I’m in America right now and we have the First Amendment — but I believe trans women are men presenting as women. And I think some have, you know, very good reasons for doing so. And I wish them well and I’m certainly happy to be polite and courteous and address people as they desire. But that’s what I think. I have no reason to think otherwise.\n\nAnyway, so this trans woman started sneering at me and saying I didn’t know anything because I’m just a young woman. The point I had just made had been that children don’t know who they are. I mean they don’t even know what they want for breakfast. And I was saying that I knew this, anecdotally, from having worked as a nanny. And then this trans woman says, “Well, we’re not talking about nannies.” And I just kept thinking to myself, this is really sexist. And do you know what, you lived the first 40 years of your life (and I know this because I looked it up) as a heterosexual man. And we’re all supposed to pretend that that never happened.\n\nDM: You saw, of course, the event in the U.K. the other day with Kathleen Stock and other various women who were at a public meeting and the building was surrounded by trans activists who were banging on the windows. Now in what other situation is it permissible for women to be intimidated by people who are born male, on mass, with the police looking on?\n\nI would suggest nowhere. Here gets, by the way, to one of the — this is going back to this hardware/software thing, this is why these categories are so fascinating because, you see the blips when we’re trying to do things that if you look at the substructure don’t work. I gave you the example of people are born trans, but people aren’t born women. But here’s another one. Why when the argument for trans racialism is exactly the same as the argument for transsexualism, does it not work with trans racialism and does with transsexualism?\n\nAnd because — and just for listeners — I’m referring of course the fact that when Rachel Dolezal, the famous white black activist, the NAACP — this is an example of other way of, I mean, it’s all very well to quote Foucault. But a lot of these new metaphysics are being made up on prime time. And on The View in America, we see Rachel Dolezal on a couple of years ago with a mainly black and Hispanic panel of women. And they just won’t have it. They just won’t have it. And there’s no way that people think that Dolezal came out fine from it. They just say, look, there is no way we’re allowing you to be black because you have not lived our experiences as black women.\n\nNow we might go into a discussion about what those experiences are and why they’re particular to black women, if they are and so on, but that, that was the absolute red light. Just no, you’re not coming here. Thank you. But the thing was, of course, as you know, this is exactly what second-wave feminists had said for years to trans and they were ignored. So why did it work when black women said you have not lived as a black woman, you’re not black. But it did not work, has not worked when women said you have not lived our lives as women, you are not a woman. So, very interesting question as to how that came about.\n\nMK: Do you have any ideas to the answer?\n\nDM: My instinct on it is that it has specifically to do with America’s racial history and that it’s permissible to . . . I mean, I go into the Hypatia journal controversy in my book, which, you know, but I think it’s that all the things I describe might be overcorrections of some kind. I mean, the turning of gay from the passing of equal into something like better, not on all the cases, but on some occasions that gay is better, the women are exactly the same as men and also magically better . . .\n\nMK: Which I defend actually. Well, no. Actually, no: I don’t accept the first part. We’re definitely different, but in some ways we’re definitely better.\n\nDM: But it’s weird to do absolutely equal and better.\n\nMK: Yes, you can’t do both.\n\nDM: As it would be strange to do absolutely equal and worse. But if there is an overcorrection, this doesn’t mean of course I’m saying that the lives of all black people are magically better somehow than suddenly than anyone who’s white. But the overcorrection in America, and much of what’s happening, is the Americanization of global culture. And a lot of this, particularly the exporting of the American racial problem to the rest of the West.\n\nWhereby everything is portrayed in the light of American problems. But park that for a moment. What I think the overcorrection looks like in America is we will say, having had in the past people who said that being black was in and of itself bad, we will do that to white for a bit, over-correct, and then we’ll get back to equal. And I think this is a disaster. I mean, I’m thinking of things like whiteness studies. The only such studies that is intended and designed to “problematize.” One of the ugliest words apart from “intersectionality” in the language but designed to “problematize” white people. This is clearly part of an overcorrection on race, which is likely, as I hint at, to have very, very damaging blowback of its own. But I think that for the time being, America is not willing to allow the transracial thing because to do so would not assist the overcorrection that America feels is needed on race.\n\nMK: That’s really interesting.\n\nDM: Whereas women, I think people are more willing to sacrifice women frankly on that one.\n\nMK: One of the strong themes in your book of course is the role technology plays in mobilizing a lot of this stuff. Especially sort of on a global level. And you know, it’s interesting, because many progressives, I think, worry about this in their own way. So, like the role that technology may or may not have played in the 2016 American election.\n\nAnd you highlight — very usefully, I think — how the various pretenses of neutrality from Google and Facebook are mendacious. And you also talk about how reputations that took years to build can be destroyed by a Twitter mob after just one intemperate or even misinterpreted tweet. So, the question I’m getting at is what you think is the biggest threat that technology — and I’m specifically meaning sorts of social media, but you can widen it if you want — poses democratic principles.\n\nDM: I think it’s a personal principle it threatens most. And the personal principle is the thing I talk about in my chapter on forgiveness — the interlude on forgiveness. Because, you know, a lot of people on the right in America in particular have gone very big on the anti-snowflake thing.\n\nAnd I think this is cruel, really. Or at least isn’t suitably understanding of the situation that people growing up today in America and other countries in the West find themselves in. Which is that you are looking out at this unbelievably complex world. Which was always unbelievably complex. Its complexity now is able to be brought home far, far more thoroughly on a day-to-day basis than ever before. You live in a world in which “action in the world,” to use the term that Hannah Arendt uses in the essay I quote, that action in the world has never been more precarious.\n\nThat the photograph that a young woman in America sends out of her and her prom dress turns out to be the wrong prom dress and she’s flayed and destroyed on social media when all she wanted was to be liked. And all of this, all or all of the impact of the technological advances of recent years have, I think, failed to — we know that we’ve known the tip of some of the iceberg, but we really haven’t seen the iceberg. The iceberg is that any action in the world or any judgment in the world could be your last judgment or action, literally or metaphorically. That you’re always on the brink of absolute destruction.\n\nThis is partly what I describe as the collapse of private and public language. Our species has spent thousands of years able to speak in private and in public, and for there to be a divide between the two, and at the moment the divide is essentially eroded.\n\nSo that any conversation can be public, not slowly, but immediately to the entire world. And in this situation, I think, for a young person growing up in their teens in particular today, is right to be terrified.\n\nBecause as I go on to say in that chapter, the only means that we’ve ever come up with as a species for the undoability of our actions is forgiveness. And our culture is obsessed with punishing any and all erroneous action in the world, often an erroneous action that was only made erroneous 24 hours ago, but spends no time thinking about forgiveness.\n\nAnd so we are, unless people are able to train themselves and be trained out of it, which is one of the things I try to do in this book is to give some of the ways out for young people among others is that they are stuck in this world which would persuade you very easily that the best thing to do is nothing. And I think we need to think very seriously about how we reverse that incentive or lack of it. I think it’s huge. And I think people need to try to understand this much better and be more understanding of it and collectively work away through it.\n\nMK: I think that’s one of the things that come out really strongly in your book. Because you actually do approach all of these things with a spirit of generosity. And I think you’re absolutely right about the snowflakes thing. Because it’s not like young people just magically became hypersensitive or whatever. And it’s not just parenting, as Jonathan Haidt and Greg . . .\n\nDM: Yes. It’s not just helicopter parenting.\n\nMK: No, it’s not. Actually, my friend Samuel Abrams, who is a political scientist, has done a lot of work on showing how college administrators essentially radicalize students. So, they arrive on campus a sort of politically moderate and then they have these events organized by administrators, which are full of the kind of toxic nonsense you debunk in your book. And you do think, okay, well most young people are just going to absorb all that. Of course they are!\n\nDM: Yeah, of course. If the adults are telling them that, then a lot of them will believe it. But yeah, by the way, these departments have to be fired. We have to get down to some practical things on some of this. And I think in the last 20 years, if I’m right on the stat, that the amount of college tuition that has gone into administrative purposes has quadrupled in the United States of America. So young people in America getting into debt for degrees which are often not helpful anyway, are running up a significant chunk of that debt to be told lies by college administrators about the world. I’m just amazed that American parents don’t mind this more. And that American students don’t mind this more. It’s just a wicked, wicked Ponzi scheme to engage themselves in.\n\nMK: Yep. Well listen, there’s so much more I want to ask you, but we’re out of time. So, I’ll just want to end with a final question. You began with the minefield metaphor to say that you really wanted to clear the way for others. But you know, so many people now, people in positions of power and influence, are too scared to do that. So, my question is: You’ve done it. You’ve spoken up. Has it actually been all that bad? I mean, do you feel you’ve lost something by telling the truth? And if so, was it worth it?\n\nDM: I never do feel I’ve lost anything by telling the truth. I doubtless have. I’m highly unlikely to be put into the House of Lords.\n\nMK: Where you would do a lot of good, I’m sure.\n\nDM: Well, that’s very kind of you to say so. But you need to tell the prime minister and the Queen. The Queen must be told!\n\nBut I mean one of the realizations I’ve had in recent years — and this is partly from doing public events, and I think again, particularly speaking to young audience members — one of the greatest things of my life in recent years has been the flipping around of the presumption people used to have about who was interested in ideas. There was a presumption when I started off — I’ve just turned 40, so I feel like I can talk as a sage for moment — [laughs] — but when I started off, there was a presumption really that it was the old who are interested in ideas and politics and so on and the young were just stupid or something or just uninterested.\n\nThe great thing of the last five, ten years has been that people in their teens and 20s and more want to come out. They want to be engaged in the ideas of their time, and they are. The clever ones are. And my gosh, are they clever. I mean everywhere I go — I’m in a different country about every week and have been for the last two years. I travel very widely and I’m very lucky, I speak with an amazingly wide array of people. One of the things I discovered is that, partly thanks to the — I mean we talked about the downsides of the Internet — but partly thanks to a developed availability of articles and books. Partly to do with YouTube, very largely to do with YouTube.\n\nAlmost everywhere in the world you go, you discover that people are at exactly the same cusp of each debate. And I find this so moving and so extraordinary and so hope-giving and -causing. Because I think if we can get through this stuff, what might we do next?\n\nI mean, we could get on to really productive things. And I mention this as a sort of long-winded way to say that what I realized is that people are fearful of engaging in these ideas, and in all of the ideas of their time, only if they have a structure above them which is wobbly and weak and vulnerable to crowd stampede. And so, since that is almost all people working for the public sector, almost everyone working for government, almost all elected representatives, almost all educationalists, most people in business, almost everybody in the corporate world, people on multimillion-dollar salaries or people on five-figure salaries, every celebrity in the world, all of the famous actors and singers — since all of these people cannot talk without risking everything, all the time, you have to say, Who can speak now?\n\nAnd the bizarre but wonderful-in-a-way answer is: People who don’t have to answer to anyone above them. And amazingly, that is a few writers, fortunate writers like myself who are in a position of having employers who hire us but who do withstand the mob when it comes but generally don’t have a large hierarchy of wobbliness above us and a few comedians. And I’m not being self-aggrandizing, but it’s not much more than that. And, as I say, there are definitely things I can’t do now with my life. But then your entire life is a thing of choosing things, and that means shutting off other doors.\n\nSo it’s always better than people think, in my experience. But then I’ve ended up being in a fortunate position. Partly of my own creation and, as I say, probably partly of luck. But I would urge anyone else in a similar position to take advantage of it and not waste their time. Run full-tilt at the things that need running at, and make it easier for others, because we cannot live in a future where men and women cannot talk about each other, where people can’t talk to people of different racial backgrounds or different sexual orientations ,and where we just don’t know what to think about anything because we haven’t been allowed to think. And so, in the process we rush through bad ideas and mainstream bad thinking. I think we can avoid that. And I, at any rate, I’m just very proud that I have any role at all in that. But as I say, writers do, and we have done before and hopefully we will for some time to come.\n\nMK: Great. Well, that’s a great note to end on. Thanks so much, and I really do hope everyone goes out and gets your book, because it is absolutely terrific. Thanks so much for your time, Douglas.\n\nDM: It’s been an enormous pleasure. Thank you.", "description": "The Scottish scholar and journalist discusses his new book about the uses and abuses of identity politics.", "authors": ["Madeleine Kearns", "Andrew C. Mccarthy", "Alexandra Desanctis", "Kevin D. Williamson", "John Yoo", "Jim Geraghty", "Kyle Smith", "David French", "Mairead Mcardle", "Victor Davis Hanson"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/douglas-murray-good-morning-britain-2.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-01"}