{"pub": "theverge", "url": "https://theverge.com/2019/10/22/20927170/spotify-premium-subscribers-free-google-home-mini-deal-promotion", "downloaded_at": "2019-10-22 20:45:40.576831+00:00", "title": "Spotify is giving Premium subscribers a free Google Home Mini", "language": "en", "text": "If you’re a Spotify Premium subscriber, Spotify is offering you a Google Home Mini for free now through November 15th, or until supplies run out (via Business Insider).\n\nBefore you try to jump on this offer, note that the deal is for the previous generation of Google’s smallest smart speaker, not the newly released Nest Mini. And some circumstances will rule you out of the promotion (more on that later). But if you qualify, it’s a great way to get a $50 smart speaker as part of your monthly Spotify subscription.\n\nThis is for the Google Home Mini, not the new Nest Mini\n\nHere’s how you claim it (special thanks to my colleague Dan Seifert, who went through the process).\n\nFirst, visit this website. If you aren’t already a Spotify Premium subscriber, you’ll be prompted to sign up. If you are, just log into your Spotify account. Once you’re logged in, just click to select if you have an Individual or Family plan, and you’ll have “reserved” your Google Home Mini, assuming there are still supplies left and if you qualify for the offer. You’ll then get an email confirming your reservation. Once your reservation is ready (for Dan, it took a little over 30 minutes), you’ll get another email. That email will link you to Google’s online store, where you can get your new Google Home Mini with a discount code applied to make it free.\n\nNot every Spotify Premium user is eligible for the promotion. We looked through the terms and conditions and found some circumstances that will rule you out of the free smart speaker:\n\nUsers with free trials aren’t eligible, which means you can’t just sign up for a free Premium trial and snag a free Google Home Mini. Discounted Spotify Premium trials won’t work, either.\n\nYou’re also not eligible if you have a Premium Student plan.\n\nIf you got a free Google Home Mini last year through Spotify’s promotion for Premium Family plan account owners, it seems you won’t be able to get another through this promotion, as found by Business Insider.\n\nBut for many Spotify Premium users, this should be a pretty good deal. And don’t worry if you’ve already taken advantage of free Hulu as part of a Spotify Premium subscription — Dan has, and he was able to claim his free Google Home Mini.", "description": "If you’re a Spotify Premium subscriber, Spotify is offering you a Google Home Mini for free, now through November 15th, or until supplies run out.", "authors": ["Jay Peters", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/4BakEsVb8_QVcwCrzYJj7YGufIU=/0x115:2040x1183/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9424733/dseifert_171008_2042_4560.jpg", "published_at": "2019-10-22"}