{"pub": "npr", "title": "5 Dead As Slow-Moving Dorian Batters The Bahamas, Tracks Toward U.S.", "url": "https://npr.org/2019/09/02/756719127/slow-moving-dorian-batters-bahamas-as-a-category-5-hurricane", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:03:08.394889+00:00", "text": "5 Dead As Slow-Moving Dorian Batters The Bahamas, Tracks Toward U.S.\n\nEnlarge this image toggle caption Tim Aylen/AP Tim Aylen/AP\n\nUpdated at 6:55 p.m. EST\n\nBahamas Prime Minister Hubert Minnis says at least five people have died in the Abaco Islands, where Hurricane Dorian made landfall Sunday as \"the strongest hurricane in modern records\" to hit the archipelago.\n\nMinnis described the hurricane as a \"historic tragedy\" that's brought \"unprecedented and expensive\" devastation to Abaco.\n\n\"There are many difficult days, weeks, and months ahead of us as a people and as a country,\" the prime minister said. \"We must stay united as a people to bring immediate assistance, to bring hope, to bring recovery and to rebuild lives.\"\n\nSlow-moving Dorian continues to pummel Grand Bahama Island. It has been downgraded a notch, but remains a powerful Category 4 hurricane, according to the latest National Hurricane Center advisory.\n\nThat is little comfort to those enduring the massive storm, given its unyielding creep west at 1 mph most of the day, a pace slower than most people can walk. The present movement of the storm according to the 5 p.m. advisory was described as \"stationary.\"\n\nDorian's maximum sustained winds had been near 165 miles per hour, according to an earlier advisory. But NHC says the winds have dipped to 145 miles per hour, with wind gusts up to 170 miles per hour, according to an updated statement.\n\nEven though the storm has weakened some, officials warn those in its current path not venture outside because \"winds will suddenly increase after the eye passes.\"\n\nThe National Hurricane Center is predicting \"life-threatening\" storm surge that will lift tides as high as 12 feet to 18 feet above normal levels in areas on Grand Bahama Island, where the storm is expected to spend most of the day Monday.\n\nEarlier in the day storm surge was predicted to be as high as 23 feet above normal tide levels.\n\nThe National Hurricane Center has also extended the hurricane and storm warnings farther up the U.S. east coast.\n\nEnlarge this image toggle caption Ramond A. King/Reuters Ramond A. King/Reuters\n\nOn Monday evening Virginia, joined Florida, Georgia, South Carolina and North Carolina in declaring a state of emergency ahead of Dorian. In a statement Virginia's Democratic Gov. Ralph Northam said the southeastern part of the state could begin to feel the effects of the storm by Thursday.\n\nBefore that however, officials expected Dorian to \"move dangerously close\" to the east coast of Florida later Monday night through Wednesday evening. From there, Dorian is predicted to shift northward, inching perilously near the coasts of Georgia and South Carolina on Wednesday night into Thursday.\n\nEarlier Monday, the NHC urged Eastern Seaboard residents from Florida's east coast all the way up to North Carolina's Outer Banks to monitor the storm closely.\n\nFor now, much of the attention has been focused on the Bahamas, where updates have been difficult to obtain as the storm pounds the island.\n\nOne Twitter user posted a video of murky, brown water rising inside of a home, just inches from a window ledge. The video also captures a tree whipping violently in the wind as water outside sloshes against the same window.\n\nSpeaking from an emergency call center in the city of Freeport, Don Cornish, the disaster manager for Grand Bahama said the storm sounds \"like a freight train is passing,\" adding that there is flying debris and intensifying rain.\n\nEnlarge this image toggle caption NOAA satellite handout via AP NOAA satellite handout via AP\n\n\"We're getting a lot of frantic people calling in about flooding issues, and they're very concerned because of the storm surge, how it's affecting their homes,\" Cornish told Morning Edition host Rachel Martin on Monday.\n\nCornish says the emergency center has received reports about people trying to get out in these conditions because of the level of water in their homes.\n\nHe says he expects this hurricane will \"disrupt very much the quality of life\" for many on the island.\n\nA Twitter account for Bahamas Press reports that some residents on the island were experiencing a 15-hour \"power disconnect\" while others report widespread flooding. In another post, Bahamas Press tweeted a distress call about rising water levels:\n\n\"I know nobody could move in Freeport but please if yall could get a boat or somethiing to churchill drive we will appreciate it. My brother, his girl and their two small boys are stuck in the roof of their home ...\"\n\nAlthough the NHC is forecasting \"gradual weakening,\" Dorian is expected to remain a powerful hurricane for the next couple of days.\n\nNPR's Greg Allen, based in Miami, tells NPR's Newscast that its not just Florida residents who are keeping a close watch on Dorian closely.\n\n\"Even if it stays offshore, it's likely to bring high winds and flooding to some parts of the southeast, from Florida to the Carolinas,\" Allen said. \"Mandatory evacuations have been ordered for mobile homes and beachside communities along Florida's Atlantic Coast.\"\n\nThe White House had already approved a similar emergency declaration for Florida, late last week. President Trump also approved emergency declarations for Georgia and South Carolina, according to a White House statement released on Monday.\n\nThat White House announcement came hours before a mandatory evacuation went into effect for several counties in Georgia east of the Interstate 95.\n\nThe mandatory evacuations are in effect for Bryan, Camden, Chatham, Glynn, Liberty, and McIntosh counties began Monday at noon.\n\nIn a tweet, Georgia Gov. Brian Kemp, a Republican, urged residents to \"stay vigilant and be safe.\"\n\nAt a mid-day press conference, Kemp added: \"Hurricane Dorian remains a \"significant threat\" to Georgia, a point he says emergency officials throughout the state \"can't stress enough.\"\n\nHe also issued a dire warning to Georgia residents who choose to remain in mandatory evacuation areas:\n\n\"Given the risk of strong winds and potential flooding in these areas, if you decide not to evacuate, I want to be clear, you will be on your own if first responders are unable to reach you,\" Kemp said.\n\nAt a separate briefing Monday, Florida's Republican Gov. Ron DeSantis said he had been in touch with the President. He said the President is \"fully engaged\" and promised to provide resources the state needs to weather Dorian.\n\nDeSantis says the storm has \"basically stalled out\" a little more than 100 miles east of Florida city of West Palm Beach, a situation he admits is \"frustrating\" to many Floridians.\n\n\"This has been frustrating, I know, for a lot of people because this seems like we've been talking about this for a long time,\" DeSantis said. \"Bet we are in a situation where the storm is stalling very close to our coast. It is going to make a movement. And the movement that it makes is going to have a lot of impact on Floridians.\"\n\nHe said more than 17,000 crew members with Florida Power and Light are on standby throughout the state to restore power should the storm knock it out.\n\nA hurricane watch is in effect for Florida from north of Deerfield Beach to the Jupiter Inlet, and from Florida's North Vedra Beach to the South Santee River in South Carolina.\n\nThe hurricane also is adding chaos to already-hectic Labor Day travel. According to Flight Aware, an airline tracking website, more than 1,100 flights into or out of the United States have been canceled so far Monday.\n\nAirports with the most cancellations, according the site, include Hartsfield-Jackson in Atlanta, as well as those in the Florida cities of Fort Lauderdale, Orlando, Palm Beach and Miami.\n\nNPR's Emma Bowman contributed to this story.", "description": "The prime minister said five people were killed in Abaco Island. The Category 4 storm sustains 145 mph winds with \"life-threatening\" storm surge levels expected on Florida's east coast by late Monday.", "authors": ["Brakkton Booker"], "top_image": "https://media.npr.org/assets/img/2019/09/02/ap_192456089697231_wide-7de68845d0ee38d2e5a6394a0a17845584a02b2f.jpg?s=1400"}