{"pub": "foxbusiness", "url": "https://foxbusiness.com/features/new-york-city-sues-chipotle-citingunfair-labor-practices", "downloaded_at": "2019-09-10 23:29:28.711720+00:00", "title": "National restaurant chain Chipotle sued in New York over unfair labor practices", "language": "en", "text": "Mayor Bill de Blasio’s administration has filed a lawsuit seeking at least $1 million in restitution from Chipotle Mexican Grill for workers hurt by widespread violations of New York CIty laws meant to protect them.\n\nContinue Reading Below\n\nThe suit claims the Mexican restaurant chain -- which boasts more than 2,500 locations nationwide -- failed to comply with New York City’s Fair Workweek Law, which bars employers in several industries, including fast food, from changing an employee's schedule less than 14 days before the work date.\n\nThe law also requires bosses to pay their employees a $100 premium to work certain shifts and give current staffers the chance to work an available shift before hiring someone else to fill it, according to officials and a notice released when the law was passed in November 2017.\n\n“In New York City, predictable schedules for fast food and retail workers are a right, not a privilege,” said de Blasio, who is currently seeking the Democratic nomination for the 2020 presidential election. “Chipotle must immediately stop their unfair labor practices and put their employees above profit.”\n\nAdvertisement\n\nThe City’s Department of Consumer and Worker Protection has received dozens of complaints from Chipotle employees who work in five Brooklyn locations, according to a statement. The office is also investigating 11 Manhattan locations where similar allegations have been made. Statewide, New York is home to 155 Chipotle restaurants, according to the company's website.\n\nDeBlasio's office said Chipotle “violated nearly every aspect\" of the city's fair workweek law, failing to prove schedule estimates within the two-week threshold and neglecting to pay premiums if the schedule notification was late.\n\nCLICK HERE TO GET THE FOX BUSINESS APP\n\nThe restaurant chain's employees \"know that Chipotle is committed to creating a safe and engaging work environment,\" Chief Reputation Officer Laurie Schalow said in a statement to FOX Business. \"They also know that Chipotle is committed to complying with all laws, rules and regulations pertinent to our business.\"\n\nSchalow said Chipotle has been working with the city to establish processes that comply with the new law and called the filing \"unnecessary.\"\n\n\"Regardless, we will continue to cooperate with the city and we are addressing any prior noncompliance concerns,\" she said.", "description": "The lawsuit filed against Chipotle Mexican Grill seeks $1 million restitution for its employees.", "authors": ["Stephanie Pagones"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/02/0/0/Chipotle20Logo20AP20FBN-1.jpg?ve=1&tl=1", "published_at": "2019-09-10"}