{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/san-franciscos-new-developments-catering-to-younger-buyers-who-want-it-all-207627", "downloaded_at": "2019-09-28 12:03:06.597852+00:00", "title": "San Francisco’s New Developments Catering to Younger Buyers Who Want It All", "language": "en", "text": "After two quarters of either no or negative price appreciation, San Francisco’s luxury condo market has bounced back, according to Compass Development’s Q2 Market Report.\n\nFrom Dogpatch to the Russian Hill area, the new projects launching sales in the fall are sleek and modern, yet designed to foster a sense of community that takes the edge off of big-city life.\n\nThe new quarterly median price—$1.25 million—was fueled by June’s new monthly high of $1.3 million and was slightly higher than last year’s $1.235 million.\n\nA combination of factors—“high stock markets, low interest rates, surging luxury homes sales, limited inventory and a spring filled with unicorn IPOs”—created the perfect storm for the new high prices, according to the report.\n\nThe upswing in quarter two, which is typically the city’s strongest one for condos, is being heralded with a handful of luxury projects in Dogpatch, South of Market (SOMA) and Cow Hollow that are set to launch sales in the fall.\n\nIn quarter two, there were 713 closings—an 85% increase in sales volume from quarter one, according to a New Development Market Insights report by Compass Development and The Mark Co.\n\nWith their yoga classes, outdoor courtyards, fitness centers, these walkable new projects are catering to a younger set of buyers who live healthy lifestyles yet want to be where all the action is. Here are some of the luxury residences launching sales in the fall and early next year.", "description": "Condos hitting the market this fall were designed with community in mind", "authors": ["Nancy A. Ruhling"], "top_image": "https://images.mansionglobal.com/im-110927?size=1.6&width=1280", "published_at": "2019-09-28"}