{"pub": "nytimes", "url": "https://nytimes.com/2019/10/11/us/politics/2020-democrats-primary-polls.html", "downloaded_at": "2019-10-11 12:41:37.614555+00:00", "title": "Why Populist Democrats Have Gained the Upper Hand in the Primary Race", "language": "en", "text": "By\n\nOct. 11, 2019\n\nWith a crucial debate looming next week in the Democratic presidential primary, the party’s populist wing appears increasingly in control of the race — rising in the polls, stocked with cash and with only a wounded leading candidate, Joseph R. Biden Jr., standing in its way.\n\nSeveral slow-building trends have converged to upend the race over the last few weeks: Senator Elizabeth Warren’s steady ascent in the polls has accelerated. Both she and Senator Bernie Sanders, a fellow progressive, have raised immense sums of money from small donors online, dominating the Democratic field and each collecting about $10 million more than Mr. Biden in the last quarter. And Mr. Biden’s numbers have gradually slipped in a way that has alarmed his supporters.\n\nThe race is far from over: All three of the top candidates — Ms. Warren, Mr. Biden and Mr. Sanders — have a path to victory, and there is still time for longer-shot candidates to make a real run at the nomination. The CNN/New York Times debate in Ohio on Tuesday is likely to test Ms. Warren’s status as an emerging front-runner, subjecting her to new criticism from her fellow Democrats on matters ranging from health care policy to trade and the role of the government in overseeing the economy. Above all, she may need to allay lingering reservations about her appeal to swing voters in the general election.\n\nAnd Mr. Biden signaled on Thursday night that he will come into the debate fighting. “One of the problems I’m finding, I’ve got to be more aggressive,” he said at a fundraiser in Los Angeles. He then used a roundabout example to explain that debate time restraints don’t allow time for lengthy answers.", "description": "As next week’s debate looms, polls and donor contributions suggest a party seeking candidates for 2020 who will push the boundaries, while moderates argue they can beat President Trump.", "authors": ["Alexander Burns"], "top_image": "https://static01.nyt.com/images/2019/10/11/us/politics/11dems2020-01/11dems2020-01-facebookJumbo.jpg", "published_at": "2019-10-11"}