{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/warren-campaign-previously-unionized-reached-collective-bargaining-agreement/story?id=65925247", "downloaded_at": "2019-09-29 00:20:09.042405+00:00", "title": "Warren campaign, which previously unionized, reach collective bargaining agreement", "language": "en", "text": "After four months of negotiations, Sen. Elizabeth Warren's presidential campaign has reached a tentative collective bargaining agreement to unionize.\n\nInterested in Democratic Party? Add Democratic Party as an interest to stay up to date on the latest Democratic Party news, video, and analysis from ABC News. Add Interest\n\nThe first step to getting here ⁠— when the campaign announced it submitted its support to the union ⁠— was back in early June. They will move to ratify the agreement next week.\n\n“I’m proud that my campaign has reached an equitable agreement with IBEW 2320 and I’m grateful to the bargaining teams for getting us there,” Warren said in a statement Saturday.\n\nSen. Bernie Sanders' campaign has also unionized and was the first campaign to ratify a union agreement. Julián Castro's campaign is in the process but has not yet ratified an agreement.\n\nIf ratified, organizers for the Warren campaign would receive $4,175 a month, which includes a travel and cellphone stipend. Organizers will work 60-hour weeks, with one guaranteed off day and will receive 15 paid vacation days and paid holidays. The campaign will continue paying 100 percent of campaign employees’ healthcare.\n\nMarco Bello/Bloomberg via Getty Images\n\n\"Throughout the negotiation, we focused on wages, benefits and working conditions which are the hallmark for every working person in the United States today,\" Steve Soule, Business Manager of IBEW Local 2320 said in a statement sent by the Warren campaign on Saturday.\n\nWarren has long touted her support of unions and recently won the endorsement of the Working Families Party, which went to Sanders in 2016.\n\nThis tentative agreement also comes on the heels of her picketing with UAW workers in a Detroit strike that's still ongoing. She's poised to head to the SEIU Unions for All Summit next week.\n\nAbout a week ago, Sanders' national press secretary criticized the length of the Warren campaign's negotiation process.\n\n\"Under Bernie’s workplace democracy act, Warren’s campaign would be subject to compulsory mediation for failure to reach a collective bargaining agreement. There is only one campaign that has put its money where its mouth is [with respect to] organized labor. #Bernie2020,\" Sanders' National Press Secretary Briahna Joy Gray tweeted last week.\n\nSanders' campaign began negotiating in March and landed on an agreement in May, which is a month shorter than Warren’s campaign took to reach an agreement.\n\nABC News' William Mansell contributed to this report.", "description": "They're going to hold a ratification vote next week.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/warren-02-as-gty-190928_hpMain_16x9_992.jpg", "published_at": "2019-09-28"}