{"pub": "yahoo", "url": "https://news.yahoo.com/minority-small-businesses-faring-worse-than-white-counterparts-study-100056404.html", "downloaded_at": "2019-10-02 12:51:42.514032+00:00", "published_at": "2019-10-01", "title": "JPMorgan study: Minority small businesses fare worse than white counterparts", "language": "en", "text": "Small businesses located in black and Hispanic communities are less profitable, and have less liquidity than comparable establishments in white neighborhoods, according to a new report from the JPMorgan Chase Institute.\n\nReleased on Monday, the study examined roughly 1.4 million small businesses located in major cities like New York, Houston, and San Francisco. The research crunched the numbers of businesses over the course of 2013 to 2018.\n\nDespite all the hurdles that small businesses face, over two-thirds were actually profitable, the data found. However, roughly a third of small businesses were unprofitable and 47% had two weeks or less of cash liquidity.\n\nChris Wheat, the study’s author and the institute’s director of research, told Yahoo Finance that it was surprising that so many small businesses had managed to achieve profitability — especially with “relatively small” cash buffers. What’s more, he said, liquidity figures are “consistently low.”\n\n“Holding low levels of cash or having uncertain cash flows can be correlated with exit or low revenue growth,” Wheat explained.\n\nPeople are shown inside the West Harlem Deli, Sunday, Oct. 28, 2018, in New York. (AP Photo/Julie Walker) More\n\nWhile 29% of all small businesses examined were unprofitable, businesses located in majority black or Hispanic communities didn’t fare as well as their counterparts in majority white communities.\n\n“In over 88 percent of majority black or Hispanic communities, the median profit margin is 15 percent or less,” the research found. “Only 35 percent of majority White communities have median profit margins below this threshold.”\n\nIn addition to lower profitability, small businesses in minority communities also didn’t have as large cash buffers as those in white neighborhoods.\n\nCash struggles with no clear explanation\n\nThe JPMorgan Chase study showed that within 94% of black neighborhoods and 89% of Hispanic ones, small businesses had less than 14 days of cash liquidity. In contrast, only 35% of white communities had establishments with such limited cash.\n\nWheat said the reasons why aren’t clear. However, he underscored minority business owners have the same “exit” rates as those in white neighborhoods, meaning they close at the same frequency as small businesses with fewer financial challenges.\n\nThe analyst pointed out that female-owned small businesses also have similar struggles with cash and growth, “but their exit rates were similar with men. We don’t have a full explanation to how they’re doing it.”\n\nThe issue is important, given the growing fears of a slowdown, and recent figures that suggest small business optimism is waning. Given the importance of independent businesses for the local economy, the struggles of minority establishments could have far-reaching effects.\n\n“A lot of small businesses hire locally,” Wheat explained. And small businesses also spend locally, which contributes to local economies. But how to improve the financial health of small businesses that might be struggling?\n\nWheat told Yahoo Finance that there are a few initiatives and policies that could be helpful, such as financial literacy education and targeted programs that aim to provide capital to businesses located in majority black and Hispanic communities.\n\nDespite the lower profitability of these small businesses, they have made gains alongside an economy that has been expanding for just over a decade.\n\n“Looking across the time period, we saw profit margin tick up and cash buffers also tick up,” Wheat said. This was applicable across the board, though Wheat said there was consistency among the communities.\n\n“The communities that had relatively low profits stayed relatively low, and the communities that had relatively high profits stayed relatively high,” he added.\n\nKristin Myers is a reporter at Yahoo Finance. Follow her on Twitter.\n\nRead more:\n\nRead the latest financial and business news from Yahoo Finance\n\n\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit.", "description": "Small businesses in minority communities aren't as profitable as ones in white neighborhoods, new research has found.", "authors": ["Kristin Myers"], "top_image": "https://s.yimg.com/uu/api/res/1.2/iEfI8SKs4tP9S.tqHATMtA--~B/aD0zODAwO3c9NTcwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/8879be90-e3d5-11e9-b5fe-121946ed7519"}