{"pub": "vice", "url": "https://vice.com/en_us/article/mvkbx4/thomas-grant-british-porn-set-behind-the-scenes", "downloaded_at": "2019-10-19 11:00:01.156401+00:00", "title": "NSFW Photos from the Four Years I Spent on a Porn Set", "language": "en", "text": "This article originally appeared on VICE UK.\n\nThe British porn industry is a little maligned. What we produce here isn't as flashy as the American studios' output. The male stars tend to be quite ropey-looking middle-aged men. It's alarming when you hear those men talk about someone's \"arse\" and not their \"ass,\" because they sound just like your dad. But there's still a kind of drab beauty to it all, compared to the polish of the big US companies—the familiarity of it, the budget approach to high concept.\n\nSouth African photographer Thomas Grant set out to capture that beauty when he was given a job as a porn set photographer. Starting in 2010 in a huge studio just outside London, he spent four years on the job and—alongside the conventional glamour photos and \"pop shots\"—compiled a collection of more tasteful, behind-the-scenes pictures.\n\nI spoke to him over the phone about those photos, and what his time in the industry taught him.\n\nVICE: What's going on in that first photo?\n\nThomas Grant: That was a scene with different kinds of cakes and food and chocolate mousse. It's my favorite photo of them all, because you can't really make sense of it.\n\nIt's the first one in the selection you sent me—is the carnage of it supposed to be a statement of some sort? It's quite different to the other photos in the project, which are all very light and clean.\n\nThere was something in the aftermath—the absolute grotesqueness of it all visually—that I had to get. The fact that it's the aftermath of a porn set makes it even more intriguing; I love the fact that you don't know what's going on. People think it's shit. People think it's blood. But ultimately, as a piece of \"art,\" it makes sense.\n\nIt's interesting—a lot of the photos look kind of like still lifes, like arranged inanimate objects. But presumably there's only so much setting up you can do while taking photos in the middle of a porn shoot.\n\nI mean, none of those shots were deliberately set up. I'm not a porn photographer—I'd never classify myself as that—and it's difficult to see the beauty on a porn set, so being there for four years, every single day, five days a week, I ended up shooting whatever was around me to keep myself sane. But it was also my intention from the start to use the job to document the behind-the-scenes side of the porn industry.\n\nHow did you get the job?\n\nI applied for an advertised position in the adult industry, not knowing how big it would be, and got offered the job. It involved taking stills of every single model in every single scene, taking shots of them individually on set—which then got sold as glamour images—and then doing the stills of them actually fucking, which go on websites and DVD covers and all that.\n\nWhat was your first day like? Watching other people have sex for the first time must take a bit of getting used to.\n\nInitially, it's a complete mind fuck. But after a couple of days, you realize it's not people having real sex; it's people coming in to do their jobs. But the first day I was there was really, really daunting. I felt really uncomfortable directing a girl who wasn't uncomfortable being directed.\n\nWhy?\n\nYou initially assume you can push your limits to whatever fantasy you have, but the fact is, the girl is there to do whatever she's told to do, so the fantasy is not relevant because it's her job, and it's your job. It's a subject to be photographed and filmed in the best possible way. I've often said, there's a lot more sexuality in shooting fashion than there is in shooting porn. Porn is what it is. I often get asked, especially by guys, \"Do you ever get the need to just get in there?\" But it's like, \"No, dude.\" At the end of the day, it's a lens and a camera. You're there [to take photos], and you have to do your best to get the best out of the people you're working with.\n\nWhat did the job do to your perception of the human body, seeing it naked and up close all the time? Does it desensitize you to it at all?\n\nNo. I mean, it doesn't impact what you see outside of work, but it is what it is on set. The one thing I could never stomach, though, was the cum shot.\n\nWhy's that?\n\nI don't know—it's just one thing I could never, ever handle. When I first started working there, I had to go in to shoot the pop, and I would literally start gagging. Some of the girls—especially some of the more professional ones—do all sorts of weird shit with it, gargling with it or blowing bubbles with it. And I just couldn't get used to it. Some of the girls started noticing—they knew it freaked me out—so some of them, as soon as the scene was done, would run up to me and try to hug me or kiss me.\n\nGet you really involved, right up in it.\n\nExactly.\n\nDo you feel like you got an insight into Britain's sexual quirks while you were working there? Was there a change in the type of porn being filmed at all?\n\nYou know, I can't say there was. The specific studio that I shot for was controlled solely by the person who owned it, and there was never an incentive for us to shoot what sold, which is really bizarre, because we shot the most porn in Europe at the time. The funny thing is, the majority of the stuff we shot would never be sold because it wouldn't adhere to all the regulations.\n\nOnline regulations?\n\nOFCOM.\n\nAh, OK. Did you see the economy of porn change while you were working there? I can't really work out why people are still paying for porn when there's so much free stuff online.\n\nTotally. Every day we went to work we assumed, This could be the last.\n\nWhat surprised you about working in porn?\n\nThere are probably a million things. One of the most obvious things is that I never, ever saw a girl have an orgasm—it's all obviously really, really good acting. And if you ever see a cum shot in a still, then it's probably a mixture of soap and lube.\n\nWhat's your fondest memory of it?\n\nThere's quite a funny story of a girl I used to work with. She's a really, really cool girl, from up north. She's the kind of girl who does porn, and her dad knows about it, and he's fine with it. It was always the most fun working with her because she had no issues—she just got on with it. I was doing a shoot with her one day, on a pool table, and right at the end I said, as a joke, \"OK, so now what you need to do is take the red ball and shove it up your pussy.\" And she's like, \"OK!\" I said: \"No! No! No! I'm joking, I'm joking!\" But then she actually shoved the ball up her vagina and couldn't get it out. So we went into the shower in the green room area, and she was bouncing around, trying to get the ball out. My boss arrived—he was in the scene—and I was totally freaking out. I thought, We're going to need to take this girl to [the hospital] to get a fucking pool ball out of her, and my boss is going to notice, and he's very, very prompt and likes shit to run smoothly, and he's going to fire me. But eventually, one of the other models came in and literally dug it out of her with a load of lube.\n\nWow. Why did you leave?\n\nWell, the whole thing kind of fell apart at the end. The owner decided to venture into other things, and the other things didn't work.\n\nDo you ever miss it?\n\nI miss getting paid.\n\nWhat do you do now?\n\nWell, I freelance. A lot of the jobs I do now are corporate—from one extreme to the other. And I can tell you, there's a lot more fucking in the corporate industry than there is in porn.\n\nFollow Jamie Clifton on Twitter.\n\nSee more photos from Schwarz's project below:", "description": "We had a chat with Thomas Grant about the ins and outs of taking photos on a porn set, and found out what surprised him most about the industry.", "authors": [], "top_image": "https://images.vice.com/vice/images/articles/meta/2016/12/07/thomas-grant-british-porn-set-behind-the-scenes-1481137311.jpg?crop=1xw:0.8458646616541353xh;center,center&resize=1200:*", "published_at": "2016-05-12"}