{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/holly-willoughby-melts-morning-viewers-20757333", "downloaded_at": "2019-10-30 23:19:26.186204+00:00", "title": "Holly Willoughby melts This Morning viewers' hearts as she snuggles cuddly pooch", "language": "en", "text": "(Image: Copyright (c) 2019 Shutterstock. No use without permission.)\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHolly Willoughby surprised viewers on Wednesday's episode of This Morning as she snuggled a cuddly puppy on live TV.\n\nThe Wizard of Pawz finalists appeared on the show as the This Morning hosts searched for the next Toto - who was starred beside Judy Garland as her beloved dog when she played Dorothy on The Wizard of Oz.\n\nThe winning dog was crowned with the title of Toto in today's final.\n\nHolly, 38, sent the nation into meltdown with the tiny Pomeranian pup named Peewee.\n\nAs Peewee was introduced onto the show, Phillip, 57, laughed: \"He's a little startled isn't he?\" as the little bear-like dog appeared to hold a straight expression.\n\nPeewee is turning six next month, and has been selected as a wild card for the final.\n\nSpeaking to owner Maria, Holly asked: \"Is he pleased to be back in the competition?\"\n\n\"I think so yeah. He's got plenty of treats,\" Maria replied as the Pomeranian made waving movements which enlightened the hosting duo.\n\nThere were three finalists including Poppi, Tony and Mikey.\n\n(Image: Ken McKay/ITV/REX)\n\n(Image: Ken McKay/ITV/REX)\n\nAnd a judging panel waited for the dogs to strut their stuff down the mock yellow brick road.\n\nLove Island's Kem Cetinay, 23, presented the dogs as they stepped onto the road where they had to perform tricks for the judges and of course, Holly and Phil.\n\nHolly couldn't help herself and asked: \"Can I snuggle Peewee?\" before collecting him from Maria.\n\n(Image: Ken McKay/ITV/REX)\n\n(Image: Ken McKay/ITV/REX)\n\nAlthough Peewee was cute, he didn't quite catch the eye of the judges, as Mikey won the competition and was crowned Toto.\n\nViewers were left shocked by the winner as many of them fell for the gorgeous Pomeranian.\n\n(Image: Ken McKay/ITV/REX)\n\n(Image: Ken McKay/ITV/REX)\n\n\"Good choice but peewee GORGEOUS!!!!!!!!!!\" one posted on Twitter after the winner was announced.\n\nAnother commented: \"Peewee is absolutely hopeless. But how can you resist that little face\"\n\nWhile a third joked: \"#toto I want that Pomeranian\".", "description": "This Morning presenter Holly Willoughby, 38, got to cuddle some adorable pups during the Wizard of Pawz final", "authors": ["Brogan-Leigh Hurst", "Image", "Copyright", "C", "Shutterstock. No Use Without Permission.", "Ken Mckay Itv Rex"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20757694.ece/ALTERNATES/s1200/0_This-Morning-TV-show-London-UK-30-Oct-2019.jpg", "published_at": "2019-10-30"}