{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Family/moms-genius-snack-hack-turns-kids-healthy-eaters/story?id=65953547", "downloaded_at": "2019-10-01 00:11:20.707030+00:00", "title": "This Mom's genius snack hack turns kids into healthy eaters", "language": "en", "text": "You know those life hacks that are so simple, so genius that when you see them you can't believe you didn't think of them yourself?\n\nInterested in Parenting? Add Parenting as an interest to stay up to date on the latest Parenting news, video, and analysis from ABC News. Add Interest\n\nSarah Hornung's snack hack is exactly that.\n\nThe Buffalo, New York, school administrator and woman behind The Eager Teacher online education platform, told \"Good Morning America\" that she is \"shocked at how viral\" her recent post about kids' snack hacking went.\n\nThe post been shared on Facebook 114,000 times. The hack? Sunday self-serve fresh food organized into dollar store containers.\n\nHer method is simple. \"Sunday self-serve is ready for the week. After grocery shopping I always wash and prep all of the food that is considered self-serve in our house. Self-serve for my kiddos means help yourself without asking and it’s always an okay snack (any time of day, bedtime snacks, etc.) It also helps me when I’m packing lunches and snacks, or as a side dish when dinner doesn’t include something they will definitely eat or if we have a busy/late night. There’s something about having things truly ready to grab that makes kids eat it. I could leave the baby carrots in a bag or leave the grapes on the stems but they wouldn’t eat it,\" Hornung wrote in her post.\n\n\"P.S., for the fruits and veggies I do put covers on the containers so they don’t get gross,\" she also wrote.\n\n\"I've posted myself prepping the self-serve snacks on my Instagram stories periodically and always got a ton of questions about it, lots of parents wanting to know how I used it and how it served my family. I decided to give it a permanent post so people had a place to come back to and see it,\" she said.\n\nShe thinks the post is so popular because it touches upon a common struggle among parents.\n\nSarah Hornung / The Eager Teacher\n\n\"Everyone can relate to throwing out untouched produce at the end of the week and most parents find themselves in some kind of negotiation with kids over food on the regular,\" she said.\n\nPlus, anything that's going to make lives easier is going to strike a chord.\n\n\"It's not an expensive or complicated 'hack,' all you need is some old quart containers and your normal grocery haul,\" she told \"GMA.\"\n\n\"I have seen a lot of pictures of fridges and pantries on Instagram and Pinterest that are picture-perfect and filled with expensive, specialty items. I think my post appealed to the masses because it looks like most people's fridges -- just organized into containers I bought at a dollar store. I think it's something that regardless of how old your kids are, what they like to eat or how much money you make, it is a doable idea.\"\n\nHornung said while the reaction to her post is primarily positive, there were some detractors. She wants to set the record straight.\n\n\"I think that the criticism comes from people not recognizing that what works for some won't work for everyone, or people immediately assuming because my fridge went viral must mean my kids are perfect angels who only eat healthy foods,\" she said. \"That is simply not true.\"", "description": "This is one simple snack hack.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/190930snackhackviral_hpMain_16x9_992.jpg", "published_at": "2019-09-30"}