{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/renfrew-nipissing-pembroke-federal-election-2019-1.5267824", "downloaded_at": "2019-10-19 16:17:25.054072+00:00", "title": "Voters have been loyal in Renfrew–Nipissing–Pembroke | CBC News", "language": "en", "text": "Voters west of Ottawa have seen this 40-year-old seat change hands only once.\n\nRenfrew–Nipissing–Pembroke was created in 1979 and remained Liberal until 2000, when Cheryl Gallant won it for the Canadian Alliance.\n\nShe's held it ever since, running as a Conservative since the merger.\n\nFellow opposition MP Scott Reid is the only other local in the House to have held a seat that long.\n\nGallant takes on:\n\nBusinessman and hobby farm owner David Ainsworth of the People's Party;\n\nRobert Cherrin of the Veterans Coalition Party;\n\nIndependent Dan Criger, who founded a chain of convenience stores in the area;\n\nIndependent Jonathan Davis;\n\nTeacher Eileen Jones-Whyte of the NDP;\n\nLibertarian Stefan Klietsch;\n\nIndependent Dheerendra Kumar, a physiotherapist who came to Canada from India in 2009;\n\nRuben Marini of the Liberals, who has worked with Atomic Energy of Canada;\n\nIan Pineau of the Greens, a professor in Algonquin College's adventure tourism program in Pembroke, Ont.\n\nCandidates are included in this riding profile once they've been listed as a confirmed candidate by Elections Canada, chosen as the winner of a nomination contest or who were the chosen candidate by a party that got at least one per cent of the national popular vote in 2015.\n\nRenfrew–Nipissing–Pembroke in 2015\n\nCandidate questionnaires\n\nCBC Ottawa sent every candidate running in eastern Ontario or western Quebec seven questions via their party or a publicly available email address.\n\nThey were asked to stick to 25 to 100 word answers, depending on the questions.\n\nTheir answers have not been edited by CBC.\n\nDan Criger\n\nCheryl Gallant\n\nEileen Jones-Whyte\n\nDheerendra Kumar\n\nIan Pineau", "description": "Voters west of Ottawa have seen this 40-year-old seat change hands only once.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5303954.1569934791!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/renfrew-nipissing-pembroke.jpg", "published_at": "2019-09-11"}