{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nhl/2019/10/12/nelson-score-in-shootout-islanders-beat-panthers-3-2/40308631", "downloaded_at": "2019-10-13 03:50:20.301475+00:00", "title": "Nelson scores in shootout, Islanders beat Panthers 3-2", "language": "en", "text": "CLOSE\n\nUNIONDALE, N.Y. (AP) — The New York Islanders are slowly rediscovering their disciplined style and beginning to play the way they did when they made it to the second round of playoffs last season.\n\nBrock Nelson scored in the shootout and the Islanders beat the Florida Panthers 3-2 Saturday night to snap a two-game skid.\n\nAnders Lee and Josh Bailey scored in regulation for the Islanders.\n\n\"We didn't focus on the outcome, we just focused on the process and how we have to get back to playing our way,\" Islanders coach Barry Trotz said. \"We didn't have any passengers, it was a team win.\"\n\nSemyon Varlamov, signed to a four-year, $20 million deal in the offseason, stopped 35 shots through overtime and all three Florida attempts in the tiebreaker to pick up his first win with New York.\n\n\"A win tastes great,\" Varlamov said. \"After two losses, we needed this win and I thought everybody played well.\"\n\nEvgenii Dadonov had a goal and an assist, Denis Malgin also scored, and Sam Montembeault stopped 26 shots through overtime in his firs start of the season for Florida. The Panthers lost in a shootout for the second straight game to fall to 1-2-2 through five games.\n\nDadonov tied the score at 2-2 when his wrist shot beat Varlamov with 6:02 left in the third period. Jonathan Huberdeau entered the offensive zone with possession of the puck and crisscrossed with Dadonov to throw off the Islanders' defense.\n\n\"We got to learn to play the way we played in the third period, how we battled back, that needs to be our 60-minute game,\" Panthers captain Aleksander Barkov said.\n\nFlorida opened the scoring at 5:34 of the first period when Malgin hammered a one-timer off a pass from Dadonov for his first of the season.\n\nLee tied it when he recorded his second goal of the season at 5:40 of the second. Lee sent a slap shot from the high slot after Mathew Barzal masterfully manipulated the Panthers' defense behind the net and found an opening to deliver a pass to the Islanders' captain.\n\n\"I know (Barzal) sees me and he knows I am in the slot,\" Lee said when describing his thought process. \"I have to find a lane for him as well, I can't just stand there. I have to be patient and be ready to shoot when it gets to me.\"\n\nBailey gave the Islanders a 2-1 lead with 2:29 left in the middle period when he finished a cross-ice pass from Jordan Eberle, firing a wrist shot past Montembeault's glove.\n\nLate in the third period, Eberle absorbed a hard check from Mike Matheson and did not return. Trotz did not offer an update after the game.\n\nThe Panthers outshot the Islanders 12-9 in the first 20 minutes but failed to capitalize on the power play, squandering three opportunities.\n\n\"In the second period, we got a little cute, started to make stupid plays,\" Barkov said. \"It cost us a couple of goals.\"\n\nNOTES: The Islanders celebrated the 40th anniversary of the 1979-80 championship season and welcomed back alumni from throughout the franchise's history. Clark Gillies, Bobby Nystrom, Denis Potvin, John Tonelli, Bryan Trottier were all in attendance along with several others. ... F Ross Johnston made his season debut for New York, and dropped gloves with Panthers D Josh Brown in the third period. ... Islanders fourth-line C Casey Cizikas missed his second straight game with a lower-body injury. ... New York scratched rookie D Noah Dobson and veteran F Matt Martin. ... Florida's Keith Yandle, the NHL's current \"Iron Man\" streak holder, played in his 802nd consecutive game. ... Panthers scratched F Henrik Borgrstrom and D Mark Pysyk. ... Montembeault, a third-round pick from the 2015 NHL draft, is expected to contribute despite the team signing Sergei Bobrovsky to a seven-year, $70 million contract this summer to solve the team's goaltending woes.\n\nUP NEXT:\n\nPanthers: At New Jersey on Monday.\n\nIslanders: Host St. Louis on Monday.\n\n___\n\nMore AP NHL: https://www.apnews.com/NHL and https://www.twitter.com/AP_Sports\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Brock Nelson scored in the shootout and the New York Islanders beat the Florida Panthers 3-2 Saturday night to snap a two-game skid", "authors": ["Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/e03395a3e4b3acc0b431921b9ae17b6ebf142b56/c=0-220-4228-2598/local/-/media/2019/10/12/USATODAY/usatsports/34d59581355a4ec386827990adee0e8d.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-12"}