{"pub": "news24", "url": "https://parent24.com/Learn/Learning-difficulties/student-responds-and-curro-apologises-for-controversial-high-school-artwork-20191023", "downloaded_at": "2019-10-23 15:07:57.546916+00:00", "title": "Student responds and Curro apologises for controversial high school artwork", "language": "en", "text": "Student responds and Curro apologises for controversial high school artwork\n\nThe school body acknowledges that the content of the artwork was controversial and likely to stir emotive responses.\n\nIn a statement to Parent24 today, representatives of Curro revealed that following an internal investigation, it has been determined that the duty of care and guidance offered to the learner did not always adequately address the underlying issues and potential implications of producing a visual art piece.\n\nThe local learner’s artwork upset Christians on social media when his year-end art submission was interpreted as disrespectful to Christianity.\n\nRead update: Controversial 'demonic' art project at Curro school taken down amid Christian outcry - pastor\n\nIn a video featuring the Grantleigh learner's final art project uploaded to Facebook, a clearly upset parent is filmed denouncing the exhibition. He explains that he loved the school, but that it is a \"disgrace\" and that it \"broke his heart\" that the school allowed it, calling for a protest against the Kwa-Zulu Natal based school.\n\nThe artwork featured is part of a final submission to the Independent Examination Board (IEB) and was displayed in the school foyer as part of a year-end exhibition.\n\nMust read: Curro school responds to protests over ‘satanic’ artwork\n\nThe school body now acknowledges that the content of the artwork was controversial and likely to stir emotive responses.\n\n\"It is also important that art is subjective and open to interpretation; art encourages people to voice an opinion either for or against the work in question,\" the statement adds.\n\nFound to comply\n\nImages include those of a religious nature, but could be considered offensive in that they include sketches of God and Jesus as clowns, torn pages from the Bible used to create papier-mâché demons, and other images that could be understood to represent demonic themes.\n\nCurro says that the IEB confirmed that an independent examiner had examined the exhibition and found it to comply, in every respect with the examination brief and IEB academic standards, and that the exhibition was not reported as problematic to the IEB.\n\nNonetheless, Curro extends an \"unreserved apology to all those community members who have been affected and offended by the artwork in question\", adding that Grantleigh commits to \"upholding and protecting the inalienable rights of every individual with respect to their religious belief, race or ethnicity, gender orientation and will actively include this as part of their ongoing good practice as an institution of learning and to rigorously avoid any action that constitutes incitement to cause harm.\"\n\nBefore anyone speak, they perhaps think\n\nThe matric artist has also responded to the outcry, with a statement explaining the context of the work, and asking that \"before anyone speak, they perhaps think\", adding that \"I cannot damage that which has already been shattered.\"\n\nSee the full statement here:\n\nChat back:\n\nShare your story with us, and we could publish your mail. Anonymous contributions are welcome.", "description": "The school body acknowledges that the content of the artwork was controversial and likely to stir emotive responses.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9509/1d504dd895dd4b8898415b66e21419a1.jpg", "published_at": "2019-10-23"}