{"pub": "yahoo", "url": "https://news.yahoo.com/sanders-health-scare-involved-heart-232327424.html", "downloaded_at": "2019-10-05 00:09:41.818036+00:00", "title": "Sanders health scare involved a heart attack, his doctors say", "language": "en", "text": "By Jason Lange\n\nWASHINGTON, Oct 4 (Reuters) - U.S. presidential candidate Bernie Sanders suffered a heart attack earlier this week, his physicians said on Friday, describing his health scare in more specific terms than previously disclosed.\n\nSanders, 78, abruptly canceled all campaign events on Tuesday after suffering chest pains. He underwent surgery to treat a blocked artery, having two stents inserted to prop open the artery.\n\nWithin hours, his campaign said Sanders was conversing and in good spirits, and on Thursday his wife said he would participate in the fourth Democratic debate on Oct. 15.\n\nBut on Friday after Sanders left the hospital, his treating physicians cast the events in a more serious light.\n\n\"After presenting to an outside facility with chest pain, Sen. Sanders was diagnosed with a myocardial infarction,\" Arturo Marchand Jr. and Arjun Gururaj said in a statement, using a medical term for a heart attack.\n\nThe two doctors said \"all other arteries\" were normal for Sanders, and that he was discharged with instructions to follow up with his personal physician.\n\nTheir statement, circulated by Sanders' campaign, could raise new questions about Sanders' age and health as he seeks his party's nomination to challenge President Donald Trump in the 2020 presidential election. (Reporting by Jason Lange; Editing by Sandra Maler)", "description": "U.S. presidential candidate Bernie Sanders suffered a heart attack earlier this week, his physicians said on Friday, describing his health scare in more specific terms than previously disclosed.  Sanders, 78, abruptly canceled all campaign events on Tuesday after suffering chest pains.  Within hours,", "authors": ["Jason Lange"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-04"}