{"pub": "investing.com", "url": "https://ca.investing.com/news/stock-market-news/motor-racingfia-impounds-renault-components-after-racing-point-protest-1983990", "downloaded_at": "2019-10-13 12:24:45.672125+00:00", "title": "Motor racing-FIA impounds Renault components after Racing Point protest", "language": "en", "text": "© Reuters. Motor racing-FIA impounds Renault components after Racing Point protest\n\nSUZUKA, Japan, Oct 13 (Reuters) - Formula One's governing body moved to seal and impound the steering wheels and electronic control units of Renault's Formula One cars on Sunday after a Japanese Grand Prix protest by rivals Racing Point.\n\nThe International Automobile Federation (FIA) said, after meeting team representatives, that the protest had been ruled admissible and would be heard at a later date.\n\nCanadian-owned Racing Point had protested about an \"alleged pre-set lap distance-dependent brake bias adjustment system\" on the cars raced by Australian Daniel Ricciardo and German Nico Hulkenberg.\n\nThe FIA said a representative of the technical department had been directed to seal and impound the parts in preparation for a detailed analysis of them, as well as analysis of associated hardware, software and data.\n\n\"When the likely submission date of the assessment can be determined, the FIA Technical Department representative will communicate that to the chairman of the stewards so that the next meeting time to assess the claims made in the protest can be scheduled,\" it added.\n\nRenault (PA: ) said in a statement that Racing Point had prepared a 12-page dossier.\n\n\"Renault F1 team intends to use this recess to prepare an equally detailed case to rigorously defend its position,\" said the French manufacturer team.\n\nRenault took a double points haul at Suzuka with Ricciardo sixth and Hulkenberg 10th. Mercedes-powered Racing Point had Sergio Perez ninth and Lance Stroll 11th.\n\nThe French team are fifth overall on 77 points to seventh-placed Racing Point's 54.\n\n(Writing by Alan Baldwin in London, editing by Clare Fallon)", "description": "Motor racing-FIA impounds Renault components after Racing Point protest", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEBA515E_L.jpg", "published_at": "2019-10-13"}