{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/14/WS5da3d228a310cf3e35570456.html", "downloaded_at": "2019-10-14 02:11:18.216429+00:00", "title": "AVIC bullish on new helicopter's potential", "language": "en", "text": "By Zhao Lei in Tianjin | China Daily | Updated: 2019-10-14 09:40\n\nAn AC352 helicopter. [Photo by Liu Yang/For China Daily]\n\nChina's leading aircraft maker expects to sell at least 300 AC352s in 20 years\n\nAviation Industry Corp of China, the nation's leading aircraft maker, is bullish on the market prospects of its AC352 utility helicopter and will develop variants for industrial users, a company executive said.\n\nSun Qingmin, deputy manager of Avicopter, AVIC's helicopter branch, said on Thursday that the company had received initial orders for more than 10 AC352s from domestic clients such as CITIC Offshore Helicopter, a leading Chinese general aviation services provider, and expected to sell at least 300 in China over the next 20 years.\n\n\"Though the airworthiness certification process is still underway, we have been working hard to promote the helicopter in the market, especially to existing users of our products in the government such as the public security and transportation authorities,\" Sun said on the sidelines of the 5th China Helicopter Exposition, which opened in Tianjin on Thursday.\n\n\"We are optimistic about the AC352's market prospects in China because the Ministry of Public Security has plans to set up more than 300 police aviation squadrons across the country in the near future and will consequently need a lot of utility helicopters like our AC352.\"\n\nHe said China also has long coastlines and many offshore industries, and that can lead to solid demand for advanced long-range helicopters such as the AC352 to conduct a variety of operations, including transportation and maritime search and rescue.\n\n\"Many of our targeted clients told us that they urgently need the AC352 and that as soon as its airworthiness certification is done, they will place orders,\" Sun said.\n\nLu Weijian, the AC352's chief designer at Avicopter, said: \"Potential users told me that they are attracted by the helicopter's good economy and low operational and maintenance costs. They said the helicopter will be useful in rescue missions, medical air services, maritime patrols and offshore oil rigs' transport operations.\"\n\nThe AC352, China's first 7-metric-ton-class helicopter, was codeveloped by Avicopter and Airbus Helicopters in 2006. It made its first flight in December 2016 in Harbin, Heilongjiang province.\n\nThe European model-which Airbus Helicopters refers to as the H175-made its maiden flight in December 2009 in France and was certified in January 2014 by the European Aviation Safety Agency. Deliveries to buyers began in December 2014, according to Airbus Helicopters.\n\nHowever, some technical issues had resulted in delays in the Chinese version's test flight and certification process, sources close to the program said.\n\nThe two companies expect to sell about 800 to 1,000 AC352s over the next 20 years, with profits to be split equally.\n\nThe helicopter has a maximum takeoff weight of 7.5 tons, a maximum carrying capacity of 3 tons and a cruising speed of 275 kilometers per hour. It can fly up to 850 km in a single operation, according to Avicopter.\n\nIt said the AC352 is one of the most comfortable and environmentally friendly medium-sized helicopters in the world, adding that, in addition to two pilots, it can transport up to 16 passengers.", "description": "Aviation Industry Corp of China, the nation's leading aircraft maker, is bullish on the market prospects of its AC352 utility helicopter and will develop variants for industrial users, a company executive said.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/14/5da3d228a310cf3e97a111a7.jpeg", "published_at": "2019-10-14"}