{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-politics-johnson/u-s-entrepreneur-arcuri-refuses-to-answer-questions-about-intimacy-with-boris-johnson-idUKKBN1WM0GD", "downloaded_at": "2019-10-07 07:40:20.368209+00:00", "title": "U.S. entrepreneur Arcuri refuses to answer questions about intimacy with Boris Johnson", "language": "en", "text": "LONDON (Reuters) - U.S. businesswoman Jennifer Arcuri on Monday repeatedly refused to answer questions about whether or not she had an intimate relationship with British Prime Minister Boris Johnson when he was mayor of London.\n\nBritain's Prime Minister Boris Johnson leaves Downing Street in London, Britain, October 3, 2019. REUTERS/Henry Nicholls\n\nThe Sunday Times has reported that when Johnson was mayor he failed to declare close personal links to Arcuri who received thousands of pounds in public business funding and places on official trade trips.\n\nSpeaking to ITV, Arcuri said she had bonded with Johnson when he was mayor of London over classical literature and that they discussed French philosopher Voltaire.\n\nBut asked repeatedly about whether she had an affair with Johnson or intimate relations with him, she either sidestepped the question or openly refused to answer.\n\n“I really am not going to answer that question,” Arcuri told ITV. “It’s really categorically no one’s business what private life we had or didn’t have.\n\n“And categorically more important, Boris never ever gave me favouritism, never once did I ask him for a favour, never once did he write a letter of recommendation for me.”\n\nArcuri said that after they first bonded over literature and discussed venture capital for the technology sector, she and Johnson began sending text messages and then he would visit her office at her apartment in London, sometimes on his way home.\n\n“There was plenty of office space for him to come visit,” Arcuri said. He visited around five or perhaps 10 times, she said. “I didn’t think it was awkward at all.”\n\nShe quipped that she once offered Johnson the chance to have a go on her dancing pole but he refused.\n\n“He sat down with his tea and started muttering,” she said.\n\nJohnson has denied there was any impropriety in the relationship.\n\nThe government of London said last month it had referred Johnson to Britain’s police watchdog for potential investigation over allegations of misconduct involving Arcuri.", "description": "U.S. businesswoman Jennifer Arcuri on Monday repeatedly refused to answer questions about whether or not she had an intimate relationship with British Prime Minister Boris Johnson when he was mayor of London.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191007&t=2&i=1437966720&w=1200&r=LYNXMPEF9609V", "published_at": "2019-10-07"}