{"pub": "yahoo", "url": "https://news.yahoo.com/elizabeth-warren-is-talking-down-to-voters-172852032.html", "downloaded_at": "2019-10-19 14:13:45.802990+00:00", "title": "Elizabeth Warren is talking down to voters", "language": "en", "text": "Elizabeth Warren has a plan for everything. She just doesn’t want you to know all the details.\n\nThe Massachusetts senator—now a front-runner in the Democratic presidential race—backs the hugely expensive Medicare for all plan, which would cover every American. But she refuses to acknowledge it would require large tax increases on most voters. Instead, Warren keeps saying “costs will go down” for middle-class families under the plan, as if taxes and costs are the same thing and nobody will figure out the bait-and-switch.\n\nVoters aren’t as dumb as Warren seems to think.\n\nMedicare for all might sound good in theory, but if ever enacted it would be a wrenching transition for millions of Americans. Everybody would have health coverage under a giant government plan. But government spending on health would skyrocket to more than $3 trillion per year, requiring 73% more tax revenue than the government brings in now. And there’s no way to raise that much funding by taxing businesses and the wealthy alone. Nearly everybody would have to pay more.\n\nVermont tried to establish a statewide health plan for all residents a few years ago, and found that it would require a 9.5% hike in state income taxes and an 11.5% payroll tax on employers. Despite broad support for the idea, the governor concluded the new taxes could cause an economic shock, and scrapped the idea. Rand studied the prospect of a statewide health program in New York, and found that it would require a 156% increase in total state tax revenue.\n\nWESTERVILLE, UNITED STATES - 2019/10/15: Protesters shout slogans while holding placards during the democratic debate in support of Elizabeth Warren in Westerville. (Photo by Megan Jelinger/SOPA Images/LightRocket via Getty Images) More\n\nEven Bernie Sanders acknowledges it would take major tax hikes to cover Medicare for all. Sanders would hit up businesses and the wealthy, but he’d also impose a 4% income surtax on households and make other major changes to the tax code.\n\nWarren, who backs the Sanders plan, says only that overall costs on wealthy families would go up, while they’d go down for the middle class. Uh, maybe. Under a single-payer plan, in theory, nobody would pay insurance premiums, co-pays, deductibles or anything for care. So if a typical family paid less in new taxes than it would otherwise pay in health care costs, it would be a net win.\n\nThe Rand study of a theoretical New York single-payer plan found that on the whole, costs would be lower for 90% of the population and higher for the top 10% of earners. A study of Medicare for all costs by Charles Blahous of George Mason University found that while all health care spending would shift to the federal government, total spending on health would drop slightly—with more people having coverage. So health spending per person would decline.\n\nYet this vastly understates the turmoil moving to a single-payer system would cause. “There would be massive disruption in terms of winners and losers,” says Kenneth Thorpe, chairman of the health policy department at Emory University. Some businesses would probably close because the tax hikes would be unaffordable. Since government health plans pay less than private ones, some doctors and hospitals would close up shop. Many people would lose access to the doctors they have now. Wait times would increase.\n\nWarren, a policy impresario, certainly knows all this. Why isn’t she telling voters? Because they can’t handle the truth? If that’s it, then she probably doesn’t want anybody to know gas and heating costs would go up if she got her way and banned fracking. Breaking up Facebook and Google might mean consumers pay for web search and social media services that are now gratis. And free college for some would drive up costs for those who don’t qualify. Details can be a bummer.\n\nRick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.\n\nRead more:\n\nJoe Biden’s health plan looks like the winner\n\nThere aren’t enough doctors for Medicare for all\n\nWhy Trump’s tax returns still matter\n\nMarkets would soar, not sink, if Trump left office\n\n4 problems with Andrew Yang’s free money drop\n\nRead the latest financial and business news from Yahoo Finance\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "Elizabeth Warren doesn't want you to know the gory details of plans like Medicare for all.", "authors": ["Rick Newman", "Senior Columnist"], "top_image": "https://s.yimg.com/uu/api/res/1.2/qstqU1j2aYAuUWL41GTTYg--~B/aD0zMzMzO3c9NTAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/5ddfd6d0-f102-11e9-bba7-c725155df60f", "published_at": "2019-10-17"}