{"pub": "nymag", "url": "https://vulture.com/2019/10/rihanna-new-book-visual-autobiography-phaidon.html", "downloaded_at": "2019-10-07 20:07:30.154486+00:00", "title": "Rihanna Announces New 500-Page Book Through Phaidon Press", "language": "en", "text": "An author! Photo: Phaidon\n\nWhat’s that you say? You want a new Rihanna album? Well, you’ll have to settle for a book right now. The former musician (okay, she last released ANTI in January 2016) and current Fenty businesswoman announced a “stunning visual autobiography,” out this fall through Phaidon Press, called Rihanna. It’s 504 pages with 1,050 pictures, 11 inserts, seven gatefolds and a poster, and much of the material has never been published before. (You know what else hasn’t been published? That reggae album.) If that’s not enough, there are three special editions: The Ultra Luxury Supreme edition comes with a marble pedestal and is already sold out, the Luxury Supreme edition includes a gold-plated tabletop stand and will set you back $5,500, and the Fenty x Phaidon edition (you know she had to) throws in a “This Shit Is Heavy” stand for only $175. (Just want the 15-pound book? That’s a steal at $150.) There will be 10 Ultra Luxury Supreme and 990 Luxury Supreme editions, both of which are signed by Rihanna and artists the Haas Brothers. Yet somehow, none of these deluxe editions comes with new music.\n\n“I am so excited to share this collection of incredible images. I’m very grateful to the talented photographers and artists who contributed. We’ve been working on the book for over five years and I’m really happy to be able to finally share it with everybody,” Rihanna said in a press release. Which raises the question: How long have you been working on those damn albums? At least she won’t keep us waiting on this for too long — the Fenty x Phaidon edition starts shipping this Thursday, October 10.", "description": "The “visual biography,” titled Rihanna, will be a large-format book featuring over 1,000 pictures from the musician’s career.", "authors": ["Justin Curto"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/07/07-rihanna-book-spread-square-1.w1200.h630.jpg", "published_at": "2019-10-07"}