{"pub": "telegraph", "url": "https://telegraph.co.uk/football/2019/10/26/tottenham-continue-slip-slide-liverpool-stroll-another-level", "downloaded_at": "2019-10-27 00:42:16.645376+00:00", "title": "Tottenham continue to slip and slide while Liverpool stroll to another level", "language": "en", "text": "The wider footballing world has never been reluctant to draw comparisons between Tottenham Hotspur and Liverpool. It is easy to see why: two charismatic, personality-driven managers, two high-intensity sides, two teams who have to fight against opponents with far greater resources in order to win titles.\n\nThose similarities were highlighted again at the end of last season, when the Champions League final pitted one project against another in the most high-profile setting in club football. They have been referenced again this season as Liverpool have continued their upward curve, and Tottenham have stagnated, if not declined, during a challenging start to the campaign.\n\nOne of the most compelling pieces of evidence of the lack of change at Tottenham, for example, can be found by looking at Jurgen Klopp’s first game as Liverpool manager in October 2015. Of the Liverpool team who drew 0-0 at White Hart Lane, only James Milner and Adam Lallana remain at the club.\n\nTottenham, by contrast, still have 11 of the 18 members of that matchday squad. There has been a ruthlessness in Liverpool’s player turnover which has been missing, for various reasons including finance, at Tottenham over the past four years. As a result, Liverpool have moved on and gradually improved. Tottenham have hardly changed, and by most measures have become worse.\n\nTheir respective trajectories since the Champions League final – Liverpool winning eight of their first nine Premier League games, Tottenham just three – have only added to the sense that these are two clubs heading in different directions.", "description": "The wider footballing world has never been reluctant to draw comparisons between Tottenham Hotspur and Liverpool.", "authors": ["Sam Dean", "Sam Wallace"], "top_image": "https://www.telegraph.co.uk/content/dam/football/2019/10/26/TELEMMGLPICT000199358089-xlarge_trans_NvBQzQNjv4BqLeUJvOJqnV613e1NxllMSYIixnj0N-lTmS4HQcSqwKA.jpeg?imwidth=1200", "published_at": "2019-10-26"}