{"pub": "japantoday", "url": "https://japantoday.com/category/sports/update-1-motor-racing-verstappen-blames-%27irresponsible%27-leclerc-for-collision", "downloaded_at": "2019-10-14 00:05:10.592344+00:00", "title": "Verstappen blames 'irresponsible' Leclerc for collision", "language": "en", "text": "auto racing\n\nMax Verstappen accused Ferrari rival Charles Leclerc of irresponsible driving at the Japanese Grand Prix on Sunday after a first-lap collision between the two put the Red Bull driver out of the race.\n\nThe 22-year-old Dutch driver also questioned the stewards' response, with an initial announcement that they were taking no further action before they then decided to summon both drivers afterwards.\n\nThe stewards eventually handed Leclerc post-race time penalties totalling 15 seconds for two incidents, dropping him to seventh place from sixth at the checkered flag.\n\nBoth Leclerc and Verstappen also dropped out of mathematical contention for the title with four races remaining, leaving only race winner Valtteri Bottas as a threat to Mercedes team mate and championship leader Lewis Hamilton.\n\n\"Suddenly into Turn Two Charles just drove into the side of my car,\" Verstappen told Sky Sports television. \"From my side I don’t think I could have done anything different there.\n\n\"The weird thing is that initially they don’t even investigate it, I mean my whole car is destroyed. The whole side. There were just holes in the side of the car. And then they start to investigate it but now it’s after the race.\n\n\"I mean, what more should he (Leclerc) do to get a penalty? I like hard racing but I don’t think this was hard racing. This was just irresponsible driving into Turn Two.\"\n\nVerstappen, who was forced off, eventually retired in the pitlane after 15 laps while Leclerc had to pit for a new front wing.\n\nThe Monegasque had started on the front row, with team mate Sebastian Vettel on pole, but both Ferraris made poor starts with Bottas seizing the lead for Mercedes into the first corner.\n\nVerstappen had made a strong start, from the third row, in a home race for Red Bull's engine partner Honda.\n\nThe stewards found Leclerc to be predominantly at fault for the collision, imposing a five-second penalty and two penalty points.\n\nThe other 10 seconds were for continuing to drive with a car in an unsafe condition.\n\nFerrari were also fined 25,000 euros ($27,600.00).\n\nOn the starting grid, Vettel moved slightly before the lights went out and then stopped, escaping punishment because his tyres did not cross the line to trigger a sensor -- a decision Verstappen also questioned.\n\n\"Just watching the footage back from Seb’s start -- I mean, he moves, he stops,\" he said.\n\n\"The rule says you cannot move, and that’s fine because he didn’t gain an advantage they said. I really don’t understand what’s going on today with the rules.\"\n\nLeclerc defended himself and said it was a 'tricky situation'.\n\n\"Obviously I understeered being behind Seb and Lewis and then we touched; I don't know what happened from the full situation from the outside, and this I need to look at,\" he said.\n\n© (c) Copyright Thomson Reuters 2019.", "description": "Max Verstappen accused Ferrari rival Charles Leclerc of irresponsible driving at the Japanese Grand Prix on Sunday after a first-lap collision between the two put the Red Bull driver out of the race. The 22-year-old Dutch driver also questioned the stewards' response, with an initial announcement that they were taking…", "authors": [], "top_image": "https://japantoday.com/images/japan-today-social.jpg", "published_at": "2019-10-13"}