{"pub": "cnbc", "url": "https://cnbc.com/2019/10/14/marc-benioff-capitalism-led-to-horrifying-inequality-must-be-fixed.html", "downloaded_at": "2019-10-14 23:19:08.018852+00:00", "title": "Billionaire Marc Benioff: Capitalism has 'led to horrifying inequality' and must be fixed", "language": "en", "text": "Marc Benioff co-founded cloud software company Salesforce in 1999, and as a result of the company's success, the 55-year-old is worth $6.3 billion, according to Forbes.\n\nBut even as Benioff benefits from capitalism, he criticizes the \"horrifying inequality\" America's economic system has manifested in an op-ed in The New York Times on Monday.\n\n\"Capitalism, I acknowledge, has been good to me,\" Benioff writes. \"But capitalism as it has been practiced in recent decades — with its obsession on maximizing profits for shareholders — has also led to horrifying inequality.\"\n\nThe piece calls for a \"new capitalism,\" which, among other things, would include higher taxes on America's richest, including himself.\n\n\"Nationally, increasing taxes on high-income individuals like myself would help generate the trillions of dollars that we desperately need to improve education and health care and fight climate change,\" he writes.\n\nBenioff also calls on company leaders to be more mindful of their total impact on society.\n\n\"First, business leaders need to embrace a broader vision of their responsibilities by looking beyond shareholder return and also measuring their stakeholder return,\" Benioff says. \"This requires that they focus not only on their shareholders, but also on all of their stakeholders — their employees, customers, communities and the planet.\"\n\n(Not everyone agrees. In response to Benioff's op ed, Anand Giridharadas, author of \"Winners Take All: The Elite Charade of Changing the World,\" tweeted Monday, \"...I don't trust business to behave better voluntarily, any more than I trust cats with mice care,\" adding that he supports raising taxes on the wealthy. \"The best way to get business to behave better is to drastically reduce business's power,\" Giridharadas tweeted.)\n\nIn 2018, 26 people had the same wealth as the 3.8 billion people who make up the poorest half of humanity, according to a January report from Oxfam. Additionally, the wealth of the global population of billionaires increased by $900 billion in the last year alone and the wealth of the poorest fell by 11%, Oxfam says.\n\nIn the United States, the Gini index showed an increased concentration of wealth too. The Gini index is \"a standard economic measure of income inequality,\" according to the United States Census Bureau, in which a score of 0.0 indicates \"perfect equality in income distribution\" and a 1.0 \"indicates total inequality, where one household has all of the income.\" In 2018, the Gini index for the U.S. was 0.485, according to September's American Community Survey. That's up from 0.482 in 2017.\n\nBenioff joins other billionaires who have taken a stand against income inequality.\n\nRay Dalio — who founded Bridgewater Associates out of his two-bedroom apartment in New York City in 1975 and grew it into the largest hedge fund in the world — is currently worth almost $19 billion, according to Forbes.\n\nStill, \"the American dream is lost,\" Dalio told CBS' \"60 Minutes\" in July, and he said that capitalism needs to be reformed.\n\n\"We're at a juncture. We can do it together, or we will do it in conflict, that there will be a conflict between the rich and the poor,\" Dalio said.\n\nWarren Buffett, the third richest person in the world with a fortune worth $82 billion, according to Forbes, does not want to disrupt the productivity of capitalism, which he likens to the \"the goose that lays the golden eggs.\" Instead, Buffett suggests the country ought to better distribute resources (through taxes, for example) to take care of those who don't have enough.\n\n\"The real problem, in my view, is — this has been — the prosperity has been unbelievable for the extremely rich people,\" Buffett said on PBS Newshour in 2017. \"This has been a prosperity that's been disproportionately rewarding to the people on top.\"\n\nAnd Microsoft co-founder Bill Gates, currently the second richest person in the world with more than $105 billion to his name according to Forbes, says capitalism has been effective in generating output, but the wealthiest, like him, ought to be taxed more.\n\n\"As you go about doing this additional collection, of course you want to be progressive. You want the portion that comes from the top 1% or top 20% to be much higher,\" Gates told CNN's Fareed Zakaria in February.\n\nSee also:\n\nHedge fund billionaire Ray Dalio: 'Capitalism basically is not working for the majority of people'\n\nBill Gates: Taxes on rich should be 'much higher' but capitalism still works — here's why\n\nBillionaire Warren Buffett: 'I don't need a tax cut' in a society with so much inequality", "description": "Billionaire Salesforce founder Marc Benioff echos Ray Dalio, Bill Gates and Warren Buffett in criticizing extreme wealth inequality.", "authors": ["Catherine Clifford"], "top_image": "https://image.cnbcfm.com/api/v1/image/105545864-1541081195301gettyimages-961771438.jpeg?v=1571072038", "published_at": "2019-10-14"}