{"pub": "thehill", "url": "https://thehill.com/policy/healthcare/465982-harris-calls-for-more-debate-questions-on-reproductive-rights-people-need", "downloaded_at": "2019-10-16 01:14:44.815516+00:00", "title": "Harris calls for more debate questions on reproductive rights: 'People need to keep their hands off of women's bodies'", "language": "en", "text": "Sen. Kamala Harris Kamala Devi HarrisO'Rourke hits back at Buttigieg over criticism of his gun buyback proposal Warren leads Democratic field by 3 points in new national poll Analysis: Warren and Booker most cyber-aware 2020 candidates MORE (D-Calif.) on Tuesday launched into an impassioned argument for the Democratic debates to include more questions on abortion and reproductive health care, pointing to several states where women's reproductive rights have been curtailed by legislatures.\n\n\"This is the sixth debate we have had in this presidential cycle and not nearly one word, with all of these discussions about health care, on women's access to reproductive health care, which is under full on attack in America today,\" she said during Tuesday's Democratic primary debate in Ohio amid a discussion about health care costs.\n\nRepublican legislatures need to keep their hands off of women's bodies. #DemDebate pic.twitter.com/YVywwyu1vY — Kamala Harris (@KamalaHarris) October 16, 2019\n\nModerators asked a question about abortion in the first Democratic debate in June.\n\nHarris made the remark after being asked to respond to a question about \"Medicare for All,\" an issue that has received significant attention in previous debates.\n\n\"Women are the majority of the population in this country. People need to keep their hands off of women's bodies and let women make the decisions about their own lives,\" she said.\n\n\"That is a significant health care issue in America today,\" she added.\n\nAbortion rights activists, including Planned Parenthood and All Above All, launched a Twitter campaign in recent days urging moderators to #AskAboutAbortion after the issue had been largely ignored in previous debates.\n\nSen. Cory Booker Cory Anthony BookerHillicon Valley: Warren takes on Facebook over political ads | Zuckerberg defends meetings with conservatives | Civil liberties groups sound alarm over online extremism bill O'Rourke hits back at Buttigieg over criticism of his gun buyback proposal Progressives fume at Buttigieg, warn him not to attack Warren at debate MORE (D-N.J.), later responded by saying, \"God bless Kamala, but women should not be the only ones taking up this cause and this fight. It's not just because women are our daughters and our friends and our wives. It's because women are people.\"", "description": "Sen.", "authors": [], "top_image": "https://thehill.com/sites/default/files/harriskamalatwo_10152019getty.jpg", "published_at": "2019-10-16"}