{"pub": "nationalreview", "url": "https://nationalreview.com/magazine/2019/10/14/the-childrens-crusade-2", "downloaded_at": "2019-10-05 05:47:32.138530+00:00", "title": "High School Climate Change Rallies", "language": "en", "text": "Young protesters participate in a rally near the U.S. Capitol as part of the D.C. Climate Strike March in Washington, D.C., September 20, 2019. (Erin Scott/Reuters)\n\nThe New Yorker tweeted out a picture of a youth in Brooklyn attending a recent Climate Nightmare rally and holding a provocative sign: Save a Planet, Kill the Rich.\n\nYou suspect the fellow is lumping two of his pet projects together. He might even be hard pressed to say which he’d like to start first.\n\nAdvertisement\n\nAdvertisement\n\nKilling the rich would not really accomplish much besides giving the activists a sugar rush. Killing everyone but the rich would have a remarkably salutary effect on the environment. How many hamburgers does Bill Gates eat? If everyone perished from Super Ebola Plus, leaving a handful of plutocrats in bunkers eating freeze-dried beef stroganoff for the rest of their days, the plastic-straw problem would be solved in a trice.\n\nOf course, that would be wrong. The Climate Panic Movement is all about saving the children who walked out of school to protest and got a three-day weekend. If you argue with the children, you hate science and want them to die when melting seas push a tsunami of hungry polar bears into Nebraska.\n\nWell. The “deniers” need a manifesto to read to these children. Something along these lines.\n\nAdvertisement\n\nWhereas we’re resigned to having you hector the rest of us for the rest of our lives, we would like one last chance to let you know how we feel.\n\nSure, the climate might be changing. Warmer and wetter sounds better than colder and drier, to be honest. Learning that Arctic melting might be due to an underwater volcano instead of someone in Kansas having ribs for dinner does not strike us as a gobsmacking surprise. We will not give up our air-conditioning as long as China and India pump out as much CO2 as they like. Actually, you can put a period after “air-conditioning.” Actually, you can put a period after “not,” when it comes to giving up the things that make you pout. We do not think your youth confers authority. We think it makes you intellectually malleable and prone to hormonal irrationality. Put it this way: We suspect that many of you may be manipulated by elders who are amused that people in your generation literally put rings in their own noses, as if begging to be led. We are in favor of things green and clean. It’s not as if we Climate Infidels have a spare Earth somewhere, and we will be hopping on board Elon Musk’s ark while you replay the roof scene from the evacuation of the Saigon embassy. We’re just not in favor of switching from the occasional hamburger to a meal of bugs and fungus simply because you think the Amazon has been reduced to the size of a miniature-golf course. Oh, you say you want to save civilization. But we can’t “decarbonize” everything on your timetable without using the power of the state to confiscate and forbid, and after you’re done drawing up all the rules, you’ll need large quantities of armed men to enforce your edicts. Martial law to ensure everyone has a device on his shower that shuts off the water after a minute is not an acceptable definition of civilization. We know you are appalled that we defend hot showers when we have only months to keep the planet from bursting into flames like a butane-soaked tumbleweed. But your manifestos proclaim the fierce urgency of demolishing capitalism, which means subsuming a dynamic, prosperous society under a gray political monoculture with a Jacobin inner-party that runs the AC full-blast during the annual Party Conference. If you don’t understand that, it’s because you’re young, and hence politically and historically illiterate. We are not surprised that some of you insist you won’t have children because the planet is doomed. We remember the people who didn’t have kids because Ronald Reagan was an addled goof who wanted a nuclear war. Before that, people didn’t have kids because the world would be overpopulated — people would be literally shoved into the Atlantic and Pacific Oceans to drown because the North American continent had become a coast-to-coast mass of emaciated people clawing out each other’s eyes over the last crust of bread. We wish you realized the carbon impact of the cloud services that power the Internet and forswore all the things you apparently believe are powered by unicorn exhalations. Even though you say the world is ending, you will go to college and try to find your way in the world. If you were truly, honestly fearful, you wouldn’t worry about college debt any more than someone strolling to the electric chair is concerned about the interest rate on this credit card for which he was just approved. We worry that the worst of you will go into politics, and the rest will vote for them because they care , and then you’ll be shocked when you’re standing in line with a meat-ration coupon. Like, the coupon should be in an app or something?\n\nWe wish you well. We wish you a society so prosperous that you can spend your idle hours berating people who do not shave the cotton off their Q-tips and recycle the paper stem. But we do not wish to take orders from dour children whose Save the Earth poster occupies a space that had pictures of Pokémon two years ago. This may sound like the meanest, worst thing you’ve ever heard, and it’s going to go contrary to everything you believe, and I am truly sorry to break the news, but it needs to be said.\n\nAdvertisement\n\nThe world isn’t going to end.\n\nAdvertisement\n\nI know, I know, that was harsh. We hope you can forgive us.", "description": "We do not wish to take orders from dour children whose Save the Earth poster occupies a space that had pictures of Pokémon two years ago.", "authors": ["James Lileks", "Kyle Smith", "Kevin D. Williamson", "Ramesh Ponnuru", "Veronique De Rugy", "Samuel Hammond", "Preston Cooper", "Carrie Lukas", "Shawn Regan", "Bradley A. Smith"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/09/climate-strike-11.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-05"}