{"pub": "independent", "url": "https://independent.co.uk/life-style/food-and-drink/heston-blumenthal-chef-sue-fat-duck-restaurant-wrist-pain-sharon-anderson-a9170411.html", "downloaded_at": "2019-10-25 16:36:12.164368+00:00", "title": "Chef from Heston Blumenthal restaurant is suing for £200,000 over chronic wrist pain caused by cooking", "language": "en", "text": "A chef is suing Heston Blumenthal’s The Fat Duck restaurant for more than £200,000 after sustaining a chronic wrist injury.\n\nSharon Anderson, a 28-year-old chef from Letterkenny, Co Donegal, Ireland, worked at Blumenthal’s Michelin-star restaurant in Bray, Berkshire from June 2014 until November 2015.\n\nThe pastry chef said she was left with a repetitive strain injury (RSI) in her wrist after being made to make thousands of chocolate playing cards, use tweezers to place 400 sweets into small bags and create hundreds of whisky wine gums as part of her work.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMs Anderson is now suing The Fat Duck Ltd for making her carry out tasks which were “too fast, arduous and repetitive for her”, and which she said led to her suffering from depression and anxiety.\n\nThe restaurant denies being at fault for the chef’s injury, saying that her work was common for the form of patisserie that is practised in other “fine dining restaurants”.\n\nThe documents detailing the extent of Ms Anderson’s injury, which she said has stopped her from working since leaving the restaurant, were lodged with London’s High Court by her lawyers.\n\nThey outlined how Ms Anderson began at The Fat Duck as a commis chef for a six-month period, which involved carrying out high-pressure food preparation tasks that required manual dexterity.\n\nMs Anderson explained that she would spend four hours from 7am placing individually wrapped sweets into cellophane bags, before creating chocolate playing cards from 11.30am until 4pm.\n\nThe chocolate playing cards were made in metal and plastic moulds, which weighed over a kilogram and could create 12 cards at a time. When completed, the moulds would weigh around two kilograms.\n\nMs Anderson said that she aimed to create 180 chocolate playing cards a day.\n\nShape Created with Sketch. Under: Inside Europe's first underwater restaurant Show all 13 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Under: Inside Europe's first underwater restaurant 1/13 Under, Europe's first underwater restaurant, opened on 20 March. AFP/Getty Images 2/13 Located on Norway's southern tip, the unique dining space is submerged in the North Sea. REUTERS 3/13 The dining room is sparsely furnished, dominated by a huge glass window at the back. REUTERS 4/13 The building was designed by Snoehetta, the Norwegian architecture firm behind the September 11 Memorial Museum in New York. AFP/Getty Images 5/13 “The big window exposes the underwater not like an aquarium, it’s the real thing,” said Snoehetta’s founder Kjetil Traedal Thorsen. REUTERS 6/13 The exterior, a sloping wood and concrete cuboid that slants into the ocean, has a modern aesthetic, and is accessible via a steel bridge. REUTERS 7/13 The full 18-course tasting menu with drinks costs up to 3,700 krone (£330) per person. REUTERS 8/13 Some 7,000 diners are already booked in for this bucket list experience. REUTERS 9/13 Designers said the building is built to withstand extreme weather, including “the wave of the century”. AFP/Getty Images 10/13 Under is owned by the two Ubostad brothers who also have a nearby hotel. AFP/Getty Images 11/13 Co-owner Gaute Ubostad said they expect to attract around 12,000 diners each year. AFP/Getty Images 12/13 There’s room for around 40 guests in the underwater dining space. AFP/Getty Images 13/13 Although doors opened on 20 March to friends and family of the owners, paying guests will gain access from April. AFP/Getty Images 1/13 Under, Europe's first underwater restaurant, opened on 20 March. AFP/Getty Images 2/13 Located on Norway's southern tip, the unique dining space is submerged in the North Sea. REUTERS 3/13 The dining room is sparsely furnished, dominated by a huge glass window at the back. REUTERS 4/13 The building was designed by Snoehetta, the Norwegian architecture firm behind the September 11 Memorial Museum in New York. AFP/Getty Images 5/13 “The big window exposes the underwater not like an aquarium, it’s the real thing,” said Snoehetta’s founder Kjetil Traedal Thorsen. REUTERS 6/13 The exterior, a sloping wood and concrete cuboid that slants into the ocean, has a modern aesthetic, and is accessible via a steel bridge. REUTERS 7/13 The full 18-course tasting menu with drinks costs up to 3,700 krone (£330) per person. REUTERS 8/13 Some 7,000 diners are already booked in for this bucket list experience. REUTERS 9/13 Designers said the building is built to withstand extreme weather, including “the wave of the century”. AFP/Getty Images 10/13 Under is owned by the two Ubostad brothers who also have a nearby hotel. AFP/Getty Images 11/13 Co-owner Gaute Ubostad said they expect to attract around 12,000 diners each year. AFP/Getty Images 12/13 There’s room for around 40 guests in the underwater dining space. AFP/Getty Images 13/13 Although doors opened on 20 March to friends and family of the owners, paying guests will gain access from April. AFP/Getty Images\n\n“The process had to be carried out under time pressure as it had to be completed before the chocolate set in each mould,” the chef’s barrister, Charles Robertshaw, said in court papers.\n\nMs Anderson was later tasked with creating around 550 whisky wine gums a day in a two-hour period.\n\nIn January 2015, the chef moved to Melbourne, Australia with The Fat Duck restaurant while its premises in Bray, Berkshire were being refurbished.\n\nShe said that while her work shift continued in a similar format, she felt under pressure to handle even more chocolate moulds, as the chocolate cards would melt at a faster rate in the warmer climate.\n\n“By 23 June 2015, the pain had become significant and on this date she visited a physiotherapist who advised her that the pain was being caused by her long hours and repetitive work,” said Mr Robertshaw.\n\nMedical professionals later discovered that Ms Anderson had suffered a torn ligament in her left wrist, although she no longer feels as much pain in her forearm.\n\nHowever, as detailed in the court documents, the pastry chef still suffers “significant wrist pain” when carrying out daily, manual tasks such as driving and cooking.\n\nWhile Ms Anderson’s lawyers, from Letterkenny, Co Donegal, said The Fat Duck did not permit the chef enough time to rest and “required her to work under time pressure throughout the day”, the restaurant claimed she was given lighter duties when she complained about making chocolate patisserie.\n\nDefence lawyers argued that the work Ms Anderson carried out is standard in the world of haute cuisine, and is not known to trigger “upper limb disorder”.\n\nThe lawyers also stated that the pastry chef filed her claim too late after learning she had a potential claim against the restaurant.\n\nJudge John Leslie, of the High Court, was told more medical tests are needed in order to learn exactly what Ms Anderson’s injury is and to validate her claim.\n\n“In view of her condition, it’s quite difficult for her to find employment,” her solicitor, David Pool, told the court, adding that Ms Anderson “can’t work as a chef at the moment”.\n\nThe case will return to court in 2020.", "description": "A chef is suing Heston Blumenthal’s The Fat Duck restaurant for more than £200,000 after sustaining a chronic wrist injury. Sharon Anderson, a 28-year-old chef from Letterkenny, Co Donegal, Ireland, worked at Blumenthal’s Michelin-star restaurant in Bray, Berkshire from June 2014 until November 2015.", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2015/07/24/21/rexfeatures_1229650c.jpg", "published_at": "2019-10-25"}