{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/bookmakers-slash-odds-mauricio-pochettino-20466524", "downloaded_at": "2019-10-05 23:02:17.981668+00:00", "title": "Bookmakers slash odds on Mauricio Pochettino to be next Premier League manager to be sacked", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nBookmakers Betfair have slashed odds on Mauricio Pochettino being the next Premier League manager to be sacked after a dismal week for Tottenham .\n\nThe Argentine boss has come under increasing pressure at Spurs after some poor results, including a 7-2 drubbing at the hands of Bayern Munich.\n\nHis position at the north London club looked even more precarious after they fell to a 3-0 defeat away to relegation candidates Brighton on Saturday.\n\nPochettino is now the shortest price of any Premier League manager to be the next to leave his post at evens, ahead of Everton's Marco Silva (7/2) and Newcastle's Steve Bruce (5/1).\n\nBetfair's Sam Rosbottom said: “In what has been a horror week for Spurs, today’s drubbing at the hands of Brighton has seen Pochettino become favourite to be next manager out the door with Betfair.\n\n(Image: PA)\n\n\"He’s now Even money to be the first to go, after going 7/2 following the humiliation by Bayern Munich earlier this week and starting the week at 10/1, in what surely has to be one of the worst weeks for the club in a very long time.\n\n\"Brendan Rodgers and Jose Mourinho are the joint 7/2 favourites for next Tottenham manager and we expect lots of interest in this market over the weekend, with Pochettino’s future with the club surely in doubt now.”\n\nMurmurings surrounding Pochettino's future began back in May when he suggested winning the Champions League would be a fitting end to his time at Spurs.\n\nHe was then criticised by some sections of Spurs fans for starting Harry Kane in the final defeat to Liverpool instead of Lucas Moura, who had scored a hat-trick in the previous round.\n\n(Image: Action Images via Reuters)\n\nDuring the summer he made several jibes seemingly aimed at Tottenham owner Daniel Levy over the club's transfer policy and lack of investment, and has since been forced to address rumours of discontent within the Spurs dressing room.\n\nHe said: \"In five-and-a-half years, in every single press conference we're talking about my future.\n\n\"I hope that we're still talking it means we're going to spend five more years at least.\"\n\n(Image: Getty Images)\n\nSpeculation continues to link Pochettino with a move to Real Madrid or Man Utd if the managerial posts become available.\n\nBoth Madrid boss Zinedine Zidane and United's manager Ole Gunnar Solskjaer are under pressure, with the Red Devils boss 5/1 to be the next manager to go.\n\nPochettino's case has not been helped by a gruesome injury to Hugo Lloris in the clash with Brighton which looks like it could keep him out for some time.\n\nSpeaking after the match, Pochettino said: \"Tough moment. Very difficult moment but we need to keep going.\n\n\"To the fans, I feel sorry for them, massive effort to come to support us, that was massive. And now you can't find any word to console them.\n\n\"We are living in a tough moment. We were on the top, we were all together, and now when this type of moment arrives we need to stick and stay all together.\n\n\"It's not easy. I think in five-and-a-half years I think this is the first tough moment we are living. But in terms of qualification and in terms of position in the table this feeling that it's not so good is new for us as players and staff at the club.\n\n\"Now is the moment to be strong. We cannot underestimate the situation but the times are not so good, there's always a possibility to make it strong again.\"\n\nTottenham's first fixtures after the international break are a home clash with Watford , a Champions League tie with Red Star Belgrade, before a trip to league leaders Liverpool.", "description": "The Tottenham boss has endured a torrid week that saw his side thumped by Bayern Munich and lose to Brighton", "authors": ["Darren Wells", "Image", "Pa", "Action Images Via Reuters", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20466493.ece/ALTERNATES/s1200/0_Brighton-and-Hove-Albion-v-Tottenham-Hotspur-Premier-League-AMEX-Stadium.jpg", "published_at": "2019-10-05"}