{"pub": "vice", "url": "https://news.vice.com/en_us/article/9ke84d/mitt-romney-found-his-backbone-and-named-it-pierre-delecto", "downloaded_at": "2019-10-22 13:22:11.489108+00:00", "title": "Mitt Romney Found His Backbone and Named It 'Pierre Delecto'", "language": "en", "text": "Want the best of VICE News straight to your inbox? Sign up here.\n\nMitt Romney admitted with a coy “c’est moi” that he'd been tweeting under the moniker “Pierre Delecto” since 2011.\n\nDelecto barely posts, but when he does, he acts exactly the way you'd expect from the Utah senator. He once went after President Donald Trump’s decision to pull troops out of Syria, liked tweets critical of the president, and made broad statements about principle over party politics.\n\nRomney let it slip that he had an online alter ego to the Atlantic’s McKay Coppins Sunday, but he didn’t reveal the handle. Almost immediately, known Twitter sleuth and journalist Ashley Feinberg took up the case and soon found him: @qaws9876. (She had experience unearthing former FBI Director James Comey’s secret Twitter, after all.)\n\nRomney later confirmed to Coppins that the account was, in fact, his brainchild. But the moniker he chose may not be quite as erudite as the one Comey chose for himself, Reinhold Niebuhr, the theologian that Comey wrote his college thesis about.\n\nShortly after “Delecto” was outed, he set his account to private, then to public again for a few minutes, before finally going private for good (at least as of press time). But from what we know, the account posted in a voice that sounds, well, distinctly like Mitt. He even tweeted about himself once, to clarify to CNN’s Soledad O’Brien that he was, in fact, the “only Republican to hit Trump on the Mueller report, only one to hit Trump on character time and time again.”\n\nRomney told Coppins that he follows 688 people, including “What’s his name, the big redhead from Boston?” (He meant Conan O’Brien.) By the time Feinberg found his account, Delecto had followed 702 people and had just eight followers. And the rest of his followers make perfect sense for Romney — a smattering of political journalists, commentators, politicians, and several members of the Romney family.\n\nBill Kristol, the late John McCain, and Peggy Noonan also made the cut, as did reporters on the Romney beat when the account was created back in 2011, as “Delecto” — erm, Romney — was launching his presidential bid. The account also follows Brett Favre.\n\nDelecto doesn’t follow President Trump. Romney said he tweets too much, and compared his account to one of his nieces, who posts too much on Instagram. “I love her, but it’s like, Ah, it’s too much,” Romney told Coppins.\n\nTurns out that Feinberg found Delecto’s account through Romney’s granddaughter, Allie. She has a manageable number of followers on Twitter, and the Delecto account seemed to be one of the few that followed her and appeared to be actively working to conceal the identity of the person behind it.\n\nThe internet, of course, loved the nickname.\n\nTrump, too, used a fake name, for the sake of self-promotion, back in the 1980s. When he pretended to be his own publisher, Trump went by “John Barron.”\n\n\n\nCover image: Sen. Mitt Romney, R-Utah, speaks to reporters following a roundtable discussion at Intermountain Primary Children's Hospital with officials and health experts to receive an update on anti-vaping efforts Thursday, Oct. 10, 2019, in Salt Lake City.(AP Photo/Rick Bowmer)", "description": "Mitt Romney has been tweeting under the moniker, sometimes about Trump, since 2011.", "authors": [], "top_image": "https://video-images.vice.com/articles/5daddc4fd78dc8000a3df0b3/lede/1571675424544-AP_19283659207434.jpeg?crop=1xw:0.8428xh;0xw,0.0158xh&resize=1200:*", "published_at": "2019-10-21"}