{"pub": "washingtonpost", "url": "https://washingtonpost.com/education/2019/09/04/noose-was-found-hanging-university-illinois-elevator-student-has-been-arrested", "downloaded_at": "2019-09-04 23:48:12.774629+00:00", "published_at": "2019-09-04", "title": "A noose was found hanging in a University of Illinois elevator. A student has been arrested.", "language": "en", "text": "\n\nAndrew Smith (Champaign County Sheriff's Office/AP)\n\nA college student allegedly placed a noose in a residence hall elevator, authorities say. Hate-crime charges followed.\n\nAndrew M. Smith, 19, was arrested Monday night and charged with a felony hate crime and disorderly conduct, a misdemeanor.\n\nResidence hall staff members reported seeing the noose in an elevator in a public part of the building around 1 a.m. Sunday, Illinois Public Media reported. Other students reported finding the noose early Sunday, according to the Chicago Tribune.\n\nA female friend reported Smith to authorities, and the University of Illinois Police Department took Smith into custody, according to the Tribune.\n\nIn a Tuesday arraignment, Champaign County Assistant State’s Attorney Kristin Alferink said Smith found some rope in an elevator over the weekend and tied it into a noose, according to the Tribune.\n\nPreliminary charges may change as court proceedings move forward, the university police said in a statement.\n\n“Our mission at the University Police Department is to maintain a safe and secure environment where our campus community members feel supported and successful,” Craig Stone, the police chief and executive director of public safety, said in a statement. “We do not tolerate incidents that are perceived by others to be a threat to their safety, and we will always respond quickly to identify offenders and hold them accountable for those actions.”\n\nThe investigation is ongoing, police said.\n\nIn a statement, the Illinois Student Government condemned the incident, calling it “blatantly racist and [a] continuation of the tradition of white supremacy and racism at this University.”\n\nThe student governing body called for the immediate expulsion for at least two years of Smith and that of any other students involved, and a public reporting of all racist incidents that are reported to the administration. It also demanded a review of policies around disciplining offenders of “racial hatred, made in conjunction with affected student communities.”\n\nThe university said that the incident has been reported to its Housing Bias Response Team and that it will be shared for review with its Bias Assessment Response Team, according to ABC 7 Chicago.\n\nThis isn’t the first time alleged racist events have happened on the campus. Three swastikas were drawn on three university buildings in 2016. That was also the same year an employee was terminated for flinging a noose on a table in front of a black employee, according to the Chicago Tribune.\n\nNooses have been a symbol of threats and intimidation since the Civil War ended and lynchings became a form of white control over African Americans once slavery was no longer a governing tool, according to the Anti-Defamation League. More than 4,000 racist lynchings occurred in 12 Southern states between 1877 and 1950, according to the Equal Justice Initiative.\n\nRobin Kaler, a university spokeswoman, said the results of the investigation will be the only additional released information, according to Illinois Public Media.\n\nIllinois Gov. J.B. Pritzker (D) also weighed in about what happened on the campus, tweeting: “Hate has no place in Illinois or in its educational institutions, and I’m glad swift action was taken to address this incident.”\n\nSmith pleaded not guilty to the charges and requested a trial by jury, according to court records. Smith’s attorney mentioned that the sophomore math major has a 3.79 grade-point average and enough credits to graduate this year, according to the Tribune.\n\nThe judge set Smith’s bond at $5,000 and scheduled a pretrial conference on Oct. 22.\n\nRead more:\n\nD.C. police investigating possible hate crime after LGBTQ magazine found hanging by noose\n\nNooses, Confederate flags and monkey imagery: 19 black UPS workers say company ‘encouraged\n\nFederal judge awards over $700,000 to former American University student targeted in neo-Nazi ‘troll storm’", "description": "A college student put up a noose in a residence hall elevator. Hate-crime charges followed.", "authors": ["Lateshia Beachum"], "top_image": "https://www.washingtonpost.com/resizer/P6HA6lzCvf4glZ76mDho_MMHG7k=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HSUZ6IGOTMI6TJRABKIWK3L5WY.jpg"}