{"pub": "yahoo", "url": "https://news.yahoo.com/sealed-jeffrey-epstein-court-documents-224949081.html", "downloaded_at": "2019-09-05 00:31:40.537939+00:00", "published_at": "2019-09-04", "title": "Sealed Jeffrey Epstein Court Documents Name at Least 1,000 People. A Judge Must Decide Whether to Release Them", "language": "en", "text": "The names of at least 1,000 people appear in sealed court documents associated with Jeffrey Epstein, a court heard on Wednesday. Whether to make them public is the latest skirmish in a years-long legal battle that continues to play out even after Epstein’s death.\n\nThe revelation came after attorneys for a “John Doe” asked a federal judge in New York not to release the names of people who were not directly involved with the 2015 defamation lawsuit filed by Epstein accuser Virginia Roberts Giuffre against Epstein’s longtime confidante Ghislaine Maxwell.\n\nThe case was settled in 2017, but the details are only just now emerging. A day before Epstein’s death in August, a massive cache of documents from the suit was unsealed––revealing accusations against prominent figures, including former New Mexico Gov. Bill Richardson and former Sen. George Mitchell. Within the files, Giuffre alleged Maxwell acted as Epstein’s “madame” and was “one of the main women” whom Epstein used “to procure under-aged girls for sexual activities.”\n\nRichardson and Mitchell both denied the allegations and said they had never met Giuffre. Maxwell’s attorney did not respond to a call or an email requesting comment, but she has repeatedly denied the allegations in the past, both in public and in court documents.\n\nThis March 28, 2017, file photo, provided by the New York State Sex Offender Registry shows Jeffrey Epstein. Up to 30 women were expected to take a judge up on his invitation to speak at a hearing, Tuesday, Aug. 27, 2019, after financier Epstein killed himself rather than face sex trafficking charges. | AP More\n\nLawyers on behalf of John Doe filed a letter to the court this week asking Judge Loretta Preska to re-consider how the court unseals further documents from the case. The letter said Doe has no knowledge of the contents of the sealed materials and referred to him as a “third party” of the case. But, the letter said, “it is clear that these materials implicate the privacy and reputational interests of many persons other than” Giuffre and Maxwell.\n\nMaxwell and Giuffre’s attorneys, who were both present at the hearing on Wednesday, debated how the court could best review the sealed documents and determine which files should be released, redacted or entirely remain sealed.\n\nMaxwell’s attorney, Jeffrey S. Pagliuca, said that the documents include 29 depositions that could include “dozens,” if not “hundreds,” of names. He said that in attached documents there are “literally hundreds of pages of investigative reports that mention hundreds of people.”\n\nPagliuca also pointed to a piece of evidence he called “an address book,” and said it probably includes 1,000 names.\n\nThere’s no indication that any of the individuals named in the sealed court documents had any knowledge of or any involvement with Epstein’s alleged crimes. Epstein was a famously social person who associated with both former President Bill Clinton and President Donald Trump. In a 2002 New York magazine profile, he said “I invest in people—be it politics or science. It’s what I do.”\n\nThe release of court documents last month resulted in a slew of denials from people named in the papers, including from Clinton and Trump. Neither was accused of wrongdoing in the documents.\n\nNick Akerman, a former federal prosecutor in New York, says that an important factor in the judge’s decision on releasing the court documents will be whether any of the people named in the documents raise privacy concerns. “It’ll be a matter of balancing their privacy against the public right to know what happened,” he says. He predicts that the documents will be released, but some names will be redacted.", "description": "An individual only named \"John Doe\" sent a letter to the court arguing that the documents should remain sealed.", "authors": ["Madeleine Carlisle"], "top_image": "https://s.yimg.com/uu/api/res/1.2/4q38zcbdn41t39oO.dDhlw--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/time_72/c160902d9e43158609e1f99b6948c06d"}