{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1W10RD-OCASP", "downloaded_at": "2019-09-16 09:17:49.820488+00:00", "title": "Loderio's brace pushes Sounders over Red Bulls", "language": "en", "text": "Nicolas Lodeiro scored twice, the last in second-half stoppage time, as the Seattle Sounders defeated the visiting New York Red Bulls 4-2 Sunday.\n\nFILE PHOTO: Sep 7, 2019; Commerce City, CO, USA; Seattle Sounders midfielder Nicolas Lodeiro (10) takes a shot on goal in the second half against the Colorado Rapids at Dick's Sporting Goods Park. Mandatory Credit: Ron Chenoy-USA TODAY Sports\n\nThe Sounders (14-9-7, 49 points), who moved into second place in the Western Conference, broke a 2-2 tie on a New York own goal in the 83rd minute. Jordan Morris also scored for Seattle, which has won three of its past four matches.\n\nAlejandro Romero Gamarra and Aaron Long scored for the Red Bulls (12-13-5, 41 points), who suffered their third consecutive defeat and remained in sixth place in the East, four points clear of the playoff line.\n\nThe Sounders took a 2-0 lead on goals by Morris and Lodeiro in the opening 23 minutes.\n\nBut Long scored in the 27th and Gamarra tied it in the 67th, setting up the wild finish.\n\nSeattle’s go-ahead goal came as substitute Victor Rodriguez took a 15-yard shot from the left wing. The ball deflected off diving New York midfielder Sean Davis’ knee and into the far upper corner of the net, leaving goalkeeper Luis Robles no chance.\n\nLodeiro capped the scoring in the fourth minute of extra time with a 17-yard shot into the lower left corner of the net. Cristian Roldan and Saad Abdul-Salaam got assists.\n\nMorris gave the Sounders a lead in the second minute. A corner kick by Lodeiro was flicked on by Gustav Svensson and found Morris, who was standing about two yards in front of the goal. Morris turned his body slightly and ball deflected off his knee and into the net.\n\nMorris made an athletic play to assist on Lodeiro’s goal. Roldan’s cross from the right wing went through goalmouth, but Morris saved the ball from going out of bounds with a diving header back to Lodeiro at the top of the 6-yard box, from where he stabbed the ball into the net with his left foot.\n\nLong’s goal came on a cross from Michael Murillo, who found Long just inside the penalty spot and he rose over a defender to put a header into the lower left corner of the net past diving Seattle goalkeeper Stefan Frei. Bradley Wright-Phillips also got an assist.\n\nGamarra took a cross from Daniel Royer and blasted a left-footed shot from 15 yards over the head of Frei and just under the crossbar. Marc Rzatkowski was also credited with an assist.\n\n—Field Level Media", "description": "Nicolas Lodeiro scored twice, the last in second-half stoppage time, as the Seattle Sounders defeated the visiting New York Red Bulls 4-2 Sunday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190916&t=2&i=1430377843&w=1200&r=LYNXMPEF8F0HW-OCASP", "published_at": "2019-09-16"}