{"pub": "bbc", "url": "https://bbc.com/news/business-49834705", "downloaded_at": "2019-09-26 05:23:29.260443+00:00", "title": "US and Japan agree initial trade deal focusing on agriculture", "language": "en", "text": "Image copyright Getty Images\n\nThe US and Japan have agreed an initial trade deal that will eliminate or lower tariffs on certain products traded between them.\n\nDuties on some agricultural goods will be removed or lowered, while digital products will also benefit.\n\nUS President Donald Trump said the world's first and third largest economies achieved a \"tremendous\" deal.\n\nThe trade agreement did not mention car tariffs of up to 25%, which were previously threatened by the US.\n\nBut Japanese Prime Minister Shinzo Abe said he had received assurances that no such tariffs would be imposed, according to media reports.\n\nThe US, which had a trade deficit with Japan of $67.6 billion in 2018, has held discussions with Japan throughout the year.\n\nUnder the deal, over 90% of US food and agricultural products going into Japan will either be free of any duty or receive preferential tariff access, according to the Office of the United States Trade Representative (USTR).\n\nJapan will reduce tariffs on products such as fresh and frozen beef and pork, and will immediately eliminate them for certain nuts, fruits and vegetables.\n\nIn return, the US will either remove or lower duties on some $40 million of agricultural imports from Japan, including cut flowers, green tea and soy sauce.\n\nAccording a transcript published by the White House., Mr Abe said there would be a \"very wonderful, positive impact on the global economy\".\n\nThe US and Japan have also agreed on preferential treatment for certain digital products.\n\nThey will prohibit any duties being imposed on digital products such as videos, music and e-books and will ensure data can be freely transferred across borders.\n\nThe US said it looked forward to negotiating a \"comprehensive agreement\" with Japan, according to the USTR statement.\n\nHow about the controversial car tariffs?\n\nThe US had been considering levies on some foreign-made car and car part imports, including from Japan and the European Union, but delayed the decision earlier this year.\n\nThe new deal did not cover car duties- but Mr Abe said he had been reassured by Mr Trump that the US would not impose tariffs on Japanese cars.\n\n\"Between President Trump and I, myself, this has been firmly confirmed that no further, additional tariffs will imposed,\" Reuters quoted him as saying.\n\nThe US has been fighting trade disputes on several fronts over the past year.", "description": "Over 90% of US food and agricultural products sold to Japan will benefit from the new trade deal.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/F60A/production/_108968926_gettyimages-1152483190.jpg", "published_at": "2019-09-26"}