{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/young-man-pinned-against-fence-20551635", "downloaded_at": "2019-10-10 15:24:16.619579+00:00", "title": "Young man pinned against fence then punched and kicked to floor in mass brawl", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nSickening footage has emerged of a man being pinned to a fence and then kicked and punched to the ground during a mass brawl.\n\nThe man was seen huddled in a ball as he attacked by several men while several bystanders watched in horror.\n\nThe clip, captured by an eyewitness who wishes to remain anonymous, shows the attack in Leeds on October 1.\n\nThe footage shows shocked bystanders watching on as a group of men start attacking a man on the street.\n\nThe thugs pin the man to a fence and each take it in turns to strike the man who desperately tries to defend himself.\n\n(Image: Deadline News)\n\n(Image: Deadline News)\n\nA woman is then caught up in the commotion and can be seen screaming in distress before some bystanders come to the man's aid.\n\nThe gang then fled the scene running away in all directions.\n\nA spokesman from West Yorkshire Police said: \"Police were called to reports of an assault on New Briggate, Leeds, at 3.40pm on Tuesday 1 October.\n\n\"Enquiries into the incident remain ongoing and any witnesses are asked to call police on 101 quoting log 1076 of Tuesday 1 October.\"\n\n(Image: Deadline News)\n\nAfter an anonymous witness posted the video to Facebook prompting several furious responses.\n\nKayleigh-ann Fallowfield said: \"What the f***, that was so uncalled for and since when was five + against one fair daft c***.\"\n\nSylwia Jarosz added: \"Time to wake up England.\"\n\nAnn Martin wrote: \"Cowards picking on one man.\"\n\nTamala Dean said: \"Bet the parents of these animals are proper proud. I'd be absolutely mortified if that was [my] child. Hope the poor boy is ok, karma will get them if his parents don't.\"\n\n(Image: Deadline News)\n\nHowever, some have praised the bystander who stepped in to try and help the victim.\n\nKen Bee said: \"That chap who went to help deserves a reward of some kind. Too many folk standing about filming.\n\n\"This chap showing real public spirit. To be applauded!\"\n\nJosh Russell added: \"Well done to the work man and the guy from the shop. Need more people willing to help like this.\"\n\nNicola Dearlove wrote: \"At least the old dude tried to help.\"\n\nVanessa Cook said: \"Big up to the guy that tried to help. Whilst everybody else just got their phones out. S****y world we live in.\"", "description": "Two bystanders are seen trying to break up the attack as other witnesses watch in horror during the attack in Leeds city centre", "authors": ["Cameron Ward", "Image", "Deadline News"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20552198.ece/ALTERNATES/s1200/0_PAY-LEEDS_STREET_BRAWL_DN00.jpg", "published_at": "2019-10-10"}