{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/16/1930830/0/en/Azucar-Discovers-Another-New-Porphyry-Centre.html", "downloaded_at": "2019-10-16 20:42:41.743867+00:00", "title": "Azucar Discovers Another New Porphyry Centre", "language": "en", "text": "Hits 86.50 m of 0.70 g/t Au and 0.42% Cu on the “Primo” Target at the El Cobre Project, Mexico\n\nVANCOUVER, British Columbia, Oct. 16, 2019 (GLOBE NEWSWIRE) -- Azucar Minerals Ltd. (\"Azucar\" or the \"Company\") (TSX-V: AMZ; OTCQX: AXDDF) is pleased to announce a new discovery at the El Cobre porphyry copper-gold project in Veracruz State, Mexico.\n\nThe two holes reported today were designed to test the blind “Primo” target area, which is defined by coincident anomalous gold, copper and molybdenum in soils. The Primo target is located approximately 1km southeast of the Raya Tembrillo target and almost 1 km west of the Porvenir target area in a previously unexplored portion of the large Villa Rica magnetic anomaly.\n\nThis new mineralised intrusive was intersected in both holes including sections of high gold and copper grades in classic porphyry style disseminated and vein controlled chalcopyrite and stockwork veining. The upper hole (EC-19-085) intersected roughly 20 metres of mineralised intrusive, currently interpreted to be the apex of the intrusive body. The steeper hole (EC-19-086) was lost in a clay altered intrusive at 975 metres depth. A section and plans are provided with this news release. Highlights include the following intervals:\n\nHole EC-19-085 PRIMO TARGET, 360 Az, -45 dip\n\nFrom 205.00 to 210.25, 5.25 metres @ 0.60 g/t gold and 0.26% copper\n\nIncluding 205.00 to 205.50, 0.50 metres @ 2.12 g/t gold and 1.61% copper\n\nFrom 393.00 to 401.45, 8.45 metres @ 0.20 g/t gold and 0.29% copper\n\nIncluding 400.70 to 401.45, 0.75 metres @ 0.99 g/t gold and 1.79% copper\n\nHole EC-19-086 PRIMO TARGET, 360 Az, -60 dip\n\nFrom 718.00 to 918.00, 200.00 metres @ 0.40 g/t gold and 0.24% copper\n\nIncluding 831.50 to 918.00, 86.50 metres @ 0.70 g/t gold and 0.42% copper\n\nIncluding 862.40 to 918.00, 55.60 metres @ 0.94 g/t gold and 0.56% copper\n\nIncluding 874.40 to 918.00, 43.60 metres @ 1.04 g/t gold and 0.63% copper\n\nIncluding 878.40 to 892.40, 14.00 metres @ 1.26 g/t gold and 0.76% copper\n\nIncluding 904.40 to 914.40, 10.00 metres @ 1.44 g/t gold and 0.85% copper\n\nJ. Duane Poliquin, Chairman of Azucar commented, “The high potential of the El Cobre project to host large porphyry centres is highlighted again by this new discovery. We look forward to reporting the results of our follow-up drilling as they become available.”\n\nAbout the El Cobre Project\n\nThe El Cobre Project has a total area of approximately 7,000 hectares and is located adjacent to the Gulf of Mexico, about 75 kilometres northwest of the major port city of Veracruz, Mexico in an area of excellent infrastructure. The project is situated 200 metres above sea level with extensive road access and is located less than 10 kilometres from a power plant, highway, gas line and other major infrastructure. Major power lines cross the property area.\n\nThe four copper-gold porphyry zones within the El Cobre Project are known as Norte, Villa Rica, El Porvenir and Encinal, and are defined by distinct Cu-Au soil anomalies, discrete, positive magnetic features and a large IP chargeability anomaly. The largest zone is the Villa Rica Zone which has only seen limited initial exploration drilling. An overview of drilling to date in the various zones is provided below.\n\nNorte Zone: All five holes drilled in the Norte Zone prior to 2016 intersected porphyry-style mineralisation. Hole 08-CBCN-022, one of the deepest holes drilled at Norte in 2008, returned values of 0.14% Cu with 0.19 g/t Au over 259 m and 08-CBCN-19 intersected 41.15 metres averaging 0.42 g/t gold and 0.27% copper to the end of the hole at 187.45 metres. Drilling at the Norte Zone in 2016 and 2017 resulted in the highest grade intersections to date at the El Cobre project, including 114.60 metres grading 1.33 g/t Au and 0.48% Cu (Hole EC-17-018, see press release of April 5, 2017), 80.50 metres grading 1.34 g/t Au and 0.46% Cu (Hole EC-16-012, see press release of October 24, 2016), 70.45 metres grading 2.32 g/t Au and 0.59% Cu (Hole EC-17-026, see press release of July 25, 2017), and 534.90 metres grading 0.90 g/t Au and 0.30% Cu (Hole EC-17-029, see press release of August 15, 2017). Since the Norte Zone discovery, Azucar has been carrying out a systematic drill campaign to define this target. The Norte drillhole database is available on the Company website at www.azucarminerals.com .\n\nVilla Rica Zone: The Villa Rica Zone is a roughly 2.5 kilometre by 1 kilometre area of hydrothermal alteration defined also by a strong north-northwest trending magnetic-chargeability high and associated copper-gold soil geochemical anomalies. Past mapping and sampling defined several areas of exposed porphyry mineralisation within the Villa Rica zone, including the Raya Tembrillo target and the Naranjo target, both at the north end of the Villa Rica zone. Initial drilling in 2017 on the Raya Tembrillo target intersected two styles of mineralisation; hypogene copper-gold porphyry mineralisation (115.00 metres of 0.57 g/t gold and 0.27% copper, see press release of November 28, 2017) and near surface exotic enriched copper mineralisation with an apparent tabular distribution (94.00 metres of 1.36% copper; see press release of December 13, 2017). Today’s press release highlights the discovery at the Primo target area, approximately 1km from Raya Tembrillo.\n\nEl Porvenir Zone : Drilling has demonstrated that the system persists at least to 400 m depth. Significant copper and gold grades were intersected such as 0.16% Cu and 0.39 g/t Au over 290 m in hole DDH04CB1. In addition, hole EC-13-004 intersected 0.23% Cu and 0.36 g/t Au over 106 m, to a depth of 504 m, again indicating potentially significant mineralisation at depth. Results from minimal drilling in 2017 include hole EC-17-040 which intersected 108.00 metres grading 0.88 g/t Au and 0.29% Cu, and hole EC-17-044 which intersected 40.25 metres grading 0.50 g/t Au and 0.25% Cu.\n\nEncinal Zone: Hole CB5 intersected a highly altered breccia pipe containing fragments of stockwork veining and porphyry mineralisation across which 18.28 metres returned 1.42 g/t Au and 0.10% Cu. The breccia pipe occurs in a large alteration zone, IP chargeability high and magnetics low which has not been tested to depth. On June 19, 2017 Azucar announced that a new area of exposed stockwork quartz veining and gold mineralisation had been identified in the Encinal Zone. On June 29, 2017 Azucar announced the results of initial drilling on this exposed stockwork (Hole EC-17-025) which returned results including 34.47 metres grading 0.73 g/t Au and 0.20% Cu.\n\nMore information on El Cobre is available on the Azucar website at http://www.azucarminerals.com .\n\nMr. Norm Dircks, P.Geo., is a Qualified Person as defined by National Instrument 43-101 (\"NI 43-101\") and has reviewed and approved the contents of this news release. The porphyry mineralisation reported in this news release is associated with broad areas of alteration and stockwork veining. True widths cannot be determined at this time. The analyses reported were carried out at ALS Chemex Laboratories of North Vancouver using industry standard analytical techniques. For gold, samples are first analysed by fire assay and atomic absorption spectroscopy (“AAS”). Samples that return values greater than 10 g/t gold using this technique are then re-analysed by fire assay but with a gravimetric finish. For copper, samples are first analysed by Inductively Coupled Plasma – Atomic Emission Spectroscopy (“ICP-AES”), with four acid digestion. Samples that return values greater than 10000 g/t copper using this technique are then re-analysed by HF-HNO3-HCLO4 digestion with HCL leach and ICP-AES finish. Blanks, field duplicates and certified standards were inserted into the sample stream as part of Azucar’s quality assurance and control program which complies with National Instrument 43-101 requirements. A NI 43-101 compliant technical report on the El Cobre project entitled, \"Technical Report on the El Cobre Property” was filed in May 2015 and can be obtained from www.sedar.com.\n\nAbout Azucar\n\nAzucar is an exploration company with a mandate to thoroughly explore the El Cobre project in Veracruz, Mexico, which covers multiple gold-rich porphyry targets, as demonstrated by recent drilling. Azucar is permitted and funded for an active drill campaign in 2019. Azucar holds a 100% interest in the El Cobre project, subject to net smelter returns (“NSR”) royalty interests, assuming production from the property exceeds 10,001 tonnes per day of ore, totaling 2.25% which can be reduced to 2.0% though the payment of US$3.0 million.\n\nOn behalf of the Board of Directors,\n\n“Morgan Poliquin”\n\nMorgan J. Poliquin, Ph.D., P.Eng.\n\nPresident, CEO and Director\n\nAzucar Minerals Ltd.\n\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nThis news release includes forward-looking statements that are subject to risks and uncertainties. All statements within it, other than statements of historical fact, are to be considered forward looking. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include market prices, exploitation and exploration successes, continued availability of capital and financing, and general economic, market or business conditions. There can be no assurances that such statements will prove accurate and, therefore, readers are advised to rely on their own evaluation of such uncertainties. We do not assume any obligation to update any forward-looking statements, other than as required pursuant to applicable securities laws.\n\nContact Information:\n\nAzucar Minerals Ltd.\n\nTel. 604.689.7644\n\nEmail: info@azucarminerals.com\n\nhttp://www.azucarminerals.com/\n\nPhotos accompanying this announcement are available at\n\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/057e9013-e9db-45bf-8d3e-d6493317d4e0\n\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/659417e1-bad1-4db8-bbe7-b059ffbcd06b\n\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/e75cb285-4883-43f7-980e-dfed1238924c", "description": "", "authors": ["Azucar Minerals Ltd."], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/545192?filename=545192.jpg&size=1", "published_at": "2019-10-16"}