{"pub": "fox", "url": "https://foxnews.com/us/missouri-man-accused-of-murdering-wisconsin-brothers-on-cattle-business-trip", "downloaded_at": "2019-10-25 22:11:46.495682+00:00", "title": "Missouri man accused of murdering Wisconsin brothers on cattle business trip", "language": "en", "text": "A Missouri cattle farmer is now facing murder charges in the death of two brothers who owned a Wisconsin livestock business and disappeared in July.\n\nGarland “Joey” Nelson, 25, of Braymer, Mo., faces the death penalty after being charged Wednesday in Caldwell County, Mo., authorities said.\n\nThey said Nelson, who served a prison sentence in a cattle fraud case, used a rifle to kill Nick Diemel, 35, and Justin Diemel, 24, owners of Diemel Livestock.\n\nWISCONSIN BROTHERS ON CATTLE BUSINESS TRIP FEARED DEAD AFTER VISITING FARM, MISSOURI MAN ARRESTED\n\nThe probable cause statement says that after killing the brothers Nelson burned their bodies and dumped the remains on a manure pile on his property, the Associated Press reported.\n\nA judge Thursday ordered Nelson to appear in court for a hearing on Nov. 14, WBAY-TV reported.\n\nNelson has been in jail since admitting ditching the brothers’ rental pickup in another Missouri county, according to reports.\n\nHUMAN REMAINS FOUND ON MISSOURI FARM WHERE BROTHERS WERE LAST SEEN, POLICE SAY\n\nHe was arrested after the Diemels were reported missing on a trip to his farm and authorities began investigating.\n\nThe Diemels kept cattle with Nelson, who owed them $250,000, according to the probable cause statement.\n\nRob Chubb, who worked for the brothers, said he believes Nelson lured them to his property with a promise of repaying his debt but with the intention of killing them, the AP reported.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“This monster will rot in hell for what he has done,” Justin Diemel’s wife, Lisa, said on Facebook Thursday.", "description": "A Missouri cattle farmer is now facing murder charges in the death of two brothers who owned a Wisconsin livestock business and disappeared in July.", "authors": ["Robert Gearty"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/07/garland-nelson.jpg", "published_at": "2019-10-25"}