{"pub": "independent", "url": "https://independent.co.uk/sport/football/international/euro-2020-qualifying-standings-group-fixtures-england-italy-spain-holland-france-germany-a9147561.html", "downloaded_at": "2019-10-09 08:27:55.785189+00:00", "title": "Euro 2020 qualifying standings: How every group is shaping up from England to Italy", "language": "en", "text": "Group A\n\nEngland have mounted a perfect start to qualification by scoring 19 goals in their opening four games, and can secure a place at the Euro 2020 with wins over the challenging Czech Republic and a disappointing Bulgaria. Kosovo have been Group A’s surprise package thus far, beating both the Bulgarians and the Czechs in their last two games prior to losing against England. This week’s fixtures could prove pivotal in declining who will be joining Gareth Southgate’s men next summer.\n\nStandings P W D L PTS England 4 4 0 0 12 Czech Rep 5 3 0 2 9 Kosovo 5 2 2 1 8 Montenegro 5 0 2 3 2 Bulgaria 5 0 2 3 2\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nFixtures\n\nFriday: Montenegro v Bulgaria, Czech Republic v England\n\nMonday: Bulgaria v England, Kosovo v Montenegro\n\nGroup B\n\nDespite winning the Nations League, Portugal have been outperformed by Ukraine who have created a five-point gap at the top of the table. However, Portugal can put themselves back on top if they win their game in hand against bottom placed Luxembourg and beat the Ukrainians in their own back yard on Monday. Serbia are also proving to be challengers for that second spot and could announce themselves as genuine contenders if they can replicate their thrashing of Lithuania away from home.\n\nStandings P W D L PTS Ukraine 5 4 1 0 13 Portugal 4 2 2 0 8 Serbia 5 2 1 2 7 Luxembourg 5 1 1 3 4 Lithuania 5 0 1 4 1\n\nFixtures\n\nFriday: Portugal v Luxembourg, Ukraine v Lithuania\n\nMonday: Ukraine v Portugal, Lithuania v Serbia\n\nGroup C\n\nGermany have put their World Cup and Nations League anguishes behind them by winning four of their five Euro qualification games so far. Joachim Low’s youthful side will be looking to emulate their 8-0 thrashing of Estonia in their only fixture this week as dark horses, Northern Ireland have matched their impressive start. However, Michael O’Neil’s side travel to Holland who, with a win can leap frog them into 2nd place. It is a three horse race in Group C, and it looks likely to go down to the wire.\n\nStandings P W D L PTS Germany 5 4 0 1 12 Northern Ireland 5 4 0 1 12 Netherlands 4 3 0 1 9 Belarus 5 1 0 4 3 Estonia 5 0 0 5 0\n\nFixtures\n\nThursday: Netherlands v Northern Ireland, Belarus v Estonia\n\nSunday: Belarus v Netherlands, Estonia v Germany\n\nGroup D\n\nSurprisingly, the Republic of Ireland have taken advantage of Switzerland’s slow start to the campaign and will be looking to extend their lead over the group favourites when they meet in Genève on Tuesday. Second place Denmark however, also have a chance of topping the group and will also be hoping to sink the Swiss at home on Saturday. It shaping up to be a defining week in Group D, however, the group still seems to be in Switzerland’s hands and if the Republic of Ireland or Denmark can cause an upset, it will bolster their chances of securing a place at Euro 2020.\n\nStandings P W D L PTS Republic of Ireland 5 3 2 0 11 Denmark 5 2 3 0 9 Switzerland 4 2 2 0 8 Georgia 5 1 1 3 4 Gibraltar 5 0 0 5 0\n\nFixtures\n\nSaturday: Georgia v Republic of Ireland, Denmark v Switzerland\n\nTuesday: Switzerland v Republic of Ireland, Gibraltar v Georgia\n\nGroup E\n\nAs expected, World Cup finalists Croatia have taken control of Group E but the chasing pack have closed the gap following their surprise defeat to Hungary, and draw to bottom placed Azerbaijan last month. The Croats dropping points has granted Wales a lifeline. If Ryan Giggs’ side can get points from their games against Slovakia and Croatia this week then their dream of reaching consecutive Euro finals will be back on. Like the groups before them, Group E is there for the taking. If Croatia wither, then Slovakia, Hungary and Wales are ready to pounce and this week could prove crucial.\n\nStandings P W D L PTS Croatia 5 3 1 1 10 Slovakia 5 3 0 2 9 Hungary 5 3 0 2 9 Wales 4 2 0 2 6 Azerbaijan 5 0 1 4 1\n\nFixtures\n\nThursday: Croatia v Hungary, Slovakia v Wales\n\nSunday: Hungary v Azerbaijan, Wales v Croatia\n\nGroup F\n\nSpain have made a flying start under new boss Robert Moreno, keeping an immaculate record thus far, and which they will likely preserve after this week, having already beaten both Norway and Sweden with ease. However, both Scandinavians will be going head-to-head for second place as they look to derail a confident Romanian side who are mounting a push for that final qualification place. All three teams should realistically gain maximum points in their fixtures against Malta and the Faroe Islands so it is shaping up to be a head-to-head match for second up in Group E with Romania v Norway being the first on Tuesday evening.\n\nStandings P W D L PTS Spain 6 6 0 0 18 Sweden 6 3 2 1 11 Romania 6 3 1 2 10 Norway 6 2 3 1 9 Malta 6 1 0 5 3 Faroe Islands 6 0 0 6 0\n\nFixtures\n\nSaturday: Faroe Islands v Romania, Norway v Spain, Malta v Sweden\n\nTuesday: Sweden v Spain, Romania v Norway, Faroe Islands v Malta\n\nGroup G\n\nWith the exception of winless Latvia, teams in Group G have been nicking points off each other but match week seven and eight looks set to differentiate the dominant teams in the group. League leaders Poland will be looking to improve their position at the top with a trip to Latvia and match against North Macedonia this week. However, Israel have surprised many so far by attaining eight points in their opening six games, including a 4-2 win against Austria who they face on Thursday.\n\nStandings P W D L PTS Poland 6 4 1 1 13 Slovenia 6 3 2 1 11 Austria 6 3 1 2 10 North Macedonia 6 2 2 2 8 Israel 6 2 2 2 8 Latvia 6 0 0 6 0\n\nFixtures\n\nThursday: Latvia v Poland, Austria v Israel, North Macedonia v Slovenia\n\nSunday: Poland v North Macedonia, Slovenia v Austria\n\nGroup H\n\nWorld Cup winners France will be aiming to derail Turkey’s fine start to Euro qualifying and reassert themselves back on top of the group when the pair meet on Monday afternoon. France will be targeting revenge on the Turks after they fell to a 2-0 defeat in Istanbul in June, and also impede on Iceland’s challenge for second place. However, it would be unwise to rule Albania out of qualification as despite falling to embarrassing defeats to the teams above, they have picked up results from the teams below.\n\nStandings P W D L PTS Turkey 6 5 0 1 15 France 6 5 0 1 15 Iceland 6 4 0 2 12 Albania 6 3 0 3 9 Moldova 6 1 0 5 3 Andorra 6 0 0 6 0\n\nFixtures\n\nFriday: Iceland v France, Turkey v Albania, Andorra v Moldova\n\nMonday: France v Turkey, Iceland v Andorra, Moldova v Albania\n\nGroup I\n\nBelgium have sustained a perfect record in their opening six games, and have managed to only conceded once so far against Russia. The Red Devils should maintain their immaculate record given they host bottom placed San Mario before travelling to Kazakhstan. Qualification will be done and dusted if they gain maximum points this week, as will Russia who are eight points clear of third. The Scots have endured a terrible campaign, as a 3-0 defeat to Kazakhstan on match week one set the tone for the rest of their fixtures. They will just be playing for for pride against Russia and San Marino this week.\n\nStandings P W D L PTS Belgium 6 6 0 0 18 Russia 6 5 0 1 15 Kazakhstan 6 2 1 3 7 Cyprus 6 2 1 3 7 Scotland 6 2 0 4 6 San Marino 6 0 0 6 0\n\nFixtures\n\nThursday: Kazakhstan v Cyprus, Belgium v San Marino, Russia v Scotland\n\nSunday: Kazakhstan v Belgium, Cyprus v Russia, Scotland v San Marino\n\nGroup J\n\nItaly seemed to have put their woes behind them and have mounted a campaign to reinstate themselves back into the world elite after adding themselves to the perfect qualifiers club. The sheer gap between themselves and third placed Armenia means qualification for 2020 will be sealed with just one more victory, which they should accomplish this week. Teemu Pukki’s five goals have allowed Finland to gain second spot but their qualification hopes could be weakened if they allow Armenia to close the gap when the pair meet on Tuesday.\n\nStandings P W D L PTS Italy 6 6 0 0 18 Finland 6 4 0 2 12 Armenia 6 3 0 3 9 Bosnia 6 2 1 3 7 Greece 6 1 2 3 5 Liechtenstein 6 0 1 5 1\n\nFixtures\n\nSaturday: Bosnia and Herzegovina v Finland, Italy v Greece, Liechtenstein v Armenia\n\nTuesday: Liechtenstein v Italy, Greece v Bosnia and Herzegovina, Finland v Armenia", "description": "Group A England have mounted a perfect start to qualification by scoring 19 goals in their opening four games, and can secure a place at the Euro 2020 with wins over the challenging Czech Republic and a disappointing Bulgaria. Kosovo have been Group A’s surprise package thus far, beating both the Bulgarians and the Czechs in their last two games prior to losing against", "authors": ["Frankie Christou"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/08/15/euro-2020.jpg", "published_at": "2019-10-09"}