{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/babestation-model-has-change-heart-20714678", "downloaded_at": "2019-10-24 14:09:09.396169+00:00", "title": "Babestation model 'has change of heart and agrees to take £20k from man'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA Babestation model has agreed to accept a huge fan's offer to give her £20,000 in his will, it has been reported.\n\nThomas Weir has been desperate to hear from Laura Jones since speaking to her on the televised date line.\n\nAfter putting the word out that he wished to bestow the model with thousands of pounds, the 51-year-old received a call on Wednesday evening.\n\nIt was from Laura, 33, explaining that she would happily accept the cash to spend on her kids, The Daily Record reported.\n\n\"When Laura said 'hello' down the phone I was shellshocked,\" Thomas said.\n\n\"We had the most amazing conversation that lasted over two and half hours.\n\n\"She's just so lovely.\"\n\n(Image: Steve Bell)\n\n(Image: SWNS)\n\nThe former warehouse worker fears he may not have long left as he battles diabetes and an MRSA infection.\n\nLast year the Milton Keynes man had his leg amputated, confining him to a wheelchair.\n\nWith his family members estranged and £20,000 in the bank, the kind hearted Babestation fan decided to publicly reach out to Laura.\n\nAfter the appeal went live on Monday, Laura broke her silence a day later to say she didn't want to take the money.\n\nShe appears to have had a change of heart just a day later, calling Thomas and accepting the cash.\n\n\"Laura explained that she wasn't comfortable with having the money,\" he said.\n\n\"She suggested I use it for a bucket list, but you can hardly do things like jump out of a plane with one leg.\n\n(Image: Steve Bell)\n\n\"She then came up with the idea of drum lessons as she knew I used to play, but I've had lessons before.\n\n\"If she took the money in the end she asked if it would be okay for it to go towards her young children as well as clothes and lingerie for her modelling career.\n\n\"Nothing is set in stone but she is the most beautiful person and I want her to have it.\"\n\nThomas first spotted Laura on adult TV channels in 2001, while he was living in Knightswood, Glasgow.\n\n\"A friend told me about Laura and I found her one night on SXTV Live at around midnight.\n\n\"The show was called Laura Dares.\n\n\"From that moment I became a fan.\"\n\nFor the next couple of years Thomas regularly watched shows that starred beauty Laura.\n\nBetween 2003 and 2010, Laura disappeared from the adult channels, with heartbroken Thomas thinking he'd never see her again.\n\nShe came back into his life one night in January 2011.\n\n\"I was on an adult channel and saw a live chat line segment called 'Laura Live' and it was her,\" Thomas added.\n\n\"I was astounded, my heart was thumping faster than it had ever done before.\n\n\"I could feel blood pumping right through my veins and thought I was going to have a heart attack.\"\n\nIt took until March that year for Thomas to pluck up the courage to call into Laura Live.\n\n\"We really connected,\" Thomas said.\n\n\"The chat was not about sex or relationships in any way.\n\n(Image: Steve Bell)\n\n\"We spoke about our own lives, the news and sport teams as I'm a lifelong Greenock Morton fan.\n\n\"She told me about her passion for orange chocolate and we spoke about the band, Simple Minds.\"\n\nEuphoric from finally chatting to the model, Thomas waited another month before calling in again.\n\n\"In April 2011 we had a brief conversation just to catch up, again nothing sexual.\n\n\"Our third conversation was last night.\"\n\nEight years on, Thomas dismisses jibes from those who knew about his feelings towards Laura and members of the public in the wake of his search for her.\n\n\"I've been called a sleazebag, a fifty-year-old virgin and a stalker but I don't care,\" he said.\n\n\"Laura is funny, witty and down to earth.\n\n\"She's the most beautiful person inside and out.\n\n\"I would never judge her for her career.\"", "description": "Thomas Weir has had his offer of giving £20,000 to model Laura Weir accepted", "authors": ["Kathleen Speirs", "Milo Boyd", "Image", "Swns", "Steve Bell"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20714699.ece/ALTERNATES/s1200/0_Former-glamour-model-Laura-Jones.jpg", "published_at": "2019-10-24"}