{"pub": "investing.com", "url": "https://ng.investing.com/analysis/will-250-natural-gas-persist-after-super-september-takes-a-bow-19722", "downloaded_at": "2019-09-26 15:36:44.270529+00:00", "title": "Will $2.50 Natural Gas Persist After “Super September” Takes A Bow?", "language": "en", "text": "With just two sessions left to the best September in seven years for U.S. , some are wondering if the rest of the year will continue to see strong enough prices to flip a market that, to date, remains double-digits in the red.\n\nOthers have a simpler question: Can the key $2.50 pricing be defended until at least mid October?\n\nThat might be a more important ask because it’ll be a reflection of sentiment over the next two weeks as the post-summer warmth hanging around most of the country finally fades and real cold takes time to emerge.\n\nNatural Gas 300-Min Chart - Powered by TradingView\n\nComfortable Temperatures First, Before Cold\n\nThe weather shift will lead to comfortable temperatures, where even less cooling—and probably no heat at all—will be required.\n\nThat’s an outcome that will not be too good for power generators and the gas industry that relies on them. Since Sept. 6—or nearly three weeks ago—the on New York Mercantile Exchange’s Henry Hub has been firmly anchored to the $2.50 per million British thermal units berth.\n\n“Super September” played a major role in that price defense, as many sweltering nights, unseasonable for late summer, forced homes to leave the air-conditioners on—adding to utilities’ demand for gas-fired power. Henry’s Hub’s benchmark contract is poised to finish this month up nearly 11%—its highest for September since 2012.\n\nFor the year though, gas futures are still down 14%. Dominick Chirichella, director of risk and trading at the Energy Management Institute in New York, said post-summer warmth will wear on through the next week across most of Central/Eastern United States, before cooling finally arrives.\n\nHe added:\n\n“Temperatures will be somewhat above normal across most of the southern U.S. for days 11-15, and near to somewhat below normal in the north.”\n\nGas Storage Creeping Higher\n\nDespite this month’s strong relative demand for gas, stockpiles of the fuel stored in underground caverns have been creeping up, largely because of surging production. Gas output in the Lower 48 U.S. states averaged a near record 91.9 billion cubic feet per day (bcfd) last week, according to data provider Refinitiv.\n\nThat may explain why Henry Hub’s front-month tanked almost non-stop in the past eight sessions, falling as much as 4% daily at one point, before Wednesday’s 1% rebound.\n\nA Reuters poll of analysts forecast that U.S. utilities likely injected a higher-than-normal 89 billion cubic feet (bcf) of gas into for the week ended Sept. 20. That would be significantly higher than the 51 bcf injection during the same week a year ago and the five-year (2014-2018) average injection of 74 bcf for the period.\n\nThe U.S. Energy Information Administration’s weekly gas report at 10:30 AM ET (14:30 GMT) will show if those estimates are correct.\n\nFurther Price Losses?\n\nGoing forth, what are the odds of futures clinging to $2.50, and possibly ramping from there?\n\nChallenging, said Dan Myers, analyst at Gelber & Associates in Houston, who noted that the entire 2020 calendar strip average on Henry Hub has ducked below $2.50.\n\nHe added: “The market is hinting at further losses”.\n\nInvesting.com has shifted its call on to “Neutral”, from a “Strong Buy” two weeks ago.\n\nOn the site’s Daily Technical Outlook, the top-end resistance for November gas was given as $2.62, versus last week’s $2.77. Lowest support was pegged at $2.43—well below the $2.50 mark.\n\nScott Shelton, energy futures broker at ICAP (LON: ) in Durham, North Carolina, said fund flows for gas from Commodity Trading Advisors, or hedge funds, were “clearly bearish”.\n\n“Systematic shorts are resetting the market’s fair value of $2.50. That means that value buyers will only be looking to buy it closer to $2.30 as they recognize that the CTAs have a lot of shorts to reset.”\n\nBut he also cautioned against pushing prices much lower, in case early cold in the fall season places gas investors in a bear trap.\n\nAdded Shelton:\n\n“Overall, I remain negative on the flows and think anything towards 2.30 is a mistake worth owning.”", "description": "Commodities Analysis by Investing.com (Barani Krishnan/Investing.com) covering: NEX Group PLC, Natural Gas Futures. Read Investing.com (Barani Krishnan/Investing.com)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-26"}