{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7591117/Kelly-Rowland-wows-crowd-Everest-2019-Sydney.html", "downloaded_at": "2019-10-19 14:13:52.503175+00:00", "title": "Kelly Rowland wows the crowd at The Everest 2019 in Sydney", "language": "en", "text": "Kelly Rowland's performance at The Everest 2019 in Sydney on Saturday was the hottest ticket in town.\n\nThe 38-year-old wowed the crowd at Randwick when she took to the stage in a show-stopping black leotard to perform some of her greatest hits.\n\nKelly's bespoke outfit featured intricate sequinned details that sparkled in the light, adding her crowd-pleasing performance.\n\nBack in black! Kelly Rowland (pictured) wowed the crowd as she performed in a sequinned leotard at The Everest 2109 in Sydney on Saturday\n\nThe When Love Takes Over singer showed off her shapely derriere on the day, with an open portion revealing her cheeky black underwear.\n\nStrands of beading hung off the back and front of the leotard, which also had puffy sleeves for added drama.\n\nHer spectacular look also featured a low v-neck that gave a glimpse of the Kisses Down Low hitmaker's ample bust.\n\nWow! Kelly's performance at The Everest 2019 was the hottest ticket in town\n\nA look! The 38-year-old American singer wowed the crowd at Randwick, taking to the stage in a revealing black leotard\n\nShiny: The fitted outfit featured sequinned details throughout, causing it to sparkle in the light\n\nStunning: Strands of beading hung off the back and front of the leotard, which also had puffy sleeves for added drama\n\nKelly added a pair of skin-toned fishnets to the ensemble, and strutted confidently across the stage.\n\nThe Commander singer wore her hair long and straight with a blunt fringe at the front framing her face.\n\nFor makeup, she chose a nude lipstick in a matte formula and heavy-lined eyes with a smoky eye-shadow.\n\nBustin' out: Kelly's bespoke outfit featured a low v-neck that gave a glimpse of the Kisses Down Low hitmaker's ample bust\n\nLet loose! Kelly looked very energetic as she revved up the crowd\n\nHairy situation: Kelly wore her hair long and straight with a blunt fringe at the front framing her gorgeous visage\n\nIn the trunk: The star showed off her shapely derriere in the outfit, with an open portion revealing her black underwear\n\nThe crowd went wild as the star commanded the stage and performed some of her best known bangers.\n\nPrevious headliners at the glitzy event have included the likes of former One Direction heartthrob Liam Payne and singer Jason Derulo.\n\nAhead of her performance, Kelly made it clear she wasn't going to be drawn into competition with the male stars.\n\nSing it! The Work singer strutted confidently across the stage\n\nSmoldering: For makeup, she chose a nude lipstick in a matte formula\n\nDetails: Kelly added a statement ring and two silver necklaces to the ensemble\n\nSpeaking on Channel Nine's the Today show live from her home in Hollywood recently, The Voice Australia judge said she defied comparison.\n\nWhen asked how she planned to beat the previous performances, Kelly said: 'I mean it's not about outdoing anybody as much as it is rising to my own occasion.'\n\nThe former Destiny's Child singer, who has built an army of Australian fans during her time on The Voice Australia, went on to say women 'rule the world'.\n\nBig names! Previous headliners at the glitzy event have included the likes of former One Direction heartthrob Liam Payne and singer Jason Derulo\n\nWhen asked how she planned on beating the previous performances, Kelly said: 'I mean it's not about outdoing anybody as much as it is rising to my own occasion.'\n\nThe former Destiny's Child singer, who has built an army of Australian fans during her time on The Voice Australia, went on to say women 'rule the world'\n\nShe added: 'I don't compare myself to a man at all. I think we're way greater than men.'\n\nBut Kelly admitted that each performer's show is different and she was confident hers would wow racegoers.\n\n'When you have fun it changes the atmosphere of everything,' she said.\n\n'My show is different to Jason's show. Jason's show is different to anyone else's show.'", "description": "Kelly Rowland's performance at The Everest 2019 in Sydney on Saturday was the hottest ticket in town.", "authors": ["Marta Jary For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/12/19921344-0-image-a-50_1571486054821.jpg", "published_at": "2019-10-19"}