{"pub": "realclearpolitics", "url": "https://msn.com/en-us/news/politics/whistleblower%E2%80%99s-attorney-says-team-now-representing-%E2%80%98multiple%E2%80%99-officials/ar-AAIm6mv", "downloaded_at": "2019-10-07 19:47:29.982566+00:00", "title": "Whistleblower’s attorney says team now representing ‘multiple’ officials as impeachment inquiry expands", "language": "en", "text": "An attorney for the whistleblower who sounded the alarm about President Trump’s pressure on Ukraine said Sunday that “multiple” whistleblowers have come forward, deepening a political quagmire that has engulfed the president as well as several of his Cabinet members.\n\nThe news comes as House Democrats are accelerating their impeachment inquiry and subpoenaing documents related to Trump’s efforts to push foreign countries to investigate one of his political opponents, former vice president Joe Biden.\n\n“I can confirm that my firm and my team represent multiple whistleblowers in connection to the underlying August 12, 2019, disclosure to the Intelligence Community Inspector General,” the whistleblower’s attorney, Andrew Bakaj, said in a tweet. “No further comment at this time.”\n\nMark Zaid, who also is a member of the original whistleblower’s legal team, confirmed to The Washington Post that the team is now representing a second whistleblower, someone who works in the intelligence community. The second individual has spoken to the inspector general of the intelligence community and has not filed a complaint.\n\n“Doesn’t need to,” Zaid said in a text message, adding that the person has “first hand knowledge that supported the first whistleblower.”\n\nNews that the original whistleblower’s team is representing a second person was first reported Sunday by ABC News.\n\nTrump seized on the latest development in a Sunday night tweet.\n\n“Democrat lawyer is same for both Whistleblowers? All support Obama and Crooked Hillary. Witch Hunt!” he said.\n\nThe crisis, which began last month with media reports revealing the original whistleblower’s complaint, has quickly metastasized across the Trump administration, ensnaring senior officials such as Energy Secretary Rick Perry and Secretary of State Mike Pompeo, who came under further scrutiny over the weekend.\n\nTrump largely stayed out of public view, spending Saturday at his golf club in Sterling, Va., and Sunday at the White House. In tweets, he attacked Democrats and some Republican detractors, including Sen. Mitt Romney of Utah, whose impeachment Trump demanded Saturday after Romney criticized him.\n\nHe also appeared to directly link the 2020 presidential race to his efforts to push Ukraine to investigate Biden, contrary to a tweet on Friday declaring, “This has NOTHING to do with politics or a political campaign against the Bidens.”\n\n“And by the way, I would LOVE running against 1% Joe Biden — I just don’t think it’s going to happen,” Trump tweeted Sunday, arguing that Biden and his family were “PAID OFF, pure and simple!”\n\n“Sleepy Joe won’t get to the starting gate, & based on all of the money he & his family probably ‘extorted,’ Joe should hang it up,” Trump added. “I wouldn’t want him dealing with China & [Ukraine]!”\n\nBiden campaign spokesman Andrew Bates responded by calling it “puzzling” that Trump would claim to love the prospect of a matchup against Biden, “seeing as how he just sent his administration into a tailspin by trying to bully a foreign country into spreading a comprehensively debunked conspiracy theory about the vice president.”\n\nBiden’s son Hunter served for nearly five years on the board of Burisma, Ukraine’s largest private gas company, whose owner came under scrutiny by Ukrainian prosecutors for possible abuse of power and unlawful enrichment. Hunter Biden was not accused of any wrongdoing in the investigation.\n\nAs vice president, Joe Biden pressured Ukraine to fire the top prosecutor, Viktor Shokin, whom Biden and other Western officials, including Republicans, accused of not sufficiently pursuing corruption cases. At the time, the investigation into Burisma was dormant, according to former Ukrainian and U.S. officials.\n\nOn Saturday, Perry’s discussions with Ukrainian officials came to attention amid reports that Trump told Republicans on Friday that his July 25 call with the Ukrainian president, which is at the center of the original whistleblower’s complaint, was made at the request of Perry.\n\nAsked about Trump’s comments, which were first reported by Axios, Energy Department spokeswoman Shaylyn Hynes said in an email that Perry encouraged Trump to speak with Ukrainian President Volodymyr Zelensky to discuss energy security.\n\nPompeo, who was scheduled to return to Washington on Sunday, is facing growing pressure from Democrats seeking Ukraine-related documents.\n\nHouse Foreign Affairs Committee Chairman Eliot L. Engel (D-N.Y.) said Sunday on CBS’s “Face the Nation” that Pompeo, who had spent much of the past week in Europe, missed a Friday deadline to comply with a subpoena for information about the State Department’s dealings with Ukraine. Pompeo asserts that a letter sent to the committee constitutes the department’s initial response.\n\nThe whistleblower complaint accused Trump of asking the Ukrainian government to help him with his reelection bid by launching an investigation into Biden. Democrats are also probing whether Trump’s decision to withhold nearly $400 million in military assistance from Ukraine was linked to his push for the government there to pursue political investigations that could bolster the president’s reelection bid.\n\nText messages between State Department officials, revealed by House Democrats last week, show that there was at least some concern that Trump was pursuing an improper quid pro quo.\n\n“As I said on the phone, I think it’s crazy to withhold security assistance for help with a political campaign,” diplomat William B. Taylor wrote on Sept. 9 to Gordon Sondland, the U.S. ambassador to the European Union.\n\nSondland, who has denied that Trump sought a quid pro quo, has agreed to meet privately on Tuesday with the three panels — Intelligence, Foreign Affairs and House Oversight — spearheading the probe, according to a committee aide.\n\nOn Friday, those three committees subpoenaed the White House for documents and wrote a letter to Vice President Pence demanding that he turn over documents related to his talks with Zelensky.\n\nSpeaking at a Republican event in Louisiana on Saturday, Pence blasted Democrats but gave no indication about whether he would comply with their document request.\n\n“Do-Nothing Democrats launched a partisan impeachment inquiry in a blatant attempt to overturn the will of the American people in the last election,” he said.\n\nOn Sunday, Trump’s campaign announced that the president would be traveling to Lake Charles, La., to hold a rally on Friday. The president will also have a rally on Wednesday in Minneapolis.\n\nNo White House officials made appearances on the Sunday morning news shows, leaving it up to congressional Republicans and Trump’s personal lawyer, Rudolph W. Giuliani, to defend the president in heated interviews during which they offered at-times-contradictory explanations for the president’s actions.\n\nIn a combative exchange on NBC’s “Meet the Press,” host Chuck Todd pressed Sen. Ron Johnson (R-Wis.) to explain why he told the Wall Street Journal about his concern in the summer that Trump had sought to link Ukrainian military aid to an investigation of the Bidens.\n\nJohnson repeatedly declined to answer, instead raising a conspiracy theory and criticizing the media before finally stating that Trump had “adamantly denied” any quid pro quo.\n\nJohnson also at one point said he does not trust U.S. intelligence agencies. “Something pretty fishy happened during the 2016 campaign and in the transition, the early part of the Trump presidency, and we still don’t know,” he said.\n\n“We do know the answer,” an exasperated Todd responded, adding: “You’re making a choice not to believe the investigations that have taken place.”\n\nGiuliani issued a defiant defense of Trump in an interview on Fox News Channel’s “MediaBuzz” in which he argued that the president “has every right to ask countries to help us in a criminal investigation that should be undertaken.”\n\nGiuliani was named in the whistleblower’s complaint and in a rough transcript of Trump’s phone call with Zelensky as being a key intermediary in back-channel efforts to pursue the allegations against Biden.\n\nBut other Republicans sought to play down Trump’s comments, including his exchange with reporters outside the White House on Thursday in which he urged China to investigate Biden.\n\nIn an interview on ABC News’s “This Week with George Stephanopoulos,” Rep. Jim Jordan (R-Ohio) echoed a suggestion on Friday by Sen. Marco Rubio (R-Fla.) that Trump’s China statement was not “a real request.”\n\n“George, you really think he was serious about thinking that China’s going to investigate the Biden family? . . . I think he’s getting the press all spun up about this,” Jordan said.\n\nDuring the interview, Stephanopoulos repeatedly sought an answer from Jordan on whether he thinks it is appropriate for Trump to ask China and Ukraine to investigate Biden. Jordan dodged the question more than a dozen times.\n\nDemocrats on Sunday defended their party’s efforts to pursue an impeachment inquiry.\n\nIn an interview on “Fox News Sunday,” Rep. Val Demings (Fla.), a member of the Intelligence Committee, supported House speaker Nancy Pelosi’s view that no vote by the full House is necessary for an impeachment inquiry to move forward.\n\nShe added that she thinks the House “will have to take a serious look at articles of impeachment” based on the evidence that has emerged.\n\nRep. Hakeem Jeffries (N.Y.), a key member of the House Democratic leadership, said on “This Week” that “the evidence of wrongdoing by Donald Trump is hiding in plain sight.”\n\n“The administration, without justification, withheld $391 million in military aid from a vulnerable Ukraine,” he said. “The president then pressured a foreign leader to interfere in the 2020 elections and target an American citizen for political gain. That is textbook abuse of power.”\n\nfelicia.sonmez@washpost.com\n\ntoluse.olorunnipa@washpost.com\n\nEllen Nakashima, Abigail Hauslohner and Elise Viebeck contributed to this report.", "description": "The news, which comes as House Democrats are subpoenaing the White House for documents, deepens the political crisis involving President Trump.", "authors": [], "top_image": "", "published_at": "2019-10-07"}