{"pub": "cbs", "url": "https://cbsnews.com/news/transcript-mike-pence-on-face-the-nation-october-27-2019", "downloaded_at": "2019-10-28 00:31:06.508708+00:00", "title": "Transcript: Vice President Mike Pence on \"Face the Nation,\" October 27, 2019", "language": "en", "text": "The following is a transcript of an interview with Vice President Mike Pence that aired Sunday, October 27, 2019, on \"Face the Nation.\"\n\nMARGARET BRENNAN: And joining us here in studio with more details of the raid is Vice President Mike Pence. Good morning to you, Mr. Vice President.\n\nVICE PRESIDENT MIKE PENCE: Good morning Margaret.\n\nMARGARET BRENNAN: You were in the Situation Room watching this--\n\nVICE PRESIDENT PENCE: I was.\n\nMARGARET BRENNAN: --as it happened.\n\nVICE PRESIDENT PENCE: I was.\n\nMARGARET BRENNAN: Tell me about the decision behind- when was it made? Who made it?\n\nVICE PRESIDENT PENCE: Well first let me just say this is a great day for America. Al-Baghdadi, the most wanted man in the world, is dead. And it's a tribute to the courage of our Armed Forces, Special Forces that executed the raid on the compound last night, but it's also a tribute to the decisiveness of President Donald Trump. We first received information early in the week about the possibility of his location--\n\nMARGARET BRENNAN: This was CIA?\n\nVICE PRESIDENT PENCE: It was through our intelligence agencies that the president rightly commended today. Through a combination of intelligence, surveillance, reconnaissance, we believe we knew where he would be. And by Thursday afternoon, the president and I were informed that there was a high probability he would be at the compound in Idlib province. The president immediately directed our commanders to develop military options. Those were presented to the president at the White House on Friday morning. But it was Saturday morning that we received the actionable intelligence that allowed the decision that the president had made to move forward to happen. And it is a- it was incredible to be in the Situation Room and to see this unfold in real time as our special forces were on the ground, to see their professionalism over a period of two hours. But the wor- America and the world are safer today with the leader of ISIS dead.\n\nMARGARET BRENNAN: According to U.S. intelligence though, ISIS has about eight branches. It- it had that--\n\nVICE PRESIDENT PENCE: Right.\n\nMARGARET BRENNAN: -- battle ground its lost in Iraq and Syria, but it has, as you know, a significant force in Afghanistan and inspiration all around the world. So what impact will taking out Baghdadi have on the rest of those tentacles?\n\nVICE PRESIDENT PENCE: Well as the president said today what- what the United States of America demonstrated last night is that this President, this country will be unrelenting in our fight against ISIS or any terrorist organization that threatens this country.\n\nMARGARET BRENNAN: But what does that mean for the drawdown of U.S. forces from Syria? Does that mean that Iraq has agreed to now host the majority of the presence being pulled out from Syria?\n\nVICE PRESIDENT PENCE: Well we- we have a military presence in Iraq. We have as the president's made clear an ongoing military presence in parts of Syria. But- but to be clear you- you know the president looked at the deployment of American forces in between traditionally Kurdish Syria and the Turkish border and essentially believed that that was not the right place for our forces to be. American forces went into Syria, worked with our Syrian Kurdish allies to destroy the ISIS caliphate. The last inch of territory the ISIS caliphate was captured in March. And the president looked at the circumstances where we had American forces essentially providing a safe zone patrol on the Turkish border. That was not the mission.\n\nMARGARET BRENNAN: So how many--\n\nVICE PRESIDENT PENCE: I have to tell you--\n\nMARGARET BRENNAN: --are staying?\n\nVICE PRESIDENT PENCE: I have to tell you as the- as the father of the United States Marine, I- I couldn't be more grateful that we have a commander in chief that is always asking about- about you know whether or not American forces have to be in harm's way--\n\nMARGARET BRENNAN: So are you--\n\nVICE PRESIDENT PENCE: And if they're not on the mission- they weren't on the mission. ISIS the caliphate had been destroyed so the president said we'll bring them home. But last night, the president of the United States proved to the world that our fight against ISIS is unrelenting. And by- and by killing the leader of ISIS--\n\nMARGARET BRENNAN: Right.\n\nVICE PRESIDENT PENCE: --the active operational leader of ISIS, who it was reported just two weeks ago was giving orders to ISIS fighters in Syria, we believe we'll have a measurable impact on the effectiveness of that terrorist organization. But we're not going to let up. We're not going to stop the fight but- and at the same time we're going to continue to work with our allies to establish that safe zone between Kurdish Syria and Turkey that the president had myself and Secretary of State Pompeo negotiate in Ankara just a week ago.\n\nMARGARET BRENNAN: But do I understand what you're saying is that the number of U.S. troops remaining in Syria is still being determined? You haven't locked in at a number yet?\n\nVICE PRESIDENT PENCE: Well, we have- we have troops at Al-Tanf and then also the president's made it clear that we're going to have forces to secure the oilfields in northern Syria in order to then create a collaborative relationship on that basis--\n\nMARGARET BRENNAN: More than 200 roughly?\n\nVICE PRESIDENT PENCE: --with Kurdish- with our Kurdish Syrian allies. I mean look- this is- this- this operation last night though was a real testament to the relationships that we've forged with Syrian Democratic Forces, who I can't detail, but played a role in this in terms of information that we were provided. Turkey's cooperation during the assault last night was acknowledged--\n\nMARGARET BRENNAN: By opening its airspace?\n\nVICE PRESIDENT PENCE: --today by the president. Well, yes.\n\nMARGARET BRENNAN: Okay.\n\nVICE PRESIDENT PENCE: Fully cooperating with the deployment of Special Forces, but really all the credit goes here to the decisiveness of this commander in chief and to the courage and professionalism of the Special Forces of the United States that- it was a- we- we were literally watching, MARGARET, in real time as those helicopters set down, as they assaulted the compound. And we- and we heard those words that- that al-Baghdadi had been killed. And I--\n\nMARGARET BRENNAN: Yeah.\n\nVICE PRESIDENT PENCE: --I knew from that moment America was safer as a result.\n\nMARGARET BRENNAN: Mr. Vice President, I also want to ask you while you're here, you have been clear in saying there was no pressure put on Ukraine, no--\n\nVICE PRESIDENT PENCE: Right.\n\nMARGARET BRENNAN: --quid pro quo as it pertains to what is now being looked at as grounds for potential impeachment of the president. But we have had at least four U.S. officials under oath, say that they had knowledge of a deal being offered, that main military aid and a meeting with the president contingent on opening an investigation that relates to the company Joe Biden's son served on the board of. Are they all lying?\n\nVICE PRESIDENT PENCE: Well, I can only tell you what I know. And what I know is that the transcript of the president's call with President Zelensky shows that there was no quid pro quo. He did nothing wrong.\n\nMARAGARET BRENNAN: But were you aware of--\n\nVICE PRESIDENT PENCE: I - I --\n\nMARGARET BRENNAN: -- that deal that--\n\nVICE PRESIDENT PENCE: -- can honestly--\n\nMARGARET BRENNAN: --they are--\n\nVICE PRESIDENT PENCE: No--\n\nMARGARET BRENNAN -- giving---\n\nVICE PRESIDENT PENCE: --I can also tell you that--\n\nMARAGARET BRENNAN: details of and sworn under oath existed?\n\nVICE PRESIDENT PENCE: -- that all of my interactions with President Zelensky, we focused entirely on President Zelensky's agenda to bring about reforms to end corruption in Ukraine and to bring together the European community to provide greater support for Ukraine. President Zelensky said there was no pressure. We had a good meeting when the president had to cancel to stay home for a hurricane and I met President Zelensky. The aid was released after that meeting and- but at the end--\n\nMARGARET BRENNAN: But did you have the knowledge of the deal that these U.S. officials have described under oath?\n\nVICE PRESIDENT PENCE: What I can tell you is all of my interaction on this issue with the president of the United States and President Zelensky focused entirely on three things: number one, the United States of America's support for Ukraine following the Russian invasion of Crimea and- and the war that Russia--\n\nMARGARET BRENNAN: Right.\n\nVICE PRESIDENT PENCE: -- has been fomenting there. We actually- this administration different from the last one have provided lethal weapons for Ukraine--\n\nMARGARET BRENNAN: But- but that- that conflict never came up--\n\nVICE PRESIDENT PENCE: -- and we've stood with them.\n\nMARGARET BRENNAN: -- in the phone call--\n\nVICE PRESIDENT PENCE: Margaret we've stood with them--\n\nMARGARET BRENNAN: -- these officials - did- did have knowledge of what they're describing or no?\n\nVICE PRESIDENT PENCE: We stood with them- we stood with them to restore their sovereignty and territorial integrity. Number two: President Zelensky was elected in a historic landslide and won parliamentary elections on an agenda to end corruption in Ukraine. And we very much wanted to understand the progress he was making on that. And thirdly, President Trump believed that it was time for the European community to step up. Those are the issues we made clear to President Zelensky and Ukraine.\n\nMARGARET BRENNAN: Yea.\n\nVICE PRESIDENT PENCE: And I think as the- as the facts continue to come out the American people again will see there in the President's transcript, my interactions, there was no quid pro quo. There was no pressure. It was entirely focused on issues--\n\nMARGARET BRENNAN: I- I haven't gotten a clear answer--\n\nVICE PRESIDENT PENCE: Of importance to the American people.\n\nMARGARET BRENNAN: -- from you on that though, sir. I do have to leave the interview there. But are you saying that you did not ever hear of such a deal? Is that what I understand you're describing?\n\nVICE PRESIDENT PENCE: I- I- I'm telling you that all of my interactions with the president, all of my conversations with President Zelensky, were entirely focused on issues of importance to the American people, ending corruption, enlisting more European support--\n\nMARGARET BRENNAN: Okay.\n\nVICE PRESIDENT PENCE: -- and supporting Ukraine in a way that would restore its territorial integrity and stand by Ukraine for its sovereignty.\n\nMARGARET BRENNAN: All right Mr. Vice President, thank you very much. I appreciate you joining us--\n\nVICE PRESIDENT PENCE: Thank you Margaret. Great day for America.\n\nMARGARET BRENNAN: We'll be back in one minute with former U.S. ambassador to the U.N., Susan Rice.", "description": "The following is a transcript of an interview with Vice President Mike Pence that aired Sunday, October 27, 2019, on \"Face the Nation\"", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/27/abfc4952-ba99-4fe4-8cca-db2a878df515/thumbnail/1200x630/907f56cbb9f9b984f348d55a9f741cbb/pence2.png", "published_at": "2019-10-27"}