{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/tunisia-court-leaves-presidential-hopeful-nabil-karoui-prison-191001165311268.html", "downloaded_at": "2019-10-02 00:40:24.182289+00:00", "title": "Tunisia court leaves presidential hopeful Nabil Karoui in prison", "language": "en", "text": "Tunisia's court of appeal has rejected a fresh request to release presidential candidate Nabil Karoui, according to his lawyers.\n\nThe ruling on Tuesday came less than two weeks before the second round of voting which will see the media magnate compete with 61-year-old retired law professor Kais Saied on October 13.\n\n\"Unfortunately the indictment chamber... refused the release request,\" lawyer Kamel Ben Messoud told AFP news agency, adding that he planned on meeting Karoui's other lawyers to decide their next move.\n\n\n\nA leader in Karoui's Qalb Tounes party, Oussama Khlifi, told local media: \"We don't doubt justice, but this catastrophe and charade continues, and threatens the democratic process.\"\n\nKaroui, who has been under investigation since 2017 for money laundering and tax evasion, was placed in pre-trial detention on August 23 and subsequent applications to free him have been denied.\n\nThe 56-year-old came second in the first round of the presidential election last month, behind Saied.\n\nKaroui's supporters have accused the government of pressuring judicial authorities to block his release, allegations authorities have consistently refuted.\n\nTunisia's presidential election is the second since the 2011 revolution that toppled longtime leader Zine El Abidine Ben Ali.\n\nThe polls follow the death in office in July of the nation's first democratically-elected leader, Beji Caid Essebsi.\n\nTunisia is also holding its parliamentary election on October 6 - the new president's success will depend on having support in parliament.", "description": "Ruling comes less than 2 weeks before runoff which will see media mogul face retired law professor Kais Saied.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/1/5a436a6ab08c49f78f5625d90927ae61_18.jpg", "published_at": "2019-10-01"}