{"pub": "cryptonews", "url": "https://cryptonews.com/news/mastercard-and-retail-giant-topco-to-launch-blockchain-pilot-4943.htm", "downloaded_at": "2019-10-28 07:52:30.509296+00:00", "title": "Mastercard and Retail Giant Topco to Launch Blockchain Pilot", "language": "en", "text": "Source: iStock/jbk_photography\n\nFinancial services giant Mastercard may have left Facebook's Libra behind, but the company still has big blockchain-related plans – and is looking to move into the world of blockchain-powered food supply chain traceability.\n\nPer a press release, Mastercard says it has begun working with blockchain provider Envisible and Topco, America’s largest retail food group purchasing organization.\n\nThe companies say they will launch a pilot at participating Food City stores, where seafood products will be traced using blockchain technology providing “a better line of sight into ethical sourcing and environmental compliance” for salmon, cod and shrimp products – with a view to expanding to other items.\n\nMastercard says it will provide its own blockchain-based Provenance Solution for the pilot.\n\nEarlier in October, Topco joined IBM's Food Trust Blockchain Network, a food supply chain network. The blockchain-based cloud network offers participating retailers, suppliers, growers and food industry providers with data from across the food ecosystem to enable greater traceability, transparency and efficiency, according to IBM.\n\nMastercard also claimed that it has filed “over 100 blockchain patents,” and stated that it is the “number three globally among top blockchain innovators” – citing data from a 2018 report by intellectual property firm IPRdaily.\n\nThe announcement comes hot on the heels of a Mastercard investment last month in fintech company Plaid, a project that rival Visa has also supported financially.\n\nPer Fortune, Mastercard’s North American president Craid Vosberg recently stated,\n\n“We recognized the importance of serving the [fintech] sector on its own terms and making our capabilities more easily accessible for them.”\n\nVosberg added that Mastercard was looking to “expand the means by which we’re capable of moving money.”", "description": "Financial services giant Mastercard may have left Libra behind, but the company still has big blockchain-related plans – and is looking to move into the world of blockchain-powered food supply chain traceability. Per a press release, Mastercard says it has begun working with blockchain provider Envisible and Topco, America’s largest retail food Group Purchasing Organization (GPO).", "authors": ["Tim Alper"], "top_image": "https://cimg.co/w/articles/0/5db/69b8a039a4.jpg", "published_at": "2019-10-28"}