{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-49926469", "downloaded_at": "2019-10-03 23:34:24.865543+00:00", "published_at": "2019-10-03", "title": "Las Vegas shooting victims reach $735m settlement from MGM Resorts", "language": "en", "text": "Image copyright Reuters Image caption More than 800 people were injured in the attack\n\nVictims of the 2017 Las Vegas shooting have reached a settlement of at least $735m (£592m) from MGM Resorts.\n\nThe chain owns the Mandalay Bay Hotel, from where the gunman killed 58 people and wounded hundreds more before killing himself in October 2017.\n\nThe victims were attending a country music festival at a venue across from the hotel, also owned by MGM.\n\nIt remains the single deadliest mass shooting committed by an individual in US history.\n\nOutrage at the killing led to a ban on bump stocks - devices that make rifles fire like machine guns.\n\n\"While nothing will be able to bring back the lives lost or undo the horrors so many suffered on that day, this settlement will provide fair compensation for thousands of victims and their families,\" said Robert Eglet, a lawyer for the victims.\n\nJim Murren, Chairman of MGM Resorts, said their aim was always to \"resolve these matters so our community and the victims and their families can move forward in the healing process\".\n\n\"We have always believed that prolonged litigation around these matters is in no-one's best interest.\"\n\nThe total settlement is expected to be between $735m and $800m, depending on how many claimants come forward.\n\nMGM Resorts previously filed a lawsuit against the victims seemingly to dismiss claims against it. This settlement is not an admission of liability by the company.\n\nWhat happened in Las Vegas?\n\nAbout 22,000 people were attending the Route 91 Harvest music festival on the Las Vegas Strip on 1 October 2017 when the gunman opened fire.\n\nStephen Paddock, 64, fired more than 1,000 rounds into the crowds from his room on the 32nd floor of the Mandalay Bay Hotel, killing 58 people and wounding more than 422 others.\n\nMore than 800 were eventually injured in the panic that followed.\n\nMedia playback is unsupported on your device Media caption A year since America's worst ever mass shooting, Rosemarie Melanson has only just left hospital\n\nPolice stormed the hotel room minutes after he stopped firing and found he had killed himself. He had 23 weapons with him in the room.\n\nThere remains no official motive for the attack.", "description": "MGM Resorts owns the Mandalay Bay Hotel from where a gunman killed 58 people in October 2017.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/0027/production/_109093000_056990834.jpg"}