{"pub": "washingtonpost", "url": "https://washingtonpost.com/national-security/2019/09/18/those-ufo-videos-are-real-navy-says-please-stop-saying-ufo", "downloaded_at": "2019-09-18 23:24:01.710132+00:00", "title": "Those UFO videos are real, the Navy says, but please stop saying ‘UFO’", "language": "en", "text": "In December 2017, two videos emerged that showed Navy pilots encountering mysterious spherical objects that appeared, at first glance, to move through the air in ways that baffled experts. A third, released in March 2018, depicted a similar encounter.\n\nEveryone who watched — including the pilots who filmed them — had the same question: What, exactly, are these things?\n\nLast week, a Navy official publicly called these mysterious objects “Unidentified Aerial Phenomena (UAP),” giving name to the inscrutable little dots and reigniting scrutiny around the unidentified flying objects (a term the Navy does not want to use even though the objects that are flying cannot be identified.)\n\n[The government admits it studies UFOs. So about those Area 51 conspiracy theories …]\n\n“The Navy designates the objects contained in these videos as unidentified aerial phenomena,” Joseph Gradisher, spokesman for the deputy chief of naval operations for information warfare, told the Black Vault blog, a massive civilian repository of government documents mostly obtained by Freedom of Information Act requests.\n\nGradisher further explained that “The ‘Unidentified Aerial Phenomena’ terminology is used because it provides the basic descriptor for the sightings/observations of unauthorized/unidentified aircraft/objects that have been observed entering/operating in the airspace of various military-controlled training ranges.”\n\nBlack Vault’s founder, John Greenewald Jr., told The Washington Post that he believed the remarks were significant because, for the first time, the Navy acknowledged the existence of the objects in the videos on the record and admitted that the department cannot identify them. Greenewald also reported that the videos were not originally intended for public release.\n\nBecause of this revelation, Gradisher’s comments to Black Vault have ricocheted across the Internet this week, getting picked up everywhere from Popular Mechanics (“The Navy Says Those UFO Videos Are Real”) to the front page of the Drudge Report (“UPDATE: Navy says It’s Tracking UFOs …”).\n\n“The most powerful military doesn’t know what these objects are,” Greenewald said. “That doesn’t mean aliens, or that they don’t have some plausible logical explanation. But … admitting that they see things in the sky and they can’t identify them, that to me is the most amazing part of this.”\n\nIn a subsequent interview with The Post, Gradisher downplayed the significance of the moniker, saying that “unidentified aerial phenomena” was not a new term and that the Navy preferred it to the more popular “UFO” because the latter comes with cultural stigma that might discourage pilots from reporting such incidents for fear of being labeled, well, kooky.\n\nThis year, the Navy overhauled its guidelines for reporting these UAPs to encourage pilots to flag disturbances, which have been occurring regularly since 2014. Gradisher said one possible explanation could be the rise of unmanned aerial systems (or UAS, if you can handle another abbreviation) such as quadrocopters, a kind of drone easily available to the public.\n\n“All of this is about incursions into our training ranges by what we’re calling UAPs,” he said. “These incursions cause a hazard to the safety of our aviators and the security of our operators, and that’s what the Navy’s investigating, these range incursions.”\n\n“These three videos that are out there … reflect three reports of incursions into our training ranges” that occurred in 2004 and 2015, he said.\n\n[Head of Pentagon’s secret ‘UFO’ office sought to make evidence public]\n\nThe three videos, titled “FLIR1,” “Gimbal” and “GoFast,” were initially released by the New York Times and an organization called To the Stars Academy of Arts and Science, which “engages with global citizens to investigate the outer edges of science and unconventional thinking” and was founded by a former member of Blink 182.\n\nThat the eerie footage had emerged along with revelations about a secret and since-shelved Pentagon division known as the Advanced Aviation Threat Identification Program did not exactly staunch speculation that a less-earthly culprit was to blame for these “incursions.” On YouTube, the footage has been watched millions of times.\n\nBlack Vault’s founder, Greenewald, would not speculate whether Gradisher’s comments were further proof of extraterrestrial life, saying he prefers to stick to what the documents he’s obtained via FOIA requests tell him. But the subject of UAPs, or UFOs, or whatever we’re calling them, continues to fascinate him.\n\nThe truth is still out there, and for Greenewald, there was only one way to find it: “We just have to keep asking those questions.\"\n\nRead more:\n\nHow angry pilots got the Navy to stop dismissing UFO sightings\n\nHalf a million people signed up to storm Area 51. What happens if they actually show?\n\nPerspective: UFOs exist and everyone needs to adjust to that fact\n\nHe got 2 million people to say they’d storm Area 51. Now he’s planning an alien festival.", "description": "The Navy admits it doesn't know what the flying objects in some videos are, but it doesn't want to associate its investigations or concerns for pilot safety with speculations on alien life.", "authors": ["Kayla Epstein", "Embedded Audience Editor On The National Desk", "September At Pm", "Kayla Epstein Is The Social Media Editor For National At The Washington Post. She Specializes In Blending Traditional Reporting", "Social Media To Tell Stories", "Engage Readers. She Previously Worked For The Guardian Us", "Where She Worked In Support Of The Pulitzer Prize-Winning Team That Broke The National Security Agency Stories."], "top_image": "https://www.washingtonpost.com/resizer/GCEWX-QO2-c3_MJ82DHcMXGwPi0=/1484x0/d1i4t8bqe7zgj6.cloudfront.net/09-18-2019/t_29aa105b5efc4b41ad7ef91259011697_name_aerial_shot.jpg", "published_at": "2019-09-18"}