{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/google-facebook-and-twitter-tell-biden-campaign-they-wont-remove-defamatory-trump-ad", "downloaded_at": "2019-10-12 11:23:01.712611+00:00", "title": "Google, Facebook, And Twitter Tell Biden Campaign They Won't Remove Defamatory Trump Ad", "language": "en", "text": "Photo: Getty\n\nVice President Joe Biden’s presidential campaign sent requests to Google, Facebook, and Twitter this week asking the companies to remove ads produced by President Donald Trump’s reelection campaign, arguing that the ads make false allegations. All three companies denied the request, explaining that the ads don’t violate their policies—but Facebook’s response was particularly confounding.\n\nThe ad falsely alleges that Biden promised to give Ukraine $US1 (1.47) billion in exchange for firing a prosecutor investigating Biden’s son’s company—a claim that Trump has made many times without presenting evidence. In fact, no one has been able to provide evidence of the claim which originates from a conspiracy-spinning book by Peter Schweizer, an editor at the alt-right blog Breitbart News. According to Bloomberg, Schweizer doesn’t even allege that any crimes were committed in his unproven scenario.\n\nReuters reported that Biden’s campaign sent a letter to the three tech companies and each of them declined to take action because each found that the ad did not violate the rules of any of the platforms.\n\nGizmodo obtained the letters. “[W]e are putting you on notice about the absolute falsity of these claims,” all three letters state. “If President Trump, the RNC, or other third party advertisers allied with the Trump campaign attempt to buy additional advertising to spread these lies, we expect that you will exercise your legal right, consistent with your stated policy, to reject those attempts.”\n\nTwitter and Google spokespersons confirmed to Gizmodo that the ad did not violate either company’s policies. Facebook did not immediately respond to requests for comment, but Gizmodo reviewed a letter that Facebook public policy director for global politics Katie Harbath sent to the Biden campaign in response to the request.\n\nIn the letter, Harbath tries to clarify why Facebook does not believe Trump’s campaign ad violates the platform’s rules by explaining that “when a politician speaks or makes an ad, we do not send it to third party fact checkers,” because Facebook views that as “direct speech.”\n\nFacebook decided last year that it will not fact-check political statements or ads. The company clarified in September that politicians are exempt from their fact-checking policies. Presidential candidate Elizebeth Warren has put this rule on blast in recent days. Facebook and other companies also hide their knowing participation in profiting from false information behind a “newsworthiness” exemption. There might be a stronger argument for that kind of exemption in a case in which a politician just uses their page to say something like anyone else, but Facebook has gone further in acknowledging that it will help magnify false information for a fee.\n\nHarbath’s letter goes on to explain that if a politician shares a “viral hoax” that has been “previously debunked” then Facebook will “demote that content, display related information from fact-checkers, and reject its inclusion in advertisements,” but insists that “is different from a politician’s own claim or statement—even if the substance of that claim” because that makes it “direct speech.”\n\nThis obfuscated messaging provides an unclear answer to Biden’s request. Facebook did not immediately respond to Gizmodo questions that aimed to clarify what Harbath said in her letter, including the question, “Would Facebook run an ad by a prominent politician who claimed ‘Mark Zuckerberg killed his partner in Facebook when he was in college and shouldn’t be trusted?’”\n\nHarbath’s explanation seems to lean heavily on the notion that Facebook will only take action on “previously debunked” stories. It appears to imply that if Facebook promotes a false statement that is debunked after it has begun to spread, it’s fair game to keep raking in money. It also appears to imply that Facebook is happy to magnify any defamatory statement as long as you can’t definitively prove it is not true. For instance, if I were a politician who ran an ad that said “in 1988 Mark Zuckerberg drowned a bag of cats and smeared their blood on his face while alone in the woods,” that would be hard to disprove. But it appears that Facebook would be totally fine accepting money to promote an ad making such claims. We’ll update this post if Facebook disputes any of these points with factual information because we’re not shameless money-grubbing freaks.\n\nHere is the full letter that Harbath sent the Biden campaign:", "description": "Vice President Joe Biden’s presidential campaign sent requests to Google, Facebook, and Twitter this week asking the companies to remove ads produced by President Donald Trump’s reelection campaign, arguing that the ads make false allegations. All three companies denied the request, explaining that the ads don’t...", "authors": ["George Dvorsky", "Victoria Song"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/c6ttl1tfdyrfcwcdvpvc.jpg", "published_at": "2019-10-12"}