{"pub": "politico", "url": "https://politico.com/story/2019/09/18/trump-wisconsin-suburbs-milwaukee-1501805", "downloaded_at": "2019-09-18 10:37:04.669964+00:00", "title": "‘He’s not going to have Hillary Clinton sitting on her hands’: Trump’s uphill battle to hold Wisconsin", "language": "en", "text": "Pro-Trump campaign buttons. Wisconsin's Republican suburban voters will likely to determine the president’s fate in the state. | (AP Photo/Sara Burnett) 2020 elections ‘He’s not going to have Hillary Clinton sitting on her hands’: Trump’s uphill battle to hold Wisconsin Milwaukee’s Republican suburbs have never really warmed up to the president. That could be a big problem.\n\nThey hate Donald Trump’s tweets. They worry about his temperament. They’re still uncomfortable with the name-calling.\n\nBut many voters in Milwaukee’s Republican suburbs like his court appointments. And they approve of his stewardship of the economy.\n\nStory Continued Below\n\nHow those suburban voters square those feelings is likely to determine the president’s fate in Wisconsin, according to interviews with more than two dozen organizers, operatives, and party leaders from both sides in a state that proved crucial to Trump’s upset victory in 2016.\n\nFew expect the three key counties that surround the state’s largest city to vote Democratic next year. But they say the level of enthusiasm for Trump in Wisconsin’s so-called WOW counties — Waukesha, Ozaukee and Washington — matters a great deal in a state where three of the last five presidential elections were decided by less than one percent.\n\nIn the state’s political equation, they serve as a conservative counterweight to the big Democratic margins traditionally delivered by Milwaukee and Madison. Unless that suburban GOP engine delivers it’s own blowout win for Trump next year, it will be difficult for him to capture the state a second time.\n\n“For the president to win Wisconsin again, he’s not going to have the free ride he had last time. He’s not going to have Hillary Clinton sitting on her hands,” said Brandon Scholz, former executive director of the Wisconsin Republican Party. “He’s going to have a completely engaged opposition party on the ground.”\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nClinton famously never made it to Wisconsin, where her failure to campaign is widely believed to have cost her a state that had not voted Republican for president since 1984 — less than 23,000 votes ultimately decided the contest.\n\nDemocrats are determined not to make that tactical mistake again. The national party pointedly placed its nominating convention next summer in Milwaukee — where a 19 percent drop in African-American turnout doomed Clinton’s chances in 2016.\n\nLocally, the party is attempting to expand on Clinton’s anemic performance in the WOW counties by tapping into a vein of anti-Trump sentiment that they say is palpable. Democrats have had teams on the ground organizing for months in the suburbs.\n\n“I know if we get 40 percent we almost guarantee a Democrat a victory statewide,” Waukesha County Democratic Party Chair Matt Lowe said. “We’re seeing so many volunteers every day that I don’t think 40 percent is a total pipedream.”\n\nThe Democratic optimism is in part fueled by Trump’s underwhelming 2016 performance in the WOW counties, where ran he behind Mitt Romney’s 2012 pace. Republicans there haven’t entirely warmed to the president since then.\n\n“It isn’t that the Republican Party is withering away in the WOW counties, it was that they weren’t particularly thrilled with Trump and they showed it by not voting for him,” says Charles Franklin, the director of the Marquette Law School poll. “Trump still struggles to get more than 40 percent approval, even in the WOW counties. It really is an open question about whether Republicans have come back to him here.”\n\nDemocratic hopes are also colored by last year’s toppling of GOP Gov. Scott Walker and a Democratic sweep of every statewide office — a humbling defeat for what was once one of the strongest state parties in the country.\n\nThe debacle was emblematic of the political havoc unleashed by the Trump era, which hastened the end of the one-time Wisconsin GOP power triumvirate of Walker, former House Speaker Paul Ryan and former Republican National Committee Chairman Reince Priebus.\n\nOther pillars of the old guard have also seen fit to leave the scene: Suburban Milwaukee Rep. Jim Sensenbrenner, the second longest-serving congressman in the nation and an early Trump skeptic, announced in early September he would not run for re-election. At the local level, activists and county chairs, including in Waukesha County, have also stepped aside.\n\nAaron Perry, a Waukesha alderman, said he grew so tired of Trump and accompanying GOP policies that in June he switched his party affiliation from Republican to Democrat.\n\n“There comes a point where everybody has their own threshold of how much they can take,” Perry said. “We’re getting to the point now where there’s no way he’s gaining supporters. The only way for Trump to go is down.”\n\nThe DNC plans to have its national convention in Milwaukee. | Carrie Antlfinger/AP Photo\n\nWisconsin GOP leaders recognize the threat caused by the suburban unrest. After working to mend party rifts, they are confident the leftward tack of the Democratic field will be enough to unite suburban Republicans behind the president.\n\n“It’s still a work in progress,” said Waukesha County Executive Paul Farrow, a longtime Republican. “But I think the world of the Never Trumpers and the Trump supporters are realizing they probably have more in common than they have in the past. There’s going to be some angst, there’s going to be doubts. But I always tell people: ‘never say never,’ because you never know what the future is going to hold.”\n\nGOP strategist Brian Fahey said he’s already seeing “less sniping” on the ground. And, he says, Republicans who might recoil at Trump’s Twitter habits are now slowly becoming convinced to hold their noses in favor of his position on abortion, guns, immigration and court appointments.\n\n“They don’t like the Twitter, they’re nervous about the tariffs but they’re scared witless about Elizabeth Warren, Bernie Sanders or Pete Buttigieg,” said Fahey, himself a former Never Trumper. “Nothing rallies a diverse group of people like a common opponent.”\n\nThe Trump campaign, which says it has invested heavily in staffing in Wisconsin and in its data program, contends internal tracking data in the WOW counties shows a healthy level of support. According to the campaign, Trump’s net favorability on the economy was at +17.8 in Ozaukee County, +22.9 in Washington and +34.9 in Waukesha.\n\nLocal Republicans contend they’re seeing signs of growing Trump enthusiasm at county fairs and bigger crowds at local organizing events.\n\n“I hear less and less people complaining about the tweets. People want Trump yard signs now. Everybody is trying to get their hands on anything Trump and you’re sold out before your day is over,” said Kathy Kiernan, chairman of the 5th Congressional District GOP. “I believe that the president has truly won a lot of these people over.”\n\nAnimating these Republican voters is the fear that Democrats will take the state and country even farther to the left.\n\n“I think people are afraid of socialism. In my circle of friends, they know what a socialist country looks like and they don’t want it,” Kiernan said. “That’s one thing about President Trump, this man truly loves this country and there’s no doubt about that he loves this country.”\n\nBut the heightened level of Democratic enthusiasm across the state means that every suburban GOP skeptic that Trump fails to convert is another vote that his campaign is likely going to have to squeeze out of rural Wisconsin — and it’s not entirely clear how much more he can run up the score there.\n\nWhile Trump won 63 percent of the state’s rural vote in 2016, that support could shift if an economic downturn hits an already precariously perched agricultural industry growing impatient with his trade war.\n\nBrian Reisinger, a GOP strategist and longtime Walker adviser, predicted Trump would easily carry rural Wisconsin, saying it’s been an area of Republican strength in the state for several of the most recent election cycles.\n\n“Farmers and others are supporting what the president is doing with getting tough with China,” Reisinger said. “They trust the president to stick it to China the way nobody has in the past.”\n\n", "description": "Milwaukee’s Republican suburbs have never really warmed up to the president. That could be a big problem.", "authors": ["Natasha Korecki"], "top_image": "https://static.politico.com/26/11/c829486d4916a9736e154fbfada1/190916-trump-wisconsin-ap-773.jpg", "published_at": "2019-09-18"}