{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7559073/Shannade-Clermont-victims-family-breaks-silence-condemn-Instagram-star.html", "downloaded_at": "2019-10-22 16:10:21.029814+00:00", "title": "Shannade Clermont victim's family condemn Instagram star", "language": "en", "text": "The family of the victim of Shannade Clermont has broken their silence exclusively to DailyMail.com to condemn the Kanye West model for leaving the real estate broker to die after he overdosed and stealing his debit card to treat herself to designer clothes.\n\nShannade, one of the Clermont twins, went on a paid 'sugar daddy date' with James Alesi, 42, on January 31, 2017, claiming sometime in the three-hour window of their time together, he became 'very drunk'.\n\nWhen Alesi passed out, the 25-year-old stole his debit card information and left his midtown Manhattan apartment. The next morning, Alesi was found dead of an overdose of cocaine and fentanyl.\n\nIn the following months, Shannade used Alesi's debit card details to treat herself to designer clothes, headphones, plane tickets and to pay her bills, attempting to make $20,000 in purchases but only succeeding in buying $5,000 worth of items.\n\nShe was arrested months later in July 2018 and was sentenced to a year in prison this past April after pleading guilty to wire fraud.\n\nNow, in an exclusive statement given to DailyMail.com, Alesi's grieving family blasts Shannade's one-year sentencing and reveals Alesi's toxicology report disputes Shannade's claim he was drunk, as well as likening the model's actions to a 'Hustlers' type scheme.\n\nShannade, one of the Clermont twins, went on a paid 'sugar daddy date' with James Alesi, 42, on January 31, 2017, claiming sometime in the three-hour window of their time together, he became 'very drunk'. When Alesi passed out, the 25-year-old stole his debit card information and left his midtown NYC apartment. The next morning, Alesi was found dead of an overdose of cocaine and fentanyl\n\nShannade used Alesi's debit card details to treat herself to designer clothes, headphones, plane tickets and to pay her bills, attempting to make $20,000 in purchases and succeeding in buying $5,000 worth of items. She was arrested months later in July 2018 and was sentenced to one year in prison this past April after pleading guilty to wire fraud\n\nNow, in an exclusive statement given to DailyMail.com, Alesi's (pictured) grieving family blasts Shannade's one-year sentencing, reveals that Alesi's toxicology report disputes Shannade's claim he was drunk, as well as comparing the model's actions to a 'Hustlers' type scheme\n\nGreg Patric Martello, of law firm Martello and LaMagna, said in a statement on behalf of Alesi's family: 'James was a good person. He was not a sugar daddy. He did not know her, as court documents have proved.\n\n'He was with the wrong person the night he died. Shannade Clermont took advantage of him. In our opinion, she's heartless.\n\n'The Alesi family believes Ms Clermont should have called 911 when James fell unconscious.\n\n'Ms Clermont admitted to and plead guilty to using James' debit card to buy luxury items even after his death.'\n\nThe lawyer added on behalf of the Alesis: 'Our family is destroyed. Both of his parents died within six months of James' death, frankly from broken hearts.\n\n'His father, three months to the day of his death and our mother three months later.\n\n'One year is not enough. Instead of remorse, she's using this for publicity.\n\n'We feel this is shameful. We will never recover. Our family will never recover.'\n\nMartello also said Alesi's toxicology report concluded there was no alcohol in his system, only 'a deadly amount of fentanyl in the drugs.'\n\nHe represents that the toxicology report, dated February 2, 2017, stated that 'no ethanol was detected' in Alesi's system the night he died.\n\nThe document was signed by Dr Gail Cooper, the Director of Forensic Toxicology for the Chief Medical Examiner Office of NYC.\n\nThe Alesi family likens Shannade's actions to a 'Hustlers'-type scheme, drawing comparisons to the New York women who partied with men until they were unconscious then stole their credit card information, spending thousands of dollars on luxury items. Pictured: Samantha Barbash (left), the former strip club hostess who reportedly served as the inspiration behind Jennifer Lopez's character in the new film Hustlers (right)\n\nAt Shannade's sentencing, Alesi's older sister summed up her thoughts in a victim impact statement, saying: 'My brother died, and [Shannade] went shopping.' She added that what the social media influencer did 'was all calculated in advance, done out of greed and with malicious intent'\n\nHowever, Shannade's legal team claimed in court that Alesi had been drinking and Shannade even claimed to the New York Post that he became 'very drunk', which is why she became 'annoyed' and left.\n\nThe Alesi family likens Shannade's actions to a 'Hustlers'-type scheme, drawing comparisons to the New York women who partied with men until they were unconscious then stole their credit card information, spending thousands of dollars on luxury items.\n\nThe scandal was recently portrayed in the blockbuster film Hustlers, starring Jennifer Lopez and Constance Wu.\n\nThe family also takes issue with Shannade and her twin sister Shannon cashing in on her prison sentence for publicity.\n\nThe twins continually encourage their fans to purchase a $60 shirt depicting a topless Shannade behind bars, promoting the hashtag 'FreeShannade'.\n\nIn the days before Shannade reported to prison in June, she shared a sultry photo of herself with Shannon, along with the caption, 'Any b***h in our situation would’ve been fold,' and later, 'a minor setback for a major comeback.'\n\nAt Shannade's sentencing, Alesi's sister summed up her thoughts in a victim impact statement, saying: 'My brother died, and [Shannade] went shopping.'\n\nShe added that what the social media influencer did 'was all calculated in advance, done out of greed and with malicious intent.'\n\nThe family also takes issue with Shannade and her twin sister Shannon cashing in on her prison sentence for publicity. In the days before Shannade reported to prison in June, she shared a sultry photo of herself with Shannon, along with the caption, 'Any b***h in our situation would’ve been fold' (pictured)\n\nThe twins continually encourage their fans to purchase a $60 shirt depicting a topless Shannade behind bars, promoting the hashtag 'FreeShannade'\n\nShannade claimed to news organizations that Alesi was her 'sugar daddy' and made it appear the two had known each other for some time and their relationship was ongoing.\n\nDescribing her situation with Alesi, Shannade said, 'I mean, I didn’t love him; I liked him. [He] was just someone who took care of me.'\n\n'From the outside looking in, it looks like I knew he was dead and was like \"haha,\"' Shannade added to the Post. 'And that’s really sick.'\n\nHowever, the Alesi family disputes the two knew each other, claiming the night before he died, it was the first time they met.\n\nAccording to court documents, exchanges of their text messages hint their meeting on January 31, 2017, was their first, with Shannade saying she wanted to see him for the price of $400 which 'was the amount we agreed on.'\n\nAlesi gives her his address, adding: 'I'm a cool dude. You'll have fun. What type of booze do you like? Wine!'\n\nHe then asks her to send another picture of herself because she had deleted him 'on the site', according to court documents.\n\nWhen Shannade arrived to the building around 5.30pm, she gave her name to the doorman as Audrey.\n\nIn court, Shannade's lawyer Jeffrey Lichtman claims that James was 'drinking in front of [Shannade], 'going into the bedroom, disappearing, coming back, disappearing, coming back.'\n\nThe family lawyer also said Alesi's toxicology report concluded there was no alcohol in his system, only 'a deadly amount of fentanyl in the drugs.' He represents that the toxicology report, dated February 2, 2017, stated that 'no ethanol was detected' in Alesi's system. However, Shannade's legal team claimed in court that Alesi had been drinking and Shannade even claimed he became 'very drunk', which is why she became 'annoyed' and left\n\nShannade claimed Alesi was her 'sugar daddy' and made it appear the two had known each other for some time. Describing her situation with Alesi, Shannade said, 'I mean, I didn’t love him; I liked him. [He] was just someone who took care of me' However, the Alesi family disputes the two knew each other, claiming the night before he died, it was the first time they met. Pictured: The twins in a Yeezy advert\n\nAccording to court documents, exchanges of their text messages hint their meeting on January 31, 2017, was their first, with Shannade saying she wanted to see him for the price of $400 which 'was the amount we agreed on'\n\nIn court documents, the prosecutors noted: 'At some point, even the defendant admits that the victim passed out. He was incapacitated.\n\n'There is dispute over what Ms. Clermont knew as to why the victim passed out and was incapacitated, whether it was a result of a drug overdose, whether it was a result of simply being drunk.\n\n'Whatever it was, in her presence, the victim passed out. He was incapacitated.\n\n'Although it is unknown what happened while the defendant was inside the Victim’s apartment for over three hours, the Victim was found dead the next morning from a drug overdose, there were baggies of cocaine and a tablet that contained fentanyl around the apartment, and a loose condom that appeared to have been broken was found on the Victim’s bed. The defendant maintains that the Victim simply passed out on his bed.'\n\nHowever, Shannade told a different story outside court. She told the Post: 'He wasn’t asleep when I left. He was just drunk.\n\n'I have never been around people who have been on heavy drugs, so I didn’t really know.'\n\nAfter Alesi passed out, Shannade found his wallet and 'took or recorded his debit card information and she left,' according to court documents.\n\nIn total, Shannade (right) tried to make $20,000 worth of purchases - even going so far to set up a new email account under Alesi's name so that she could directly transfer money from his account to her own, prosecutors said. She only succeeded in making around $5,000 worth of purchases with the stolen card information\n\nThen she waited six weeks before using Alesi's card information, including attempting to purchase $427 Valentino shoes, a $318 Phillip Plein jacket, $230 Beats headphones, as well as $250 for a gift certificate at a beauty salon,' records show.\n\nIn total, Shannade tried to make $20,000 worth of purchases - even going so far to set up a new email account under Alesi's name so that she could directly transfer money from his account to her own, prosecutors said.\n\nShe only succeeded in making around $5,000 worth of purchases with the stolen card information.\n\nShannade continued to use the card until she was arrested in July 2018.\n\nThe Alesi family said in a court statement that if Shannade didn't steal and use the card information, they 'would have never known it was her that was there that night,' adding it was 'greed and malicious intent' that landed her behind bars.\n\nThe judge said at her sentencing: 'I don't know what happened during the three and a half hours that she was in Alesi's apartment, and I'm not about to ask her now, because I know there is no way she's really answering those questions.\n\n'When faced with a real test of character, Ms. Clermont chose to leave [the victim’s] apartment with his debit-card information without calling 911.\n\n'No foundation, established after her arrest, can account for that lack of character.'", "description": "Shannade Clermont, 25, had a paid date with James Alesi in NYC in 2017. He died of a cocaine and fentanyl overdose. Shannade was sentenced to jail this April for stealing his debit card details.", "authors": ["Cheyenne Roundtree For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/21/19991434-0-image-a-30_1571689199504.jpg", "published_at": "2019-10-22"}