{"pub": "marketwatch", "url": "https://marketwatch.com/story/trump-campaign-capitalizes-on-impeachment-threat-raising-millions-from-supporters-this-week-2019-09-26", "downloaded_at": "2019-09-26 23:46:42.757646+00:00", "title": "Trump campaign capitalizes on impeachment threat, raising millions from supporters this week", "language": "en", "text": "The Trump 2020 campaign has been working this week to capitalize on the impeachment inquiry launched by House Speaker Nancy Pelosi, asking donors to contribute to an “Impeachment Defense Task Force” and attracting millions of dollars in donations.\n\nState-level Republican groups are fundraising off House Democrats’ impeachment effort as well, with the Nevada Republican Party offering donors a T-shirt that says “Impeach This” and shows a 2016 election map. The Nevada GOP said the money raised would be split between the state party and Trump’s campaign.\n\nRelated: Trump-branded straws sold as alternative to ‘liberal’ paper version\n\nThe Trump campaign and Republican National Committee together raised $5 million in the 24 hours after Pelosi announced the impeachment inquiry, said Brad Parscale, the president’s campaign manager, in a tweet on Wednesday. Parscale’s tally came after another campaign official said the “Impeachment Defense Task Force” raised $1 million in the first three hours after the House speaker’s announcement on Tuesday.\n\n“Next to @realDonaldTrump, Democrats are our best fundraisers! Thanks, Nancy!,” said the Republican National Committee’s chief of staff, Richard Walters, in a tweet on Wednesday. Walters estimated the Trump campaign and RNC had raised nearly $30 million in the past week.\n\nRelated: Pelosi announces Trump impeachment inquiry, saying ‘no one is above the law’\n\nAnd see: Trump warns of stock market crash as he rails against impeachment\n\nTo be sure, Democratic donors also have shown this week that they are energized to give to their party. The company that handles most online Democratic donations, Act Blue, scored $4.6 million in contributions on Tuesday, according to a New York Times report. That haul ranked as one of the bigger fundraising days in recent months that wasn’t tied to a debate or monthly deadline, the report noted.\n\nCalifornia Sen. Kamala Harris was among the Democratic presidential hopefuls who talked up the impeachment effort with supporters. Her team said the following in a fundraising email on Wednesday: “Trump’s campaign is already ramping up attacks on anyone who supports impeachment, including Kamala. We need to be ready to fight back. Will you pitch in to help reach our goal of raising $1 million online before the crucial FEC deadline on September 30?”\n\nThe third quarter ends on Monday, Sept. 30, and campaigns are likely to start revealing their hauls then, ahead of an Oct. 15 deadline when totals must be disclosed to the Federal Election Commission.\n\nRelated: Biden, Sanders and Warren reveal Q2 fundraising figures that trail Buttigieg’s\n\nAnd see: The aggressive fundraising and spending of the 2020 Democrats — in one chart\n\nTrump himself took part in two previously scheduled fundraising events in New York on Wednesday and Thursday. He had been expected to get about $8 million for his re-election and other GOP campaigns at the events, one of which was at the home of hedge fund billionaire John Paulson.", "description": "The Trump 2020 campaign has been working this week to capitalize on the impeachment inquiry launched by House Speaker Nancy Pelosi, asking donors to...", "authors": ["Victor Reklaitis", "Money", "Politics Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS152_impeac_ZG_20190926144231.jpg", "published_at": "2019-09-26"}