{"pub": "metro", "url": "https://metro.co.uk/2019/10/28/brexit-delayed-many-brexit-extensions-10996922", "downloaded_at": "2019-10-28 13:27:59.535151+00:00", "title": "Is Brexit delayed and how many Brexit extensions have there been?", "language": "en", "text": "President of the European Council, Donald Tusk, announced a new Brexit extension today (Picture: EPA/OLIVIER HOSLET)\n\nThis morning, on Monday 28 October 2019, the president of the European council Donald Tusk announced that the EU had agreed to a Brexit extension.\n\nThe announcement comes after the UK requested that a new, extended, deadline be set, following the vote by Conservative and Labour MPs to block a no-deal Brexit.\n\nThis means that Brexit has been delayed again, now until 31 January 2020, which is the new deadline, although the UK do still have the option to leave the EU earlier if a deal is approved and backed by Parliament before then.\n\nFollowing the decision by Tusk and European ambassadors, he tweeted: ‘The EU27 has agreed that it will accept the UK’s request for a new flextension until 31 January 2020. The decision is expected to be formalised through a written procedure.’\n\nHow many Brexit extensions have there been?\n\nAdvertisement\n\nAdvertisement\n\nWhile it may feel like a lifetime since the polarising Brexit vote in June 2016, it has in fact been just over three years since the UK voted to leave the EU.\n\nAfter taking over from David Cameron, Theresa May triggered Article 50 in March 2017, formally beginning what was at the time meant to be a two year countdown towards the UK leaving the EU. This would have set the original Brexit date as being in March 2019.\n\nAfter Theresa May suffered the worst defeat in modern parliamentary history, losing 432 votes to 202 when she attempted to get her Brexit deal ratified by Parliament in January 2019, the deadline for Brexit was then extended to 31 October 2019. May failed a total of three times to get her Brexit deal through Parliament, before resigning in July 2019.\n\nThe UK’s EU membership was meant to end either way, with or without a deal, this week on October 31 2019, but in September MPs voted to back a bill that blocked a no-deal Brexit. The bill was supported by both Labour and Conservative MPs and forced our current Prime Minister Boris Johnson to ask the EU for a second Brexit deadline extension.\n\nThe president of the European Parliament, David Sassoli, said the Brexit extension was ‘positive’ and ‘gives time for the UK to make clear what it wants’.\n\nMORE: EU agrees to delay Brexit until January next year\n\nMORE: What does flextension mean and what is the new Brexit date as EU confirms delay?", "description": "This morning, on Monday 28 October, the president of the European council, Donald Tusk, announced the EU's decision on a Brexit extension.", "authors": ["Rachael Martin"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_90477678_1572262700.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-28"}