{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7557585/Lily-Allen-cuts-chic-figure-camel-coat-puffs-cigarette-night-out.html", "downloaded_at": "2019-10-10 08:37:13.320092+00:00", "title": "Lily Allen cuts a chic figure in a camel coat as she puffs on a cigarette during a night out", "language": "en", "text": "She recently revealed that she was set to release new music.\n\nAnd ahead of her chart return, Lily Allen cut a chic figure during a night out with a pal as they left Soho House in White City, London on Wednesday night.\n\nThe singer, 34, wrapped up against the autumn chill in a stylish camel coat as she puffed on a cigarette while making their way down the street.\n\nChilling: ahead of her chart return, Lily Allen cut a chic figure during a night out with a pal as they left Soho House in White City, London on Wednesday night\n\nLily teamed her cosy outerwear, which featured a leopard print, studded collar, with a pair of black jogging bottoms and chunky, monochrome trainers.\n\nThe Not Fair hitmaker finished her ensemble with a black, cross-body bag and clutched her mobile phone as she cheerfully took a breather with her friend.\n\nThe star appeared to go make-up free for the occasion, while she styled her brunette tresses into a sleek bob.\n\nHer outing comes days after she offered to pay some of her fans to promote her new tracks and took to Instagram to share a sultry topless video in the bath last Wednesday.\n\nNight out: The singer, 34, wrapped up against the autumn chill in a stylish camel coat as she puffed on a cigarette while making their way down the street\n\nSnug: Lily teamed her cosy outerwear, which featured a leopard print, studded collar, with a pair of black jogging bottoms and chunky, monochrome trainers\n\nThe singer wrote in a series of text posts that she'll transfer some cash to her followers if they 'hawk' her music, but joked that they're going to be 'sick of the teasing' ahead of the music's release on Friday.\n\nIn a series of posts, Lily confirmed to fans that the release of her music was just days away. She wrote: 'I have a song coming out on Friday so brace yourselves for some tedious promotional teasers.\n\n'I am gonna ram this s**t down your damn phone throats. You're gonna be so sick of the teasing you're gonna have to stream it, in the hope that the promotion will stop.'\n\nLily then made the playful suggestion that perhaps fans could promote her new songs, after joking that she didn't have 'influencer friends' that she could call on.\n\nShe wrote: 'Also I'm gonna pay my influencer friends a s**t ton of money to promote the hell out of it too.\n\nKeeping warm: The Not Fair hitmaker finished her ensemble with a black, cross-body bag and clutched her mobile phone as she cheerfully took a breather with her friend\n\nDistracted: Lily and her friend busied themselves on their phones as they waited outside\n\nCheeky: Her outing comes days after she offered to pay some of her fans to promote her new tracks and took to Instagram to share a sultry topless video in the bath last Wednesday\n\n'Actually I don't have any of those kind of friends but hey, if you want some money to hawk my music send me your Paypal and I'll get the digital assets over to you.'\n\nIt is not clear whether Lily was joking or being serious in her suggestion.\n\nFollowing the series of posts, Lily also put on a sultry display as she relaxed in the bath, and appeared to go topless as she enjoyed the relaxing dip.\n\nAs she struck several playful poses for the camera, the Carly Simon track You're So Vain could be heard playing the background.\n\nLast month, Lily and Stranger Things star Davie Harbour were out together to watch the contest between heavyweight Alexander Povetkin and Hughie Fury.\n\nSources later claimed they left the 02 arm in arm, adding further fuel to the rumours that the pair are romantically linked.\n\nFunny: Following the series of posts, Lily also put on a sultry display as she relaxed in the bath, and appeared to go topless as she enjoyed the relaxing dip", "description": "The singer, 34, wrapped up against the autumn chill in a stylish camel coat as she puffed on a cigarette during a night out with a pal as they left Soho House in White City, London on Wednesday.", "authors": ["Niomi Harris For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/08/19527542-0-image-a-14_1570693168262.jpg", "published_at": "2019-10-10"}