{"pub": "yahoo", "url": "https://news.yahoo.com/parent-double-parked-outside-school-133821991.html", "downloaded_at": "2019-10-20 17:14:25.685086+00:00", "title": "Police slam parent for parking outside school despite living 200m away", "language": "en", "text": "Police have slammed a lazy motorist who left their car double parked outside a school despite living just 200 metres away.\n\nThe Toyota driver was handed a £100 fine and three penalty points on their license following the incident outside Bordesley Green School in Birmingham on Friday.\n\nAn officer from Bordesley Green Police spotted the driver’s poor parking while dropping off their child outside the school in the inner-city area.\n\nThey later found out the driver lives just 200 metres away from the school.\n\nPlease remember if you live close enough to the school to walk. THEN WALK. Let's not endanger children's lives @BGPS #saferparking 3 points and £100 fine in the post pic.twitter.com/zMOxhIumWw — Bordesley Green WMP (@BordesleyWMP) October 18, 2019\n\nAnd they took it to social media and posted on Twitter to warn other parents about road safety and the law.\n\nThe police’s post read: \"Please remember if you live close enough to the school to walk. THEN WALK.\n\n\"Let's not endanger children's lives...3 points and £100 fine in the post.\"\n\nREAD MORE FROM YAHOO NEWS UK:\n\nLater they added: \"It transpires that the driver of the Toyota lives less than 200 metres from the school.\n\n\"It would probably be faster to walk, and considerably cheaper.”\n\nIt comes just a month after a survey found that ninety per cent of families and residents living near schools support closing streets to cars “more regularly” to stop their children breathing in polluted air.\n\nWalking and cycling charity, Sustrans, surveyed 954 parents and residents across England, Scotland and Wales.", "description": "Police in Bordesley Green, Birmingham shared a picture of the driver to encourage parents to walk their children to school.", "authors": ["George Martin"], "top_image": "https://s.yimg.com/uu/api/res/1.2/FfR95IvwdY_.z7otZ56FwA--~B/aD0yMTcyO3c9Mjg2MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/cb318130-f33b-11e9-be7f-3fcee611ecaf", "published_at": "2019-10-20"}