{"pub": "yahoo", "url": "https://news.yahoo.com/vietnam-targets-gdp-growth-6-033632353.html", "downloaded_at": "2019-10-21 06:48:04.418509+00:00", "title": "Vietnam Targets GDP Growth of 6.8% in 2020, Prime Minister Says", "language": "en", "text": "(Bloomberg) -- Vietnam seeks to sustain economic growth next year at about 6.8% amid a projected 7% rise in exports, Prime Minister Nguyen Xuan Phuc said.\n\nInflation should stay below 4% in 2020, Phuc told legislators in a speech in Hanoi aired live on television. Overseas sales are set to gain 7.9% this year while inflation will likely average 2.7%-3% in 2019, he said.\n\nGrowth in the Southeast Asian economy accelerated to 7.31% in the third quarter from a year ago, surpassing expectations to reach the fastest pace since the start of 2018. Vietnam is benefiting from rising foreign investment in manufacturing as businesses shift production from China to bypass higher tariffs.\n\nVietnam Becomes a Victim of Its Own Success in Trade War\n\nThe prime minister also reiterated his nation’s stance on the South China Sea, saying that Vietnam will continue to defend its sovereignty and pursue different ways of doing that, including using international laws.\n\nHe also urged the government to accelerate the privatization of state companies and deal strictly with projects that are inefficient or losing money.\n\n--With assistance from Nguyen Kieu Giang.\n\nTo contact the reporter on this story: Nguyen Dieu Tu Uyen in Hanoi at uyen1@bloomberg.net\n\nTo contact the editors responsible for this story: John Boudreau at jboudreau3@bloomberg.net, ;Nasreen Seria at nseria@bloomberg.net, Clarissa Batino\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Vietnam seeks to sustain economic growth next year at about 6.8% amid a projected 7% rise in exports, Prime Minister Nguyen Xuan Phuc said.Inflation should stay below 4% in 2020, Phuc told legislators in a speech in Hanoi aired live on television. Overseas sales are set to gain 7.9% this", "authors": ["Nguyen Dieu Tu Uyen"], "top_image": "https://s.yimg.com/uu/api/res/1.2/rbrKz5PBet18d2gAYE22yg--~B/aD0xMzM0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/c6da83ffe550b30ed185a4150901a667", "published_at": "2019-10-21"}