{"pub": "realclearpolitics", "url": "https://msn.com/en-us/news/politics/white-house-ukraine-expert-sought-to-correct-transcript-of-trump-call/ar-AAJyG4H?li=BBnb4R5", "downloaded_at": "2019-10-30 14:20:10.490640+00:00", "title": "White House Ukraine Expert Sought to Correct Transcript of Trump Call", "language": "en", "text": "© Erin Schaff/The New York Times Lt. Col. Alexander S. Vindman, the top Ukraine expert on the National Security Council, arriving Tuesday on Capitol Hill to testify in the impeachment inquiry.\n\nWASHINGTON — Lt. Col. Alexander S. Vindman, the top Ukraine expert on the National Security Council, told House impeachment investigators on Tuesday that the White House transcript of a July call between President Trump and Ukraine’s president omitted crucial words and phrases, and that his attempts to include them failed, according to three people familiar with the testimony.\n\nThe omissions, Colonel Vindman said, included Mr. Trump’s assertion that there were recordings of former Vice President Joseph R. Biden Jr. discussing Ukraine corruption, and an explicit mention by Ukraine’s president, Volodymyr Zelensky, of Burisma Holdings, the energy company whose board employed Mr. Biden’s son Hunter.\n\nColonel Vindman, who appeared on Capitol Hill wearing his dark blue Army dress uniform and military medals, told House impeachment investigators that he tried to change the reconstructed transcript made by the White House staff to reflect the omissions. But while some of his edits appeared to have been successful, he said, those two corrections were not made.\n\nSign Up For the Morning Briefing Newsletter\n\nColonel Vindman did not testify to a motive behind the White House editing process. But his testimony is likely to drive investigators to ask further questions about how officials handled the call, including changes to the transcript and the decision to put it into the White House’s most classified computer system — and whether those moves were meant to conceal the conversation’s most controversial aspects.\n\n\n\nThe phrases do not fundamentally change lawmakers’ understanding of the call, which was first reported by the C.I.A. whistle-blower whose complaint set off the impeachment inquiry. There are plenty of other examples of Mr. Trump referring to Ukraine-related conspiracy theories and asking for investigations of the Biden family. But Colonel Vindman’s account offered a hint to solving a mystery surrounding the conversation: what Mr. Trump’s aides left out of the transcript in places where ellipses indicated dropped words.\n\nIn hours of questioning on Tuesday by Democrats and Republicans, Colonel Vindman recounted his alarm at the July 25 call, saying he “did not think it was proper” for Mr. Trump to have asked Mr. Zelensky to investigate a political rival, and how White House officials struggled to deal with the fallout from a conversation he and others considered problematic.\n\nHis testimony about the reconstructed transcript, the aftermath of the call and a shadow foreign policy being run outside the National Security Council came as Democrats unveiled plans for a more public phase of the impeachment process. They plan to vote on Thursday to direct the Intelligence Committee to conduct public hearings and produce a report for the Judiciary Committee to guide its consideration of impeachment articles. The measure will also provide a mechanism for Republicans to request subpoenas for witnesses and give Mr. Trump’s lawyers a substantive role in the Judiciary Committee’s proceedings to mount a defense.\n\nSome lawmakers indicated Colonel Vindman would make a good candidate to appear again at a public hearing next month.\n\nIt is not clear why some of Colonel Vindman’s changes were not made, but the decision by a White House lawyer to quickly lock down the reconstructed transcript subverted the normal process of handling such documents, according to people familiar with the matter.\n\nThe note-takers and voice recognition software used during the July 25 call had missed Mr. Zelensky saying the word “Burisma,” according to people briefed on the matter, but the reconstructed transcript does refer to “the company,” and suggests that the Ukrainian president is aware that it is of great interest to Mr. Trump.\n\nUkraine’s prosecutor general, Mr. Zelensky said, according to the document, “will look into the situation, specifically to the company that you mentioned in this issue.”\n\nThe rough transcript also contains ellipses at three points where Mr. Trump is speaking. Colonel Vindman told investigators that at the point of the transcript where the third set of ellipses appears, Mr. Trump said there were tapes of Mr. Biden.\n\nMr. Trump’s mention of tapes is an apparent reference to Mr. Biden’s comments at a January 2018 event about his effort to get Ukraine to force out its prosecutor general, Viktor Shokin. Supporters of Mr. Biden have said Mr. Shokin was widely criticized for his lax anti-corruption efforts. Republicans charge, without evidence, that Mr. Biden was trying to stop an investigation into his son.\n\nColonel Vindman told House investigators Tuesday that he twice registered internal objections about how Mr. Trump and his inner circle were pressuring Ukraine to undertake inquiries beneficial to the president, including of Mr. Biden. After the July 25 call, the colonel reported what happened to a superior, explaining that “I did not think it was proper to demand that a foreign government investigate a U.S. citizen, and I was worried about the implications for the U.S. government’s support of Ukraine,” according to his opening remarks. He added, “This would all undermine U.S. national security.”\n\nHe also described confronting Gordon D. Sondland, the United States ambassador to the European Union, after the envoy pressed Ukrainian officials to help the Trump administration by investigating the Biden family. The colonel said he acted out of a “sense of duty,” and emphasized his military service in his remarks. “I am a patriot,” he said, “and it is my sacred duty and honor to advance and defend our country irrespective of party or politics.”\n\nAs he spoke, House leaders were preparing for what was expected to be significant new private testimony from current and former White House officials in the coming days. On Wednesday, they will hear from two Ukraine experts who advised Kurt D. Volker, the former United States special envoy to the country. On Thursday, Timothy Morrison, the National Security Council’s Russia and Europe director, is scheduled to testify. And on Friday, investigators have called Robert Blair, a top national security adviser to Mick Mulvaney, the acting White House chief of staff.\n\nThere is no recording of the July 25 call by the American side. The White House uses note-takers listening in on the call as well as voice recognition software to create a rough transcript that is a close approximation of the call. But names and technical terms are frequently missed by the software, according to people familiar with the matter.\n\nAfter the call, Colonel Vindman was given a hard copy of the rough transcript to make updates and corrections, according to a person familiar with the matter. Colonel Vindman went through the transcript, made changes and gave his written edits to his boss, Mr. Morrison, according to the person.\n\nBut after the call, Colonel Vindman went with his brother, a lawyer on the National Security Council staff, to see John A. Eisenberg, the council’s legal adviser, to raise his concerns about the conversation.\n\nColonel Vindman declined to detail to investigators his discussions with Mr. Eisenberg, citing attorney-client privilege, according to two of the people familiar with the testimony.\n\nOne explanation for why Colonel Vindman’s changes were not made could be that the transcript had been quickly placed into a highly secure computer system, the N.S.C. Intelligence Collaboration Environment, or NICE system, making it more difficult to alter.\n\nMr. Eisenberg ordered the transcript moved to ensure that people who were not assigned to handle Ukraine policy could not read the transcript, a decision he hoped would prevent gossip and leaks about the call.\n\nPutting the transcript in the secure server would have made it more difficult to make further edits to the document, and in the case of the July call effectively stopped additional changes.\n\nMr. Eisenberg made the decision without consulting with his supervisor, Pat A. Cipollone, the White House counsel. A White House review of the handling of the call is examining if Mr. Eisenberg acted properly in securing the notes.\n\nAdministration officials have said a number of calls between Mr. Trump and foreign leaders were put in the most secure server. But tightened security had been put in place for those calls ahead of time. The Ukraine call was put in the secure server only after the fact.\n\nIn the whistle-blower complaint that was made public, the C.I.A. officer wrote that placing the rough transcript in the server was part of an effort to lock it down, restrict access and a sign that “White House officials understood the gravity of what had transpired in the call.”", "description": "Lt. Col. Alexander S. Vindman, the top Ukraine expert on the National Security Council, told House impeachment investigators on Tuesday that the White House transcript of a July call between President Trump and Ukraine’s president omitted crucial words and phrases, and that his attempts to include them failed, according to three people familiar with the testimony.", "authors": [], "top_image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAJyzhJ.img?h=169&w=300&m=6&q=60&o=f&l=f&x=901&y=259", "published_at": "2019-10-30"}