{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/tv/2019/10/29/hbo-max-streaming-services-announces-launch-date-price-programming/2501638001", "downloaded_at": "2019-10-30 02:26:51.099732+00:00", "title": "HBO Max: Details on launch date, price and programs, including 23 seasons of 'South Park'", "language": "en", "text": "CLOSE\n\nHBO Max will stream all seasons of Comedy Central's 'South Park.' (Photo: WarnerMedia)\n\nBURBANK, Calif. – All episodes of \"South Park,\" two new DC superhero shows and series produced by Mindy Kaling, Elizabeth Banks, Ridley Scott and Conan O'Brien are among the programs HBO Max will offer when it launches in May 2020.\n\nThe new streaming service, showcased during a presentation to investors and analysts Tuesday at the historic Warner Bros. studio lot, will cost $14.99 per month and will be immediately available at no extra charge to about 10 million subscribers who get HBO via DirecTV, AT&T video services and HBO Now when purchased from WarnerMedia.\n\nHBO Max enters a crowded streaming field that already includes Netflix, Amazon and Hulu, with new competitors Apple TV+ launching Friday and Disney+ on Nov. 12. NBC's Peacock service is expected in 2020, too.\n\nAs a final enticement at the end of the two-hour-plus presentation that revealed launch month, price and program information, HBO programming president Casey Bloys announced big \"Game of Thrones\" sequel news: a straight-to-series pickup of \"House of the Dragon,\" a look at the Targaryens 300 years before the events of \"Thrones\" and based on George R.R. Martin's book \"Fire & Blood.\"\n\nHBO viewers will get to meet the ancestors of Daenerys Targaryen (Emilia Clarke) in \"House of the Dragon,\" a new \"Game of Thrones\" series announced Tuesday at an HBO Max presentation. (Photo: Helen Sloan/HBO)\n\nThe $14.99 monthly price matches the fee for current HBO subscribers but is substantially higher than that charged by most competitors, including Apple TV+ ($4.99) and Disney+ ($6.99).\n\nTony Goncalves, one of the executives leading development of the direct-to-consumer service, extolled the value of HBO Max as offering \"more than twice the content of HBO, wrapped in a modern, highly engaging user experience.\"\n\nThe company is in discussions with other cable and wireless distributors to provide \"seamless access\" to their customers, who generally pay about $15 a month for HBO, though the cost varies by provider. \"Those over-30 million HBO subscribers should be able to just download the app, log in and watch. Simple as that,\" he said.\n\nThe new streaming service will open with about 10,000 hours of programming, including the full HBO service and library, programming from the Warner Bros. library and new and acquired content.\n\nMindy Kaling is among a number of bold-faced names who will be producing new series for the HBO Max streaming service. (Photo: Mark Von Holden, Invision/AP)\n\nWhich streamer to watch: Ranked: All the major streaming services, from Netflix to Apple TV+ to Disney+\n\nThat's a smaller number of hours than is offered by some competing services, but WarnerMedia content chief Kevin Reilly emphasized the quality of programming and its ability to hold viewers, from acclaimed HBO original series to a library that will include all episodes of top comedy hits \"Friends\" and \"The Big Bang Theory.\"\n\n'Thrones' comings and goings: 'Game of Thrones' prequel starring Naomi Watts nixed by HBO, reports say\n\nTuesday’s programming announcements included:\n\n• All 23 seasons of “South Park” will be available exclusively on the streaming service in June 2020. Three new seasons will follow, with episodes available on HBO Max 24 hours after their Comedy Central premiere.\n\n• Two new DC superhero shows from Greg Berlanti, the producer behind CW’s “Arrow,” “The Flash” and “Supergirl”: “Strange Adventures,” a one-hour drama focused on characters “from across the DC canon,” and a Green Lantern series.\n\nGina Rodriguez of 'Jane the Virgin' fame will play the title character in 'Bobbie Sue,' a feature film planned for the HBO Max streaming service. (Photo: Jean Baptiste Lacroix, Getty Images)\n\n• “DC Super Hero High,” a half-hour comedy series produced by Elizabeth Banks (“Pitch Perfect”) that focuses on students at a boarding school for gifted youth who don’t realize they will one day become DC superheroes.\n\n• “Rap Sh*t” (working title), a half-hour comedy series from Issa Rae (“Insecure”) about a female rap group from outside of Miami trying to make it in the music industry.\n\nStreaming facts and figures: Streaming showdown: How to decide what's best for you\n\n• “College Girls” (working title), a 13-episode single-camera comedy produced by Mindy Kaling (“The Mindy Project”) about three 18-year-old roommates at Vermont’s Evermore College.\n\n• Five stand-up comedy specials produced by late-night host Conan O'Brien. O'Brien will host two specials that feature short sets from up-and-coming comics while curating one-hour sets from three other comics.\n\n• “Raised by Wolves,” a serialized sci-fi series from acclaimed director Ridley Scott. The 10-episode show “centers on two androids tasked with raising human children on a mysterious virgin planet … as the burgeoning colony of humans threatens to be torn apart by religious differences.”\n\n• “Bobbie Sue,” a feature film starring Gina Rodriguez (“Jane the Virgin) as a “scrappy, headstrong young lawyer” who challenges a client exploiting workers within her company.\n\n• Kids and family programming, highlighted by “Tooned Out,” a hybrid live-action and animated comedy in development from Oscar winner Robert Zemeckis. New animated series include “The Fungies!” and “Tig N’ Seek,” new “Looney Tunes Cartoons” and a “Jellystone” series featuring Hanna-Barbera characters. Classic “Looney Tunes,” “Merry Melodie” and Hanna-Barbera cartoons also are part of the package.\n\n• The first three seasons of Adult Swim’s “Rick and Morty,” under a deal for exclusive streaming rights in the U.S.\n\nHBO Max will launch by offering \"a frictionless opportunity\" for the 10 million non-cable HBO customers to sign up for the new service, with a goal of attracting 50 million subscribers in the U.S. by 2025, said WarnerMedia CEO John Stankey.\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/tv/2019/10/29/hbo-max-streaming-services-announces-launch-date-price-programming/2501638001/", "description": "WarnerMedia executives unveiled major details of the HBO Max streaming service Tuesday during a presentation at the historic Warner Bros. studio lot.", "authors": ["Bill Keveney", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/29/USAT/ed334d29-ec3b-436d-9ff2-d28dee66dfbc-South_Park_Art.jpg?crop=3299,1856,x0,y342&width=3200&height=1680&fit=bounds", "published_at": "2019-10-29"}