{"pub": "townhall", "url": "https://twitchy.com/dougp-3137/2019/10/17/sometimes-its-necessary-to-call-out-bs-richard-grenell-pins-a-big-fake-news-ribbon-on-nbc-news-reporters-fact-check", "downloaded_at": "2019-10-18 03:20:47.113470+00:00", "title": "‘Sometimes it’s necessary to call out BS’: Richard Grenell pins a big FAKE NEWS ribbon on NBC News reporter’s ‘fact check’", "language": "en", "text": "As Twitchy told you Thursday, Vice President Mike Pence announced an agreement with Turkey that would lead to at least a temporary ceasefire in Syria. NBC News’ national security reporter Ken Dilanian then presented this “fact check” based on what he said he’s been told:\n\nFact check: Experts are already saying the US just granted Ergogan everything he wanted, all along, including exclusive rights to patrol the safe zone by air. They are calling this a total capitulation. — Ken Dilanian (@KenDilanianNBC) October 17, 2019\n\nU.S. Ambassador to Germany, Richard Grenell, has previously not been shy about calling out the media, and he did so again when it came to Dilanian’s claim:\n\nSometimes it’s necessary to call out BS. This is one of those times: Dilanian regularly makes stuff up. Most everyone knows this. His political agenda means he uses anonymous sources regularly – and they are fake. He is an opinion writer and should be labeled as such. https://t.co/YqVqU74Gjm — Richard Grenell (@RichardGrenell) October 18, 2019\n\nWell, there it is!\n\nIt’s weird how the same people who bashed Trump as a warmonger are now bashing him for not being a warmonger. — Nathan Acreman (@NateAcreman1) October 18, 2019\n\nHe works for NBC. Nothing more to say. — Pamela Scott (@PamelaS99694909) October 18, 2019\n\n\"Experts say …\" First, the argument is lost when you reference anonymous \"experts\". Second, anyone with first-hand experience knows that \"the experts\" aren't. — Radical Radials (@EchelonRight) October 18, 2019\n\nThe media hasn’t exactly had a banner month covering the Syria story so it’s no wonder their reports are often met with skepticism.", "description": "Ouch.", "authors": ["Doug P.", "Posted At Pm On October"], "top_image": "https://twitchy.com/wp-content/uploads/2018/12/richard-grenell-ap.jpg", "published_at": "2019-10-17"}