{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/oct/04/as-trumps-lies-reach-new-heights-have-the-media-reached-a-tipping-point", "downloaded_at": "2019-10-04 16:56:39.385296+00:00", "title": "As Trump's lies reach new heights, has the media reached a tipping point?", "language": "en", "text": "As the impeachment inquiry closes in, the media faces a challenge in finding new ways to hold the US president accountable\n\nThe question was straightforward enough: in the phone call that prompted a whistleblower’s complaint and triggered the impeachment inquiry now roiling Washington, what exactly did Donald Trump want from the president of Ukraine over his political rival Joe Biden?\n\nJeff Mason, Reuters’ White House correspondent, put that query to Trump at a press conference this week to mark a visit by the Finnish president, Sauli Niinistö. Trump was evasive then, when Mason politely persevered, suddenly turned nasty.\n\n“Are you talking to me?” Trump snarled, as though challenging Mason to a bar brawl. “Did you hear me? Did you hear me? Ask [Niinistö] a question. Don’t be rude.”\n\nIf Mason was startled by Trump’s pugilistic tone, he didn’t show it. He coolly replied: “No sir. I don’t want to be rude. I just wanted to give you a chance to answer the question.”\n\nFacebook Twitter Pinterest Jeff Mason, the White House correspondent for Reuters, remained calm when an exchange between him and Donald Trump turned nasty. Photograph: Rex/Shutterstock\n\n“It’s a whole hoax,” Trump fired back. “And you know who’s playing into the hoax? People like you and the fake news media that we have in this country, and I say the corrupt media because you’re corrupt.”\n\nThe exchange between the incensed president and the stoic reporter captured the vast gulf that has opened up between Trump and, in his words, the “lamestream media”. This week saw him crank up his already fierce hostility towards news outlets, while also unleashing to new heights the torrent of falsehoods and conspiracy theories on social media.\n\nThe more Trump appears to intensify the battle as the impeachment inquiry closes in on him, the more the media face a challenge, and not just of the bar brawl variety. Is it enough to do the job of the traditional journalist, posing questions of the president and faithfully conveying his lies and non-answers?\n\nOr have we reached the point where holding Trump and his surrogates to account through the normal techniques no longer works, given the disdain they so often display towards basic facts?\n\nThis week a growing chorus could be heard proclaiming that exceptional times demand exceptional measures. The first call came from the team around Biden, a leading candidate for the 2020 Democratic presidential nomination who has borne the brunt of false claims from Trump and from his personal lawyer Rudy Giuliani.\n\nFor almost a year now, the former mayor of New York and the man in the White House have been obsessed by the idea that Biden, in his official role as Barack Obama’s vice-president, acted to shield his son Hunter from a corruption investigation inside Ukraine. The theory has been repeatedly debunked.\n\nYet Giuliani has been breathlessly articulating the conspiracy theory to anyone who will listen. Last Sunday he went on a round of the political shows, spreading increasingly lavish falsehoods against Biden.\n\nIn exasperation, two of the Democratic candidate’s top aides sent a letter to major TV channels saying enough was enough. Stop booking Giuliani, they demanded, adding that by giving him airtime they were “allowing him to introduce increasingly unhinged, unfounded and desperate lies into the national conversation”.\n\nThat a political campaign would exert pressure on the networks to silence their arch enemy is not entirely surprising. But the call for a blanket ban on serial liars in Trump’s inner circle is not limited to the political realm; highly respected journalists have waded in too.\n\nMargaret Sullivan, the revered media columnist of the Washington Post, argued that it was time to pull the plug on other Trump surrogates “who are the worst of the inveterate liars”. She singled out Corey Lewandowski, one of Trump’s campaign managers in 2016, who recently told Congress: “I have no obligation to be honest with the media”; and Kellyanne Conway, counselor to the president, who famously invoked “alternative facts”.\n\nTalk of an outright prohibition is unlikely to impress television bookers who see Giuliani et al as an invaluable window on to the thinking of the president. Media observers are also uncertain about calls that come close to the C-word: censorship.\n\n“It’s a mistake to say you will stop putting these people on air,” said Tom Patterson, professor of government and the press at Harvard Kennedy School. “Talk of censorship sends a really bad signal of what the media is all about.”\n\nNews outlets are not obliged to slavishly award airtime to Trump’s surrogates, however, Patterson said. “It’s up to TV channels to think carefully about who they are inviting on their shows and to ask themselves about priorities – if they want to be the gatekeepers, they’ve got to do the gatekeeping.”\n\nThe debate about broadcasting Trump lies also spilled over into social media. Another leading Democratic presidential candidate, Kamala Harris, led the charge, focusing in this case on Trump’s tweets.\n\nKamala Harris (@KamalaHarris) Trump's tweets about the whistleblower represent a clear intent to harass, intimidate, or silence their voice. His blatant threats put people at risk — and our democracy in danger. His account must be suspended.\n\nIt’s certainly been an exceptional week for the tweeter-in-chief. The audacity of the Democrats to launch an impeachment inquiry against him appears to have driven the president so incandescent that his Twitter entries have become markedly more frequent, more peppered with CAPITALS, and more willing to shock. He has used expletives, threatened the whistleblower who he damned as a “spy”, and raised the possible arrest of Adam Schiff, the Democrat leading the impeachment inquiry in Congress, for treason.\n\nThe tweet that caused most distress was his quotation of the grotesque speculation that if he were to lose his bid for re-election next November there would be another civil war.\n\nDonald J. Trump (@realDonaldTrump) ....If the Democrats are successful in removing the President from office (which they will never be), it will cause a Civil War like fracture in this Nation from which our Country will never heal.” Pastor Robert Jeffress, @FoxNews\n\nIt is against that context that Harris made her pitch for Trump’s Twitter feed to be suspended. “These are blatant threats,” she wrote to Twitter’s chief executive Jack Dorsey. “We need a civil society, not a civil war.”\n\nTwitter said it intended to respond to Harris, though has yet to do so. But so far there appears to be no appetite for a blanket ban on Trump or his gang on any major social media platform. That includes Facebook which was also accused this week by the Democratic party of allowing Trump to mislead the American people “unimpeded”.\n\nSpeaking at the Atlantic Festival in Washington, Nick Clegg, the former UK deputy prime minister who is now a communications chief at Facebook, dismissed the idea of mediating political comments. “We don’t believe that it’s appropriate for us to referee political debates and prevent a politician’s speech from reaching its audience.”\n\nIn the absence of any big moves to curtail Trump, whether on television or social media, the fight is likely to be waged on the wings of the public conversation. CNN this week set a precedent that others might follow by refusing to air a Trump campaign ad that repeated blatant falsehoods about Biden and once again heaped scorn on the media.\n\nIt might not yet amount to much, but, if nothing else, it indicates that there is a limit to the “lamestream” media’s patience.", "description": "As the impeachment inquiry closes in, the media faces a challenge in finding new ways to hold the US president accountable", "authors": ["Ed Pilkington"], "top_image": "https://i.guim.co.uk/img/media/58ea3a4e5a7a186656d3f3cde27feaa579e7aebd/0_39_4368_2621/master/4368.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e12df7869b5c71a8da9a10be356083a5", "published_at": "2019-10-04"}