{"pub": "reuters", "url": "https://in.reuters.com/article/us-italy-bio-on-probe/italys-bio-on-ceo-arrested-in-plastic-bubbles-probe-idINKBN1X21S1", "downloaded_at": "2019-10-23 14:56:24.893773+00:00", "title": "Italy's Bio-on CEO arrested in 'Plastic Bubbles' probe", "language": "en", "text": "BOLOGNA, Italy (Reuters) - The head of Italy’s Bio-on (ON.MI) was arrested on Wednesday in a probe into false accounting and market manipulation, just three months after the bio-plastics maker suffered an attack by a short seller fund that erased 80% of its value.\n\nAt a press conference in Bologna a prosecutor said Bio-on CEO and Chairman Marco Astorri had been placed under house arrest as part of the so-called “Plastic Bubbles” investigation.\n\nCo-founder Guido Cicognani and chief auditor Gianfranco Capodaglio were also barred from exercising their profession, he said, adding another six people were under investigation.\n\nThe prosecutor, who said 60% of the company’s capital which was held by the founders had already been seized, asked the court to replace top management at the Bologna-based company.\n\nIt was not immediately clear what the measures meant for the running of the company.\n\nBio-on declined to comment when contacted by Reuters while Astorri, Cicognani and Capodaglio could not immediately be reached for comment.\n\nItalian prosecutors opened a probe in July over alleged market manipulation after U.S. fund Quintessential Capital Management accused the bio-plastics company of accounting irregularities.\n\nBio-on, which says it has developed a process for the production of biodegradable plastic from agricultural waste, has repeatedly denied Quintessential’s accusations and has filed a legal complaint against the fund.\n\nQuintessential has said it has an economic interest in the price movement of Bio-on shares, which typically means it has a short position on the company’s stock.\n\nA number of other funds have also made bearish bets. According to market watchdog Consob, investment funds Engadine Partners, Ennismore Fund Management, Think Investments currently hold a combined short position of 3.7% in the stock.\n\n“FICTITIOUS TRANSACTIONS”\n\nIn a statement on Wednesday, tax police said the probe had shown that “a large part of the revenues booked in the company’s accounts from 2015 to 2018 were false ... while part of the revenues generated by licenses from two joint ventures booked in 2018 were the result of fictitious transactions”.\n\nThe prosecutor accused Astorri of giving false information to mislead investors and boost Bio-on shares.\n\nThe company, which was worth over 1 billion euros before Quintessential leveled its accusations, has today a market cap of less than 200 million euros.\n\nThe Milan stock market said on Wednesday Bio-on shares had been suspended from trading.\n\nBio-on, which produces what it says are environmentally-friendly plastics for the agri-food, design and cosmetics industries, was founded by Astorri in 2007.\n\nThe company, whose customers include consumer goods company Unilever (ULVR.L), (UNA.AS), listed seven year later on Milan’s AIM market, an unregulated segment of the Italian stock exchange dedicated to small and medium-sized companies.\n\n(Graphic: Bio-on shares burst, here)", "description": "The head of Italy's Bio-on was arrested on Wednesday in a probe into false accounting and market manipulation, just three months after the bio-plastics maker suffered an attack by a short seller fund that erased 80% of its value.", "authors": ["Valentina Accardo", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-23"}