{"pub": "heritage", "title": "Wishful Thinking Won’t Change Russia’s Bad Behavior", "url": "https://heritage.org/global-politics/commentary/wishful-thinking-wont-change-russias-bad-behavior", "language": "en", "published_at": "2019-07-02", "downloaded_at": "2019-09-02 07:11:54.913694+00:00", "text": "The Mueller investigation is over. Secretary of State Mike Pompeo has met with President Vladimir Putin in Moscow. Some say the time is right for a thaw in U.S.-Russian relations.\n\nThis is wishful thinking.\n\nNeither the Mueller report nor Mr. Pompeo’s travels has changed the geopolitical facts on the ground in places such as Syria, Ukraine and the southern Caucasus. Russia’s belligerent actions in these places have created tremendous problems for the U.S. and our allies, and until Moscow changes its bad behavior, U.S.-Russian relations will remain fraught.\n\nYet some seem determined to revive President Obama’s “reset” approach of unilaterally extending concessions to the Russian strongman in the hope that his conscience will spur him to make nice with us. And there is no shortage of Putin apparatchiks willing to aid their efforts.\n\nTake Oleg Deripaska, for example.\n\nFor months, the Russian oligarch and Putin confidant has been on a charm offensive in Washington trying to repair his tarnished image. A recent softball interview with The Hill makes it clear that he is trying to get himself and his remaining business interests off U.S. sanctions.\n\nMr. Deripaska has doubtless been encouraged by poor U.S. judgment in the past. Earlier this year, after an extensive lobbying effort, the administration lifted sanctions on two of his companies: aluminum giant Rusal and its parent company, En+. While the rollback surprised many, sanctions on Mr. Deripaska himself were not lifted — nor should they be.\n\nThe U.S. must remain committed to its sanctions against Moscow for three reasons.\n\nFirst, removing economic sanctions will weaken resolve in Europe to stand firm against Russian belligerence. Many countries in the European Union have uncomfortably close economic links to Russiaand are looking for any excuse to reduce sanctions against Moscow. In fact, every six months the EU must vote, unanimously, to continue its sanctions, a requirement that offers ample opportunities for the sanctions to be questioned and dropped. If Europeans see the U.S. wavering, then they are likely to crack too.\n\nSecond, not all Russian companies and businesses are innocent bystanders to Mr. Putin’s adventurism. They often actively enable Moscow’s aggression.\n\nAs the largest Russian producer of aluminum, Rusal is at least partly responsible for supplying the Russian war machine that has run roughshod over Ukraine, Syria and Georgia. Defense companies and contractors are not the only enablers of Russia’s aggression; certain commercial entities also indirectly support Russian foreign policy. Rusal is one.\n\nThird, Mr. Putin relies heavily on the support of his business cronies and would be forced to respond to their discontent. This means attacking the oligarchical system that serves as the foundation of Mr. Putin’s kleptocracy.\n\nKnown as “Putin’s oligarch,” Mr. Deripaska was once the richest man in Russia and the ninth-richest in the world. Oligarchs are key supporters and funders of the Kremlin’s policies at home and abroad, and in many ways they facilitate Mr. Putin’s continued rule. The more pressure sanctions put on them, the more pressure they will put on Mr. Putin.\n\nMr. Deripaska likes to portray himself as an honest businessman who has fallen victim to the Russia collusion hysteria. That’s hooey. He is a Putin chum and an indirect enabler of Russia’s aggression in places like Syria and Ukraine.\n\nRegardless of his connection (or lack thereof) into the specifics of Russia’s meddling in the 2016 U.S. presidential election, policymakers should not lose sight of the bigger geopolitical picture.\n\nU.S. economic sanctions against Russia should not only remain, but they should also be expanded appropriately. We all want better relations with Moscow, but that is unlikely as long as Mr. Putin remains in power. Policymakers must take care to operate in the world we have, not the world we want.", "description": "The Mueller investigation is over. Secretary of State Mike Pompeo has met with President Vladimir Putin in Moscow. Some say the time is right for a thaw in U.S.-Russian relations.\n\nThis is wishful thinking.", "authors": ["Luke Coffey", "Director", "Douglas", "Sarah Allison Center For Foreign Policy", "Luke Coffey Oversees Research On Nations Stretching South America To The Middle East."], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-07/GettyImages-1143817101.jpg?itok=PKzOnb-I"}