{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/jacob-rees-mogg-antisemitism-george-soros-lord-dubs-boris-johnson-a9142756.html", "downloaded_at": "2019-10-04 16:59:03.862699+00:00", "title": "Jacob Rees-Mogg faces sacking calls after Soros remark ‘straight from the far-right’s antisemitic playbook’", "language": "en", "text": "Boris Johnson is facing calls to sack Jacob Rees-Mogg after the Commons leader was accused of making comments “straight from the far right’s antisemitic playbook” during a parliamentary debate.\n\nMr Rees-Mogg has become embroiled in a row over “dog whistle” comments he made about Hungarian businessman George Soros, who he described as the “Remoaner funder-in-chief”.\n\nMr Soros, a Jewish billionaire, has donated money to the Best for Britain campaign – but critics said the decision to single him out was a perpetuation of a common antisemitic trope.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nLabour peer Alf Dubs, who escaped the Nazis on the Kindertransport, described the comments as “straight from the far-right’s antisemitic playbook”.\n\nThe row centres on an exchange between Mr Rees-Mogg and his Labour counterpart Valerie Vaz, who said hedge fund manager Crispin Odey – a backer of a no-deal Brexit – had “made £220m overnight as sterling slumped after the 2016 referendum result”.\n\nIn response, Mr Rees-Mogg said: “I remind her that one of the major funders, allegedly, of the Remain campaign, the Remoaner funder-in-chief, was one George Soros, who made £1bn when sterling crashed out of the exchange rate mechanism, which is five times as much as Mr Odey is said to have made.\n\n“So I fear all she is saying is that Mr Soros is a better hedge fund manager than my good friend Crispin Odey, who is a great friend of mine and, indeed, supporter of mine.”\n\nLord Dubs, a Labour peer, said: “Boris Johnson must condemn his remarks about a Holocaust survivor and remove him from his cabinet.\n\n“Like George Soros, I fled Nazi persecution, and like me, George Soros campaigns for European countries to give sanctuary to refugees today, just as I was given refuge as a child in 1939. Boris Johnson and his government don’t want vulnerable people who they see as being different to them coming to our country.\n\n“Those are the same arguments that were used against me and other Jewish people coming here 80 years ago.”\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nLabour MP David Lammy posted on Twitter: “George Soros ‘funder in chief’ ‘wink’ ‘wink’ ‘nudge’ ‘nudge’.\n\n“Jacob Rees-Mogg don’t think we can’t hear you feeding antisemitic conspiracy theorists with this thinly veiled dog whistle.”\n\nMr Rees-Mogg and the Conservatives have been approached for comment.\n\nLast year, Mr Soros donated £400,000 to the anti-Brexit campaign Best for Britain through his Open Society Foundations.\n\nAmid anger from Brexiteers, Mr Soros then pledged an additional £100,000 to support efforts to fight Brexit.", "description": "Boris Johnson is facing calls to sack Jacob Rees-Mogg after the Commons leader was accused of making comments “straight from the far right’s antisemitic playbook” during a parliamentary debate. Mr Rees-Mogg has become embroiled in a row over “dog whistle” comments he made about Hungarian businessman George Soros, who he described as the “Remoaner funder-in-chief”.", "authors": ["Lizzy Buchan"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/01/17/Rees-Mogg.jpg", "published_at": "2019-10-04"}