{"pub": "marketwatch", "url": "https://marketwatch.com/story/intel-stock-rallies-as-results-outlook-top-street-view-2019-10-24", "downloaded_at": "2019-10-25 00:01:21.609744+00:00", "title": "Intel stock rallies as results, raised outlook top Street views", "language": "en", "text": "Intel Corp. shares rallied in the extended session Thursday after the chip giant’s quarterly results and outlook topped Wall Street estimates and data-center sales showed an unexpected increase in what the company called the best quarter in its history.\n\nData-center group, or DCG, revenue rose 4% to $6.4 billion, while the Street was expecting a drop of 8.5% to $5.62 billion, according to FactSet data.\n\nOn the conference call, Chief Executive Bob Swan said a significant amount of that momentum is coming from AI growth in the data center.\n\n“We are driving meaningful AI revenue inside Intel, now with products spanning from the data center to the edge, we expect to generate more than $3.5 billion in AI-driven data-centric revenue in 2019, up more than 20% year-over-year,” Swan said, but added that the company needs to improve “execution on multiple fronts.”\n\nIntel INTC, +0.99% shares, which had surged as much as 8% after hours, were last up 3.8% in the extended session, following a 1% rise in the regular session to close at $52.23. In comparison, the Dow Jones Industrial Average DJIA, -0.11% closed down 0.1%, the S&P 500 index SPX, +0.19% rose 0.2%, the tech-heavy Nasdaq Composite Index COMP, +0.81% advanced 0.8%, and the PHLX Semiconductor Index SOX, +2.47% closed up 2.5%.\n\nIntel’s largest segment — client-computing, the traditional PC group — came in at $9.7 billion, while analysts expected $9.6 billion from the year-ago period.\n\nIntel expects adjusted earnings of $1.24 a share on revenue of about $19.2 billion in the fourth quarter. For the year, Intel hiked its outlook to adjusted earnings of $4.60 a share on revenue of about $71 billion for the year. Analysts had forecast $1.21 a share on revenue of $18.83 billion for the fourth quarter, and $4.39 a share on revenue of $69.44 billion for the year.\n\n“We expect our second-half PC client supply will be up double-digits compared to the first half and we expect to further increase our PC client supply by mid-to-high single-digits in 2020, but that growth hasn’t been sufficient,” Swan said. “We’re letting our customers down and they’re expecting more from us.”\n\n“PC demand has exceeded our expectations and surpassed third-party forecasts,” Swan said. “We now think the market is stronger than we forecasted back in Q2, which has made building inventory buffers difficult. We are working hard to regain supply/demand balance but we expect to continue to be challenged in the fourth quarter.”\n\nThe company reported third-quarter net income of $5.99 billion, or $1.35 a share, compared with $6.4 billion, or $1.38 a share, in the year-ago period. Adjusted earnings were $1.42 a share. Revenue rose to $19.19 billion from $19.16 billion in the year-ago quarter.\n\nAnalysts surveyed by FactSet had forecast earnings of $1.23 a share on revenue of $18.05 billion.\n\nThe company also said its board approved another $20 billion in stock buyback authorization.", "description": "Intel Corp. shares rallied in the extended session Thursday after the chip giant’s quarterly results and outlook topped Wall Street estimates and data-center...", "authors": ["Wallace Witkowski"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GM743_intel__ZG_20180718150435.jpg", "published_at": "2019-10-24"}