{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/duchess-meghan-shares-throwback-clip-pre-teen-mark/story?id=66207857", "downloaded_at": "2019-10-11 20:09:40.994548+00:00", "title": "Duchess Meghan shares throwback clip of herself as a pre-teen to mark International Day of the Girl", "language": "en", "text": "Meghan, the Duchess of Sussex, has a message for young girls as the world celebrates International Day of the Girl.\n\nInterested in Royal Family? Add Royal Family as an interest to stay up to date on the latest Royal Family news, video, and analysis from ABC News. Add Interest\n\n\"Every girl has potential. She has promise. She has the right to learn, the right to be heard, the right to play and to discover. The right to be exactly who she is,\" Meghan said in a video shared Friday on the @SussexRoyal Instagram account. \"So to each one of you, keep asking questions. Keep pushing forward. Keep shining brightly. Know your worth and know that we are behind you every step of the way.\"\n\nThe video narrated by Meghan also includes a throwback clip of a pre-teen Meghan talking about how she took action at age 11 when she was offended by a commercial for a dishwashing liquid that said in its tagline, “Women all over America are fighting greasy pots and pans.”\n\nMeghan, who grew up in California, wrote a series of letters that she claims changed how women were portrayed in a commercial for dish soap.\n\n\"If you see something that you don't like or are offended by, on television or any other place, write letters and send them to the right people,\" the young Meghan says in the throwback clip. \"And you can really make a difference for not just yourself but lots of other people.\"\n\nThe now Duchess of Sussex also shared in the Instagram post a quote she said in a speech in Cape Town during her recent 10-day tour of South Africa with Prince Harry: “Visualize your highest self, and show up as her.”\n\n\"To all of the young girls reading this today on International Day of the Girl, that quote is for you,\" the post reads.\n\nIt is no surprise that Meghan chose to speak out on a day devoted to women's empowerment. The duchess has made women a focus of her work as a royal, including supporting women-focused charities in the U.K., launching a fashion capsule collection to benefit women and spotlighting women at events both home in the U.K. and abroad.\n\nWhen Meghan had the opportunity to guest-edit British Vogue's September issue this year, she used the platform to spotlight activist women like maternal rights advocate and model Christy Turlington, feminist and actress Yara Shahidi and New Zealand Prime Minister Jacinda Ardern in an issue she named \"Forces for Change.\"\n\nMeghan, a self-described feminist, also advocated for women when she worked as an actress, before she wed Prince Harry.\n\n\"I am proud to be a woman and a feminist,\" Markle said in a 2015 speech in her role as a United Nations Women advocate for political participation and leadership.\n\n\"It isn’t enough to simply talk about equality. One must believe in it,\" she said in the speech. \"And it isn’t enough to simply believe in it. One must work at it. Let us work at it, together, starting now.\"\n\nWhile making a name for herself in Hollywood, Markle worked on women's rights issues with organizations including World Vision, the Myna Mahila Foundation and One Young World, in addition to the United Nations.\n\nOn International Women's Day in 2017, Markle wrote an essay on period shaming based on her experience visiting India as an ambassador for World Vision, a global Christian humanitarian organization.\n\n\"We need to push the conversation, mobilize policy making surrounding menstrual health initiatives, support organizations who foster girls' education from the ground up,\" she wrote in Time magazine. \"And within our own homes, we need to rise above our puritanical bashfulness when it comes to talking about menstruation.”\n\nWhile Meghan was dating Harry, she hinted that she had found her match in him as a feminist.\n\nShe responded to a well-wisher who told her, \"It's great having a feminist in the royal family,\" by saying, \"He's a feminist too,\" in an apparent reference to Harry.", "description": "The Duchess of Sussex took action to support women at age 11.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/meghan-girls-gty-ps-191011_hpMain_16x9_992.jpg", "published_at": "2019-10-11"}