{"pub": "time", "url": "https://time.com/5695026/nba-free-speech-china-hong-kong-tweet", "downloaded_at": "2019-10-08 12:52:45.033917+00:00", "title": "Amid China Backlash, NBA Commissioner Says League Will Support Freedom of Speech", "language": "en", "text": "(TOKYO) — NBA Commissioner Adam Silver said the league is not apologizing for Houston Rockets general manager Daryl Morey’s since-deleted tweet showing support for anti-government protesters in Hong Kong, even after China’s state broadcaster CCTV canceled plans to show a pair of preseason games in that country later this week.\n\nSilver, speaking Tuesday at a news conference in Tokyo before a preseason game between the Rockets and NBA champion Toronto Raptors, went as far as to say that he and the league are “apologetic” that so many Chinese officials and fans were upset by Morey’s tweet and comments that followed — but insisted that Morey has the right to freedom of expression.\n\n“Daryl Morey, as general manager of the Houston Rockets, enjoys that right as one of our employees,” Silver said. “What I also tried to suggest is that I understand there are consequences from his freedom of speech and we will have to live with those consequences.”\n\nAmong those consequences: CCTV said it would not show the games between the Los Angeles Lakers and Brooklyn Nets, who will play Thursday in Shanghai and Saturday in Shenzhen. Basketball is wildly popular in China and those two teams — largely because of LeBron James starring for the Lakers and Chinese e-commerce giant Alibaba’s co-founder Joe Tsai now owning the Nets — would have almost certainly been a huge television draw.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\n“We’re strongly dissatisfied and oppose Adam Silver’s claim to support Morey’s right to freedom of expression,” CCTV said in a statement. “We believe that any remarks that challenge national sovereignty and social stability are not within the scope of freedom of speech.”\n\nThe broadcaster is also reviewing all its cooperation and exchanges involving the NBA, said the statement posted to CCTV Sports’ official social media account.\n\nSilver is going to Shanghai on Wednesday and said he hopes to meet with officials and some of the league’s business partners there in an effort to find some sort of common ground. He said he hopes Chinese officials and fans look at the totality of the impact of the three-decade-plus relationship between the league and their country, and urged them to see his response while acknowledging there are political differences between the countries.\n\n“I’m sympathetic to our interests here and our partners that are upset,” Silver said. “I don’t think it’s inconsistent on one hand to be sympathetic to them and at the same time stand by our principles.”\n\nSilver said the NBA did not expect CCTV to cancel plans to show the Lakers-Nets games. “But if those are the consequences of us adhering to our values, I still feel it’s very, very important to adhere to those values,” Silver said.\n\nThis rift between China and the NBA started late last week when Morey tweeted a now-deleted image that read “Fight for Freedom. Stand with Hong Kong,” in reference to months of pro-democracy demonstrations in the semiautonomous Chinese territory that has been mired in escalating violence between protesters and law enforcement.\n\nEfforts were quickly made to defuse the impact; Rockets owner Tilman Fertitta said Morey does not speak for the Rockets, and Morey returned to Twitter on Monday in an effort to clarify his meaning. But damage was clearly done: at least one Chinese sporting goods company said it was no longer cooperating with the Rockets, NBA streaming partner Tencent — which has a $1.5 billion contract with the league over the next five seasons — said it would not show Rockets games and a sports news website in China said it was no longer covering the team.\n\nFurther complicating the matter is this: China’s best-known basketball player is Hall of Famer Yao Ming, who spent his NBA career with the Rockets. Yao is now the president of the Chinese Basketball Association, which has said it is suspending its relationship with the Rockets as part of the response to Morey’s tweet. The CBA also canceled plans to have the G League affiliates from Houston and Dallas play preseason games in China later this month.\n\n“I’m hoping that together Yao Ming and I can find an accommodation,” Silver said. “But he is extremely hot at the moment, and I understand it.”\n\nA ceremonial NBA Cares event for an educational center in Shanghai with the Nets was canceled Tuesday, though the Nets participated in other events as scheduled. The Lakers were arriving there Tuesday. Silver said NBA Cares would still honor its bigger mission surrounding that event, including providing a gift of new computers.\n\n“How can it be possible to carry out exchanges and cooperation with China without knowing China’s public opinion?” Chinese Foreign Ministry Spokesman Geng Shuang said Tuesday. “NBA’s cooperation with China has been going on for quite a long time, so for what should be said and what should be done, they know best.”\n\nSilver also released a statement prior to his news conference, saying “those who question our motivation” should know that the NBA’s stance is about more than business. Many U.S. lawmakers have called for the league to take action — some even suggesting the games in China should be canceled by the NBA.\n\n“We are not apologizing for Daryl exercising his freedom of expression,” Silver said. “I regret — again, having communicated directly with many friends in China — that so many people are upset, including millions and millions of our fans. At the end of the day, we come with basketball as an opportunity to sell dreams, sell hopes … that we are causing disruption in people’s lives and that we are causing disharmony, that’s something I regret.”\n\nContact us at editors@time.com.", "description": "Amid China backlash, NBA Commissioner Adam Silver said the league won't apologize for Houston Rockets manager Daryl Morey's Hong Kong tweet", "authors": ["Stephen Wade", "Tim Reynolds"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/nba-free-speech-china.jpg?quality=85&w=1200&h=628&crop=1", "published_at": "2019-10-08"}