{"pub": "cbc", "url": "https://cbc.ca/sports/hockey/nhl/nhl-oilers-islanders-recap-0ct-8-1.5313943", "downloaded_at": "2019-10-09 02:41:25.879905+00:00", "title": "CBC Sports", "language": "en", "text": "James Neal had his first career four-goal game and the Edmonton Oilers beat the New York Islanders 5-2 on Tuesday night.\n\nZack Kassian also scored as Edmonton won its first road game of the season and improved to 3-0-0 for the first time in 11 years. Connor McDavid had three assists, Leon Draisatl added two and Mikko Koskinen stopped 25 shots.\n\nAnthony Beauvillier and Matt Martin scored for the Islanders. Semyon Varlamov, signed to a four-year deal in the off-season, made his second start of the season but was pulled in the second period after giving up four goals on 19 shots. Thomas Greiss came on and stopped seven of the eight shots he faced.\n\nBeauvillier got the Islanders on the scoreboard first with a short-handed goal late in the opening period. Edmonton scored twice in the final 2:07 of the first to take the lead, and then padded it with two more in the second.\n\nWith the Islanders trailing 2-1 after 20 minutes, Beauillier nearly tied it three minutes into the middle period, but his shot was stopped by Koskinen.\n\nBeauvillier was sent to the penalty box for cross-checking Darnell Nurse after Nurse had a hard hit on Leo Komarov, and the Oilers took advantage with their second power-play goal of the night. Neal completed his seventh career hat trick as he tipped in a pass from Draisaitl from the left side for his fifth of the season at 6:31 for a two-goal lead.\n\nJames Neal is looking real comfy as an Edmonton Oiler<br><br>He picks up a natural hat trick, then adds one more goal late in the game to bring his total to 6 in just 3 games this season<br><br>Last year with the Flames, he scored 7 goals the entire season <a href=\"https://t.co/XeklLNNQhR\">pic.twitter.com/XeklLNNQhR</a> —@hockeynight\n\nEdmonton pushed the lead to 4-1 just 2:15 later as Kassian tipped a pass by Draisaitl past Varlamov for his third of the season, ending Varlamov's night.\n\nNew York stepped up the pressure with some of its best chances of the game, but Koskinen stopped a slap shot by Ryan Pulock with 7:17 left in the period. A minute later, he turned away attempts by Adam Pelech, Pulock and Jordan Eberle 17 seconds apart.\n\nNeal finished off his big night at 6:51 of the third for his sixth of the season to make it 5-1.\n\nMartin scored with 6:28 left, tipping a pass from rookie defenceman Noah Dobson in his NHL debut.\n\nBrock Nelson appeared to pull the Islanders within two with 3:12 left, but the goal was disallowed after a video review showed he kicked the puck in.\n\nThe Islanders got the first four shots on goal of the game before the Oilers got their first, 7 1/2 minutes in. Edmonton held New York to just two more shots the rest of the period and finished the first with a 13-6 edge.\n\nBeauvillier gave the Islanders the lead with 5:46 to go in the opening period. With Edmonton on a power play, Komarov stole the puck from Draisaitl in the Oilers' zone, spun and sent a pass up to Beauvillier, who was streaking to the net from the left side. Beauvillier skated across the front, deked and put a backhander past Koskinen for his second of the season and first short-handed goal of his career.\n\nNeal tied it with 2:07 left. Derick Brassard had a takeaway for the Islanders, but the puck came off his stick to Neal, who fired it past Varlamov from the right point.\n\nNeal the put Edmonton ahead with a power-play goal after New York's Brock Nelson was whistled for a double-minor for high-sticking. Neal, standing to the right side of the net in front of the goal line, got a pass from McDavid and quickly put it past Varlamov for his fourth of the season with 30.3 seconds to go in the first.", "description": "James Neal had his first career four-goal game and the Edmonton Oilers beat the New York Islanders 5-2 on Tuesday night.", "authors": [], "top_image": "https://i.cbc.ca/1.5314263.1570586648!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/oilers-islanders-hockey.jpg", "published_at": "2019-10-09"}