{"pub": "yahoo", "url": "https://news.yahoo.com/chicago-teachers-strike-shows-offense-100022114.html", "downloaded_at": "2019-10-19 13:31:29.789008+00:00", "title": "The Chicago teachers' strike shows how to go on offense against neoliberalism", "language": "en", "text": "In 2012, when Chicago teachers walked off the job in their first strike in 25 years, the cards were stacked against them, nationally and locally. Today, they’re on strike again – and on the offense against austerity.\n\nSeven years ago, Rahm Emanuel had just been elected mayor and was looking to deal the Chicago Teachers Union (CTU), who he saw as a barrier to privatizing the city’s education system, a crushing defeat. That agenda was shared by both Republicans and Democrats across the country, with a barrage of attacks on teachers’ unions, devastating budget cuts to schools and charter school networks – intended to undercut public schools and do an end run around their unions – rapidly multiplying.\n\nYet after electing a new militant leadership in 2010 that pledged to fight not just for bread-and-butter issues like higher pay but a broad agenda of “educational justice” and opposition to austerity, Chicago teachers won that strike, inspiring educators and workers of all kinds across the country – and planting the seeds of future unrest in schools across West Virginia, Oklahoma, Arizona, Oakland, Denver and elsewhere, in the teachers’ strike wave that kicked off last year.\n\nChicago teachers are again on strike, now against the recently elected mayor, Lori Lightfoot. As in 2012, their demands are focused on burning issues in their schools and the city as a whole rather than simply wages and benefits (a strategy that has been called “bargaining for the common good”). And they’re waging that fight alongside another striking union, SEIU Local 73, which represents bus aides, janitors, classroom assistants and other school staff – many of whom earn below-poverty wages.\n\nCTU’s staffing demands are straightforward: a nurse, counselor, librarian and social worker in every school. The current ratio of students to counselors, nurses and social workers in Chicago public schools (CPS) far exceeds professional association recommendations. The National Association of School Psychologists recommends one psychologist for every 700 students; last year, each CPS psychologist served 1,760. For nurses, the ratio is four times what is recommended; for social workers, nearly five times. The union is also demanding enforceable caps so that classes aren’t overcrowded, which CTU says is the case in nearly a quarter of all Chicago classrooms.\n\nThe union is also connecting its bargaining to the city’s affordable housing crisis, demanding housing assistance for both its members and its students, nearly 16,000 of whom experience homelessness. The op-ed pages of the city’s newspapers have upbraided this proposal, but CTU argues that “to fully support our public schools, we must address the lack of sustainable, affordable housing in our city” – a problem faced by cities throughout the country.\n\nCTU is breaking new ground, both in the kinds of broad working-class demands it is putting forward and by striking alongside SEIU Local 73. Together, the coordinated strikes have put more than 30,000 workers on the picket lines – more than 1% of the city’s population. Yesterday, a sea of CTU red and SEIU purple swarmed the city’s downtown in the afternoon, with thousands on the streets for a mass march after morning school pickets.\n\nThe union is up against Lightfoot, a political newcomer who won office earlier this year by campaigning as a progressive and running on an education agenda that borrowed heavily from CTU’s: an elected school board rather than one appointed by the mayor, a freeze on charter expansion and major investments in public schools. But Lightfoot’s progressive posturing is now running up against tens of thousands striking Chicago teachers and staff who want more than progressive rhetoric – they want hard commitments, put in writing and legally enforceable through their contract.\n\nIf she continues to balk at union demands at the bargaining table, Lightfoot will probably see the goodwill she has maintained from average Chicagoans since taking office disappear. The signs don’t look good for her: a Chicago Sun-Times poll conducted just before the strike shows that the public is backing the CTU over the mayor and school board. The same was true for Rahm Emanuel in 2012.\n\nCritics on the school board and in mainstream media have responded with the common refrain that Chicago is broke and can’t afford such demands. But Chicago is awash in wealth – enough for Lightfoot to approve the giveaway of $1.3bn in public money to luxury real estate firm Sterling Bay for the mega-development project Lincoln Yards. CTU has long argued that the way to pay for their demands is clear: end these corporate giveaways and tax the rich.", "description": "Chicago teachers led the battle against destructive reforms seven years ago – now they’re showing all working people left behind by cuts how to fight‘Together, the coordinated strikes have put more than 30,000 workers on the picket lines – more than 1% of the city’s population.’ Photograph: Xinhua/Barcroft", "authors": ["Miles Kampf-Lassin", "Micah Uetricht"], "top_image": "https://s.yimg.com/uu/api/res/1.2/YY.kGn4Gpl4pC0fdMTAVZQ--~B/aD0zMDA7dz01MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/the_guardian_765/0ea9ff0e092dc246c977f3599fc9672c", "published_at": "2019-10-19"}