{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/chilling-footage-shows-teen-confronted-20670557", "downloaded_at": "2019-10-22 13:29:26.061569+00:00", "title": "Chilling footage shows teen confronted by his killers moments before he is shot dead", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nChilling footage that shows a teenager running for his life before he was shot dead has been released in an anniversary appeal.\n\nEthan Nedd-Bruce, 18, had just left a chicken shop in Greenwich, south east London, when he was attacked, chased and gunned down on October 22 last year.\n\nDetectives believe Ethan was killed in a revenge attack linked to other incidents in the area between two warring criminal gangs.\n\nA year on and they have released CCTV that captures Ethan and his killers who chased him on a motorbike with a pillion passenger and with a silver Ford Kug.\n\n(Image: MPS)\n\nOfficers have also released footage that shows a man walking past the chicken shop seconds before Ethan was attacked at around 9.20pm.\n\nInvestigating officers believe the man could be a vital witness.\n\nDetective Chief Inspector Richard Leonard, who is leading the murder hunt, said: “It is now a year since Ethan was murdered but our work to identify and arrest those responsible has not diminished.\n\n“We know Ethan was attacked as he left a chicken restaurant in Woolwich Road at around 9.20pm that evening.\n\n(Image: MPS)\n\n“One of the images we are releasing shows someone we believe could be a key witness; a white male with a beard holding a mobile phone.\n\n\"We believe he walked past the chicken shop where Ethan was in the moments prior to the first attack.\n\n“This person may well have seen something that could assist our investigation and I would urge him to make contact with officers.\n\n“We are also releasing footage showing the two vehicles Ethan’s attackers used that evening. One is a motorbike with a rider and pillion passenger; the other is a silver Ford Kuga with a number of occupants.\n\n(Image: MPS)\n\n“Both these vehicles were in Woolwich Road at the time of the first altercation and then pursued Ethan into Armitage Road.\n\n“I am keen to hear any information about these two vehicles so we can trace those who used them on the night of the murder.”\n\nPolice arrested a 26-year-old man in Hertfordshire on suspicion of murder in November last year.\n\nHe has been released under investigation.\n\nDCI Leonard continued: “Whatever the motive in this case, Ethan did not deserve to be pursued and attacked in this shocking manner.\n\n(Image: MPS)\n\n“I believe the answer to who is responsible for this attack lies within the local community and I would urge anyone with information to come forward and speak to my team, or if you are apprehensive about speaking to officers, then through the independent charity Crimestoppers.\n\n“Ethan’s death has left his family utterly devastated and they can only begin the healing process once those responsible have been convicted.”\n\nEthan's grieving mother has also made an emotional appeal for information to catch her only son's killers.\n\nShe said: “This atrocity has had such a devastating impact on his father and I, his siblings, the extended family, friends and the community as a whole.\n\n(Image: MPS)\n\n“I urge members of the public, bystanders, witnesses and the community to come forward with any information that you may have that can help this investigation.\n\n“Our hearts are completely broken. Lives have been shattered never to be repaired.\n\n\"Finding the murderers will not bring Ethan back, but it will help to give the family closure that we so deserve.\n\n“We have to put a stop to people thinking they can literally get away with murder.\n\n(Image: MPS)\n\n\"Please! As a mother I have lost my only son...I urge you to help us in this time.\n\n\"This violence has to stop.”\n\nAnyone with information should call the incident room on 0208 721 4622 or contact Crimestoppers anonymously on 0800 555 111.", "description": "Ethan Nedd-Bruce, 18, had just left a chicken shop in Greenwich, south east London, when he attacked, chased and gunned down on October 22 last year", "authors": ["Lorraine King", "Image", "Mps"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20670454.ece/ALTERNATES/s1200/2_One-year-on-from-the-brutal-murder-of-a-teenager-in-Greenwich-detectives-are-releasing-images-and-f.jpg", "published_at": "2019-10-22"}