{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/southampton-vs-chelsea-result-score-mason-mount-goal-lampard-abraham-portsmouth-epl-a9145796.html", "downloaded_at": "2019-10-07 12:18:08.703989+00:00", "title": "Southampton vs Chelsea: Portsmouth-born Mason Mount relishes Blues win over Saints", "language": "en", "text": "Mason Mount was delighted to score at Southampton and help Chelsea go into the latest international break with momentum after they claimed another three points on Sunday.\n\nThe midfielder, who was born in Portsmouth, grabbed the second goal for the Blues in a 4-1 win and enjoyed celebrating in front of the home supporters at St Mary’s.\n\nIt was the England international’s fourth strike of the campaign and helped Frank Lampard’s team make it three wins in eight days before a break in the Premier League schedule.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAfter losing 2-1 to Liverpool at Stamford Bridge on September 22, Chelsea have now secured back-to-back top-flight wins for the first time since April, with three first-half goals against the Saints putting them on their way to south coast success.\n\n“I was born not too far away. Maybe that is why I get that extra special feeling, scoring here and the times I’ve played here I have won, so it’s been a good place for me, but the main focus was winning and we did that,” Mount told Chelsea TV.\n\nShape Created with Sketch. Player ratings: Southampton vs Chelsea Show all 21 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Player ratings: Southampton vs Chelsea 1/21 Angus Gunn 5 AFP via Getty Images 2/21 Yan Valery 5 Action Images via Reuters 3/21 Jan Bednarek 6 Action Images via Reuters 4/21 Maya Yoshida 5 Action Images via Reuters 5/21 Ryan Bertrand 6 REUTERS 6/21 James Ward-Prowse 6 AFP via Getty Images 7/21 Pierre-Emile Hojbjerg 6 Getty Images 8/21 Nathan Redmond 6 AFP via Getty Images 9/21 Shane Long 5 AFP via Getty Images 10/21 Danny Ings 7 Getty Images 11/21 Kepa Arrizabalaga 6 AFP via Getty Images 12/21 Cesar Azpilicueta 6 REUTERS 13/21 Kurt Zouma 7 Action Images via Reuters 14/21 Fikayo Tomori 7 AFP via Getty Images 15/21 Marcos Alonso 8 Getty Images 16/21 Jorginho 7 AFP via Getty Images 17/21 N'Golo Kante 7 EPA 18/21 Willian 6 Action Images via Reuters 19/21 Mason Mount 7 Reuters 20/21 Callum Hudson-Odoi 5 REUTERS 21/21 Tammy Abraham 8 Action Images via Reuters 1/21 Angus Gunn 5 AFP via Getty Images 2/21 Yan Valery 5 Action Images via Reuters 3/21 Jan Bednarek 6 Action Images via Reuters 4/21 Maya Yoshida 5 Action Images via Reuters 5/21 Ryan Bertrand 6 REUTERS 6/21 James Ward-Prowse 6 AFP via Getty Images 7/21 Pierre-Emile Hojbjerg 6 Getty Images 8/21 Nathan Redmond 6 AFP via Getty Images 9/21 Shane Long 5 AFP via Getty Images 10/21 Danny Ings 7 Getty Images 11/21 Kepa Arrizabalaga 6 AFP via Getty Images 12/21 Cesar Azpilicueta 6 REUTERS 13/21 Kurt Zouma 7 Action Images via Reuters 14/21 Fikayo Tomori 7 AFP via Getty Images 15/21 Marcos Alonso 8 Getty Images 16/21 Jorginho 7 AFP via Getty Images 17/21 N'Golo Kante 7 EPA 18/21 Willian 6 Action Images via Reuters 19/21 Mason Mount 7 Reuters 20/21 Callum Hudson-Odoi 5 REUTERS 21/21 Tammy Abraham 8 Action Images via Reuters\n\n“Obviously it’s brilliant to get two league wins going into the international break and hopefully we can keep this going.”\n\nOn his ankle, which was strapped up post-match, Mount added: “It’s just precautionary, trying to keep the swelling down. You always get a bit of swelling when you’ve had an injury, but I’m fine and having four boys going (to England duty), we’re looking forward to it and buzzing.”\n\nLampard echoed Mount’s sentiments about finishing strongly before his players left Cobham to link up with their national teams.\n\nTammy Abraham celebrated his England recall with the opener in the 17th minute, poking over Angus Gunn and getting enough on the ball for it to cross the line before Southampton defender Maya Yoshida could clear.\n\nIt was his ninth goal of the season and the former Aston Villa loanee, who is joint-top of the Premier League scoring charts with Sergio Aguero, continues to justify the faith of his manager despite competition in the form of Olivier Giroud and Michy Batshuayi.\n\n“When people are in good form, you talk about things happening for them and for me that is down to how Tammy has handled himself all season from the early moments of pre-season and when people were questioning him in different ways,” Lampard said.\n\n“I trusted Tammy at the start of the season and I felt it was his time to come back to Chelsea.\n\n“I know people will talk about the circumstances (transfer fan), but he also has Oli Giroud as a World Cup winner and Batshuayi – a top class Premier League striker in my opinion – is there.\n\n“Tammy has made the place his own in the short-term, but he has to keep going because competition is key. Over the course of the season we will need everyone. He deserves this great week and deserves this start to the season, but I’ll keep on him because I want more.”\n\nCallum Hudson-Odoi created Abraham’s opener in his first league start since April after an Achilles injury. The 18-year-old has only played four games this term, but has provided an assist or scored in every fixture.\n\nLampard added: “I thought Callum did well, it was a great assist for Tammy’s goal and a great ball. His work rate was good.\n\n“He will get better because he has had a serious injury. Fitness has been a bit of an issue and looking after him, but now he is showing he is getting towards match fitness.”\n\nSouthampton have now lost three of their last four games, with their only victory in that run being a 4-0 Carabao Cup win over Portsmouth. Danny Ings pulled one back for the hosts in the 30th minute, but N’Golo Kante and Batshuayi added further goals for the visitors.\n\nSaints boss Ralph Hasenhuttl said: “When you don’t take points or get wins, you struggle a little bit and the belief starts to go down.\n\n“It is not enough to win in the cup against a League One team (Portsmouth), the Premier League is different. We are not quick enough in our mind or disciplined enough in situations and then against strong teams, you don’t have any chance.”\n\nPA", "description": "Mason Mount was delighted to score at Southampton and help Chelsea go into the latest international break with momentum after they claimed another three points on Sunday. The midfielder, who was born in Portsmouth, grabbed the second goal for the Blues in a 4-1 win and enjoyed celebrating in front of the home supporters at St Mary’s.", "authors": ["George Sessions"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/06/16/Mason-Mount.jpg", "published_at": "2019-10-07"}