{"pub": "cnn", "url": "https://bleacherreport.com/articles/2859055-cowboys-ezekiel-elliott-after-win-we-dont-give-a-f-k-what-doug-pederson-says?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-10-21 14:57:43.339582+00:00", "title": "Cowboys' Ezekiel Elliott After Win: We Don't Give a F--k What Doug Pederson Says", "language": "en", "text": "Ron Jenkins/Associated Press\n\nPhiladelphia Eagles head coach Doug Pederson thought his team would be in first place in the NFC East following Sunday's game against the Dallas Cowboys.\n\nEzekiel Elliott and Co. had different plans.\n\n\"Honestly, we don't give a f--k what Doug Pederson says,\" Elliott said after a commanding 37-10 victory, per Marcus Hayes of the Philadelphia Inquirer.\n\nElliott's comments come after Pederson didn't hesitate to express confidence in his team after last week's loss to the Minnesota Vikings. He appeared on 94WIP and said the Eagles would be in first place after winning in Dallas:\n\nFirst place was at stake in the showdown between 3-3 teams, and Elliott, Dak Prescott and the rest of the Cowboys wasted little time seizing control and capitalizing on home-field advantage.\n\nElliott finished with 111 rushing yards, 36 receiving yards and a touchdown, while Prescott threw for 239 yards, a touchdown and an interception.\n\nThe quarterback also scored a touchdown on the ground.\n\nPhiladelphia couldn't do anything right on the offensive side of the ball, either. Carson Wentz was sacked three times and faced constant pressure as he threw for 191 yards, one touchdown and one interception. He also lost two fumbles as part of four turnovers from the visitors.\n\nThe game was never in doubt after Brett Maher drilled a 63-yard field goal to end the first half, as Dallas won its fourth straight game against its division rival.\n\nPederson's confidence didn't seem misplaced at the time because the Cowboys entered the contest riding a three-game losing streak. They had the look of a team that could beat poor competition in the Miami Dolphins and Washington but couldn't stack up against fellow playoff contenders.\n\nIf there is a silver lining for the Eagles, it is the fact they are still just one game behind the Cowboys for first place in the NFC East even at 3-4. They would be multiple games back in the loss column in every other division in the league but are just one win and a Cowboys loss away from being tied atop the standings.\n\nThe rematch is Dec. 22 in Philadelphia.", "description": "Philadelphia Eagles  head coach Doug  Pederson  thought his team would be in first place in the NFC East following Sunday's game against the  Dallas Cowboys .      Ezekiel Elliott  and Co...", "authors": ["Scott Polacek"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/834/201/hi-res-0553860304864ee245e8696880418c14_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-21"}