{"pub": "reuters", "title": "Explainer: Saudi Arabia struggles to hold Yemen coalition together as allies face off", "url": "https://in.reuters.com/article/yemen-security-explainer/explainer-saudi-arabia-struggles-to-hold-yemen-coalition-together-as-allies-face-off-idINKCN1VN0ZM", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:06:30.386315+00:00", "text": "RIYADH/DUBAI (Reuters) - Saudi Arabia is struggling to hold together a military coalition fighting Iran-aligned Houthis in Yemen after local allies turned on each other in a power struggle that has strained Riyadh’s alliance with its main regional partner, the United Arab Emirates.\n\nFILE PHOTO: A man inspects an oil tanker truck set ablaze during recent clashes between Yemeni southern separatists and government forces near Aden, Yemen, August 30, 2019. REUTERS/Fawaz Salman/File Photo\n\nThe UAE, the second power in the coalition, has openly intervened on behalf of southern separatists battling the Saudi-backed government for control of the south, launching air strikes on government forces trying to regain their interim seat of power in Aden port.\n\nThe escalation risks further fracturing the Saudi-UAE alliance and emboldening the Houthi movement, which the coalition was formed to fight. The United Nations is trying to restart talks to end the 4-1/2 year conflict, largely seen as a proxy war between rival powers Saudi Arabia and Iran.\n\nWHAT’S HAPPENING IN SOUTHERN YEMEN?\n\nUAE-backed separatists, who seek self-rule in the south, seized Aden, base of President Abd-Rabbu Mansour Hadi’s government, in early August after they accused a party allied to Hadi of complicity in a Houthi assault on their forces.\n\nThe two sides were nominal allies under the Western-backed, Sunni Muslim coalition that intervened in Yemen in March 2015 against the Houthi group, which ousted Hadi from power in the capital Sanaa in 2014. But they have rival agendas.\n\nSaudi Arabia and the UAE called for talks to resolve the crisis. Hadi’s government insisted that separatists first cede control and that the UAE stop supporting southern fighters it has armed and trained.\n\nThe separatist Southern Transitional Council (STC) said it would not withdraw until the Islamist Islah party and northerners are removed from power in the south.\n\nSTC fighters tried extending their reach in the south but were repelled by government forces. Those forces tried to retake Aden but retreated when UAE warplanes attacked them. Abu Dhabi said it targeted “terrorist organisations”.\n\nThe UAE criticised Hadi’s government as ineffective and called for a more inclusive one as separatists reinforced their positions in Aden. Hadi, who resides in Riyadh, asked Saudi Arabia to stop what he called UAE interference.\n\n“Saudi Arabia finds itself in a quandary. Aggressive Saudi action to rein in the STC could trigger a civil war within a civil war in which Riyadh’s allies are far from sure to prevail,” the International Crisis Group said in a recent brief.\n\n“Conversely, failure to act or offering what the government considers overly generous concessions to the STC ... could sow dissent within the Hadi government and Islahi ranks.”\n\nWHAT DOES THIS MEAN FOR THE COALITION?\n\nSaudi Arabia formed the alliance to neutralise the Houthis, who it feared Shi’ite Muslim Iran would use to build influence along its border. The current crisis makes it harder for Riyadh to weaken the Houthis, who hold most major urban centres and point to the Aden standoff as proof that Hadi cannot rule.\n\nThe Houthis, meanwhile, stepped up attacks on Saudi Arabia, twice hitting energy assets in the world’s top oil exporter.\n\nThe UAE, which led the coalition’s limited gains in the war, scaled down its presence in Yemen in June as Western criticism of the coalition mounted, saddling Saudi Arabia with an unpopular war.\n\nThe Sunni Muslim allies joined forces in Yemen and beyond to contain common foe Iran and Islamist movements they see as a threat to their dynastic rule. Abu Dhabi and Riyadh said their alliance remains strong, but differences emerged as the UAE moved to protect its image and interests.\n\nThe UAE drawdown aimed to cast Abu Dhabi as the more mature partner and peacemaker, diplomats said, as Western allies pressed for an end to the war that has killed tens of thousands and pushed Yemen to the brink of famine.\n\nAbu Dhabi said its decision was a natural progression given a U.N.-sponsored truce in the contested main port of Hodeidah in the west, which the coalition twice tried to seize last year. It said this new stage required political, not military tactics.\n\nDiplomats say it was because the UAE accepted there could be no military solution due to global criticism of coalition air strikes that have killed civilians and the humanitarian crisis. Heightened U.S.-Iran tensions, which risk triggering a war in the Gulf, precipitated the move.\n\nHOW DID IT REACH THIS POINT?\n\nThe UAE built a force of 90,000 Yemeni fighters, including thousands of separatists, to battle the Houthis and Islamist militants. It was those forces who expelled the Houthis from the south, where the movement has no traction.\n\nBut the war, which has been in military stalemate for years, revived old strains between north and south Yemen, separate countries that united into a single state in 1990.\n\nThis is not the first separatist uprising. They briefly seized Aden in January 2018. Riyadh and Abu Dhabi helped end that standoff as the focus of the war shifted to Hodeidah, the Houthis’ main supply line and a lifeline for millions.\n\nSlideshow (2 Images)\n\nAs military options faded, the UAE focus switched to U.N. efforts toward a political solution. While Saudi Arabia wants to remove the Houthi threat and secure its borders, the UAE’s main concern has been stamping out Islamist militants and securing Red Sea shipping lanes, analysts say.\n\nAbu Dhabi now supports a reshuffling of Hadi’s government to include the STC and weaken the hold of Islah, which it sees as an offshoot of the Muslim Brotherhood. Riyadh tolerates the party because it props up Hadi, who has no personal power base.\n\nBut the STC may not have broad support. Its move risks igniting infighting in the main area under coalition control and emboldening Islamists militants like Al Qaeda and Islamic State, among Yemen’s many destabilising forces.", "description": "Saudi Arabia is struggling to hold together a military coalition fighting Iran-aligned Houthis in Yemen after local allies turned on each other in a power struggle that has strained Riyadh's alliance with its main regional partner, the United Arab Emirates.", "authors": ["Stephen Kalin", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190902&t=2&i=1425364586&w=1200&r=LYNXNPEF810T9"}