{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/2019/10/16/americans-already-pay-gigantic-hidden-health-care-tax-economists-say", "downloaded_at": "2019-10-16 21:00:45.704341+00:00", "title": "Medicare for all: Americans already pay a ‘gigantic’ hidden health care tax, economists say", "language": "en", "text": "That’s the argument put forth in Emmanuel Saez and Gabriel Zucman’s new book, “The Triumph of Injustice.” The economists at the University of California at Berkeley, who have advised Warren and Sen. Bernie Sanders (Vt.) on the creation of a wealth tax, call private health insurance costs “taxes in everything but name.” They are automatically deducted from workers’ paychecks. And they are essentially mandatory for families that don’t want to be crippled by long-term health-care costs or unexpected illnesses.\n\nAD\n\nAD\n\n“Whether insurance premiums are paid to a public monopoly (the government) or to a private monopoly (the notoriously uncompetitive US private health insurance system) makes little difference,” the economists write. “Both payments reduce the take-home pay of workers; and although it’s always possible to evade taxes or to refuse to pay one thin dime to insurance companies, in practice almost everyone abides.”\n\nThe issue sparked a spirited discussion during Tuesday’s debate in Ohio for the 12 Democrats vying to take on President Trump in 2020, with Warren and Sanders’s plans getting blasted as being overly expensive and unworkable. Warren was specifically called out for refusing to say whether her proposal would result in higher taxes for the middle class or get into how it would eliminate employer-sponsored coverage for 160 million Americans. Although she vowed that her plan would not raise overall costs for the middle class, she notably evaded the specific issue of taxes.\n\nSaez and Zucman have produced an estimate of just how much we’re already paying for health insurance and find that it’s a little north of $1 trillion per year: “close to 6% of national income in 2019 — the equivalent of one-third of all federal income tax payments!” Health insurance costs raise the average effective tax rate on American labor from 29 percent to 37 percent, they said.\n\nThinking about health-care costs in this way is useful, Saez and Zucman write, because it allows for better tax comparisons between the United States and other wealthy countries, most of which fund health care via their tax codes. “Americans on average keep about the same fraction of their pretax income as their European brethren,” they write.\n\nAD\n\nAD\n\nOne of the key uncertainties about transitioning to a Medicare-for-all plan like the ones proposed by Warren and Sanders is whether doing so would raise or lower total health-care costs. Preliminary estimates have so far yielded wildly divergent outcomes, in part, because the financing specifics behind various candidates’ plans are largely still up in the air. How the change would affect the wallet of the typical middle-class tax payer relative to other groups also remains an open question.\n\nBut the Saez and Zucman data underscore that Americans already are paying a large health-care levy that is for all intents and purposes mandatory. And if you consider health insurance costs as a tax on labor, as they do, it means that the extremely rich, who derive most of their income from capital, are carrying a disproportionately light share of the total health cost load.\n\nAD", "description": "We're just paying it to private insurance companies rather than the federal government.", "authors": ["Christopher Ingraham", "Reporter Covering All Things Data"], "top_image": "https://www.washingtonpost.com/resizer/x3p0bNu40oTaZncq-e-e_KLMnts=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GGXZD2HPZEI6TO362IBG5YGBTE.jpg", "published_at": "2019-10-16"}