{"pub": "nymag", "url": "https://thecut.com/2019/09/the-toll-of-me-too.html", "downloaded_at": "2019-09-30 10:43:41.893438+00:00", "title": "Rebecca Traister on the Toll of Me Too", "language": "en", "text": "Photo: New York Magazine\n\nWas it worth it? Is it still? Will it ever be? These questions hover over a conversation about gender and power abuse one year after Christine Blasey Ford testified that she had been sexually assaulted by Supreme Court nominee Brett Kavanaugh in high school; two years after investigative journalists published the accounts of women who’d been harassed and assaulted by Harvey Weinstein; three years after Roger Ailes stepped down as head of Fox News after being accused of harassment and coercion by women on his network; 28 years after Anita Hill testified about what she experienced working alongside Clarence Thomas.\n\nWhat has happened to the people who told their stories has been intense and strange and often difficult. It has included some celebration and relief, sure, but also unwelcome exposure, threats, and thrown drinks and epithets; the undermining of their characters, the misconstruing of their intentions; a realignment of their identities; familial and romantic rifts; money and jobs lost. And through it all, an indifference to these effects from the same public that has used their stories as the raw material of a headline-grabbing, ground-shifting national argument.\n\nWhat is the worth, exactly, of stories that are told mostly by women? To judge the worth, we have to be clear about the cost.\n\nThis fall has offered space for some assessment of all that happened so rapidly. New books have been published, including Jodi Kantor and Megan Twohey’s She Said and, soon, Ronan Farrow’s Catch and Kill, which promises further revelations about the well-oiled systems of protection and complicity. Then there have been warier recapitulations, like a 12,000-word, largely sympathetic profile of Al Franken, who resigned from the Senate after having been accused by eight women of impropriety (a ninth explains here why she didn’t come forward). Aziz Ansari, alleged to have been disrespectful and demeaning during a consensual romantic encounter, has starred in his own Netflix special in which he talks about his experience of being called out. And, of course, there has been plenty of backlash-fueled writing and talking on the radio about the overreach of Me Too, the worry that men were targeted willy-nilly and treated shabbily by a feminist mob.\n\nBut I am interested — concerned, as the Me Too agonistes might say — in what has happened to the women and men who offered up their stories (both since the Weinstein revelations and long before). In doing so, they created the building blocks of a social movement with legal and political implications. We know that some provided literal testimony in front of committees, some spoke on witness stands, some wrote blog posts or gave interviews to reporters or made calls for help — to friends and HR departments and sometimes the police. For some, attempts to testify were ignored, their stories regarded as small or ordinary. For others, more recently, the willingness to speak out about the very same behaviors was heralded as epic, an act of extraordinary courage.\n\nBut even as the press pored over the gruesome details of their accounts, there has been a lack of curiosity about why and how they first stepped forward, what made them open their mouths to speak the unspeakable, and what happened to them after they did: What were the tolls and rewards of having made the choice they did in a world that does not typically reward women for opening their mouths in challenge to power?\n\nThe idea for this project began with one woman’s testimony not about a man but about herself, her life, her experiences in the wake of having spoken up. It was a conversation with Lauren O’Connor, whose own words — in the form of an internal memo she wrote while working at the Weinstein Company about its “toxic environment for women” — were made public not through her own volition but because the document became part of the New York Times’ blockbuster reporting on Weinstein. Nearly two years later, in a casual phone conversation, she spoke quickly, in tumbling sentences, about how changed and chaotic her life had been since; about the literal economic costs of having become a public catalyst for social progress; about her altered professional life, her loss of anonymity and the assaults on her character; and about how, ironically, in the two years since her words had been presented as nationally important, her lived experience of having spoken up and what happened after had remained wholly invisible and unexplored.\n\nO’Connor’s was the first story. And of course, that’s how everything about the revelations of sexual harassment began: one woman’s story, flowering into a few other women’s (and also men’s) stories, eventually creating a super-bloom of horror.\n\nBy and large, those tales of harassment and assault told mostly by women were heard (and are still understood) as stories about men, stories about what powerful (and middling) men had done with their hands or their words or their workplace authority or their penises. We have spent far less time considering those who told the stories that purportedly ruined the lives of these men. How did the storytellers themselves fare?\n\nWhat we found out, I should warn you, is not uplifting. The women who came forward were most often not received as heroic actors who had already suffered real losses and were chancing further degradation and penalty. There has been very little acknowledgment that the risks of speaking up in many ways replicate the risks of harassment itself: the pressures, the humiliations, the possibility of having one’s professional record obscured by smears. Of course, the scale of the harm done to the storytellers differs, as does so much else, depending on their class and race, the stability of their points of entry into a public and perilous conversation.\n\nThose who have spoken up about harassment are often referred to by critics and the men they accused as being part of a mob and even by their admirers as members of a kind of thrilling sisterhood. And some testifiers certainly did speak of the comforts (and obligations) of solidarity as well as how the choice of others to come forward compelled them to do the same.\n\nBut many others described isolation and loneliness. The treatment they’ve received — further abuse, insult, blame, guilt — has made some of them leery of human connection. Despite the fevered view of women jumping hastily onto some party bandwagon, few say they were actually eager to talk about harassment or assault and sometimes delayed saying anything for months or years.\n\nWith the exception of those who were already famous movie stars and the few whose testimony riveted a nation, many who told stories, even on the record, remain largely anonymous, their names quickly forgotten — until a prospective employer Googles them, at least. This stands in contrast to the view expressed by many in a critical press, and by many accused men, that women come forward for personal gain. While the question of whether accused men will get their jobs back has been treated in certain quarters as a moral quandary — a test of our society’s capacity for forgiveness and the possibility of redemption — few have noticed that getting hired again after having gone public about being harassed can prove to be a significant hurdle.\n\nThe idea that the storytellers were all out for some kind of gleeful and vindictive revenge also falls apart as soon as you talk to them at length. Lindsay Meyer, who told of how she was groped and kissed by tech venture capitalist Justin Caldbeck, described her acute awareness of how her testimony “impacted him, his career, his co-investors, the people that had put money into his funds, the other entrepreneurs that he invested in, his family,” and how she’s spent time “crying and feeling some guilt, maybe some pain, maybe some sadness, rooted in empathy for Justin. Which is just fucking twisted, right?”\n\nIt may be fucking twisted, but it’s what we do: We crane our necks to see the wreckage of powerful male careers without even bothering to wonder about the women whose lives and careers those men damaged. Because it was the men who were powerful, some of them already familiar to us, and because they were men whom we have been encouraged to view as fully human, we are led, often unconsciously, to be more fascinated by their stories, to understand them as complex and nuanced and interesting characters, even in their villainy. A scrap of ambiguity entrances us in powerful men, while we find less dramatic or interesting the complexities and internal contradictions of those who stepped forward against them.\n\nAs readers, we have gobbled up every detail in the Chronicles of Chastened Men: Charlie Rose dines alone at his favorite restaurants, and Franken keeps his shades down on sunny days, unable to put out anything more elegant than a tub of hummus and some carrots for a visiting reporter. Ansari’s television special, directed by Spike Jonze, presents him as a flawed and intrinsically interesting anti-hero. Meanwhile, Bill O’Reilly may not be a Fox host anymore, but his books still make the best-seller lists; Mark Halperin isn’t on Morning Joe, but he also has a book coming out. And of course, some men never lost their jobs at all but got promotions: to president and Supreme Court justice.\n\n“I would never do it again, and I would never recommend another woman do it,” says Christie Van, who complained of harassment at the Ford Motor Company and has since been homeless and separated from her son. “Why would I tell someone to go up against a billionaire company like this and destroy their life?”\n\nA colleague recently observed to me that those willing to offer testimony wind up playing the role — and, grimly, understanding the role — of front-line soldiers, pretty surely destined to get sacrificed as part of a larger war in the service of a greater cause.\n\nBut no one treats them as war heroes. No wonder there is the sense from some that none of this was worth it or will ever be worth it. That was, indeed, something I thought about as I watched a recent interview with Ted Cruz on This Week, in which he told host George Stephanopoulos that the Senate Judiciary Committee had “invited” Blasey Ford to testify, making it sound as if the chance to speak about trauma in front of a stone-cold congressional committee and an expectant nation was the extension of some kind of courtesy. In fact, Blasey Ford had had no desire to tell a bunch of senators, let alone the whole country, about the time Brett Kavanaugh had assaulted her as a teenager. Since she did so, her life has been upended; she had to move out of her house because of death threats.\n\nBut then Cruz went on, with malignant dishonesty, to suggest that “the American people heard [Blasey Ford’s testimony], and at the end of the day, the American people made a judgment that the evidence wasn’t there, the corroboration wasn’t there.” I waited for Stephanopoulos to interrupt and correct Cruz, to remind viewers that the American people had made no such judgment, that the Republicans in charge of the Senate Judiciary Committee had voted to put Kavanaugh on the Court, and that in fact more Americans had believed Blasey Ford than had believed Kavanaugh, but Stephanopoulos did not.\n\nI thought about what it must be like for Blasey Ford to listen to Cruz rewrite history, to have the story she’d told, practically against her will, be transmuted from what it was (persuasive, powerful, opinion shifting) to something it was not (unpersuasive, not enough) by a sitting senator, uncorrected by a network news anchor, and I thought, Maybe it wasn’t worth it.\n\nBut then again … Cruz was wrong, not just morally but factually. Perhaps he doesn’t remember, understand, or care about what really happened; that the American people believed the woman who testified and not the powerful man who got the job anyway. But that’s his error; it was important, and their testimony may be changing the way Americans think about power.\n\nAs of this September, almost 60 percent of registered voters thought it likely that Kavanaugh lied under oath, according to the pollster Tresa Undem of Perry Undem, who also found in 2018 that 50 percent of respondents — not just Democrats — said that the Kavanaugh-Ford standoff made them think more broadly about men having more power in government than women, something that Undem has argued “likely had an independent effect on voting for Democratic candidates in the 2018 midterms, above and beyond typical factors such as party affiliation.” Her hunch, she says, is that “power imbalance is not something people ‘unsee.’ ” Undem has just completed new polling that backs up that hunch, finding that half (49 percent) of registered voters still say Kavanaugh’s confirmation led them to want to elect more women — a factor that just might be relevant moving into 2020.\n\nThese stories may be shaking the ground beneath our feet. Whether the powerful remember them or the details, lots of us have heard, read, and absorbed this particular body of civic literature.\n\nWomen’s speech has often been forward-looking, offered up to others who will come after, who will inhabit a world in which we hope women’s experiences, and women themselves, will be worth more. Margaret Atwood, whose new novel, The Testaments, a sequel to The Handmaid’s Tale, is constructed from the fictional testimony of women from inside and outside an oppressive patriarchal and white-supremacist regime, has spoken of the act of storytelling as an act of hope. To write, Atwood has said, is to imagine a future reader, and therefore to imagine a future.\n\nThe women and men who have told their stories are betting on that future and, in speaking up, have left a trace — of themselves, of their lived experience of a world in which power was distributed unequally, in which abuse and harassment were rampant and unchecked. Individually, they have almost uniformly been punished for it, have paid for it to one degree or another. But with their testimony, they have left their mark, an individual sacrifice offered up to a collective future, one in which we should all be worth more.\n\n*This article appears in the September 30, 2019, issue of New York Magazine. Subscribe Now!", "description": "Was it worth it? Is it still? Will it ever be? What has happened to the women and men who offered up their stories (both since the Weinstein revelations and long before)? These questions hover over a conversation about gender and power abuse.", "authors": ["Rebecca Traister"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/26/Magazine/testimonies/testimony_lede_quote_03.w1200.h630.jpg", "published_at": "2019-09-30"}