{"pub": "news24", "url": "https://businessinsider.co.za/taxify-drivers-earn-r8000-a-week-advertisement-2019-2", "downloaded_at": "2019-10-22 20:45:40.539848+00:00", "title": "Taxify scraps ad that claims drivers earn R8000 a week", "language": "en", "text": "Taxify is changing its claim that drivers earn R8,000 on the platform.\n\nThis after a complaint that the advertising was misleading.\n\nThe advertisement will now read “can earn” instead of just “earn”.\n\nTaxify South Africa - the country’s second largest e-hailing service - will amend its advertising, which claimed that drivers earn R8,000 per week.\n\nThis after a complaint with the Advertising Regulatory Board (ARB) about a Taxify Facebook advert that read: “Earn R8,000/week driving with Taxify”.\n\nThe complainant claimed the advertising is misleading.\n\nIn its response to the ARB, Taxify said it was never the intention to mislead everyone and that some of their drivers do earn a gross income of more than R8,000 a week.\n\n“As Taxify does not pay for petrol and other expenses it cannot [however] comment on what the driver’s [total] income is after he has received his payment from Taxify South Africa (Pty) Ltd.”\n\n\n\nTaxify would, therefore, amend the advertisement to read “can earn” instead of just “earn”.\n\nBusiness Insider South Africa previously reported that Taxify drivers earn more from every trip booked compared to Uber South Africa.\n\n\n\nFor every trip, Taxify takes 15% of the fee charged via its platform, numbers it provided shows.\n\nUber, the dominant e-hailing service Taxify is challenging, take a standard service fee of 25% per trip booked, it told Business Insider South Africa.\n\nThat is a R1,000 difference in earnings for every R10,000 worth of trips.\n\nTaxify said it believes in having narrow margins, because it aims to give drivers the most sustainable income possible.\n\nIt recently became the first e-hailing service to expand to East-London and Polokwane.\n\n“We are a driver-focused company. So, when we considered expanding our service we wanted to make sure that the demand is high enough to make sure drivers make the most amount of money,” Gareth Taylor, manager for Taxify in South Africa, told Business Insider South Africa.\n\n“We believe that when our drivers are looked after, our customers are looked after.”\n\nAccording to data from App Annie, Uber has roughly 5.3 million users in South Africa compared to Taxify’s 2.1 million.\n\nThis means Uber controls an estimated 71% of the South African market, followed by Taxify with 28%.\n\nFor more, go to Business Insider South Africa.\n\nReceive a single WhatsApp every morning with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "Taxify takes 15% of the fee charged via its platform, numbers it provided shows.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8018/ff041b132aa3441dabafe54cc03e8f58.jpg", "published_at": "2019-02-22"}