{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/07/ukraine-thousands-flood-kyiv-protest-zelensky-deal-russia", "downloaded_at": "2019-10-07 23:34:25.914885+00:00", "title": "Ukraine: Thousands Flood Kyiv to Protest Zelensky Deal with Russia", "language": "en", "text": "At least 10,000 people flooded Kyiv’s Independence Square on Sunday to protest President Volodymyr Zelensky opting to agree to a deal that may bring elections to eastern Ukraine, which Russia has invaded and colonized.\n\nAmong the protesters – which event organizers claimed numbered between 25,000 and 50,000 people, according to the Ukrainian news agency UNIAN – was former President Petro Poroshenko, who Zelensky, a professional comic, trounced in elections this spring after a whirlwind campaign to eradicate entrenched political interests from the capital.\n\nWith signs reading “no capitulation” and “Putin’s formula,” the protesters demanded that Zelensky walk back an announcement to agree to the “Steinmeier formula,” a deal in which Russia would agree to withdraw all its troops from the occupied Donbas region in exchange for Ukraine to agree to hold an election on self-determination. The agreement is named after the current German president, who proposed it as a solution to the war in eastern Ukraine that has killed 13,000 people and counting.\n\nThe Russian regime has very few legitimate soldiers in the region, instead depending on its proxy militias and guerrilla forces to kill Ukrainian soldiers. Protesters expressed concern that Russia would withdraw only its official soldiers and leave the guerrillas there to intimidate the population to vote for autonomy from Kyiv. Donetsk and Luhansk are currently operating as semi-autonomous special regions, but the law that allows for that expires at the end of the year.\n\nRussia denies having soldiers in Donbas, leaving unclear how they would be able to withdraw their forces without admitting to lying.\n\nZelensky has vowed that he will not move forward with elections if any Russian forces remain in the area.\n\n“There cannot be and will not be elections held at gunpoint,” Zelenskiy said on October 2, the day after agreeing to the deal. “There will be no capitulation.”\n\nIf Donbas holds an election and votes to become a special autonomous region, Kyiv’s lawmakers would have to vote to amend the constitution to make it happen. Zelensky’s party, Servant of the People – named after the comedy show he starred in before becoming president – does not have the majority necessary to pass an amendment and it is unclear whether more established interests would vote with the party.\n\nThe protesters said they did not believe Zelensky’s promise of not holding elections under violent circumstances and that being open to the deal at all was a sign of surrender.\n\n“Holding elections in the occupied territories is inappropriate because people there have been under occupation and intensive propaganda for five years,” protester Dmytro Horyslavets told the Kyiv Post.\n\n“We didn’t fight with the occupants for five years just to surrender now. It’s a disgrace. We won’t allow it,” another protester identified as the mother of a Ukrainian soldier who died in Donbas, told the newspaper.\n\nProtesters held signs referencing Zelensky’s past career and demanding “no surrender” to Putin.\n\nWhile the Kyiv Post notes that the group organizing the protest (and others in 33 cities), the “Resistance to Capitulation Movement,” describes itself as “non-partisan,” the protest boasted a significant presence of individuals affiliated with the political parties that Zelensky defeated, including, prominently, Poroshenko himself. Following the announcement that Zelensky had agreed to the Steinmeier formula, Poroshenko condemned the move.\n\n“The signing of the Russia-authored formula […] de facto means an easing or even lifting of the sanctions against Russia,” Poroshenko’s political group said in a statement. “We will never agree to that. We feel solidarity with the present actions and calls heard from among veterans and we will not allow the ruin of the Ukrainian state.”\n\nPoroshenko himself called the Steinmeier formula “Putin’s formula,” a phrase repeated by his supporters at the rally.\n\nPoroshenko was elected in the aftermath of the Euromaidan protests against the pro-Putin leader Viktor Yanukovych, but fell from grace as some within his party turned on what they considered widespread corruption in his administration. Poroshenko appeared to be solidly in re-election territory until Zelensky announced his candidacy on his entertainment company’s New Year’s Eve variety program; by April, Zelensky defeated Poroshenko 73 percent to 24 percent.\n\nThe concerns over elections in Donbas are not limited to Zelensky’s political opponents, however. In Luhansk, one of the two provinces of the Donbas region, the withdrawal of Ukrainian troops as part of the deal has inspired some alarm.\n\n“Ukraine has withdrawn its troops in Stanytsia Luhanska. Russia has not, and their military forces are still here. Russians are now walking around freely in the gray zone,” local official Serhiy Shakshun said on television Monday. “Moreover, the war is escalating along the entire front line.”\n\n“People call the administration every day, crying: ‘How can they take our troops away?’” Shakshun added. “Our men, they say! They don’t refer to them, like before, as the ‘Ukrainian army.’ They are now ‘our men!’ And what will happen to us after that? People are really worried.”\n\nFollow Frances Martel on Facebook and Twitter.", "description": "At least 10,000 people flooded Kyiv's Independence Square, Ukraine, on Sunday to protest President Volodymyr Zelensky.", "authors": ["Frances Martel"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1173983701-640x335.jpg", "published_at": "2019-10-07"}