{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/knifeman-run-after-stabbing-jobcentre-20532804", "downloaded_at": "2019-10-07 20:13:14.004214+00:00", "title": "Knifeman on the run after stabbing Jobcentre security guard 'in the neck'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA knifeman is on the run after stabbing a Jobcentre security guard today.\n\nEmergency services rushed to the building in Belle Vale, Liverpool, at around 11.30pm after reports the employee was stabbed in the neck.\n\nThe victim, who is in his 40s, was dashed to hospital and remains there in a stable condition, Liverpool Echo understands.\n\nBut his violent attacker made off from the scene and enquiries are ongoing to locate him.\n\nDescribed as a white male, around 5ft 4in tall and wearing dark clothing, the offender struck in broad daylight.\n\n\"This is a shocking incident which has occurred in broad daylight in a public place and we are carrying out extensive enquiries to locate the offender.\n\n(Image: LIVERPOOL ECHO)\n\n\"Officers remain in the area to speak to witnesses and provide reassurance and I would ask anyone who witnessed the incident, saw anyone making off from the scene or has any CCTV or dashcam footage to please get in touch,\" said Detective Inspector Phil Atkinson, of Merseyside Police .\n\n\"To be assaulted in this way while simply carrying out your job is appalling and we are doing our utmost to find those responsible and put them before the courts.\n\n\"Knife crime will not be tolerated by Merseyside Police and I would urge anyone with information that could assist this investigation to please contact us.\"\n\nThe victim is said to work for G4S Secure Solutions and a spokesman for the company said the security guard had worked for it for nearly a decade.\n\n(Image: LIVERPOOL ECHO)\n\nStrategic account director for G4S Secure Solutions, Alan Thresher said: \"On Monday 7 October, one of our security officers was attacked at the Belle Vale Jobcentre Plus in Liverpool’s south-east.\n\n\"The incident saw our security officer sustain a serious injury and he is now in hospital receiving treatment.\n\n\"I’d like to thank the emergency services for their swift action. We are working with Merseyside Police to support their investigation.\"\n\nA Department for Work and Pensions spokeswoman said: \"The health and welfare of our staff and customers in job centres is our primary concern, and we are working closely with police to support their investigation into this incident.\"", "description": "The victim, said to work for G4S Secure Solutions at the Jobcentre in Belle Vale, Liverpool, was rushed to hospital", "authors": ["Olivia Williams", "Image", "Liverpool Echo"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20532953.ece/ALTERNATES/s1200/0_JS195317161.jpg", "published_at": "2019-10-07"}