{"pub": "breitbart", "url": "https://breitbart.com/news/california-residents-brace-for-another-wave-of-preventive-power-blackouts", "downloaded_at": "2019-10-22 13:24:43.309738+00:00", "title": "California residents brace for another wave of preventive power blackouts", "language": "en", "text": "Oct. 22 (UPI) — After millions of California residents were put in the dark two weeks ago by Pacific Gas & Electric, the state’s largest utility says it may have to cut electricity to much of the state again this week — as a measure to prevent accidental wildfires.\n\nMore than 200,000 customers in 15 California counties were notified Monday they could lose power this week, for as long as 48 hours. The utility said the second round of blackouts will mostly affect the Sierra Foothills and the northern part of the San Francisco Bay Area.\n\nPG&E pre-emptively turns off power in areas where there’s the greatest risk of power lines or other infrastructure creating a wildfire. The utility was responsible for multiple wildfires last year, including the Camp Fire — the largest in state history — that killed more than 80 people.\n\nCalifornia Gov. Gavin Newsom criticized PG&E for the blackouts two weeks ago, which left as many as 2 million people without electricity. He said the utility should reimburse those affected who are inconvenienced — businesses that have to close and residents who have to stay in hotels and pay other costs of living.\n\nThe utility implemented the first of the planned blackouts on Oct. 9, anticipating strong wind gusts that it feared could damage power lines and start a fire. That plan included three phases of cutting power to more than 2 million residents in three dozen counties. The move was unprecedented in scale.\n\nThe new blackouts come after several new wildfires in California, including the Saddlebridge Fire near Los Angeles last week. It was then that PG&E CEO Bill Johnson first told the Public Utilities Commission more strategic blackouts may be necessary in the coming years, but said he doesn’t expect major disruptions.\n\n“I think they’ll decrease in size and scope every year,” he told the commission, which criticized the utility for its handling of the phased outages.\n\n“You guys failed on so many levels on pretty simple stuff,” commission President Marybel Batjer said.\n\nDuring the last planned blackouts, PG&E’s website crashed under the strain of residents seeking updates. The utility’s call center was also overwhelmed. Newsom said he was “outraged” and the utility later said it wasn’t adequately prepared for the planned outages.\n\nJohnson said Monday despite the inconvenience of the last wave of blackouts, they likely prevented a major wildfire.\n\n“If you look at where the damage occurred on the system, it was exactly in the area where we turned off the power,” he said. “We might have turned it off a little quicker than we needed too, but the scope I think was correct.”\n\nJohnson also warned that residents should get accustomed to these types of preventive measures — for the next decade, in fact, while PG&E makes its power lines and other infrastructure more resilient.\n\nThe utility’s chief executive also suggested allowing state agencies the final say in the future on whether and when “public safety power shutoffs” are needed.", "description": "Oct. 22 (UPI) — After millions of California residents were put in the dark two weeks ago by Pacific Gas & Electric, the state’s largest", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-22"}