{"pub": "wsj", "url": "https://wsj.com/articles/u-s-japan-corn-deal-has-just-one-flaw-japan-doesnt-need-the-corn-11567933201?mod=rsswn", "downloaded_at": "2019-09-08 11:50:52.534982+00:00", "title": "U.S.-Japan Corn Deal Has Just One Flaw: Japan Doesn’t Need the Corn", "language": "en", "text": "With U.S. corn farmers hammered by the trade war with China, President Trump has said Japan—its own crop hurt by a bug infestation—will buy enough to pick up the slack.\n\nNot everyone in Japan has gotten the memo.\n\nAgriculture specialists say the bug problem isn’t severe enough to affect import demand. And an official at the Ministry of Agriculture, Forestry and Fisheries said, “If the pest damage turns out to be insignificant, the amount of purchases may not change much.”\n\nFeed maker Feedone Co. already relies mostly on corn imports, a spokeswoman said, so losses to the domestic crop wouldn’t change its demand for American corn.\n\n“If Trump thinks he’s going to deplete the stocks of stored-up U.S. corn and rescue the U.S. farmer in the process, that’s not going to happen,” said James Schoff, a senior fellow in the Asia Program of the Carnegie Endowment for International Peace.\n\nCorn futures prices have plunged this summer, dropping 22% on the Chicago Board of Trade since July 12, partly because of the trade dispute between Washington and Beijing. Although China has never been a large corn buyer, its dramatic reduction in purchases of U.S. soybeans over the past year persuaded many farmers to switch soybean acreage to corn. The predictable result: too much corn.\n\nJapan, long a major importer of American agricultural goods, is the second-largest buyer of U.S. corn after Mexico, relying on it for about 95% of its imports of field corn used for feed.\n\nBut its total annual corn imports come to only about 11 million metric tons—so even a substantial bump wouldn’t make much of a dent in U.S. corn stocks, which the U.S. Department of Agriculture last month estimated would end the season at about 60 million metric tons. That would be an increase of about 10% from the end of last season.\n\nMeeting with Japanese Prime Minister Shinzo Abe on Aug. 25 at a Group of Seven summit in France, President Trump said the Japanese corn purchases would total “hundreds of millions of dollars.” Alluding to excess U.S. supplies, Mr. Trump said Japan is “going to be buying all of that corn.”\n\nMr. Abe, sitting alongside, confirmed the deal and said Japan was suffering from an infestation that called for accelerated corn imports.\n\nThe U.S. has produced no additional details. The White House and office of the U.S. Trade Representative didn’t respond to requests for comment.\n\nThe corn purchases were announced at the same time as a broader deal in which Tokyo agreed to reduce tariffs on U.S. agricultural products such as pork and beef and Washington agreed not to raise tariffs on Japanese cars. Mr. Trump has repeatedly threatened higher tariffs to narrow a nearly $70 billion trade deficit with Japan.\n\nFarm groups in the U.S., including the National Corn Growers Association and the American Farm Bureau Federation, have welcomed the U.S.-Japan deal.\n\nWithout it, U.S. farmers have been at a disadvantage to competitors inside the Trans-Pacific Partnership, an agreement signed last year by Japan and 10 other countries—not including the U.S., which withdrew in 2017 after helping negotiate the pact. Countries trading within the TPP enjoy lower tariffs.\n\nFor its part, Tokyo is hoping to avoid tariffs that Washington has threatened on imports of automobiles and auto parts, which would fall heavily on Japan’s auto makers. The country is also seeking lower U.S. tariffs on industrial goods.\n\n“Abe would really like to put the trade issue behind him,” said Wendy Cutler, managing director of the Asia Society’s Washington office and a former trade diplomat. “And Trump wants to get something for U.S. farmers at a time that farmers are hurting.”\n\nJapan is ‘going to be buying all of that corn,’ President Trump said, and Japanese Prime Minister Shinzo Abe agreed Tokyo would help. Photo: Nicholas kamm/Agence France-Presse/Getty Images\n\nThe U.S. has come up short in several high-profile attempts to score trade wins for U.S. farmers. Mr. Trump has described what he said were agreements by Mexico and China to purchase more agricultural products, but they didn’t materialize. Nor did a humanitarian relief program, proposed by the president on Twitter, that would buy U.S. crops and ship them to poor countries.\n\nNow Japan’s trade deal risks being bundled with a corn-purchase program that may not happen on a large scale.\n\n“The corn deal is a distraction from the core issue,” said Mr. Schoff of the Carnegie Institute.\n\nAt the root of Japan’s corn issue is a moth. Damage from the fall armyworm, the moth’s caterpillar stage, was first observed in southern Japan in July. By Sept. 6 it had spread to 17 of the nation’s 47 prefectures, according to the agriculture ministry.\n\nMr. Abe’s top aide, Chief Cabinet Secretary Yoshihide Suga, said “damage from insects is spreading very fast.” However, it has been observed mainly in southern regions that account for only a small portion of corn production. The very hungry caterpillars haven’t made it to the northern island of Hokkaido, which grows about 60% of Japan’s field corn.\n\n“It isn’t a serious problem at all,” said Nobuhiro Suzuki, a professor of agriculture at Tokyo University. Prof. Suzuki said Japan might end up buying the extra corn to avoid Mr. Trump’s ire, and figure out later what to do with it—such as sending it to Africa or burning it as biofuel.\n\n“Japan has been forced into a position where it has to accommodate every request, because it is threatened by a potential 25% tariff on cars,” he said.\n\nWrite to Megumi Fujikawa at megumi.fujikawa@wsj.com and Josh Zumbrun at Josh.Zumbrun@wsj.com", "description": "With U.S. corn farmers hammered by the trade war with China, President Trump has said Japan will buy enough to pick up the slack. But not everyone in Japan has gotten the memo.", "authors": ["Megumi Fujikawa In Tokyo", "Josh Zumbrun In Washington", "Megumi Fujikawa", "Josh Zumbrun", "Megumi.Fujikawa Wsj.Com", "Josh.Zumbrun Wsj.Com"], "top_image": "https://images.wsj.net/im-105023/social", "published_at": "2019-09-08"}