{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/super-monkey-ball-banana-blitz-is-a-lot-more-fun-now-that-its-not-on-the-wii", "downloaded_at": "2019-10-13 00:22:43.982738+00:00", "title": "Super Monkey Ball: Banana Blitz Is A Lot More Fun Now That It's Not On The Wii", "language": "en", "text": "Released for the Wii in 2006, Super Monkey Ball: Banana Blitz got a lot of flack for its unwieldy motion controls. Super Monkey Ball: Banana Blitz HD, due out October 29 for the PC, PlayStation 4, Switch, and Xbox One, has no motion controls, and it’s much better for it.\n\nWho doesn’t love steering monkeys encased in transparent spheres through a series of increasingly complex roller-coaster style levels? People using Wii remotes, that’s who. As cool as it was to have 100 new game levels and a whopping 50 motion-controlled mini-games in the Wii release, the frustration of trying to control AiAi and friends by using the Wiimote to tilt the game world negated a lot of the game’s charm.\n\nStripped of its clumsy motion controls (even in the Switch version), Super Monkey Ball: Banana Blitz HD is a much better way to enjoy one of the more unique entries in Sega’s primate sphere series. Features like jumping and boss battles were new to the series in Banana Blitz, and now a lot more fans will get a chance to check them out.\n\nFrom what I’ve played of the Switch version so far, the game is a joy. AiAi, MeMe, Baby, and crew look ridiculously happy to be rolling about and collecting bananas, and their enthusiasm is infectious. The music, which is mostly new due to licensing issues with the original, is bubblegum goodness, mixing island instruments with a little ska sensibility. And while the HD version only has 10 mini-games, most of the 50 in the original were geared towards Wii remote controls and not all that entertaining.\n\nTaking a cue from the Persona school of making menus.\n\nSega hasn’t done much with Super Monkey Ball since the Wii. Some monkey cameos in other games, a couple of handheld titles, and a bunch of mobile stuff, but nothing substantial on a dedicated gaming console. Maybe if Super Monkey Ball: Banana Blitz HD goes over well, that will change. I can think of worse fates than having too many Monkey Ball games to play.", "description": "Released for the Wii in 2006, Super Monkey Ball: Banana Blitz got a lot of flack for its unwieldy motion controls. Super Monkey Ball: Banana Blitz HD, due out October 29 for the PC, PlayStation 4, Switch, and Xbox One, has no motion controls, and it’s much better for it....", "authors": ["Nathan Grayson"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/t8v1rp9mydk1umity1d1.jpg", "published_at": "2019-10-13"}