{"pub": "yahoo", "url": "https://news.yahoo.com/listen-raffi-song-honor-greta-141750042.html", "downloaded_at": "2019-09-25 08:46:35.196497+00:00", "title": "Listen To Raffi’s New Song In Honor of Greta Thunberg", "language": "en", "text": "Yesterday, Greta Thunberg made history as she addressed the United Nations at the Climate Action Summit, lambasting leaders of the world saying: “You have stolen my childhood and my dreams with your empty words.” But, 16-year-old Thunberg and the countless other children protesting climate change around the world aren’t alone. Along with the support of loving parents, activists like Greta Thunberg have another ally — brilliant and world-famous children’s musician, Raffi.\n\nLast month, Raffi released a new song, one he penned specifically for Greta Thunberg called “Young People Marching.” Fatherly is proud to present the entire song right here.\n\nhttps://images.fatherly.com/wp-content/uploads/2019/09/young-people-marching-august-20-1220.mp3\n\nRaffi is no stranger to activist politics. Last year, the singer told us that he styled himself as a folk singer in the tradition of Pete Seeger and Woody Guthrie. And prior to “Young People Marching,” back in 2007, Raffi released the song “Cool It,” which became a children’s anthem about Global Warming.\n\nThe lyrics of “Young People Marching” are as inspirational as they are brilliant. But, what is probably the coolest thing about the song is that he actually samples great moments from Greta Thunberg’s actual speeches. “Young people are speaking their truth to power. The science is clear. It’s late in the hour.”\n\nFor countless parents, Raffi is a staple of a child’s gateway into music in general. My daughter loves everything from “Dog on the Floor” to his timeless hit, “Baby Beluga.” But, with “Young People Marching,” Raffi proves that older generations can constantly learn from the new ones. That we as parents, and as people, can be inspired by children, and be moved to change.\n\nYou can download “Young People Marching” and learn more about Raffi Foundation For Child Honouring right here.\n\nAnd here’s Greta Thunberg’s full speech:\n\nRelated Articles:\n\nThe post Listen To Raffi’s New Song In Honor of Greta Thunberg appeared first on Fatherly.", "description": "With \"Young People Marching\" Raffi is a brilliant ally to child protesters everywhere.", "authors": ["Ryan Britt"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ZIq6MrU6gLxmdXXg_Grqyg--~B/aD02MzA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/fatherly_721/311164d8dfc1fa309c80f6ae68ea2f5b", "published_at": "2019-09-24"}