{"pub": "townhall", "url": "https://townhall.com/tipsheet/guybenson/2019/09/11/surprise-out-of-nowhere-trump-strongly-endorsesben-sasse-n2552914", "downloaded_at": "2019-09-12 07:11:19.502855+00:00", "title": "Surprise: Seemingly Out of Nowhere, Trump Strongly Endorses...Ben Sasse", "language": "en", "text": "I'll admit that when I saw this press release drop into my inbox, I read the subject line twice, then clicked to read the body of the email, just to be sure I was understanding everything correctly. Sure enough, President Trump went out of his way Tuesday night to offer an unambiguous and unequivocal endorsement of Nebraska Senator Ben Sasse -- a conservative Republican who has not shied away from criticizing Trump on an array of issues. Indeed, just last year, Sasse said that he considers leaving the GOP, in favor of becoming a right-leaning independent, on a daily basis:\n\n“I probably think about it every morning when I wake up, and I figure out why am I flying away from Nebraska to go to D.C. this week,” said Sasse, who tweeted Saturday that he had considered leaving the GOP. “Are we gonna get real stuff done?” In an interview on CNN’s “State of the Union,” Sasse, a Nebraska Republican, said he considers himself “an independent conservative who caucuses with the Republicans.” Though critical of President Donald Trump during the 2016 presidential campaign and beyond, he has also supported much of Trump’s agenda.\n\nThose comments came on the heels of a tweet in which Sasse admitted he \"regularly\" considers unregistering as a Republican. A CBS News article at the time called the Senator a \"a frequent critic of President Trump,\" which -- to varying degrees -- has been true for years. And yet...\n\nSenator Ben Sasse has done a wonderful job representing the people of Nebraska. He is great with our Vets, the Military, and your very important Second Amendment. Strong on Crime and the Border, Ben has my Complete and Total Endorsement! — Donald J. Trump (@realDonaldTrump) September 11, 2019\n\n\n\n\"Complete and total.\" Sasse announced just last month that he would seek re-election in 2020, despite Beltway buzz that he might he headed for the exits. Given their bumpy relationship, had Sasse nevertheless maneuvered behind the scenes to secure the president's endorsement? Based on the statement his campaign put out last night, which referred to the move as a \"surprise endorsement,\" it would seem as though the Cornhusker incumbent was as caught off guard as anyone else:\n\nU.S. Senator Ben Sasse received the surprise endorsement of President Trump this evening. The following statement is attributable to Sasse Spokesman James Wegmann: \"Ben’s grateful for the President’s kind words. They don’t always see eye to eye, but they've built a relationship where they work together when they agree and they wrestle hard when they don’t. That’s a good thing. This underscores what we've been saying: Nebraskans are conservative, Ben's one of the three most conservative senators, and he's going to win the Nebraska way—with hard work and hustle in each of the state's 93 counties.\"\n\nSo how did this come to pass? Trump famously demands loyalty, and Sasse has certainly not been a loyal Trump Republican, declining to endorse the party's nominee in 2016, and issuing occasional barbs throughout Trump's presidency. For his part, the president has reportedly groused about Sasse's opposition to his trade agenda, even saying at one point that he'd like to see Sasse \"go away.\" But for some time now, the Washington Post notes, the Senator has adopted a strategy of \"biting his tongue and keeping his head down.\" That posture, coupled with Sasse's fairly reliable vote for most of the Trump/GOP agenda, brought us to this point. Hardcore pro-Trumpers who've always hated Sasse aren't too pleased by this development, but neither are anti-Trump conservatives, who are griping about Sasse 'selling out.'\n\nI'm a Sasse admirer, despite my own differences of opinion with him from time to time. He's thoughtful and smart, and tends to look at big issues and trends from a wise perspective. I believe both the Republican Party and the United States Senate are better institutions with him in them. Understanding the political realities of the day, and attempting to navigate those choppy waters, is -- for better and worse -- part of the job. Those who'd prefer that the president attempt to rid himself of a legislator who consistently votes to advance much of the administration's agenda are appealing to Trump's pettiest instincts. Plus, Trump has much bigger fish to fry in 2020. And those skewering Sasse for failing to hurl more pointed critiques and provocations at Trump are effectively lobbying for him to become a far less effective advocate for the ideas they purportedly believe in (assuming he could maintain his office in the face of a full-blown, vengeful political adversary in the White House). In this case, it would appear Trump and Sasse are both being adults in the room. I'll leave you with a more cynical take on this whole episode.", "description": "Frienemies. .09/12/2019 3:11:14AM EST.", "authors": ["Guy Benson", "Beth Baumann", "Alex Nitzberg"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/60/09c74ec5-4112-4bc0-92a6-14e45e20781e.png", "published_at": "2019-09-11"}