{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/ap/article-7630121/London-fire-chief-defends-actions-Grenfell-Tower-blaze.html", "downloaded_at": "2019-10-30 11:19:19.813908+00:00", "title": "London fire chief defends actions in Grenfell Tower blaze", "language": "en", "text": "LONDON (AP) - London's fire commissioner is defending her brigade's response to the June 2017 inferno that killed 72 people at the Grenfell Tower apartment block after an official inquiry said more lives could have been saved if firefighters had acted quicker.\n\nCommissioner Dany Cotton said Wednesday that firefighters faced an \"unprecedented\" situation in the overnight tower fire. She promised to consider recommendations of the inquiry led by Martin Moore-Bick but defended the department's actions.\n\nResponding to the inquiry, she says \"we are disappointed at some of the criticism of individual staff members, who were placed in completely unprecedented circumstances and faced the most unimaginable conditions while trying to save the lives of others.\"\n\nThe report says fewer people would have died if the building had been evacuated more quickly.\n\nA woman passes a construction wall with written messages near Grenfell Tower in London, Wednesday, Oct. 30, 2019. A report released Wednesday on the deadly apartment block fire in London has condemned the London Fire Brigade and concluded that fewer people would have died if the building were evacuated more quickly. (AP Photo/Frank Augstein)\n\nFILE - In this file photo dated Wednesday, June 14, 2017, smoke rises from a fire in the Grenfell Tower building in west London. A report is due to be released Wednesday Oct. 30, 2019, following a far reaching inquiry into the deadly apartment block fire. (AP Photo/Matt Dunham FILE)\n\nTeddy bears and signs are attached on a fence near Grenfell Tower in London, Wednesday, Oct. 30, 2019. A report released Wednesday on the deadly apartment block fire in London has condemned the London Fire Brigade and concluded that fewer people would have died if the building were evacuated more quickly. (AP Photo/Frank Augstein)\n\nPlacards and messages are placed near Grenfell Tower in London, Wednesday, Oct. 30, 2019. A report released Wednesday on the deadly apartment block fire in London has condemned the London Fire Brigade and concluded that fewer people would have died if the building were evacuated more quickly. (AP Photo/Frank Augstein)\n\nA heart shaped picture hangs on a construction wall near Grenfell Tower in London, Wednesday, Oct. 30, 2019. A report released Wednesday on the deadly apartment block fire in London has condemned the London Fire Brigade and concluded that fewer people would have died if the building were evacuated more quickly. (AP Photo/Frank Augstein)\n\nA woman passes a construction wall with written messages near Grenfell Tower in London, Wednesday, Oct. 30, 2019. A report released Wednesday on the deadly apartment block fire in London has condemned the London Fire Brigade and concluded that fewer people would have died if the building were evacuated more quickly. (AP Photo/Frank Augstein)\n\nMessages are written on a construction wall near Grenfell Tower in London, Wednesday, Oct. 30, 2019. A report released Wednesday on the deadly apartment block fire in London has condemned the London Fire Brigade and concluded that fewer people would have died if the building were evacuated more quickly. (AP Photo/Frank Augstein)", "description": "LONDON (AP) - London's fire commissioner is defending her brigade's response to the June 2017 inferno that killed 72 people at the Grenfell Tower apartment...", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/11/wire-20371008-1572434001-126_636x382.jpg", "published_at": "2019-10-30"}