{"pub": "indiatimes", "url": "https://indiatimes.com/trending/wtf/video-firefighters-rescue-boy-dangling-by-head-from-fourth-floor-window-377427.html", "downloaded_at": "2019-10-09 12:07:15.440196+00:00", "title": "Boy Dangles By Head:Firefighters In China Rescued A 4-Year-Old Boy Precariously Dangling By His Head From Fourth Floor Windowsill", "language": "en", "text": "In a heart-stopping incident, firefighters in China rescued a four-year-old boy, who got his head stuck in security bars and was left dangling four storeys above the ground.\n\nFootage of the incident is now viral and it occurred in Linyi city, in eastern China's Shandong province.\n\nAccording to CNN, the boy climbed out to the window on Monday afternoon, where he slipped. His head got stuck between the metal railings, leaving him dangling four stories above the ground.\n\nReports state that the child's parents were not at home when the incident occurred, but his grandfather woke up on hearing his cries and called for help.\n\nDon't Miss 1.3 K SHARES 1.1 K SHARES 960 SHARES\n\nThe rescuers first tied a rope around his chest to prevent him from falling and then used a hydraulic spreader to open the metal bars. A quilt was place on the ground floor in case he fell, thankfully rescuers pulled him up.\n\nResidential buildings across China have this precarious bars-over-windowsill construction pattern\n\nIncidents like this are pretty common, especially among working parents who leave their kids behind at home.", "description": "According to CNN, the boy climbed out to the window on Monday afternoon, where he slipped. His head got stuck between the metal railings, leaving him dangling four stories above the ground.the child's parents were not at home when the incident occurred, but his grandfather woke up on hearing his cries and called for help.", "authors": ["Kc Archana"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/boy_hanging_1570618941_800x420.jpg", "published_at": "2019-10-09"}