{"pub": "marketwatch", "url": "https://marketwatch.com/story/trump-wants-even-lower-interest-rates-what-that-would-mean-for-your-retirement-savings-2019-09-12", "downloaded_at": "2019-09-12 23:40:34.507745+00:00", "title": "Trump wants even lower interest rates: What that would mean for your retirement savings", "language": "en", "text": "President Trump’s suggestion to cut interest rates to zero or below could have some unpleasant effects for people who are close to, or in, retirement.\n\nNegative interest rates have a harrowing impact on cash. Banks already offer a relatively low interest rate to consumers in exchange for stashing their money in a savings account, and the interest they incur on their savings would only go lower if rates were cut. Interest rates also affect how bonds are priced and valued, which would naturally affect retirement portfolios and how much retirees can withdraw on a monthly basis.\n\nStill, the president suggested on Twitter on Wednesday that the Federal Reserve should not only cut interest rates, but bring them to zero or below. “The USA should always be paying the lowest rate. No inflation!” he wrote. “It is only the naivete of Jay Powell and the Federal Reserve that doesn’t allow us to do what other countries are already doing. A once in a lifetime opportunity that we are missing because of ‘Boneheads.’”\n\nSee: A Danish bank is offering mortgages with negative interest rates — why you shouldn’t wish for that to happen in the U.S.\n\n....The USA should always be paying the the lowest rate. No Inflation! It is only the naïveté of Jay Powell and the Federal Reserve that doesn’t allow us to do what other countries are already doing. A once in a lifetime opportunity that we are missing because of “Boneheads.” — Donald J. Trump (@realDonaldTrump) September 11, 2019\n\nSome regions around the world do keep negative rates, including Japan and Europe, but they do so to stimulate the economy and make exports attractive. Critics say bringing interest rates to zero or lower, which usually signals a potential recession is coming, would be detrimental to the U.S. Carl Weinberg, chief economist at High Frequency Economics, said a 10-year government note with negative interest rates would be worth less than “a bag of dirt stored in your basement.” He also said a negative rate would send a message that money has lost its value.\n\nThe Federal Reserve is expected to cut interest rates, but only about a quarter of a percentage point, to 1.75% or 2%.\n\nRight now, the financial industry is experiencing an “inverted yield curve,” where shorter-term bonds have higher yields than their long-term counterparts. The reason: people are worrying about an impending recession, and they want to lock up their money in a safer investment, said Mike Alves, vice president of financial planning at Marquez Private Wealth in Pasadena, Calif.\n\nRead: 5 things investors need to know about an inverted yield curve\n\nInterest rates and bond prices have an inverse relationship, which means cutting rates to zero or below would make bonds more expensive. In other words, people would be paying a premium to invest in a fixed-income product. Still, many investors are willing to pay that extra cost, because the possibility of earning 1-2% in returns is better than losing 10% of your portfolio balance from plummeting equities, Alves said.\n\nBut investors shouldn’t stray from their asset allocation formulas. Young savers should still keep most of their retirement portfolio in equities while older workers should continue to invest partially in bonds. And even though longer-term bonds are less lucrative than shorter-term bonds at the moment, the fixed income portion of portfolios should still be diversified, Alves said.\n\nAlso see: 5 questions worried Americans will ask during the Dow’s wild ride\n\nThose with a lot of cash in their portfolios may want to consider alternatives, though. “Especially if you’re in the beginning of your financial journey in retirement savings, cash is probably not where you want to be,” said Chris Horymski, senior research analyst at Magnify Money, a personal finance site under loan marketplace LendingTree. Young investors are typically urged to keep true to their asset allocation, even in the midst of market volatility SPX, +0.29% . (Near-retirees may want to reach out to their financial adviser, or their 401(k) provider, for advice about whether or not they’re properly diversified — sometimes, people are too heavily invested in equities, and can lose a chunk of their balance only a few years away from retirement.)\n\nAs for retirement income reliant on bonds, current retirees should be laddering their investments.\n\nJohn Scherer, founder of Trinity Financial Planning in Middleton, Wis., said he uses CDs and stripped Treasurys for his clients’ retirement income needs, which protects against deflation but also would increase in value if interest rates drop. If a client needs a specific amount each year, such as $75,000 a year, he advises buying a Treasury trip that matures to that much for each of the following years. “Worst case, it provides guaranteed cash flows in the exact years planned,” he said.", "description": "What message would that send about the value of the U.S. dollar?", "authors": ["Alessandra Malito"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR189_trumpf_ZG_20190912102437.jpg", "published_at": "2019-09-12"}