{"pub": "washingtonpost", "url": "https://washingtonpost.com/immigration/us-announces-asylum-deal-with-honduras-could-send-migrants-to-one-of-worlds-most-violent-nations/2019/09/25/cca94a86-dfb6-11e9-8fd3-d943b4ed57e0_story.html", "downloaded_at": "2019-09-25 23:29:20.747046+00:00", "title": "U.S. announces asylum deal with Honduras, could send migrants to one of world’s most violent nations", "language": "en", "text": "\n\nAlmairis Guillen and her son Miguel de Jesus Oseguera, 4, in Mexico in October 2018 as they made their way to the United States as part of a migrant caravan from Honduras. (Carolyn Van Houten/The Washington Post)\n\nThe Trump administration announced a migration deal Wednesday that will give U.S. immigration authorities the ability to send asylum seekers from the border to Honduras, one of the most violent and unstable nations in the world.\n\nDepartment of Homeland Security officials reached the accord with the government of President Juan Orlando Hernández, who is embroiled in allegations of government corruption and charges that he and others have been operating the nation as a criminal enterprise — Hernández has been named as a co-conspirator in a major U.S. drug trafficking case.\n\nThe deal paves the way for the United States to take asylum seekers from the U.S. border and ship them to a nation with one of the highest murder rates in the world, a country with gang wars that have fueled waves of mass migration and multiple “caravans” to the United States that became a major irritant to President Trump.\n\nMore than 250,000 Hondurans have crossed the U.S. border during the past 11 months alone, many filing protection claims that have added to the soaring number of asylum cases clogging U.S. courts.\n\nThat DHS would enter into such an accord with the Honduran government a month after its president was named by U.S. prosecutors as a co-conspirator in a drug case is a sign of the Trump administration’s eagerness to armor the U.S. immigration system against a new surge of Central Americans.\n\n\n\nA demonstrator blocks a street during a protest demanding the resignation of President Juan Orlando Hernández, in Tegucigalpa, Honduras on Sept. 15. Hernández has suffered a credibility crisis since Honduras' Supreme Court cleared the way for his reelection despite a constitutional ban. His subsequent 2017 election win was marred by irregularities. (Elmer Martinez/AP)\n\nLast week, DHS Acting Secretary Kevin McAleenan signed a similar deal with El Salvador, after reaching an accord with the government of Guatemala in July. None of those pacts have been implemented, but once in place, U.S. officials say they will have the ability to redirect asylum applicants from the U.S. border to the same three countries that accounted for the vast majority of unlawful migration.\n\n[Trump administration reaches deal to send asylum seekers to El Salvador]\n\nMcAleenan and other U.S. officials said asylum seekers should try to find refuge “as close to home” as possible, rather than embarking on the long and often dangerous trip to the United States.\n\nA senior DHS official who described the Honduras agreement to reporters Wednesday said that the accord would allow the United States to redirect asylum seekers to the countries through which they transit while on the way to the United States — if they failed to seek protection in those countries first.\n\nAn asylum seeker from Nicaragua or Venezuela, for example, would be asked to choose among Guatemala, Honduras or El Salvador as places to seek protection, under the scenario the senior DHS official described.\n\n“When a migrant arrives at the southern border, they will be provided an opportunity to seek protection in one of those three countries,” said the official, who DHS made available to reporters on the condition that he not be identified.\n\n\n\nIn this photo from June 2017, Honduras President Juan Orlando Hernández shakes hands with Vice President Pence during a conference in Miami. (Wilfredo Lee/AP)\n\nImmigration attorneys and rights advocates have denounced the DHS agreements as a flagrant abrogation of long-standing U.S. legal protections extended to those fleeing persecution. Trump administration officials have acknowledged that their goal is to deter migrants from using U.S. humanitarian programs as a way to avoid detention and deportation at the border.\n\n“If you don’t have integrity in the system, if you can’t effectuate immigration results as people arrive at the border, and they’re invited to come up with a promise they’ll be released into the next country, they’re going to keep coming,” McAleenan said Wednesday on Fox News.\n\nMcAleenan has made several trips to Honduras in recent months seeking a deal, and he met with Hernandez and other senior officials on Aug. 27 in Washington. DHS officials say the agreement will be key to unlocking U.S. investment and a renewed commitment to job creation and growth in the region.\n\nThe acting DHS secretary also hosted Honduras’ first lady, Ana García Carías, during a border tour in June, making a personal appeal to her government and others in the region for help stemming a record influx of Central American families at the border.\n\n\n\nThe first lady of Honduras, Ana García Carías, listens to U.S. officials as they discuss the number of families crossing illegally into the United States, during a trip to the U.S. border in McAllen, Tex., in June. (Carolyn Van Houten/The Washington Post)\n\nDHS officials say the accord signed with Honduras also will expand information-sharing and improve cooperation targeting transnational criminal organizations. Hernández, the Honduran president, was accused by U.S. prosecutors in New York last month of conspiring with other top officials to protect cocaine traffickers, including a crime ring allegedly led by the president’s younger brother, Juan Antonio “Tony” Hernández.\n\nU.S. prosecutors described the president’s brother as a “a violent, multi-ton drug trafficker” after taking him into custody in Miami last year. He has pleaded not guilty to weapons and drug charges.\n\nThe charges include claims that about $1.5 million in drug money was used to finance Hernández’s 2013 presidential campaign, paying for bribes and gifts to politicians who provided their support.\n\nPresident Hernández has denied the charges.\n\nAsked whether the Trump administration took the pending charges into account while hashing out the migration accord with Hernández, the senior DHS official declined to answer.", "description": "Deal paves way for the Trump administration to redirect asylum seekers from the U.S. border to Honduras, which is plagued with gang warfare and whose president is facing U.S. drug conspiracy charges.", "authors": ["Nick Miroff", "Reporter Covering Immigration Enforcement", "The Department Of Homeland Security", "September At Pm", "Nick Miroff Covers Immigration Enforcement", "The Department Of Homeland Security For The Washington Post. He Was A Post Foreign Correspondent In Latin America To", "Has Been A Staff Writer Since"], "top_image": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2019/09/25/National-Enterprise/Images/CVH_4815.jpg?t=20170517", "published_at": "2019-09-25"}