{"pub": "nymag", "url": "https://thecut.com/2019/09/sb-276-california-vaccine-jessica-biel.html", "downloaded_at": "2019-09-09 23:18:13.675993+00:00", "title": "California Governor Newsom to Sign Vaccine Bill SB 276", "language": "en", "text": "Jessica Biel. Photo: Gary Gershoff/WireImage\n\nThis past summer, when Jezebel took notice of suspicious Instagram photos of Jessica Biel seemingly lobbying alongside a prominent anti-vaxxer, the actress unintentionally directed the country’s attention toward a California bill that was infuriating anti-vaccination activists: SB 276, which pertains to the medical exemption process for immunizations. At the time, the bill was in its early stages, but last week, California governor Gavin Newsom signaled that he’ll soon likely be signing it.\n\nWhat exactly will this bill accomplish, and why has it drawn the fury of anti-vaxxers? Below, everything to know about SB 276.\n\nWhat is the bill?\n\nEarlier this year, California senator Richard Pan, a practicing pediatrician who chairs the Senate Committee on Health, introduced Senate Bill 276, which seeks to combat fake medical exemptions.\n\nWait, first, what exactly are medical exemptions?\n\nIn short, medical exemptions allow people — typically, children — to abstain from being immunized due to a medical condition. Per the National Vaccine Information Center, medical exemptions should be “very difficult to obtain because almost all medical reasons for delaying or withholding vaccines have been eliminated by government and medical trade officials.”\n\nExcept, under current California law, it hasn’t been so difficult.\n\nWhy is that so?\n\nCurrently, in California, doctors have the authority to grant medical exemptions to vaccination — they don’t have to get the approval of the state’s Department of Public Health. And, according to Kaiser Health News, this has resulted in doctors liberally allowing patients to claim unnecessary medical exemptions to being immunized.\n\nThe proof: In the past two years, the number of children in California who have been granted a medical exemption has tripled, according to California Healthline, which has serious implications. Like many states across the country, California has been fighting measles outbreaks, which have flourished in undervaccinated communities; in 2019 so far, the state has seen 51 confirmed cases, according to the California Department of Public Health.\n\n(The reason the number of medical exemptions has gone up in the past few years is in part related to the passing of SB 277 in 2015. While that bill was restrictive on its face, as it got rid of California’s personal beliefs exemption, the Los Angeles Times reports that the state saw an increase in the number of parents claiming medical exemptions, many of which public health officials suspected were fake.)\n\nSo SB 276 cracks down on illegitimate medical exemptions?\n\nYes, that’s the goal. Under the bill, California’s Department of Public Health will make the final decision regarding whether the underlying condition claimed in a doctor’s medical exemption met the Centers for Disease Control and Prevention’s guidelines. Per the Los Angeles Times, state health officials estimate that more than 40 percent of California’s yearly 11,500 medical exemptions would be denied under the legislation.\n\nWhich is why anti-vaxxers are opposed it, right?\n\nAnti-vaxxers, many of whom have spoken out against the bill on social media, are vehemently opposed to it. The negative response to it has been so strong that Pan put out a “fact versus myth” sheet to combat disinformation.\n\nAnd Jessica Biel is among this group?\n\nYep. On June 12, Jezebel reported that Biel was spotted alongside Robert F. Kennedy Jr., a former environmental activist who has pivoted toward spewing baseless anti-vax claims, at the California Assembly. Before the day was over, the Daily Beast had confirmed that Biel was vocally opposing SB 276.\n\nBiel, however, has pushed back on being labeled an anti-vaxxer; instead, she wrote in an Instagram post on June 13, her concern over SB 276 has to do with specifics regarding medical exemptions.\n\n“My dearest friends have a child with a medical condition that warrants an exemption from vaccinations, and should this bill pass, it would greatly affect their family’s ability to care for their child in this state,” she wrote in the caption. “That’s why I spoke to legislators and argued against this bill.”\n\nAgain, SB 276 would not revoke legitimate medical exemptions.\n\nAnd the governor is going to sign it?\n\nFollowing a tense week of negotiating with Pan over the scope of the bill, on September 6, California governor Gavin Newsom announced that he will sign SB 276 once lawmakers make changes to another proposed bill relating to medical exemptions, the Los Angeles Times reports. (Newsom’s amendments to the latter bill, SB 714, would “clarify legal and administrative processes in SB 276 in order to ensure medical providers, parents, school administrators and public health officials know the rules of the road once it takes effect,” Newsom’s spokesperson Nathan Click said in a statement. SB 714, which has been passed by the Legislature, requires approval by the Assembly and Senate by September 13.)\n\nIn response to the news that Newsom will sign SB 276, anti-vax protesters have reportedly swarmed the parking lot for state legislators, as well as the capitol, as a last-ditch effort to convince lawmakers against passing the measures. Pan, meanwhile, is celebrating the progress California has made, even though some of Newsom’s amendments have weakened his original bill.\n\nAnti-vaccine protestors have formed human chains to block the parking lot for state legislators and an entrance to the Capitol this morning #sb276 pic.twitter.com/L9Zff2ZCEp — Liam Dillon (@dillonliam) September 9, 2019\n\n“As the latest measles outbreak threatens the country’s elimination status, California acted to keep children safe at school by abolishing non-medical exemptions,” Pan said in a statement. “I appreciate the Governor’s commitment to sign SB 276 with amendments contained in SB 714 that we both agree upon to ensure we maintain the community immunity needed to protect our kids.”\n\nStay in touch. Get the Cut newsletter delivered daily Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "California governor Gavin Newsom has agreed to sign SB 276, a California bill tightening the medical exemption process for vaccinations. This past summer, Jessica Biel was spotted lobbying against it.", "authors": ["Amanda Arnold"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/06/13/13-jessica-biel.w1200.h630.jpg", "published_at": "2019-09-09"}