{"pub": "cnbc", "title": "Why former NFL star Victor Cruz's mom took him on field trips to the bank as a kid", "url": "https://cnbc.com/2019/09/01/ex-nfl-star-victor-cruzs-mom-took-him-on-trips-to-the-bank-as-a-kid.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:13:56.960281+00:00", "text": "On a recent episode of the \" Kneading Dough \" podcast, Cruz and his mom, Blanca, told host Andrew Hawkins how lessons on budgeting and spending money wisely were instilled in the athlete at a young age.\n\nIn fact, the 32-year-old, who signed a three-year $1.215 million contract with the New York Giants in 2010 and then a five-year $43 million contract in 2013 as a wide receiver, said he didn't spend a dime of his first NFL check.\n\nRetired NFL player Victor Cruz may have made millions throughout his football career, but that doesn't mean he forgot the value of spending his money wisely.\n\n\"When I used to get paid, I would take him to the bank with me,\" said Blanca, of Cruz's early years, when the family lived in Paterson, N.J. She raised him as a single parent. \"He used to come and watch me deposit money and put money in Christmas clubs,\" she said. (Christmas clubs are short-term savings accounts that allow you to put a certain amount of money away each week, so that you have a fund to pull from around the holidays.)\n\n\"I would talk to him about the bills we had, so he was pretty knowledgeable about how the finances were being taken care of,\" she said.\n\nAs an inquisitive kid, Cruz said he would always ask questions about banking and money, and his mom would educate him on how the income was being broken down for bills, food and miscellaneous expenses.\n\n\"I remember being like, 'Aight Ma, let's break that Christmas club up. How much we got this year?'\" he says.\n\nThe former New York Giants star explained how those same lessons on smart budgeting and spending stayed with him throughout college and even into the league.\n\nIn college at the University of Massachusetts, Cruz said his mom and grandma would mail him $20 and sometimes $30 for spending money. \"And even with that, I was budgeting that,\" he said. \"If I'm going to hang out with my friends I'm not going to partake in certain things. I'm going to eat before I go so that I don't have to pay for the pizza after we hang out. Like I was budgeting 30 bucks the same way I would budget however much money now.\"\n\nCruz isn't the only professional athlete who says he budgets his money wisely even after making millions.\n\nRecently retired New England Patriots star Rob Gronkowski said on the \"Kneading Dough \" podcast last year that he also put his first NFL paycheck in the bank. In fact, Gronkowski said it wasn't until after eight seasons in the league that he decided to splurge on a nice chain.\n\nIn an interview with CNBC Make It earlier this year, Gronkowski explained that since the NFL is a short-lived career, one of the top pieces of financial advice he would always give his rookie teammates is to just \"keep it simple.\"\n\n\"Get what you need to live comfortably,\" he said, \"but don't go crazy with splurging until you feel comfortable in the league.\"\n\nLike this story? Subscribe to CNBC Make It on YouTube!\n\n\n\nDon't miss: The surprising thing former New York Giant Victor Cruz did with his first NFL paycheck", "description": "On a recent episode of the \"Kneading Dough\" podcast, former NFL player Victor Cruz and his mom, Blanca, explained why they would go to the bank together when he was a kid.", "authors": ["Courtney Connley"], "top_image": "https://image.cnbcfm.com/api/v1/image/106103277-1567095860716gettyimages-148454794.jpeg?v=1567095957"}