{"pub": "townhall", "url": "https://townhall.com/tipsheet/juliorosas/2019/10/10/9-year-old-transgender-student-asks-elizabeth-warren-a-question-at-cnns-lgbtq-tow-n2554565", "downloaded_at": "2019-10-11 03:58:58.577778+00:00", "title": "9-Year-Old Transgender Student Asks Elizabeth Warren a Question At CNN's LGBTQ Town Hall", "language": "en", "text": "Sen. Elizabeth Warren (D-MA) was asked a question by a nine year-old transgender student from her state while she participated in CNN's \"Equality Town Hall\" in Los Angeles on Thursday.\n\nModerator Chris Cuomo introduced Jacob, an elementary school student who likes to play hockey, and his mom, who is a transgender youth advocate with the Human Rights Campaign.\n\n\"What will you do in your first week as president to make sure that kids like me feel safer in schools and what do you think schools need to do better to make sure I don’t have to worry about anything but my homework?\" Jacob asked.\n\n\"So let me start by saying I want to have a secretary of education who both believes in public education and believes in the value of every one of our kids and is willing to enforce our civil rights laws,\" Warren replied. \"It turns out that when the Department of Education was set up many years ago, the secretary of education was given a whole lot of power over the public schools and over the rules and how they’re enforced.\"\n\nWarren went on to criticize Secretary of Education Betsy DeVos as being one of the department's secretaries \"that’s been a whole lot worse\" for students, \"so when I’m president, she’ll be gone.\"\n\n\"But here's what I plan to do. I want to make sure that the person I think is the right secretary of education meets you and hears your story and then I want you to tell me if you think that’s the right person and then we’ll make the deal,\" she added.\n\n\n\n", "description": ".10/10/2019 23:58:59PM EST.", "authors": ["Julio Rosas", "Cortney O'Brien", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/283/fc8efff5-fd73-44d4-9a7d-f19d827ba1ba.jpg", "published_at": "2019-10-10"}