{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/09/u-n-commissioner-takes-democracy-to-task-policymakers-need-to-listen-to-protester-demands", "downloaded_at": "2019-10-09 12:05:21.475259+00:00", "title": "U.N. Commissioner Takes Democracy to Task: 'Listen to Protest Demands'", "language": "en", "text": "The United Nations High Commissioner on Human Rights, Michelle Bachelet, has queried the response of international lawmakers to the demands of climate protesters, lamenting some people on the streets had problems with democracy.\n\nSpeaking in Sydney, Australia, during a local academic oration on Wednesday, Bachelet expressed disappointment that the demands of the few are met with so little action by elected representatives.\n\nABC News reports she claimed, pointing to the Extinction Rebellion demonstrations happening in 60 cities around the world, people would only continue to disengage if their participation was not met with “responsive and responsible policies.”\n\nExtinction Rebellion’s plan to spray 1,800 litres of fake blood on the treasury did not get off to the best start pic.twitter.com/c2WYHM2Tuc — Sam Francis (@DavidSamFrancis) October 3, 2019\n\n“Policymakers need to listen to their [Extinction Rebellion] demands,” she said.\n\n“Leaders — not just political leaders, but social and business leaders too — can and should encourage greater participation and involvement by young people, whose lives will be shaped by the issues that are coming to the fore right now.\n\n“Rather than fuelling cynicism about the value of participation, they could and should be encouraging people to advocate policies that align with our most important personal convictions and ideals.”\n\nThis is the second time in the space of a month the former president of Chile has urged the world to stop and listen to climate protesters and do as they are told.\n\nAs Breitbart News reported, she previously claimed climate change will cause serious “harm to Human Rights” as well as producing “powerful conflicts” among peoples.\n\nOne year after beginning her mandate, Bachelet said “climate change has been a reality for a long time,” and in order to address it, nations much “take concrete measures to comply with the Paris Agreements.”\n\n“I know that climate change will generate, voluntarily or not, restrictions and harm to people’s rights,” she said in an interview published with the Spanish news agency EFE.\n\n“Of course, it is not nature that violates human rights, but when people have to move because of drought, lack of food, or fight for water, powerful conflicts will be generated,” she added.", "description": "U.N. Commissioner Michelle Bachelet has queried the response of lawmakers to climate protesters and wants them to be heeded.", "authors": ["Simon Kent"], "top_image": "https://media.breitbart.com/media/2019/10/Michelle-Bachelet-640x335.jpg", "published_at": "2019-10-09"}