{"pub": "investingcom", "url": "https://investing.com/analysis/will-general-mills-gis-q1-earnings-gain-from-pet-segment-200464835", "downloaded_at": "2019-09-16 12:10:12.998304+00:00", "title": "Will General Mills' (GIS) Q1 Earnings Gain From Pet Segment?", "language": "en", "text": "General Mills, Inc. (NYSE: ) is scheduled to report first-quarter fiscal 2020 results on Sep 18. We expect the company to benefit from the Pet segment, which constituted close to 10% of its top line in the fourth quarter of fiscal 2019. However, the company may witness some weakness at its North America Retail segment, owing to challenges in the U.S. Snacks category.\n\n\n\nLet’s delve deeper into these aspects and the other overall trends that are likely to influence General Mills’ to-be-reported quarter’s results.\n\n\n\nPet Segment Looks Lucrative\n\n\n\nGeneral Mills acquired Blue Buffalo Pet Products, Inc. in fiscal 2018, which is now the company’s Pet segment. Following this acquisition, the company became one of the leading players in the pet food arena. Blue Buffalo manufactures and markets wholesome natural pet food items and now drives revenues for General Mills. Evidently, during the fourth quarter of fiscal 2019, the company’s sales improved 7% year over year, owing to gains from Blue Buffalo. The buyout also boosted the company’s adjusted operating profit in the said quarter.\n\n\n\nRevenues at the Pet segment came in at $405.6 million. Sales in the segment jumped 38% year over year on a pro-forma basis, backed by growth in Food, Drug and Mass (FDM) channels as well as the parity in shipping days from the month of acquisition. Management earlier stated that it anticipates sales from Blue Buffalo and segment operating profit to grow at a significant pace in fiscal 2020. This clearly gives out positive signals for the quarter to be reported.\n\n\n\nThe Zacks Consensus Estimate for revenues at the Pet segment is currently pegged at $364 million, while the consensus mark for operating profit stands at $70 million.\n\n\n\nWhat’s in Store for North America Retail Segment?\n\n\n\nThis segment formed more than half of the company’s sales in the last reported quarter. However, it continued to witness challenges in U.S. Snacks and Canada. Consequently, the company’s North America Retail organic sales declined 2% during the fourth quarter of fiscal 2019. Although the company is making efforts to boost performance in the snacks category, it may take time to yield positive results.\n\n\n\nThe Zacks Consensus Estimate for revenues at the North America Retail segment is currently pegged at $2,391 million compared with $2,388 million reported in the year-ago period. The consensus mark for operating profit stands at $530 million.\n\nOther Overall Trends\n\n\n\nGeneral Mills’ key global strategies are likely to benefit the upcoming quarterly results. To this end, the Zacks Rank #3 (Hold) company focuses on innovation, efficient customer marketing and strong in-store execution to sharpen its competitive edge. Additionally, it is focusing on improving the U.S. Yogurt business, expanding presence in the emerging nations, stabilizing distribution channels and enhancing price mix. The company is also committed toward driving growth across four differential global platforms, which include Haagen-Dazs ice cream, snack bars, Old El Paso Mexican food, and General Mills’ natural and organic food brands. Additionally, it is working toward reshaping its portfolio via prudent buyouts and divestitures. Such efforts are expected to be reflected in the upcoming results.\n\n\n\nHowever, General Mills has been battling input cost inflation for a while now. Inflation during the fourth quarter was primarily driven by higher prices for commodities. Management earlier stated that it expects cost inflation to continue in fiscal 2020, due to increased logistics costs, and higher costs of grains, packaging and other commodities. Nevertheless, General Mills’ cost-saving efforts are likely to offset these hurdles.\n\n\n\nThe Zacks Consensus Estimate for earnings in the first quarter has been stable over the past 30 days at 77 cents, which suggests an increase of 8.5% from the year-ago period’s reported figure. The consensus mark for revenues is $4,092 million, indicating a slight drop from $4,094 million reported in the year-ago quarter. (Read More: Saving Plans, Buyout to Aid General Mills (GIS) Q1 Earnings)\n\n\n\nLooking for Promising Food Stocks? Check These\n\n\n\nConagra Brands (NYSE: ) , also with a Zacks Rank #2 (Buy), has a long-term EPS growth rate of 7%. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\n\n\nJ&J (NYSE: ) Snack Foods (NASDAQ: ) , with a Zacks Rank #2, has an impressive earnings surprise record.\n\n\n\nMEDIFAST (NYSE: ) , with a Zacks Rank #2, has delivered positive earnings surprises in the trailing three quarters.\n\n\n\n7 Best Stocks for the Next 30 Days\n\n\n\nJust released: Experts distill 7 elite stocks from the current list of 220 Zacks Rank #1 Strong Buys. They deem these tickers “Most Likely for Early Price Pops.”\n\n\n\nSince 1988, the full list has beaten the market more than 2X over with an average gain of +24.6% per year. So be sure to give these hand-picked 7 your immediate attention.\n\n\n\nSee them now >>", "description": "Stocks Analysis by Zacks Investment Research covering: General Mills Inc, Johnson & Johnson, ConAgra Foods Inc, J & J Snack Foods Corp. Read Zacks Investment Research's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-16"}