{"pub": "townhall", "url": "https://redstate.com/bonchie/2019/09/08/beltway-republicans-attack-conservatives-fighting-back-cancel-culture-offer-no-solutions", "downloaded_at": "2019-09-08 23:26:37.868563+00:00", "title": "Republican Smart Set Attack Conservatives for Fighting Back Against Cancel Culture, Offer No Solutions of Their Own", "language": "en", "text": "The propensity for a certain sect of blue check mark Republicans to constantly attack their own side continues. They are virtuous, moral, and our betters in every way and they want you to know it all times. The latest example of this involves “cancel culture,” which is the act of using someone’s past statements against them in order to get them fired, punished in some way, or ostracized from polite society.\n\nThe left have pioneered its use for years with no mercy. For the most part, Republicans have sat on the sidelines sneering. It hasn’t worked at all. Instead, the left have only build up their offensive inventory more, with outfits like Media Matters and CNN’s KFile constantly looking for anyone on the right to destroy.\n\nThat has led many conservatives to decide that holding the left to their own standards is not only the best way to push back, but the most just way to handle the situation.\n\nOf course, then you get stuff like this.\n\nEven more transparent when it's coming from the vice-signaling, civil war fetishist gang. They just really, really want to be good people! The libs won't let them! — Alex Griswold (@HashtagGriswold) September 7, 2019\n\nThis is absolute nonsense and it’s typical of the kind of snark and venom directed at fellow Republicans by some of the conservative “smart set.” They rarely muster such energy when going after the left though, as you’re more likely to find them exchanging sarcastic, cutesy quips with liberals on Twitter in order to appear “above the fray.” They’ll savage you if you cross their line on an issue but are always respectful to whatever Vox reporter or CNN personality they are interacting with.\n\nLogically, there is nothing immature about holding your opponent to the same standards they apply to you, especially when those standards themselves are not objectively immoral. You may not like it when the right exposes the bad behavior of someone on the left, but that’s not immoral. It was not immoral when Breitbart exposed a college professor for racist views, including saying white people couldn’t have opinions. Why should a school be expected to keep someone like that when he has to interact with students of all races?\n\nYet, some Republicans rushed to his aid. That’s the entire catalyst for the above tweet and the story written by Robby Soave at Reason. They simply don’t want you fighting back, instead preferring to sit on the sidelines and keep signaling their virtue. That’d be fine if what they were signaling was actually virtuous but politics is not religion and shouldn’t be treated as such. Morality is one thing. Disagreements on tactics are another and it’s perfectly legitimate to use the left’s own attacks against them.\n\nThe bigger problem though is that these same conservatives who scold their own side constantly about cancel culture continue to offer no solutions of their own to the issue. Why are Republicans bound to let the left continue to beat their brains in with this? What “principle” dictates that exactly?\n\nJohn Ekdahl wrote a great response to all this.\n\nThe \"this is not who we are\" conservative clique needs to come up with a better solution to the cancel culture wars than unilateral surrender. — John Ekdahl (@JohnEkdahl) September 7, 2019\n\nBecause as it stands right now, CNN employs an entire team dedicated to scorched earth life-destroying tactics on anonymous reddit users. And you’ve yet to offer a plausible solution to that beyond mild disagreement. — John Ekdahl (@JohnEkdahl) September 7, 2019\n\nAt the *absolute least* try torching the left for the virtual silence among their “mainstream, respectable” crew when this happens. But we rarely see even that. — John Ekdahl (@JohnEkdahl) September 7, 2019\n\nWhat these certain conservatives are demanding is for their own side to simply allow cancel culture to overtake them. The left are not going to stop just because enough Republicans get on Twitter and scold them. Things are only accelerating now and they are only going to stop when destruction is mutually assured. By Griswold’s logic, Reagan should have gotten rid of all nuclear weapons to show the Soviets we are better than them. After all, it was really immature of him to build our weapons stockpiles, fighting fire with fire, when we could have just laid down our weapons and told the communists how bad they are. That would have been the mature, virtuous action, right? It also would have led to our destruction.\n\nIf Griswold, Soave, etc. want to keep slamming their political allies, perhaps it’s time they offer some viable solutions other than losing gracefully. There’s a serious rift on the right and I’m not sure Trump leaving the national stage sometime in the future is going to fix it. Too much has been said, too many bridges have been burned. The vast majority do not want to go back to getting beat with the Mitt Romneys of the world. That doesn’t mean everyone now has to be like Trump, as he’s certainly got flaws, but they will have to be willing to go after the left with vigor.\n\nThat’s a base requirement at this point and a select group of conservatives seem to be repulsed by even the most basic push back toward the progressive movement. They can either start figuring out ways to win within whatever behavioral worldview they hold or they can continue to go extinct as a political force. What they can’t continue to do is bash fellow conservatives for reacting reasonably while giving no alternatives of their own. That’s a quick path to irrelevancy outside of the bubble they currently inhabit.\n\n————————————————\n\nEnjoying the read? Please visit my archive and check out some of my latest articles.\n\nI’ve got a new twitter! Please help by following @bonchieredstate.", "description": "Republican Smart Set Attack Conservatives for Fighting Back Against Cancel Culture, Offer No Solutions of Their Own", "authors": ["Brad Slager", "Alex Parker", "Elizabeth Vaughn", "Sister Toldjah", "Jeff Charles", "Posted At Pm On September"], "top_image": "https://www.redstate.com/wp-content/uploads/2019/07/woke.jpg", "published_at": "2019-09-08"}