{"pub": "fox", "url": "https://foxnews.com/auto/local-california-cbs-reporter-fired-cars", "downloaded_at": "2019-10-23 08:32:13.244373+00:00", "title": "Local California CBS reporter fired after jumping on, damaging cars during live news segment", "language": "en", "text": "A local CBS reporter in California was apparently fired after he — during a live news segment — climbed atop classic, privately-owned cars, even seemingly damaging one of them in the process.\n\nAngel Cardenas, a correspondent with KMAX-TV's \"Good Morning Sacramento,\" was on air Sunday at the Sacramento International Auto Show, a weekend-long event at Cal Expo that was about to begin its final day.\n\nCBS NEWS REPORTER ASKS WHY OCASIO-CORTEZ WOULD ENDORSE 'OLD WHITE GUY' BERNIE SANDERS\n\nSomeone who caught the segment on air, Adam Copeland, posted a clip of it to Facebook, as he has \"never seen such a disregard to someone else's vehicle.\"\n\nCardenas playfully tells viewers \"the only person out here is a media coordinator, [the event] doesn't start until later in the day… no one is out here to tell me which car I can't go in, cause some of these are off-limits, so I'm just gonna live on the wild side.\" He then gets on top of a yellow Ford Thunderbird and laying on his side, posing on the car.\n\n\"I feel like a kid in a candy store without the owners because you can do anything,\" Cardenas says. He then moves on to another car, a pink Thunderbird, and opens the driver's side door — which dings into another vehicle sitting next to it.\n\nCNN'S BRIAN STELTER CALLS OUT ABC NEWS' GUN-RANGE VIDEO ERROR: NETWORK 'HAS NOT EXPLAINED WHAT HAPPENED'\n\nHe briefly takes a look at the possible damage, and then proceeds to get inside the car and quips that \"nobody's looking,\" before directing the cameraman to zoom in on the spot where the door hit the neighboring vehicle.\n\nCardenas later crosses through a barrier around a Ford Explorer and hops on top of the hood of the car.\n\n\"I would get off that now,\" one of the two on-air hosts tells Cardenas from the studio. He gets off moments later, saying someone in the auto show told him to.\n\nCLICK TO VISIT THE ALL-NEW FOXBUSINESS.COM\n\nThe following day, the auto show's Facebook page was updated with a message about the incident. According to the post, the auto show's producer reached out to the producer of the general manager of the CBS affiliate about the \"astonishingly awful incident\" and was told Cardenas was immediately fired following the segment, as also noted by the Time Meets Road blog.\n\nThe news station, which declined Fox News' request for comment, \"expressed their sincerest apologies for the incident,\" the post read.", "description": "A local CBS reporter in California was apparently fired after he — during a live news segment — climbed atop classic, privately-owned cars, even seemingly damaging one of them in the process.", "authors": ["Nicole Darrah", "Nicole Darrah Covers Breaking", "Trending News For Foxnews.Com. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/iStock-yellow-tbird.jpg", "published_at": "2019-10-22"}