{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/6/in-a-twist-colorado-asks-epa-to-lower-states-air-r", "downloaded_at": "2019-09-06 12:16:12.782998+00:00", "title": "In a twist, Colorado asks EPA to lower state's air rating", "language": "en", "text": "DENVER (AP) - Colorado took the unusual step of inviting the U.S. Environmental Protection Agency to downgrade the air quality rating of the state’s biggest population center, and not everyone thinks that was a good idea.\n\nThe EPA will hold a Friday hearing on whether to lower the ozone status of Denver and eight other northern Colorado counties from “moderate” to “serious.” That would force the state to work harder to reduce harmful pollution but also bring tougher and costly regulations for businesses.\n\nThe agency acted after Democratic Gov. Jared Polis said in March that Colorado would no longer ask for an exemption from EPA standards by claiming some of the pollution was drifting into the state from elsewhere.\n\nIt’s time to stop “sugar-coating” Colorado’s air problems, he said last month. “Moving to ‘serious’ status finally helps us stop sweeping our air quality crisis under the rug and gives us additional tools to move urgently to make our air cleaner,” he said.\n\nBut business groups say the state’s own data shows Colorado would meet EPA standards if not for pollution from other states and even other continents. Lowering the air rating would hurt the economy by increasing the cost of doing business, they say.\n\n“We’re talking about tens of millions of dollars in direct and indirect costs,” said Paul Seby, an attorney representing Defend Colorado, which advocates for business and industry on state and federal regulation.\n\nDenver and the northern Colorado urban corridor have struggled to meet EPA ozone standards for 15 years. Ground-level ozone can aggravate asthma and contribute to early deaths from respiratory disease. It’s the main component of smog, and it’s created from pollution emitted by vehicles, industries, solvents and other sources.\n\nClean-air advocates welcomed Polis’ decision to pull the state’s request for an exemption.\n\n“It’s a big deal,” said Christine Berg, Colorado field consultant for Moms Clean Air Force. “We know ozone pollution is particularly harmful for children.”\n\nBut Seby said Polis’ decision was based on politics, not facts.\n\nPolis’ predecessor, Democratic Gov. John Hickenlooper - who ended his presidential bid last month and is now running for the U.S. Senate - had asked for the exemption based on data showing that pollution elsewhere and forest fire smoke from other states had pushed Colorado over the limit, Seby said.\n\n“Gov. Polis came into office and the exact opposite came about,” Seby said. “The data didn’t change, the science didn’t change - except for the politics.”\n\nSeby said hundreds of businesses and institutions could be affected if Colorado’s air rating is downgraded: oil and gas drilling, refineries, large breweries, print shops, wastewater treatment plants and hospitals.\n\nAnna Unruh, an air quality consultant for Trinity Consultants, which helps businesses get environmental permits and comply with regulations, agreed that a lower rating would complicate life for businesses and industry.\n\nGetting permits could take longer, she said. Expansion projects that might not have needed permits before would be required to get them now. More businesses would have to devote employee time to monitoring and reporting on their pollution.\n\n“Permitting definitely will get more difficult,” she said.\n\nIn addition to Denver, counties affected by the change are Adams, Arapahoe, Boulder, Broomfield, Douglas, Jefferson, Larimer and Weld.\n\n___\n\nFollow Dan Elliott at http://twitter.com/DanElliottAP.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Colorado took the unusual step of inviting the U.S. Environmental Protection Agency to downgrade the air quality rating of the state's biggest population center, and not everyone thinks that was a good idea.", "authors": ["The Washington Times Http", "Dan Elliott"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/06/air_pollution_colorado_16496_c0-309-6767-4254_s1770x1032.jpg?0993798324f3ebd3fa245f32f42d77761068dd6e", "published_at": "2019-09-06"}