{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7621347/Married-Sight-Martha-Kalifatidis-goes-braless-white-dress.html", "downloaded_at": "2019-10-28 23:46:47.125877+00:00", "title": "Married At First Sight: Martha Kalifatidis goes braless in a white dress", "language": "en", "text": "She tied the knot with her Married At First Sight husband Michael Brunelli last year.\n\nBut Martha Kalifatidis looked positively bridal as she went bra-less in an elegant white gown.\n\nTaking to Instagram, the 31-year-old reality star flaunted her famous curves in the $320 dress from SIR The Label.\n\nPreparing for a wedding? Married At First Sight star Martha Kalifatidis (right) flaunted her curves in an elegant white dress after showing off a diamond ring in an Instagram snap shared on the weekend, sparking wedding rumours\n\nShe uploaded a video of herself with her fashionista friend Molly King, as they tried on dresses in a boutique store in Bondi beach.\n\nMartha wrote: 'If you see us coming into your store... sorry in advance!'\n\nClearly enjoying their photoshoot, the Kim Kardashian lookalike accentuated her curves as she posed in the mirror.\n\nSomething to tell us? Martha's bridal look comes after she stepped out wearing a sparkling diamond ring on her right hand last week\n\nShe accessorised the sleeveless number with statement square sunglasses and wore her long, brunette tresses loose.\n\nMartha's bridal look comes after she stepped out wearing a sparkling diamond ring on her right hand last week.\n\nShe recently returned from Los Angeles with boyfriend Michael, 28, whom she 'wed' in a non legally-binding ceremony on this year's Married At First Sight.\n\nThey are one of two remaining couples from the season, alongside Cameron Merchant and Jules Robinson.\n\nOn September 29, Martha marked their one-year 'wedding' anniversary, taking to Instagram to share a photo of herself naked and embracing Michael.\n\nThe picture that saw the pair standing on a balcony in front of a beach view, was captioned simply: 'One year, my dear.'\n\nUnit: Martha 'wed' Michael Brunelli (pictured), 28, in a non legally-binding ceremony on Married At First Sight, and celebrated their one-year 'anniversary' in September\n\nSince skyrocketing to fame on the reality dating series, Martha has emerged as one of Australia's most popular influencers.\n\nShe now leads a life of luxury attending celebrity events, and jetting to and from exotic destinations on trips with her primary school teacher beau.\n\nMartha has worked with major brands from fashion powerhouse Pretty Little Thing to apps such as ShopBack.", "description": "She tied the knot with her Married At First Sight husband Michael Brunelli last year.", "authors": ["Jess Bell For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/11/20277048-0-image-a-22_1572263543600.jpg", "published_at": "2019-10-28"}