{"pub": "metro", "url": "https://metro.co.uk/2019/10/22/nurse-caught-three-times-driving-high-two-months-10961495", "downloaded_at": "2019-10-22 13:34:33.112459+00:00", "title": "Nurse caught three times driving while high in two months", "language": "en", "text": "Emily Roebuck, 22, was found slumped at the wheel of her car and had to be helped to a police van by officers (Picture: Cavendish Press)\n\nA trainee dental nurse who was found 29 times over legal driving limit for ketamine has avoided jail, despite re-offending two more times in under ten weeks.\n\nEmily Roebuck, 22, from Bramhall, Stockport, Greater Manchester, regularly took the powerful aesthetic and relaxant diazepam before hitting the road in her Peugeot 107.\n\nWhile under investigation over two drug driving incidents, she ploughed into the back of a stationary car while trying to read Google maps on her phone, before driving away and crashing into two other vehicles.\n\nRoebuck, who obtained her drugs while battling anxiety and depression, now has to get two buses to work each day, after being given a three year driving ban at Stockport Magistrates’ Court.\n\nOn the first occasion, she was pulled over by police in Manchester on January 23 and found to have 591 microgrammes of ketamine per litre of blood (µg/L) in her system – well over the legal threshold of 20.\n\nShe said she bought ketamine and diazepam while battling depression (Picture: Cavendish Press)\n\nShe was released under investigation but was caught slumped at the wheel on March 2 at 9.15pm by officers called to reports of a drink driver in Stockport.\n\nAdvertisement\n\nAdvertisement\n\nThe court heard how a member of the public moved her over to the passenger side, fearing she would try to drive away.\n\nVictoria Newman, prosecuting, said: ‘The police noticed the defendant was drowsy and under the influence of some substance, her eyes being glazed and slurring her words.’\n\nOffice worker crushed to death at his desk by tyres falling through roof\n\nAfter being helped into the seat of a police van by officers, Roebuck was found to have a packet of blue tablets which she admitted were diazepam.\n\nShe said they were not prescribed to her but that she buys them and that she took one before driving.\n\nOn April 2, police stopped Roebuck at 10.20pm in New Mills, near her former home in Hayfield, Derbyshire after damaging a Mercedes A200, Seat Ibiza and a VW High up!\n\nA witness was stationary in her car waiting for traffic to pass when it was struck from behind hard enough to set off both airbags.\n\nShe was found to have been driving on 20 times the legal limit of ketamine (Picture: Cavendish Press)\n\nShe got out, asked Roebuck if she was okay and told her not to move while she called 999.\n\nThe defendant fled the scene before officers arrived but came to a stop after colliding with two other vehicles as police and ambulance arrived.\n\nTests showed the levels of ketamine and diazepam in Roebuck’s blood were no less than 86 and 800 µg/L, respectively.\n\nThe threshold limit for diazepam is 500 µg/L.\n\nAdvertisement\n\nAdvertisement\n\nRoebuck admitted two charges of drug driving, possessing diazepam and failing to stop after an accident.\n\nSteve McHugh, defending, said: ‘I don’t think it’s been my client’s finest three months in her life.\n\n‘But she has cooperated throughout and entered guilty pleas at the first opportunity.’\n\nShe was initially given a 22 month driving ban over the first incident in Ducie Street, Manchester (Picture: Google)\n\nHe said his client is ‘under no illusions as to the serious predicament she’s in’ and has since ‘happily turned her life around and gained employment’.\n\nRoebuck was previously given a 22 month driving disqualification at an earlier hearing in June over the first incident.\n\nMr McHugh added: ‘She is disappointed in herself and her father is mortified at the position his daughter finds herself in.’\n\nAs well as receiving a driving ban, Roebuck was also ordered to complete a 12 month community order and to complete 180 hours unpaid work.\n\nShe will also undergo a six month drug rehabilitation programme and pay £170 in costs.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Trainee dental nurse Emily Roebuck from Bramhall, Stockport, Greater Manchester, was caught driving on ketamine and diazepam.", "authors": ["James Hockaday"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_91157889_1571742464.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-22"}