{"pub": "guardian", "url": "https://theguardian.com/travel/2019/oct/20/10-of-the-best-creative-breaks-art-writing-sculpture", "downloaded_at": "2019-10-20 06:51:01.746102+00:00", "title": "Plunge into a new pastime: 10 of the best creative breaks", "language": "en", "text": "From an art workshop in Tuscany and a sculpture course in Wales to crime writing in the Highlands, we pick our favourite learning retreats\n\nArtistic retreat: Tuscany, Italy\n\nTucked in the hills between Pisa and Florence, Villa Lena, a 19th-century neo-Renaissance palazzo set amid 500 hectares of vineyards and woodlands, is something unexpected in the wide-open spaces of Tuscany: a rural outpost combining creativity with culture.\n\nGuests can pursue their own creative projects, but there are also workshops, classes and performances run by artists-in-residence. The country hotel and non-profit art foundation is the creation of Lena Evstafieva, a former art consultant, and her musician husband Jérôme Hadey.\n\nThe couple transformed the derelict estate into a creative haven, converting farm buildings into 14 perfectly rustic-but-chic loft apartments. “The beauty of it is being able to connect with nature as well as the resident artists,” says Evstafieva. “You can be as social or isolated as you want.” Since its opening the place has drawn many artists, offering a sanctuary in exchange for work exhibited on the walls of the hotel.\n\nThe place has its own rhythm and every day there is something different to try: creative workshops from Italian cocktail- making to cooking and wine-tasting classes, foraging and truffle-hunting with the resident dogs, candlelit concerts and storytelling. Everywhere you wander, there is someone painting or playing a musical instrument.\n\n• A one-night, half-board stay from £70; £123 for two nights, villa-lena.it\n\nBritt Collins\n\nPhotography: Morocco\n\nFacebook Twitter Pinterest Through the lens … head into the Sahara with a camera\n\nSnap your way through the souks of Marrakech or capture the dunes and Bedouin camel herders on a tour of the Sahara. Creative Escapes offers tailor-made photography courses, catering for beginners and amateurs in small groups of up to eight. There’s expert one-to-one tuition, and you can experiment with genres, from landscape to reportage, as well as receiving top technical tips. All trips include a pop-up exhibition as the grand finale.\n\n• From £2,480 for a 10-day trip including boutique hotels, transport and all tuition –flights extra, creative-escapes.co.uk\n\nBC\n\nWriting: Loire valley, France\n\nFacebook Twitter Pinterest Pen pal … begin that book at the Circle of Misse in France\n\nWriters in search of an ensuite room of their own, a writing desk and professional writers on hand to advise and inspire should head to the Circle of Misse. Housed in a 19th-century maison de maître, it offers guided courses catering for beginners and advanced writers alike. Sign up for a studio retreat, emerging only for meals and creative camaraderie, or for more forensic input opt for a mentored retreat.\n\n• Seven-day studio retreats, £645. Seven-day courses, £895. Meals, snacks, drinks, excursions and designated transfers included, circleofmisse.com\n\nGenevieve Fox\n\nSculpture: Wales\n\nFacebook Twitter Pinterest Clay day … create your own figure in a country house in the Brecon Beacons\n\nArtist Simon Cooley and his wife Anna run sculpture workshops in their beautiful 18th-century country house in the Brecon Beacons. Choose from three-day clay courses or a four-day taster in a converted barn, where you can get your hands dirty creating clay busts and stone carvings and experimenting with metal. Stay at their farmhouse B&B, a vintage Airstream trailer, or glamp in the garden – and dine on Anna’s delicious home-cooked meals and cakes.\n\n• From £300 for a two-day Sculpting the Head course. Accommodation from £55 a night single occupancy, studysculpture.com\n\nBC\n\nCooking: Venice\n\nFacebook Twitter Pinterest Good enough to eat … learn Italian cooking, canalside. Photograph: Alamy\n\nThis out-of-the-ordinary cookery school in Venice offers half and full-day classes. Celebrated chef and restaurateur Enrica Rocca teaches students the secrets of authentic Venetian cuisine, wine and culture in the beautiful setting of her family’s canalside palazzo, where you can stay a day or a week. A typical class can include making fresh focaccia and hand-rolling pasta. Also on offer are outings to markets, wine producers and trattorias to sample the local cuisine.\n\n• From £168pp for a one-day cicchetti-making class (enricarocca.com)\n\nBC\n\nSinging: Edinburgh\n\nHit the high notes with a course in traditional Scots singing in the heart of the capital, under the tutelage of acclaimed folk singer Robyn Stapleton. The week’s holiday includes four half-day workshops in which singers learn traditional Scottish songs and discover the stories behind them, a guided city walk, entry to a night at Edinburgh Folk Club and a final get-together with local singers and musicians in a pub. Here’s tae us, wha’s like us!\n\n• From £1,650pp, based on two sharing, including five nights’ B&B in Ten Hill Place Hotel, lunch and two evening meals, wildatartscotland.com\n\nDebbie Lawson\n\nKnitting: Ireland\n\nFacebook Twitter Pinterest Woolly thinking … get crafty on Ireland’s stunning west coast\n\nSettle down to six days’ knitting and crochet amid the stunning scenery of Ireland’s west coast. Carol Meldrum’s course teaches traditional cable knit and crochet, culminating in a hat or cowl. Sarah Hazell tutors students in making an infinity loop scarf using twists and bobbles, among other techniques. The price includes visits to Galway, the Leenane Sheep and Wool Centre in beautiful Connemara, and Inis Oírr, the smallest of the Aran islands.\n\n• From £1,545 including flights from London, half-board accommodation and four half-day workshops, arenatravel.com\n\nDL\n\nPottery: Cornwall\n\nFacebook Twitter Pinterest Game of throwing … make pots on the Penwith peninsula\n\nLearn how to throw with confidence at Primrose Cottage on the Penwith peninsula. All courses are taught by Caroline Winn, who has been exhibiting her work for more than 20 years. Her classes run for five days. You’re also in one of the most dramatic areas of Cornwall, a landscape known for its coastal cliffs and coves: perfect for a rugged walk when you’re done glazing.\n\n• Rooms start at £990pp and include the course, meals, materials and an excursion, cornishpotteryholidays.co.uk\n\nEmma Cook\n\nSewing: Charente, France\n\nSew some inspiration into your life on a crafty residential holiday led by textiles technology teacher Bronwen Shepherd at the charming Le Jardin du Berger in Charente, near Bordeaux. Courses range from sewing for mindfulness to patchwork and quilting to advanced dressmaking. Relax in the gardens, swim in the pool and enjoy the immaculate accommodation – both self-catered and fully catered – and alfresco dining.\n\n• From £700 a week, textileholidaysfrance.com\n\nGF\n\nCrime writing: Highlands\n\nWhere better to plot your twisty Scottish noir thriller than at Moniack Mhor Creative Writing Centre, 14 miles from the city of Inverness? Crime tutors for this five-day retreat include award-winning authors Louise Welsh, Karen Campbell and thriller critic Adam LeBor. With the remote and stunning scenery of the Scottish highlands on your doorstep, creative inspiration is bound to strike.\n\nFrom £540, including twin room, food and tuition, moniackmhor.org.uk\n\nEC\n\nLooking for a holiday with a difference? Browse Guardian Holidays to see a range of fantastic trips", "description": "From an art workshop in Tuscany and a sculpture course in Wales to crime writing in the Highlands, we pick our favourite learning retreats", "authors": ["Debbie Lawson", "Emma Cook", "Genevieve Fox", "Britt Collins"], "top_image": "https://i.guim.co.uk/img/media/2aa93499604a316803117a87d606406e77e8d24b/0_300_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=83488ae1c9e26a90e6ce81835fb0b7c4", "published_at": "2019-10-20"}