{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7602923/The-Blocks-Tess-Luke-slam-portraying-lazy.html", "downloaded_at": "2019-10-23 11:12:55.649051+00:00", "title": "The Block's Tess and Luke slam the show for portraying them as 'lazy'", "language": "en", "text": "The Block's Tess and Luke have unleashed on the show's 'bullying' producers in an extraordinary rant, saying they have been unfairly portrayed as 'lazy'.\n\nSpeaking to News.com.au on Wednesday, Luke said: 'We're getting sick of how they're editing us as being these big lazy pr**ks who don't get off their a**e and do a single thing.'\n\nReality TV stars are typically made to sign contracts that prevent them from publicly criticising the program or network, which means the couple may possibly face legal consequences for speaking out.\n\n'We're not coping': The Block's Tess and Luke (pictured) have unleashed on the show's 'bullying' producers in an extraordinary rant, saying they have been unfairly portrayed as 'lazy'\n\nLuke, 30, added: 'We're just getting painted as these lazy people and we're bloody sick of it. Even the other contestants have contacted us to say, \"That didn't happen, that was taken out of context\".'\n\nTess, 28, explained the pair 'are not coping' and insisted that her walk-off on Sunday night was also misrepresented.\n\nDuring that episode, she left after Scott Cam confronted the couple over their budget, saying they had spent $25,000 more than any other team.\n\nControversial: Tess and Luke said their portrayal on The Block has not been accurate and they are 'bloody sick of it'\n\nShe said: 'I walked off because I couldn't handle it. I did say, \"You guys need to stop filming me because I'm not coping right now for mental health reasons,\" and they didn't stop filming.\n\n'It was all a lie... we didn't spend $25,000 more than the other contestants. We've been working our absolute a**es off.'\n\nIn a statement to Daily Mail Australia, a Nine spokesperson said: 'Tess and Luke have done an outstanding job creating a magnificent four-bedroom home. After a shaky start and budget struggles, they've won two room reveals so far and their renovating style has impressed the judges and viewers alike.\n\n'We recognise the mammoth challenges facing all contestants. We supported all of them throughout the build and we had a psychologist and support team available at all times. We’ll continue to support them as the program is broadcast and beyond.'\n\nThe Block's executive producer, Julian Cress, added: 'They have been warmly embraced by the audience and rank as one of the most popular couples we have had on The Block. Through their sheer hard work and determination to finish they also won the admiration and respect of the entire production crew and they have our full support and will continue to.'\n\nStruggles: Tess claimed that her walk-off on Sunday's episode was misrepresented and she had asked crew members to stop filming her because she 'wasn't coping'\n\nIt comes after Channel Seven was forced to pay compensation to a former House Rules contestant who was unfairly portrayed as a 'villain' on the renovation show.\n\nNicole Prince, who featured on season five in 2017 with her friend Fiona Taylor, suffered 'psychological injury' during filming and lost work after the show ended.\n\nShe took legal action through the Workers Compensation Commission (WCC), saying she felt 'harassed and bullied' during filming and also suffered reputational damage.\n\nThe network has been ordered to compensate Nicole for her medical treatment in relation to her injury.\n\nThe WCC's ruling could set a legal precedent allowing for disgruntled reality stars to take action against broadcasters if they're not happy with their portrayal.\n\nLandmark decision: It comes after Channel Seven was forced to pay compensation to former House Rules star Nicole Prince (right), who was portrayed as a 'villain' on the renovation show", "description": "The Block's Tess and Luke have unleashed on the show's 'bullying' producers in an extraordinary rant, saying they have been unfairly portrayed as 'lazy'.", "authors": ["Mary Mrad", "Jo Scrimshire For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/02/20063710-0-image-a-38_1571793288433.jpg", "published_at": "2019-10-23"}