{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/jeremy-stephens-swinging-to-put-lights-out-vs-yair-rodriguez-ufc-on-espn-6-boston-rematch", "downloaded_at": "2019-10-07 20:19:33.273720+00:00", "title": "Jeremy Stephens: Three-round rematch vs. Yair Rodriguez means 'everything's going to be swinging to put the lights out'", "language": "en", "text": "Gallery Yair Rodriguez vs. Jeremy Stephens at UFC on ESPN+ 17: Best photos view 17 images\n\nThe grudge rematch between Jeremy Stephens and Yair Rodriguez has found a new location, and Stephens says there will be one major difference.\n\nTheir first fight was a five-round main event at UFC on ESPN+ 17 in Mexico City, but now he faces Rodriguez in a three-round fight at UFC on ESPN 6 in Boston. The big difference is, Stephens plans on throwing bombs from the opening bell.\n\n“It brings a whole different fight,” Stephens said in an interview with Karyn Bryant. “(The first fight) was a five-rounder, and going into that fight, the mentality was a little bit different. But then coming straight here to a three-round fight, it’s going to be a little more vicious. It’s a different type of fight now, so it’s going to be everything swinging – everything’s going to be swinging to put the lights out.”\n\nTheir first fight was stopped when an accidental eye poke by Rodriguez rendered Stephens unable to continue after just 15 seconds. A visibly frustrated Rodriguez accused Stephens of looking for a way out. That resulted in a hotel lobby altercation the next day in which the two had to be separated.\n\nThey won’t have to wait long to run it back. They are rescheduled to a fight in Boston on Oct. 18, less than a month after their first bout. While Stephens had to put up with a lot of criticism from the fans, as well as Rodriguez accusing him of faking the eye injury, he intends on making him pay on fight night.\n\n“It doesn’t bother me,” Stephens said. “It’s just going to make it that much sweeter when I put his lights out. It’s a different fight. This is three rounds. I already have the cardio to go five. Now I get to go three. Everything I throw is going to be bad intentions on this kid, so I’m really looking to put him in his place – and all eyes are on me to do it. So like I said, big banger in Boston. We’re going to bring it.”\n\n“Lil’ Heathen” traveled early to Mexico to get acclimated to the high altitude in preparation for a five-round war. But now that the fight will be 15 minutes, Stephens (28-16 MMA, 15-15 UFC) thinks with his hard-hitting style, the preparation he’s already had in terms of cardio will pay dividends on fight night.\n\nHe plans on bringing the fight to “El Pantera,” closing the distance and swinging. Some of Stephens’ past losses were due to opponents outpointing him, going in and out and picking their shots. But he doesn’t plan on letting Rodriguez (11-2 MMA, 7-1 UFC) do the same thing.\n\n“I think my mindset going into the last one, I was really kind of wanting to whoop his (expletive) for 25 minutes and kind of put him at that make-him-want-to quit stage,” Stephens said. “This time, three rounds to do so, guys are always squeaking by, outpointing me with these decisions, these rounds, and I’m chasing them. But I think everything that I’m going to throw is going to be bad intentions in order to put his lights out.\n\n“I’m bringing in the closer – like, you’re bringing in the right hander. Everything is going to be a bad intent. It’s going to be vicious, and I’ve got the cardio to back it up – so sweet dreams to this kid.”", "description": "Jeremy Stephens vows to make Yair Rodriguez pay for his words at UFC on ESPN 6 in Boston, says three-round fight plays to his favor.", "authors": ["Farah Hannoun", "Nolan King", "Matt Erickson", "The Blue Corner", "Simon Head", "Mma Junkie Staff", "Ken Hathaway", "Mmajunkie Staff"], "top_image": "https://usatmmajunkie.files.wordpress.com/2018/01/jeremy-stephens-ufc-fight-night-1241.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-07"}