{"pub": "usatoday", "url": "https://usatoday.com/story/life/parenting/2019/10/11/amber-rose-alexander-edwards-welcome-child-baby-boy/3787129002", "downloaded_at": "2019-10-11 12:40:47.826997+00:00", "title": "Amber Rose and boyfriend Alexander Edwards welcome baby boy, Slash Electric", "language": "en", "text": "CLOSE\n\nAmber Rose is officially nine months pregnant. (Photo: Andrew Toth, Getty Images for Def Jam)\n\nAmber Rose is now a \"Muva\" of two!\n\nAlexander \"AE\" Edwards announced the birth of his son with the model on Instagram early Friday. The couple named their newborn Slash Electric Alexander Edwards.\n\nEdwards also thanked Rose for loving him enough to bring his son into this world. He wrote that he could never be as strong as her and called their new baby boy a \"rockstar.\"\n\nEdwards' announcement came shortly after Rose revealed she was going into labor on her Instagram Stories.\n\nThe baby boy is the couple's first child together. Rose is also mother to 6-year-old Sebastian Taylor Thomaz with rapper Wiz Khalifa.\n\nRose shared she was expecting back in April with a post to Instagram and a picture of herself getting a sonogram.\n\n\"@ae4president and I are SUPER excited to announce that we have a Sweet little Baby Boy on the way!\" she wrote. \"P.S Sebastian is soooooo Happy to be a big brother!\"\n\nEdwards shared the same picture on his Instagram account, writing, \"Even when it’s dark.. my SON will shine. Thank u baby 4 my greatest gift…I love you.\"\n\nEarlier in September, Rose gave fans a real-life look at what nine months pregnant looks like.\n\nThe actress shared a video to Instagram, showing off her very pregnant belly and talked about the struggles she was enduring toward the end of her pregnancy.\n\n\"So as of today, I am nine months pregnant y'all,\" she said. \"It's not a game, that's a big boy in there.\"\n\nShe then turns to the side to give audiences a view of her belly.\n\n\"I'm pretty much on bed rest at this point,\" Rose said. \"I can’t walk that well, my ankles got a little swollen, my feet got a little swollen, but for the most part I’m all belly.\"\n\nRose and Edwards went public with their relationship in October. Rose was married to Wiz Khalifa for 14 months before divorcing in September 2014.\n\nContributing: Rasha Ali and Cydney Henderson\n\nREAD MORE\n\nRead or Share this story: https://www.usatoday.com/story/life/parenting/2019/10/11/amber-rose-alexander-edwards-welcome-child-baby-boy/3787129002/", "description": "Amber Rose is now a \"Muva\" of two! The model has given birth to a baby boy with her boyfriend Alexander Edwards.", "authors": ["Amy Haneline", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/10/USAT/29d5a305-e571-4898-95c6-7dac554be81c-GTY_1157678122.JPG?crop=4927,2772,x0,y247&width=3200&height=1680&fit=bounds", "published_at": "2019-10-11"}