{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/tribes-are-pushing-washington-to-be-the-first-state-to-declare-a-climate-emergency", "downloaded_at": "2019-10-21 13:24:24.269640+00:00", "title": "Tribes Are Pushing Washington To Be The First State To Declare A Climate Emergency", "language": "en", "text": "Protestors rally outside the Capitol in Olympia, Washington. (Photo: Jess Lee, Protectors of the Salish Sea)\n\nThere’s an occupation taking place in Olympia, Washington. Native American activists have established a semi-permanent camp 15 minutes away from the state Capitol as part of a campaign to push Governor Jay Inslee — the former U.S. presidential candidate who put the climate crisis front and centre as part of his bid — to declare a climate emergency for the state in what would be an American first.\n\nIndigenous peoples and their allies have been protesting on the steps of the Capitol since the end of September. They walked nearly 80km together from the construction site of a proposed natural gas terminal in Tacoma to arrive at the Capitol. The group initially erected tarpees, teepee-like structures that can withstand the harsh bite of winter, on state grounds. And then they stood toe-to-toe with police in full-out riot gear who eventually removed the tarpees. Now, they walk every day from their camp — which sits on someone’s private property — to the Capitol steps where they’ve spent the past few weeks making their voices heard.\n\n“We’re not leaving this place no matter what,” Paul Wagner, the founder of Protectors of the Salish Sea who is leading the occupation and a member of the Saanich Nation, told Gizmodo.\n\nThat is, not until Governor Inslee declares a climate emergency like the ones that approved by thousand governments around the world. For Washington’s climate change warriors, an emergency declaration would include a call to terminate all fossil fuel expansion — including pipelines, terminals, drilling and any other extractive infrastructure or activities that harms the climate — in the state and the creation of a special council that includes communities that are disproportionately impacted by climate change, such as youth and indigenous people, to plan for the climate crisis.\n\nCountries like the UK and Canada have made such declarations. A tribal nation in the Canadian Yukon is also among the nations that have made declarations, and city and local governments in parts of the UK and Australia have been part of the movement, too.\n\nAs for the U.S., though? Representative Alexandria Ocasio-Cortez and Senator Bernie Sanders have urged the U.S. government to do so, but that hasn’t happened yet. And no U.S. states have either. If Washington actually did declare an emergency for the climate crisis, it would be the first.\n\nInslee doesn’t plan to do that, though. The governor has limited legal authority to declare a climate emergency, Tara Lee, the acting communications director for his office, told Gizmodo in an email. She said his emergency declaration power is reserved for temporary emergencies, not for shutting down fossil fuel projects.\n\n“The governor and his office have been very clear what we can and cannot accomplish from the very beginning of these protests,” Lee wrote. “I would also question the protesters to just what they think the governor’s authority to do so is. They haven’t been clear on this, and when asked a couple of them just said something like, ‘We know he has it.’”\n\nWell, OK, girl. When I did just that and asked a couple participants, they pointed to his ability to sign executive orders. He signed an executive order in late September issuing an emergency ban on flavoured vape products. The way many of these advocates see it, if he can do just that for the health crisis that vaping presents, why can’t he do the same for the crisis that is climate change?\n\nThere’s also the influence he has across other agencies, Kyle Taylor Lucas, founder of Urban Indians Northwest and the hereditary chief of the Pukaist people of the Nlaka’Pamux Nation who’s participated in the Capitol occupation, told Gizmodo. Lucas served as the director for the Governor’s Office of Indian Affairs under former Washington state Governor Gary Locke in 2003.\n\nAdvocates continue to push for a climate emergency declaration. (Photo: Jess Lee, Protectors of the Salish Sea)\n\n“The governor holds great persuasive authority over agencies having the duty to approve these [fossil fuel] projects or not,” Lucas told Gizmodo.\n\nTo be fair, Inslee has been a champion against climate change. As part of his presidential bid, he put forward a $13 trillion plan to address climate change and restructure the economy that Ocasio-Cortez called the gold standard of climate plans. His influence on the Democratic primary has continued since dropping out two months ago.\n\nHe also signed a bill to get Washington running on 100 per cent renewable energy by 2045. And he has rejected fossil fuel projects in the past, such as this oil-by-rail terminal last year.\n\nStill, his state continues to see some expansion of fossil fuels at a time when the transition toward cleaner energy options needs to happen. Construction on the natural gas terminal in Tacoma that protestors walked from to reach the Capitol began under Inslee. He initially supported the project, though earlier this year he said he couldn’t any longer “in good conscience.” In addition, he also reneged on his support for a proposed methanol refinery in Kalama, and the state has delayed permits.\n\nAnd that’s what these Native-led protestors want: action! They’re already feeling climate change impact their quality of life. Increased wildfires are reducing air quality, and warmer, more-polluted waters are harming salmon that the Puget Sound orcas depend on to survive.\n\nAs a result, they’re nearing extinction — and the indigenous people of the Salish Sea see these animals as relatives. If we lose these orcas, a key symbol for this region’s indigenous culture will be gone, too.\n\nSo Wagner is waiting. Four tarpees stand in their camp, providing shelter to the roughly 15 people who’ve stayed to continue putting pressure on Inslee. The governor may argue there’s only so much he can do, but drastic times call for drastic measures. Advocates are hoping the governor is courageous enough to take the leap.", "description": "There’s an occupation taking place in Olympia, Washington. Native American activists have established a semi-permanent camp 15 minutes away from the state Capitol as part of a campaign to push Governor Jay Inslee — the former U.S. presidential candidate who put the climate crisis front and centre as part of his...", "authors": ["Julie Muncy", "Mack Hogan"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/ndr4xsntp0glfgwg8rnk.jpg", "published_at": "2019-10-21"}