{"pub": "fox", "url": "https://foxnews.com/opinion/greg-gutfeld-analysis-trump-reelection-victory", "downloaded_at": "2019-10-18 01:09:56.850786+00:00", "title": "Gutfeld on the analysis predicting Trump's reelection victory", "language": "en", "text": "Great news for Democrats!\n\nOne of the most accurate predictors of presidential elections indicates that President Trump will easily win reelection. According to Moody's Analytics, Trump should get at least 289 electoral votes and up to as many as 351 votes.\n\nIts projections are based on how voters feel about their finances – that is, the prospects for employment (which are awesome) and stock market gains (which are great).\n\nJASON CHAFFETZ: PELOSI AND IMPEACHMENT – THERE HAVE ALREADY BEEN 3 VOTES. HERE'S WHY THERE MAY NOT BE A FOURTH\n\nBut we knew this: people vote with their pocketbooks. And Trump has fattened them up.\n\nLeftists would call this shallow, short-sighted self-interest. -- As if having more money to spend on food and clothes for your kids is insidiously selfish. But it’s this great economy that explains the orchestrated drama driven by an angry media and its protected class -- the Democrats.\n\nThe better the country does, the crazier they become. Talk about cause and effect!\n\nSo, I said this was great news for Democrats.\n\nWhy?\n\nWell, now they can let it go -- and start planning for 2024.\n\nDemocrats, you can stop hammering Trump’s personality and instead find coherent, hopeful, positive systems that tackle real problems.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nAnd, now that Trump has the big things running fine, he could focus on other stuff that could have lasting benefits, too: A climate plan that puts nuclear power front and center, a strategy that helps the mentally ill get off the streets and a plan to end rampant homelessness.\n\nOf course, for these things to happen, he's gonna need help.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWhat are the chances the Democrats might stop chasing fake problems and help solve real ones?\n\nWell, we can dream.\n\nAdapted from Greg Gutfeld’s monologue on “The Five” on October 17, 2019.", "description": "One of the most accurate predictors of presidential elections indicates that President Trump will easily win reelection.", "authors": ["Greg Gutfeld", "Greg Gutfeld Currently Serves As Host Of"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/17/694940094001_6095699955001_6095702167001-vs.jpg", "published_at": "2019-10-17"}