{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/30/six-wackiest-moments-truly-wacky-game", "downloaded_at": "2019-10-30 11:18:53.472554+00:00", "title": "The six wackiest moments from a truly wacky Game 6", "language": "en", "text": "The game also included players from both teams carrying bats to first base after home runs, and a 10-minute delay in the seventh inning to sort out a questionable interference call that eventually led to the first manager ejection in the Fall Classic in 23 years. Whew.\n\nHere are the six wackiest moments from Game 6:\n\nAD\n\nAlex Bregman homers, carries his bat to first base\n\nWith two outs in the first inning, the Astros’ third baseman and presumptive American League MVP crushed a solo home run to left field off Strasburg that gave Houston a 2-1 lead. Rather than drop, or even flip, his bat at home plate, Bregman carried his lumber all the way to first base before fumbling an exchange with Astros first base coach Don Kelly. The bat ended up in fair territory as Bregman jogged toward second base.\n\nAD\n\n“He was trying to hand this bat off to his first base coach, and I’m sure his first base coach was like, ‘I’ve never had this happen to me,' \" Fox analyst John Smoltz said on the broadcast.\n\nAD\n\nThis dude @ABREG_1 really carried the bat to 1st base.\n\n\n\nLegend. pic.twitter.com/TQqhfSVjUq — Cut4 (@Cut4) October 30, 2019\n\n“I just thought that was pretty tired,” Strasburg said, when asked about Bregman’s antics after the game.\n\nMajor League Baseball debuted a “We Play Loud” ad campaign at the start of the postseason that celebrated some of its young stars’ willingness to challenge the game’s various unwritten rules, including the proper way to act after hitting home run, but Bregman’s bat carry crossed a line in the eyes of some former players.\n\n“That’s asking to get someone hurt on your team,” former National Mike Morse tweeted.\n\nI dont think I’ve ever seen a guy carry his bat all the way to first. If this wasn’t the world series he would get one in the ear. — Paul Lo Duca (@paulloduca16) October 30, 2019\n\nBregman ... dude taking the bat all the way to first....that’s asking to get someone hurt on your team ... next year . Right now focuses on winning #WorldSeries — Michael Morse (@MorseBeWithU) October 30, 2019\n\nIf you carry a bat to first base you’d better have ball and shot ready, seconds at your side, a formal writ declaring your intent to duel, and a shallow grave already dug. — Old Hoss Radboooooooourn (@OldHossRadbourn) October 30, 2019\n\nAfter the game, Bregman apologized, saying he let his emotions get the best of him and “that’s not how I was raised to play the game.” Bregman has D.C. baseball ties: His grandfather, Washington lawyer and political insider Stan Bregman, convinced Bob Short to purchase the expansion Senators in the late 1960s.\n\nAD\n\nAD\n\nJuan Soto homers, carries bat to first base\n\nSoto apparently didn’t turn around to admire Bregman’s no-doubter for long, because he didn’t miss the Astros slugger’s arrival at first base.\n\n“Since I saw that, what Bregman did in the first inning, I was like, ‘That looks pretty cool,' \" Soto told MLB Network after the game. “I want to do that.’”\n\n\"I saw that, what Bregman did in the first inning... I was like, 'that was pretty cool, I wanna do that.'\" - Juan Soto@Nationals | #STAYINTHEFIGHT | #WorldSeries pic.twitter.com/blurqO6cIX — MLB Network (@MLBNetwork) October 30, 2019\n\nSo Soto did, carrying his bat to first base coach Tim Bogar after taking Justin Verlander deep with a moonshot to right field in the fifth inning that broke a 2-2 tie.\n\nNationals Manager Dave Martinez didn’t appreciate Bregman or Soto’s actions.\n\n“We didn’t like it,” Martinez said afterward. “And the fact that Soto did it, I’ll be quite honest with you, I didn’t like it when he did it as well. It’s a conversation I’ll have with Juan. That’s not who we are.”\n\nAD\n\nThey’re carrying their bats to first base now. Lol 😂🤷🏾‍♂️ #lovetoseeit — Marcus Stroman (@MStrooo6) October 30, 2019\n\nPedro Cerrano carried his bat all the way around the bases, it’s really not a big deal! — Rob Dibble (@robdibble49) October 30, 2019\n\nBud Light guy from Game 5 stars in a commercial\n\nNationals fan Jeff Adams, who took a home run ball to the chest while managing not to spill the cans of Bud Light he held in both hands as he was returning to his seat in the second inning of Game 5 on Sunday, had a pretty good night.\n\nAD\n\nBud Light arranged to send him to Game 6, where he wore a T-shirt with an illustration of his heroic act and the words “Always Save The Beers.” Bud Light also aired a commercial featuring a replay of the moment during Tuesday’s broadcast. “Not all heroes wear capes,” the 15-second spot began. “Or gloves.”\n\nTrea Turner gets called out for interference\n\nWith no outs, Yan Gomes on first and the Nationals leading 3-2 in the sixth, Turner tapped a ball in front of the mound. Astros reliever Brad Peacock fielded it and fired to first, but his throw led first baseman Yuli Gurriel’s glove into Turner’s path. As Turner hit first base, Gurriel’s glove fell off and the ball trickled into right field. Gomes and Turner each advanced one base on the play.\n\nAD\n\nBut home plate umpire Sam Holbrook ruled that Turner had interfered with Gurriel’s ability to catch Peacock’s throw. Turner was ruled out. Gomes was returned to first. Martinez and Nationals fans, including D.C. Mayor Muriel E. Bowser, were irate.\n\nAD\n\n“Hey Alexa,” Bowser tweeted after the call. “Can a mayor fire an umpire?”\n\nTrea Turner was called out on this play.\n\n\n\n\"That's a potentially series changing call.\" - Joe @Buck pic.twitter.com/E3Po7hSNcR — FOX Sports: MLB (@MLBONFOX) October 30, 2019\n\nTurner was frustrated, too, and Fox’s microphones in the dugout caught him pointing at chief baseball officer Joe Torre, who was sitting nearby.\n\n“He’s sitting with his head down trying not to look up,” Turner shouted, as Holbrook and the umpiring crew donned headsets during a 10-minute delay that left everyone — from the players and fans at Minute Maid Park, to Fox’s broadcasters and those watching at home — thoroughly confused.\n\nAD\n\nSorry even we can't help with this one https://t.co/LNtIEYUM8K — Baseball Reference (@baseball_ref) October 30, 2019\n\nTrea Turner: “Joe Torre is sitting right there … he’s sitting with his head down trying not to look up.” pic.twitter.com/BM92dbAKGN — Joon Lee (@joonlee) October 30, 2019\n\n“Wait ‘til you watch,” Martinez yelled at Holbrook from the dugout, suggesting the umpire would realize he made a bad call once he saw the replay. “Wait 'til you watch.”\n\nRendon told Fox’s Ken Rosenthal that he was “actually pretty happy about the delay” because he “got to sit down for a little while” before he went up to bat. After Adam Eaton popped out, a rested Rendon crushed a two-run homer to left to give the Nationals a 5-2 lead. Rendon added a two-run double in the ninth.\n\nAD\n\nDave Martinez gets ejected\n\n“Davey was really out of control for a bit when he was yelling at Sam Holbrook,” Torre, who defended the interference call, said on Fox’s postgame show. “They went to the headset just to make sure that everything they were telling him was double-checked.”\n\nAD\n\nMartinez evidently wasn’t satisfied with whatever explanation he received. During the seventh-inning stretch, he went after Holbrook again. Despite bench coach Chip Hale’s best efforts, Martinez did enough to get ejected while fans were in the middle of singing “Take Me Out to the Ballgame.\"\n\nMartinez became the first manager ejected in a World Series since Atlanta’s Bobby Cox was tossed in Game 6 of the 1996 World Series for arguing a close play at second.\n\nChip Hale you gotta tighten up that grip man pic.twitter.com/oTcxOU4bwr — Jomboy (@Jomboy_) October 30, 2019\n\nI just want to point out that this meltdown happened during \"Take Me Out To The Ballgame\" which is not clear on the Fox broadcast, and it's hilarious pic.twitter.com/pHFJwSmLMQ — Timothy Burke (@bubbaprog) October 30, 2019\n\nThe away team wins again\n\nThis ridiculousness isn’t unique to Game 6, but it’s a remarkable aspect of Tuesday’s result nonetheless. The Nationals have now outscored the Astros 24-9 in three road games during this World Series after being outscored 19-3 in three games at home over the weekend. For the first time in 1,420 best-of-seven series across MLB, the NHL and NBA, the road team has won the first six games. Game 7 is Wednesday in Houston. What sort of wackiness is in store?\n\nAD\n\nAD\n\nRead more on the Nationals:", "description": "The Nationals' 7-2 win in Houston had a little bit of everything.", "authors": ["Scott Allen", "Reporter Covering D.C. Pro", "Local College Sports"], "top_image": "https://www.washingtonpost.com/resizer/FSzB6Mg07bXYU_V1o95eA2nqKOI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BOH64HX2YII6THQCDVC4WPP2R4.jpg", "published_at": "2019-10-30"}