{"pub": "breitbart", "url": "https://breitbart.com/border/2019/10/20/distressed-vehicle-assist-leads-to-arrest-of-multinational-migrants-in-maine", "downloaded_at": "2019-10-20 23:25:15.012580+00:00", "title": "Distressed Vehicle Assist Leads to Arrest of Multinational Migrants in Maine", "language": "en", "text": "Houlton Sector Border Patrol agents apprehended three migrants from three countries after stopping to assist a stranded motorist. Two of the migrants entered the U.S. illegally along the southern border while the third overstayed a visa.\n\nAgents assigned to the Rangeley Border Patrol station in Maine stopped to assist a motorist in a broken down vehicle on October 10. The agents determined that three men in the vehicle were illegally present in the United States, according to information obtained from Border Patrol officials.\n\nDuring an immigration interview, the agents learned that one of the men, a 42-year-old Chinese national entered the U.S. in 2001 on a fiancée visa, officials reported. The man did not marry as required as a condition of the visa and subsequently failed to depart from the country. A records check revealed a criminal record for domestic violence. Agents determined the migrant violated the terms of his visa and arrested him on immigration violations.\n\nA second migrant, a 22-year-old man from Guatemala, admitted to Border Patrol agents that he illegally entered the U.S. by crossing the Rio Grande into Laredo in 2013. An immigration court ordered his removal after he failed to appear before the court in 2013. He has previous arrests for public intoxication and trespassing.\n\nThe third migrant, a 25-year-old man from Mexico admitted to the Border Patrol agents that he illegally crossed the border into Arizona. He said he lived in the U.S. for several years and had been recruited to work in the foodservice industry in Maine.\n\nAgents turned all three illegal aliens over to immigration officers for processing into removal proceedings, officials stated.\n\n“The roads and highways of Maine are being used to facilitate illicit trade and travel. Securing the border requires us to not only give attention to the immediate border areas but also the routes and means of egress to the interior of the United States,” Houlton Sector Chief Patrol Agent Jason Owens said in a written statement.\n\n“Under Title 8 of the U.S. Code, it is a federal crime to enter the United States illegally and to misrepresent a material fact while seeking admission to the United States,” Houlton Sector officials stated.", "description": "Houlton Sector Border Patrol agents apprehended three migrants from three countries after stopping to assist a stranded motorist.", "authors": ["Bob Price"], "top_image": "https://media.breitbart.com/media/2018/02/Border-Patrol-arrests-illegal-immigrants.jpg", "published_at": "2019-10-20"}