{"pub": "reuters", "url": "https://in.reuters.com/article/us-ecb-policy-usa/ecb-action-hit-by-trump-as-hurting-u-s-exports-ups-pressure-on-fed-idINKCN1VX1JE", "downloaded_at": "2019-09-13 09:22:38.106043+00:00", "title": "ECB action, hit by Trump as 'hurting U.S. exports,' ups pressure on Fed", "language": "en", "text": "WASHINGTON (Reuters) - The European Central Bank’s move to cut interest rates and restart a larger stimulus program drew fast reaction from the White House on Thursday, with President Donald Trump saying the ECB was undercutting the value of its currency and “hurting U.S. exports.”\n\n“European Central Bank, acting quickly, Cuts Rates 10 Basis Points. They are trying, and succeeding, in depreciating the Euro against the VERY strong Dollar, hurting U.S. exports.... And the Fed sits, and sits, and sits. They get paid to borrow money, while we are paying interest!” Trump tweeted about half an hour after the ECB’s policy announcement.\n\nThe ECB’s aggressive move, which included a renewal of $20 billion euros in monthly bond-buying that will continue indefinitely, will add further pressure on the Federal Reserve to cut interest rates when it meets next week.\n\nThough a rate cut of a quarter of a percentage point was widely expected before the ECB meeting, the extent of the move in Frankfurt makes the case more compelling, adding downward pressure on U.S. inflation and feeding through to exchange rates that influence the price of U.S. exports — the issue highlighted by Trump.\n\nThe reaction in markets, however, showed the difficulty of predicting what the ECB’s new program will mean, particularly with the U.S. and China engaged in an unpredictable trade debate that could shape how the world economy performs.\n\nFollowing the ECB announcement the euro’s value against the dollar first dipped sharply to its lowest level in more than two years, before recovering all of that lost ground as investors questioned how long the central bank’s new bond-buying may go on. U.S. bond yields showed a similar pattern, first falling but then rising back to where they started amid news of possible progress on the trade discussion.\n\nU.S. stock markets opened slightly higher.\n\nStill, the euro has weakened by more than 4.6% versus the greenback this year, and White House trade adviser Peter Navarro told Fox Business Network in an interview that the expected quarter of a percentage point interest rate cut by the Fed next week was “not enough.”\n\n“You’ve got to look at what the Europeans just did. You’ve got to match that and raise it,” Navarro said. “The market just went up on ECB news, rallied strongly on ECB news. The question is: what did the fed funds futures do. Did the probability of 50 basis points go up?” Navarro said, referring to the size of a possible Fed rate cut.\n\nIt did not.\n\nInvestors in interest rate futures contracts tied to the Fed’s target policy rate have priced in a quarter of a point cut at a near 90 percent probability, with a similar reduction expected to follow in October.\n\nThe world’s major central banks, as well as monetary officials in China, are now in a global round of policy easing that has taken on an air of competition as elected officials battle over how to rewrite the rules for international trade.\n\nTrump, as he spars with China, has in recent months called on the Fed to restart its own “quantitative easing” program of bond purchases begun in the wake of the 2007 to 2009 financial crisis and recession. With the U.S. economy likely slowing as his re-election campaign looms next year, Trump on Wednesday said the U.S. central bank should follow Europe and drive rates below zero - the justification for his comment that “they get paid to borrow money.”\n\nThe ECB on Thursday cut it main policy rate from -0.4 percent to -0.5 percent. That setting, along with weak economic fundamentals, has led some European countries, most notably Germany, to be able to sell government bonds at negative rates, in effect taxing those who own them rather than paying a return.\n\nFed officials are skeptical that negative rates work well, and are concerned in particular about the impact they would have if applied to the world’s dominant currency. They also have seen no reason to begin asset purchases with the economy still growing and unemployment at a record low.", "description": "The European Central Bank's move to cut interest rates and restart a larger stimulus program drew fast reaction from the White House on Thursday, with President Donald Trump saying the ECB was undercutting the value of its currency and \"hurting U.S. exports.\"", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-12"}