{"pub": "investingcom", "url": "https://za.investing.com/news/forex-news/forex--weekly-outlook-sept-23--27-1959862", "downloaded_at": "2019-09-22 15:20:32.970114+00:00", "title": "Forex - Weekly Outlook: Sept 23 - 27", "language": "en", "text": "© Reuters.\n\nInvesting.com - Investors will be looking ahead to appearances by a number of Federal Reserve policymakers this week after last week’s Fed meeting pointed to growing divisions among officials over the future direction of monetary policy.\n\nEconomic data due this week, including a report on durable goods orders will be closely watched amid concerns over the strength of the economy.\n\nBrexit will also remain in the spotlight, with Britain's Supreme Court expected to make a ruling on whether Prime Minister Boris Johnson acted unlawfully in suspending parliament.\n\nInvestors will also be closely following developments after hopes for a breakthrough in the U.S. - China trade war receded further on Friday, when Chinese officials unexpectedly canceled a visit to farms in Montana and Nebraska.\n\nThe , which measures the greenback against a basket of currencies rose on Friday, and posted its first weekly increase in three, helped by hopes that the Fed would not lower rates aggressively.\n\nThe Fed cut interest rates for the second time this year on Wednesday, but gave mixed signals on future rate cuts.\n\nOther major central banks, including the Bank of England, the Bank of Japan and the Swiss National Bank, left rates unchanged last week.\n\nSterling retreated from multi-month highs versus the and the after the Irish foreign minister said that London and the European Union were not yet close to a Brexit deal.\n\nSterling had briefly been the biggest gainer against the dollar overnight after European Commission President Jean-Claude Juncker said late Thursday he thought Brussels could reach agreement with Britain on its departure from the European Union.\n\nThe fell 0.2% on the day to 1.1015, while the greenback slipped 0.4% to 107.55 .\n\nThe was down to near three-week lows at 0.6768 in late trade. The sagged to 0.6259 ahead of this week’s upcoming monetary policy decision by the country’s central bank.\n\nAhead of the coming week, Investing.com has compiled a list of significant events likely to affect the markets.\n\nMonday, Sept 23\n\nEurozone - PMI’s\n\nECB President Mario Draghi speaks\n\nU.S. - Flash PMI’s\n\nFOMC Member Williams speaks\n\nFOMC Member Bullard speaks\n\nTuesday, Sept 24\n\nGerman Ifo business climate\n\nU.S. - CB consumer confidence\n\nWednesday, Sept 25\n\nReserve Bank of New Zealand interest rate decision\n\nFOMC Member Evans speaks\n\nFOMC Member George speaks\n\nU.S. - New home sales\n\nThursday, Sept 26\n\nU.S. - Final Q2 GDP\n\nU.S. - Initial jobless claims\n\nECB President Mario Draghi speaks\n\nBank of England Gov Carney speaks\n\nFOMC Member Bullard speaks\n\nPending home sales\n\nFOMC Member Clarida speaks\n\nFriday, Sept 27\n\nU.S. -Durable goods orders\n\nU.S. - Personal income and spending\n\n--Reuters contributed to this report", "description": "Forex - Weekly Outlook: Sept 23 - 27", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPECAD01M_L.jpg", "published_at": "2019-09-22"}