{"pub": "cnn", "url": "https://cnn.com/2019/09/23/health/ebola-who-tanzania-intl/index.html", "downloaded_at": "2019-09-23 10:35:02.810514+00:00", "title": "Tanzania is not sharing information on suspected Ebola cases, WHO says", "language": "en", "text": "(CNN) The World Health organization says Tanzania is not sharing information about suspected cases of Ebola \"despite several requests.\"\n\nThe UN health body said Saturday that the African country had not given WHO access to clinical data, results of investigations, possible contacts and potential laboratory tests -- information needed to \"fully assess the potential risk.\"\n\nThe country's health ministry didn't immediately respond to a CNN request for comment. An Ebola outbreak in neighboring Democratic Republic of Congo, that has killed more than 2,100 people has been declared an international health emergency . Tanzania has never reported a case of the highly infectious disease , which has a high fatality rate.The country's health ministry didn't immediately respond to a CNN request for comment.\n\nWHO said it was made aware of the death of a person suspected to have Ebola in the country's largest city Dar es Salaam via unofficial reports on September 10. A day later, WHO said it received unofficial reports that the deceased had tested positive for the disease and on September 12, WHO was informed by unofficial sources of a 27-year-old patient suspected to have Ebola in a hospital in Dar es Salaam.\n\nOn September 14, Tanzania officially notified the WHO that no case of Ebola had been confirmed in the country, with the two suspected cases both testing negative. However, WHO said Tanzania did not give details on the cause of illness.\n\nRead More", "description": "The World Health organization says Tanzania is not sharing information about suspected cases of Ebola \"despite several requests.\"", "authors": ["Katie Hunt"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190718154746-02-ebola-outbreak-drc-cnnphotos-super-tease.jpg", "published_at": "2019-09-23"}