{"pub": "businessinsider", "url": "https://businessinsider.com/how-to-use-amex-platinum-uber-credit", "downloaded_at": "2019-09-20 23:01:51.533144+00:00", "title": "Amex Platinum cardholders get up to $200 in Uber credits every year — here's how the perk works", "language": "en", "text": "American Express\n\nThe Amex Platinum offers cardholders up to $200 in Uber credits each card-member year. This perk was added to the card in 2017, part of the card's big relaunch.\n\nThe credit credit is broken into monthly chunks. At the start of each month, you'll get $15 of credits added to your Uber account, with a $20 bonus each December (for a total of $35 that month).\n\nIn addition, your account will be upgraded to Uber VIP status. There aren't a ton of perks with this, and it's only available in certain cities, but with the Uber VIP program, you'll only be connected to drivers rated 4.8 stars or higher. Uber also says that Uber VIP drivers have \"high-quality cars.\"\n\nIf you travel on a regular basis or live anywhere near most cities, this is an easy perk to get value from. You can also put the credits toward Uber Eats orders.\n\nRead more: The best rewards credit cards of 2019\n\nTo get the credit, just add your new Amex Platinum to your Uber account as a payment method. You don't actually have to use the card to pay; as long as you have it stored in your account you'll get the credits and VIP status.\n\nTo use the credits, make sure to select your Uber cash from the drop-down menu of payment methods before you confirm your ride request.\n\nRead more: Amex Platinum card review\n\nThere are a ton of other benefits to the Amex Platinum in addition to the maximum of $200 in annual Uber credits. In fact, it's easy to get at least $1,000 in value each year — counting the 60,000-point welcome bonus (after I spent $5,000 in the first three months), I got a massive $2,000 of value in my first year with the card.", "description": "The American Express Platinum Card offers up to $200 in Uber credits each year, in the form of monthly credits. Here's how you can get them.", "authors": ["David E. Slotnick"], "top_image": "https://amp.businessinsider.com/images/5c94cadfee52ef1025494772-1920-960.jpg", "published_at": "2019-09-20"}