{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/intel-veterans-react-barr-requests-foreign-officials-russia-probe-origins-2019-9", "downloaded_at": "2019-10-01 00:11:35.021171+00:00", "title": "'Pure insanity': Intelligence veterans are floored by Barr's 'off the books' overtures to foreign officials about the Russia probe", "language": "en", "text": "Intelligence veterans were puzzled by revelations that Attorney General William Barr personally urged foreign officials to cooperate with a Justice Department investigation into the origins of the Russia probe.\n\n\"This is unheard of,\" one former senior Justice Department official who worked closely with the former special counsel Robert Mueller when he was FBI director, told Insider.\n\nThe Washington Post reported that Barr has already made overtures to British intelligence officials about the matter and traveled to Italy last week to ask senior Italian officials to cooperate with the inquiry.\n\nThe New York Times reported that Barr also asked President Donald Trump to ask the Australian prime minister to cooperate with the investigation. And Trump named Barr as his personal envoy when making a similar request in July to Ukrainian President Volodymyr Zelensky.\n\n\"There are people at DOJ whose whole job is to coordinate investigative efforts with foreign governments,\" a longtime former federal prosecutor told Insider. \"Makes a person wonder why Barr didn't trust them to do this stuff. Something he didn't trust career-DOJ people to do? Something more political than justice-related?\"\n\nVisit Business Insider's homepage for more stories.\n\nNational security veterans were flummoxed Monday by revelations that Attorney General William Barr traveled overseas and personally asked top foreign intelligence officials to help with a Justice Department inquiry into the origins of the Russia investigation.\n\nThe Washington Post reported Monday that Barr has already made overtures to British intelligence officials and last week traveled to Italy, where he and John Durham, the US attorney in charge of investigating the Russia probe's origins, asked senior Italian government officials to assist with Durham's work. The report said it was not Barr's first trip to Italy to meet with intelligence officials.\n\n\"This is unheard of,\" one former senior Justice Department official who worked closely with the former special counsel Robert Mueller when he was FBI director, told Insider.\n\nJohn Sipher, a longtime former CIA clandestine services officer, agreed.\n\n\"This is pure insanity,\" he wrote. \"First of all its really dumb to think foreign services trust Barr more than their regular interlocutors. Also, it is crazy that people like Barr actually believe large groups of people were secretly conspiring in an election.\" Sipher was referring to Trump's and his allies' claims that senior officials in the FBI and DOJ manufactured the Russia probe to undermine his chances at winning the 2016 race.\n\nRobert Deitz, a former top lawyer at the CIA and NSA, also said he hasn't heard \"of so much involvement by the attorney general in this sort of investigation.\"\n\n\"This is work for the gumshoes,\" he told Insider. Barr's involvement is all the more unusual, Deitz added, given Durham's reputation. \"I have worked with John Durham. He is absolutely a straight shooter. What he says one can rely on.\"\n\nRead more: Trump pressed Australia's prime minister to help AG Barr investigate the origins of the Russia probe\n\nDurham is one of three people tasked with probing the roots of the Russia investigation. The Justice Department's inspector general, Michael Horowitz, is looking into the FBI's application for a Foreign Intelligence Surveillance Act (FISA) warrant to surveil a top Trump campaign aide, Carter Page, who was suspected of acting as an unwitting foreign agent during and after the 2016 campaign.\n\nAnd John Huber, the US attorney in Utah, is currently reviewing other aspects of the Russia investigation.\n\nTo date, there is no evidence that the DOJ or the FBI acted improperly while investigating the Trump campaign.\n\nEarlier Monday, The New York Times reported that Barr asked President Donald Trump to urge Australian Prime Minister Scott Morrison to cooperate with the inquiry as well. Trump is said to have called Morrison in recent weeks and relayed Barr's request. The Associated Press reported that the call was one of a \"number of times\" Trump made similar calls at Barr's behest.\n\nAnd in a July 25 conversation with Ukrainian President Volodymyr Zelensky, Trump repeatedly pressured Zelensky to work with Barr and his personal lawyer, Rudy Giuliani, to help discredit the Russia probe, as well as to investigate former Vice President Joe Biden and his son.\n\nThe call is at the center of an explosive whistleblower complaint that US intelligence official filed against Trump. It mentioned Giuliani 31 times and described him as a \"central figure\" in Trump's efforts. It added that Barr \"appears to be involved as well.\"\n\nRead more: Trump told 2 top Russian officials in 2017 that he wasn't bothered about Russia's election meddling\n\nIt's \"absolutely very unusual for the AG to get involved in making such requests,\" Patrick Cotter, a former federal prosecutor who was part of the team that convicted the Gambino crime family boss John Gotti, told Insider. \"There are people at DOJ whose whole job is to coordinate investigative efforts with foreign governments. Makes a person wonder why Barr didn't trust them to do this stuff. Something he didn't trust career-DOJ people to do? Something more political than justice-related?\"\n\nElie Honig, a former federal prosecutor from the Southern District of New York, echoed that view.\n\n\"There are established procedures through which DOJ can and does coordinate with foreign governments and prosecutors,\" he told Insider. \"It'll be important to figure out if the AG went through these proper channels or tried to do it off the books, so to speak.\"\n\nIn May, the president granted Barr broad authority to declassify materials related to the roots of the Russia investigation.\n\n\"The attorney general is one of the most respected people in this country and he has been for a long period of time,\" Trump told reporters at the time. \"He is going to look at a lot of documents. Some he might find interesting; maybe he'll find none interesting. He can look. And I hope he looks at the UK, and I hope he looks at Australia, and I hope he looks at Ukraine.\"\n\nBarr's close involvement in Durham's investigation, as well as his apparent involvement in discussing the matter with officials in Australia, the UK, and Ukraine, illustrates the importance he places on Trump's calls to \"investigate the investigators.\"\n\nAnd current and former officials told the Post they were frustrated Barr has taken on such an integral role in investigating what they characterized as baseless conspiracies and allegations of misconduct.\n\nRead more: 'This was his show': Rudy Giuliani emerges as the key to unraveling the Trump-Ukraine whistleblower scandal\n\nIndeed, it's not the first time the attorney general has endorsed the president's theories without evidence.\n\nThe FBI crossed \"a serious red line\" by investigating Trump's campaign, he alleged in May.\n\nA month earlier, he said he believed the FBI was \"spying\" on the Trump campaign, echoing a popular conspiracy theory in right-wing circles.\n\n\"I think spying on a political campaign is a big deal,\" Barr said, adding that he believed \"spying did occur.\"\n\nWhen lawmakers pressed Barr on that, he acknowledged he didn't have information to support his claim, saying, \"I have no specific evidence that I would cite right now, I do have questions about it.\"\n\nIn March, he circumvented Mueller's team when he determined that Trump did not obstruct justice in the Russia investigation, despite the fact that prosecutors found 11 potential instances of obstruction and emphasized that their report \"does not exonerate\" the president, and that if they had confidence Trump did not commit a crime, they would have said so.\n\nAnd in 2017, before Trump tapped him to be attorney general, Barr sent a memo to the Justice Department claiming Mueller's obstruction inquiry was \"legally insupportable.\"", "description": "\"I have not heard of so much involvement by the attorney general in this sort of investigation. This is work for the gumshoes.\"", "authors": ["Sonam Sheth"], "top_image": "https://image.businessinsider.com/5d9283242e22af52e82a3a93?width=1200&format=jpeg", "published_at": "2019-10-01"}