{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/09/which-former-pros-have-played-sunday-league-football-after-retiring-the-knowledge", "downloaded_at": "2019-10-09 18:47:35.866540+00:00", "title": "Which former pros have played Sunday league football after retiring? | The Knowledge", "language": "en", "text": "Plus: dull Match of the Day highlights, theoretically playing more than 100 games in a season and a hat-trick of corners\n\n“I recently stumbled upon this article about Tony Hibbert signing for an unbeaten Sunday league team in 2017 and missing a penalty for them in a 1-0 defeat on his debut. Which other former professionals have extended their careers into Sunday league football after retiring,” asks George Jones.\n\nThe smell of liniment oil and the thrill of almost being cut in two by a hungover centre-back would appear to be quite the draw for ex-pros as there have been a few turning out for Sunday teams over the years. “I remember Julio Arca, formerly of Sunderland and Middlesborough, playing for his local team Willow Pond FC in Sunderland for a period after he retired in 2013,” writes Robert Kelly. “He later played for South Shields at a higher standard.”\n\nAli Tabari can go one better. He has a former Premier League player being managed by a former Premier League player in the pock-marked fields of Warwickshire. “My friend until recently played for a team near Solihull captained by Stiliyan Petrov, and managed by David Busst. Their main rivals in the league were a team containing Lee Carsley (having played against him, I confirm he is an absolute beast!). All this makes me glad I gave up 11-a-side when I did.”\n\nThey think it’s all over: ex-footballers on life after the final whistle Read more\n\nThat rival team must have been Monica Star FC, Ali. They fielded a team containing four former Premier League players: Carsley, Lee Hendrie, Darren Byfield and Paul Devlin. The club’s Twitter page boasts that they are “quadruple winners”. It’s little surprise they’re bossing the Central Warwickshire over-35s league with that lineup.\n\n“Although technically not Sunday league, former Manchester City winger Martin Petrov turned out for Torpedo Chorlton, a Saturday side but a wholly amateur team outside of the pyramid proper,” reports Matthew Durrant. “His presence couldn’t stop them losing 4-1, though he did score this peach.”\n\nIn September 2017, former Stoke striker Ricardo Fuller played for Grange Park Rangers [in the second division of the Potteries and District league]. He turned up late, scored a penalty and then left early to watch his son’s game on a neighbouring pitch. Former Marseille and Sheffield Wednesday winger Chris Waddle brought his flicks and tricks to the Meadowhall Sheffield & District Sunday Football League when he retired, playing regularly for Brunsmeer Athletic. He also turned out for Hallam FC, in the Northern Counties East League (tier 10 of the pyramid) when he was well into his 50s.\n\nRounding things off is this tale from Malaysia. “My team plays in a Sunday social league in Kuala Lumpur,” begins Nick Williamson. “It’s normal to look across to see who your opposite number is. In one particular match I did the same – and saw George Boateng lining up for KL Galaxy. The same league has featured Kevin Cooper (Stockport, Wolves, Cardiff) and Paul Parker.” We’re guessing you had a tough afternoon, Nick.\n\nToo dull by half\n\n“I seem to recall that in an episode of Match of the Day once, a match had such an abysmally uneventful first half that Gary Lineker introduced the highlights package by explaining that they were jumping straight to the second half,” writes Jack Scourfield. “Was this a unique occurrence on the show and, if so, can anyone remember what the unmemorable fixture was?”\n\nIt’s not unique. We’ve had a fair few emails from readers who can remember far-from-memorable MOTD highlights. Here’s Glen Cheney: “Back in the early 1960s, Sheffield United played at Fulham and Match of the Day said the first half was so bad they were only showing second-half highlights. In those days they only covered two games.”\n\nJohn Sandford adds: “I seem to remember in either 1969 or 1970 MOTD skipped the first half of Chelsea v Wolves as not a lot happened. The second half livened up, ending 2-2.”\n\n“In 1971 when Portsmouth hosted Arsenal in the fourth round of the FA Cup, MOTD showed only the Arsenal goal from the first half, then showed extended highlights of the second,” writes Dave Lee. “The excuse was that nothing much beside the goal happened in the first half, and much excitement was to be had from Pompey attacking relentlessly in the second, finally grabbing an equaliser through Mike Trebilcock. I can’t recall Jimmy Hill’s exact words to explain the rationale, but I do remember him concluding with: ‘And what a second half it was!’”\n\nAs for the Lineker story …\n\nNiki Halsey (@NikiHalsey76) The game where Lineker cut straight to the second half was Birmingham v Fulham. I genuinely have no idea how I know this. My guess it was the game that finished 2-1 to Fulham in Jan 05 as all the goals were in the second half\n\nTheoretically now playing more than 100 games in a season\n\n“At the risk of getting silly, I must make a point re: the question of the maximum possible number of games in a season,” begins Andy Sanders. “Dan and James (last week) were right to suggest that a team could play more than 96 games – if they tie with another team for a play-off place. However, they have metaphorically missed an open goal, which I now fully intend on booting over the line from two yards.\n\n“What the pair of them fail to consider is that it is possible for more than two teams to end up on the same points/GD/disciplinary record etc, right on the brink of the play-offs – and this is what Regulation 9.8 is alluding to when it states that ‘a game or games’ may be used to separate out end positions. This could mean say three, four or even five teams ending up level – and resulting in a round robin to separate them (giving us 100 games.)\n\n“However, there is nothing (in theory) to stop every game in the league ending 0-0, meaning every league place (including the play-offs) needs to decided by a round robin - ie 23 extra games, but at that point I think we might be getting a bit too silly …”\n\nKnowledge archive\n\n“Last Saturday, Worthing’s Mark Pulling scored a hat-trick direct from corner kicks,” wrote Robin Burchfield in March 2004. “This must be some kind of record, surely?”\n\nWell, kind of, Robin. Believe it or not, it has been done before. An 11-year-old, Steve Cromley, managed three in one half in January 2003 for Ash Green United in Warwickshire, booking a place in the Guinness Book of Records in the process. He beat another whippersnapper, Daniel White from Somerset, who scored three over 90 minutes. But even that achievement was subsequently eclipsed …\n\n• For more from the font of nerdvana, click this thing here.\n\nCan you help?\n\nTim Ward (@timmyward) @TheKnowledge_GU Jack Ross is given a goat every time Sunderland win a game. Do any other football teams receive unusal gifts after victories? https://t.co/67MD4gJ0Pl\n\n“The team I support, West Didsbury & Chorlton AFC, play in the North West Counties Football League Division One South – which contains three of the four cardinal directions in its name. The Northern Premier League South East division can match that, but I’ve not yet found a league with all four directions in – is there one,” asks Matthew Durrant.\n\nJoe Turner (@Chadderz1993) With Leon Clarke making his Premier League debut at the age of 34 for Sheffield United against Liverpool; who is the oldest debutant in a top division?\n\nScott (@scottnwebster) What’s the furtherest distance a player has scored from with a backheel? Scott\n\n“After Beth England’s goal against Brazil on Saturday, I couldn’t help but wonder: who’s the most successful goalscorer in international football to share a name with the country they represent?” wonders Joe Reaney.\n\nJack Tanner (@mrjacktanner) Has a football club director/owner ever caused as much of a diplomatic incident as the current China/Houston Rockets fallout?\n\nEmail your questions and answers to knowledge@theguardian.com or tweet @TheKnowledge_GU.", "description": "Plus: dull Match of the Day highlights, theoretically playing more than 100 games in a season and a hat-trick of corners", "authors": ["Guardian Sport"], "top_image": "https://i.guim.co.uk/img/media/f4f08e7f690a14307c761d1dc2e066d0258b06c3/0_39_5184_3110/master/5184.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c7b135eb882bf5e60393bb051e65e060", "published_at": "2019-10-09"}