{"pub": "independent", "url": "https://independent.co.uk/independentpremium/travel-questions/thomas-cook-collapse-latest-price-hike-hong-kong-protests-safety-india-visa-a9152031.html", "downloaded_at": "2019-10-12 00:19:45.175438+00:00", "title": "Why has Thomas Cook’s collapse led to price hikes?", "language": "en", "text": "Q I booked a flight from Bristol to Lanzarote for March 2020 with Thomas Cook, which I have now lost (and am claiming from my credit card, hopefully). My query is: other airlines have now hiked up their prices ridiculously. Is this legal? It seems to me that they are preying on the victims of the Thomas Cook problem. Also should I rebook as soon as possible or wait to see if another carrier takes over in Bristol and/or if prices come down?\n\nBarbara H\n\nA Aviation can seem a harsh industry. Within minutes of the collapse of Thomas Cook, fares on its surviving rivals ratcheted up, just as they are designed to do when demand surges.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWhile passengers booked on Thomas Cook flights to the UK up to yesterday were flown home by the Civil Aviation Authority, travellers urgently seeking outbound flights were forced to pay three or four times the going rate. Actually that’s not quite true: they chose to pay such fares. No one forced them. And the airlines did what they have been doing for decades: charging the highest fares they can extract while filling as many seats as possible.\n\nOne day a government might choose to stipulate maximum fares – just as, in the bad old days of the 1970s, they fixed minimum fares. But I am not sure price control would do travellers many favours. Airlines work on tight margins in a ferociously competitive market. The sums only work because, at times of high demand, they increase fares to as much as the market will bear.\n\nI imagine you originally found a good fare on Thomas Cook: Bristol to Lanzarote in March is low season. But that makes me pessimistic that another airline will launch services on the route before Easter. While easyJet, Jet2 and Ryanair have an incentive to move in to former Thomas Cook routes for the profitable summer season, expansion will require them to acquire new aircraft and staff to fly them. This winter it is especially tricky for airlines to find narrow-bodied jets of the kind suitable for flights between the UK and the Canaries, because the Boeing 737 Max is grounded after two fatal crashes. While Tui has announced large-scale expansion plans, these are unlikely to materialise until Easter.\n\nMy advice: if you are set on flying from Bristol, buy now and lock into the fare. But if you are prepared to travel to another UK airport – Birmingham, Luton or Gatwick in particular – then fares for March are likely to be reasonably low if you start looking in January 2020.\n\nQ I know you have written a lot about e-visas for India, but I wonder if you can help me with the following questions. I am going on my first visit to India, in November for three weeks, and wonder whether to go for the simple $25, 30-day visa or opt for one which will allow me to return? I also don’t know what to do about “occupation”. I am semi-retired but still do some consultancy and some writing. What should I say?\n\nFinally, the online form demands to know where I will be going. I plan to fly in and out of Delhi, and aim to visit Jaipur and Agra, but that’s just a start – I simply don’t know where else I’ll end up. What should I do?\n\nAnne S\n\nA While India’s e-visa scheme is a great improvement on the full visa – which requires a visit to an issuing office – it is still far from simple. (By comparison, the new Saudi e-visa is as easy as anything.)\n\nI urge you to go for the maximum-duration e-visa possible – five years – if your passport is valid for that long. While it costs $80, ie more than three times as much as the shortest, it could prove a wise investment. As you are semi-retired I presume you will have the opportunity to go back to this welcoming, diverse country again and again. If you make two more visits in that time, you will have “overpaid” by $5 – but you will have avoided the onerous business of applying on each occasion.\n\nWhile you should always be honest when applying for any visa, as you have a number of different occupations available I recommend that you choose “consultant”. The trouble with “retired” is that a pernickety official might suspect that you intend (as some older British people do) to take up semi-residence in India and outstay your visa. “Writer” would be even worse: this could be interpreted as “journalist”, whereupon you may be refused an e-visa and could find even getting a full tourist visa tricky.\n\nFor “the places to visit” question, I recommend you just list the so-called golden triangle of Delhi, Jaipur and Agra – the latter is the home to the Taj Mahal. You are not limited to just these. As far as I know the only locations within India where you cannot automatically go without a separate permit are some Himalayan areas and the Andaman and Nicobar Islands.\n\nFinally, I recommend you book neither flights nor accommodation until you have been granted an e-visa. I hear too many stories of prospective travellers who get into a bureaucratic nightmare of red tape, usually for unknown reasons, and find they cannot board their flight to India.\n\nQ I am part of a small group of women who are heading for Athens. We are staying out on the coast at Glyfada but we know there are decent transport links to the centre. What are your recommendations for eating out, and perhaps one or two non-obvious sights?\n\nBev K\n\nA October is an excellent month to visit the Greek capital because the extreme crowds of summer have mostly dispersed yet there is plenty of warmth in the air – making al fresco dining a pleasure. You might even dip a toe into the Aegean at your beach suburb southwest of the city. While Glyfada has plenty of bars and restaurants, I imagine you will spend most of your time in the heart of Athens. There are some truly terrible and overpriced places to eat in the city centre, and I have mistakenly eaten in a number of them.\n\nBut on my last visit in June I made some good new discoveries. I was staying near Iroon Square in the Psyri area – good and central, with plenty of alluring options on the square itself for breakfast. Just west from there, along Agios Anargiron at number 19, is Nikitas: look for the big blue-and-white striped awning. Since 1967 it has been an excellent neighbourhood taverna, serving simple, fresh staples (particularly the Greek salad) at very reasonable prices: €10 for a main course.\n\nIn the skirts on the northern side of the Acropolis, you can barely move for eating options on Lisiou Street, which follows a contour around the hill. I like Melina at number 22, which has many echoes of the actor and politician Melina Mercouri, and just a little further along to the west a terrace of tables fills the steep cross-streets.\n\nThis is also a great place to begin a walk right around the mid-levels of the Acropolis, which is well worthwhile – you will encounter a lovely island village built by the people they brought in from the Dodecanese to smarten up the capital. Finally, the changing of the guard outside the national palace is hardly a hidden gem, but as a piece of kitsch theatre it is unmatched in southeast Europe. Just be there at 11am on Sunday for the full Pythonesque performance.\n\nQ In January we booked a family holiday to Hong Kong and are due to travel on 19 October for a week. The escalating riots in Hong Kong are causing safety concerns and the disruption to public transport is likely to cause problems for our visit. I have decided to cancel my trip. I am able to get a refund for my accommodation but most likely will not be getting any money back for my flights. What can I do? The flights involve a stopover at Helsinki, and I was told that I cannot use that leg of my flight for a week away in Finland. Why?\n\nName withheld\n\nA Over the past few months, as you have seen, large-scale political demonstrations have taken place across this “special administrative region” of China. The Foreign Office travel advice on Hong Kong says: “While a number of peaceful activities have taken place, many other protests have led to clashes between police and protesters involving significant violence. The situation around protests and public gatherings can change quickly, with the potential for violence, especially during unauthorised protests.”\n\nMost recently the entire Mass Transit Railway (MTR) was shut down. The Foreign Office has, though, stopped short of recommending against travel.\n\nI urge you not to cancel your trip but to see how things look on the day you are due to fly. The situation may have calmed down by then and you can travel as planned (you will have no problem getting accommodation; the continuing unrest in Hong Kong is devastating travel to the city). Alternatively you can instead make an immediate side trip to Macau, the fascinating ex-Portuguese colony, which is easily accessible by ferry from Hong Kong airport, and has remained peaceful. It would be an agreeable place to spend a week. You could also travel to another nearby destination such as Taiwan by buying a separate flight.\n\nAs things stand, Finnair will take the view that you bought a specific product, ie flights from the UK to Hong Kong, and agreed it was non-changeable. Many airlines impose these conditions. You might be able to travel out as far as Helsinki and discard the rest of the ticket, buying a separate flight to come home, but nothing more.\n\nEmail your question to s@hols.tv or tweet @simoncalder", "description": "Q I booked a flight from Bristol to Lanzarote for March 2020 with Thomas Cook, which I have now lost (and am claiming from my credit card, hopefully). My query is: other airlines have now hiked up their prices ridiculously. Is this legal? It seems to me that they are preying on the victims of the Thomas Cook problem. Also should I rebook as soon as possible or wait to see if", "authors": ["Simon Calder"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/23/12/Thomas-Cook-collapse-13.jpg", "published_at": "2019-10-11"}