{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/johnson-and-johnson-ceo-talcum-powder-poster-child-for-lawsuits-2019-10-1028605454", "downloaded_at": "2019-10-16 23:17:25.503329+00:00", "title": "Talcum powder has unfairly become the 'poster child' for class-action lawsuits against Johnson & Johnson, its CEO says", "language": "en", "text": "Reuters\n\nThe top boss at Johnson & Johnson has accused lawyers of splurging hundreds of millions on advertising to build class-actions lawsuits that falsely claim the talc in its products cause cancer.\n\nTalc, a mineral in baby powder and other drying products, is \"the poster child for how big a business plaintiffs' attorneys have made this type of approach,\" CEO Joseph Wolk said on the healthcare giant's third-quarter earnings call.\n\nThere were 15,500 plaintiffs tied to talcum lawsuits against Johnson & Johnson as of June 30, and the company is appealing a $4.7 billion jury award to 22 women and their families last year, the Wall Street Journal reported.\n\nWatch Johnson & Johnson trade live.\n\nJohnson & Johnson's boss has accused lawyers of splurging hundreds of millions on advertising to build class-action lawsuits that falsely claim the talc in its products cause cancer.\n\nTalc, a mineral in baby powder and other drying products, is \"the poster child for how big a business plaintiffs' attorneys have made this type of approach,\" CEO Joseph Wolk said on the healthcare giant's third-quarter earnings call. Johnson & Johnson is also fending off class-action lawsuits centered on its anti-psychotic drug Risperdal and its role in fueling the opioid crisis.\n\n\"The plaintiffs bar in total has spent over $400 million this year alone in advertising on TV, trying to drum up the numbers in class-action suits,\" Wolk continued. \"It's become a $36 billion industry.\"\n\nHowever, Johnson & Johnson has repeatedly denied that talc is dangerous.\n\n\"We're going to continue to defend a product that we know to be safe, that we know does not cause cancer,\" Wolk said. \"That's not just the opinion of Johnson & Johnson's scientists, that's the opinion of respected institutions like the National Cancer Institute, the FDA and numerous prestigious universities.\"\n\nOther experts aren't so sure. \"It is not clear if consumer products containing talcum powder increase cancer risk,\" the American Cancer Society says on its website.\n\nThere were 15,500 plaintiffs involved in talcum-powder lawsuits against Johnson & Johnson as of June 30, up from 1,400 in early 2016, the Wall Street Journal reported.\n\nThe company continues to battle the claims. It has appealed a $4.7 billion jury award to 22 women and their families who alleged its baby powder caused ovarian cancer, the Journal said. Moreover, Reuters reported a Missouri appeals court overturned a $110 million verdict against the company this week — although that was because an out-of-state plaintiff brought the case.\n\nRead more: Investors are paying record amounts for stable high-growth companies. Here are 12 sleeper stocks Goldman says can deliver growth at budget prices.", "description": "The top boss at Johnson & Johnson has accused lawyers of splurging hundreds of millions on advertising to build class-actions lawsuits that falsely cl...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5da77af24af90922e6500985-2400/rts4s6q.jpg", "published_at": "2019-10-10"}