{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7613325/Ciara-relies-opinions-children-Future-5-Sienna-2-releasing-new-music.html", "downloaded_at": "2019-10-25 16:43:52.215542+00:00", "title": "Ciara relies on the opinions of her children Future, 5, and Sienna, 2, when releasing new music", "language": "en", "text": "It's been 15 years since she released her debut album Cookies, which immediately catapulted her to fame, thanks to a string of hit singles.\n\nAnd Ciara, 33, has revealed that she now relies on the intuition of her children - son Future, five, and daughter Sienna, two - when it comes to figuring out whether she's got another chart-topping track on her hands.\n\nDuring an appearance on The Ellen DeGeneres Show, the 1, 2 Step hitmaker told guest host Justin Hartley of her adorable offspring: 'They’re like my little A&Rs.\n\nFamily affair: Ciara has revealed that she now relies on the intuition of her young children when it comes to figuring out whether she's got another chart-topping track on her hands\n\n'They let me know if something is right or if it’s not. And they are like 10 for 10 with their reaction. The way you kind of know, the songs have to have the ABC element.\n\n'So when they hear a song, and they can sing it back within the next few hours or right after hearing it, you know you’re onto something right. And that’s how they were with songs like Level Up.'\n\nCiara has been married to Russell Wilson since 2016, and together they share two-year-old Sienna. She also shares five-year-old Future with rapper ex Future.\n\nMother: The 1, 2 Step hitmaker is doting mother of son Future, five, and daughter Sienna, two\n\nLove and marriage: The Texas-born beauty raises the children with her husband Russell Wilson. Her eldest child is from her previous relationship with rapper Future\n\nThe Texas-born beauty's musical career started in 2003 shortly after she graduated high school and was signed to LaFace records.\n\nShe recently marked the 15th anniversary of her debut single Goodies which spent seven weeks at number one on the Billboard Hot 100.\n\nCiara told Billboard in an interview celebrating the track's anniversary: 'I can’t even believe it’s 15 years ago, it’s blowing my mind.'\n\nThe singer was just 18 years old when Goodies debuted and topped the Billboard charts. Ciara made history as the first woman to take on the Crunk N' B genre founded by Lil Jon.\n\nMoguls in the making: During an appearance on The Ellen DeGeneres Show, the 1, 2 Step hitmaker told guest host Justin Hartley of her adorable offspring, 'They’re like my little A&Rs'\n\nBirthday: Ciara's appearance on the show airs on Friday, which also happens to be her birthday\n\nPutting in an appearance: Ellen's resident DJ Stephen 'tWitch' Boss also put in an appearance\n\n'I graduated when I was 17 years old and I was on camera going, \"I see myself having a No. 1 song on the Billboard chart and da da da,\" and I was declaring what I foresaw happening or what I believed could happen.\n\n'What Lil Jon did was historic for music, because he came in with the fresh sound and he went against the grain of what traditional pop was at that time period,' she explained to the outlet.\n\n'And I was the first girl to do it. So I was really proud of that and will forever be proud of it.'\n\nShe recalled the first time she heard the song on the radio in an Atlanta fast food restaurant, which is what she calls the second 'my dream came true in every way I could have imagined and more.'\n\nThe Hotsteppers: Ciara and tWitch soon kept the crowd entertained with their dance moves\n\nMoves: Ciara showed off a number of the gravity-defying moves that helped make her famous", "description": "During an appearance on The Ellen DeGeneres Show, the 1, 2 Step hitmaker told guest host Justin Hartley of her adorable offspring: 'They're like my little A&Rs.'", "authors": ["Ryan Smith For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/12/20176126-0-image-a-70_1572001259303.jpg", "published_at": "2019-10-25"}