{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/judy-finnigans-savage-jibe-boris-20722532", "downloaded_at": "2019-10-25 16:21:26.619201+00:00", "title": "Judy Finnigan's savage jibe at Boris Johnson as she grills Jeremy Corbyn on election", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJudy Finnigan savaged Boris Johnson with a brutal put-down while grilling Jeremy Corbyn on his plans to call for a general election .\n\nThe veteran TV presenter, who returned to the This Morning sofa alongside husband Richard Madeley for a one-off special, made her feelings towards the prime minister crystal clear.\n\nWhile she and Richard were asking the Labour leader about Mr Johnson's plans to hold an election on December 12, Judy pointed out that it wouldn't be a particularly good date for the country.\n\n\"The other thing is, turnout just before Christmas wouldn't be very good, would it?\" she asked him.\n\n(Image: ITV)\n\n(Image: ITV)\n\n\"Now look, the December 12 date is very odd, for many reasons. It's so near Christmas, it's after universities have ended their terms, there's lots of things very odd about that date,\" said Mr Corbyn.\n\n\"So will there be an election next year?\" Richard interjected.\n\n\"Well, maybe before that, before December 12. I don't know what date the election will end up being because there's got to be discussions about that, but I think what you're saying is absolutely right,\" said the Labour leader.\n\n(Image: ITV)\n\n\"I want an election, yes, to deal with Brexit , but also all the other issues about how we invest in all parts of this country.\"\n\nThe presenters then pointed out that the Queen's Speech was voted through parliament.\n\nMr Corbyn exclaimed: \"He pulled the parliamentary accountability of the Brexit bill that he put forward. This is a very strange prime minister running parliament in a very strange way.\n\n(Image: ITV)\n\n\"You can say that again,\" muttered Judy under her breath while rolling her eyes down towards the floor.\n\nTwitter users exploded with glee at her savage put-down.\n\n\"You have [to] love Judy!\" one chuckled.\n\nAnother tweeted: \"Judy Finnegan on Boris Johnson Dead!\"\n\n*This Morning airs weekdays from 10.30am on ITV", "description": "Judy Finnigan and her husband Richard Madeley returned to the famous This Morning sofa today - and Judy made it clear how she feels about the prime minister", "authors": ["Emmeline Saunders", "Image", "Itv"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20722547.ece/ALTERNATES/s1200/0_jibe-at-Boris-Johnson-as-she-grills-Corbyn-on-election_6832JPG.jpg", "published_at": "2019-10-25"}