{"pub": "yahoo", "url": "https://news.yahoo.com/polls-show-close-divide-over-041214951.html", "downloaded_at": "2019-10-12 01:01:16.157097+00:00", "title": "Polls show close divide over impeachment and removal", "language": "en", "text": "President Donald Trump speaks during an event on \"transparency in Federal guidance and enforcement\" in the Roosevelt Room of the White House, Wednesday, Oct. 9, 2019, in Washington. Americans are following the impeachment inquiry closely _ and are now slightly more likely to approve than disapprove of the inquiry while more closely split over whether Trump should be removed from office. (AP Photo/Evan Vucci)\n\nWASHINGTON (AP) — Americans are following impeachment proceedings closely and are slightly more likely to approve than disapprove of the inquiry itself. But the public is more closely split over whether President Donald Trump should be removed from office.\n\nSeveral polls published since House Speaker Nancy Pelosi announced the start of an impeachment inquiry on Sept. 24 show a shift in views from earlier this year as the House of Representatives investigates whether Trump violated his oath of office in asking the government of Ukraine to investigate a political opponent.\n\nWHERE THINGS STAND\n\nPolls find support for impeachment has shifted significantly from earlier this year. The public is now more closely divided after earlier polls showed majority opposition to impeachment.\n\nA Fox News poll conducted Sunday through Tuesday found 51% of Americans now say Trump should be impeached and removed from office, up from 42% who said that in July.\n\nLikewise, a Washington Post-Schar School survey conducted in early October shows 58% of Americans are supportive of the decision by Congress to initiate an inquiry, including 49% who say Congress was right to begin an investigation and should also take the next step to remove Trump from office. Earlier this year, Post-ABC polls found less than half saying Congress should begin impeachment proceedings.\n\nAnd polls show that the shift was closely tied to Pelosi's announcement of the inquiry. An early October poll from Quinnipiac University finds 45% of voters say Trump should be impeached and removed from office, up from 37% in a poll conducted immediately before that announcement.\n\n___\n\nCONSISTENT (AND POLARIZED) VIEWS OF TRUMP\n\nApproval of Trump's overall performance has remained steady, as it has over the course of his presidency. The Quinnipiac poll shows Trump's approval rating standing at 40%, where it was in its poll conducted just before the inquiry began.\n\nBut, as with most political issues in today's environment, views of the Republican president and impeachment are intensely polarized. A wide share of Democrats express support for impeachment, while the vast majority of Republicans stand opposed.\n\n___\n\nPRECEDENT\n\nToday's presidential impeachment inquiry is only the fourth in U.S. history, and polling demonstrates different scenarios for how opinion has changed as impeachment proceedings proceeded.\n\nWhile opinions of President Bill Clinton and support for his removal from office moved slightly throughout 1998 and 1999, he emerged largely unscathed. According to polling by Gallup, support for Clinton's removal reached no more than about a third of Americans throughout impeachment proceedings over Clinton's handling of allegations of his extramarital affair with Monica Lewinsky, a White House intern. Before, during and after the impeachment process, Clinton's job approval was much higher than that of Trump.\n\nBy comparison, approval ratings for President Richard Nixon took a severe hit as the public learned more about his transgressions, according to Gallup polling. At the same time, support for impeachment steadily grew.\n\nEven so, far less than half supported Nixon's removal from office throughout 1973 and into 1974; it wasn't until after the House Judiciary Committee passed articles of impeachment in late July that more than half held that view.", "description": "Americans are following impeachment proceedings closely and are slightly more likely to approve than disapprove of the inquiry itself.  Several polls published since House Speaker Nancy Pelosi announced the start of an impeachment inquiry on Sept. 24 show a shift in views from earlier this year as the", "authors": ["Hannah Fingerhut"], "top_image": "https://s.yimg.com/uu/api/res/1.2/9I.A94csepOb46.Smg2g0w--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/f7070e03b09f16ce94409fd61b5f3f91", "published_at": "2019-10-10"}