{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7543157/Police-launch-triple-murder-investigation-three-men-dead-reports-fight.html", "downloaded_at": "2019-10-06 13:14:55.195773+00:00", "title": "Police launch triple murder investigation after three men are found dead after reports of a fight", "language": "en", "text": "Three men have been found dead in Colchester, Essex with police launching a triple murder investigation and arresting a 32-year-old man.\n\nPolice were called at around 10.15pm last night to reports of an altercation at a home in Colchester.\n\nIn the early hours of the morning, they found two men dead inside the property and the body of a third man in a car outside the home.\n\nTwo police vans were pictured on the scene today and officers were seen talking to residents\n\nOfficers at the property this morning where a triple murder is thought to have occured\n\nA 32-year-old man has now been arrested on suspicion of murder and police are not looking for any other suspects.\n\nHe remains in custody.\n\nAn Essex police statement said: 'Detectives have launched a murder investigation after three men were found deceased at an address on Wellesley Road, Colchester, during the early hours of Sunday October 6.\n\nDetectives are not looking for anyone else in connection with the incident and a 32-year-old man has been arrested (officers at the scene today pictured)\n\n'We were called around 10.15pm on Saturday October 5, with concerns for the welfare of two men following reports of an altercation.\n\n'Officers attended and found two men dead inside the property and the body of a third man in a car outside the property.\n\n'A 32-year-old man from Colchester has been arrested on suspicion of murder.\n\n'Detectives are not looking for anyone else in connection with the incident, but are keeping an open mind.'", "description": "Three men have been found dead in Colchester, Essex with police launching a triple murder investigation and arresting a 32-year-old man.", "authors": ["Danyal Hussain For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/13/19361014-0-image-a-77_1570365861517.jpg", "published_at": "2019-10-06"}