{"pub": "marketwatch", "url": "https://marketwatch.com/story/slacks-missteps-have-now-made-the-stock-a-buy-at-the-right-price-2019-09-03", "downloaded_at": "2019-09-03 23:40:47.560540+00:00", "title": "Slack’s missteps have now made the stock a ‘buy’ at the right price", "language": "en", "published_at": "2019-09-03", "text": "Slack Technologies is the fastest-growing software-as-a-service (SaaS) company of all time and a Silicon Valley favorite, yet the direct public offering (DPO) clearly did not go well for public investors.\n\nThe shares WORK, +0.42% opened at $38.50 on June 20, rose to $42 intraday, and have now sunk to a record-low of $26.25 in after-market hours leading into its first earnings report as a public company.\n\nThe losses are at 36% from its intraday high, and that occurred when many cloud-software initial public offerings (IPOs) have enjoyed triple-digit returns since going public.\n\nSo what went wrong? And, more importantly for growth investors, will things go right for San Francisco-based Slack soon?\n\nBefore the company releases second-quarter earnings Sept. 4, here’s insight into its revenue, valuation and competitors.\n\nSlower growth\n\nSlack’s product — an instant-messaging and collaboration system — has massive potential with a 143% net customer retention rate, yet the financials undermine the company’s growth trajectory. For instance, guidance for the current fiscal year is at 47% to 50% revenue growth year-over-year, down from 82% in the prior year. The slower growth, which was revealed in an updated prospectus two weeks before going public, was unlikely to win over many people regardless of how much traction the product has with current users.\n\nYet, there is impressive traction, with the average user keeping the app open for nine hours on her computer and engaging with it for 90 minutes a day. Compare that with the daily time spent on Facebook FB, -1.77% 58 minutes, Instagram, 53 minutes, YouTube, 40 minutes, Pinterest, 14 minutes, and messaging app WhatsApp, 28 minutes.\n\nAs I covered before the DPO, both sides of the debate have valid points when evaluating Slack’s future stock performance. However, due to Slack’s product strength, my prediction is the stock will have a turnaround as user loyalty will overcome the financial turbulence. The questions that remain: timing and valuation for entry.\n\nDivergence in user base\n\nSlack’s revenue grew 110% in fiscal years 2017-2018, and then slowed to 82% in 2018-2019. The company is now forecasting 47%-50% growth in the current fiscal year with revenue between $590 million and $600 million, compared with $400 million in fiscal 2019. This year’s estimated adjusted loss is estimated to be 41 cents to 44 cents a share.\n\nOn June 3, Slack released an updated prospectus that showed growth in customers worth over $100,000 in contracts, yet revealed a decline across paid user growth from 9,000 in the year-earlier quarter to 7,000 in the current quarter.\n\nIn other words, there is a divergence as overall paid users are declining, while customer accounts worth over $100,000 are growing. That could be because of internal efforts to raise revenue and focus on enterprise-level customers, which is a common strategy leading up to public offerings. More quarterly earnings are needed to ultimately decide which direction this will go, and if the larger accounts will pay off as a primary focus for growth.\n\nSlack provided the net dollar retention rate in the S-1 filing, which depicts what percent of revenue from current customers is retained from the prior year, after accounting for upgrades, downgrades and churn. This is helpful in predicting growth for subscription-based companies.\n\nThe formula for the net dollar retention rate is: Beginning of period revenue + upgrades – downgrades + churn = y with y/beginning of period revenue.\n\nIf the net dollar retention rate is above 100%, then the growth from the existing customer base offsets the losses. If the number is below 100%, then downgrades and churn exceed growth.\n\nSlack published a net retention rate of 143%, which is very good and outperforms most cloud software IPOs that provided this number in the past. This is due to Slack’s sticky traction and low churn with the current customer base.\n\nOne thing to note about the retention rate is that Slack officially launched in 2014, and has a shorter history than other companies on this list with many having launched 10 years prior to IPO compared with Slack’s five years. Typically, the longer the time period, the lower the net retention rate due to more opportunity for customer churn.\n\nSee: Beth Kindig runs a forum on tech stocks where she answers readers’ questions.\n\nValuation\n\nSlack’s valuation is high — there’s no argument there. If we look at the $600 million in estimated revenue for fiscal 2020 at the $14 billion market cap, then Slack has a forward price-to-sales (P/S) ratio of 24.\n\nOf course, we can name a long list of cloud-software companies with comparable price-to-sales or higher, but the difference is that Slack has not won over sell-side analysts, whereas Shopify SHOP, -0.38%, Zoom Video Communications ZM, +0.86% and Okta OKTA, +1.34% have. Certainly, returns are healthier if you can beat sell-side analysts to a winning stock. (For instance, my newsletter subscribers beat sell-side analysts to Roku ROKU, +3.65% for much higher gains.)\n\nWe are also seeing some slight exhaustion in the market with regard to cloud-software valuations. Last week, a few companies beat on both top-line and bottom-line estimates, such as Veeva Systems VEEV, -1.60% and Workday WDAY, -1.30%, yet the stocks dipped as much as 6%.\n\nOne thing to consider with Slack is that the potential market is nearly impossible to predict as the company is carving out a new category. The global enterprise collaboration market is expected to grow from $34.6 billion to $59.9 billion, with a growth rate of 11.6%.\n\nThis is a sizable market for a company with $600 million in revenue. However, it’s hard to determine where Slack’s product fits. Slack CEO Stewart Butterfield alludes to owning 2% of the software market as a force extender for the other 98% of the software market, and that would equate to a market worth $12 billion in annual enterprise software sales.\n\nOkta is a great example of a company that has similar numbers on its profit-and-loss statement, yet Okta earned its market cap through a series of strong earnings reports and gaining the trust of public investors, whereas Slack demanded a record-breaking price-to-sales right out of the gate. Twilio TWLO, -0.59% also has a similar profit-and-loss statement, but is trading at 16 forward price-to-sales. Slack not only priced itself too high for a new company with slowing growth, but it’s also likely the direct public offering didn’t help.\n\nDPOs\n\nIn August 2018, Slack was valued at $7 billion in its last venture round and listed at nearly double that in June 2019 when it was listed on the public market.\n\nHerein lies the problem with direct public offerings, which are heralded as a way of cutting out middlemen and fees: The lack of a lock-up period allows the company to price high on the public markets for the benefit of insiders rather than fairly price the stock with the understanding that insiders will lose if the company is overpriced and the stock attracts downward momentum.\n\nMany investors are aware that IPOs can be risky, although tech companies have a penchant for proving these risk-averse investors wrong with many recent triple-digit success stories. In this case, however, both Slack and Spotify SPOT, -1.14% have proven that DPOs are not ideal for public investors as the opening valuations have not been sustained in the long term. This could be due to a lack of consequence for listing too high.\n\nCompetitors\n\nThere are some valid points on the more bearish side of the debate, but using Microsoft MSFT, -1.32% Team’s 13 million users as the primary weak point is not of them. As with most David and Goliath battles in tech, the market has this backwards.\n\nSlack is a small, relatively unknown brand that has managed to keep pace with one of the world’s most recognized brands — Microsoft. The fact they are almost equal in users at 10 million for Slack and 13 million for Microsoft is a boon for Slack, not the other way around. This proves that Slack is a serious contender and able to attract users with a hundredth of a decimal point in revenue compared with Microsoft’s trillion-dollar market cap.\n\nSlack is a stand-alone app compared with Microsoft’s legacy enterprise software suite, which is now sold as a subscription in the cloud as Microsoft Office 365, yet was originally launched in 1990. Microsoft Outlook has an estimated 400 million users, primarily enterprise.\n\nTo say that Microsoft launched Teams in 2017 and has quickly caught up to Slack is not exactly accurate. Microsoft has owned business communications for nearly 30 years and has spent $35 billion in acquisitions to own the messaging space pre-emptively with the acquisition of Skype for $8.5 billion and LinkedIn for $26.2 billion. Those acquisitions occurred around the same time that Microsoft considered acquiring Slack for $8 billion.\n\nMicrosoft then leveraged its hundreds of millions of enterprise software customers and copied Slack’s approach. Yet, somehow, Slack should be afraid of Microsoft? I disagree. Investors should be asking themselves why 600,000 organizations are downloading a separate app to hold their business discussions with many being Microsoft Office users.\n\nMore importantly, the word Slack is becoming synonymous for business messaging. Like what Kleenex did for facial tissues, “to slack someone” means to send a coworker a message. I do not foresee anyone using Microsoft Teams in this manner, and this is the best free marketing a company can have.\n\nThe main product differentiation is Slack’s customization. There are over 1,500 standard integrations with Slack, such as with Zoom video-conferencing and Google Drive. However, there are over 450,000 applications developed internally by Slack customers, according to the CEO. Those applications come from developers who want a more advanced alternative to the closed ecosystem that Microsoft provides.\n\nConclusion\n\nThere is a healthy debate on Slack, and both sides have valid arguments. On the one hand, you have a company with slowing growth, and on the other, you have a product with strong industry key metrics and a highly engaged user base.\n\nWhen looking at valuation for companies that have similar profit-and-loss statements, it becomes clear that Slack came on too fast and too strong with its valuation. This is a mistake the company has paid for, as the momentum is now downward. Better to have listed at a $10 billion market cap and earned the $14 billion market cap than the reverse, as many public investors can be myopic with tech products and are easily scared off.\n\nFor opportunists and visionary investors, however, the downward momentum on a product that is becoming synonymous with business messaging is welcomed for an attractive entry.\n\nAlso by Beth Kindig:\n\n• Here’s how to fix what’s ailing Salesforce\n\n• Investors will give Okta a pass on profits as long as revenue speeds ahead\n\n• Beaten-down Nvidia is diligently preparing to pounce on its rivals\n\nDisclosure: Subscribers to Beth Kindig’s premium service may have positions in the securities mentioned in this article or may take positions at any time. Kindig offers exit and entry scenarios for the stocks she covers.\n\nBeth Kindig is a San Francisco-based technology analyst with more than a decade of experience in analyzing private and public tech companies. She publishes a free newsletter on tech stocks at Beth.Technology and runs a premium research service.", "description": "The company went public at a time of slowing revenue growth, yet the tiny rival to Microsoft seems to be winning the instant-messaging war.", "authors": ["Beth Kindig"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-FU470_slack_ZG_20170918085031.jpg"}