{"pub": "financialpost", "url": "https://business.financialpost.com/telecom/down-to-business-podcast-an-illusion-of-competition-wind-founder-on-the-state-of-canadas-wireless-market", "downloaded_at": "2019-10-07 20:02:28.783517+00:00", "title": "Get rid of ‘fake competition’ from wireless flanker brands, Wind founder says: podcast", "language": "en", "text": "Welcome to Down to Business, a weekly podcast from the Financial Post.\n\nLower wireless prices have become an election promise for the Liberals, the NDP and the Greens. But it’s not clear what these pledges would mean for competition in the wireless sector.\n\nFor the next few weeks, Down to Business will discuss business issues taking centre stage in the federal election. Telecom is in the hot seat this week.\n\nAnthony Lacavera, the founder of Wind Mobile (now called Freedom and owned by Shaw) and private equity firm Globalive Capital, talks to host Emily Jackson about his experience starting a wireless company, the state of competition right now and what he thinks the government should focus on instead of pricing.\n\nYou can listen below — or on Apple Podcasts, Spotify, Stitcher and Google Play, where you can also subscribe to get new episodes every Wednesday morning.\n\nIf you have any questions about the show, or if there are topics you want us to tackle, email us: downtobusiness@postmedia.com.\n\nTranscript\n\nEmily Jackson 0:02: Lower wireless prices have become an election promise for the Liberals, the NDP and the Greens. But how would these plans affect Canada’s wireless industry and competition in the sector? And is pricing what we should really be focusing on right now? I’m Emily Jackson, and you’re listening to Down to Business. For the next few weeks, we’ll be discussing business issues taking center stage in the federal election. This week, we’re talking telecom with Anthony Lacavera, the founder of private equity firm Globalive Capital. He’s best known for starting Wind Mobile, one of the wireless upstarts that injected some competition into the market in 2008.\n\nNow we’re kind of getting that political chatter around wireless again. In this election campaign, we’ve heard a lot about lowering wireless prices. Why do you think there’s political interest in this file again right now?\n\nAnthony Lacavera 1:03: We’re entering a new wave, Emily, where we’re going to obviously see the advent and introduction of 5G networks. In the past generations of wireless when we moved from 2G to 3G to 4G LTE, throughout that history, we really just saw an increase in speed, and network throughput, so called throughput, we didn’t really see a really broadening of applications. And we’re just now with 5G really starting to see that, meaning connected cars, autonomous vehicles, connected home, connected health, remote health, telehealth all these types of applications that rely on superfast networks and also like super low latency, or delays in communication. So with that, we’re entering a new kind of wave of wireless and communications generally. And I think the government, I think rightly, wants to make sure that the framework is set up so that Canadians can enjoy cost effective, ubiquitous 5G service. It’s pretty clear from a variety of World Bank studies and all sorts of different private studies on this, that when you have a really fast, cost effective wireless network, GDP growth accelerates full stop. It’s just so important now for commerce.\n\nEJ 2:13: So critical, right? You know, this real time environment that 4G has enabled, we now have Uber, we have Airbnb. 5G is going to be the way forward. But as they’re laying the groundwork for that a lot of the conversation recently has been on wireless prices. The Liberals want to cut it down 25% over the next four years, the NDP has suggested a price cap. We’re still talking in this 4G world. And this is coming as prices have come down fairly drastically in the past two or three years. Now, depending on the study, there’s still quite high compared to other developed nations.\n\nAL 2:50: No question.\n\nEJ 2:51: So how do you see that tension between what’s actually happening with the prices and why this is the promise that we’re hearing from politicians right now?\n\nAL 2:58: Yeah, look, well, I agree with the intent being good in terms of having a competitive wireless industry. I don’t think the approach makes sense. I don’t think talking and focusing on price is really where we need to focus. Where we need to focus is on investment and inspiring increased investment in networks. It’s pretty clear that we need a lot more network capacity as we roll out 5G because of the growth in consumption and ongoing increases in demand and the types of applications that need real time very high, high speeds gaming, for example, augmented reality, virtual reality applications, virtual surgeries. So these are pretty exciting developments and those require significant network investment. So I think a focus on price solely is really kind of a headline thing that may be grabbing people’s attention, but totally not where I would be focused and on the topic of MVNO is, which are a hot topic these days mobile virtual network operators.\n\nEJ 3:54: Yes, these are essentially wireless resellers.\n\nAL 3:56: Exactly. And this is a really important thing for everybody to understand is that a wireless reseller really means somebody operating a brand, but on on someone else’s network or infrastructure. And so it just by definition, that doesn’t spur new investment. So it’s to me totally counterproductive for the government to be going down the road of MVNO is in any way, shape, or form. The way we got prices down was the introduction of fourth, the fourth wireless carrier, Wind being in the Ontario, Alberta and BC markets, Videotron being in the Quebec market. That’s where you saw true facilities-based competition and sustained competition. So in those markets, now, there is a fourth carrier still, and that’s created a more competitive dynamic.\n\nEJ 4:40: So do you think the introduction of that fourth player in 2008… we finally got a few more options, regional carriers mostly, but certainly the prices have come down specifically in those regions. How critical do you think that fourth player policy was?\n\nAL 4:56: Well, I think it’s it was essential, but I think we didn’t go far enough. I think that really what needed to happen was not only a fourth license, and fourth facilities-based, meaning the company’s own towers, cell towers, fibre infrastructure, switching infrastructure, everything you need to operate your own network independent of the Big Three, Bell, TELUS, and Rogers. In those markets that Wind operated prices did come down 21% in all 28 English speaking markets that we operated in. Prices still have stayed somewhat below where they were in 2008. But really, obviously, bandwidth consumption has gone up so much that it kind of muddies the water on any kind of analysis. And obviously, network investment levels of have had to go up as consumption patterns have increased so, so dramatically,\n\nEJ 5:39: This is one of the things though network investment has gone up. And there was a big argument back in 2008, that we shouldn’t allow these upstarts in because that would decrease the ability for the Big Three, Bell TELUS Rogers, to continue investing. This has been the perpetual argument, you know, with of course, the price caps we’re talking about right now. ‘Well, if you put a price cap on it, then we won’t have as much money to invest in these new 5G networks.’ With MVNOs, the wireless resellers, ‘Well, if you let them do that, we won’t have as much money to invest in the wireless networks.’ And yet we do see investment rising. Why was the fourth player okay, and why are these additional steps not okay?\n\nAL 6:19: Well, to follow up on my last point, I think we didn’t go far enough by just issuing a fourth carrier license for a facilities based carrier, we also needed to bring in significant foreign capital independent the Canadian capital markets, independent of the Canadian landscape, there was really long term strategic capital. And I actually was successful at doing that with Wind. It was funded initially entirely by through foreign direct investment. Unfortunately, there were some problems. So even though we were compliant with all the foreign direct investment regulations, the truth is that the incumbent lobby was so powerful, entirely targeted at Wind, because we were the only real real threat to the incumbent oligopoly. And the reason for that is that our investors were from outside of Canada in a pure play wireless type investment. They had no interdependency or no reliance on other legacy telecom businesses. And if you look at Bell, TELUS, and Rogers, well, they’re obviously reliant in on the cash flows from the traditional phone business, from the traditional home based internet business, from traditional cable or TV business. Those are generating a lot of their cash flows. And so they’re really reliant on not having those businesses cannibalized too quickly, meaning we don’t want people to cut cable and move to wireless too fast because we have all this investment in cable.\n\nEJ 7:35: Sure. That said, wireless now is making up such a lion’s share of telecom spending in Canada\n\nAL 7:41: In new investment it is, but in legacy cash flows, it’s coming from those legacy businesses. There’s so much of the free cash flow, because those network investments in the cable network, for example, was made over decades and aas long amortized. This is a tremendous free cash flow business.\n\nEJ 7:54: Oh, for sure. Especially when you think about landlines as well.\n\nAL 7:59: They’ve been implemented over like 100 years kind of thing. So I think that it’s really important for the government to think about. When you want to talk about competition and wireless, you have to think about facilities based competition, you cannot be thinking about mobile virtual network operators or resellers, you can’t be thinking about just creating new brands that aren’t really operating on independent infrastructure. And you really can’t have them entangled with the existing oligopoly. So why is there still pretty high pricing in Canada, it’s because in the end, the foreign investment was was not welcomed in Canada. And so ultimately, in the case of Wind, Shaw Communications ended up being the owner. And Shaw is one of those companies that has cable, has home phone service, has home internet service, and does not want Freedom Mobile now, the former Wind, to be too competitive with those businesses.\n\nEJ 8:49: Now, I mean, Freedom’s prices are significantly lower. Their operating margin on the wireless side is about 21 per cent, where you’ve got the Big Three operating with more than 40 per cent profit margin. Not bad, not a bad business. When it comes to the foreign investment, the government did ultimately change its rules to allow some foreign investment in companies that have less than 10 per cent of the market share. Do you think they need to go further than that?\n\nAL 9:15: I think that we need to reset the deck completely because the experience of in foreign investment into the Canadian telecom market, not just in the Wind experience, which was a disaster for my investors, who were essentially kicked out of the country. But prior to that, AT&Tcame up to Canada and really did very poorly here with the Canadian control and ownership restrictions. Sprint, the legacy business came up to Canada also had a terrible experience. We just have such a long history of not really properly welcoming foreign capital and foreign competition into the market. And we make all the arguments, the incumbents make all the arguments about the impact on the labour force on the impact on generally on jobs in Canada, but also the impact to your earlier point on investment. The position they always take is we’re going to have to reduce investment levels to stave off this fight from this much bigger competitor.\n\nEJ 10:06: But no one’s really wanted in since we changed the rules back in 2013 to let foreign investors into the smaller companies, right?\n\nAL 10:13: No one new has wanted in because of the experience has been so bad. It’s been horrible for foreign investors.\n\nEJ 10:19: Do you think as we go into this 5G era foreign investment in the telecom industry is something we really want to achieve?\n\nAL 10:26: Yes. I think this is, as I say, the fundamental requirements for truly, if pricing is really, you know, a key objective, which I guess I said earlier, I question whether that should be the focus, I don’t think it should be, I think the focus be on network investment, service levels, quality of service, availability, a very high speed bandwidth, a very low latency or delays and throughput and so on. And that way we can broaden the universe of applications, we can close the digital divide with new technologies like Low Earth Orbit satellites, there’s some incredible technologies being developed there by a number of new players and legacy players in the satellite world where we can start to truly close the digital divide. That’s where the government needs to focus. Just putting a headline on price, I get that it may attract people’s attention, but it’s not where they need to focus. In addition to encouraging facilities based competition, not resellers, the government also needs to put a very keen focus on properly creating a framework that welcomes foreign direct investment in the telecom sector. It has to happen if we really want competition.\n\nEJ 11:28: What would that framework look like? I know that there have been a lot of questions about national security around our 5G networks, that’s been a conversation of ‘Do we ban Huawei? Do we not ban Huawei?’ How does that equipment play a role in the ongoing networks? How do you see that challenge?\n\nAL 11:45: That’s a very important one, a very significant one. And I think, obviously, we need to have security, particularly in a 5G context. We are talking about Internet of Things. When you’re talking about autonomous vehicles connected to 5G networks, and you talking about these types of things, we really need to think about network security and take it up a level from where we are today. That said, I think our networks are very secure. And I think the Canadian incumbent operators are very good at having strong security frameworks in their paradigms in their networks, and well implemented. That said, there’s always going to be risks, there are two really things to think about there. There’s the equipment manufacturer, which brings up the Huawei debate and whether there’s really a justification to be banning Huawei, or if it’s really necessary controls on what Huawei can do. Huawei’s an important input in terms of network investment, because of course, they’re bringing prices down for equipment. And if you were left with just Nokia and Ericsson, who are the other two major manufacturers, you could see,\n\nEJ 12:41: It’s the classic competition story, you need more than two players in order to have some solid competition.\n\nAL 12:46: Right on. So between Huawei and the other major Chinese manufacturer is that ZTE, you really need both of or some aspect of their their presence in order to see pricing lower, and, of course, then makes the cost of equipment lower for 5G networks, which allows the incumbents and the competitors to invest more in network. So I think that’s an important thing. But then you also have to think about the actual operator of that equipment, and how do you make sure those companies are secure.\n\nEJ 13:13: That network engineering will be such a critical part of any security in the networks. Today, we came out talking about these election promises, which are solely around pricing. But it almost seems like in the 5G world, pricing is not going to be the most important factor. Why do you think the government is focusing on pricing when you the way you see it, the critical factor is going to be building the next generation network.\n\nAL 13:37: I think it has to do with, again, the highlight attraction of getting people’s costs down. It’s just something that’s an easy one for the government to point to. You know, the incumbent operators have given a lot of fodder to go after in that regard. There’s a long history of the pricing being higher than other developed markets. I think there’s a lot that resonates with Canadians and that regard.\n\nEJ 14:00: When it comes to the MVNOs, the wireless resellers, I want to talk a bit more about your position on that. The argument in favor of resellers has been that, look, yes, they don’t invest in an entire network, but they invest on the fringe, and they create some equipment that wasn’t there before and they’re providing a lower cost service to people that are clamoring for that. Not necessarily the Rolls Royce of services, if you’re if you’re thinking about it that way. In Europe, there has been a tonne of MVNOs, prices are drastically lower for wireless in Europe than they are in Canada. Why not? Why not add this to the playing field?\n\nAL 14:40: Well, I think Europe, I don’t think it’s a good direct analogy is because the the geography is so so different in terms of the concentration of population. So we have a population density challenge in Canada that creates all of the challenges we have associated with rural and near rural even, or even in some cases, outer suburban, you know, coverage is always a challenge. We’re so spread out. So I think there isn’t really a direct analogy to the Canadian market for that.\n\nEJ 15:04: Then we can talk about the US which does have a lot of MVNOs.\n\nAL 15:07: Yes, it does. And importantly, those MVNOs have long-term always been owned independently of incumbents. There’s only a few that are owned by incumbents. And why is that important? Of course, if you have something like Fido, which is owned by Rogers, or Koodo, which is owned by Telus, and I can go down the list. There’s no real competition there. It’s an illusion of competition. So I think if you want to enable MVNOs in Canada, the first thing you have to do is force incumbents to shut down their own flanker brands. You can’t have all of that confusion in the marketplace with flanker brands, Koodo, Fido, Virgin, all these brands that are out there that are all owned by incumbents that serve no real benefit to competition. They really enable incumbents to keep a tight lid on any other MVNO that might enter in the marketplace. That said, if you did want to proceed with it, which it sounds like government is seriously considering, you would have to have a regulatory framework that is enforced. And this, I could not stress enough actually being the key issue, is that historically, the Canadian regulator, and in our ministry of innovation, formerly Ministry of Industry, which had jurisdiction over spectrum, they never really enforced the framework for competition that was was put in place. And I would refer directly to the 2008 framework where spectrum set asides, tower sharing and roaming were all mandated. But it took literally five years. Literally five years for us to successfully, from 2008 to 2013, finally get a roaming framework that made any kind of competitive sense. It wasn’t great. It just made competitive sense.\n\nEJ 16:46: This is essentially the framework that enables customers to you know, travel outside of Toronto and go to the Muskoka. Say your provider doesn’t have a network out there, you can still use your phone.\n\nAL 16:58: Yeah, your network provider doesn’t have a network yet out there. And the whole point is, is that because the incumbents had a 25, 30 year lead or head start on building those networks, that if you really want to have competition, you have to enable roaming as an interim step as the as the new competitor builds network so that they’re competitive. So there was a policy for that. It was good intention, I think on the part of the Harper government, it just took years to enforce it. And so much damage was done to the competitive landscape in that intervening period.\n\nEJ 17:27: When it comes to spectrum, you know, these are the invisible waves that power wireless communications in general, one of the big competitive issues we have in Canada is how the spectrum should be allocated. The Liberals have signaled one of the things they might do to try to spur competition is to continue to allocate that spectrum in auctions to to start up players, you know, the smaller guys that have less than 10% of the market share. The idea is to give these companies a bit of a go ahead to take on the Big Three, which continue to have about 90% of the market share. What do you think government spectrum policy should be as we’re going into this 5G world?\n\nAL 18:04: I think for starters, the government should prevent the incumbents from using any of their frequencies to operate their own own flanker brands.\n\nEJ 18:14: Getting rid of flanker brands. I think this is an interesting proposition. I haven’t heard this one. People seem to like flanker brands.\n\nAL 18:21: I think if I’m an incumbent, I love the flanker brand. If I’m Rogers I love having Fido. If I’m Bell, I love owning Virgin Mobile. You know, there’s a perception that Virgin Mobile is Richard Branson, and you know, that it’s totally separate business and brand and so on. But it’s owned 100 per cent by Bell. Then they have it come in and out of the market selectively when there’s the right sort of competitive environment. They’ll push it in and out. And it’s not really a real business for them. It’s totally on the surface and just keeping a lid on competition. So I think the first thing I would do, if I was the Liberal government is I would stop the use of those frequencies for let’s call it artificial competition, fake competition. It can’t be used for that. And a lot of those frequencies were given to Bell, TELUS and Rogers in the mid 80s. That early spectrum was actually given away for zero price. And then in the late 90s, the PCS spectrum was given away at very low cost relative to today’s standards. And so a lot of the spectrum that they’re operating on, they actually had very little cost for.\n\nEJ 19:19: It’s interesting to think about the, you know, the flanker brands in that context. Are they real competition? The argument from the Big Three is that, yes, maybe they got the spectrum at a discount in the 80s, before wireless was really a thing. But they’ve invested so much into the networks. The other argument is that our networks are very high quality compared to elsewhere in the world. How do you argue with that, you know, yeah, our 4G is pretty fast.\n\nAL 19:45: Yeah. So I think that they are, you know, very well run companies. And I think they do operate high quality networks. I do think that pricing, there is room from reflected in their publicly disclosed financial results and how each one of them operating at to your point at you know, 40s EBITDA margins, which is that doesn’t exist. Even in markets that are consolidated like the U.S., it’s still mid 30s. You know, it’s still more quote unquote, more competitive than in Canada by a significant margin. So I think that that’s the way I would approach, if you if you wanted to create a framework for new competition in Canada, I would certainly be talking about eliminating the incumbent owned flanker brands, I would introduce MVNOs that are perhaps only an interim step before facilities based investment is required. So I would start talking about set asides. But I talk about set asides that are options that are structured to ensure that there’s a reasonable price paid for the spectrum acquired by the new entrant, and that facilities based investment is required. So you can’t just ride on an MVNO construct as a new entrant for in perpetuity forever, you would have to commit to make the investment in your own network over time and build a standalone carrier. That said, I think that the ship is largely sailed in Canada with for facilities based carriers and most markets already. So I don’t know that I think that even anything other than first eliminating the incumbent flanker brands is where you could start.\n\nEJ 21:12: When we’re talking about the state of competition and Canada’s wireless market right now, How would you evaluate it?\n\nAL 21:18: I think that it’s a very cozy oligopoly that’s, you know, tightly managed, very cozy oligopoly with some junior members to the oligopoly. Videotron being a junior member in Quebec and Shaw being a junior member in Western Canada. I think the only place you have really pure play wireless competition is in Ontario, and that’s coming from Freedom Mobile, formerly Wind, but it’s not real. Because what you would never do if you were a Shaw is attack Bell or Rogers in Ontario, and have them react, or Telus, and then have them react in your home cable footprint of BC and Alberta. So there is a lid, a structural lid, on how aggressive Shaw will ever be in the Canadian wireless industry?\n\nEJ 21:59: Just based on that integration between the business lines.\n\nAL 22:02: Yes. They can’t afford to have Telus and Bell and Rogers lay an all out assault on them in B.C. and Alberta and their traditional businesses, which are already obviously eroding because people are all moving to wireless anyway. But you don’t want that erosion to be accelerated.\n\nEJ 22:14: As more people move to wireless. What do you think it’s going to take for the government’s to get past this conversation about pricing, which is important to the pocketbook issues. But again, price has come down. Even in the past three and a half years where I’ve been covering telecom, it used to be you’d pay $90 for one gigabyte of data. Now you can get 10 gigabytes of data for 60 bucks. It’s wild, how much it’s changed as these companies are encouraging us to use more and more data and we probably will be using more and more data in the future. How do we get from that conversation about pricing to that conversation about investing in innovative networks?\n\nAL 22:50: Yeah, I think it really does come down to a facilities based competition being where you start, meaning you don’t create resellers or MVNOs that are just you know, operating on the incumbent network. Obviously, if I’m a new entrant, new brand operating on the Bell network, I’m in an agreement with Bell which gives me access to their network. No matter how stringent the regulations are around that there are infinite ways that that could just confine the competition to the framework that is going to be essentially controlled by Bell. I mean, that’s just network is so core to this business, that you know, when you’re using someone else’s network, you are not a true competitor. So I would start with facilities based competition, and that involves spectrum set asides, tower sharing, roaming frameworks, all that stuff has been largely put in place. And I would require, as I said already, require the elimination of incumbent owned flanker brands. And I would put an MVNO framework in place that enables new entrants to start with MVNOs, but cannot long-term operate with MVNO. You must bring in investment and build your own network over time. That has to be coming from foreign capital. So I would go back to the FDI, the foreign direct investment regulations, and I would ensure we are actually welcoming foreign capital. Not the experience I had where the headline was, we wanted foreign capital, but as soon as I brought it in at scale, there was an unbelievable incumbent lobby that was successful at essentially blocking my investors.\n\nEJ 24:22: I can only imagine what the PR people from every single one of the telecoms is going to be emailing me after this runs. Thank you so much.\n\nAL 24:31: My pleasure. Thank you.\n\nEJ 24:32: Thanks for joining us.", "description": "Episode 24 of a weekly podcast from the Financial Post", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/cell-phone.jpg", "published_at": "2019-10-02"}