{"pub": "usatoday", "url": "https://usatoday.com/story/appinsider/2015/03/04/trivia-crack-review/24383609", "downloaded_at": "2019-10-06 13:15:00.175924+00:00", "title": "'Trivia Crack' tests your knowledge with social twist", "language": "en", "text": "'Trivia Crack' tests your knowledge with social twist\n\nCLOSE\n\nAlthough it's been available for over a year, Trivia Crack has morphed into the hottest new game for Android and iPhone users.\n\nIn Trivia Crack, players collect characters across six categories, such as Sports or History. (Photo: Etermax)\n\nSo, what is Trivia Crack? It's a fun game similar to Trivial Pursuit with a strong social emphasis, allowing players to vote for questions and even create their own.\n\nThe game features two modes: Classic and Challenge. Classic pits two players -- either friends or random opponents -- against each other in a Trivial Pursuit style matchup. Players answer questions across six categories: Sports, Entertainment, Art, Science, History and Geography.\n\nAfter answering three consecutive questions correctly, players can earn a character representing the category by correctly answering the next question. Categories are selected by spinning a wheel, and players can also lock up a category by landing on the Crown and correctly answering the next question. The first player to nab stickers in all six categories wins.\n\nChallenge features several players answering 12 questions across categories within a set time limit. The person with the most correct guesses wins.\n\nAs players improve and win games, their experience level increases, which means the questions get tougher. Players can also view their profiles to study their strongest and weakest categories.\n\nIn Trivia Crack, as players ramp up their experience level, the questions get a lot tougher. (Photo: Etermax)\n\nPlayers can spend coins to earn more time answering a question or get extra guesses. Additional coins are earned by winning or in-app purchases.\n\nTrivia Crack also allows players to ask the questions. Users can create their own questions, rate other questions or translate them into another language. Players review their list of suggested questions, which acquire at least 85% of positive votes to make the cut. If a question is rejected, the app will offer a reason, such as it's a repeated question.\n\nThe free version of Trivia Crack feature ads after every wrong answer, appropriate incentive to keep guessing correctly, since some of the ads are so tough to close, players must restart the app. There's also a paid, ad-free version for $2.99.\n\nDespite the ad issues, Trivia Crack is really fun. It's easy to play, and the social elements along with ability to create your own questions make this game a no-brainer to download.\n\nFollow Brett Molina on Twitter: @brettmolina23.\n\nRead or Share this story: http://usat.ly/1AK7yFR", "description": "Players not only answer questions, but they get to ask their own.", "authors": ["Brett Molina", "Published P.M. Et March"], "top_image": "https://www.gannett-cdn.com/-mm-/6ffed5efe64d4a70c320f11672289a5765ce19d3/c=0-361-318-541/local/-/media/2015/01/27/USATODAY/USATODAY/635579548504590321-trivia-crack1.jpeg?width=3200&height=1680&fit=crop", "published_at": "2015-03-04"}