{"pub": "politico", "url": "https://politico.com/story/2019/09/06/trump-foreign-aid-allies-1483788", "downloaded_at": "2019-09-07 02:09:06.642427+00:00", "title": "Trump plan would steer foreign aid to ‘friends and allies’", "language": "en", "text": "President Donald Trump. | Chip Somodevilla/Getty Images exclusive Trump plan would steer foreign aid to ‘friends and allies’ Foreign aid policy has long operated under the principle — at least in theory if not always in practice — that financial assistance should prioritize humanitarian need.\n\nPresident Donald Trump is moving closer to unveiling a dramatic overhaul of how America should distribute foreign aid, one that would channel money to “friends and allies” and prioritize countries that “support” America’s goals.\n\nThe move would upend at least a generation of largely bipartisan foreign aid policy, which has long operated under the principle — at least in theory if not always in practice — that financial assistance should prioritize humanitarian need, not political allegiance.\n\nStory Continued Below\n\nThe plan, laid out in a draft presidential policy directive obtained by POLITICO, could lead the U.S. to stop sending aid to countries that do not side with it in international disputes or somehow align themselves with U.S. rivals such as China. Countries in the third world, especially those in Africa, but also Asia and Latin America, may be seriously affected.\n\nAt the same time, the plan envisions an end to aid programs targeting the underlying reasons, such as poverty and racism, that people join terrorist groups, arguing that they don’t work. It deemphasizes multilateral organizations as a channel for U.S. aid and stresses the value of the private sector. And it says the aid strategy should allow the U.S. to expand its leadership “ in the global energy system.” Ultimately, the plan’s goal is to wean countries off of U.S. assistance.\n\nIt’s an approach that Trump backers have argued would save money and encourage other countries to align with the U.S., but one that has already unsettled humanitarian aid workers and Democrats.\n\n“We’re not going to bring countries over to our side by saying, ‘If you want anything from us you gotta take nothing from them,’ because China’s not forcing that choice,” added Jeremy Konyndyk, a former top official with the U.S. Agency for International Development during the Obama administration.\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nIt’s not clear exactly when Trump will unveil the new directive, which could still be changed or even scuttled completely. But the draft is the product of many months of review. Releasing the final version would fulfill a public pledge Trump has made to rethink U.S. aid.\n\n“We will examine what is working, what is not working, and whether the countries who receive our dollars and our protection also have our interests at heart,” Trump told world leaders during last year’s U.N. General Assembly. “Moving forward, we are only going to give foreign aid to those who respect us and, frankly, are our friends.”\n\nThe White House on Friday did not comment.\n\nAlready, humanitarian leaders are warning against such a change in paradigm. Even if America has long disbursed aid based in part on political allegiance — notably, Israel has long been a top recipient of U.S. funds — aid experts made aware of the draft said the Trump plan emphasizes short-term thinking instead of long-term progress.\n\n“This feels a lot more transactional than the way we’ve approached foreign aid in modern times,” said one aid expert who spoke on condition of anonymity. The Trump approach appears to be: “We are providing assistance to our friends, we’re getting something out of it, and we’d better get something out of it soon.”\n\nTrump has asked Congress to pass a law that effectively reorients U.S. aid to prioritize friendly countries, though there’s no sign lawmakers plan to do that. But the executive branch still has a fair amount of flexibility on the subject even though Congress is in charge of the U.S. budget.\n\nThe draft document stresses that the U.S. faces a renewal of “great power competition” — a term now taken to mean the growing rivalry for geopolitical influence among the U.S., Russia and China.\n\nSuch rivalry is much more complex today than during the Cold War, and U.S. foreign aid has not kept up in a way that benefits America, the document says. To boost its influence, the U.S. must be more strategic in how it disburses aid, the document argues.\n\nTo that end, the U.S. should “redirect, reconfigure, reduce or eliminate foreign assistance that is supporting governments and non-state actors under the strong influence of United States competitors and adversaries,” the draft says.\n\nIt goes on to say the U.S. should “reduce or eliminate foreign assistance to countries and international organizations that are working against or do not support United States interests and focus it on allies and partners that are cooperating with the United States.”\n\nThe document does not spell out exactly what other countries must do to display their loyalty to the U.S. However, Trump and his aides have in the past said that not voting with the U.S. in forums such as the United Nations could be a factor.\n\nNikki Haley, Trump’s former ambassador to the United Nations, has loudly promoted the idea that the U.S. should stop sending funds to countries that don’t support it at the world body. That includes countries that vote against the priorities of Israel, a key U.S. ally.\n\nIn an op-ed , Haley listed South Africa as an example of a country that frequently sides against the U.S. at the United Nations, and hinted that the U.S. should rethink the aid it gives to the country, much of which is for HIV/AIDS programs.\n\n“When foreign aid goes to countries that take our generosity and bite our hand, rather than link up arms with us, it’s time to stop it,” Haley wrote.\n\nIn broad terms, U.S. foreign aid has always been considered a tool to promote U.S. national security, experts said. Modern presidents have taken a holistic view of what that means.\n\nFor instance, former President Barack Obama’s presidential policy directive that laid out his vision of aid was premised on the idea that the U.S. would itself benefit if it helped grow “the ranks of prosperous, capable, and democratic states.” It did not explicitly categorize countries into worthy or unworthy.\n\nUnder President George W. Bush, the U.S. began spending huge amounts on aid for Afghanistan and Iraq following the U.S. invasion of those countries. But Bush also saw opportunities in using aid to curry favor elsewhere: He lifted restrictions on aid groups and directed millions of dollars in assistance to Iran, a longtime U.S. nemesis, after a devastating 2003 earthquake there.\n\nTrump has a complicated view of foreign aid. He has spoken positively about it as a tool for advancing U.S. interests, and yet he’s repeatedly proposed cutting billions of dollars in foreign aid from the U.S. budget. He’s also faced criticism that he is politicizing aid in places like Venezuela, where the U.S. has tried to use the lure of aid to convince Venezuelans to overthrow dictator Nicolas Maduro.\n\nPresident George W. Bush directed aid to Iran after a devastating earthquake in 2003. | Salah Malkawi/Getty Images\n\nThe draft document does include some significant caveats. It states, for example, that the friends-only approach can be overridden if there are “overriding strategic, national security, or humanitarian concerns that require its continuation.”\n\nThat means a country such as Egypt, which activists regularly slam for its poor human rights record, is likely to keep receiving large amounts of U.S. aid because it helps the U.S. counter terrorist groups and foreign adversaries in the Middle East.\n\nThe draft document emphasizes the importance of countries eventually “graduating” off of U.S. foreign assistance completely. It argues for the need to leverage the private sector to help struggling states and the importance of evaluating aid programs to make sure they are achieving their goals.\n\nIt is in many ways dismissive of multilateral institutions involved in aid.\n\nThe document says the U.S. should move toward voluntary payments instead of required — or “assessed” — payments for certain U.N. bodies that “do not serve the interests of the United States,” though it does not say which. It also suggests shifting foreign aid to “bilateral channels as much as possible.”\n\nOne directive in the draft could prove especially controversial. It states the U.S. should “end foreign assistance programs designed to address the supposed socioeconomic causes of terrorism.”\n\nAid experts say they can see some value in rethinking the approach to such programs as researchers regularly reassess what factors lead people to join terrorist groups. Still, it could come down to how this directive is defined and whether it’s possible to accurately gauge a program’s success.\n\nThe document also says U.S. aid should support America’s “economic interests.” Under that rubric, it includes supporting programs that empower women worldwide, a favorite issue of Ivanka Trump, the president’s daughter and adviser.\n\nAlso under that concept, the draft recommends the U.S. help other nations \"increase access to affordable and reliable energy, and expand United States leadership in the global energy system.”\n\nThe document does not delve into detail on that issue, but many Trump administration officials view future access to energy sources as critical in staying a step ahead of rivals such as China and Russia.", "description": "Foreign aid policy has long operated under the principle — at least in theory if not always in practice — that financial assistance should prioritize humanitarian need.", "authors": ["Nahal Toosi"], "top_image": "https://static.politico.com/76/d4/fa7bbfd14981bbf1b35362db9808/190906-donald-trump-gty-773.jpg", "published_at": "2019-09-06"}