{"pub": "cbc", "url": "https://cbc.ca/news/opinion/election-test-1.5325206", "downloaded_at": "2019-10-19 11:15:47.660097+00:00", "title": "OPINION | This election presented would-be prime ministers with a moral test. They all failed: Opinion | CBC News", "language": "en", "text": "This federal election has been characterized as one of the nastiest in recent memory, but I don't think that's quite right.\n\nThere's been no mocking of facial paralysis, robocalls to suppress votes, puking on stage or warning of soldiers with guns in our cities.\n\nTo be sure, there's been plenty of nonsense, even beyond the personal attacks: the Conservatives invented a make-believe concept called \"automatic bail\" for gang members and then promised to eliminate it; the NDP mused about abolishing the Senate somehow and giving provinces a veto on pipelines, maybe; the Liberals warned that Conservative Leader Andrew Scheer would roll back abortion access in areas where the Liberals themselves have largely ignored the issue of abysmal abortion access.\n\nIt's unattractive, certainly, but it's also par for the course. An election campaign that isn't fuelled by vitriol, half-truths, blatant pandering and petty attacks would be an exceptional one.\n\nBut this election was different for another reason. Bill 21, the Quebec law that prohibits Canadians who wear religious garb from working in certain positions of authority within the province's civil service, offered each leader vying to become prime minister an immediate and relevant moral test: was he or she willing to put minority rights above personal stakes and take a strong, unequivocal, necessary stand against discrimination?\n\nThe election campaign provided the answer.\n\nDuring the English debate, Liberal Leader Justin Trudeau dressed down NDP Leader Jagmeet Singh for failing to commit to 'leave the door open' to challenging the law in court. (The Canadian Press)\n\nFor weeks, the leaders only addressed the issue when asked. They meekly expressed their disagreement (if that) with the law, then checked to see if their shoelaces were still tied. No one wanted to alienate Quebec voters.\n\nThe Liberals have been grappling with a resurgent Bloc Québécois in Quebec, which has pivoted away from its sovereigntist roots to focus more on Quebec autonomy and identity. Scheer has barely acknowledged Bill 21 exists. And NDP Leader Jagmeet Singh, who himself wears religious symbols, has been stuck trying to balance the progressive values of his party with the personal interests of the handful of NDP MPs in Quebec who don't want to lose their jobs.\n\nThe only moment during the campaign when the leaders clashed on the law — if you can call it that — was during the English-language debate, when Liberal Leader Justin Trudeau dressed down Singh for failing to commit to \"leave the door open\" to challenging the law in court. Trudeau noted that he had vowed to do something on the law, possibly, sometime in the future, maybe; so, why wouldn't Singh make the same pledge?\n\nThat was the only glimpse Canadians got of what we'll have to count as space between the parties' positions on the law, though they were asked about it repeatedly. During the French-language debate, Singh responded to a question on Bill 21 by saying he respected provincial jurisdiction and would not intervene in a court challenge.\n\n\"Yes, I wear a turban, but I share your values,\" he said.\n\nWhen asked about his government's position, Trudeau repeatedly said it would be \"counterproductive\" to intervene at this time, even though he personally opposes the law. And just this past Tuesday, Scheer was asked how he reconciles his pledge to reopen an office of religious freedom with his reluctance to defend the religious rights of Quebecers.\n\n\"This is a decision that was taken by the Assemblée nationale and elected representatives of Quebec, and we're not going to intervene in this case,\" he said.\n\nThus went the entire campaign.\n\nFor many Canadians, this won't matter. We know from opinion polls that these sorts of mandatory secularism measures have decent support, even outside Quebec. A Léger poll from April, for example, suggested that 46 per cent of Canadians would be in favour of a similar law. A more recent Ipsos poll reported slightly higher support, at 48 per cent. This election, issues such as climate change, affordability, housing and health care have all taken precedent, and understandably so.\n\nAt the same time, the 2019 election hasn't offered the same, obvious \"Who are we as Canadians?\" questions of the 2015 campaign. Then, the choice was presented as one between a country that opens its doors to refugees and one that does not; one that treats Canadians who choose to consume cannabis as responsible adults and one that treats them as criminals; one where we see our government as open, accessible and receptive and one where it is not (we all know how that turned out).\n\nThis time, the \"Who are we?\" question is less obvious, but it's still there. Are we the type of country that shrugs off systemic discrimination just because it's happening in one province, thus the business only of those who live there? Or do we stand up for minority rights regardless of where they are being challenged? And what do we demand of our federal representatives when a disenfranchised group is facing systemic discrimination?\n\nIf the electoral map looked different, Scheer would've framed the law in the context of the small-c conservative principles of personal freedoms and government restraint. (Adrian Wyld/The Canadian Press)\n\nSome readers will no doubt accuse me of beating a dead horse and echoing arguments already made in earlier columns. And had our leaders taken one of the dozens of opportunities provided to them on the campaign trail, when they enjoy a disproportionate level of media attention, to meaningfully address a real problem that affects the lives of some Canadians, I would be writing about something else. That didn't happen.\n\nLeadership is supposed to be about speaking out for those who don't have your voice and advocating for those who don't have your power. Not later — once it's safe, and the election is over — but now while people in Canada are currently being denied employment opportunities because of how they show their faith.\n\nVoters decide who to support for all sorts of reasons: for what they promise, and what they plan, and who endorses them, and what they say. Personal character is as good a measure as any of those things. In this election, each leader had the opportunity to demonstrate they had the courage and conviction to take a stand on a contentious moral issue, despite political consequences. That's something worth voting for. And that was the test. They all failed.\n\nThis column is part of CBC's Opinion section. For more information about this section, please read our FAQ.", "description": "In this election, the leaders of the three major parties had the opportunity to demonstrate they had the courage and conviction to take a stand on a contentious moral issue — Quebec's secularism law — despite political consequences. They all declined that opportunity.", "authors": ["Robyn Urback Is An Opinion Columnist With Cbc News", "A Producer With The Cbc'S Opinion Section. She Previously Worked As A Columnist", "Editorial Board Member At The National Post. Follow Her On Twitter At", "More Robyn Urback"], "top_image": "https://i.cbc.ca/1.5051889.1571363634!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/trudeau-scheer-singh-composite.jpg", "published_at": "2019-10-18"}