{"pub": "yahoo", "url": "https://investopedia.com/articles/retirement/011317/how-have-comfortable-retirement-social-security-alone.asp?utm_campaign=quote-yahoo&utm_source=yahoo&utm_medium=referral&yptr=yahoo", "downloaded_at": "2019-10-30 00:13:33.875513+00:00", "title": "How to Have a Comfortable Retirement on Social Security Alone", "language": "en", "text": "Social Security is one way to supplement retirement income when your savings fall short, but it only goes so far. As of September 2019, the average monthly retirement benefit was just $1,427.97.\n\nIf you’re headed toward retirement with a nest egg that’s smaller than you’d like, you’ll need a game plan for making do with Social Security alone, so let’s see what we can come up with.\n\nKey Takeaways The Social Security Administration estimates that 21% of married couples and 44% of single seniors rely on Social Security for 90% or more of their income.\n\nWaiting to take Social Security until age 70 will increase your benefit by 8% a year beyond full retirement age.\n\nCutting overhead can help trim your budge.\n\nMedicaid, state Medicare Savings Programs, and Extra Help programs can help seniors pay healthcare costs in retirement.\n\nRetiring abroad to a country where your Social Security will go much further is another option to investigate.\n\nWho’s Banking on Social Security?\n\nNearly nine out of 10 Americans ages 65 and older currently receive Social Security. The Social Security Administration estimates that 21% of married couples and 44% of single seniors rely on Social Security for 90% or more of their income.\n\nAccording to a 2019 Gallup poll, 57% of retirees rely on Social Security as a major source of income, while only 33% of near-retirees say they expect Social Security to be a major source of income once they retire.\n\nNon-retirees may expect less from Social Security because they realize that the system's trust funds are predicted to run out of money by 2035—the program's pay-as-you-go structure cannot cover everything it needs and will need revision.\n\nHowever, many Americans may have to turn to Social Security based on their lack of financial planning for retirement. In the Gallup poll, for example, just 25% overall say they are saving enough for the day when they quit working, while half think they should be saving more and 18% have no retirement savings.\n\nWhen Social Security is your primary or only source of funds in retirement, it takes some creativity to make those dollars go further. Certain adjustments can help you to navigate retirement without leaving you broke. Here are four concrete steps you can take.\n\nDelay Taking Social Security as Long as You Can\n\nNormal retirement age is 67 these days for seniors born in 1960 or later, but you can begin taking your Social Security benefits as early as 62. The problem is that if you do, you’ll see your benefits reduced for each year you take them ahead of schedule.\n\nOn the other hand, if you can put off taking your benefits past full retirement age, you’ll see your monthly benefit check increase. For someone who was born in 1943 or later and waits until age 70 to apply for Social Security, the increase should come to 8% per year. Those extra dollars could come in handy if you don’t have any other retirement money to fall back on.\n\nDownsize Your Home\n\nHousing costs can easily eat up your Social Security benefits. The Bureau of Labor Statistics estimates that seniors ages 65 to 74 spend approximately 32% of their household income on housing each year. That amount climbs to 36.5% at age 75.\n\nTrading in your current home for something smaller can help to cut down on what you’re spending. A reduction of even $100 a month could make a significant difference in the lifestyle you’re able to maintain. If the numbers really don't work out well in your current location, consider moving to a region with a lower cost of living—or even moving abroad.\n\nStreamline Your Other Expenses\n\nIf you’ve managed to make your housing more affordable, the next step is reducing or eliminating other household spending. If you’ve got credit card debt or a car loan, for example, you’ll want to get those paid off as quickly as possible. Then you can move on to reducing things like your utility bills, transportation expenses, and food budget.\n\nThe key question that you must ask is: What do you really need to have an enjoyable retirement and what can you live without? Could you ditch cable TV, for example, in favor of watching TV online and other activities, such as pursuing a low-budget hobby? If you own two cars—and you and your spouse are both retired—could you sell one of them? These kinds of decisions can be tough, but they can make your transition to retirement on Social Security a much smoother one in the long run.\n\nKeep Healthcare Costs Under Control\n\nHealthcare is another potential trouble spot for which you need to plan, especially if you have an existing medical condition. While Medicare can cover some of the costs beginning at age 65, it doesn’t pay for everything. If you’ve retired and your income is exclusively coming from Social Security, you’ll need to look beyond Medicare to pay for your medical expenses.\n\n$285,000 The amount a 65-year-old couple will need for healthcare costs (excluding long-term care) during retirement, according to Fidelity Investments.\n\nMedicaid, for example, is available to low-income seniors, and you can have this coverage along with Medicare. It’s designed to pick up the tab for things Medicare doesn’t cover, including long-term care. State-sponsored Medicare Savings Programs help with the cost of Medicare premiums, while the Extra Help program helps with prescription drug costs. Just keep in mind that your ability to qualify for these programs is based on your age, income, and, in some cases, your disability status.\n\nThe Bottom Line\n\nIs it possible to have a comfortable retirement on Social Security alone? This is an urgent question because—although saving for retirement should be at the top of everyone's financial to-do list—for many Americans it often ends up slipping through the cracks.\n\nTake baby boomers. According to a 2019 report by the Insured Retirement Institute, 45% of baby boomers have no retirement savings whatsoever. Perhaps not surprisingly, one third plan to retire at age 70 or older—or not at all.\n\nSocial Security isn’t a substitute for building a solid retirement base, and if you’ve still got time before you retire, consider looking for ways to build up your savings. Start by chipping in as much as you can to your employer’s retirement plan, especially if it comes with a matching contribution. If you don’t have a 401(k) or similar plan at work, an individual retirement account (IRA) is another way to grow your savings. The more you set aside now, the less pressure you’ll feel to make your Social Security benefits stretch.", "description": "Social Security retirement benefits only go so far, so you'll need a game plan to make it work.", "authors": ["Rebecca Lake"], "top_image": "https://www.investopedia.com/thmb/-S1CDHzSgn-I1wFXfJwDyCFiiDI=/680x440/filters:fill(auto,1)/istock_000018296325_large-5bfc3bba46e0fb002605b206.jpg", "published_at": "2019-10-29"}