{"pub": "fox", "url": "https://foxnews.com/politics/graham-urges-trump-to-listen-to-commanders-on-syria-not-policy-shop-civilians", "downloaded_at": "2019-10-24 00:31:31.512876+00:00", "title": "Graham urges Trump to listen to commanders on Syria, not 'policy-shop civilians'", "language": "en", "text": "Sen. Lindsey Graham pleaded with President Trump on Wednesday to listen to his military commanders and not \"policy-shop civilians\" regarding the ongoing conflict in Syria.\n\nIn separate tweets, the South Carolina Republican urged Trump to stop listening to the Office of the Secretary of Defense and instead \"listen to your commanders.\"\n\n\"Mr. President: listen to your commanders, not OSD policy shop civilians. OSD policy shop has been a big problem for a long time,\" Graham wrote.\n\nHouse impeachment inquiry is 'political revenge,' 'should be dismissed quickly' in Senate, Lindsey Graham says\n\nThe OSD is responsible for policy development and planning, among other duties.\n\nTURKEY ANNOUNCES NORTHERN SYRIA INVASION OF GROUND FORCES; MULTIPLE CIVILIANS REPORTED DEAD\n\nGraham, a staunch Trump ally, has been a vocal opponent of Trump's plan to pull American troops from northeastern Syria earlier this month.\n\nThe withdrawal paved the way for Turkey to launch a military assault against Syrian Kurds, whom it views as terrorists, near the border.\n\nGraham has expressed support for Kurdish fighters, who have fought alongside U.S. troops against the Islamic State terror group. He previously called Trump's move \"shortsighted\" and \"irresponsible.\"\n\nIn one tweet, Graham expressed hope that a cease-fire between Turkey and Syrian Kurdish forces announced by Trump hours earlier would hold.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe cease-fire required Kurdish forces formerly allied with the U.S. against ISIS to move out of a roughly 20-mile zone on the Turkish border. With Kurdish forces out of the zone, Turkey will halt its assault, Trump said.\n\nHe added the agreement has \"saved the lives of many, many Kurds.\"", "description": "Sen. Lindsey Graham pleaded with President Trump on Wednesday to listen to his military commanders instead of \"policy shop civilians\" regarding the ongoing conflict in Syria.", "authors": ["Louis Casiano"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/AP19295618796627.jpg", "published_at": "2019-10-23"}