{"pub": "independent", "url": "https://independent.co.uk/news/business/news/grand-designs-presenter-kevin-mccloud-property-business-liquidation-a9158786.html", "downloaded_at": "2019-10-16 20:38:51.535873+00:00", "title": "Grand Designs presenter Kevin McCloud's property business collapses into liquidation", "language": "en", "text": "Hundreds of small investors are nursing heavy losses after three companies in Grand Designs presenter Kevin McCloud’s property empire collapsed into liquidation.\n\nCreditors of HAB Land rejected rescue plans and voted to put the company and two related entities into voluntary liquidation on Tuesday.\n\nJust under 300 small investors put in an average of around £8,000 through minibonds, almost all of which will now be lost.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSimon Bullock, one of HAB Land’s directors, said just 22 per cent of minibond holders had voted for plans to raise additional finance, leaving no choice but to liquidate the company.\n\nJames Bennett of KPMG, who is handling the process, said delays and higher costs on HAB Land’s building projects had resulted in “significant” cash-flow problems.\n\nShape Created with Sketch. Home between houses - Riba-roja de Túria, Spain Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Home between houses - Riba-roja de Túria, Spain 1/11 Alberto Facundo Arquitecto 2/11 Alberto Facundo Arquitecto 3/11 Alberto Facundo Arquitecto 4/11 Alberto Facundo Arquitecto 5/11 Alberto Facundo Arquitecto 6/11 Alberto Facundo Arquitecto 7/11 Alberto Facundo Arquitecto 8/11 Alberto Facundo Arquitecto 9/11 Alberto Facundo Arquitecto 10/11 Photography by Alberto Facundo Arquitecto 11/11 Alberto Facundo Arquitecto 1/11 Alberto Facundo Arquitecto 2/11 Alberto Facundo Arquitecto 3/11 Alberto Facundo Arquitecto 4/11 Alberto Facundo Arquitecto 5/11 Alberto Facundo Arquitecto 6/11 Alberto Facundo Arquitecto 7/11 Alberto Facundo Arquitecto 8/11 Alberto Facundo Arquitecto 9/11 Alberto Facundo Arquitecto 10/11 Photography by Alberto Facundo Arquitecto 11/11 Alberto Facundo Arquitecto\n\n“After being unable to raise further finance or renegotiate existing liabilities, the directors took the difficult decision to instigate liquidation proceedings,” said Mr Bennett.\n\n“This has resulted in a considerable loss to minibond holders who largely financed the project.”\n\nKPMG said it will investigate the events leading up to the companies’ insolvency which came after HAB Land and HAB Housing raised £2.4m through a minibond in January 2017.\n\nIt was one of a number of schemes that used Mr McCloud's well-known image to market investments in housing developments offering returns of 7 per cent to 9 per cent over five years.\n\nHAB Land Limited was founded in 2014 to acquire development land for two projects in Oxford and Winchester.\n\nMany investors said they felt “angry and betrayed” after they were told in August that they could lose up to 97 per cent of their money.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nA letter at the time stated that “after final completion of the projects at both Kings Worthy and Cumnor Hill [in Oxford], the net return available to bondholders would be expected to range from £606,000 (best case) to £69,000 (worse case) which, in each case, is equivalent to 26 pence and 3 pence for every £1 of bond monies invested”.\n\nNone of the homeowners on the two developments are directly impacted by Wednesday’s announcement, but an HAB Land spokesperson said “the situation remains fluid and under review”.\n\nThe spokesperson added: “This has meant that there is, what we hope to be, a temporary pause on the remaining works on the sites.\n\n“We continue to explore all options to enable these sites to be fully completed.”", "description": "Hundreds of small investors are nursing heavy losses after three companies in Grand Designs presenter Kevin McCloud’s property empire collapsed into liquidation.  Creditors of HAB Land rejected rescue plans and voted to put the company and two related entities into voluntary liquidation on Tuesday. Just under 300 small investors put in an average of around £8,000 through", "authors": ["Ben Chapman"], "top_image": "https://static.independent.co.uk/s3fs-public/KevinMcCloud.jpg", "published_at": "2019-10-16"}