{"pub": "investing.com", "url": "https://za.investing.com/news/stock-market-news/us-stocksfutures-fall-as-deal-hopes-fade-on-report-china-seeks-more-talks-1965807", "downloaded_at": "2019-10-14 11:47:41.682751+00:00", "title": "US STOCKS-Futures fall as deal hopes fade on report China seeks more talks", "language": "en", "text": "© Reuters. US STOCKS-Futures fall as deal hopes fade on report China seeks more talks\n\n(For a live blog on the U.S. stock market, click LIVE/ or type LIVE/ in a news window.)\n\n* Futures down: 0.30%, S&P 0.31%, Nasdaq 0.41%\n\nBy Sagarika Jaisinghani\n\nOct 14 (Reuters) - U.S. stock index futures fell back on Monday as hopes of a quick resolution to the U.S.-China trade war were dashed by a report that China wanted more talks before signing a partial deal announced by President Donald Trump on Friday.\n\nThe S&P 500 and Dow Jones indexes ended last week with their first increase in four after the partial trade deal was announced, with Trump saying it could take up to five weeks to get a pact written. reported on Monday that China wanted further negotiations as soon as the end of October to work out the details, and wanted Trump to scrap another tariff increase set for December. of companies with a sizeable exposure to China, which soared on Friday, slipped in trading before the bell. Apple Inc fell 0.7%, while Nvidia Corp , Advanced Micro Devices Inc and Micron Technology Inc dropped between 0.5% and 1%.\n\nThe tit-for-tat tariff war between the world's top two economies has rankled financial markets, dented global growth and dampened business sentiment over the past 15 months. The benchmark S&P 500 index is now nearly 2% off its record high after coming within striking distance last month.\n\nAt 6:59 a.m. ET, 1YMcv1 were down 79 points, or 0.3%. S&P 500 e-minis EScv1 were down 9.25 points, or 0.31% and NQcv1 were down 32.25 points, or 0.41%.\n\nInvestors will now be looking at third-quarter earnings to gauge the impact of the trade conflict and a sluggish domestic economy on corporate America.\n\nThe reporting season kicks off on Tuesday, with the biggest U.S. banks expected to report a 1.2% decline in earnings due to falling interest rates. analysts are forecasting a 3.2% decline in earnings for S&P 500 companies for the quarter from a year earlier, based on IBES data from Refinitiv.\n\nBank of America Corp (NYSE: ) BAC.N , Citigroup Inc (NYSE: ) C.N , JPMorgan Chase (NYSE: ) & Co JPM.N were down between 0.4% and 0.9% in premarket trading.\n\nFastenal Co was down 2.5% after two brokerages downgraded the stock. The company had logged its best day in three decades on Friday after reporting strong results. Air Lines Inc DAL.N fell 1.1% after Stephens cut its rating on the stock to \"equal-weight\" from \"overweight\", citing rising costs. It also cut its price target to $57 from $75.", "description": "US STOCKS-Futures fall as deal hopes fade on report China seeks more talks", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEBBR0PM_L.jpg", "published_at": "2019-10-14"}