{"pub": "yahoo", "url": "https://finance.yahoo.com/news/dte-energy-nears-2-5-000201836.html", "downloaded_at": "2019-10-18 08:04:57.913094+00:00", "title": "DTE Energy nears $2.5 bln M5 Midstream acquisition - sources", "language": "en", "text": "By David French\n\nNEW YORK, Oct 17 (Reuters) - U.S. power utility DTE Energy Co is nearing a deal to acquire gas pipeline system M5 Midstream LLC for about $2.5 billion, expanding its business that's not tied to electricity provision, people familiar with the matter said on Thursday.\n\nAdvanced energy efficiency measures have made the provision of electricity less lucrative for power companies such as DTE, which serves about 2.2 million customers in southeastern Michigan, including Detroit.\n\nIn response, DTE has sought to expand its businesses that encompass natural gas pipelines and storage, because they provide steady cash flows even during energy price swings. DTE also has an energy marketing and trading business.\n\nAn agreement for DTE to acquire M5 Midstream, which operates in the Haynesville shale formation spanning Louisiana and parts of East Texas, could be announced as early as Friday, the sources said, cautioning it was possible that the talks could collapse at the last minute.\n\nThe sources asked not to be identified because the matter is confidential.\n\nDTE Energy didn't immediately respond to a request for comment. M5 Midstream didn't respond to a request for comment.\n\nM5 Midstream owns pipelines that transport gas from the drilling site to larger pipes that then take it to end users, known as gathering and processing assets, as well as pipelines which move water used in shale exploration.\n\nM5 Midstream was developed by Momentum Midstream LLC, whose private equity investors include Yorktown Partners, Ridgemont Equity Partners, Magnetar Capital, GSO Capital Partners and Trilantic Capital Partners, according to its website.\n\nThis would be the second time that DTE has bought a business from Momentum Midstream. In 2016, it acquired gas pipeline assets in Pennsylvania and West Virginia, dubbed M3 Midstream LLC.\n\nLast month, NextEra Energy Partners, backed by U.S. power utility NextEra Energy Inc, agreed a $1.4 billion deal to buy Meade Pipeline Co, a gas pipeline network that connects the Marcellus basin to the mid-Atlantic and Southeastern regions of the United States. (Reporting by David French in New York; editing by Richard Pullin)", "description": "U.S. power utility DTE Energy Co is nearing a deal to acquire gas pipeline system M5 Midstream LLC for about $2.5 billion, expanding its business that's not tied to electricity provision, people familiar with the matter said on Thursday.  Advanced energy efficiency measures have made the provision", "authors": ["David French"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-18"}