{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-asia-storm-taiwan/taiwan-orders-markets-schools-closed-as-strong-typhoon-approaches-idUKKBN1WF033", "downloaded_at": "2019-09-30 02:21:13.172782+00:00", "title": "Taiwan orders markets, schools closed as strong typhoon approaches", "language": "en", "text": "YILAN, Taiwan (Reuters) - A typhoon will hit northern Taiwan later on Monday, meteorologists said, shutting financial markets and schools as airlines canceled dozens of flights amid warnings of floods and high winds on the island.\n\nTyphoon Mitag, categorized by Taiwan’s weather bureau as the second-strongest typhoon level, was expected to approach the coast of the northeastern county of Yilan with maximum winds of 162 kmh (100 mph).\n\nIt was moving across the ocean in a north-northwesterly direction at 27 kmh (17 mph), weather officials said, and could gain strength as it approaches the island.\n\nThe bureau issued wind and rain warnings for greater Taipei, the northern port city of Keelung, and other northern counties. It also put out a warning to seafarers around Taiwan.\n\n“Typhoon Mitag is about to hit Taiwan ... Please pay attention to your safety and make preparations for the typhoon,” Premier Su Tseng-chang wrote on Facebook late on Sunday.\n\nDozens of flights and ferry services were canceled, while several highways across the island were shut amid fears of landslides and floods.\n\nThe typhoon was expected to approach China’s eastern city of Shanghai on Tuesday, forecasts showed.\n\nTyphoons regularly hit Taiwan, China, the Philippines and Japan in the second half of the year, gathering strength from the warm waters of the Pacific Ocean or South China Sea.\n\nTyphoon Morakot devastated Taiwan in 2009 and killed nearly 700 people, most of them in landslides.", "description": "A typhoon will hit northern Taiwan later on Monday, meteorologists said, shutting financial markets and schools as airlines canceled dozens of flights amid warnings of floods and high winds on the island.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-30"}