{"pub": "fox", "url": "https://foxnews.com/us/texas-flash-flooding-tropical-depression-imelda", "downloaded_at": "2019-09-19 23:11:44.659799+00:00", "title": "Texas hit by Imelda deluge, flash floods, 'life-threatening' rainfall: 'It's as bad as I've ever seen'", "language": "en", "text": "Severe flash flooding hit parts of east Texas on Thursday as the center of Tropical Depression Imelda hit close to Houston, just over two years since the community was devastated by Hurricane Harvey.\n\nUp to 5 inches of rain per hour could fall in Harris County, where Houston is located, throughout the day Thursday, forecasters said. The National Weather Service issued a flash flood emergency warning for several counties, saying \"life-threatening amounts of rainfall\" have already dropped. County officials reported a combination of at least 1,000 high-water rescues and evacuations to get people to shelter, in anticipation of the threat lingering.\n\nThe city of Hamshire saw more than 40 inches of rain — 25 of which fell within a 12-hour span, and meteorologists with AccuWeather are predicting a total of 55 inches of rain.\n\nHURRICANE HUMBERTO THREATENS BERMUDA\n\nMayor Sylvester Turner cautioned people against driving or going outside, urging residents to wait for the storm to clear. \"Remain where you are and be safe,\" the city's Office of Emergency Management advised online.\n\nIn Chambers County, at least 200 people have had to be rescued in the town of Winnie, located roughly 60 miles east of Houston, according to Sheriff Brian Hawthorne. In addition to a flash flood warning, the NWS has also issued a tornado warning for the county.\n\nThe city has been hit hard by flooding, and an additional 50 households were on a waiting list to be rescued as of Thursday, he said. Airboats from the sheriff's office and the Texas Parks & Wildlife Department were helping with the rescues, along with high-water vehicles, the sheriff added.\n\n\"It's as bad as I've ever seen it. Right now, I'm in an absolute deluge of rain,\" Hawthorne told The Associated Press of Winnie, adding the town \"looks like a lake.\" He said it's the worst storm-related flooding he's experienced after going through hurricanes including Rita in 2005, Ike in 2008 and Harvey two years ago.\n\n\"Right now, as a Texas sheriff, the only thing that I really want is for people to pray that it will quit raining,\" he said.\n\nIn Jefferson County's Beaumont, a city of just under 120,000 people that's about 30 miles from the Gulf of Mexico, authorities said all service roads were impassable and two hospitals were inaccessible, according to the Beaumont Enterprise. Local police said on Twitter that 911 has received requests for more than 250 high water rescues and 270 evacuations.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe George Bush Intercontinental Airport in Houston is open, but surrounding streets are flooded, airport officials tweeted. Flights are experiencing delays up to roughly 4 hours.\n\nNo deaths or injuries were reported in connection with Imelda as of Thursday. Earlier in the week, the storm was downgraded to a tropical depression after making landfall as a tropical storm Tuesday near Freeport, Texas, with maximum sustained winds of 40 mph.\n\nThe Associated Press contributed to this report.", "description": "Severe flash flooding hit parts of east Texas on Thursday as the center of Tropical Depression Imela hit close to Houston, just over two years since the community was devastated by Hurricane Harvey.", "authors": ["Nicole Darrah", "Nicole Darrah Covers Breaking", "Trending News For Foxnews.Com. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/AP-Houston-Floods4.jpg", "published_at": "2019-09-19"}