{"pub": "cnbc", "url": "https://cnbc.com/2019/10/16/libras-co-creator-touts-progress-after-exodus-of-the-crypto-backers.html", "downloaded_at": "2019-10-16 13:35:35.040985+00:00", "title": "Libra's co-creator at Facebook touts progress after an exodus of key backers of the crypto coin", "language": "en", "text": "The co-creator of Facebook-backed libra defended the cryptocurrency on Wednesday after a number of recent high-profile companies abandoned the effort.\n\nLibra ran into issues Friday after Visa, Mastercard, Stripe, eBay and Mercado Pago bolted. Booking Holdings, formerly Priceline, left Monday. Each of the companies would have potentially invested $10 million each into the project.\n\nThe digital currency will not be run by Facebook, but rather by a nonprofit association supported by a range of companies and organizations.\n\n\"It wasn't a tough week,\" said David Marcus, head of Facebook's Calibra digital wallet, which can serve as a way to store and exchange Libra. Calibra won't be the only wallet. It will interact with other Libra-accepted platforms.\n\n\"I would rather have all of these companies come with us,\" he added, saying that he understands companies have to respect shareholders who are skeptical of the digital coin.\n\nInstead, Marcus pointed to Libra's progress in a \"Squawk Box\" interview. The founding members, including Uber, Lyft and Spotify, held their first meeting on Monday in Geneva, Switzerland where they settled on an organizational structure and a five-seat board of directors, including Marcus and representatives from Libra-backer Andreessen Horowitz, a leading Silicon Valley venture capital firm.\n\nThe goal of Libra — using blockchain, the technology underlying bitcoin on other cryptocurrencies — is to make it as easy to send money across the world as it is to send a photo. But unlike bitcoin and others, Libra will be backed by more stable government-backed money.\n\nGovernments so far have been skeptical of the digital coin, with policymakers around the world upping pressure on libra. Facebook CEO Mark Zuckerberg is set to face Congress next week to answer questions on libra.\n\nThough Marcus stressed on Wednesday that the project is just that: an idea with room for improvement. Libra, which was announced in June, is aiming to launch in the first half of 2020.\n\n\"It's kind of odd that all of this is happening at the stage of this project because it's a project. It's an idea. It's a whitepaper. Nothing is operating yet,\" he said when asked about the political pressure. \"It's kind of sad in a way to see all the issues that we currently have with the current system.\"\n\nMarcus, testifying before House lawmakers, also indicated in July that the group fully plans to move forward with libra.\n\nWhen asked by Chairwoman Maxine Waters, D-Calif., whether Facebook would postpone its launch plans until regulations were in place, Marcus didn't give a definitive answer. Waters said his answer \"was not a commitment.\"", "description": "David Marcus, head of Facbook's Calibra digital wallet, says, \"It wasn't a tough week,\" despite the news of Libra backers recently abandoning the project.", "authors": ["Jessica Bursztynsky"], "top_image": "https://image.cnbcfm.com/api/v1/image/106022315-1563306264093david.jpg?v=1571224334", "published_at": "2019-10-16"}