{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7566751/The-X-Factor-Celebrity-Love-Island-supergroup-divides-viewers.html", "downloaded_at": "2019-10-13 00:30:50.568778+00:00", "title": "The X Factor: Celebrity: Love Island super group divides viewers", "language": "en", "text": "The Love Island supergroup kicked off The X Factor: Celebrity 2019 on Saturday night, as they divided viewers with their vocals.\n\nFormed of Zara McDermott, Eyal Booker, Wes Nelson and Samira Mighty, The so-called Islanders took to the stage with a rendition of There's Nothing Holdin' Me Back by Shawn Mendes and earned a predominantly positive response from the panel.\n\nThe Islanders were joined by a slew of stars including Martin Bashir, Kevin McHale and Megan McKenna for the first round of auditions at Simon Cowell's Los Angeles home, to earn a coveted spot in the live shows.\n\nShow-stopping? The Love Island supergroup kicked off The X Factor: Celebrity 2019 on Saturday night, as they divided viewers with their vocals\n\nThe X Factor: Celebrity saw nine acts take to the stage in front of judges Simon, Nicole Scherzinger and Louis Walsh along with a star-studded audience to earn a spot in the live shows.\n\nAs they performed, Samira displayed her amazing vocals, while Wex revealed a hidden talent for rap.\n\nZara and Eyal also offered their own vocals during the audition, and overall the group earned a positive response from the panel.\n\nStrong? Formed of Zara McDermott, Eyal Booker, Wes Nelson and Samira Mighty, The so-called Islanders performed a rendition of There's Nothing Holdin' Me Back by Shawn Mendes\n\nWow! Wes in particular surprised viewers, as he showed off some free-styling rap skills during the audition\n\nHowever, Simon noted that they need to work on finding their distinct sound but assured them that they could sing.\n\nViewers seemed more split on the group, as they took to social media to offer their critiques, with several stunned by Wes' amazing rap skills.\n\nOne posted: 'Wes needs to join tri-star forget the whole Love Island thing!' while several posted hilarious memes to capture their reaction to his free-styling.\n\nAnother added: 'I'm sorry but Love Island the band?! Cool bro.'\n\nIt needs work: Judge Simon Cowell - who held the auditions at his LA home - said that the group could sing, and now needed to work on their 'distinct sound'\n\nIt was good! Fans were equally divided by the groups' audition, with many praising the band and Wes Nelson's rapping in particular\n\nSadly some viewers were unconvinced by the group's audition, with one tweeting: 'OK the love Island group singing is the most cringing thing I've ever sat through.'\n\nAnother added: 'Sorry but the Love Island group sounds like me and my housemates having a sing song in the car on the way to get our shopping. It's a no from me.'\n\nFans will have to wait and see whether the Islanders will advance to the live shows, with the results set to be revealed next Saturday.\n\nNo it wasn't! Others hated the performance and rushed to social media to slam the group. It will be revealed next week whether they will advance to the next round\n\nIn the first episode of The X Factor: Celebrity, seven acts took to the stage with an audition, and while some impressed the panel, others struggled to make an impression.\n\nAmong the highlights was veteran broadcaster and interviewing legend Martin Bashir, who admitted he signed up for the show after vowing to live life to the fullest in honour of his late brother, who passed away in 1991.\n\nOpting for the classic tune L.O.V.E by Nat King Cole, Martin earned a thunderous response as he warmed the hearts of the audience and viewers with his performance.\n\nSweet: Among the highlights was veteran broadcaster and interviewing legend Martin Bashir, who warmed the audience's hearts with his performance of a Nat King Cole classic\n\nStrong: Glee star Kevin McHale also put a twist on Camilla Cabello's Never Be The Same, and given his musical background, it came as no surprise that he delivered with his vocals\n\nGlee star Kevin McHale also put a twist on Camilla Cabello's Never Be The Same, and given his musical background, it came as no surprise that he delivered with his vocals.\n\nTV duo Brendan Cole and Jeremy Edwards did not receive the unanimous praise that they were hoping for, as they performed a minimal version of Kylie Minogue's Love At First Sight.\n\nYoutube stars Max and Harvey also overcame some nerves with their first track to sing Sucker by The Jonas Brothers in sensational style, while Hayley Hasselhoff earned a mixed response with her 'between a record and a musical' performance.\n\nStruggling: Brendan Cole and Jeremy Edwards did not receive the unanimous praise that they were hoping for, as they performed a minimal version of Kylie Minogue's Love At First Sight\n\nShowgirl: Hayley Hasselhoff earned a mixed response with her 'between a record and a musical' performance\n\nWow! Another surprise of the night came from The Chase star Jenny 'The Vixen' Ryan - who belted out Somebody To Love by Freddie Mercury\n\nAnother surprise of the night came from The Chase star Jenny 'The Vixen' Ryan - who belted out Somebody To Love by Freddie Mercury and left the entire audience of musical thespians completely stunned.\n\nClosing out the opening show were the rugby star supergroup Thom Evans, Ben Foden and Levi Davis - who formed the group Try Star.\n\nAlthough the trio had already delighted viewers with their jaw-dropping physique, it appeared that they could also sing, as they belted out Blackstreet's No Diggity.\n\nThe X Factor: Celebrity continues on Saturday on ITV.", "description": "The Love Island supergroup kicked off The X Factor: Celebrity 2019 on Saturday night, as they divided viewers with their vocals.", "authors": ["Laura Fox For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/22/19637338-0-image-a-48_1570915968064.jpg", "published_at": "2019-10-12"}