{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7621055/Prince-Charless-staff-blocked-Crown-stars-attending-Netflix-event.html", "downloaded_at": "2019-10-28 09:51:38.070396+00:00", "title": "Prince Charles's staff blocked The Crown stars from attending Netflix event", "language": "en", "text": "Prince Charles's staff stopped actors from Netflix drama The Crown attending a star-studded event alongside him, Prince William and Harry, it was claimed today.\n\nAides for the Prince of Wales were allegedly concerned that the show's depiction of his relationships with Princess Diana and Camilla could dent his popularity.\n\nOther Netflix stars such as Emma Mackey from Sex Education and Black Mirror creator Charlie Brooker were instead at the event in London in April.\n\nJosh O'Connor plays Prince Charles and Emma Corrin portrays Princess Diana in series four of The Crown. They are pictured filming in Almeria, Spain, on October 1\n\nPrince William, Sir David Attenborough, Prince Charles and Prince Harry attend the 'Our Planet' premiere at London's Natural History Museum on April 4\n\nThe premiere at the Natural History Museum marked the launch of Sir David Attenborough's eight-part Netflix environmental series Our Planet.\n\nOther celebrities in attendance included David Beckham, singer Ellie Goulding, Love Island's Camilla Thurlow and presenter Konnie Huq, who is Brooker's wife.\n\nA royal source told The Sun: 'Charles's staff are deeply paranoid about The Crown. They are trying to make him a popular king-in-waiting.\n\n'But the next few seasons are going to be increasingly focused on the Prince of Wales' behaviour, especially around his marriage to Diana and affair with Camilla.'\n\nThe source then claimed to the newspaper that Charles's staff 'made it clear he wouldn't attend the event if Netflix had any of The Crown actors there'.\n\nHarry, William, Charles and Sir David sit in the front row during the premiere in London in April\n\nSir David and Charles speak to each other outside the premiere of Our Planet in London in April\n\nPalace staff have confirmed a decision was made to ban stars from The Crown from the event, but insisted that Charles was not aware of the move.\n\nIt was also claimed that it would be 'hard to see the relevance of attendance by The Crown cast and would be a distraction to the ultimate messages of Our Planet'.\n\nLes Misérables star Josh O'Connor will portray Charles while Call the Midwife's Emerald Fennell will play Camilla in season three which stars on November 17.\n\nGrantchester actress Emma Corrin will play Diana in next year's fourth series of the drama which is about the reign of Queen Elizabeth II, portrayed by Olivia Colman.\n\nA Buckingham Palace spokesman told the Sun: 'The guest list was decided jointly. It is wrong to assert that the Prince of Wales intervened personally.'\n\nOlivia Colman plays the Queen and Tobias Menzies is Prince Philip in The Crown season three\n\nColman in Netflix's historical drama The Crown, which is about the reign of Queen Elizabeth II\n\nThe eight-part series presented by 93-year-old Sir David carried an overtly environmental message exploring the natural world and how to protect it.\n\nCharles, who is president of WWF UK, and his two sons attended the premiere in April to underline the Royal Family's support for action against climate change.\n\nIn a speech, Charles said he was 'enormously touched to have been asked here this evening along with both of my sons to launch this really remarkable series'.\n\nHe added that Sir David had 'done so much to lift the veil of ignorance from our eyes about the integrated and innate beauty of our home'.", "description": "The star-studded premiere at the Natural History Museum in London in April marked the launch of Sir David Attenborough's eight-part Netflix environmental series Our Planet.", "authors": ["Mark Duell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/08/20271116-0-image-a-13_1572252781713.jpg", "published_at": "2019-10-28"}