{"pub": "cbc", "url": "https://cbc.ca/news/canada/photos/climate-strike-across-canada-montreal-greta-thunberg-1.5299682", "downloaded_at": "2019-09-28 01:09:43.554879+00:00", "title": "Hundreds of thousands march in Canada for climate | CBC News", "language": "en", "text": "The latest round of global protests for climate action, which builds on last week's marches by millions of children around the world, included a Montreal rally attended by the Swedish teenage environmental activist Greta Thunberg. Here, climate strike marchers took to the the streets in Montreal.\n\n(Ivanoh Demers/Radio-Canada)\n\n\"I am very excited to be here, and it is going to be very much fun today, to once again stand together with people from around the world, for one common cause,\" says 16-year-old Thunberg, who participated in the Montreal march and appears here, holding her Swedish \"school strike for the climate\" sign.\n\n(Ivanoh Demers/Radio-Canada)\n\nToronto\n\nTens of thousands of protesters flooded the streets of Toronto on Friday, bringing a mix of ceremony and celebration.\n\n(Patrick Morrell/CBC) (Patrick Morrell/CBC)\n\n(Michael Wilson/CBC)\n\n(Craig Chivers/CBC)\n\nNewfoundland\n\nIn St. John's, hundreds of people left Memorial University shortly after 11 a.m. NT on Friday, on the way to Confederation Building, home of the Newfoundland and Labrador House of Assembly.\n\n(Adam Walsh/CBC)\n\nClimate strike participant Jack McGee holds a sign in support of saving the oceans. He says seeing litter on the beach makes him sad, and he helps by picking garbage up before the waves wash over it.\n\n(Katie Breen/CBC)\n\nNova Scotia\n\nThousands of people took to the streets of Halifax on Friday, chanting and carrying signs. Planned events in Nova Scotia on Friday include in Halifax, Truro, Middleton, New Glasgow, Antigonish, Sandy Cove, Baddeck and Sydney.\n\nThousands of people took to the streets of Halifax on Friday, chanting and carrying signs. (Steve Lawrence/CBC)\n\nPrince Edward Island\n\nSeveral hundred Islanders are gathered in front of Province House in Charlottetown, joining people in more than 150 countries working to raise awareness and demand action on climate change.\n\n(Jessica Doria-Brown/CBC)\n\nNew Brunswick\n\nIn New Brunswick, climate strikes occurred in all four corners of the province, including no fewer than a dozen locations across the province. Here, Sumaya Abdalla Muhamed, 19, and Amal Abdalla muhamed, 14, are pictured holding homemade signs. The sign on left asks, \"the climate changes why not you?' The sign at right offers a reminder of why banning plastic bags can help lakes and oceans.\n\n(Julia Wright/CBC)\n\nThe North\n\nProtests occurred across the North, including Whitehorse, Hay River and, here, Yellowknife, where Stacey Black, a Grade 7 student in Yellowknife, had a message for parents Friday.\n\n(Randi Beers/CBC)\n\nThese participants in the climate strike in Iqaluit are holding a large, trilingual \"Climate Change Now\" banner.\n\n(Sara Frizzell/CBC)\n\nEdmonton\n\nParticipants of all ages showed off their signs in Edmonton.\n\n(Terry Reith/CBC)\n\n(David Bajer/CBC)\n\nVancouver\n\nProtesters making their voices on UBC's campus in Vancouver. The students want politicians to commit to reducing greenhouse gas emissions by 75 per cent by 2030.\n\n(Ben Nelms/CBC)\n\nUBC student Heidi Collie, 18, participates in a climate strike on campus in Vancouver. The phrase \"how dare you\" painted on her face echoes Thunberg's statement to the United Nations earlier this week.", "description": "The latest round of global protests for climate action, which builds on last week's marches by millions of children around the world, includes a Montreal rally where Swedish teen activist Greta Thunberg spoke.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5300238.1569616747!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_620/75850-st-john-new-brunswick-climate-strike-signs.jpg", "published_at": "2019-09-27"}