{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/2019/09/29/i-helped-classify-calls-two-presidents-white-house-abuse-system-is-alarming", "downloaded_at": "2019-09-29 23:31:19.631442+00:00", "title": "I helped classify calls for two presidents. The White House abuse of the system is alarming.", "language": "en", "text": "\n\nA page of the unclassified memorandum of President Trump's phone call with Ukrainian President Volodymyr Zelensky. (Alex Wong/Getty Images)\n\nKelly Magsamen is a former National Security Council staff member, as well as a former senior Pentagon official. She is currently the vice president for national security and international policy at the Center for American Progress.\n\nThe whistleblower at the heart of the Ukraine controversy said White House officials ordered information about President Trump’s phone call with President Volodymyr Zelensky to be removed from the classified server typically used to store such information and placed on a hyper-secure “code word” server. Such special protections are typically reserved for material of the gravest sensitivity: detailed information about covert operations, for example, where exposure can get people killed.\n\nThe move was highly suspicious, the whistleblower said several White House officials told him, because “the call did not contain anything remotely sensitive from a national security perspective.” On Friday, the White House confirmed that National Security Council lawyers directed that the call records be placed on that server.\n\nI served under presidents George W. Bush and Barack Obama and worked for four advisers on the National Security Council’s staff. I have staffed presidential meetings and phone calls with foreign leaders and spent hundreds, if not thousands, of hours in the White House Situation Room. It is difficult to overstate just how abnormal and suspicious treating the call in that manner would be. It strongly suggests White House staff knew of serious wrongdoing by the president and attempted to bury it — a profound abuse of classified systems for political, and possibly criminal, purposes.\n\n(The records of Trump’s conversations with Russian President Vladimir Putin and Saudi officials also were restricted to an unusually small group of officials, it now appears, though it’s unclear whether the memos were placed on the special server.)\n\nIn my almost six years on the NSC staff, I never personally saw or heard of the records of a presidential call being moved to the “code word” system. Such a move would be justified only if a president and foreign leader were discussing material so sensitive that intelligence officials with top-secret clearance had to be “read into” to access to it — an unlikely prospect, even with our closest allies. Presidents tend to discuss general foreign policy issues, not the fine details of covert actions.\n\nMoving the memo to the code word server suggests Trump officials really did know the call was as bad as the president’s critics say it is. The argument some Trump officials are making — that they protected Trump’s conversations to avoid leaks — is scarcely less damning, if the point was to avoid leaks of conversations in which the president leveraged U.S. power for his own political advantage (or endorsed foreign interference in U.S. elections).\n\n[Impeachment isn’t mandatory — even if Trump committed impeachable offenses]\n\nIf the code word server was used to prevent leaks as a general matter — the most charitable interpretation — does that mean all of the president’s phone calls with foreign leaders are stored there? That, in itself, would represent a remarkable departure from the intended use of the classification system.\n\nPeople outside national security circles might well wonder whether a president’s calls to foreign leaders are, by their nature, sensitive enough to be placed on the special server. They are not. To be sure, presidential calls are extraordinarily well-protected, befitting their importance. Those calls are the coin of the foreign policy realm. They are carefully prepared, well-staffed by professionals and (ordinarily) used only to advance America’s national interests. They focus on peace deals, trade agreements and matters of war and peace.\n\nThe memorandums of these conversations — like the one released to Congress last week — are generated by national security professionals in the Situation Room, including career employees of the intelligence agencies, the State Department and the military. These people produce rough transcripts, which are then reviewed for accuracy by relevant experts on the NSC staff who were listening to the call and finally by people in what is known as “the Suite” — the small West Wing offices that house the NSC chief of staff, the deputy national security adviser and the national security adviser.\n\nOnce such memos are produced, very few members of the NSC staff are privy to them — usually only those working directly on issues discussed on the call. Members of the Cabinet, especially the secretary of state, may receive copies. The memos can be classified at various levels, with the classification level varying paragraph by paragraph.\n\nMost of these memos are classified as “secret,” by default. To reach “top secret” classification, they’d have to involve information the unauthorized disclosure of which would cause the United States “exceptionally grave” national security harm. “Code word” status is reserved for the absolutely most sensitive subset of information within the top-secret category. These classifications are made purely to protect national security, never for political reasons.\n\nMaterial up to “top secret” is stored on a highly secure classified computer system used by NSC staff — not the code word server. I have classified many such documents myself. Based on my experience, the standard system is where the Ukraine memo should have ended up.\n\nNothing in Trump’s call with Zelensky rises even to the level of “top secret.” The two leaders exchanged compliments, and Trump stressed how important an ally the United States is to Ukraine. He dismissed the efforts of the European Union to help the country, lamented the firing of a Ukrainian prosecutor and criticized a former U.S. ambassador to Ukraine.\n\nWhat stands out in the call, of course, is what caught the attention of the whistleblower and his sources — namely the request that Zelensky work with Attorney General William P. Barr and Rudolph W. Giuliani, Trump’s personal lawyer, to find negative information about former vice president Joe Biden and his son Hunter Biden. That is politically embarrassing, and potentially illegal and impeachable, but has nothing to do with state secrets.\n\nIf the president had only been asking Zelensky to root out corruption, as a general matter, as he has claimed, that would be standard fare for a presidential phone call, meriting a “secret” designation.\n\nThe apparent abuse of the classification system offers reason enough for congressional review of the Ukraine conversation and the events surrounding it. The questions at hand are straightforward: What national security reason was offered for moving the record of the July 25 conversation (and possibly others) to the code word system? Which NSC lawyers made that decision? Was the national security adviser involved?\n\nOne reason to pin down the decision-makers is to reestablish the public’s faith in the civil servants who work on intelligence matters. The NSC staff is made up mostly of patriotic and nonpolitical public servants who labor 18-hour days without glory or any interest in public attention. They walk through the gates of the White House every morning with one goal in mind: the protection of American national security. They deserve answers about what happened in this case. Most importantly, the American people deserve to have confidence in the integrity of a national security process that is designed to serve them.", "description": "Moving a call to the \"code word\" server can be justified only by national security concerns.", "authors": ["Kelly Magsamen", "Kelly Magsamen Is A Former National Security Council Staff Member", "As Well As A Former Senior Pentagon Official. She Is Currently The Vice President For National Security", "International Policy At The Center For American Progress.", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/TARd3NL-8ZfU1U-XR5TVonfXzBI=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PPI35XXBNMI6TPT7JTEFAF6DN4.jpg", "published_at": "2019-09-29"}