{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/25/high-school-soccer-team-equal-pay-burlington", "downloaded_at": "2019-10-25 16:15:53.318596+00:00", "title": "‘It’s blown us away’: how high school soccer team’s equal pay push caught fire", "language": "en", "text": "When the chant of “equal pay” rang around the Stade de Lyon the impact of the campaign being waged by the USA women’s national team was on display to the world on the biggest of stages.\n\nFew, though, could have predicted the butterfly effect in Burlington, a city in Vermont that would need its population to grow by approximately 16,000 to match the number that packed into the stadium to watch USA beat the Netherlands in the World Cup final.\n\nThe US team’s dispute over pay is a fight for women all over the world | Suzanne Wrack Read more\n\nBut when Burlington high school’s Helen Worden, part of that crowd in France, scored with three minutes left against South Burlington on 18 October there were wild celebrations. Out of the window went a plan to lift their jerseys to reveal the #EqualPay slogan emblazoned on shirts they had been selling and were wearing underneath. Four whipped off their match shirts and were booked.\n\nThe effect was electric. “It was spontaneous,” says the 16-year-old Ruby Wool. “We had scored with three minutes left, we were so excited, our crowd was excited. The ref carded us, we kind of knew that was going to come with the excessive celebration, but we hoped that our intent was appropriate.”\n\nThe team have received top-down support from the school district and the high school, to match the huge wave of support from below.\n\n“When we got our yellow cards all the crowd started chanting ‘equal pay’,” Wool says. “It was the same feeling [as they felt watching the World Cup]. I mean, on a smaller scale but it had the same kind of emotion and feeling behind it.”\n\n“We are just inspired by the way they use their platform,” adds her 14-year-old teammate Lydia Sheeser. “They are obviously super well-known across the world and they take their fame and success and they put it towards helping every girl. The wage gap does not just affect girls in sports it affects every woman who has a job who’s not getting paid what she deserves.”\n\nFacebook Twitter Pinterest Burlington train wearing #EqualPay shirts. Photograph: Change the Story VT\n\nWool, asked why high school students care about the gender pay gap, says: “We have big role models in Megan Rapinoe and the USWNT. They are our future; we hope to be them one day. Our futuristic thinking motivated us. We’re living in the now but want to make change for our future.”\n\nMore than 700 shirts were sold before the game and they have continued to produce and sell them. A voluntary 16% mark-up on the price has been added for men to represent the gender pay gap in Vermont.\n\n“The reaction has been incredible,” says Sheeser. “Far beyond what we could have expected but we had a lot of support from our community. They’ve rallied behind us, local college students have been coming to our games. Senator Patrick Leahy and his wife Marcelle bought jerseys. And recently, something that shocked us was that we had Brandi Chastain and Mia Hamm tweet about us and then Billie Jean King did. It’s blown us away.”\n\nThe Fiver: sign up and get our daily football email.\n\nHaving raised more money than expected they are discussing what to do with it. “The money is going to partially go to providing scholarships to give young girls access to soccer and we don’t just want to donate money, we want to donate our time too,” Sheeser says. “We want to have mentorship programmes with them.\n\n“Secret deodorant just told us that they are donating $15,000, which is the cost of 500 jerseys with an added 20% representing the national wage gap, which was amazing. With these new funds coming in we need to figure stuff out but it will be completely pointed towards helping girls access a) sports and b) trying to close the wage gap.”\n\nFacebook Twitter Pinterest The yellow card that is part of the Burlington campaign. Photograph: Change the Story VT\n\nFor Jessica Nordhaus, a parent and part of Change the Story, an initiative tasked with enhancing women’s economic security in the state and which has been supporting the players, the girls’ action has had a huge impact. “They’ve already sparked conversations not just about the wage gap but how gender impacts people across all fields,” she says. “In high schools across the country the news shots are being shown in civics classes – it’s really just so impressive.\n\n“One of the owners of a big tech firm here in Burlington got in a conversation about his hiring practices and whether women negotiated at the same rate men do, so we’re thrilled that these conversations are happening.”\n\nCould they have imagined it would take off this way? “Not at all,” says Wool. “I mean it was a little idea we came up with at the end of practice and to think that this idea has led to this much attention, not only nationwide but internationally? We’re just beyond excited. The team we played yesterday had #EqualPay, painted on their legs.”\n\nThey have the small matter of a play-off quarter-final on Saturday, but their campaigning is not stopping. Looking to broaden the conversation and capitalise on the momentum, they are distributing yellow cards with shirts and have set up in the school cafeteria to encourage people to write down what cause “they would take a yellow card for” and asking them to photograph themselves and use the hashtag #excessivecelebration.", "description": "Burlington players took off their jerseys to reveal #EqualPay shirts and set in motion an extraordinary sequence of events", "authors": ["Suzanne Wrack"], "top_image": "https://i.guim.co.uk/img/media/f285d48467112db37c99a78438dd053e81552e46/0_318_2879_1728/master/2879.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4b5d78a8d54e98f5df36c35a66a32a0b", "published_at": "2019-10-25"}