{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7530881/Man-sues-Oregon-clinic-donated-sperm-used-17-kids.html", "downloaded_at": "2019-10-05 08:27:06.098011+00:00", "title": "Man sues Oregon fertility clinic after learning his donated sperm was used to father 17 children", "language": "en", "text": "Dr Bryce Cleary (pictured) filed a $5.25million lawsuit against Oregon Health & Science University after he discovered that sperm he donated to a hospital fertility clinic at the school 30 years ago was used to father at least 17 children\n\nAn Oregon doctor is suing a fertility clinic after he discovered that the sperm he donated 30 years ago when he was a medical student was used to father at least 17 children.\n\nDr Bryce Cleary filed a $5.25million lawsuit against Oregon Health & Science University on Wednesday alleging that the clinic violated terms of the agreement he signed when he donated the sperm.\n\nCleary was a first-year medical student at OHSU in 1989 when he was approached by staff at the fertility clinic about donating, according to the lawsuit.\n\nHe claims he agreed to be a donor under the conditions that his sperm would be used to conceive no more than five children, that they would be born to mothers outside Oregon, and that he would remain anonymous forever.\n\nNearly three decades later in March 2018, Cleary was contacted by two women who said they'd identified him as their father using Ancestry.com and 'specific and substantive information' given to them by the fertility clinic, the lawsuit alleges.\n\nCleary then sent his own DNA to Ancestry.com, and the results revealed that he had at least 17 biological children through his sperm donations.\n\nThe suit claims Cleary he has been left 'profoundly distressed' by the 'moral, ethical and personal obligations' he now feels toward those 17 children. He also believes there may be additional children fathered by his donations.\n\nScroll down for video\n\nCleary spoke about the lawsuit at a news conference on Wednesday in Portland. He alleges that the OHSU fertility clinic violated the terms of the agreement he signed when he donated his sperm in 1989, causing him 'extreme mental and emotional pain, anguish and suffering'\n\nA spokeswoman for Oregon Health & Science University (pictured) declined to comment on the lawsuit but said the school treats any allegation of misconduct with 'the gravity it deserves'\n\nThe lawsuit says most, if not all, of Cleary's offspring were born in Oregon, violating the conditions of his sperm donation agreement.\n\nThe condition to have the children born to women outside the Pacific Northwest was meant to lessen the probability that his various offspring would meet or become romantically involved.\n\nCleary, now 53 and living in Corvallis, raised three sons and an adopted daughter with his wife in the years after he donated.\n\nHe claims that the children he raised have crossed paths with the children conceived through OHSU, as at least two of them attended the same schools, churches or social activities as his family.\n\nCleary also fears that he may have unknowingly treated or examined one or more of his offspring while working as a primary care doctor in Corvallis.\n\nOne of the children born via Cleary's sperm donation, 25-year-old Allysen Allen (right), met her father for the first time at Wednesday's news conference\n\nSo far Cleary has met three of the children fathered through the fertility clinic.\n\nHe met one of them, 25-year-old Allysen Allee, for the first time at a news conference about the lawsuit on Wednesday.\n\n'The idea that you can produce that many children from one donor and throw them all in the same region?' an emotional Cleary said at the conference, according to OregonLive.\n\n'There has got to be some reforms. I can't control an industry, but I can sure stand up and say: \"This isn't cool\".'\n\nAllee, who lives in Vancouver, also expressed her anxiety.\n\n'I'm expecting my third child right now, and the idea of my children having dozens and dozens of cousins that will be their ages and in the area is concerning,' she said.\n\n'It feels like OHSU really didn't take into consideration the fact that they were creating humans. They were reckless with this, and it feels like it was just money and numbers to them.'\n\nAllee doesn't plan to sue the clinic but hopes that by speaking out she can help prevent similar cases from happening to other families.\n\nClearly's lawsuit, filed in Multnomah County Circuit Court, claims the father has 'incurred extreme mental and emotional pain, anguish and suffering, which have all had a significant and negative impact on his personal, parental and marital relationships'.\n\nHis attorney, Christopher Best, told OregonLive that fertility clinics are lightly regulated, and most of the government rules they have to follow involve maintaining privacy between donors and recipients and severing any legal obligations owed by donors.\n\nOHSU spokeswoman Tamara Hargens-Bradley told OregonLive it treats any allegation of misconduct with 'the gravity it deserves'.\n\n'In light of our patient privacy obligations and the confidentiality of protected health information, we cannot comment on this case,' Hargens-Bradley said.\n\nLawsuits like Cleary's have become increasingly common as the rise of mail-in DNA test kits sheds light on fertility clinic practices.", "description": "Bryce Cleary, 53, donated his sperm to a fertility clinic at Oregon Health & Science University in 1989. Three decades later he learned that it was used to father 17 children against his wishes.", "authors": ["Megan Sheets For Dailymail.Com", "Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/16/19257130-0-image-a-2_1570118250147.jpg", "published_at": "2019-10-02"}