{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/tripadvisor-fake-hotel-reviews-which-investigation-travelodge-five-star-a9094396.html", "downloaded_at": "2019-09-06 12:18:58.833125+00:00", "title": "Fake TripAdvisor reviews push hotels to the top, finds Which?", "language": "en", "text": "Some high-ranking hotels on TripAdvisor have reached the top through fake reviews, a Which? Travel investigation has claimed.\n\nThe consumer watchdog analysed close to 250,000 hotel reviews, with a particular focus on five-star reviews.\n\nAmong other factors, Which? looked at how many five-star reviews were left by first-timers who had never written another review.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSome of the most suspicious culprits included top-rated hotels in Las Vegas, where two in the destination’s top 10 list had received almost half of their five-star reviews from first timers; and two properties in the UK’s second biggest hotel chain, Travelodge.\n\nOut of hundreds of five-star ratings for the Travelodge hotels, more than 40 per cent of reviews for the two properties originated from accounts who had never left another review.\n\nShape Created with Sketch. 10 of the best hotels in Las Vegas Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. 10 of the best hotels in Las Vegas 1/10 The Cromwell The glitzy bathroom at The Cromwell The Cromwell 2/10 Park MGM Sophisticated tastes are well-catered for at Park MGM Park MGM 3/10 SLS SLS by night SLS 4/10 Vdara A deluxe suite at Vdara Vdara 5/10 Red Rock The opulent lobby at Red Rock Red Rock 6/10 Paris Go big or go home at Paris Paris 7/10 NoMad The brooding bar and restaurant area at NoMad NoMad 8/10 Nobu Hotel at Caesars Palace The penthouse at the Nobu Hotel Nobu Hotel at Caesars Palace 9/10 Flamingo Embrace kitsch at Flamingo Flamingo 10/10 Bellagio The luxurious bathroom at Bellagio Bellagio 1/10 The Cromwell The glitzy bathroom at The Cromwell The Cromwell 2/10 Park MGM Sophisticated tastes are well-catered for at Park MGM Park MGM 3/10 SLS SLS by night SLS 4/10 Vdara A deluxe suite at Vdara Vdara 5/10 Red Rock The opulent lobby at Red Rock Red Rock 6/10 Paris Go big or go home at Paris Paris 7/10 NoMad The brooding bar and restaurant area at NoMad NoMad 8/10 Nobu Hotel at Caesars Palace The penthouse at the Nobu Hotel Nobu Hotel at Caesars Palace 9/10 Flamingo Embrace kitsch at Flamingo Flamingo 10/10 Bellagio The luxurious bathroom at Bellagio Bellagio\n\nOut of 15 hotels Which? raised concerns about to TripAdvisor, the reviews site admitted 14 of them had been found to have fake reviews in the last year.\n\nThe Travelodge Wembley was highlighted as having previous form: according to TripAdvisor, this particular branch had previously been issued with a red penalty badge, the company’s harshest reprimand.\n\nIt warns visitors to the site that the hotel is being investigated for manipulating reviews and means the business “repeatedly fails to remedy its behaviour and refuses to cooperate with TripAdvisor’s investigators”.\n\nA Travelodge Wembley spokesperson told Which? Travel: “We experienced a breakdown in our internal communication when TripAdvisor identified an irregular pattern of reviews at our Wembley Central Travelodge Hotel.”\n\n“Unfortunately on this occasion that matter was not managed effectively within the timeframe, and we have taken appropriate action to ensure this does not happen again.”\n\nThey added: “We are satisfied that the reviews accurately reflect the customer experience at the hotel.”\n\nTripAdvisor said of the accusation that it is not doing enough to clamp down on false reviews: “The analysis presented by Which? is based on a flawed understanding of fake review patterns and is reliant on too many assumptions, and too little data.\n\n“We have an industry-leading team of fraud investigators who work tirelessly to protect the site from fake reviews. We are confident our approach works, and is one of the reasons we continue to retain the trust of many millions of consumers worldwide.”\n\nIt follows a landmark legal ruling in Italy in 2018, which saw a fraudulent online reviewer sentenced to jail, in one of the first cases of its kind.\n\nThe owner of PromoSalento, a company that sells fake review packages to hospitality businesses in Italy, was sentenced to nine months in prison after the Criminal Court of Lecce ruled that writing fraudulent reviews under a false identity was “criminal conduct”.\n\nThe defendant was also ordered to pay €8,000 in costs and damages.\n\nTripAdvisor supported the prosecution as a civil claimant, providing evidence from its in-house fraud investigations team.", "description": "Some high-ranking hotels on TripAdvisor have reached the top through fake reviews, a Which? Travel investigation has claimed. The consumer watchdog analysed close to 250,000 hotel reviews, with a particular focus on five-star reviews. Among other factors, Which? looked at how many five-star reviews were left by first-timers who had never written another review.", "authors": ["Helen Coffey"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/11/09/11/tripadvisor.jpg", "published_at": "2019-09-06"}