{"pub": "breitbart", "url": "https://breitbart.com/news/former-boston-college-student-charged-in-boyfriends-suicide", "downloaded_at": "2019-10-29 06:13:23.300529+00:00", "title": "Former Boston College student charged in boyfriend’s suicide", "language": "en", "text": "Oct. 28 (UPI) — Suffolk County District Attorney Rachael Rollins announced involuntary manslaughter charges against a South Korean national on Monday in connection to the suicide death of her boyfriend, who died an hour and a half before he was to graduate from Boston College.\n\nProsecutors allege that Inyoung You, 21, was present at the Roxbury parking garage in Boston on May 20 when Alexander Urtula, 22, leaped to his death on the morning of his graduation, for which his parents had come into town from New Jersey to watch.\n\nRollins said an investigation following his death revealed that Urtula was the victim of domestic abuse, and You attacked Urtula physically and emotionally, sending him some 47,000 text messages, thousands urging him to die by suicide, during their 18-month long relationship.\n\n“Many of the messages clearly display the power dynamic in the relationship wherein Mrs. You made demands and threats with the understanding that she had complete and total control over Mr. Urtula, both mentally and emotionally,” Rollins said during a press conference.\n\nYou controlled Urtula through threats of self-harm and she was cognisant of his “spiraling depression and suicidal thoughts” that were the product of her abuse, Rollins said.\n\nShe even tracked his location through his cellphone, Rollings said, and had followed him to the parking garage and was present for his death.\n\n“The indictment alleges Mrs. You’s behavior was wanton and reckless and overwhelming Mr. Urtula’s will to live and that she created life-threatening conditions for him that she had a legal duty to alleviate, which we alleged she failed to do,” Rollins said.\n\nRollins said there are few similarities between this case and that of Michelle Carter, who was convicted to a 15-month prison sentence in 2017 in connection to the suicide death of her boyfriend, Conrad Roy III.\n\nRoy died by suicide at the urging of Carter but there was limited physical contact, Rollins said.\n\n“We have, quite frankly I would say, the opposite of that. We have a barrage, a complete and utter attack on this man’s very will and conscience and psyche by an individual to the tune of 47,000 messages,” she said.\n\nBoston College said on the day of Urtula’s death that he was a biology major and was working as a researcher in a New York hospital with plans to attend his graduation that day.\n\n“Alexander was a gifted student who was involved in many activities while at BC, including the Philippine Society of Boston College,” said interim vice president of Student Affairs, Joy Moore, in a letter to the school’s community.\n\nRollins said You, a former student at the school, is currently in South Korea, and they have been in contact with those representing her and are hoping she will return to the states voluntarily, but if she does not, they will utilize the powers they have to get her back on U.S. soil to face the charges.\n\n“We are fully fluent in the ways to get her back if she doesn’t want to do it voluntarily,” Rollins said.", "description": "Oct. 28 (UPI) — Suffolk County District Attorney Rachael Rollins announced involuntary manslaughter charges against a South Korean national on", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-28"}