{"pub": "independent", "url": "https://independent.co.uk/independentpremium/boris-johnson-luxembourg-speech-eu-no-deal-brexit-a9107761.html", "downloaded_at": "2019-09-16 23:19:07.986228+00:00", "title": "It is not Luxembourg’s duty to shield Boris Johnson from the public revulsion he has earned", "language": "en", "text": "Inevitably, it took a matter of seconds for the two tales of Boris Johnson’s no-show press conference in Luxembourg to take hold.\n\nOn the one hand, the day after calling himself The Incredible Hulk, and in the midst of ongoing efforts to brand Jeremy Corbyn a chicken, the prime minister was too scared of the noise of about 200 anti-Brexit protesters to turn up to his own press conference.\n\nThe Incredible Hulk has, arguably, been overworked as a character, yet there remains no episode in the franchise in which he encounters a small group of shouty people, and decides to run away.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nOn the other, here was Luxembourg’s prime minister trying to humiliate the British prime minister, by staging a press conference just yards from an angry mob.\n\nWe are told the prime minister’s staff repeatedly asked for the press conference to be moved indoors, away from the shouting, and that the Luxembourg side repeatedly refused.\n\nWhichever side you choose will depend on your view on Brexit. Neither side will yield to the other. The impossible Brexit culture war rolls endlessly on.\n\nBut there are nevertheless some facts that neither side is able to contest. The UK now has a prime minister who asks to be hidden from the Luxembourg public. A prime minister that still likes to claim that Brexit does not represent a retreat from the global stage – quite the opposite in fact – but who is, nevertheless, a hate figure all over Europe.\n\nThree years ago, that a British prime minister would be unable to hold a public press conference in Luxembourg for fear of public reaction would not be merely unthinkable but actually laughable.\n\nThat there would have to be diplomatic back-channelling going on to spare the prime minister’s blushes after a lunch in Luxembourg is a reality that has only very recently become imaginable.\n\nLast summer, the UK government went to great lengths to stage a visit from Donald Trump, without the president having to go anywhere near where a protester might be. Theresa May held a press conference in the garden at Chequers, the first time such a thing has happened.\n\nBritain did its bit for a friend and ally. But when Theresa May did so, she was rightly criticised for stymieing the British public’s right to protest, for providing a hermetically sealed environment for an internationally loathed public figure who perhaps did not deserve it.\n\nNow the UK is another such nation, led by another such figure. Boris Johnson expects countries he visits to go to great lengths to shield him from the revulsion of the international community which he has done everything to earn.\n\nIf other countries don’t feel compelled to censor their own people, to shut down their own streets, that is their choice. They are not responsible for Boris Johnson’s actions. It is not their responsibility to hide him from his own hatred.", "description": "Inevitably, it took a matter of seconds for the two tales of Boris Johnson’s no-show press conference in Luxembourg to take hold. On the one hand, the day after calling himself The Incredible Hulk, and in the midst of ongoing efforts to brand Jeremy Corbyn a chicken, the prime minister was too scared of the noise of about 200 anti-Brexit protesters to turn up to his own press", "authors": [], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/16/15/luxembourg-prime-minister-no-boris-press-conference-1.jpg", "published_at": "2019-09-16"}