{"pub": "yahoo", "url": "https://yahoo.com/entertainment/julianne-hough-mourns-deaths-her-184506335.html", "downloaded_at": "2019-10-13 03:53:44.214553+00:00", "title": "Julianne Hough Mourns the Deaths of Her Two 'Babies' Lexi and Harley: 'I Am Forever Grateful'", "language": "en", "text": "Julianne Hough is sharing her love for her two dogs Lexi and Harley died in late September.\n\nThe America’s Got Talent judge, 31, announced the tragic news on Instagram Saturday, thanking her “babies, [her] daughters” for providing her with so much love over the years.\n\nThe two Cavalier King Charles spaniels both died on Sept. 28.\n\n“Pure love is real, it existed through us. My heart expanded and felt the truth of what is possible. I am forever grateful,” Hough captioned a series of photos and videos of her beloved pets.\n\n“Thank you for your love. Thank you for being my babies, my daughters. Thank you for choosing me. Thank you for teaching me how to be your mother. Thank you for allowing me to give and receive love,” she said. “Thank you for your kisses. Thank you for your blessings every single minute of every single day. Thank you for your souls. Thank you for protecting me. Thank you for letting me protect you. Thank you for protecting each other.”\n\nJulianne Hough/Instagram More\n\nRELATED: Julianne Hough’s ‘Babies’ Make Her Laugh Every Day\n\nHough continued, “Thank you for the timeless memories. Thank you for your magic. Thank you for being the most consistent and constant beings in my life. Thank you for being you. Thank you for being my guardians on this earth and even more so now.”\n\nJulianne Hough/Instagram More\n\n“I’ve never experienced a love like ours. I miss you. I love you forever. Now You Are Free,” she ended the post, closing with the dog’s birth and death dates.\n\nRELATED: Then & Now: Julianne Hough Undergoes Two Surgeries for Endometriosis — with Pup Lexi by Her Side\n\nThis isn’t the first time the singer and dancer has shared dedications to her dogs on social media.\n\nIn 2018, Hough recounted two times when her dog Lexi wouldn’t leave her side following laparoscopy to treat her endometriosis.\n\nIn the first image, from 2008, “my angel baby LEXI was only a few months old,” Hough wrote.\n\nBrooks Laich/Instagram More", "description": "Julianne Hough Mourns the Loss of Her Two 'Babies' Lexi and Harley", "authors": ["Georgia Slater"], "top_image": "https://s.yimg.com/uu/api/res/1.2/2Rh.U_9L6kcNCjkEtaDwMg--~B/aD02MzA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/people_218/e3af39b5a16efff9f64c9aae8e61fb39", "published_at": "2019-10-12"}