{"pub": "independent", "url": "https://independent.co.uk/life-style/fashion/autumn-fashion-trends-october-new-buy-boots-knitwear-a9138406.html", "downloaded_at": "2019-10-03 23:34:05.150869+00:00", "published_at": "2019-10-03", "title": "Autumn fashion 2019: Best new pieces to buy on high street this October", "language": "en", "text": "Our fashion roundups are unbiased. On some occasions, we earn revenue if you click the links and buy the products, but we never allow this to affect our coverage.\n\nAfter a seemingly endless summer, the new fashion season has finally arrived.\n\nFrom pumpkin spiced lattes to kicking up crisp leaves and cosy nights in, there is much to embrace about the autumn months.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBut, the thing us fashion fans love more than anything about the onset of cooler climes is the prospect of a new season aesthetic.\n\nThis month, the high street has seen a significant shift, mourning the end of Hot Girl Summer by replacing thigh-baring mini dress with floaty gowns, morphing short-shorts into corduroy trousers and dulling the glare of hibiscus prints with gothic florals.\n\nTie-dye T-shirts and slingback sandals might have dominated our wardrobes over the last few months but, if the autumn/winter 2019 (AW19) catwalks are anything to go by, the latter part of the year is going to be all about drama.\n\nInspired by the AW19 designs of Alexander McQueen, consider items other than the trusty biker in plush faux leather and embrace the return of plaid with cool-girl twists on the shacket (a shirt/jacket hybrid) a la Burberry and Ashley Wiliams.\n\nMidi dresses in moody hues like those presented on the runway at Erdem will also prove a wise investment this season. Simply pair with patent pointed boots now and, when the temperatures really start to drop, layer with a jumper, oversized coat, patterned tights and chunky Doc Martens.\n\nTo help make getting dressed in the coming weeks that much easier, we’ve scoured our favourite stores to find the best new pieces to kickstart your autumn wardrobe.\n\nClick through the gallery above to see The Independent’s high street picks for October.", "description": "Our fashion roundups are unbiased. On some occasions, we earn revenue if you click the links and buy the products, but we never allow this to affect our coverage. After a seemingly endless summer, the new fashion season has finally arrived.", "authors": ["Sarah Young"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/03/15/autumn-fashion.jpg"}