{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/home/time-management-tips-from-masters-of-the-to-do-list/2019/09/24/154dc424-d977-11e9-bfb1-849887369476_story.html", "downloaded_at": "2019-09-26 15:06:17.714472+00:00", "title": "Time-management tips from masters of the to-do list", "language": "en", "text": "Most of us know the satisfaction of a crossed-off to-do list item (and the nagging weight of a task unchecked). Whether they’re in a homework planner at school or on a sticky note on a desk at work, to-do lists are an easy way to lay out what has to be done. But how do you avoid the chaos of dozens of little pieces of paper or a digital document that requires endless scrolling? We spoke with experts to find out how to make to-do lists that will help you efficiently accomplish tasks so you have time for activities you really want to do.\n\n[A journey through the fancy planners that promise to fix our broken, millennial lives]\n\nStick to a simple method\n\nThe purpose of creating lists and organizing systems shouldn’t be to create extra work, said Julie Morgenstern, a New York productivity consultant and author of “Organizing from the Inside Out.”\n\nA color-coordinated list with stickers and extras could work well for one person but might be distracting to someone else. Someone may find comfort in an Excel spreadsheet, but it may cause stress to others. The method doesn’t matter as much as its usefulness. “You want to use a list as an asset, not as a way to delay doing what’s on the list,” said Stephanie Shalofsky, founder of the Organizing Zone in New York.\n\nIn terms of where you do the organizing, Morgenstern said it’s totally up to you. Test out different approaches, but stick with something you’ll use consistently. For people who are more tactile and visual, she said, a paper planner or notepad is a good place to start. She likes the Inkwell Press planner with daily inserts because “it’s graceful and accommodates strategic planning.” Starter bundles begin at $52. The Organized Chaos Medium Spiral Planner ($14.99, Orange Circle Studio) is Morgenstern’s pick for people looking to build new habits (it includes tools to chart goal progress and water intake).\n\nDigital methods might make more sense for people who need remote access to their lists, who are planning for others who need access or who are agile with computers, Morgenstern said. Any digital system needs to integrate with your calendar, she added. She likes the Remember the Milk app, which asks users how long each task will take.\n\nRashelle Isip, a professional organizer and founder of the Order Expert, keeps a paper pad for personal tasks and keeps work tasks on a digital list to create separation.\n\nBut Shalofsky, who honed her organizing skills working in the entertainment industry, is a proponent of using one medium so nothing gets misplaced or forgotten. “There are so many ways that tasks can overwhelm us, but once you have it all in one place, it becomes the best starting point for getting them done,” she said. If you’re using Evernote (a sort of digital filing cabinet) or compiling everything into a Google document, she said to routinely take 10 minutes to transfer any paper notes to the platform so you’re not looking in several places. Shalofsky uses Outlook’s task feature to create immediate and longer-term tasks that are stored in a master folder she can add to and reference later.\n\nAlong with Evernote, she said Todoist and Wunderlist are popular digital choices.\n\nCategorize and prioritize\n\nIf you’re just starting to get serious about your organization game, Ellen Faye, a strategic planning and productivity coach, recommends beginning with a simple methodology that you can easily add to as you get busier. Don’t bother putting down tasks that are automated, such as brushing your teeth. “Some people say to write everything down, but not everything needs to go on the list,” Faye said. You can start by writing everything down, she said, and then winnow. In her practice and in her personal life, she separates what she wants to accomplish into four categories based on the task’s urgency and value:\n\n1. Critical: Whatever needs to be done right away — for example, if rent is due today.\n\n2. Hot: Tasks that have to be done in the next two or three days.\n\n3. Sooner: Everything else needs to be done soon but can wait until after the previous two categories are done.\n\n4. Later: Something you need to finish that doesn’t fit into the above categories.\n\nFaye uses a notepad that she divides into four quadrants, one each for “personal,” “work,” “self care” and “personal growth,” and prioritizes tasks using the above categories. If an item remains on your list for a while without being completed, she says, take some time to reflect on why and decide whether it’s something you can get away with not doing.\n\nWhen you’re laying out your tasks, think realistically about how long each one will take and assign a time to it. (For example: Filling out a job application could take five minutes, but it’ll take considerably longer if you have yet to write a cover letter you have to attach.) “The biggest mistake people make is not asking how long things take,” Morgenstern said. “If you start asking how long and get good at answering that question, then you’re in a position to evaluate if that thing is worth your time.” This isn’t to say that time-consuming tasks aren’t worth completing — in some cases, they might be mandatory — but you’re more likely to get them done if you know what you’re dealing with. Breaking the list into smaller steps gives you a clearer picture of what needs to be done.\n\nTasks vs. goals\n\nIt’s fine to put “learn cello” on a list, but without an action, that directive isn’t helpful, said Liz Sumner, an American life coach in Italy. Instead of jamming numerous vague goals into your day-to-day, Sumner recommends creating some time in your schedule to think about what you want in the longer term, whether that’s a week, a month or a year. Breaking down larger goals into manageable pieces can be done by assigning small tasks. To make “learn cello” into something actionable, start with something such as “research cello rentals” or “order cello music book.” Framing tasks in this way helps you allocate time and energy and can also be helpful when evaluating what is worth your time.\n\nIt's the system — not you\n\nThe measure of whether an organizing system works is whether you’re accomplishing the tasks you need to do and finding time to do activities that make you happy. The goal, Sumner said, is to achieve a balance across the different areas of your life.\n\nA key reminder Sumner gives her clients is to try to approach tasks with enthusiasm and patience and to remember that not every method works for everyone. Instead of focusing on what you didn’t do, try to celebrate the tasks you did complete — and think about how those will help in the short and long term.\n\nDrumming up enthusiasm to accomplish even mundane tasks is half the battle, she said. Tying consequences and rewards to tasks helps them get done. “Think about the reasoning behind it and ask ‘how can I find the “I want to” in that task,’ ” she said. For example, Sumner recently obtained an Italian driver’s license after several less-than-fun visits to the Italian equivalent of the DMV. Her motivation was being able to drive in her new home country, and she used that to propel her through steps such as making time to study for the test (which was given in Italian) and booking appointments.\n\nIf items are left undone, and your list is falling by the wayside, set aside time to check in with yourself to evaluate what’s not working. Is it too complex, or is it so simple that you’re forgetting basic tasks? Perhaps you don’t like the system or the medium you’re using. A refresh could get you back on track.\n\nDifferent methods work for different periods of life, too, Isip said. “A to-do list is a snapshot of a moment in time,” Isip said. “It’s important for people to understand that over time, lists will change and the types of items might not be the same.” Use your list as a guide, don’t feel beholden to it, and leave room for fun and relaxation.\n\n“Don’t try to fill every micro-moment with something to do,” she said.", "description": "How to turn goals into actions and chores into accomplishments.", "authors": ["Helen Carefoot", "September At Am", "Helen Carefoot Is A Writer", "Editorial Aide For The Washington Post'S Features Section. Prior To Joining The Post In", "Helen Worked For Washingtonian", "Chalkbeat Tennessee"], "top_image": "https://www.washingtonpost.com/resizer/riVw0enNYV01Mwii4xYMa9fp1c0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/L52FNWW3YAI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-24"}