{"pub": "yahoo", "url": "https://sports.yahoo.com/report-miami-wait-see-approach-190026777.html", "downloaded_at": "2019-09-24 01:07:40.373384+00:00", "title": "Report: Miami to take wait-and-see approach to season before talking Chris Paul trade", "language": "en", "text": "Chris Paul reportedly wants to join the Miami Heat, teaming up with Jimmy Butler.\n\nMiami likes Chris Paul the player but is less fond of giving up good picks to get him, and really doesn’t want to take on the full three-years, $124 million left on CP3’s contract.\n\nScroll to continue with content Ad\n\nIt looks like Paul will enter the season as the veteran leader and mentor of a young Oklahoma City team, while Miami is going to take a wait-and-see approach, reports Shams Charania of The Athletic.\n\nThe Heat have a level of interest in Oklahoma City’s Chris Paul entering the NBA season, league sources said…. Miami will likely elect to see how it starts the season before gauging a new pursuit of Paul, which would take several large contracts to match salary.\n\nMiami has a few large contracts they might be open to moving — Goran Dragic, James Johnson among them — but just a salary swap alone will not interest OKC. The Thunder will want picks or young players that can fit with their rebuilding timeline, which gets back to one of the things that hung up a trade before.\n\nPaul was traded to Oklahoma City in the Russell Westbrook swap. It was expected that OKC would turn and flip him in another trade, but one that worked never materialized.\n\nExpect Paul trade rumors to ramp up as we get closer to Christmas and pushing toward the February trade deadline. But for now, it’s going to be status quo for both Paul and the Heat.", "description": "Expect Paul trade rumors to ramp up as we get closer to Christmas and pushing toward the February trade deadline.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/L2BJjgbfMLqynSeLOsFpgA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/Jd8Of2YJ_9T7MQvme1d1Vw--~B/aD01NzY7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/nbcsports.com/be455b97d3080b6080ece018c1a37c7a", "published_at": "2019-09-23"}