{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/25/killer-snakes-boring-walks-and-itchy-fingers-the-perils-of-cutting-screen-time-to-an-hour-a-day", "downloaded_at": "2019-10-24 23:54:42.261543+00:00", "title": "Killer snakes, boring walks and itchy fingers – the perils of cutting screen time to an hour a day | Brigid Delaney", "language": "en", "text": "Recently I ran into an old friend on a morning walk. I inquired about a mutual friend who I hadn’t seen in awhile but I keep in touch with via Twitter. “She sure is on there a lot,” I said (in retrospect kind of bitchily). “I think she might be addicted.”\n\n“That’s funny,” replied my friend. “Because a lot of people say that about you.”\n\nIt’s always shocking when people hand you a mirror. But were a lot of people right?\n\nI checked screen time on my phone. Last week I was averaged 3 hours and 21 minutes per day, which was down 31% from the week before. On Thursday I picked up my phone 122 times. What am I? Some kind of addict?\n\nMy editor sets me a target to be on my phone for no more than an hour a day – which includes not only tweets and Instagram, but phone calls, WhatsApp, maps, podcasts, camera, music, texts and email. Even checking the time counts.\n\nThe fridge, the dead mouse and the perils of YouTube tutorials | Brigid Delaney Read more\n\nDay 1\n\nI begin the challenge at lunchtime and change all my settings to “downtime” between 10am and 6am the following morning – which means for 20 hours a day I have to go through a tedious unlocking process if I want to use my phone.\n\n1pm: I’m in a cafe by myself writing a complicated piece on my (disabled) laptop, when the itch starts. It’s an urge to check my phone. The more stuck I am with this story, the stronger the itch. The urge is a complicated one to unpick. Is it a distraction from the difficult work? Is it the need for connection? Is it dopamine-seeking? Whatever the urge is, it feels almost physical. Like addiction feels.\n\n4pm: Standing at the edge of Bronte rockpool on a beautiful day. Usually I would do an Instagram story, but my camera and the Instagram app are locked. I may have had time to quickly post the photo but I would lose time checking likes. On my way to the beach I’m annoyed that I can’t listen to a podcast and instead have to listen to leaf blowers and circular saws. On the way back home, I get lost taking a shortcut but resist looking at Google maps. Time lost on my phone morphs into time lost being … lost.\n\n11pm: I have 13 minutes left and want to save them for late night WhatsApp with friends in different time zones – which I do almost frantically at 11pm – toggling between three different chats before the timer I have set cuts me off midway through a sentence, like I’ve died or something.\n\nResult: An hour less than usual spent on phone.\n\nDay 2\n\nMy editor texts – she owes me money and can now pay me back. Could I send her my account details? NO! I CANNOT. Too much screen time involved.\n\nA minute later I have a story published and I tweet it and like a couple of other tweets. My editor texts to ask what I am doing on Twitter if I am meant to be restricting myself. More time lost replying to text.\n\n3pm: Walking without music or podcast. Tedious, as stuck with own thoughts. Get lost again. Will not waste precious minutes looking at maps. Instead just decide to walk and greet people. Three times last week people in the street said hello to me, and so great was my shock that I fumbled my response. Now, without my phone, I can greet and be greeted. But everyone I pass is wearing buds, lost in the world of their phones.\n\n5pm: I have used all my minutes for the day. Feel pained as I now have to take a bus without comfort of phone. There is a baby wailing all the way down Oxford Street and a man next to me who is confused and raving. I can’t escape my fellow citizens by blocking them out with earbuds and music – so I fully engage. I make unbroken eye contact with the baby and listen to the man. I am running late and can’t text my friend as I have no minutes left, but that is OK.\n\nResult: 2.5 hours less than usual spent on phone.\n\nEagle hunters, yurts and greasy mutton: how food poisoning in Mongolia brought me closer to nature | Brigid Delaney Read more\n\nDay 3\n\nI plan to sleep for as long as I can so as to have less time in the day to not use my phone.\n\nLess hours awake will mean less temptation.\n\nI wake naturally at 9:45am and let my group chat know. “I am awak” (sic). I see by looking at my phone that some of them have been awak since 4:45am, tending to young children confused by daylight saving.\n\nSomeone in my chat responds to me: “Fuck you.” Sadly I can’t spend much time engaging with his negative comments as it will use up precious phone minutes.\n\nQuick check of Twitter. Who is everyone hating today? I must know!!! Ah, it’s the cartoonist Michael Leunig. I join the pile-on and fire off a tweet. The tweet is short – to minimise time online – “Michael Leunig fell out of a pram.” It barely makes sense but almost immediately, before I have a chance to put my phone down, it’s getting lots of likes.\n\nUgh. Shouldn’t have tweeted. So deeply have I internalised the rhythms and rewards of checking for likes that I become sucked in again, checking and making more jokes about Leunig.\n\nBy lunchtime I have spent 33 minutes on my phone, most of those minutes Leunig-related. Start to loathe self and Leunig. Aware of the meta elements of this due to his cartoon being about people who spend too much time on their phone. Whatever Leunig — you suck.\n\nDecide to put phone in different room. But then just as I am doing so, disaster strikes. It is my neighbour in central Victoria. She texts me. She has just been checking up on my house while I am in Sydney and found “A big brown at the top of the driveway, shed. You want me to leave key inside shed? Snake can go under door inside.”\n\nNo! I have Airbnb guests arriving the following day. I will need to call them and possibly a snake catcher. More minutes lost! I tweet my fears.\n\nMeanwhile my practical neighbour has hand-cut the grass where the snake appeared. She texts: “Snake went to where I had cut. Brave yes. .. I didn’t see him again … gone. They move on. Welcome to rural.”\n\nI reply, saying people on Twitter are scaring me. “They say it can get into linen cupboards!”\n\nShe responds: “That’s yr friends.”\n\nMeanwhile, back on Twitter, my followers (“yr friends”) are increasingly worried for my safety, thinking I’m near the snake.\n\nI am in Tamarama, I tweet back. Nowhere near snake. This snake is taking up even more time than checking Leunig likes. Will need to disengage. But if I do, people on Twitter might assume snake killed me.\n\n4pm: Decide to go for long walk and leave phone at home to avoid using phone again. Already I’m at 59 minutes. Feel sad about leaving my phone at home as it means the steps I will do on my walk won’t count, so essentially it’s like the walk never happened.\n\nAs I’m trying to leave the house, friends are texting me about Michael Leunig: “Maybe he has a point and we use our phones too much?”\n\nUgh Leunig. He makes me want to use my phone. Take phone on walk. Ring parents to discuss snake. Listen to podcast on stoicism. Instagram beach. Upload 6 new stories. Tweet!!! I’m on a binge. I disable my locks! And I tell myself, as all addicts do, tomorrow is a new day.", "description": "I stop looking at my phone and end up making unbroken eye contact with a baby and being stuck with my tedious thoughts", "authors": ["Brigid Delaney"], "top_image": "https://i.guim.co.uk/img/media/e79cd444f563919627ee1cc5a0b9a6e82cffc1ba/0_0_2500_1500/master/2500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=8ee74fc9f24c6c8c90ffcce8e295158b", "published_at": "2019-10-24"}