{"pub": "washingtonpost", "url": "https://washingtonpost.com/entertainment/books/the-cranky-bossy-sad-brave-beloved-olive-kitteridge-is-back-in-olive-again--and-better-than-ever/2019/10/03/ba1df290-e47f-11e9-a331-2df12d56a80b_story.html", "downloaded_at": "2019-10-08 15:07:32.711849+00:00", "title": "'Olive, Again,' by Elizabeth Strout book review", "language": "en", "text": "Strout introduces 13 “chapters” (in effect, linked stories) with a personal note: “Never did I think I would write about Olive Kitteridge again.” Apparently, Olive just elbowed back into Strout’s consciousness — still powerfully herself, continuing to “surprise . . . enrage . . . sadden” and “make [Strout] love her.” Taken together, these stories create a world almost unbearably addictive for its beautiful, agonized truths.\n\nAD\n\n“Olive, Again” commences about two years after the death of Olive’s husband, Henry, and tracks many of its characters to their ends. In “Arrested,” Jack Kennison, a miserable, remorseful semi-lout who’ll become Olive’s next husband, is driving to buy whiskey in Portland, Maine, because he hates small talk in the fictional coastal town of Crosby, where he (and most of the novel’s ensemble cast) resides.\n\nAD\n\nReview: Family matters in ‘Olive Kitteridge’\n\nWasting no time, this opening chapter discharges big questions serially, like a cannon. How had Jack mauled his first marriage so fecklessly, with a flagrant affair that got him fired? Why did he never realize that his late wife had been quietly conducting her own affair? Why can’t he accept that his grown daughter is gay?\n\n“He understood that he was a seventy-four-year-old man who looks back at life and marvels that it unfolded as it did, who feels unbearable regret for all the mistakes made. And then he thought: How does one live an honest life?”\n\nAD\n\nBoom, boom, boom. In a torrent of shocking passages, people perceive their own blindnesses. What frightened Jack “was how much of his life he had lived without knowing who he was or what he was doing,” and how much he’d squandered because of it.\n\nElizabeth Strout’s ‘My Name is Lucy Barton’ review\n\n“Labor” brings Olive forward in all her feisty glory, angrily recalling a “stupid baby shower” in hilarious detail — fussy food, inane chatter — then, suddenly, being forced to help deliver an actual baby (its confused young mother an “idiot child”) in the back seat of Olive’s own car. Things get graphic, fast. But before that, as someone’s cooing over a pair of booties, “Olive suddenly thought how she had not been happy even before Henry had his stroke.”\n\nAD\n\nBafflement swamps her. “Olive did not understand why age had brought with it a kind of hardheartedness toward her husband . . . something she had seemed unable to help . . . as her heart became more constricted, Henry’s heart became needier. . . . What crime had he been committing, except to ask for her love?”\n\n“The End of the Civil War Days” features a couple living in silent enmity on two sides of a strip of yellow duct tape bisecting their house, following the husband’s long-ago affair: “Back then there was no forgiveness and no divorce.” Their petrified state’s about to be cracked open — as a visiting daughter informs them she’s become a dominatrix.\n\nPeople are weak, locked, blinkered. They suffer cruelties, reversals. Yet in strange adaptations, many find ways through or past it. Without room for the swaths of material I long to quote, I can only cite the marrow of “Olive’s” glory: wave upon wave of unflinching insight, delivered in language so clean it shines. Sentences flow in simplest words and clearest order — yet line after line hammers home some of the most complex human rawness you’ll ever read. Early on, Olive is terrified to let herself become close to Jack: Her life “might possibly be very different or might not be different at all, and both ideas were unspeakably awful to her. . . . Please, she thought. But she did not know what she meant by that. Please, she thought again. Please.”\n\nAD\n\nAD\n\nStrout dwells with uncanny immediacy inside the minds and hearts of a dazzling range of ages: the young (with their confusion, wonder, awakening sexuality), the middle-aged (envy, striving, compromise), the old (failing bodies, societal shunning, late revelations). I cannot shake off the electrifying “Helped,” in which a woman whose childhood house (containing her father) has just burned down, returns to Crosby to deal with the ruins.\n\nAlmost broken by trauma, Suzanne turns to Bernie, the gentle family attorney, who tries valiantly to shore her up. Buried in their (astonishing) conversation is a small, hard jewel of a vision that may irradiate Strout’s whole oeuvre. Suzanne finally offers Bernie her best guess about what the human task may ultimately be, in our catastrophic riddle of a world: “To bear the burden of the mystery with as much grace as we can.”\n\nBoom.\n\nAD\n\nAD\n\nI have long and deeply admired all of Strout’s work, but “Olive, Again” transcends and triumphs. The naked pain, dignity, wit and courage these stories consistently embody fill us with a steady, wrought comfort. In Olive’s words: “What a thing!”\n\nJoan Frank’s latest books, “Where You’re All Going: Four Novellas” and “Try to Get Lost: Essays on Travel and Place,” will be published in early 2020.\n\nOlive, Again\n\nBy Elizabeth Strout\n\nRandom House. 304 pp. $27\n\nAD", "description": "Elizabeth Strout creates a world almost unbearably addictive for its beautiful, agonized truths.", "authors": ["Joan Frank"], "top_image": "https://www.washingtonpost.com/resizer/Wm4nIn0CP4U1B8DYF5eDJDxZzN0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EIF4MXHF5UI6TNAD644ITGMC2I.jpg", "published_at": "2019-10-03"}