{"pub": "cnbc", "url": "https://cnbc.com/2019/10/18/biggest-mistake-people-with-low-emotional-intelligence-make-according-to-therapist.html", "downloaded_at": "2019-10-19 10:58:39.544161+00:00", "title": "A therapist shares the biggest mistake people with low emotional intelligence make: 'It always backfires'", "language": "en", "text": "When I ask people what comes to mind when they think about \"emotional intelligence,\" their answers are often centered around themselves. I hear things things like \"knowing my personal competencies,\" \"being self-aware\" or \"managing my emotions.\" It all adds up to the common misconception that emotional intelligence is about examining oneself — my emotions, my feelings, my approach to others.\n\nEQ = self + relationships + environment\n\nThis isn't surprising: Most of the literature out there focuses on how people can build emotional intelligence for their own benefit. The typical advice often follows a similar pattern: do some soul-searching to understand yourself better, practice expressing empathy, then benefit by earning the trust of your employees or getting a promotion. People with low emotional intelligence (or lack it entirely) often make the mistake of only recognizing and exercising their own emotional strengths. As a result, they fail to truly connect with their environment and the people around them — and it always backfires in one way or another. The most emotionally intelligent people know that in addition to understanding their own emotions, it's important to perceive the emotions of others, and the way that their environment impacts those emotions.\n\nCase study: when 'we' works for everyone\n\nRecently, I was called in to work with an engineering plant to help them improve their teams and systems. The products this company makes have very little room for error, and the stakes are high. If the team isn't accurate, then errors can cause a lot of harm. One of the company's problems had to do with a manager, whom I'll call \"Alex.\" Alex was a people-pleaser — a nice guy who connected his self-worth to whether or not people liked him.\n\nOur emotional intelligence exists within an ecosystem.\n\nWhen his team members wanted feedback to improve their work and reduce errors, they went around Alex and asked his boss or other employees for help. They knew that going to Alex would mean only praise, whether or not it was warranted. He failed to give constructive feedback, which inevitably resulted in problems. Alex had, in effect, lost credibility and trust with his team, so everything around him had started to unravel. At first it was slow, but like water swirling around a drain, it started to move more and more quickly. If we were to apply the common misconception about emotional intelligence here, we might say Alex needed to take a hard look at himself and realize that he was people-pleasing because of a need to be liked, and that need was harming the work culture and the company. We might even remind Alex that it's impossible to please everyone, and that trying to do so was damaging his work and his relationships with others. This strategy might work — but only for a short amount of time. In fact, the team leaders had already tried telling Alex to change. It failed for a predictable reason: telling someone to change without helping them to change their environment rarely leads to success. If you wanted to quit eating junk food, for example, would you continue to buy chips and candy? Or would you try to change what's in your kitchen? What wasn't being considered was the \"why\" behind Alex's people-pleasing. They didn't have a system in place to show him the impact and cost of covering for his employees. He needed to change, but he needed his environment to support that change. By the time I was asked to work with the executives at Alex's company, they were facing high rates of turnover and low employee engagement across the board.\n\n...telling someone to change without helping them to change their environment rarely leads to success.\n\nOne executive voiced her lack of trust in Alex because he had attempted to protect an employee by covering up their error-ridden work. Alex had claimed, \"We can't expect this person to be perfect.\" It left the other executives wondering if they could trust Alex at all. They felt they needed a management team that consistently held people accountable. The company had invested a lot of time, energy and resources in Alex. They didn't want to see him go; they just wanted to see some improvement. So we focused on the three core elements of change: Self-recognition: We spent time doing one-on-one individual work so that Alex could begin to recognize when he was engaging in counterproductive behavior. Was he doing what was needed or was he just telling people what he thought they wanted to hear? Social recognition: Alex's first assignment was to observe and investigate how his people-pleasing was impacting his team. After requesting feedback from one of the supervisors that reported to him, he was surprised and disappointed by what he heard. The supervisor recounted a recent situation when Alex reversed a tough decision to send an employee home after a safety incident. The supervisor told Alex how this had undermined him, and Alex started to see the impact of his actions. Design structure: Finally, I worked with Alex and his colleagues to create structure within his environment for addressing his people-pleasing tendencies. We designed a system for tracking accountability. Alex liked metrics, so he began to track when an issue first surfaced, the number of days until it was resolved, the resolution, and the impact to the team. The final piece was getting feedback from his team to determine if they felt the issues were resolved. Alex began to see the value in feedback and recognized that it was key to keeping him from avoiding issues. Avoiding the hard stuff was his emotional reaction — and it was a reaction rooted in fear. Once he was finally resolving issues, his team and the CEO recognized his efforts. Suddenly, positive reinforcements began coming in from all over — other executives, me, his team members. Alex started to rely less on his need for people to like him. Why? Because the environment had changed; it was now a place where objective decisions were rewarded. These weren't earth-shattering changes. They were just relatively small habits that made a big difference.\n\nEmotional intelligence matters", "description": "Focusing on just yourself means you're failing to perceive and connect with your environment and the people around you.", "authors": ["Kerry Goyette"], "top_image": "https://image.cnbcfm.com/api/v1/image/105709042-1548858800879gettyimages-3408125.jpeg?v=1548858915", "published_at": "2019-10-18"}