{"pub": "nytimes", "url": "https://nytimes.com/2019/10/20/opinion/trump-impeachment-protests.html", "downloaded_at": "2019-10-20 23:23:55.947095+00:00", "title": "Opinion | It’s Time for an Americans’ March", "language": "en", "text": "Consider what happened last week alone. Trump created a foreign-policy disaster in Turkey and Syria, for no apparent reason, while multiple administration officials testified that he views diplomacy largely as a way to advance his personal interests. His attitude, evidently, is: America, c’est moi. Even more so than a month ago, Trump is a national emergency, flagrantly violating his oath of office and daring the country to stop him.\n\nYet the chances of removing him appear as dim as Obamacare’s chances of survival did on Nov. 9, 2016. Trump even has plausible paths to re-election, some of which involve again losing the popular vote.\n\nL.A. Kauffman, a historian of protest movements, has said that effective ones often throw “a monkey wrench into a process that was otherwise going to just unfold smoothly.” That’s the role that an outside game can now play in the impeachment saga.\n\nIt can wake up more Americans to the gravity of the situation. It can mobilize progressives to work as hard as they did during the 2018 midterms. It can confront congressional Republicans with their cowardice.\n\nDo you remember the images showing throngs of people taking to the streets for the Women’s March? The size of the crowds, especially compared with Trump’s inauguration, reinforced the fact that most Americans rejected Trumpism. The marches also helped inspire the so-called resistance movement, which in turn created a network of dedicated activists, as the social scientists Lara Putnam and Theda Skocpol have pointed out.\n\nAnd do you remember the viral moments from the save-Obamacare movement, like the disability-rights activists visiting Congress or the citizens speaking up at town halls? Jessi Bohon, a teacher in central Tennessee, created one of those moments by connecting the fight to her Christian faith. It was one of many ways that ordinary people held up for a vision of America as decent and communal as Trump is vulgar and selfish.\n\n“Protests work,” as Kauffman has said — not always, of course, but often “when groups are willing to be bold in their tactics and persistent in their approach within the broad discipline of non-violent action.” As Vox’s Matthew Yglesias wrote last week, public protest “serves as a powerful signal to the rest of society that something extraordinary is happening.” If anything, protest may be more important than in the past, because the elite institutions that helped bring down Richard Nixon, like political parties and the national media, are weaker today.", "description": "Another moment for public protest has arrived.", "authors": ["David Leonhardt"], "top_image": "https://static01.nyt.com/images/2019/10/20/opinion/20leonhardt/20leonhardt-facebookJumbo.jpg", "published_at": "2019-10-20"}