{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/eagles/2019/10/20/philadelphia-eagles-dallas-cowboys-score-carson-wentz/4050396002", "downloaded_at": "2019-10-21 04:08:54.468795+00:00", "title": "Eagles' losses getting uglier as offense, defense self-destruct against Cowboys", "language": "en", "text": "ARLINGTON, Texas – The Eagles' problems were laid bare, again, for everyone to see.\n\nA defense that can't stop anyone, an offense that can't get out of its way. All of that added up to another embarrassing defeat as the Eagles fell 37-10 to the Dallas Cowboys on Sunday night.\n\nSo much for that first-place showdown in the NFC East.\n\nThe Eagles (3-4) never had a chance after two turnovers put them in a 14-0 hole in the first six minutes of the game. It only got worse from there.\n\nCarson Wentz lost two fumbles inside the Eagles' 20 yard line. The defense couldn't stop quarterback Dak Prescott, running back Ezekiel Elliott or wide receiver Amari Cooper.\n\nElliott had 111 yards rushing and Cooper had 106 yards receiving while Prescott threw for 239 yards.\n\nThe Eagles had no answers. They tried running the ball behind Jordan Howard, which proved effective as Howard had 50 yards on 11 carries.\n\nMore: 32 things we learned from Week 7 of the 2019 NFL season\n\nMore: Cowboys pull out of tailspin, throttle Eagles for win\n\nBut it hardly mattered as the Eagles fell behind by 27-7 at halftime and had to throw. Wentz completed 16 of 26 passes for 191 yards with a touchdown and an interception. He had little help, and certainly didn't do much to help himself, either.\n\nThe defense, meanwhile, gave up 266 yards in the half. It was the second straight week the Eagles allowed at least 24 points in the first half.\n\nThe Cowboys came into the game having lost three straight, and hadn't scored a touchdown in the first half in any of those games.\n\nThat wasn't a problem against the Eagles.\n\nOn the first series of the game, Dallas Goedert fumbled after catching Wentz's pass and the Cowboys recovered, taking over at the Eagles' 45. Tavon Austin scored from 20 yards out and Dallas had the early lead.\n\nThe Eagles fumbled the ball away again on the next possession. This time, DeMarcus Lawrence sacked Wentz, forcing a fumble that Antwaun Woods recovered at the Eagles' 14. Elliott ran the ball down to the 1, then scored on the next play.\n\nFinally, the Eagles showed some life. They marched down the field, helped by two 15-yard penalties by the Cowboys before Wentz hit Goedert for a 28-yard touchdown on a beautifully thrown ball and catch.\n\nThe Eagles needed that touchdown desperately.\n\nTurns out it hardly mattered. The Cowboys made it 21-7 on Prescott's 1-yard pass to Blake Jarwin, who was wide open because the entire Eagles' defense sold out on a fake handoff to Elliott up the middle.\n\nCooper got behind Rasul Douglas for a 44-yard completion down to the Eagles' 30. Elliott then carried the ball down to the 14 before Dallas settled for a field goal and a 24-7 lead at halftime.\n\nBrett Maher's 63-yard field goal as the first half ended made it 27-7.\n\nThe Eagles couldn't get back into the game in the second half. They drove the ball down the field on their first possession of the second half, getting inside the Cowboys' 10. But the Eagles had to settle for a field goal after Lane Johnson's penalty for illegal hands to the face pushed the Eagles back to the 19.\n\nThat made it 27-10.\n\nField goals weren't going to make a difference as the Cowboys faced little resistance. They answered with a field goal, and later added a touchdown on Wentz's second fumble when Jason Kelce's snap hit him in the chest.\n\nPrescott ran that one in from the 8 with 9:33 left.\n\nThe Eagles were done, in more ways than one.", "description": "The Eagles sunk to 3-4 with a blowout loss to the Cowboys, and they'll have to find answers in short order to turn things around.", "authors": ["Martin Frank", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/21/PWIL/be2fc8a3-3cc4-4a6f-9bba-7185ec121bc8-USATSI_13547634.jpg?crop=2498,1406,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-20"}