{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/15/1929936/0/en/First-Poppy-presented-to-Canada-s-Governor-General.html", "downloaded_at": "2019-10-15 15:00:31.789518+00:00", "title": "First Poppy presented to Canada’s Governor General", "language": "en", "text": "OTTAWA, Oct. 15, 2019 (GLOBE NEWSWIRE) -- Her Excellency the Right Honourable Julie Payette, Governor General and Commander-in-Chief of Canada, received the symbolic First Poppy from The Royal Canadian Legion’s Dominion President, Thomas D. Irvine, CD, in Ottawa today.\n\nAs Viceregal Patron of The Royal Canadian Legion, Ms. Payette accepted the red poppy and pinned additional poppies to the lapels of Veterans in attendance. The Legion’s 2019 National Poppy Campaign begins each year on the last Friday in October, this year, October 25.\n\n“We salute our nation’s Governor General who leads the way each year by accepting the First Poppy so that millions may follow her example,” says Irvine. “With the red poppy this year, we also mark the 75th anniversary of D-Day which eventually led to the end of the war in Europe.”\n\nDuring the presentation at Rideau Hall, the 2019 digital poppy was unveiled, the second year for this virtual option. People who donate online will receive a digital poppy that can include the name of a Veteran being honoured, and can be shared on social media. People are invited to visit mypoppy.ca starting on October 25. This year’s online initiative is supported by Home Equity Bank. Canadians living abroad and donors around the world can also take part in the 2019 campaign.\n\nAs the national symbol of Remembrance, the red poppy reflects the ongoing gratitude we have for our Fallen Veterans, including military and RCMP Veterans.\n\nFunds raised during the National Poppy Campaign are distributed across Canada to help support Veterans and their families, communities, and to promote Remembrance.\n\nAbout The Royal Canadian Legion\n\nFounded in 1925, the Legion is Canada’s largest Veteran support and community service organization. We are a non-profit organization with a national reach across Canada as well as branches in the U.S., Europe and Mexico. With 260,000 members, many of whom volunteer an extraordinary amount of time to their branches, our strength is in our numbers.\n\nPublic Relations / Media Inquiries: PublicRelations@Legion.ca / 343-540-7604 - Nujma Bond\n\nLegion.ca\n\nFacebook.com/CanadianLegion\n\nTwitter.com/RoyalCdnLegion\n\nInstagram.com/royalcanadianlegion\n\nyoutube.com/user/RCLDominionCommand\n\n\n\n\n\nPhotos accompanying this announcement are available at\n\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/d18a0063-4393-4cf5-a5f2-e9ef41f91b93\n\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/d850d65b-4c5c-46a8-9382-809082347bae", "description": "2019 digital poppy also unveiled during ceremonial launch of National Poppy Campaign", "authors": ["The Royal Canadian Legion"], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/603331?filename=603331.png&size=1", "published_at": "2019-10-15"}