{"pub": "breitbart", "url": "https://breitbart.com/news/boyhood-rivals-cabal-and-farah-make-crazy-run-to-top", "downloaded_at": "2019-10-10 06:17:06.501117+00:00", "title": "Boyhood rivals Cabal and Farah make ‘crazy run’ to top", "language": "en", "text": "Shanghai (AFP) – Juan Sebastian Cabal and Robert Farah were just 11 when their coach told them they were playing doubles together — two decades later they are on a “crazy run” that’s made them the best team in men’s tennis.\n\nIn July the Colombian duo won Wimbledon for their first Grand Slam, then two months later pulled off the same feat at the US Open.\n\nThey will make it a scarcely believable three majors in a row if they go one better than 2018 and win the final at the Australian Open in January.\n\n“It’s been amazing, it’s been a crazy run, we are just really proud, really happy about the results,” Cabal, 33, the elder of the pair by nine months, told AFP at the Shanghai Masters.\n\nTheir phenomenal success this year propelled them to number one in the world and is the product of hard work, togetherness and staying free of injury, said Farah.\n\n“At some point you kind of want to win everything and clearly it’s an expectation that you create by winning two Slams in a row,” he said in Shanghai, where they are homing in on a sixth title this year.\n\nWednesday’s victory over Americans John Isner and Sam Querrey ensured they will finish the year top of the men’s doubles rankings, only the second all-South American team to do that.\n\n– ‘Like family ‘ –\n\nCabal and Farah spend a lot of time together, not just on the court but also sometimes sharing hotel rooms as they travel across the world beating their opponents on the ATP Tour.\n\n“Let’s put it this way: my wife says she has two husbands,” joked Cabal.\n\nAren’t they sick of the sight of each other?\n\n“We’ve been like family for ever,” chipped in Farah.\n\n“The Tour can be a lonely place sometimes when you don’t have your friends and family.”\n\nThe Grand Slams arrived only in recent months, but Cabal and Farah’s partnership was long in the making, all the way back to when they were little boys.\n\nThey started off not as team-mates, but opponents.\n\n“We started playing against each other when we were six, seven years old,” said Farah.\n\n“When we were playing 10, 11 for our state, our coach said, ‘Well, you guys are playing together in this tournament.’\n\n“And we were like, ‘Err, alright.’”\n\nNobody could have known it then, but that decision was a master stroke.\n\nCabal picks up the story.\n\n“The first time we played doubles together was a national tournament in Medellin, I was 11 or 12,” he said.\n\n“We played there, we won it, and since then it’s been a long journey.”\n\n– Setbacks –\n\nThat journey has not always been smooth.\n\nInjuries hampered their progress; Cabal has had a long-standing knee problem that nearly ended his career.\n\nAnd Farah last year was given a suspended three-month ban for promoting a gambling website on social media. He apologised.\n\nBoth men say that they are driven less by personal glory and more by what their achievements do to promote Colombia on the world stage.\n\nCabal hopes that they can inspire a new generation of tennis players from the South American country.\n\n“We try to make tennis history or tradition in Colombia,” he said.\n\n“We are the first ones and hopefully it’s the beginning of a few more.”", "description": "Shanghai (AFP) – Juan Sebastian Cabal and Robert Farah were just 11 when their coach told them they were playing doubles together — two", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/09/bfeee7_boyhood-foes-world-tennis-champs-colombian-duo-are-win-straight-grand-slams-640x335.jpg", "published_at": "2019-10-09"}