{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/sep/22/permanent-record-review-edward-snowden-memoir", "downloaded_at": "2019-09-22 05:55:14.156857+00:00", "title": "Permanent Record review: Edward Snowden writes in 50 shades of grey", "language": "en", "text": "The whistleblower offers part-confession, part-J’accuse, an ambiguous tale for a nation which doesn’t know what to think\n\nEighteen years after the towers fell and the Pentagon burned, nearly three in four Americans call terror a national priority. Almost half prioritize security over civil liberties.\n\nCrossfire Hurricane review: tale of Trump and the FBI is a gas gas gas Read more\n\nShould Edward Snowden be prosecuted? The public is divided. To most, the man responsible for a historic leak of US surveillance efforts is not wholly hero or villain. Our perceptions are shaded in grey.\n\nAgainst this backdrop comes Permanent Record, a well-written, self-absolving, brazen autobiography. For someone who by his own account had no interest in writing a 1,000-word personal statement in high school, Snowden delivers an easy read, part confession, part J’accuse.\n\nIt is another book for our times. Amid accusations by the attorney general, William Barr, that the government spied on Donald Trump’s campaign, it is worth remembering Barr has been described as “the godfather of the NSA’s bulk data collection program”. Ambivalence and hypocrisy reign. On both sides.\n\nSnowden is generous with facts – to a point. He lets us into his childhood as the son of a coast guard officer, the grandson of a coast guard admiral. He tells of his Puritan ancestry, his early fascination with computer games, his tropism toward defiance, a knack for “hacking” that became obvious early.\n\nHe hated being made to go to bed early, and recalls resetting clocks to confuse the powers that be. It was downhill from there. By the time Snowden reached high school it was apparent he was not college-bound, if not for lack of smarts. He has an IQ of 145.\n\nRather, Snowden was too busy with computers and video games to bother with academics. Permanent Record records his attempts to game the system, calculating that he could pass one of his classes even if he never handed in a shred of homework.\n\nThen hubris struck. Snowden advised his teacher of the shortcomings of the grading system, which led the teacher to revise the rules and Snowden to be left holding the bag. Homework could no longer be avoided. It would not be the last time he got himself into trouble.\n\nEven as a new CIA contractor, Snowden let those in charge know they were not necessarily the boss. For his sins, he was posted to Geneva – to the envy of all, though he didn’t see it as a plus.\n\nBoth Snowden’s parents served in the government and in the aftermath of 9/11 Snowden sought to fuse his computer skills with a stint in the military. Unfortunately, he was injured in basic training and essentially forced to leave. He was upset, but ultimately recovered.\n\nSnowden revealed that US citizens were subjected to mass surveillance … Uncle Sam was a silent partner in their lives\n\nAgain demonstrating his knowledge of how the system could be worked, he set about finding a job that required security clearance, with the insight that once a person obtains that it is treated like a passport to employment within the intelligence community.\n\nSnowden discusses at length how the government in general, and the spy agencies in particular, rely on outside contractors. He makes clear that for all intents and purposes they are barely distinguishable from formal employees, with one major exception: they are generally better paid. Although the taxpayers foot the bill, few voice concern, better the status quo than to rock the boat.\n\nSnowden dishes on the shortcomings of our spy networks. According to him, the National Security Agency (NSA) is home to cutting-edge technology that is poorly safeguarded. In contrast, the CIA is weak on gadgetry and tech but zealous in protecting its secrets. When it came time to spill the beans, Snowden opened the hatch on the NSA.\n\nNow criminally charged and living in Moscow, he has few defenders outside the American Civil Liberties Union (ACLU) and free speech purists. At days’ end, he gave up highly valued American assets and lives under the suspicion of being a Russian one. Those who are angry with him are understandably so.\n\nAnd yet Snowden revealed that American citizens were subjected to mass government surveillance. The privacy that they valued was not intact. Uncle Sam was a silent partner in their lives.\n\nThose who are angry with Snowden are understandably so\n\nBarack Obama and congressional leaders, Democrats and Republicans alike, knew what was happening. The citizenry didn’t. Gen James Clapper was less than candid with Congress when he denied that data belonging to Americans was being scooped up without a prior court order.\n\nAfter the Snowden revelations, an intermediate US appellate court reinstated a lawsuit brought by the ACLU that challenged the constitutionality and statutory legality of the NSA’s bulk telephone metadata collection. In 2015, a three-judge panel held that “the program exceeds the scope of what Congress has authorized”. But the court did not adjudicate the larger constitutional issue.\n\nMick Jagger told the truth. At a June 2013 performance at, aptly enough, the Verizon Center in Washington, the Stones frontman quipped: “I don’t think President Obama is here tonight ... But I’m sure he’s listening in.”\n\n'They wanted me gone': Edward Snowden tells of whistleblowing, his AI fears and six years in Russia Read more\n\nPermanent Record attempts to justify Snowden’s breach of trust with his government and his country but comes up short in the persuasion department. Snowden lacks the ideological motivation of Kim Philby, and is adamant in proclaiming he is not a Russian spy. But he does emote a similar disillusionment with the country of his birth.\n\nNow it has emerged that Trump purportedly compromised national security protocols in a phone call to an unnamed foreign power, and his administration is doing its best to keep the truth hidden. Hillary Clinton, her emails and server look quaint by comparison, those chants of “lock her up” ever more unhinged and misdirected.\n\nThis week, over this book, the US government sued Snowden. In case anyone forgot, Barr once worked for the CIA and his father worked for the Office of Strategic Services (OSS), the agency’s second world war precursor. More likely than not, Snowden will remain a man without a passport.", "description": "The whistleblower offers part-confession, part-J’accuse, an ambiguous tale for a nation which doesn’t know what to think", "authors": ["Lloyd Green"], "top_image": "https://i.guim.co.uk/img/media/1e26467b4b733220120f6185e18ce67b320ea756/52_298_3434_2060/master/3434.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3633b7d6024a8410fe5791ff27fec039", "published_at": "2019-09-22"}