{"pub": "yahoo", "url": "https://news.yahoo.com/putin-defends-trump-over-ukraine-133652880.html", "downloaded_at": "2019-10-04 09:19:13.398933+00:00", "title": "Republican Says GOP Left Out of Inquiry: Impeachment Update", "language": "en", "text": "(Bloomberg) -- The Democrats’ impeachment inquiry into President Donald Trump is moving forward as several House committees are to receive private briefings Wednesday from the State Department inspector general on documents related to Ukraine.\n\nSecretary of State Michael Pompeo has been subpoenaed to provide documents by Friday to three House committees.\n\nHere are the latest developments:\n\nRepublican Says GOP Is Being Left Out (9 p.m.)\n\nA senior House Republican demanded that Democrats in charge of impeachment proceedings against Trump give “equal representation and participation in this inquiry,” on the eve of testimony from the president’s former special envoy to Ukraine.\n\nMichael McCaul of Texas, the ranking Republican on the Foreign Affairs Committee, complained that only one of his panel’s Republican staffers will be present for the testimony of Kurt Volker, the former envoy, at a closed-door session on Thursday.\n\n“I was alarmed to learn –- less than 24 hours before the first interview is scheduled to start –- that it will be led by the Intelligence Committee and that questioning will be done solely by their staff,” McCaul wrote to Foreign Affairs Chairman Eliot Engel.\n\n“These constraints on committee and Republican participation are unacceptable and at odds with House Rules and general fairness,” McCaul added.\n\nGraham Asks Foreign Leaders to Aid Barr Inquiry (6:50 p.m.)\n\nSenator Lindsey Graham has sent a letter urging the leaders of Australia, Italy and the U.K. to continue working with Attorney General William Barr in his inquiry into the origins of the investigation into Russian interference in the 2016 U.S. election.\n\n“That the attorney general is holding meetings with your countries to aid in the Justice Department’s investigation of what happened is well within the bounds of his normal activities,” Graham, a South Carolina Republican and Trump ally wrote in the letter. “He is simply doing his job.”\n\nBarr, Pompeo and Trump’s personal lawyer Rudy Giuliani have all been drawn into a House impeachment inquiry after details of the administration’s foreign contacts emerged.\n\nBarr is reviewing what U.S. intelligence agencies did in 2016 and has met with officials from Italy and Australia, the official said.\n\nGraham’s letter to the prime ministers of the U.K., Italy and Australia was attached to a statement from the Senate Judiciary Committee, of which he is chairman.\n\nCongress Given Mystery State Documents (5:04 p.m.)\n\nA highly anticipated briefing by the State Department’s inspector general that had been shrouded in mystery may turn out to be “a completely irrelevant distraction” from the House impeachment inquiry, Democratic Representative Jamie Raskin said afterward.Inspector General Steve Linick, who had asked to brief lawmakers, turned over a packet of material consisting of propaganda and disinformation that appeared to be aimed at undermining the Mueller investigation into Russian election interference and, in part, promoting conspiracy theories about former Vice President Joe Biden, Raskin said.\n\nThe packet purports to come from the White House and is addressed to Secretary of State Michael Pompeo. One Democratic aide said it included Trump hotel folders with alleged notes from interviews that took place at at the New York office of Trump’s personal lawyer, Rudy Giuliani, about debunked conspiracies related to Ukraine.\n\nRaskin said its actual provenance is unknown, but the inspector general got the documents in May and sent them to the FBI. He said the lawmakers had been expecting to get briefed on other matters.\n\nRaskin, who was in the briefing, said there was nothing in the material that directly relates to Trump’s conduct or that of Secretary of State Michael Pompeo.“The inspector general has no idea where it came from,” Raskin said.\n\nWhite House to Preserve Phone Call Records (4:10 p.m.)\n\nJustice Department lawyers told a federal judge in Washington that the White House will preserve six categories of records related to Trump’s telephone calls with foreign leaders.\n\nThat concession came Wednesday in a lawsuit filed by Citizens for Responsibility and Ethics in Washington in May, demanding that Trump comply with the federal Presidential Records Act.\n\nThat potentially makes the records available if sought for the House impeachment inquiry as well.", "description": "(Bloomberg) -- The Democrats’ impeachment inquiry into President Donald Trump is moving forward as several House committees are to receive private briefings Wednesday from the State Department inspector general on documents related to Ukraine.Secretary of State Michael Pompeo has been subpoenaed to provide", "authors": ["Steven T. Dennis", "Daniel Flatley"], "top_image": "https://s.yimg.com/uu/api/res/1.2/bCN6rV_niOfejjK07IeiGg--~B/aD0xNTAwO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/6d5525fab7dbcf73a8bde33131f0d73b", "published_at": "2019-10-03"}