{"pub": "reuters", "url": "https://reuters.com/article/us-ethiopia-airplane-congress/boeing-ceo-to-testify-before-congress-about-grounded-737-max-idUSKBN1WC1M8", "downloaded_at": "2019-09-27 15:08:29.959832+00:00", "title": "Boeing CEO to testify before Congress about grounded 737 MAX", "language": "en", "text": "WASHINGTON (Reuters) - Boeing Chief Executive Dennis Muilenburg has agreed to testify before Congress next month on the grounded 737 MAX that was involved in two fatal crashes that killed 346 people, a U.S. House of Representatives committee and the company said on Friday.\n\nFILE PHOTO: Boeing Co Chief Executive Dennis Muilenburg speaks during a news conference at the annual shareholder meeting in Chicago, Illinois, U.S., April 29, 2019. Jim Young/Pool via REUTERS\n\nJohn Hamilton, chief engineer of Boeing’s Commercial Airplanes division and Jennifer Henderson, chief pilot for the 737, will join Muilenburg when he testifies on Oct. 30, the U.S. House Transportation and Infrastructure Committee said. The CEO has not testified before Congress since the fatal crashes in Indonesia and Ethiopia. The plane was grounded and the FAA’s certification of the new aircraft was questioned.\n\n“We will continue to cooperate with Congress and regulatory authorities as we focus on safely returning the MAX to service,” Boeing said, adding it has provided more than 300,000 pages of documents to the committee.\n\nSources said Muilenburg was also expected to appear before the Senate Commerce Committee next month. Boeing (BA.N) did not immediately comment on that.\n\nOn Thursday, the U.S. National Transportation Safety Board faulted Boeing for failing to adequately consider how pilots respond to cockpit emergencies in its 737 MAX safety assessment. The board said the plane maker may need to make changes to flight deck alerts, pilot procedures and training.\n\nBoeing has said the feeding of erroneous Angle of Attack (AOA) data to a system called MCAS that pushed the planes lower was a common link in two wider chains of events leading to the crashes. Boeing is revising the 737 MAX software to require input from both sensors, and has added additional safeguards.\n\nOn Wednesday, Boeing’s board said it had created a permanent safety committee to oversee development, manufacturing and operation of its aircraft and services.\n\nIt was not clear when Boeing will conduct a key certification test flight, a step needed before the FAA can return the plane to service. The company has said it hopes to resume flights early in the fourth quarter.\n\nThe FAA said last week it will need a month after the test flight is completed before it could allow flights to resume.\n\nMajor U.S. airlines have canceled flights into December as a result of the MAX grounding, including American Airlines Group Inc (AAL.O)and United Airlines(UAL.O), while Southwest Airlines Co (LUV.N)has canceled flights into early January.", "description": "Boeing Chief Executive Dennis Muilenburg has agreed to testify before Congress next month on the grounded 737 MAX that was involved in two fatal crashes that killed 346 people, a U.S. House of Representatives committee and the company said on Friday.", "authors": ["David Shepardson", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190927&t=2&i=1434553416&w=1200&r=LYNXMPEF8Q11V", "published_at": "2019-09-27"}