{"pub": "dailybeast", "url": "https://thedailybeast.com/manhattan-da-cyrus-vances-trump-case-hinges-on-tax-returns", "downloaded_at": "2019-10-24 23:53:50.523221+00:00", "title": "Manhattan DA Cyrus Vance’s Trump Case Hinges on Tax Returns", "language": "en", "text": "The Manhattan district attorney’s criminal investigation of President Trump and the Trump Organization hinges on tax returns at the center of a legal tug-of-war that is all but certain to wind up at the U.S. Supreme Court.\n\n“The tax returns would provide the most solid blueprint for the case,” a person with knowledge of DA Cyrus Vance’s investigation told The Daily Beast. “They could potentially have irrefutable evidence that a crime was committed.”\n\nProsecutors “assume what they are looking for is in there” and obtaining the financial records is the next step based on what investigators have learned from people who have been interviewed, the person added.\n\nThe tax returns are a crucial part of the Vance team’s current legal strategy, and prosecutors would have to find a different way into the investigation if they are not able to gain access to the tax returns, the person said.\n\nA spokesman for the Vance’s office declined to comment for this story.\n\nBut during a hearing Wednesday, an attorney for Vance made clear how important the tax records are to the case, saying investigators are “hamstrung significantly” without them and that subpoenaing tax returns in a financial crimes investigation is commonplace.\n\nVance’s office is looking into whether state laws were broken through hush-money payments to pornstar Stormy Daniels and Playboy model Karen McDougal in the run-up to the 2016 presidential election.\n\nTrump’s former fixer Michael Cohen made the secret payments, but was reimbursed by Trump and the Trump Organization, and the DA wants to know if any business records were falsified in connection with the expenditure.\n\nTo that end, Vance subpoenaed eight years worth of tax returns and other financial records from Mazars USA, the president’s long-time accounting firm, in late August.\n\nProsecutors expect to “move fairly expeditiously” after they get the documents to determine if they have enough evidence to bring charges, the person familiar with the probe said.\n\nBut the subpoena has been on hold since Trump’s lawyers filed a federal lawsuit against Vance and Mazars to squash the request, claiming that a sitting president should not be “subject to the criminal process” and that local prosecutors are “on a fishing expedition.”\n\nA federal judge ruled against Trump earlier this month, and the two sides went before an appeals panel in the Second Circuit on Wednesday to make oral arguments.\n\nWhatever the outcome, the case is expected to land before the Supreme Court. Judge Robert Katzmann, who is overseeing the panel, hinted as much during the one-hour proceeding, noting that “this case seems bound for the Supreme Court.”\n\nIn a letter filed with the court on Monday and issued into the record Wednesday, both sides agreed that the losing side will petition the U.S. Supreme Court within 10 days of a decision by the appeals court panel. As part of the agreement, Vance has promised not to enforce the subpoena until after the high court either declines to take up the case or hears it and issues an opinion.\n\nVance’s subpoena for Trump’s tax filing is one of four making their way through courts. The other three were issued by various congressional committees seeking the returns from Mazars, two banks that lent money to Trump, and the Treasury Department and the Internal Revenue Service.\n\nThe Manhattan DA’s subpoena was obtained in late August as part of a grand jury proceeding. Prosecutors also have lined up a number of witnesses, including Cohen, who is serving a three-year prison sentence for crimes that include his role in facilitating the hush-money payments, the person with knowledge of the investigation said.\n\nIt was not immediately clear who else prosecutors have spoken with, but others with knowledge of payments have talked with prosecutors, the person said, declining to give names.\n\nIt’s not clear if Cohen has testified before the grand jury. The challenge prosecutors face is that a convicted criminal is not an ideal witness—making other evidence, such as the tax returns, all the more crucial.\n\nCohen told federal prosecutors in court that the payouts were made “at the direction” of then-candidate Trump and both the president and the Trump Organization funneled the hush money through him.\n\nCohen has been helpful to Vance’s prosecutors during multiple interviews at the Manhattan DA’s office and the upstate New York prison where he is serving time, the person said. What that Manhattan DA’s office has learned “dovetails” with information Cohen gave to federal prosecutors, the person said.", "description": "Prosecutors “assume what they are looking for is in there,” one source said.", "authors": ["Pervaiz Shallwani", "Senior Editor"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1913,w_3401,x_311,y_338/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1571945241/RTS2SHVB_vt0jkt", "published_at": "2019-10-24"}