{"pub": "washingtonpost", "url": "https://washingtonpost.com/climate-environment/jane-fonda-plans-climate-change-civil-disobedience-on-the-capitol-steps/2019/10/10/c7cd534e-eab1-11e9-9306-47cb0324fd44_story.html", "downloaded_at": "2019-10-11 03:59:24.306105+00:00", "title": "Jane Fonda plans climate change civil disobedience on the Capitol steps", "language": "en", "text": "“I’m going to take my body, which is kind of famous and popular right now because of the [television] series and I’m going to go to D.C. and I’m going to have a rally every Friday,” Fonda said in an interview with The Washington Post. “It’ll be called ‘Fire Drill Friday.’ And we’re going to engage in civil disobedience and we’re going to get arrested every Friday.”\n\nAD\n\nAD\n\nCall her the Greta Thunberg of the octogenarian set. The 16-year-old Thunberg, a Swedish high school student, has rocked the world with her blunt denunciations of generations that have failed to slow climate change. The 81-year-old Fonda, who says she was moved reading about Thunberg, believes she can have her own impact.\n\nWhen Thunberg studied climate change, “she realized what was happening and that this was barreling at us like an engine,” Fonda said. “It so traumatized her that she stopped speaking and eating. And when I read that it rocked me, because I knew that Greta had seen the truth. And the urgency came into my DNA the way it hadn’t before.”\n\n“Greta said we have to behave like it’s a crisis,” Fonda added. “We have to behave like our houses are on fire.”\n\nAD\n\nFonda has a distinguished acting career, including political films such as “Coming Home” about Vietnam War wounds both mental and physical, “9 to 5” about working women, and “The China Syndrome” about a nuclear power plant that was released shortly before the Three Mile Island nuclear accident.\n\nAD\n\nShe has history of political activism, too. She supported the Black Panthers and marched for the rights of Native Americans, soldiers and working mothers. In 1970, she went to Fort Meade to hand out antiwar pamphlets to soldiers, but was arrested before she was able to. In 1972, she went to North Vietnam and sat on an antiaircraft gun, earning the nickname “Hanoi Jane.” She has repeatedly apologized for the photo and to veterans of the war. She has been active on women’s issues.\n\nThis time Fonda is planning to go about things differently. Every Thursday evening, starting Oct. 17, there will be online teach-ins featuring climate scientists talking about different aspects of global warming. Fonda said she would like to “draw connections” by discussing how violence against women increases in communities suffering from climate change.\n\nAD\n\nThen on Fridays, she will go to the steps of the Capitol building holding a placard and will refuse to obey three requests by the Capitol Police to cease and desist. She’s not expecting a mass rally, more like a handful of people. This Friday’s launch coincides with bigger protests scheduled worldwide.\n\nAD\n\nShe has invited some of her celebrity friends: Actor Ted Danson of “Cheers” fame, who has become involved in ocean conservation; “The Vagina Monologues” playwright Eve Ensler; and actresses Kyra Sedgwick and Catherine Keener.\n\nShe’s reached out to leaders of Black Lives Matter and the Sunrise Movement. Ben Cohen, co-founder of Ben & Jerry’s ice cream, will join the demonstrations, which will start at 11 a.m. Fridays on the side of the Capitol facing the Supreme Court.\n\nAD\n\nFonda said she also intends to make demands.\n\n“The number one thing is cutting all funding and permits for new developments for fossil fuel and exports and processing and refining,” she said. She said that if efforts go into discouraging demand for oil and gas and coal, “it’s not going to do any good” if companies are still developing prospects. “It’s not going to make any difference,” she said.\n\nAD\n\nFonda also wants to get out the vote, not only for presidential ballots but down to local government to make climate policy a litmus test.\n\nIt’s not Fonda’s first climate protest. In 2016, she spent Thanksgiving with protesters gathered in an effort to block an oil pipeline through land claimed by the Standing Rock Sioux Tribe in North Dakota. She has protested in Los Angeles, Vancouver and Seattle.\n\nAD\n\nKlein opens her book with an essay about Thunberg and her Asperger’s syndrome. Fonda says it showed her that some people on the autism spectrum are “totally laser focused” and “information comes at them pure and direct.”\n\nAD\n\n“It’s as simple as this. We have according to the [Intergovernmental Panel on Climate Change] 12 years, but that was a year ago,” Fonda says. “So according to their report we have 11 years left. Eleven years to do something that has never been done in human history. And if we don’t do it, huge parts of the planet are going to be uninhabitable, by the way.”\n\nFonda drives an electric car and has solar panels on her home. She’s getting rid of plastics.\n\nAD\n\nBut she says she’s “not quite vegan.” And unlike Thunberg, who took a sailboat across the Atlantic to avoid using jet fuel, Fonda says she’ll fly when she needs to. She has a speaking tour with her television co-star Lily Tomlin that requires taking planes. And she doesn’t think climate activists should alienate potential activists who, for example, eat beef.\n\nAD\n\nDoes Fonda, who has a three-month old grandson, have a lesson from her earlier participation in political protests? She says, “I feel far braver now than I did before. I’ve got nothing to lose and this is it.”\n\nFonda will mark her 82nd birthday on a December Friday, and she’s planning on celebrating by getting arrested in Washington.\n\nAsked whether she could weather partisan attacks from President Trump or others, Fonda said, “You don’t see it but I have armor around me. It’s invisible but it’s my special power like Greta and her Aspergers. I’m 82 years old. There’s nothing they can do. It doesn’t matter what they do.”\n\nAD", "description": "Film and television star to bring Thursday night teach-ins and “Fire Drill Fridays.”", "authors": ["Steven Mufson", "Reporter Covering The Business Of Climate Change"], "top_image": "https://www.washingtonpost.com/resizer/n2PfwzuHjCtzMEx1uYIAqyJ3XWM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UJBVIBXLAII6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-10"}