{"pub": "investing.com", "url": "https://au.investing.com/news/forex-news/forexdollar-heads-towards-1week-lows-as-trade-uschina-talks-get-underway-1970562", "downloaded_at": "2019-10-11 06:01:03.015205+00:00", "title": "FOREX-Dollar heads towards 1-week lows as trade U.S.-China talks get underway", "language": "en", "text": "© Reuters. FOREX-Dollar heads towards 1-week lows as trade U.S.-China talks get underway\n\nBy Saikat Chatterjee\n\nLONDON, Oct 10 (Reuters) - The dollar weakened broadly against its rivals on Thursday as the progress of trade negotiations between the United States and China kept markets on edge with the prospects of a partial deal fuelling appetite for trade-oriented currencies.\n\nThe Australian AUD=D3 and New Zealand dollars NZD=D3 led gains against the greenback after Bloomberg reported the United States is weighing a currency pact with China which could see a planned tariff hike next week being suspended. negotiations between Beijing and Washington getting underway on Thursday, market watchers say any concessions from China would be touted as a success from U.S. officials and that might fuel further yen weakness and gains in the dollar.\n\n\"The (U.S.) President should be keen to achieve that, in particular during the election campaign. ..I think the optimism has risen repeatedly over the past few days,\" Ulrich Leuchtmann, an FX strategist at Commerzbank (DE: ) said in a daily note.\n\nA currency pact would pave the way for further negotiations on core issues such as intellectual property and forced technology transfers with reports that Beijing has offered to increase purchases of agricultural goods further signaling a thaw in trade tensions.\n\n\"It remains to be seen whether a partial trade deal will be acceptable for President Trump who wants to secure a broader agreement,\" MUFG strategists said.\n\nAgainst a basket of its rivals , the dollar weakened 0.3% to 98.845, nearing a one-week low. It weakened as much as 0.4% versus the New Zealand and Australian dollars.\n\n\"There are many headlines flying about, some negative, and some positive,\" said Stuart Oakley, global head of flow FX at Nomura in Singapore.\n\n\"The fix (by China's central bank) will be key to watch over the next 4-5 sessions. It's been pegged around 7.0730 for several weeks. A move away from that level will give us a clear signal as to how the trade negotiations have gone.\"\n\nThe Chinese currency in the offshore market CNH=D3 gained for a second day, rising 0.3% versus the greenback to 7.1145 yuan per dollar.\n\nThe pound climbed 0.3% to $1.2241, though it remained close to a one-month low amid uncertainty over Britain's exit from the European Union before a slew of British data.", "description": "FOREX-Dollar heads towards 1-week lows as trade U.S.-China talks get underway", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEEAE0DC_L.jpg", "published_at": "2019-10-10"}