{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/millennials-mental-health-burnout-lonely-depressed-money-stress", "downloaded_at": "2019-10-10 15:31:50.973032+00:00", "title": "Lonely, burned out, and depressed: The state of millennials' mental health in 2019", "language": "en", "text": "As part of World Mental Health Day, Business Insider looked into the state of millennials' mental health.\n\nDepression and \"deaths of despair\" are on the rise among millennials, many of whom suffer from loneliness, money stress, and burnout in the workplace.\n\nBut millennials are changing the way people look at mental health by being more open about their issues and destigmatizing therapy.\n\nVisit Business Insider's homepage for more stories.\n\nMillennials are changing the way people look at and talk about mental health.\n\nAs part of World Mental Health Day, Business Insider took a look at the current mental health state of millennials (defined by the Pew Research Center as the cohort turning 23 to 38 in 2019). It doesn't look pretty — depression and \"deaths of despair\" are both on the rise among the generation, linked to issues such as loneliness and money stress.\n\nMillennials also feel their jobs have an outsize role in their overall mental health. Due to longer work hours and stagnant wages, millennials suffer from higher rates of burnout than other generations. Many of them have even quit their jobs for mental health reasons.\n\nWhile some millennials can't afford to get help, they're more likely to go to therapy than previous generations, destigmatizing the concept in the process.\n\nHere are 11 ways mental illness has plagued the millennial generation.", "description": "Depression and \"deaths of despair\" are on the rise among millennials, many of whom suffer from loneliness, money stress, and burnout in the workplace.", "authors": ["Hillary Hoffower", "Allana Akhtar"], "top_image": "https://image.businessinsider.com/5d9e554d122bd52f2137a498?width=1200&format=jpeg", "published_at": "2019-10-10"}