{"pub": "independent", "title": "Christian Wade: Buffalo Bills cut former England rugby star from 53-man NFL roster", "url": "https://independent.co.uk/sport/us-sport/national-football-league/christian-wade-nfl-buffalo-bills-lesean-mccoy-cut-53-man-roster-a9087361.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:15:50.013800+00:00", "text": "Former England rugby international Christian Wade has been cut from the Buffalo Bills' 53-man squad for the upcoming NFL season.\n\nThe 28-year-old walked away from Premiership side Wasps in a bid to make it in the NFL last October, and has enjoyed a promising pre-season with the Bills.\n\nAn electrifying 65-yard touchdown with his first ever carry helped the Bills top the Indianpolis Colts 24-16, before a catch and 48-yard run caught the eye against the Panthers.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHowever, Wade's technique still requires considerable work, and he was named as one of the 31 players to be released from the final roster on Saturday evening.\n\nHe will now enter waivers, with other teams given the opportunity to pick up the former England wing.\n\nShape Created with Sketch. NFL Draft 2019: First Round Show all 33 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. NFL Draft 2019: First Round 1/33 NFL Draft 2019: First Round Getty Images 2/33 1.01 Arizona Cardinals: Kyler Murray, QB (Oklahoma) Kyler Murray will replace Josh Rosen as the starting QB in Arizona Getty Images for SiriusXM 3/33 1.02 San Francisco 49ers: Nick Bosa, edge (Ohio state) Nick Bosa missed his senior season at Ohio State but shone at the Combine Getty 4/33 1.03 New York Jets: Quinnen Williams, DT (Alabama) Quinnen Williams is a highly-rated defensive prospect Getty 5/33 1.04 Oakland Raiders: Clelin Ferrell, edge (Clemson) Clelin Ferrell is an elite edge rusher Getty 6/33 1.05 Tampa Bay Buccaneers: Devin White, linebacker (LSU) Devin White of LSU was a tackling machine in college Getty 7/33 1.06 New York Giants: Daniel Jones, QB (Duke) Daniel Jones of Duke is a well-considered QB talent who may lack arm strength Getty 8/33 1.07 Jacksonville Jaguars: Josh Allen, edge (Kentucky) Josh Allen of Kentucky is a highly-rated defensive end Getty 9/33 1.08 Detroit Lions: TJ Hockenson, TE (Iowa) TJ Hockenson of Iowa is considered one of the best tight ends in years TJ Hockenson of Iowa is considered one of the best tight ends in years 10/33 1.09: Buffalo Bills Ed Oliver, DT (Houston) Ed Oliver is a freak athlete and a disruptive interior lineman Getty 11/33 1.10 Pittsburgh Steelers (from Denver Broncos): Devin Bush, linebacker (Michigan) Devin Bush of Michigan is a sideline-to-sideline linebacker who will start from week 1 Getty 12/33 1.11 Houston Texans: Jonah Williams, offensive tackle (Alabama) Jonah Williams played offensive tackle in college but may be a guard at NFL level Getty 13/33 1.12 Miami Dolphins: Rashan Gary, edge (Michigan) Rashan Gary is one of a pack of talented edge rushers this year Getty Images 14/33 1.13 Miami Dolphins: Christian Wilkins, DT (Clemson) Christian Wilkins helped Clemson to a College championship Getty 15/33 1.14 Atlanta Falcons: Chris Lindstrom, G, Boston Lindstrom was a surprise pick at 14 Getty Images 16/33 1.15 Washington Redskins: Dwayne Haskins, QB (Ohio State) Dwayne Haskins shone in his sole season as a starter at Ohio State Getty Images 17/33 1.16 Carolina Panthers: Brian Burns, edge (Florida State) Brian Burns (99) is an undersized pass rusher who blows away people with speed Getty 18/33 1.17 New York Giants: Dexter Lawrence, DT (Clemson) Dexter Lawrence failed a drugs test in 2018 Getty 19/33 1.18 Minnesota Vikings: Garrett Bradbury, G/C (NC State) Garrett Bradbury is considered one of the top interior linemen in the draft Getty 20/33 1.19 Tennessee Titans: Jeffery Simmons, DT (Mississippi State) Jeffery Simmons would have been a top-10 pick if he hadn't injured his knee in February Getty 21/33 1.20 Denver Broncos (from Pittsburgh Steelers): Noah Fant, tight end (Iowa) Noah Fant is very good receiving tight end in a strong class at the position Getty 22/33 1.21 Green Bay Packers (from Seattle Seahawks): Darnell Savage, S, Maryland Savage should boost the Packers offense Getty Images 23/33 1.22 Philadelphia Eagles (from Baltimore Ravens): Andre Dillard, T, Washington State Andre Dillard is one of the best offensive tackles Getty 24/33 1.23 Houston Texans: Tytus Howard, OT, Alabama State Howard is an essential upgrade for the Texans Getty Images 25/33 1.24: Oakland Raiders: Josh Jacobs, running back (Alabama) Josh Jacobs is the first running back taken in the 2019 draft Getty 26/33 1.25 Baltimore Ravens (from Philadelphia Eagles): Marquise Brown, WR, Oklahoma Marquise Brown is the most explosive receiver in the draft Getty 27/33 1.26 Washington Redskins (from Indianapolis Colts): Montez Sweat, LB, Mississippi State Montez Sweat shone at the Combine and is one of the most athletic prospects Getty 28/33 1.27 Oakland Raiders: Johnathan Abram, S, Mississippi State The Raiders completed their first round with Abram AP 29/33 1.28 Los Angeles Chargers: Jerry Tillery, DT, Notre Dame The Chargers added another piece to a stacked roster Getty Images 30/33 1.29 Seattle Seahawks: TJ Collier, DE, TCU Seattle had an eventful first round Getty Images 31/33 1.30 New York Giants (from Seattle Seahawks (from Green Bay Packers)): Deandre Baker, CB, Georgia Deandre Baker of Georgia is one of the best defensive backs this year Getty 32/33 1.31 Atlanta Falcons (from Los Angeles Rams): Kaleb McGary, T, Washington McGary will boost the Falcons' offense Getty Images 33/33 1.32 New England Patriots: N'Keal Harry, WR, Arizona State Harry was a surprise pick by the Patriots but will boost Tom Brady Getty Images 1/33 NFL Draft 2019: First Round Getty Images 2/33 1.01 Arizona Cardinals: Kyler Murray, QB (Oklahoma) Kyler Murray will replace Josh Rosen as the starting QB in Arizona Getty Images for SiriusXM 3/33 1.02 San Francisco 49ers: Nick Bosa, edge (Ohio state) Nick Bosa missed his senior season at Ohio State but shone at the Combine Getty 4/33 1.03 New York Jets: Quinnen Williams, DT (Alabama) Quinnen Williams is a highly-rated defensive prospect Getty 5/33 1.04 Oakland Raiders: Clelin Ferrell, edge (Clemson) Clelin Ferrell is an elite edge rusher Getty 6/33 1.05 Tampa Bay Buccaneers: Devin White, linebacker (LSU) Devin White of LSU was a tackling machine in college Getty 7/33 1.06 New York Giants: Daniel Jones, QB (Duke) Daniel Jones of Duke is a well-considered QB talent who may lack arm strength Getty 8/33 1.07 Jacksonville Jaguars: Josh Allen, edge (Kentucky) Josh Allen of Kentucky is a highly-rated defensive end Getty 9/33 1.08 Detroit Lions: TJ Hockenson, TE (Iowa) TJ Hockenson of Iowa is considered one of the best tight ends in years TJ Hockenson of Iowa is considered one of the best tight ends in years 10/33 1.09: Buffalo Bills Ed Oliver, DT (Houston) Ed Oliver is a freak athlete and a disruptive interior lineman Getty 11/33 1.10 Pittsburgh Steelers (from Denver Broncos): Devin Bush, linebacker (Michigan) Devin Bush of Michigan is a sideline-to-sideline linebacker who will start from week 1 Getty 12/33 1.11 Houston Texans: Jonah Williams, offensive tackle (Alabama) Jonah Williams played offensive tackle in college but may be a guard at NFL level Getty 13/33 1.12 Miami Dolphins: Rashan Gary, edge (Michigan) Rashan Gary is one of a pack of talented edge rushers this year Getty Images 14/33 1.13 Miami Dolphins: Christian Wilkins, DT (Clemson) Christian Wilkins helped Clemson to a College championship Getty 15/33 1.14 Atlanta Falcons: Chris Lindstrom, G, Boston Lindstrom was a surprise pick at 14 Getty Images 16/33 1.15 Washington Redskins: Dwayne Haskins, QB (Ohio State) Dwayne Haskins shone in his sole season as a starter at Ohio State Getty Images 17/33 1.16 Carolina Panthers: Brian Burns, edge (Florida State) Brian Burns (99) is an undersized pass rusher who blows away people with speed Getty 18/33 1.17 New York Giants: Dexter Lawrence, DT (Clemson) Dexter Lawrence failed a drugs test in 2018 Getty 19/33 1.18 Minnesota Vikings: Garrett Bradbury, G/C (NC State) Garrett Bradbury is considered one of the top interior linemen in the draft Getty 20/33 1.19 Tennessee Titans: Jeffery Simmons, DT (Mississippi State) Jeffery Simmons would have been a top-10 pick if he hadn't injured his knee in February Getty 21/33 1.20 Denver Broncos (from Pittsburgh Steelers): Noah Fant, tight end (Iowa) Noah Fant is very good receiving tight end in a strong class at the position Getty 22/33 1.21 Green Bay Packers (from Seattle Seahawks): Darnell Savage, S, Maryland Savage should boost the Packers offense Getty Images 23/33 1.22 Philadelphia Eagles (from Baltimore Ravens): Andre Dillard, T, Washington State Andre Dillard is one of the best offensive tackles Getty 24/33 1.23 Houston Texans: Tytus Howard, OT, Alabama State Howard is an essential upgrade for the Texans Getty Images 25/33 1.24: Oakland Raiders: Josh Jacobs, running back (Alabama) Josh Jacobs is the first running back taken in the 2019 draft Getty 26/33 1.25 Baltimore Ravens (from Philadelphia Eagles): Marquise Brown, WR, Oklahoma Marquise Brown is the most explosive receiver in the draft Getty 27/33 1.26 Washington Redskins (from Indianapolis Colts): Montez Sweat, LB, Mississippi State Montez Sweat shone at the Combine and is one of the most athletic prospects Getty 28/33 1.27 Oakland Raiders: Johnathan Abram, S, Mississippi State The Raiders completed their first round with Abram AP 29/33 1.28 Los Angeles Chargers: Jerry Tillery, DT, Notre Dame The Chargers added another piece to a stacked roster Getty Images 30/33 1.29 Seattle Seahawks: TJ Collier, DE, TCU Seattle had an eventful first round Getty Images 31/33 1.30 New York Giants (from Seattle Seahawks (from Green Bay Packers)): Deandre Baker, CB, Georgia Deandre Baker of Georgia is one of the best defensive backs this year Getty 32/33 1.31 Atlanta Falcons (from Los Angeles Rams): Kaleb McGary, T, Washington McGary will boost the Falcons' offense Getty Images 33/33 1.32 New England Patriots: N'Keal Harry, WR, Arizona State Harry was a surprise pick by the Patriots but will boost Tom Brady Getty Images\n\nThe Bills also cut Wade's fellow running back LeSean McCoy in a more surprising move, with the intent to hand rookie Devin Singletary more opportunities.\n\nWade could yet return to the Bills if he clears Waivers, with the NFL's International Player Pathway programme ensuring he could join Buffalo's 10-man practice squad, which seems probable at this stage.\n\nWade would then train with the Bills and remain eligible to play for them or join another NFL team.\n\nHe could also be named as the Bills' exempt 11th member, restricting him to only training with the Bills and preventing him from signing for another NFL franchise.", "description": "Former England rugby international Christian Wade has been cut from the Buffalo Bills' 53-man squad for the upcoming NFL season. The 28-year-old walked away from Premiership side Wasps in a bid to make it in the NFL last October, and has enjoyed a promising pre-season with the Bills.", "authors": ["Jack Rathborn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/15/16/Wade-celebrates-his-65-yard-touchdown.jpg"}