{"pub": "mirror", "url": "https://mirror.co.uk/3am/chloe-madeley-strips-down-thong-20714845", "downloaded_at": "2019-10-24 14:16:25.775139+00:00", "title": "Chloe Madeley strips down to a thong as she flaunts peachy gym-honed bum", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nChloe Madeley stripped off to show her Instagram followers her peachy posterior on Thursday.\n\nThe personal trainer, 32, flaunted her gym-honed physique by modelling a tiny black thong and pink sports bra as she revealed that her perky bottom has \"been a long time in the making.\"\n\nThe envy-inducing picture saw Chloe - daughter of TV legends Richard Madeley and Judy Finnigan - raising one arm above her head as she posed in the mirror selfie she took on her mobile phone.\n\nOver the image she penned a lengthy message about her fitness journey.\n\nShe wrote: \"If you follow for the nudes, here’s my a**.\n\n\"This has been a long time in the making, but as I said last week, if you are quad dominant like me, focus more on exercises like hip thrusts abductors kick backs.\n\n(Image: Instagram)\n\n\"Squatting doesn’t grow EVERYONE an a**.\"\n\nThe blonde beauty also shared her regime in the caption, as she listed the exercises she does to keep her bottom in shape.\n\n\"#SheSquats unfortunately, it’s not that simple.\n\n\"1. Hip thrusts (and glute bridge holds) 2. Abductors 3. Kick backs\n\n\"Might be better for you.\n\n(Image: Dave Benett/Getty Images)\n\n\"Ranges of: 3-4sets 8-15 reps\n\n\"FATIGUE THE GLUTES BY THE FINAL 2-3 REPS AND PUSH TO THE END!\"\n\nIt comes after Chloe wed rugby star James Haskell last Christmas.\n\nSince wedding the hunk, Chloe has dropped the Madeley name in everything but her showbiz life.\n\n(Image: Ken McKay/ITV/REX/Shutterstock)\n\n(Image: Instagram)\n\nShe shared on an appearance on Loose Women that her name will still appear on any new books or when she appears on TV shows, however in every other part of her life she will go traditional and instead, be known as Chloe Haskell.\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033", "description": "The personal trainer and nutritionist shared the fruits of her labour with a racy snap on Instagram", "authors": ["Sara-Aisha Kent", "Image", "Instagram", "Dave Benett Getty Images", "Ken Mckay Itv Rex Shutterstock"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20714829.ece/ALTERNATES/s1200/0_British-Book-Awards-2018.jpg", "published_at": "2019-10-24"}