{"pub": "cbc", "url": "https://cbc.ca/news/canada/british-columbia/uk-tourists-arrested-entering-us-illegally-1.5321656", "downloaded_at": "2019-10-16 05:10:12.491160+00:00", "title": "U.K. tourists arrested after driving through B.C. ditch into Washington state | CBC News", "language": "en", "text": "A family of seven from the United Kingdom was arrested in Washington state earlier this month after entering the country illegally from B.C. by driving through a ditch.\n\nU.S. Customs and Border Protection said in a statement that the vehicle was seen on surveillance video turning west onto Zero Avenue in B.C. at 9 p.m. on Oct. 2.\n\nThe vehicle then turned south and \"slowly and deliberately\" drove through a ditch onto Boundary Road in Blaine, Wash., Customs and Border Protection spokeswoman Stephanie Malin said in an email.\n\nA couple and their three-month old baby, along with two adults and their twin daughters were in the vehicle, according to the lawyer representing the family.\n\nIn a sworn statement shared by their lawyer, the family says they made a \"brief detour\" onto an unmarked road while trying to avoid an animal.\n\nThe vehicle was pulled over by border patrol agents and the four adults and three children — all U.K. citizens — were arrested. It's a moment the vacationing couple says turned into \"the scariest experience of our lives,\" according to a complaint the couple filed with the U.S. government.\n\nBut Malin said in her emailed response two of the adults had previously been denied entry into the U.S.\n\nU.S. Customs and Border Protection officials say they tried to return the group to Canada, but they were refused re-entry. After two unsuccessful attempts to contact the U.K. consulate, the group was turned over to U.S. Immigration and Customs Enforcement (ICE).\n\nICE confirmed the identities of two of the people as Eileen and David Connors, parents of the three-month-old baby.\n\nThe sworn statement says they were separated and taken to different locations in Seattle, Wash. The following day the Connorses, along with the rest of the family, were moved across the country to the Berks Family Residential Center, a detention facility in Pennsylvania.\n\n'Treated like animals'\n\nThe statement said the cells were frigid with no plans to turn the heat on until the end of next month. They claim staff provided blankets that smelled \"like dead dog.\" Eileen Connors also claimed her baby's formula was confiscated for three days.\n\n\"We will be traumatized for the rest of our lives by what the United States government has done to us,\" said Eileen Connors in the document provided by her lawyer.\n\n\"We have been treated like criminals here, stripped of our rights and lied to.\"\n\nBut ICE calls the allegations \"unequivocally false,\" adding the centre where the family is being held provides a safe and humane environment for families.\n\nThe family has been in custody since Oct. 3.\n\nDemanding immediate release\n\nIn a complaint filed with the Office of Civil Rights and Civil Liberties, the lawyer representing the families calls for their immediate release.\n\n\"Both ICE and CBP have repeatedly shown a failure to provide adequate care to children in its custody,\" reads the statement.\n\nEileen Connors says in the complaint there were no proper sleeping facilities, forcing her and her baby to sleep on the floor.\n\n\"[Tuesday] morning, the baby woke up with a swollen, teary eye, his skin is rough and blotchy,\" the complaint added.\n\nProcess could take weeks\n\nLen Saunders, an immigration lawyer based in Blaine, Wash., says if someone accidentally crosses the border, officials will often try to send them back.\n\nIt could takes weeks to months to work through the process of deporting a group back to the U.K., he added.\n\n\"At these facilities, there's immigration judges. The whole system is backlogged,\" Saunders said.\n\n\"They may not be back in the U.K. ... until the New Year.\"", "description": "A family of seven from the United Kingdom was arrested in Washington state earlier this month after entering the country illegally from B.C. by driving through a ditch.", "authors": [], "top_image": "https://i.cbc.ca/1.5322150.1571189188!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/eileen-and-david-connors.jpg", "published_at": "2019-10-15"}