{"pub": "cbs", "url": "https://cbsnews.com/news/indonesia-earthquake-today-island-ambon-maluku-province-deadly-quake-latest-updates-2019-09-26", "downloaded_at": "2019-09-26 20:51:37.427696+00:00", "title": "Magnitude 6.5 earthquake kills at least 20 in Indonesia", "language": "en", "text": "Concrete rubble is shown on the floor of a classroom in Ambon, Maluku province, Indonesia, on Thursday, September 26, 2019. Social Media via Reuters\n\nA strong earthquake Thursday killed at least 20 people and damaged a bridge, a hospital and other buildings on one of Indonesia's less populated islands. Parts of a building at an Islamic university collapsed in Ambon, the capital of Maluku province. Local disaster official Albert Simaela said a teacher was killed there when parts of the building fell on her.\n\nSimaela said a main hospital in Ambon was damaged and patients were evacuated to tents in the hospital's yard.\n\nNational Disaster Mitigation Agency spokesman Agus Wibowo said at least 19 others were killed and more than 2,000 people took refuge in various shelters.\n\nThe magnitude 6.5 quake was centered 20.5 miles northeast of Ambon at a depth of 11 miles, the U.S. Geological Survey said.\n\nA look at the earthquake's epicenter. U.S. Geological Survey\n\nRahmat Triyono, head of Indonesia's earthquake and tsunami center, said the inland earthquake did not have the potential to cause a tsunami, but witnesses told television stations that people along coastal areas ran to higher ground in fear one might occur.\n\nSimaela said many people drove to higher ground by motorbike and car, causing traffic congestion in Ambon.\n\n\"The temblor was so strong, causing us to pour into the streets,\" said Musa, an Ambon resident who uses a single name. He said there were no injuries or damage in his neighborhood, but that people on social media reported damage elsewhere in the city.\n\nA damaged traditional market building is pictured following an earthquake in Ambon, Maluku province, on Thursday, September 26, 2019. Reuters\n\nThe national disaster mitigation agency said the quake caused cracks in a main bridge in Ambon, and pictures released by the agency showed minor damage at Pattimura University in the city. Several houses, universities and local government offices were also damaged.\n\nWith a population of around 1.7 million, Maluku is one of Indonesia's least populous provinces.\n\nIndonesia, home to more than 260 million people, has frequent seismic activity.\n\nThursday's earthquake came two days ahead of the first anniversary of a devastating 7.5 magnitude earthquake in Palu on Sulawesi island. The temblor set off a tsunami as well as a phenomenon called liquefaction in which wet soil is collapsed by the shaking. The disaster claimed more than 4,000 lives, many of the victims buried when whole neighborhoods were swallowed in the falling ground.\n\nA powerful Indian Ocean quake and tsunami in 2004 killed 230,000 people in a dozen countries, most of them in Indonesia.", "description": "A bridge, hospital and other buildings on one of Indonesia's less populated islands were damaged and thousands took refuge in shelters", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/26/d6a61b34-d978-4dd3-9dc2-59b6367bf914/thumbnail/1200x630/9c199c50740e15ab1acbe2399bad0e07/rtx74nm2.jpg", "published_at": "2019-09-26"}