{"pub": "cbc", "url": "https://cbc.ca/radio/day6/the-trouble-with-campaigns-the-testaments-impeach-o-meter-indigenous-theatre-iran-s-blue-girl-and-more-1.5281102/sahar-khodayari-wanted-to-watch-a-soccer-match-now-her-death-could-spark-change-for-women-in-iran-1.5281111", "downloaded_at": "2019-09-17 23:28:35.540666+00:00", "title": "CBC Radio", "language": "en", "text": "The death of Sahar Khodayari, who defied a ban on women at sports stadiums in Iran, could be a catalyst for gender equality in Iran, says activist Jasmin Ramsey.\n\n\"Her name has become a rallying call for women throughout Iran and around the world to demand that Iran lift this discriminatory ban,\" said Ramsey, an Iran-born activist with the U.S.-based Center for Human Rights in Iran.\n\nKhodayari was detained in March 2019 after disguising herself as a man to attend a soccer game in Tehran.\n\nAccording to semi-official news sources reported by the Associated Press , she set herself on fire after learning she could be sentenced to six months in prison. But Ramsey cautions that the circumstances around her death are unclear as little information has been released.\n\nThe soccer fan became known as the \"Blue Girl\" for her favourite team's distinctive light blue kit.\n\nHer death spawned a social media movement with soccer fans and stars alike calling on Iran to end a ban on women in stadiums using the hashtag #BlueGirl.\n\nIran’s top football team holds a minute of silence before training, in honor of their fan <a href=\"https://twitter.com/hashtag/BlueGirl?src=hash&ref_src=twsrc%5Etfw\">#BlueGirl</a> who set herself on fire and died, after she was arrested for trying to enter the stadium dressed as a boy.<a href=\"https://t.co/GROlKfcQRx\">pic.twitter.com/GROlKfcQRx</a> —@NegarMortazavi\n\n\"Even though there is a definite risk if you're a public prominent figure, for example, to speak out against controversial state policies, many men have been speaking out,\" Ramsey told Day 6 host Brent Bambury.\n\n\"It is them that can really help this women's movement that's been forged by women for the last four decades.\"\n\nFIFA influence\n\nReligious and conservative opponents to gender equality in stadiums have argued that sports could corrupt women's minds. They also cite a lack of facilities, including washrooms and womens-only sections, as the reasons behind the ban.\n\n\"There is no specific law that bans women from entering stadiums but women are constantly being arrested and detained,\" Ramsey explained.\n\n\"In a few cases, [they are] prosecuted and sentenced to prison under national security charges.\"\n\nIt's just a really tragic and so senseless that she had to die this way over a ban that is not even supported by a law. - Jasmin Ramsey, activist\n\nYet, it's not uncommon for women to disguise themselves in order to enter stadiums.\n\n\"They [Iranian authorities and supporters of the ban] don't address the fact that many, many women over the years have actually still gone to these stadiums, snuck in disguised as men and have walked out just fine,\" said Ramsey.\n\nFIFA is pressuring Iranian authorities to end the ban ahead of an Oct. 10 World Cup qualifying match in Tehran.\n\n\"There's been a lot of momentum over the last two years for Iran to come into compliance with FIFA statutes that completely forbid discrimination against participating teams,\" Ramsey said.\n\nIran has lifted the ban previously, but only partially, Ramsey adds.\n\n\"For example, [authorities may let in] the wives or family members of team members or just allow a certain number of tickets to go to female fans to ward off international criticism.\"\n\n\"Then, when the spotlight is off, the ban is back in place.\"\n\nGrowing backlash\n\nRamsey believes that Khodayari's death could put pressure on FIFA to ensure the ban remains lifted beyond the Oct. 10 game — and soccer stars have taken to social media in support.\n\nFormer Bayern Munich midfielder Ali Karimi — who played 127 matches for Iran and has been a vocal advocate of ending the ban on women — urged Iranians in a tweet to boycott soccer stadiums to protest Khodayari's death.\n\nStill, Ramsey believes that positive change could come from the growing backlash.\n\n\"It's just a really tragic and so senseless that she had to die this way over a ban that is not even supported by a law … it's long past due for the Iranian government to start listening to its people and look at the human costs of this discriminatory policy,\" Ramsey said.\n\nWith files from the Associated Press. To hear the full interview, download our podcast or click Listen above.", "description": "Sahar Khodayari died after setting herself on fire outside a courthouse in Tehran. She had been arrested for trying to get in to a stadium to watch her favourite soccer team, which women are banned from doing. Human rights activist Jasmin Ramsey says outrage over her death could spark change for Iranian women.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5278352.1568148956!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/self-immolation-091019.jpg", "published_at": "2019-09-14"}