{"pub": "businessinsider", "url": "https://businessinsider.com/amazon-is-drafting-laws-for-congress-to-regulate-facial-recognition-2019-9", "downloaded_at": "2019-09-26 16:43:28.457690+00:00", "title": "Amazon wants Congress to regulate its facial-recognition technology, but with laws it drafted", "language": "en", "text": "Jeff Bezos announced that Amazon will put forward drafts of laws to regulate facial recognition, a technology that the company is already developing and selling to police and private companies.\n\n\"Our public policy team is actually working on facial-recognition regulations, and it makes a lot of sense to regulate that,\" Bezos said in response to a reporter's question at Amazon's Alexa devices launch in Seattle on Wednesday.\n\n\"It's a perfect example of something that has really positive uses, so you don't want to put the brakes on it. At the same time, there's lots of potential for abuses with that kind of technology, and so you do want regulations,\" he added.\n\nThe tech giant has its own brand of facial-recognition software, Amazon Rekognition, which it sells to law enforcement agencies like police and ICE. Privacy advocates have criticized the technology, arguing that it's invasive and could be misused by government agencies.\n\nRekognition represents a slice of Amazon's growing investment in its cloud-computing unit. The tech giant controls roughly 47.8% of the $32 billion web services market, analysts said.\n\nLast year, the ACLU said it ran photos of members of Congress through Rekognition, which incorrectly matched 28 of the lawmakers with convicted criminals (Amazon said the ACLU was using the technology incorrectly).\n\nAmazon's own staff have also voiced discomfort with the company's law-enforcement contracts. Earlier this summer, hundreds of Amazon employees called out the practice and urged the company to stop selling Rekognition to agencies like ICE.\n\nThe Amazon public policy team regularly drafts versions of regulations the company would like to see and pitches them to lawmakers. Bezos's surprise announcement Wednesday follows a statement last month by Andy Jassy, Amazon's CEO of Web Services, looking forward to federal regulation of facial-recognition tech.\n\nThe proposed regulations could be an effort to preempt more aggressive federal restrictions on Amazon. Some progressives, including Democratic presidential candidate Bernie Sanders, have called for a ban on the use of facial recognition by law enforcement, and in May, San Francisco became the first city to enact such a ban.\n\nMeanwhile, Amazon faces an ongoing federal antitrust investigation from the Federal Trade Commission.\n\nPrivacy advocates have already cast doubt on whether Amazon's proposed laws will be adequate regulations.\n\n\"It's a welcome sign that Amazon is finally acknowledging the dangers of face surveillance. But we've seen this playbook before. Once companies realize that people are demanding strong privacy protections, they sweep in, pushing weak rules that won't protect consumer privacy and rights,\" ACLU Northern CA Attorney Jacob Snow said in a statement to Recode.\n\nAmazon did not immediately respond to Business Insider's request for comment.", "description": "Amazon will put forward drafts of laws to regulate facial recognition, which the company sells to police and private companies.", "authors": ["Aaron Holmes"], "top_image": "https://amp.businessinsider.com/images/5d7fc1402e22af21be560fbc-2732-1366.jpg", "published_at": "2019-09-26"}