{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/afp/article-7587869/Hundreds-protest-second-day-against-Lebanon-austerity.html", "downloaded_at": "2019-10-18 10:39:48.304057+00:00", "title": "Hundreds protest for second day against Lebanon austerity", "language": "en", "text": "Lebanese demonstrators have been angered by an austerity budget the government passed in July which requires a raft of tax increases to trim a ballooning deficit\n\nHundreds of protesters blocked major highways in Lebanon Friday, after thousands angry at proposed tax increases thronged the streets overnight demanding the government's resignation in the largest demonstrations in years.\n\nPublic anger has simmered since parliament passed an austerity budget in July to help trim a ballooning deficit and flared on Thursday over plans to tax calls on messaging applications such as Whatsapp, prompting the government to withdraw the deeply unpopular proposal.\n\nThe government is weighing a raft of new belt-tightening measures it hopes will shore up its finances and secure the disbursement of $11 billion in aid pledged by international donors last year.\n\nIt is expected to announce a series of new taxes as part of next year's budget, which is currently being drawn by ministers.\n\nOn Friday morning, charred refuse bins, torched tyres, broken street signs and shattered glass from damaged storefronts littered the streets of central Beirut -- the scene of violent confrontations between security forces and protesters overnight.\n\nThe government announced the cancellation of a planned cabinet meeting as protesters gathered for a second day, the state-run National News Agency reported.\n\nBut Prime Minister Saad Hariri was expected to deliver a speech later in the day.\n\nBanks, state institutions, schools and universities were closed as protesters blocked key highways connecting the capital to the rest of the country with burning tyres.\n\nAn AFP correspondent said demonstrators cut the main road to Beirut airport for a second straight day.\n\nThe overnight demonstrations which rocked the capital Beirut and other cities were Lebanon's largest in years\n\nInterior Minister Raya al-Hassan warned protesters \"against damaging public and private property and blocking roads.\"\n\nSecurity forces will take necessary measures to protect the safety of civilians and their property, she said on Twitter Friday.\n\n- Tax on Whatsapp calls -\n\nDozens gathered near government headquarters in central Beirut, screaming anti-government slogans and denouncing dire living conditions in a country with one of the highest debt to GDP ratios in the world.\n\nA convoy of motorcycles drove towards the interior ministry, followed by dozens of protesters on foot, who chanted the popular refrain of the Arab Spring protests of 2011: \"The people demand the fall of the regime.\"\n\nProtesters also gathered in the southern city of Sidon and in several towns in the east and north. Their numbers were expected to swell though the day.\n\nDemonstrations erupted across the country late on Thursday after the government announced a $0.20 tax on the huge number of calls made on messaging applications.\n\nThe deputh of public anger prompted the Lebanese government to swiftly withdraw unpopular plans for a $0.20 tax on the huge number of calls made on messaging applications like Whatsapp\n\nThey are the largest since a 2015 refuse collection crisis sparked widespread anti-government protests.\n\nThey come at a time of deep divisions within the government over a raft of issues, including not only the economic reform package, but also the allocation of public sector positions and rapprochement with the resurgent Syrian government.\n\nIn central Beirut, rioting continued into the early hours of Friday.\n\nSecurity forces finally dispersed the demonstrators shortly before dawn, firing volleys of tear gas and rubber bullets after they tried to storm government headquarters.\n\nThe clashes wounded at least 23 protesters, according to the Red Cross, and 60 security force personnel, according to police.\n\nNNA said two foreign workers choked to death early Friday after they were trapped in a building set alight by rioters.\n\nOther reports said the two men were Syrian.\n\nGrowth in Lebanon has plummeted in the face of repeated political deadlock in recent years, compounded by the impact of eight years of war in neighbouring Syria.\n\n\"Most high-frequency indicators point towards a continuation of weak growth in 2019,\" the International Monetary Fund said Thursday.\n\nLebanon's public debt stands at around $86 billion -- more than 150 percent of gross domestic product -- according to the finance ministry.\n\nEighty percent of that figure is owed to Lebanon's central bank and local banks.\n\nLast month, banks and money exchange houses rationed dollar sales, sparking fears of a devaluation of the Lebanese pound.", "description": "Hundreds of protesters blocked major highways in Lebanon Friday, after thousands angry at proposed tax increases thronged the streets overnight demanding the...", "authors": [], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/11/wire-19879548-1571394176-743_636x382.jpg", "published_at": "2019-10-18"}