{"pub": "thehill", "url": "https://thehill.com/policy/finance/465770-trump-hypes-china-trade-deal-as-new-doubts-emerge", "downloaded_at": "2019-10-15 00:02:51.896518+00:00", "title": "Trump hypes China trade deal as new doubts emerge", "language": "en", "text": "President Trump Donald John TrumpWHCA calls on Trump to denounce video depicting him shooting media outlets Video of fake Trump shooting members of media shown at his Miami resort: report Trump hits Fox News's Chris Wallace over Ukraine coverage MORE is touting an initial deal with China as a major victory for his trade agenda despite growing skepticism over the scope and status of the agreement.\n\nThe pending deal outlined Friday would postpone an upcoming increase of tariffs on Chinese goods in exchange for Beijing drastically increasing imports of American crops. The agreement is meant to provide a brief economic reprieve for both nations as they seek out a broader deal.\n\nTrump has been quick to boast about scoring a major victory for “great patriot farmers & ranchers.” The president tweeted that a “Phase One” deal with China can be “finalized & signed soon” during a potential November meeting with Chinese President Xi Jinping.\n\nADVERTISEMENT\n\nBut Washington and Wall Street are reacting with caution to the announcement, following signals from Beijing that it still needs time to finalize the terms and amid criticism that the limited agreement does not touch on many of Trump’s top priorities for a broader trade deal.\n\nThe trade pact, announced Friday, would freeze a planned increase of tariffs on $250 billion in Chinese goods from 25 percent to 30 percent. But it doesn’t address another round of tariffs on $160 billion in Chinese-made consumer goods scheduled for December.\n\n“The Chinese don’t want Xi to move forward with this initial phase or this initial detente if they don’t get rid of the December tariff threat as well,” said Stephen Myrow, managing partner at Beacon Policy Advisors. “No matter what they sign, they don’t really trust Trump.”\n\nThe deal’s most concrete achievement was Trump’s decision to scrap the planned tariff increase which was scheduled to take effect Tuesday. In return, China promised to purchase $40 billion to $50 billion worth of U.S. agriculture, as well as aircraft purchases from Boeing.\n\nTrade watchers note, though, that that portion of the deal has not been signed or finalized, and China has previously retreated from similar promises.\n\nThe administration has also touted progress on issues such as financial regulation and currency. But while the deal marked at least a temporary truce, it also put off many of the most controversial issues, including technology transfers, intellectual property issues and scaling back the tariffs that have built up since the trade war began last summer.\n\nThose lingering concerns have some questioning whether Trump can follow through and finalize a trade deal before the 2020 election, despite the administration’s public enthusiasm.\n\nThe limited nature of the deal, and the fact that its final details remain in flux even after the Friday announcement, has drawn criticism.\n\n“I don’t think this is a big deal,” said Larry Summer, who served as Treasury secretary under President Clinton, in a CNBC interview Monday.\n\n“The agreement may well close, but I don’t think it will address the fundamental overhang of tension and uncertainty that’s been created in the U.S.-China relationship and will inhibit spending plans, business investment on both sides of the Pacific,” he added.\n\n“Although eliminating, or delaying, near-term tariff hikes is a positive development, we do not believe that this limited agreement materially reduces the fundamental uncertainties regarding the US-China economic relationship,” said an analysis by Japanese financial services firm Nomura.\n\nThere have also been signs of caution from China, raising concerns that Trump and Xi may not meet in November to cement even this minor truce before more tariffs kick in.\n\nBloomberg News reported on Monday that China is waiting on further negotiations to finalize the phase one deal announced Friday and may wait until Trump commits to scrapping the new round of tariffs scheduled to go into effect in December.\n\nTreasury Secretary Steven Mnuchin Steven Terner MnuchinFurious Republicans prepare to rebuke Trump on Syria White House officials stand by Syria withdrawal, sanctions delay amid bipartisan pushback Trump: Treasury 'ready to go' on sanctions against Turkey: 'Stay tuned' MORE has admitted that the deal could still fall apart, but he also downplayed that likelihood.\n\n“There are still some issues that need to be worked out in wording,” he said in a Monday CNBC interview, when asked about enforcement and the specifics of China’s promises to buy American agricultural goods.\n\n“But I would say we have every expectation that phase one will close,” he added.\n\nThe danger for the administration is that additional delays in trade talks will further undercut Trump’s leverage as the 2020 election takes over.\n\nTrump has already imposed tariffs on more than half of all U.S. imports from China, but the levies slated for December threaten to hit American consumers hard.\n\nTrump initially planned to impose 15 percent tariffs on more than $300 billion in Chinese products on Sept. 1, then exempted a $160 billion tranche of consumer goods from the new taxes until Dec. 15.\n\nEconomists say those tariffs on Chinese-made clothes, footwear, toys, laptops and other consumer technology would pose the most direct financial threat to U.S. households — and the economy’s resilience.\n\n“He is very unpredictable, and just because you don’t get tariffs now, it doesn’t ensure that you don’t get tariffs down the road,” Myrow said. “I think that’s what the Chinese are scared about, and I think that’s what the markets are concerned about.”\n\nEven so, Myrow added that Trump’s eagerness to strike a deal highlights the high stakes for the president.\n\nTrump’s success in the 2020 election could hinge on the state of the American economy, which has long been his most enticing pitch to swing voters. The president must also repeat his 2016 victories in Ohio, Michigan, Pennsylvania and Wisconsin, where his hawkish stance on China plays well, but the trade war has taken a toll on industrial communities.\n\nIf Trump can defy the odds and secure an elusive deal with China, the victory could reassure an anxious U.S. business sector and rally his base before the election. But if negotiations collapse, the fallout could derail the economy and squander Trump’s trade agenda.\n\nTrump’s previous tariffs have already imposed steep costs on businesses and manufacturers facing higher prices and lower global demand. And the president’s trade policy — along with a global economic slump — have frozen business investment and dampened U.S. exports.\n\nThe U.S. still boasts a 3.5 percent unemployment rate, but that could be threatened by more trade uncertainty.\n\nAnd investors are showing caution.\n\n“We continue to expect US-China trade tensions to reemerge as non-trade issues worsen and the two sides fail to make real progress on fundamental differences,” the Nomura analysis predicted.\n\n“The US economy is showing strains is a lot of different factors. The one thing that’s still hanging in there is the consumer,” Myrow said.\n\n“But the more you expand the tariffs, you’re going to finally start digging in hard on the consumer.”", "description": "President Trump is touting an initial deal with China as a major victory for his trade agenda despite growing skepticism over the scope and status of the agreement.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_heliu_chinatrade_101119getty.jpg", "published_at": "2019-10-14"}