{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/stocks--techs-lead-sp-to-small-gain-3m-weighs-on-dow-2003640", "downloaded_at": "2019-10-25 00:10:40.411564+00:00", "title": "Stocks – Techs Lead S&P to Small Gain, 3M Weighs on Dow", "language": "en", "text": "© Reuters.\n\nInvesting.com - Technology stocks drove the S&P 500 and Nasdaq higher Thursday thanks to big earnings beats from key stocks, including Microsoft (NASDAQ: ) and Tesla (NASDAQ: ).\n\nThe rose 0.19%. The index added 0.81% and the index rose nearly 1%. The ended down 0.11% after falling as many as 120 points early in the session.\n\nMicrosoft, PayPal Holdings (NASDAQ: ), Tesla and Amazon.com (NASDAQ: ) were responsible for more than 40 points of the 70-point gain. The first three reported either late Wednesday or Thursday.\n\nAmazon shares, however, fell nearly 8% after hours when third-quarter earnings per share came in a $4.23. The consensus estimate from analysts tracked by Investing.com was $4.59. Worse, the EPS was the lower than a year ago and first profit decline in two years. The online retail giant had warned it was making heavy investments in being to deliver purchases to Amazon Prime customers in a little as a day. In addition, its guidance for fourth-quarter sales were lower than expected.\n\nStill, revenue was up 23.7% to $69.98 billion and ahead of the Wall Street estimate of $68.8 billion.\n\nIntel (NASDAQ: ) shares, however, jumped 8% after third-quarter earnings of $1.42 beat the estimate of $1.23.\n\nMicrosoft also added nearly 18 points to the Dow, which was held back primarily by a weak earnings report from 3M (NYSE: ).\n\nBut Twitter (NYSE: ) shares dropped nearly 21% as earnings badly missed Wall Street estimates.\n\nIt was a busy day for markets, which experienced the heaviest day of third-quarter earnings reports.\n\nIn addition, Vice President Mike Pence, in a speech today, criticized the National Basketball Association for failing to back protesters in Hong Kong. Worries that the remarks, which were a defense of the protestors, might affect the ongoing U.S.-China trade talks faded as the day went on.\n\nEconomic data, particularly and , were a little lighter than expected.\n\nNonetheless, the market tone was better that what the numbers said. No fewer than 162 stocks hit 52-week highs, including Apple (NASDAQ: ), Applied Materials (NASDAQ: ), JPMorgan Chase (NYSE: ) and recreational vehicle maker Winnebago (NYSE: ).\n\nmoved higher, as did . Interest rates were modestly higher.\n\nOrthodontics company Align Technology (NASDAQ: ), chip company Lam Research (NASDAQ: ), Auto parts retailer O’Reilly Automotive (NASDAQ: ) and chip-equipment maker Applied Materials (NASDAQ: ) were among the top S&P 500 performers on the day.\n\nTwitter (NYSE: ), marketing company Alliance Data Systems (NYSE: ), TechnipFMC (NYSE: ) and drug maker Baxter International (NYSE: ) were among the weakest S&P performers on the day.", "description": "Stocks – Techs Lead S&P to Small Gain, 3M Weighs on Dow", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC0K0XM_L.jpg", "published_at": "2019-10-24"}