{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/22/democrats-pounce-after-trump-slams-impeachment-lynching-president-white-supremacist", "downloaded_at": "2019-10-23 09:38:36.211817+00:00", "title": "Democrats Call Trump 'Despicable' After Slam of Impeachment 'Lynching'", "language": "en", "text": "Several Democrats – including a handful of 2020 candidates – lambasted President Trump for describing the Democrat-led impeachment effort as a political “lynching,” calling the president’s words “despicable and disgusting,” and accusing him of being a “white supremacist.”\n\nTrump took to Twitter on Tuesday to slam the Democrat-led impeachment effort, calling on Republicans to “remember what they are witnessing here – a lynching.”\n\n“So some day, if a Democrat becomes President and the Republicans win the House, even by a tiny margin, they can impeach the President, without due process or fairness or any legal rights. All Republicans must remember what they are witnessing here – a lynching,” Trump wrote:\n\nSo some day, if a Democrat becomes President and the Republicans win the House, even by a tiny margin, they can impeach the President, without due process or fairness or any legal rights. All Republicans must remember what they are witnessing here – a lynching. But we will WIN! — Donald J. Trump (@realDonaldTrump) October 22, 2019\n\nSen. Lindsey Graham (R-SC) echoed the president’s sentiments, blasting the Democrat-led impeachment effort as “joke,” “scam,” and “political lynching.”\n\nSen. Lindsey Graham called the House's impeachment inquiry a \"political lynching\" https://t.co/CMRql2BF2w pic.twitter.com/HRT109JMDK — CBS News (@CBSNews) October 22, 2019\n\nWhite House spokesman Hogan Gidley spoke to reporters and noted that the current impeachment process lacks “due process.”\n\nHe added, “The president’s not comparing what’s happened to him to one of the country’s darkest moments.”\n\nThe president’s description of the partisan impeachment effort as a political “lynching” drew ire from Democrats across the board, including a handful of 2020 candidates.\n\n“Lynching is a reprehensible stain on this nation’s history, as is this President,” Sen. Kamala Harris (D-CA) wrote. “We’ll never erase the pain and trauma of lynching, and to invoke that torture to whitewash your own corruption is disgraceful”:\n\nLynching is a reprehensible stain on this nation's history, as is this President. We'll never erase the pain and trauma of lynching, and to invoke that torture to whitewash your own corruption is disgraceful. https://t.co/XOlsazwwRL — Kamala Harris (@KamalaHarris) October 22, 2019\n\n“The legacy of slavery, segregation, Jim Crow, and suppression is alive and well in every part of this country—including in the White House where the president is a white supremacist,” Beto O’Rourke (D) assessed:\n\nThe legacy of slavery, segregation, Jim Crow, and suppression is alive and well in every part of this country—including in the White House where the president is a white supremacist. https://t.co/q4rCTuQRon — Beto O'Rourke (@BetoORourke) October 22, 2019\n\n“Impeachment is not ‘lynching,’ it is part of our Constitution. Our country has a dark, shameful history with lynching, and to even think about making this comparison is abhorrent,” Joe Biden (D) wrote. “It’s despicable”:\n\nImpeachment is not \"lynching,\" it is part of our Constitution. Our country has a dark, shameful history with lynching, and to even think about making this comparison is abhorrent. It's despicable. https://t.co/QcC25vhNeb — Joe Biden (@JoeBiden) October 22, 2019\n\n“It’s beyond shameful to use the word ‘lynching’ to describe being held accountable for your actions, Julián Castro (D) wrote:\n\nIt’s beyond shameful to use the word “lynching” to describe being held accountable for your actions. https://t.co/WS1yPy8CIE — Julián Castro (@JulianCastro) October 22, 2019\n\n“Lynching is an act of terror used to uphold white supremacy,” Sen. Cory Booker (D-NJ) wrote. “Try again”:\n\nLynching is an act of terror used to uphold white supremacy. Try again. pic.twitter.com/TcDR01XelB — Cory Booker (@CoryBooker) October 22, 2019\n\n“Lynching has a racist, dark past in our country’s history and was used to terrorize African Americans. To compare congressional oversight to lynching is disgusting and shameful,” Rep. Tim Ryan (D-OH) tweeted:\n\nLynching has a racist, dark past in our country's history and was used to terrorize African Americans. To compare congressional oversight to lynching is disgusting and shameful. https://t.co/ngKPFKkPDQ — Congressman Tim Ryan (@RepTimRyan) October 22, 2019\n\n“Lynching is a horrific stain on our country’s history, and it is beyond disgraceful for Donald Trump to invoke one to avoid being held accountable for his crimes,” Sen. Elizabeth Warren (D-MA) wrote.\n\n“Nobody is above the law, not even the president of the United States,” she added:\n\nLynching is a horrific stain on our country's history, and it is beyond disgraceful for Donald Trump to invoke one to avoid being held accountable for his crimes. Nobody is above the law, not even the president of the United States. — Elizabeth Warren (@ewarren) October 22, 2019\n\nThe remark drew a reaction from more than just 2020 candidates.\n\n“Haven’t even had coffee yet & the occupant of the WH, the bigoted man who called for the execution of the exonerated 5, is tossing the word ‘lynching’ around,” far-left “Squad” member Rep Ayanna Pressley wrote.\n\n“Lord give me the strength to not take the bait but hold this man accountable for every single thing he says and does,” Pressley continued:\n\nHaven’t even had coffee yet & the occupant of the WH, the bigoted man who called for the execution of the exonerated 5, is tossing the word ‘lynching’ around. Lord give me the strength to not take the bait but hold this man accountable for every single thing he says and does. — Ayanna Pressley (@AyannaPressley) October 22, 2019\n\nMore:\n\nTo call this a lynching is deeply offensive in ways you obviously don’t care about.\n\nIt’s the rule of law. Get used to it. https://t.co/VSElxQEGVh — Eric Swalwell (@ericswalwell) October 22, 2019\n\nComparing impeachment to a #lynching is one of the most despicable and disgusting things to come out of this president’s mouth and that’s really saying something. Anyone who tries to defend this remark is just as reprehensible.https://t.co/ye8GFBFON8 — Rep Frederica Wilson (@RepWilson) October 22, 2019\n\nHouse whip Jim Clyburn says this morning that Trump’s tweet comparing the impeachment inquiry to a lynching is “beneath the dignity of the office of the President of the United States.” “I happen to be a native of South Carolina… I know the historical context of that term.” — Haley Byrd (@byrdinator) October 22, 2019\n\nThousands of innocent African-Americans were murdered during the lynching epidemic. They were viciously slaughtered because of the color of their skin. The House impeachment inquiry is mandated by the Constitution. Keep. Your. Historically. Ignorant. Mouth. Shut. https://t.co/g09aukk0Uf — Hakeem Jeffries (@RepJeffries) October 22, 2019\n\nYou think this impeachment is a LYNCHING? What the hell is wrong with you? Do you know how many people who look like me have been lynched, since the inception of this country, by people who look like you. Delete this tweet. https://t.co/oTMhWo4awR — Bobby L. Rush (@RepBobbyRush) October 22, 2019\n\nNotably, House Judiciary Committee Chairman Jerry Nadler (D-NY) accused Republicans of “running a lynch mob” during Bill Clinton’s impeachment process in 1998.\n\n“I am the president’s defender in the sense that I haven’t seen anything yet that would rise, in my opinion, to the level of impeachable offense,” Nadler said at the time.\n\n“I wish we could get this over with quickly,” he continued.\n\n“In pushing the process, in pushing the arguments of fairness and due process the Republicans so far have been running a lynch mob,” he added.\n\nSimilarly, other notable Democrats, such as House Speaker Nancy Pelosi (D-CA) and Rep. Maxine Waters (D-CA), blasted Clinton’s impeachment, with Pelosi accusing Republicans of being “paralyzed with hatred” and Waters assessing that the GOP was “driven by hatred.”", "description": "Several Democrats lambasted President Trump for describing the Democrat-led impeachment effort as a political \"lynching.\"", "authors": ["Hannah Bleau"], "top_image": "https://media.breitbart.com/media/2019/10/Joe-Biden-pointing-debate-October-15-2019-getty-640x335.jpg", "published_at": "2019-10-22"}