{"pub": "nationalreview", "url": "https://nationalreview.com/news/graham-invites-giuliani-to-testify-on-ukraine-corruption", "downloaded_at": "2019-10-08 15:50:49.962280+00:00", "title": "Lindsey Graham's Rudy Giuliani Invitation -- Ukraine Corruption Testimony", "language": "en", "text": "Senator Lindsey Graham (R., S.C.) during a news conference in Ankara, Turkey, January 19, 2019. (Stringer/Reuters)\n\nSenator Lindsey Graham has invited Rudy Giuliani, President Trump’s private attorney, to testify before the Senate Judiciary Committee regarding alleged corruption in Ukraine.\n\nGraham wrote on Twitter Tuesday that after hearing about “the many improprieties surrounding the firing of former [Ukrainian] Prosecutor General Victor Shokin,” he would give Giuliani “the opportunity to come before the Senate Judiciary Committee to inform the committee of his concerns.”\n\nGiuliani has repeatedly alleged that former vice president Joe Biden and his son Hunter Biden were involved in corrupt practices in Ukraine.\n\nHunter Biden sat on the board of a Ukrainian natural gas company from 2014 to 2019. The company, Burisma Holdings, was the subject of a corruption probe led by Shokin, who was then prosecutor general of Ukraine.\n\nIn 2016, Joe Biden pressured Ukraine to fire Shokin at the urging of U.S. and European Union officials, who agreed that Shokin was himself engaged in corrupt practices.\n\nGraham had initially refused to take any action in the Senate regarding Hunter Biden’s dealings in Ukraine, saying earlier this month, “I want somebody to look at the conflict of interest outside of politics.”\n\nPresident Trump is currently the subject of an impeachment inquiry to determine if he pressured Ukrainian President Volodymyr Zelensky to investigate the allegations against the Bidens by withholding a $391 million military aid package set aside for Ukraine by Congress.\n\nGraham’s offer to Giuliani could set up a conflict between the Senate and House of Representatives, the latter of which has summoned numerous Trump administration officials to answer questions regarding the impeachment probe.", "description": "Senator Lindsey Graham has invited Rudy Giuliani to testify before the Senate Judiciary Committee regarding alleged corruption in Ukraine.", "authors": ["Zachary Evans", "Andrew C. Mccarthy", "Kevin D. Williamson", "John Mccormack", "John Fund", "Brian Stewart", "George Will", "Rich Lowry", "Matthew Continetti", "The Editors"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/01/RTS2BA8F.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-08"}