{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3068917&cloc=joongangdaily|home|online", "downloaded_at": "2019-10-11 12:41:11.865258+00:00", "title": "Moon lauds Samsung’s investment in displays", "language": "en", "text": "President Moon Jae-in, front row center, and Lee Jae-yong, de facto leader of Samsung Electronics, second from right in the front row, pose after the tech giant’s announcement of a 13 trillion won (＄10.9 billion) investment during an event held at Samsung Display’s factory in Asan, South Chungcheong, on Thursday. [YONHAP]\n\nIn a surprise move, President Moon Jae-in publicly thanked Lee Jae-yong, de facto leader of Samsung Group, during an event celebrating Samsung Display’s 13.1 trillion won ($10.9 billion) investment plan in South Chungcheong on Thursday.“I thank Samsung Vice Chairman Lee Jae-yong, Samsung Display CEO Lee Dong-hoon, South Chungcheong Governor Yang Seung-jo and all of the businesses, universities and research institutions that are involved in delivering the good news to the public,” Moon said.On Thursday, Moon visited Samsung Display’s plant in Asan, South Chungcheong. This is the third Samsung plant that he has visited since taking office in May 2017.The first visit was when Samsung Electronics opened its largest smartphone plant in India in July last year. The second was when Moon visited a plant in Hwaseong, Gyeonggi, in April.Although he has met with the heir apparent of Samsung Group nine times, this was the first time that Moon has publicly thanked the 51-year-old, who has been managing Korea’s largest conglomerate since his father, Chairman Lee Kun-hee, was incapacitated in May 2014.A liberal, Moon has never publicly thanked the head of the conglomerate.“I always feel gratitude for Samsung, which has led our country’s economy and also leads in the world not only in consumer electronics but also in semiconductors, mobile phones and displays,” Moon said.“Today’s signing off on [the] new investment will be the starting point of securing Korea’s No. 1 display competitiveness in the world and also [Korea] as a display and manufacturing powerhouse that no other could challenge through the interdependency of key materials, parts and equipment,” Moon said. “The government supports the bold challenge of Samsung Display and will work with companies on display industry innovation.”Moon stressed the importance of securing the lead in the global display industry amid fierce competition through bold investments.“Our future is promising with Samsung Display’s announcement of new investments along with LG Display’s 3 trillion won investment plan for OLEDs [or organic light-emitting diodes] announced in July.”Samsung’s Lee responded to the praise by saying, “President Moon’s comment on building a powerful nation on display manufacturing is giving me huge strength.”Lee said displays now play a significant role in our lives in households, offices, the industrial and medical fields and even in education.“It realizes our imagination by connecting people and the world and time and space wherever the tip of our finger and our sight reach,” Lee said. “It is called a future growth industry that could create new values in unlimited fields.”He said Samsung will continue to work on next-generation technologies and talents despite the difficult situation that the economy faces with various uncertainties.“The faster competition catches up, the harsher challenges become. We will persistently innovate,” Lee said.Samsung Display plans to invest 13.1 trillion won until 2025 in building a research and development (R&D) and production center in Asan, South Chungcheong, specializing in next-generation QD (quantum-dot) displays, which would be the first in the world.Samsung plans to invest 10 trillion won on the production lines, while 3 trillion won will be used for R&D.An existing 8th generation LCD production line will be converted into the QD production lines, dubbed Q1.Starting in 2021, the new production line will be rolling out 30,000 large-size QD displays of 65 inches or larger every month and gradually increase the production capacity by 2025.The upgrade to QD displays will contribute to creating 81,000 new jobs over the next five years.BY LEE HO-JEONG [lee.hojeong@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/10201545.jpg", "published_at": "2019-10-10"}