{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/murdered-nine-year-olds-mother-grilled-in-the-witness-box-20191029", "downloaded_at": "2019-10-30 00:08:14.867508+00:00", "title": "Murdered nine-year-old's mother grilled in the witness box", "language": "en", "text": "The mother of slain nine-year-old Miguel Louw of Sydenham had her personal life aired as she took to the witness stand in the Durban High Court on Tuesday.\n\n\n\nRaylene Louw was described as a drug user and liar by defence attorney Jay Naidoo who took aim at her lifestyle.\n\nAt the centre of Naidoo's cross-examination in the final session was Louw's activities the weekend before Miguel went missing.\n\nHe said she and her acquaintances had spent the weekend drinking at her home before she went out and left her children alone at home with accused Mohamed Ebrahim.\n\n\"They were in his care. Did you know your mother left for a reunion event?\"\n\nReplying, she said: \"No I was not aware. I thought she was sleeping at home.\"\n\nNaidoo outlined the close relationship between Louw and Ebrahim, who, on occasion stayed over at her place and interacted with both her children.\n\nHe, however, said she had many other friends who spent time at her home, which Louw conceded.\n\n\"They were in my life. I call them acquaintances.\"\n\nHe also highlighted Louw's Facebook account, saying she had contradicted an earlier statement where she said she had refrained from using social media since her son went missing on July 17, 2018.\n\n\"You had said you were not on social media, but there are posts from the days after the accused was taken into police custody weeks later.\"\n\nNaidoo then produced copies of her Facebook profile which showed her posting messages even after Ebrahim was arrested.\n\n\"You ask for the person who took your son to return them. This despite the fact that the accused was already in custody. Who are you referring to?\"\n\nLouw said it was just a general post making an appeal to the public.\n\nShe also conceded to previously using drugs.\n\n\"Yes, I have used coke [cocaine].\"\n\nThe case continues on Wednesday.", "description": "The mother of slain nine-year-old Miguel Louw of Sydenham had her personal life aired as she took to the witness stand in the Durban High Court on Tuesday.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7732/12b3ea72f11b4f1e8c1a35bdef3aaa96.jpg", "published_at": "2019-10-29"}