{"pub": "realclearpolitics", "url": "https://realclearpolicy.com/articles/2019/10/02/defending_capitalisms_vulnerable_fortresses_111280.html", "downloaded_at": "2019-10-02 15:29:02.102886+00:00", "published_at": "2019-10-02", "title": "Defending Capitalism's Vulnerable Fortresses", "language": "en", "text": "Publicly traded corporations are capitalism’s vulnerable fortresses, the economist Joseph Schumpeter argued in his epochal “Capitalism, Socialism and Democracy.” Dematerialized, absentee ownership does not call forth moral allegiance in the visceral way that private property once did. “Defenseless fortresses invite aggression especially if there is rich booty in them,” Schumpeter warned.\n\nThe relationship between the stock investor, the ultimate beneficiaries, and the means of production is more attenuated than it was in the 1940s, when Schumpeter wrote. Mutual funds, index funds, ETFs, state pension schemes and the like have resulted in the atomization of shares of publicly traded corporations into vast portfolios controlled by institutions, some private but many answering to state politicians.\n\nIn theory, absentee shareholders are meant to exercise oversight over corporate boards and CEOs. Congress and the SEC have attempted to strengthen this crucial but vulnerable nexus of capitalism by establishing a rigorous corporate-disclosure regime. The standard answer to every corporate scandal became more transparency and more disclosure. But as Obama-era SEC Commissioner Daniel Gallagher argued in a seminal speech on corporate governance in 2013, the SEC’s disclosure regime had succumbed to the Washington scourge of regulatory creep.\n\nThis was especially the case in 2003, when the SEC produced new guidance requiring institutional shareholders to vote their shares in every company they own. Not only must they record how they voted their securities; they must also justify the way they exercised their enforced proxy as in the interests of the fund or their client’s interests.\n\nThis created an impossible standard for large institutions to meet. They hold stock in hundreds, sometimes thousands, of companies. According to BlackRock, the world’s largest investment firm, in 2017, Russell 3000 companies saw 28,000 ballot items, 98% of which were routine management proposals that received 90-95% approval.\n\nDoes proxy voting matter? Most of the time, no. In 2017, in the “free” voting sector, only 29% of retail shareholders voted their shares, whereas in the compulsory one, institutional shareholders voted 91% of their shares, in large part because the SEC forces them to (they can abstain, but even this has to be justified). Obviously institutional shareholders will seek to minimize the burden of paperwork placed on them by the SEC’s vote-and-justify regime, especially as proxy activity is concentrated between February and June, with little happening in the rest of the year.\n\nPresumably, the intent behind mandatory vote-and-justify was to encourage institutional shareholder oversight of the companies they invest in. The unintended effect was to pump up demand for the services of proxy advisors. Little-known players in the investing world, according to Chester Spatt, professor of finance at Tepper School of Business at Carnegie Mellon University, “proxy advisors wield massive power. . . . their recommendations carry more clout than the votes of the largest asset managers or institutional investors.”\n\nProxy advisors assist investors by creating a paper trail to justify how a fund’s proxies are cast on behalf of their clients or fund beneficiaries. In effect, proxy advisors act as a safe harbor enabling institutional investors to offload SEC-generated paperwork and cleanse themselves of potential conflict-of-interest allegations. The outcome: dematerialized, defunctionalized robo-voting, where institutions preauthorize proxy advisors to vote on their behalf or mechanically cast their proxies immediately on receipt of proxy advisor recommendations. In his 2013 speech, former commissioner Gallagher warned of institutions’ approach to proxy voting with “more of a compliance mindset than a fiduciary mindset.”\n\nWorse, the market for proxy-advisory services is effectively controlled by duopoly, with Institutional Shareholder Services Inc. and Glass Lewis having a combined market share of 97%. ISS’s business model features a potential conflict of interest: it advises corporate clients how they can improve their governance ratings. Spatt’s hypothesis that proxy-advisory firms have a commercial interest in stirring up corporate controversies—doubly so if they work both sides of the street—recalls Schumpeter’s dictum that capitalism pays the people seeking to bring it down. “Bias in the judgments of a proxy advisory firm,” Spatt notes, “in conjunction with its tremendous influence, can create the possibility of poor or even misguided governance outcomes.”\n\nBy creating an unregulated position for the proxy-advisor duopoly, the SEC inadvertently handed them the keys to the fortress. There’s a growing realization that this was a bg mistake. Last year, the SEC withdrew two staff letters that were part of the regulatory underpinning of the use of proxy advisors as unaccountable safe harbors. Last month, the SEC issued guidance on the use of proxy advisers by investment firms. Incorporating the principles of transparency and cost-benefit recommended by BlackRock and Spatt, the guidance marks a major step in reining in proxy advisors, which will now need to show their clients that they have engaged with corporate issuers and ensure they are providing complete and accurate information—a useful start in making them accountable for errors of fact and omission. Perhaps even more important, the guidance liberalizes mandatory voting by enabling investment firms and their clients to pre-agree not to vote proxies if it were, for example, not expected to have a material effect on the value of the client’s investment.\n\n***\n\nFormer commissioner Gallagher expressed another concern: special-interest groups are using disclosure rules to pressure public companies on governance and business practices. A review of the 2018 proxy season by Sullivan & Cromwell found that more environmental, social, and political (ESP) shareholder proposals were submitted than any other type. It also found that a “relatively concentrated group of individuals and entities” drives the voting agenda of US public companies, the top two ESP filers being the New York State Retirement Fund and the As You Sow Foundation. To borrow from Clausewitz, proxy voting is politics by other means.\n\nDescribing itself as the nation’s nonprofit leader in shareholder advocacy, As You Sow aims to bring about “lasting change that benefits people, planet, and profit.” It has run campaigns against fracking and in favor of wind and solar (“clean tech is at the heart of a responsible, sustainable energy future”) and workplace equity disclosure statements (“investors need access to meaningful policies and practices on workforce composition, recruitment, retention, pay, promotion practices as well as workforce safety, sexual harassment, social mobility, and justice”). This kind of conduct is an abuse of corporate governance.\n\nIronically, one of its board members serves as CFO of a chemicals company, but As You Sow’s belief in disclosure does not stretch to revealing this fact on its website, although it does feature a donate button, demonstrating its lack of bona fides as a stock investor and its status as a 501 (c) (3) non-profit political outfit. The chemicals sector is arguably the biggest gainer from fracking, which is highly energy intensive. In 2014, the chemicals sector accounted for 22.7% of all the energy consumed by U.S. manufacturers and was responsible for 24.4% of its greenhouse gas emissions and its principal feedstock is hydrocarbons in one form or another.\n\nThe financial sector, by contrast, is almost totally immune from energy costs. Take Goldman Sachs. Its direct energy costs are a fraction of its office-occupancy costs of $809 million last year, which in turn amounted to just 2.2% of FY2018 $36.6 billion net revenue. Better still, the finance sector can more than hedge its tiny exposure to rising energy costs by profiting from them. “At the end of 2018, we reached $80 billion in our goal to finance or invest $150 billion in clean energy by 2025,”Goldman CEO David Solomon boasts in its 2018 annual report.\n\nWall Street might be going green, but the Hamptons, Westchester County, and Greenwich, Connecticut are not. A 2017 London School of Economics study of household carbon footprints found that in 2009, the top 10% American households by income had an average carbon footprint of 59.4 metric tons, more than three times larger than the 18.1 metric tons emitted by the bottom 10%. For the top 1 percent and higher, the multiple is still greater. This year, 1,500 private jets flew the world’s super-rich to Davos, an 11 percent increase on 2018. More recently, the 300 or so guests at Google’s summer camp in Sicily arrived in Gulfstreams, super yachts, and Maseratis where wealth, celebrity, and heredity combined to produce idiocy in the form of a reportedly barefoot Prince Harry giving a lecture about climate change.\n\nIssues that appeal to the wealthy and to progressives often lose on Election Day. Failing at the ballot box, progressives target corporations instead. By downgrading their accountability to their shareholders, the 181 CEOs who signed the Business Roundtable corporate purpose statement are unwittingly giving them a helping hand. “Accountability to everyone means accountability to no one,” the Council of Institutional Investors responded. “While we appreciate that CEOs do not like to feel constrained and subject to market forces, nothing in the BRT statement will change this real-world dynamic of public equity markets.” Marty Lipton, inventor of the poison pill and now stakeholder-capitalism advocate, accused the Council of being blind to the “existential threats” of inequality and climate change. If corporations and investors don’t respond, legislation stripping shareholders of meaningful voting rights is inevitable, he said, pointing to Senator Elizabeth Warren’s Accountable Capitalism Act. Put that way, Lipton’s choice is between voluntary or forcible euthanasia.\n\n“The capitalist process,” Schumpeter wrote in Capitalism, Socialism and Democracy, “not by coincidence but by virtue of its mechanism, progressively raises the standard of life of the masses.” The publicly traded corporation remains the principal conduit of that process. Not since the New Deal has the business corporation been under such attack. Depoliticizing the proxy process is one battle in a larger war for the future of capitalism in America. More — much more — needs to be done to defend the American public corporation and enable capitalism to prosper in the twenty-first century.\n\nRupert Darwall is the author of “Green Tyranny” and co-led the 2007 Vodafone plc shareholder action.", "description": "Publicly traded corporations are capitalism\u0092s vulnerable fortresses, the economist Joseph Schumpeter argued in his epochal \u0093Capitalism, Socialism and Democracy.\u0094 Dematerialized, absentee...", "authors": ["October"], "top_image": "https://assets.realclear.com/images/48/489925_5_.jpg"}