{"pub": "zdnet", "url": "https://www.zdnet.com/article/australian-house-committee-to-examine-5g-deployment", "downloaded_at": "2019-09-19 06:02:47.672030+00:00", "title": "Australian House Committee to examine 5G deployment", "language": "en", "text": "Australia's 5G mobile network technology is set to go under the microscope, with the House of Representatives Standing Committee on Communications and the Arts on Thursday launching an inquiry into the technology.\n\nSpecial feature How 5G Will Transform Business 5G will be popularized via telecom carriers and the marketing of wire-cutting services, but the biggest impact and returns will come from connecting the Internet of things, edge computing and analytics infrastructure with minimal latency. Read More\n\nThe committee will be chaired by Nationals member David Gillespie, and will examine the rollout, deployment, and application of 5G in Australia.\n\n\"5G will transform the way we live and work, and provide opportunities for family life, industry and commerce. It will power smart homes and cities and provide new ways to experience entertainment, and at the same time transform transport, logistics and industry,\" he said in a statement.\n\nGillespie added the inquiry will be a chance to also hear about the opportunities and challenges of 5G.\n\nSee also: 5G to underpin new digital ecosystem in 2020 (TechRepublic)\n\nThe inquiry comes at the request of Minister for Communications, Cyber Safety, and the Arts Paul Fletcher.\n\nA date for the committee to report back has yet to be set, however, submissions are now being accepted until November 1.\n\n5G technology has been on the radar for Australia's major telcos, with Telstra most recently labelling it as a \"strong growth engine\" for the company.\n\nTelstra announced in May that it would charge customers AU$15 per month for 5G connectivity on some of its plans next year.\n\nMeanwhile, Optus has been working with Nokia and Ericsson to build out its 5G sites.\n\n5G has also been at the centre of the Australian government's decision to ban Huawei and ZTE from participating in the rollout of the network in Australia.\n\nTPG decided to end its mobile network rollout as a consequence.\n\n\"It is extremely disappointing that the clear strategy the company had to become a mobile network operator at the forefront of 5G has been undone by factors outside of TPG's control,\" executive chairman David Teoh said earlier this year.\n\nRelated Coverage\n\nTPG kept looking into 5G even though Teoh killed the project\n\nDespite saying it was ending its mobile network at the start of the year, TPG's head of operations and products has revealed the telco continued to talk to mobile equipment vendors.\n\n5G Research Report 2019: The enterprise is eager to adopt, despite cost concerns and availability (TechRepublic)\n\nundefined\n\nNokia and NTT DoCoMo to use 5G and AI to monitor workers\n\nIf your performance review isn't going as expected, look for a power cord to pull.\n\nOptus unveils AU$30 travel SIM for Australia with 60GB\n\nVisitors given 60GB for 28 days, for the cost of AU$30.\n\nHuawei believes banning it from 5G will make countries insecure\n\nChinese giant warns of potential for backdoors in 6G thanks to AI.\n\nTwo of China's major carriers team up for 5G network build-out\n\nChina Unicom has struck a deal with its rival China Telecom to build their 5G networks together to cut costs.", "description": "The committee will examine the opportunities and challenges of 5G in Australia.", "authors": ["Aimee Chanthadavong"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/08/20/937ec277-3426-4878-b99c-23710d7b0d9e/thumbnail/770x578/9d9520d189226325130e5ccb3c8478e1/istock-1132032793.jpg", "published_at": "2019-09-19"}