{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/virginia-politics/va-republicans-target-freshman-democrats-in-hopes-of-keeping-house-majority/2019/10/03/bba32f0a-e08c-11e9-8dc8-498eabc129a0_story.html", "downloaded_at": "2019-10-04 12:35:55.381550+00:00", "title": "Va. Republicans target freshman Democrats in hopes of keeping House majority", "language": "en", "text": "The moderate Republican challengers are mostly eschewing hot-button GOP positions on gun rights and abortion restrictions, and are running on core local issues such as transportation and economic development.\n\nWith money and strategic support from state GOP leaders, they are trying to characterize their freshmen Democratic opponents, who rode into office on a wave of blue victories in 2017, as too liberal on issues such as health care and climate change. Some are adopting mainstream Democratic positions or posting blue campaign signs that don’t mention their party affiliation. Their goal: to pick up enough seats to offset any Democratic flips elsewhere in the state and protect their three-seat majority in the chamber.\n\nAD\n\nAD\n\n“Two years ago, these freshmen Democrats didn’t have records,” said John Findlay, executive director of the state GOP. “What they ran on then, and who they really are, are two different things.”\n\nTwo of the GOP candidates are trying to reclaim seats they lost two years ago. With the effort in Congress to impeach President Trump as a backdrop, they are walking a fine line as they search for victory in a portion of the state where the president is unpopular. Some of the Democratic incumbents, meanwhile, have been buoyed by visits from 2020 presidential hopefuls and former congresswoman Gabby Giffords.\n\nThough in turmoil, the NRA flexed its muscles in Virginia gun debate\n\nRepublicans are most excited about the chances of former delegate Randy Minchew, who is seeking to reclaim his seat from Gooditis in a district that includes Loudoun, Clarke and Frederick counties. Minchew, 62, has called for stronger gun laws — an idea that is anathema to most Republicans in the state. He said he also supports renewing the 2018 law, strongly opposed by conservatives, that provided Medicaid to an extra 400,000 low-income Virginians.\n\nAD\n\nAD\n\n“Even if you didn’t like Medicaid expansion, it’s become part of our social fabric in the last two years,” Minchew said. He sponsored a 2016 bill that would have used federal Medicaid dollars for a state fund geared, with some restrictions, toward low-income Virginians but voted against other more-inclusive versions of the plan.\n\nMinchew lost to Gooditis by four points in 2017. He argued that voters will be more focused on local concerns this fall than they were during that election, when anger over Trump’s victory was fresh and statewide candidates — including Gov. Ralph Northam (D) — were on the ballot.\n\n“I remember seeing ladies in my church saying: ‘Randy, we love you, but you’ve got an ‘R’ after your name and I’ve got to send a message to Donald Trump,’ ” Minchew said. “I’ve always been an ecumenical, bipartisan, ‘let’s work things out together’ ” type of Republican.\n\nAD\n\nAD\n\nGooditis, 59, who hopes to pass a “red flag” gun control law next year, noted that Minchew’s voting record on gun regulations earned him a National Rifle Association endorsement two years ago.\n\n“His path to victory, in his eyes, apparently is the same as mine,” she said.\n\nIn Prince William County, Democrats are most concerned about the rematch Ayala faces with former delegate Rich Anderson , whom she beat by six points in 2017. So far, Anderson has raised $160,000, while Ayala has collected $489,000.\n\nBut Anderson, whose wife is a local county supervisor, is still widely known in the district after serving in the House for eight years. Democratic Party leaders have helped Ayala with mailers and ads. Presidential candidate Sen. Cory Booker (D-N.J.) came to Woodbridge last weekend to stump for her.\n\nAD\n\nAD\n\nAndersons of Prince William share a home and, now, political careers\n\nAnderson, 64, says he is an advocate of bipartisan compromise and would be open to considering a proposal to raise the state minimum wage — a key Democratic issue. Like Ayala, he touts his support for teacher pay raises in years past.\n\n“The more we talk with one another on these issues, the more we reach some sort of understanding and do what politics is all about: finding solutions,” Anderson said.\n\nHe criticized Ayala for authoring only one successful bill in the past two years — a lower success rate than some other freshman delegates but not unheard of for Democrats in a Republican-controlled legislature.\n\nAyala, 46, pointed to her advocacy for expanding Medicaid, a push to ratify the Equal Rights Amendment and stronger gun legislation as proof that she’s in touch with local constituents. And she argued that Anderson’s voting record in Richmond, including opposition to Medicaid expansion, show that he’s no compromiser.\n\nAD\n\nAD\n\n“Your voting record is a testament to what you believe in and support,” she said.\n\nIn nearby Manassas, the race between Carter, a self-proclaimed socialist, and Republican Ian T. Lovejoy has been more acrimonious, with Lovejoy saying that “people will be more aware this time around about who they’re voting for.”\n\nLovejoy, who serves on the Manassas City Council, said he wants to find ways to create more local jobs and fix traffic-clogged roads. He criticized Carter’s opposition to a planned expansion of the Micron Technology Inc. semiconductor manufacturing plant in Manassas that would result in 1,100 more high-skilled jobs by 2030.\n\nCarter, who beat former House minority whip Jackson Miller (R-Prince William) by 9 points in 2017, has said he’s against using a $70 million state grant to help fund the $3 billion project, which, he also argued, would spur gentrification.\n\nAD\n\nAD\n\nThe candidates have raised similar amounts of money.\n\nIn his ads, Lovejoy, 37, calls Carter a “deadbeat” dad, a reference to a 2015 court settlement between the Democrat and his ex-wife that has him making payments on $14,370 owed in child support.\n\nCarter, 32, last year sought to neutralize such attacks by posting confessional tweets about his personal life. If reelected, he said, he’ll work to pass laws to legalize marijuana, allow teachers to strike and repeal the state’s 1947 “right-to-work” law, which says employees can’t be forced to join a union.\n\n“He’s running absolutely the most disgusting personal smear campaign that I’ve ever seen,” Carter said of Lovejoy. “There are far more people who vote for Democrats in this district than people who vote for Republicans.”\n\nAD\n\nDarrell H. “D.J.” Jordan Jr., the former vice chair of the Prince William County Republican Committee, has struck a mostly moderate tone in his bid to unseat Guzman, who in 2017 beat longtime Republican delegate Scott Lingamfelter by nearly 10 points.\n\nAD\n\nJordan, 41, was among the first local Republicans to openly criticize John Gray, the party’s nominee for chairman of the county Board of Supervisors, over a host of deleted, inflammatory tweets. He also supports working to reduce greenhouse gas emissions, saying it should be done through public-private partnerships and tax incentives.\n\nVirginia’s Guzman tapped for Spanish-language response to Trump\n\nHe has criticized Guzman for opposing a bill that requires schools to allow parents to opt their children out of programs to prevent bullying and suicide if they believe the content is too graphic.\n\nAD\n\nGuzman, 46, said she voted against the bill because, among other things, it may keep students from recognizing that they’re being victimized.\n\nShe touted her co-patronage of a 2018 law that steered $102 million in gasoline taxes to commuter rail and bus services in the region and says she wants to further increase public transportation funding.\n\nAD\n\nGuzman accused Jordan of trying to gloss over his past support for Trump and Corey A. Stewart, the outspoken Republican county board chairman who is not seeking reelection.\n\n“His logo is blue. His literature doesn’t say he’s the Republican candidate in the race,” she said of Jordan. “You have to start by being honest and transparent.”\n\nStephen J. Farnsworth, a political science professor at the University of Mary Washington in Fredericksburg, said Republicans are doing what they need to do to be competitive in the suburbs.\n\nBut, he added, “It’s very hard for them to be heard over the gale-force winds coming out of Washington.”\n\nIn a changing Virginia suburb, a slate of diverse candidates\n\nA Virginia politician’s approach to personal scandal: Tell all before opponents do\n\nHe deleted his tweets. But his opponent found them anyway.\n\nLocal newsletters: Local headlines (8 a.m.) | Afternoon Buzz (4 p.m.)\n\nLike PostLocal on Facebook | Follow @postlocal on Twitter | Latest local news", "description": "Moderate Republicans are vying for four House seats in slightly blue Northern Virginia exurbs.", "authors": ["Antonio Olivo", "Reporter Covering Government", "Politics", "Demographics In Northern Virginia"], "top_image": "https://www.washingtonpost.com/resizer/Xr4q5HlRq_0eJY5rjLs_K-ifPyA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GCCRAAW334I6TINFCYVYVHE4UI.jpg", "published_at": "2019-10-03"}