{"pub": "marketwatch", "url": "https://marketwatch.com/story/what-not-to-do-with-your-savings-as-interest-rates-fall-and-another-state-rolled-out-a-free-college-plan-2019-09-19", "downloaded_at": "2019-09-19 23:06:01.091687+00:00", "title": "What NOT to do with your savings as interest rates fall and another state rolled out a free-college plan", "language": "en", "text": "Happy Thursday, MarketWatchers. Check out these stories for advice on everything from savings strategies when interest rates drop to preparing financially for a divorce.\n\nPersonal Finance\n\nGetting divorced cost this woman nearly $1 million in retirement savings — how to avoid her fate\n\n‘Folks are more likely to talk about their sex life or their most recent encounter on Tinder than they are to talk about finances.’\n\n\n\nWhere the 2020 presidential candidates, including Elizabeth Warren and Bernie Sanders, stand on affordable housing\n\n‘California, perhaps the epicenter of unaffordable housing, is scheduled to have its primary earlier than in past election cycles.’\n\n\n\nFor-profit middlemen are helping to drive up the cost of online higher education\n\nIn hiring companies known as online program managers, universities give up what is often a large share of revenues.\n\n\n\nThe best (and worst) tippers in America\n\nA new study says some people are Grinches when it comes to adding that 20%. Do you fit that bill?\n\n\n\n3 things NOT to do with your savings now that the Fed has cut interest rates\n\nAlready, the Fed’s rate cut has affected banks’ decision-making.\n\n\n\nMy sister-in-law is a gold-digging, greedy woman — it floored me that men could be so stupid\n\nThis letter writer is embarking on an around-the-world trip with her husband and is afraid that her relative will insinuate herself into her daughter’s life while she’s gone.\n\n\n\nIn a blow to financial-services industry, the CFPB will keep consumer complaints database public\n\nConsumer advocates had feared that the agency would make the database private.\n\n\n\nNew Mexico’s free-college plan could be a game-changer for student debt in America\n\nAt least 20 states have free college programs in some fashion, in addition to another 150 cities, counties and school districts.\n\n\n\nWalmart unveils new rewards credit card, but some experts say proceed with caution\n\nHere’s how the card, which was launched with Capital One, compares to Amazon’s card.\n\n\n\nMillennials are ‘delusional’ about how rich they’re going to be\n\nNew survey shows that most millennials believe they’ll be rich one day — even though they aren’t right now.\n\n\n\nElsewhere on MarketWatch\n\nWorkers would get money and voting power under this radical profit-sharing idea\n\nDividend-paying ‘inclusive ownership fund’ offers employees a leg up as the pay gap widens.\n\n\n\nClean energy is coming rapidly, but will investors and policy makers stand in the way?\n\nThe technical and economic barriers to a carbon-free economy are falling rapidly, but entrenched stakeholders could still delay the necessary transition to clean energy.\n\n\n\nBillionaire investor on Elizabeth Warren as president: Market might not even open\n\n“The Democratic Party seems to be leaning towards the left on policies, which is very harmful for the economy. I don’t like the shift to the left,” he explained, adding we could see a 25% plunge in the market if Warren gets elected.\n\n\n\nOver the next decade, your best bet will still be the S&P 500, Bernstein strategists say\n\nOur call of the day from Bernstein Research that says 10 years from now, you’ll still be better off in equities, whether it hits 4,000 or 8,000.\n\n", "description": "Thursday's top personal finance stories", "authors": ["Jacob Passy"], "top_image": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "published_at": "2019-09-19"}