{"pub": "time", "url": "https://time.com/5701182/fort-worth-police-department-community-distrust", "downloaded_at": "2019-10-15 23:03:59.826205+00:00", "title": "'No Credibility in Our Neighborhood.' Fort Worth's Police Shooting of Atatiana Jefferson Strengthens Community Distrust", "language": "en", "text": "Following the fatal shooting of a black woman in her home by a white officer in Fort Worth, Texas, over the weekend, community members say they have little faith in the role of law enforcement in the city.\n\nAtatiana Jefferson, 28, was in her home in the early morning hours of Oct. 12 when officer Aaron Dean shot and killed her through a bedroom window. She had been playing video games with her 8-year-old nephew, who witnessed the shooting. A neighbor had called the police for a wellness check after seeing Brown’s front door open and lights on.\n\nDean was placed on administrative leave after the shooting. He resigned on Oct. 14 and was arrested for murder on the same day. Office Dean was released on Tuesday after posting a $200,000 bond.\n\n“This incident has eroded the trust we built with our community, and we must now work even harder to ensure that trust is restored,” Fort Worth Police Chief Ed Kraus said at a press conference on Tuesday.\n\nCommunity members and activists argue that their trust of the police department has been eroding for a long time — with Jefferson’s killing serving as a flashpoint — and they are highly skeptical of the role the police play in the Fort Worth’s minority neighborhoods. They say that the police are not trusted by many locals, and are not held accountable for actions that disenfranchise the community they are intended to protect and serve.\n\n“The police department has no credibility in our community,” Dr. Michael Bell, senior pastor at Greater St. Stephen First Church in Fort Worth tells TIME. “It sounds surreal but this is the state of affairs.” Dr. Bell is part of a coalition called Emancipate Fort Worth, a collective of community leaders and organizations who fight for equality and justice in the Fort Worth area.\n\nFort Worth is a majority minority city. Nearly 35% of residents are Hispanic and nearly 20% are black, while about 40% are non-Hispanic white, according to 2017 data from the U.S. Census Bureau.\n\n“The mayor and the city manager need to change the murderous culture of the police department,” Dr. Bell says.\n\nAmber Carr, center, wipes a tear as her sister, Ashley Carr, left, and attorney Lee Merritt, right, listen to Amber and Ashley's brother Adarius Carr talk about their sister Atatiana Jefferson during a news conference, Monday, Oct. 14, 2019, in downtown Dallas. Irwin Thompson—AP\n\nDeborah Peoples, chair of the local Democratic Party in Tarrant County, says that the city’s leadership has failed to make changes to address issues with the police.\n\n“We hear parents say this all the time: ‘I fear for my children every time they go out.’ We have to change this systemic practice of marginalizing communities of color,” Peoples tells TIME.\n\nIn 2019, at least five other people have been fatally shot by police officers in Fort Worth, according to the Texas Attorney General’s office.\n\nThree of the deceased were African American males aged 20 or under. One incident occurred in circumstances related to a traffic stop and execution of a warrant, according to police reports.\n\nAnother person has been injured as a result of an officer shooting. In 2018, there were at least eight officer-involved shootings in Fort Worth.\n\nDistrust in police has reached the point where many community members feel that minorities should not call the police at all.\n\n“We don’t know if we can survive a 911 call in Fort Worth,” Dr. Bell says. He is working with others to come up with a help line for people to call in emergency and non-emergency situations, as opposed to calling 911 or 311. The Fort Worth Police Department did not respond to TIME’s request for comment on Bell’s proposal.\n\nOne local organization already engaged in this kind of community work is the city’s Black Empowerment Movement, co-founded by Kintu Sankara. His organization patrols the Fort Worth area, and engages with the community on a variety of issues.\n\nAccording to Sankara, his organizations deals directly with people in non-emergency situations. Sankara says that when members of his organization does their patrols, they are armed. He also says that they have not had any conflicts with the police, mostly because they focus on areas the police do not go to unless they are called.\n\n“People are tired of the over-policing and the unjustified killings,” Sankara tells TIME. “There needs to be better communication between the police department and members of the community.”\n\nThat minority communities are reluctant to call the police is not a new phenomenon, Khadijah White, a professor of journalism and media studies at Rutgers University, tells TIME. White has performed extensive research on racial issues in America, and says that this has been a longstanding concern within the African American community.\n\n“People don’t appreciate how much terror African Americans live in,” White says. “There are just too many people who end up dead in situations [when police are called]. Anyone who expresses concern about minorities not calling the police don’t understand that it is already happening.”\n\nAnastasia Gonzalez, of Burleson, Texas, leaves a flowers on the front sidewalk of Atatiana Jefferson's home on E. Allen Ave in Fort Worth, Texas, Tuesday, Oct. 15, 2019. Jefferson, a black woman, was shot by a white police officer early Saturday, Oct. 12. Tom Fox—AP\n\nWhite agrees that there needs to be more community-based alternatives to calling the police and other emergency services. “Officers are not trained to do social work, they are not trained to work with children,” White says. She argues that the involvement of people who are trained to deal with these issues would do a much better job.\n\nMany residents are also unhappy that the Forth Worth Police Department doesn’t accurately reflect the racial demographics and diversity of the Fort Worth area. According to 2019 data from the police department, 63% of officers are white, 21% Hispanic, and just 12% African American.\n\n“They need to stop hiring people who do not live in our community and are not from our community,” Romalice Brumfield, a community leader working with Emancipate Fort Worth tells TIME.\n\nResidents agree that there needs to be civilian oversight, and real power for the city’s residents to hold the police accountable when there is injustice on their part. They also believe that local government and the police department needs to provide detailed action plans on how they intend to rebuild trust with the Fort Worth community.\n\n“This is systemic,” Sankara says. “What are they going to do to stop the bleeding?”\n\nTara Law contributed reporting to this story.\n\nWrite to Josiah Bates at josiah.bates@time.com.", "description": "After a black woman was killed in her home in Fort Worth, Texas, people in the community are even more skeptical of the law enforcement.", "authors": ["Josiah Bates"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/ap_19288683031105.jpg?quality=85&w=1200&h=628&crop=1", "published_at": "2019-10-15"}