{"pub": "independent", "url": "https://independent.co.uk/arts-entertainment/music/features/album-covers-best-iconic-all-time-the-beatles-velvet-underground-the-strokes-a8898821.html", "downloaded_at": "2019-09-15 00:21:11.473523+00:00", "title": "The 30 greatest album covers of all time, from Patti Smith to The Beatles", "language": "en", "text": "What makes an album stand the test of time? Mostly it’s the music – songs that resonate with the listener long after the final note has played out. But it also has something to do with the art that accompanies it – whether that’s a photograph, a painting, a collage or something else altogether.\n\nThe album cover is arguably less valued than it once was. Moody solo shots or images of bands slouching against brick walls have become the norm (thanks Ramones), or else artists go for plain covers with their name in block letters, in the belief that simple is best. But over the decades, artists famous in their own right have created genuine works of art that just happen to grace the covers of albums.\n\nPhotographers have succeeded in capturing the true essence of the artist via a striking portrait shot, like Robert Mapplethorpe with Patti Smith, or Pennie Smith and The Clash. Elsewhere, artists like Andy Warhol and Peter Blake have added their own vision to bands like the Velvet Underground, The Rolling Stones and The Beatles. They in turn are emulated by the likes of Madonna and photographer Herb Ritts, to mirror the connection between art and brand.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHere are 30 of the most iconic album covers of all time:", "description": "What makes an album stand the test of time? Mostly it’s the music – songs that resonate with the listener long after the final note has played out. But it also has something to do with the art that accompanies it – whether that’s a photograph, a painting, a collage or something else altogether.", "authors": ["Roisin O'Connor"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/05/03/17/iconic-album-covers-comp.jpg", "published_at": "2019-09-14"}