{"pub": "guardian", "url": "https://theguardian.com/society/2019/oct/23/blood-pressure-drugs-work-far-better-if-taken-at-night-study-shows", "downloaded_at": "2019-10-23 08:47:17.211441+00:00", "title": "Blood pressure drugs work far better if taken at night, study shows", "language": "en", "text": "Taking blood pressure medication at bedtime rather than on waking halves the risk of events such as heart attack and stroke, a major study has revealed.\n\nExperts say the findings could potentially transform the way such medications are prescribed, but questions remain, not least why taking the medication at night has such a profound effect.\n\nProf Ramón Hermida, first author of the study from the University of Vigo in Spain, said the effect was thought to be down to the body’s internal clock that means processes and chemicals within our bodies vary over a 24-hour period.\n\nThe upshot, he said, was that the same drug could have vastly different effects if taken at a different point in time, something that has been dubbed “chronotherapy”.\n\n“The same antihypertensive medication, the same molecule, at the same dose, ingested at two different times have totally different pharmacokinetics and pharmacodynamics and therefore they behave as two totally different medications,” said Hermida.\n\nPrevious research has shown that high blood pressure during sleep, and only small differences between blood pressure during the day and night, are both important risk factors for cardiovascular problems.\n\nThere have also been studies suggesting blood pressure medications are more effective when taken in the evening and might result in fewer heart attacks and strokes.\n\nAs a result, the team set out to compare the long-term implications of adopting a bedtime, rather than waking time, routine for taking blood pressure medication in a large trial.\n\nWriting in the European Heart Journal, the team report how they randomly split more than 19,000 adults with high blood pressure into two groups. Half of the patients were asked to take all their medication at bedtime while the other half were asked to take it upon waking.\n\nCrucially, said Hermida, fixed times were not given so that participants took their medication at the same point in the daily routine.\n\nThe patients were then followed for between four and eight years, with blood pressure measured over a 48-hour period at the outset and at least once a year during the study. In total 1,752 cardiovascular events such as heart attack, stroke, death from cardiovascular disease and heart failure were recorded during the study.\n\nWhile the impact on daytime blood pressure was similar, those taking their medication at bedtime had a small but significantly greater reduction in blood pressure during sleep compared with those taking medication on waking, as well as a greater difference in blood pressure when sleeping compared with being awake.\n\nAmong possible explanations, Hermida said it was known that the hormone system that regulates blood pressure peaks in activity during sleep, meaning it might be that medications that interact with this system have a greater effect when taken just before bed.\n\nAfter taking into account factors such as age, sex, smoking status, history of cardiovascular events and typical decrease in blood pressure when asleep, the team found patients who took their medication at bedtime had a 56% lower risk of death from cardiovascular disease, a 49% lower risk of stroke and a 44% lower risk of heart attack compared with the other group.\n\nThe team say the findings need to be confirmed in a more diverse range of ethnicities, while it is not clear if they would hold among those undertaking shift work.\n\nBeing vegetarian 'lowers heart disease risk but increases chance of stroke' Read more\n\nProf Stephen MacMahon, the principal director of the George Institute for Global Health at Oxford University, who was not involved in the study, said such a profound effect on cardiovascular events was surprising given the modest differences in blood pressure.\n\nHowever, Hermida said the blood pressure medication could be operating on many different biological processes that vary in their activity over the course of the day.\n\nBesides the effect on blood pressure, the team found those who took the medication at bedtime also showed better kidney function and cholesterol measures, both of which are important factors when it comes to cardiovascular disease.\n\nPaul Leeson, a professor of cardiovascular medicine at Oxford University, said the next step was to unpick why the timing of the medication had such an effect, something that could soon become clear with results from other big studies.\n\n“This study has the potential to transform how we prescribe blood pressure medication,” he said.﻿", "description": "‘Chronotherapy’ benefits of bedtime doses discovered in huge trial", "authors": ["Nicola Davis"], "top_image": "https://i.guim.co.uk/img/media/f326035bdd8c30e6645039e2b49d7e3359ba94ad/0_49_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=aa9791ee16cf62f7febcba56b9a17577", "published_at": "2019-10-23"}