{"pub": "bbc", "url": "https://bbc.com/news/world-africa-49604152", "downloaded_at": "2019-09-06 12:09:01.803295+00:00", "title": "Robert Mugabe, Zimbabwe's strongman ex-president, dies aged 95", "language": "en", "text": "Image copyright Getty Images\n\nRobert Mugabe, the Zimbabwean independence icon turned authoritarian leader, has died aged 95.\n\nMr Mugabe had been receiving treatment in a hospital in Singapore since April. He was ousted in a military coup in 2017 after 37 years in power.\n\nThe former president was praised for broadening access to health and education for the black majority.\n\nBut later years were marked by violent repression of his political opponents and Zimbabwe's economic ruin.\n\nHis successor, Emmerson Mnangagwa, expressed his \"utmost sadness\", calling Mr Mugabe \"an icon of liberation\".\n\nSkip Twitter post by @edmnangagwa It is with the utmost sadness that I announce the passing on of Zimbabwe's founding father and former President, Cde Robert Mugabe (1/2) — President of Zimbabwe (@edmnangagwa) September 6, 2019 Report\n\nMr Mnangagwa had been Mr Mugabe's deputy before replacing him.\n\nSingapore's foreign ministry said it was working with the Zimbabwean embassy there to have Mr Mugabe's body flown back to his home country.\n\nWho was Robert Mugabe?\n\nHe was born on 21 February 1924 in what was then Rhodesia - a British colony, run by its white minority.\n\nAfter criticising the government of Rhodesia in 1964 he was imprisoned for more than a decade without trial.\n\nIn 1973, while still in prison, he was chosen as president of the Zimbabwe African National Union (Zanu), of which he was a founding member.\n\nMedia playback is unsupported on your device Media caption Zimbabwe's week of upheaval that saw Mugabe ousted\n\nOnce released, he headed to Mozambique, from where he directed guerrilla raids into Rhodesia but he was also seen as a skilled negotiator.\n\nPolitical agreements to end the crisis resulted in the new independent Republic of Zimbabwe.\n\nWith his high profile in the independence movement, Mr Mugabe secured an overwhelming victory in the republic's first election in 1980.\n\nBut over his decades in power, international perceptions soured. Mr Mugabe assumed the reputation of a \"strongman\" leader - all-powerful, ruling by threats and violence but with a strong base of support. An increasing number of critics labelled him a dictator.\n\nShackled to one man\n\nHe died far from home, bitter, lonely, and humiliated - an epic life, with the shabbiest of endings.\n\nRobert Mugabe embodied Africa's struggle against colonialism - in all its fury and its failings.\n\nHe was a courageous politician, imprisoned for daring to defy white-minority rule.\n\nMedia playback is unsupported on your device Media caption Mugabe: From war hero to resignation\n\nThe country he finally led to independence was one of the continent's most promising, and for years Zimbabwe more or less flourished. But when the economy faltered, Mr Mugabe lost his nerve. He implemented a catastrophic land reform programme. Zimbabwe quickly slid into hyperinflation, isolation, and political chaos.\n\nThe security forces kept Mr Mugabe and his party, Zanu-PF, in power - mostly through terror. But eventually even the army turned against him, and pushed him out.\n\nFew nations have ever been so bound, so shackled, to one man. For decades, Mugabe was Zimbabwe: a ruthless, bitter, sometimes charming man - who helped ruin the land he loved.\n\nIn 2000, he seized land from white owners, and in 2008, used violent militias to silence his political opponents during an election.\n\nHe famously declared that only God could remove him from office.\n\nImage copyright Reuters Image caption Mr Mugabe's downfall came after suspicions that his wife Grace might succeed him\n\nHe was forced into sharing power in 2009 amid economic collapse, installing rival Morgan Tsvangirai as prime minister.\n\nBut in 2017, amid concerns that he was grooming his wife Grace as his successor, the army - his long-time ally - turned against the president and forced him to step down.\n\nWhat has the reaction been?\n\nDeputy Information Minister Energy Mutodi, of Mr Mugabe's Zanu-PF party, told the BBC the party was \"very much saddened\" by his death.\n\n\"He's a man who believed himself, he's a man who believed in what he did and he is a man who was very assertive in whatever he said. This was a good man,\" he said.\n\nNot everyone agreed, however.\n\nGeorge Walden, one of the British negotiators at the Lancaster House Agreement in 1979 which ended white-minority rule, said Mr Mugabe was a \"true monster\".\n\nThe agreement \"turned out rather well... and looked good for a while\", but Mr Mugabe later became \"a grossly corrupt, vicious dictator\", he said.\n\nZimbabwean Senator David Coltart, once labelled \"an enemy of the state\" by Mr Mugabe, said his legacy had been marred by his adherence to violence as a political tool.\n\nSkip Twitter post by @DavidColtart I’ve read several tweets stating that #RobertMugabe death is the end of an era. I beg to differ. Regrettably the negative aspects of his legacy - violence, disrespect for the rule of law, corruption & abuse of power - live on in the new regime which overthrew him in the 2017 coup — David Coltart (@DavidColtart) September 6, 2019 Report\n\n\"He was always committed to violence, going all the way back to the 1960s... he was no Martin Luther King,\" he told the BBC World Service. \"He never changed in that regard.\"\n\nBut he acknowledged that there was another side to Robert Mugabe, who had \"had a great passion for education... [and] mellowed in his later years\".\n\n\"There's a lot of affection towards him, because we must never forget that he was the person primarily responsible for ending oppressive white minority rule,\" the senator said.\n\nSouth Africa's President Cyril Ramaphosa called Mr Mugabe a \"champion of Africa's cause against colonialism\" who inspired our own struggle against apartheid\".\n\nKenya's President Uhuru Kenyatta said Mr Mugabe had \"played a major role in shaping the interests of the African continent\" and was \"a man of courage who was never afraid to fight for what he believed in even when it was not popular\".\n\nKenya will fly all its flags at half-mast this weekend in honour of Mr Mugabe, he said.\n\nImage copyright Fairfax / Getty Images Image caption Robert Mugabe in 1981 - just recently named prime minister of an independent Zimbabwe\n\nVeronica Madgen and her husband ran one of the largest farms in Zimbabwe before it was invaded by Mr Mugabe's supporters, forcing the family to come to the UK.\n\nSpeaking to the BBC, she recalled: \"The tractors [were] being burnt, the motorcycles [were] being burnt, stones [were being] thrown through the window… It was very difficult to actually come to terms with what was happening.\n\n\"I was sad for him and his family, because for the first 20 years he governed that country, he was a good leader, until that threat of losing that election got hold of him and he turned.\"\n\nYet Mr Mugabe is likely to be remembered for his early achievements, the BBC's Shingai Nyoka reports from the capital, Harare.\n\nIn his later years, people called him all sorts of names, but now is probably the time when Zimbabweans will think back to his 37 years in power, she says.\n\nThere's a local saying that whoever dies becomes a hero, and we're likely to see that now, our correspondent adds.\n\nDid you live in Zimbabwe during Robert Mugabe's rule? What are you memories of that time? Share your experiences by emailing haveyoursay@bbc.co.uk.\n\nPlease include a contact number if you are willing to speak to a BBC journalist. You can also contact us in the following ways:", "description": "One of Africa's best-known figures went from being an icon of independence to authoritarian president.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/1502F/production/_108636068_gettyimages-474391423.jpg", "published_at": "2019-09-06"}