{"pub": "cnn", "title": "New Zealand teen with measles may have exposed hundreds at Disneyland and other tourist destinations", "url": "https://cnn.com/2019/08/24/health/new-zealand-teenager-measles-disneyland/index.html", "language": "", "published_at": "2019-08-24", "downloaded_at": "2019-09-02 07:36:55.963761+00:00", "text": "(CNN) A teenage girl traveling through Southern California may have exposed hundreds of people to the measles when she visited several popular tourist destinations, health officials said Friday.\n\nThe girl, visiting from New Zealand, was contagious with the measles when she spent time at various Southern California attractions including Disneyland, Universal Studios and Madame Tussauds in Hollywood earlier this month, according to health alerts issued by Los Angeles and Orange counties.\n\n\"We were notified that the tourist visited multiple Southern California locations and have been advised by Orange County Health Care Agency that the risk to cast and guests is likely low,\" said Dr. Pamela Hymel, the chief medical officer for Disney Parks, in a statement.\n\nLos Angeles and Orange counties' public health agencies issued health alerts outlining the dates and times the girl was in large public spaces and warns the public to take precautionary measures in the event that they may have been exposed to the measles virus.\n\n#PressRelease: Measles Exposure Advisory: A confirmed case of measles traveled to Los Angeles County READ: https://t.co/Je6L6pRGtB pic.twitter.com/dJM9bhB8ce — LA Public Health (@lapublichealth) August 23, 2019\n\nMeasles is a highly contagious disease, according to the US Centers for Disease Control and Prevention. It can spread through coughing and sneezing and can live for up to two hours in the air where an infected person coughed or sneezed.\n\nRead More", "description": "A teenage girl traveling through Southern California may have exposed hundreds of people to the measles when she visited several popular tourist destinations, health officials said Friday.", "authors": ["Artemis Moshtaghian"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190824055421-disneyland-california-castle-super-tease.jpg"}