{"pub": "blastingnews", "url": "https://us.blastingnews.com/opinion/2019/10/donald-trumps-lawyer-rudy-giuliani-indicates-he-will-not-cooperate-if-subpoenaed-003000383.html", "downloaded_at": "2019-10-16 00:26:55.718456+00:00", "title": "Donald Trump's lawyer Rudy Giuliani indicates he will not cooperate if subpoenaed", "language": "en", "text": "Rudy Giuliani indicated to ABC News on Tuesday, that he will not cooperate if a congressional subpoena is issued. The president's personal attorney says he will wait and see what happens. The former New York mayor is obviously taking a page out of the playbook of his most famous client, Donald Trump by operating as if he is above the law. Giuliani also parted ways with lawyer Jon Sale, thus displaying another attribute of U.S.\n\npresident number 45. Whenever those closest to the current commander in chief, don't perform in ways that please him, they are abruptly fired, or suddenly, out of nowhere decide to resign their positions.\n\nRudy Giuliani is a chip off the old Trump block\n\nSince becoming the 45th president of the United States, Donald Trump has run the White House in the same manner in which he operated on the televisions show, \"The Apprentice.\" He has fired White House employees left and right, and caused others to abruptly resign their positions.\n\nTrump also thus far has refused to turn over his tax returns to congress. Now his personal lawyer, Rudy Giuliani seems to be following his lead and proving he is a chip off the old Trump block.\n\nThe former mayor of New York recently announced that he will not comply with a congressional subpoena and today was his deadline. He also made it known that he was parting ways with lawyer Jon Sale, shortly after Sale gave his testimony to congress.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. Donald Trump\n\nIn addition, Rudy Giuliani has also refused to hire himself a criminal lawyer. He is conducting himself as if he has nothing to worry about and not taking his current situation very seriously.\n\nRudy Giuliani and Donald Trump set bad examples\n\nThe president of the United States and his personal attorney are setting very bad examples by not complying with the rule of law. Regular Americans must comply with subpoenas and court orders or face prosecution.\n\nThe president and his personal attorney seem to believe they do not have to obey any rules or court orders. CNN correspondent Mahu Raji stated to Brooke Baldwin during her Tuesday afternoon broadcast that scrutiny is growing where both Donald Trump and Rudy Giuliani are concerned.\n\nCNN stated that those who are close to Rudy Giuliani have been advising him for some time, to obtain a personal lawyer.\n\nThis is because two of his associates, Igor Furman, and Levi Parnas were indicted last week for campaign finance violations. Thus far, however, just like Donald Trump, Rudolph William Lewis Giuliani continues to ignore sound wisdom and defy the laws of the land. Stay tuned for updates to this bizarre story because the twists and turns are coming faster and are more furious each time they are announced.", "description": "The former mayor says if he receives a congressional subpoena, he will wait and see what happens.", "authors": ["Music Crowns", "Oliver Vandervoort", "Asmir Pekmic", "Read More On The Same Topic Cheryl Preston", "Trump Says 'Russia", "China", "Or Napoleon Bonaparte' Can Assist Syria In Protecting The Kurds", "Prince William", "Kate Middleton Arrive In Pakistan For Royal Tour", "Faith"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/15/os/b_1200x630/rudy-giuliani-refuses-to-comply-with-congressional-subpeonaimage-source-crainsnewyorkcom_2339903.jpg", "published_at": "2019-10-15"}