{"pub": "afr", "url": "https://afr.com/world/asia/china-s-economic-growth-misses-forecasts-in-third-quarter-20191018-p531yj", "downloaded_at": "2019-10-18 03:21:10.431153+00:00", "title": "China's economic growth misses forecasts in third quarter", "language": "en", "text": "Shenzhen | China's economy grew at a weaker-than-expected 6 per cent in the third quarter as Donald Trump's trade tariffs and weaker consumer spending had GDP coming in at the bottom end of the government's target and a fresh 30-year low.\n\nWhile still the envy of Australia and most Western economies, China's slowing economy poses a huge challenges for the ruling Communist Party as it races to pay down debt and counter US tariffs while maintaining the stability that has been the key to its tight grip on power.\n\nGDP was 6 per cent from July to September, down from 6.2 per cent in the second quarter and below economists' forecasts for 6.1 per cent growth. It was the lowest rate of growth since 1992 and further evidence that Washington's trade war is putting pressure on the world's second-largest economy after decades of double-digit growth.\n\nChina acknowledged the \"external pressures\" on its economy when it released the latest economic data on Friday as it highlighted the need for reform and stable employment.\n\n\"The economy is stable for the first three quarters but we need to be aware the economic situation is complex and severe. Global economic growth is slowing and there are increasing uncertainties,\" the government said.\n\nGrowth for the first three quarters was 6.2 per cent, within the government's official target for the year of 6-6.5 per cent. However, economists outside China warn the official government data is unreliable and growth could be as low as 4 per cent.", "description": "China's economy rose 6 per cent in the third quarter, missing expectations for a 6.1 per cent rise as US tariffs bite.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3636%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_259%2C$y_60/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/d1f95d3a769f57d1db1e811a45d3684c8cea62b0", "published_at": "2019-10-18"}