{"pub": "fox", "url": "https://foxnews.com/entertainment/jenny-mccarthy-reveals-she-and-husband-donnie-wahlberg-do-it-in-airport-bathrooms", "downloaded_at": "2019-10-03 07:32:06.868760+00:00", "published_at": "2019-10-02", "title": "Jenny McCarthy says she and husband, Donnie Wahlberg, 'do it' in airport bathrooms: ‘Did I just say that?’", "language": "en", "text": "File this one under \"too much information.\"\n\nJenny McCarthy recently acknowledged doing the unthinkable with husband, Donnie Wahlberg.\n\nAnd not just once.\n\nBROOK SHIELDS SAYS SHE LOST 'VIEW' CO-HOSTING GIG TO JENNY McCARTHY\n\nMcCarthy made an appearance on “Watch What Happen’s Live with Andy Cohen” on Tuesday night when asked if she would consider a return to reality TV, the “Masked Singer” panelist revealed that she and her boy-band/actor husband spend so much time away from each other, they’re relegated to “doing it in airport bathrooms.”\n\n“Did I say that out loud?” she asked with a smirk after quickly glossing over the remark.\n\nMcCarthy, 46, and Wahlberg, 50, starred in their own reality series for A&E Networks called “Donnie Loves Jenny.” The program, which followed the pair and their family as they adjust to married life together, aired from January 2015 to April 2016.\n\nDONNIE WAHLBERG SAYS HE STARVED HIMSELF FOR ROLE IN 'THE SIXTH SENSE': 'I WAS GOING THROUGH HELL'\n\n“It was one of my favorites,” said “Real Housewives of Orange County” star Gina Kirschenheiter.\n\nWhen a woman called in to ask McCarthy about jumping back into the reality mix, the host and pop culture expert said that while it's not an outlandish idea, it is unlikely.\n\n“It’s not – possibly. I think right now, no,” said McCarthy. “Because it’s hard to see each other. We’re like, doing it in airport bathrooms.”\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nWahlberg is the host of the crime drama “Very Scary People” on YouTube TV, which chronicles the lives of the most frightening criminals in recent history. A second season has been ordered on HLN. He also stars in the CBS’ “Blue Bloods” and the unscripted A&E series “Wahlburgers.”", "description": "File this one under ‘too much information.’", "authors": ["Julius Young", "Julius Is An La Entertainment Reporter For Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/wahlberg-donnie-reuters-660.jpg"}