{"pub": "independent", "url": "https://independent.co.uk/life-style/james-corden-fat-shaming-bill-maher-response-late-late-show-video-a9103746.html", "downloaded_at": "2019-09-13 18:31:30.982078+00:00", "title": "James Corden responds to Bill Maher’s comments on weight: ‘Fat-shaming never went anywhere’", "language": "en", "text": "James Corden has condemned comments made by Bill Maher about fat-shaming, including the affirmation that it \"needs to make a comeback\".\n\nOn Thursday, Corden released a clip on YouTube from The Late Late Show with James Corden in which he addressed the derogatory remarks made by Maher last week.\n\nWhile speaking on Real Time with Bill Maher, the comedian and political commentator stated: \"Being fat isn't a birth defect. Nobody comes out of the womb needing to buy two seats on the airplane.\"\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMaher also said that in his opinion, fat-shaming \"doesn't need to end\", adding that \"some amount of shame is good\".\n\nCorden issued a chastising response to Maher's comments, stating that fat-shaming \"never went anywhere\".\n\n\"I mean, ask literally any fat person,\" Corden said. \"We are reminded of it all the time.\"\n\nCorden continued, explaining that there is a \"common and insulting misconception that fat people are stupid and lazy\".\n\nThe 41-year-old explained that he has struggled with weight management throughout his life and has been \"off and on diets\" on a regular basis.\n\n\"Here's the thing – we're not all as lucky as Bill Maher. We don't all have a sense of superiority that burns 35,000 calories a day,\" Corden said.\n\nThe Cats actor added that while he believes that Maher thinks he is offering \"tough love\" to people who are overweight, he is in fact \"working against his own cause\".\n\nShape Created with Sketch. James Corden's Carpool Karaoke best moments Show all 12 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. James Corden's Carpool Karaoke best moments 1/12 Corden texts Leonardo DiCaprio from J Lo's phone ...and he replies! 'Hey baby,' Corden writes. 'I'm kind of feeling like I need to cut loose. Any suggestions, let me know. J Lo (you know, from the block).' Leo's reply? 'You mean tonight, boo boo? Club wise?' YouTube 2/12 Sia explains why she wears her face wig 'I don't wear this unless there's cameras around,' she said. 'I only wear this just to try and maintain a modicum of privacy.' Fair dos. 3/12 Elton John sings 'Circle of Life' as Corden's mind is blown Who wouldn't love a car journey with the legend singing the likes of 'Your Song'? 4/12 Chris Martin reveals Coldplay used to be called Starfish Doesn't quite have the same ring to it does it? This one also featured a tribute to David Bowie as the pair sung along to 'Heroes' 5/12 Corden drives Justin Bieber to the Grammys Where he went on to win his first gong from the awards! Check out those tuxedos. Looking suave guys. 6/12 Adele showcases her love for the Spice Girls With a top rate rendition of 'Wannabe' no less. She also promised not to name yet another album after her age. 7/12 One Direction succumb to their boyband status and dress in denim Asking One Direction to perform his favourite album track, he fills them in on a choreographed dance routine and provides them with matching denim jackets. 8/12 Stevie Wonder forms a supergroup with James Corden Namely The Wonder Cats. Telling Corden they're going to write new lyrics to his songs, the two do just that with a rendition of Wonder's classic Signed Sealed Delivered. 9/12 Jennifer Hudson sings to a drive-through takeaway employee Pulling into a drive-through, Hudson belts out hers and Corden's takeaway to the awe of the employee on the other side of the intercom. 10/12 Iggy Azalea goes wedding dress shopping Ahead of her wedding, Corden takes it upon himself to stop off at a wedding dress shop to sample the best there is on offer - and naturally gets involved himself. 11/12 Mariah Carey shows off her accents The singing icon uses the opportunity to sample her British and Southern American accents to the delight of Corden. 12/12 Jason Derulo gives a lesson in swag Rapper Jason Derulo helps James Corden become \"the swaggiest dude in the club.\" 1/12 Corden texts Leonardo DiCaprio from J Lo's phone ...and he replies! 'Hey baby,' Corden writes. 'I'm kind of feeling like I need to cut loose. Any suggestions, let me know. J Lo (you know, from the block).' Leo's reply? 'You mean tonight, boo boo? Club wise?' YouTube 2/12 Sia explains why she wears her face wig 'I don't wear this unless there's cameras around,' she said. 'I only wear this just to try and maintain a modicum of privacy.' Fair dos. 3/12 Elton John sings 'Circle of Life' as Corden's mind is blown Who wouldn't love a car journey with the legend singing the likes of 'Your Song'? 4/12 Chris Martin reveals Coldplay used to be called Starfish Doesn't quite have the same ring to it does it? This one also featured a tribute to David Bowie as the pair sung along to 'Heroes' 5/12 Corden drives Justin Bieber to the Grammys Where he went on to win his first gong from the awards! Check out those tuxedos. Looking suave guys. 6/12 Adele showcases her love for the Spice Girls With a top rate rendition of 'Wannabe' no less. She also promised not to name yet another album after her age. 7/12 One Direction succumb to their boyband status and dress in denim Asking One Direction to perform his favourite album track, he fills them in on a choreographed dance routine and provides them with matching denim jackets. 8/12 Stevie Wonder forms a supergroup with James Corden Namely The Wonder Cats. Telling Corden they're going to write new lyrics to his songs, the two do just that with a rendition of Wonder's classic Signed Sealed Delivered. 9/12 Jennifer Hudson sings to a drive-through takeaway employee Pulling into a drive-through, Hudson belts out hers and Corden's takeaway to the awe of the employee on the other side of the intercom. 10/12 Iggy Azalea goes wedding dress shopping Ahead of her wedding, Corden takes it upon himself to stop off at a wedding dress shop to sample the best there is on offer - and naturally gets involved himself. 11/12 Mariah Carey shows off her accents The singing icon uses the opportunity to sample her British and Southern American accents to the delight of Corden. 12/12 Jason Derulo gives a lesson in swag Rapper Jason Derulo helps James Corden become \"the swaggiest dude in the club.\"\n\n\"It is proven that fat-shaming only does one thing – it makes people feel ashamed,\" Corden asserted.\n\n\"And shame leads to depression, anxiety and self-destructive behaviour. Self-destructive behaviour like over-eating.\"\n\nCorden went on to explain the complexities of the obesity crisis, outlining how childhood obesity is linked to growing up in poverty.\n\nThe Into The Woods star added that genetics can also increase a person's risk of becoming overweight.\n\n\"Until we make healthy food and healthcare more accessible and we properly educate people on nutrition and exercise, maybe we can hold back on the whole 'call fat people virgins until they lose weight' strategy,\" he said.\n\nCorden concluded his segment with a direct message to Maher.\n\n\"Bill, please hear me when I say this,\" Corden said. \"While you're encouraging people to think about what goes into their mouths, just think a little harder about what comes out of yours.\"\n\nSeveral Twitter users praised Corden for taking a stand against Maher's stance on fat-shaming.\n\n\"This is absolutely brilliant and I love you for it. Thank you for using your platform for this,\" one person tweeted.\n\n\"Bravo James, well said. You reminded us that fat-shaming is bullying and bullying is not OK,\" another commented.\n\n\"Bullies have to be called out, and you handled the whole thing with great sensitivity.\"", "description": "James Corden has condemned comments made by Bill Maher about fat-shaming, including the affirmation that it \"needs to make a comeback\".", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/13/10/james-corden-main.jpg", "published_at": "2019-09-13"}