{"pub": "politico", "url": "https://politico.com/story/2019/09/12/swearing-democratic-debate-2020-houston-1493028", "downloaded_at": "2019-09-12 23:42:18.759105+00:00", "title": "Candidates warned not to swear at Dem debate", "language": "en", "text": "If any Democrat is in danger of flouting the network’s request not to swear, it’s former Rep. Beto O’Rourke. | Scott Eisen/Getty Images 2020 Elections Candidates warned not to swear at Dem debate\n\nThe first Democratic debate produced brief bursts of Spanish oratory from the White House aspirants, but ABC News warned candidates ahead of Thursday night’s forum that the network won’t pardon their French.\n\nThe 10 competitors set to appear on stage in Houston were cautioned to “avoid cursing or expletives in accordance with federal law and FCC guidelines.” The directive from debate broadcaster ABC was sent to the Democratic National Committee earlier this week and forwarded to the participating candidates’ campaigns.\n\nStory Continued Below\n\n“We wanted to take this opportunity to remind you that, as the debate will air on the ABC broadcast network, we are governed by Federal Communication Commission indecency rules,” the memo states. “We will not be broadcasting on any delay, so there will be no opportunity to edit out foul language.”\n\nTensions among candidates have occasionally spiked at the party’s previous two televised debates amid critiques of policy records and efforts to achieve an on-air viral moment.\n\nposter=\"https://static.politico.com/7f/40/f2b649eb45bc9c3ae674d3479cd2/fall-debates.png\" true\n\nIt remains extremely unlikely ABC’s moderators will have to manage any swearing by the contenders vying to become the next commander in chief, but if any Democrat is in danger of flouting the network’s request, it’s Beto O’Rourke.\n\nThe former Texas congressman has adopted a less restrained attitude on the 2020 trail in the weeks since a mass shooting in his hometown of El Paso — sometimes employing the F-word and other impassioned rhetoric to argue an urgent case for firearm reforms and other planks of his agenda.\n\nDiscussing gun violence earlier this month during an interview on CNN, he declared: “Yes, this is f----- up.”", "description": "The 10 competitors were told to “avoid cursing or expletives in accordance with federal law and FCC guidelines.”", "authors": ["Quint Forgey"], "top_image": "https://static.politico.com/94/8a/5c1a0a644900aa117d076b1bf030/20190912-beto-orourke-gty-773.jpg", "published_at": "2019-09-12"}