{"pub": "independent", "url": "https://independent.co.uk/voices/brexit-boris-johnson-no-deal-diabetes-epilepsy-drugs-a9174656.html", "downloaded_at": "2019-10-29 08:42:22.324470+00:00", "title": "A no-deal Brexit is a life and death situation for me", "language": "en", "text": "An outpouring of jokes at the expense of the \"Bo-zo\" in Number 10 accompanied the EU’s grant of a Brexit extension. It was no more than Boris Johnson, who’d promised to \"die in a ditch\" rather than break his self-imposed deadline of October 31, deserved.\n\nPersonally, though, I found it hard to laugh too hard. Instead I celebrated the prime minister’s humiliation by sticking a needle into my guts and pushing the plunger. It was my personal gesture to the man a few tens of thousands of ageing Tory members put in charge of the country.\n\nCan you blame me? Johnson’s “do or die” pledge called for people like me, who live with type one diabetes, to do the dying. We, and everyone else with long-term medical conditions were slated to end up in his oft quoted ditch. Fortunately, the EU has rather more humanity than Johnson; for at least the next three months, the 400,000 of us who acquired diabetes via an autoimmune disorder should be able to count on reliable supplies of imported insulin.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nShape Created with Sketch. Best pictures from Final Say Brexit march Show all 76 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Best pictures from Final Say Brexit march 1/76 Crowds march through central London Getty 2/76 Angela Christofilou/The Independent 3/76 Protesters gather in Parliament Square Led By Donkeys 4/76 Mayor of London Sadiq Khan joins protesters PA 5/76 Angela Christofilou/The Independent 6/76 Angela Christofilou/The Independent 7/76 Angela Christofilou/The Independent 8/76 Angela Christofilou/The Independent 9/76 Anti-Brexit protesters fill Parliament Square in London PA 10/76 Angela Christofilou/The Independent 11/76 Angela Christofilou/The Independent 12/76 Angela Christofilou/The Independent 13/76 Angela Christofilou/The Independent 14/76 Angela Christofilou/The Independent 15/76 Angela Christofilou/The Independent 16/76 Angela Christofilou/The Independent 17/76 Angela Christofilou/The Independent 18/76 Angela Christofilou/The Independent 19/76 Angela Christofilou/The Independent 20/76 A demonstrator marches EPA 21/76 Angela Christofilou/The Independent 22/76 Angela Christofilou/The Independent 23/76 Angela Christofilou/The Independent 24/76 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London PA 25/76 EU supporters react after the result of the vote on the deal delay was announced at the House of Commons REUTERS 26/76 A demonstrator carries his dog draped in EU flag AP 27/76 Thousands of people taking part in a People's Vote march AFP/Getty 28/76 Protesters use their flags to shelter from the rain Getty Images 29/76 Protesters march towards Parliament Square Getty Images 30/76 Anti-Brexit demonstrators carry placards and EU flags AP 31/76 Sir Oliver Letwin MP in Parliament Square, London, during an an anti-Brexit, Let Us Be Heard rally, after it was announced that the Letwin amendment, which seeks to avoid a no-deal Brexit on October 31, has been accepted PA 32/76 Thousands of people taking part in a People's Vote march UK BROADCASTERS POOL/AFP via Get 33/76 A protester with \"Bollocks to Brexit\" stickers on his head Getty Images 34/76 Demonstrators march EPA 35/76 Britain's main opposition Labour Party shadow Secretary of State for Exiting the EU Keir Starmer, shadow Home Secretary Dianne Abbott, shadow Chancellor of the Exchequer John McDonnell, shadow Foreign Secretary Emily Thornberry speaks on stage in Parliament Square AFP via Getty Images 36/76 Anti-Brexit supporters cheer outside parliament AP 37/76 A EU supporter waves flags REUTERS 38/76 Anti-Brexit supporters AP 39/76 Protesters shout and chant demanding a final say Getty Images 40/76 Police look towards protesters Getty Images 41/76 Pro-Brexit protesters outside the Houses of Parliament in London PA 42/76 People taking part in an Anti-Brexit, Let Us Be Heard march head to Parliament Square in London PA 43/76 People taking part in an Anti-Brexit, Let Us Be Heard march in Trafalgar Square PA 44/76 Anti-Brexit supporters cheer outside parliament AP 45/76 People taking part in an Anti-Brexit, Let Us Be Heard march past Trafalgar Square PA 46/76 Protesters shout and chant Getty Images 47/76 Cory (7) sits on his father's shoulders as protesters march towards Parliament Square Getty Images 48/76 People attend the 'Together for the Final Say' march EPA 49/76 Protesters march towards Parliament Square Getty Images 50/76 Mayor of London Sadiq Khan speaks on stage PA 51/76 A woman in EU costume EPA 52/76 Anti-Brexit protesters fill Parliament Square in London PA 53/76 Anti-Brexit protesters AP 54/76 Anti-Brexit protesters hold an Independent banner Angela Christofilou/The Independent 55/76 Protesters hold an anti-Brexit placard by The Independent stall during the Final Say Brexit march in London Tom Richell 56/76 Anti-Brexit protesters in Parliament Square, London, PA 57/76 Demonstrators hold placards and EU flags AFP/Getty 58/76 An anti-Brexit protester joins in the Final Say Brexit march on 19 October AP 59/76 EU supporters march in London REUTERS 60/76 Sir Patrick Stewart and Paul McGann join in the Final Say Brexit march in London on 19 October PA 61/76 EU supporters march Reuters 62/76 A demonstrator shouts into a megaphone as she marches AFP via Getty Images 63/76 A dog dressed in an anti-Brexit placard is walked in the Final Say Brexit march in London EPA 64/76 EU supporters march REUTERS 65/76 A morris dancer takes part in the Final Say Brexit march in London PA 66/76 Whippets are dressed in EU flag clothing during the Final Say Brexit march in London AP 67/76 Protesters march towards parliament in the Final Say Brexit march in London on 19 October 2019 PA 68/76 An anti-Brexit demonstrator takes part in the Final Say Brexit march in London AFP/Getty 69/76 EU supporters call on the government to give Britons a vote on the final Brexit deal Reuters 70/76 Anti-Brexit protesters Angela Christofilou/The Independent 71/76 An anti-Brexit protester Angela Christofilou/The Independent 72/76 Anti-Brexit protesters demonstrate in London during the Final Say Brexit march on 19 October AP 73/76 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London AFP/Getty 74/76 Protesters march towards parliament from Park Lane in the Final Say Brexit march in London on 19 October 2019 PA 75/76 Marchers visit The Independent stall during the Final Say March in London Tom Richell 76/76 An anti-Brexit protester holds a sign calling for a Final Say during a march in London EPA 1/76 Crowds march through central London Getty 2/76 Angela Christofilou/The Independent 3/76 Protesters gather in Parliament Square Led By Donkeys 4/76 Mayor of London Sadiq Khan joins protesters PA 5/76 Angela Christofilou/The Independent 6/76 Angela Christofilou/The Independent 7/76 Angela Christofilou/The Independent 8/76 Angela Christofilou/The Independent 9/76 Anti-Brexit protesters fill Parliament Square in London PA 10/76 Angela Christofilou/The Independent 11/76 Angela Christofilou/The Independent 12/76 Angela Christofilou/The Independent 13/76 Angela Christofilou/The Independent 14/76 Angela Christofilou/The Independent 15/76 Angela Christofilou/The Independent 16/76 Angela Christofilou/The Independent 17/76 Angela Christofilou/The Independent 18/76 Angela Christofilou/The Independent 19/76 Angela Christofilou/The Independent 20/76 A demonstrator marches EPA 21/76 Angela Christofilou/The Independent 22/76 Angela Christofilou/The Independent 23/76 Angela Christofilou/The Independent 24/76 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London PA 25/76 EU supporters react after the result of the vote on the deal delay was announced at the House of Commons REUTERS 26/76 A demonstrator carries his dog draped in EU flag AP 27/76 Thousands of people taking part in a People's Vote march AFP/Getty 28/76 Protesters use their flags to shelter from the rain Getty Images 29/76 Protesters march towards Parliament Square Getty Images 30/76 Anti-Brexit demonstrators carry placards and EU flags AP 31/76 Sir Oliver Letwin MP in Parliament Square, London, during an an anti-Brexit, Let Us Be Heard rally, after it was announced that the Letwin amendment, which seeks to avoid a no-deal Brexit on October 31, has been accepted PA 32/76 Thousands of people taking part in a People's Vote march UK BROADCASTERS POOL/AFP via Get 33/76 A protester with \"Bollocks to Brexit\" stickers on his head Getty Images 34/76 Demonstrators march EPA 35/76 Britain's main opposition Labour Party shadow Secretary of State for Exiting the EU Keir Starmer, shadow Home Secretary Dianne Abbott, shadow Chancellor of the Exchequer John McDonnell, shadow Foreign Secretary Emily Thornberry speaks on stage in Parliament Square AFP via Getty Images 36/76 Anti-Brexit supporters cheer outside parliament AP 37/76 A EU supporter waves flags REUTERS 38/76 Anti-Brexit supporters AP 39/76 Protesters shout and chant demanding a final say Getty Images 40/76 Police look towards protesters Getty Images 41/76 Pro-Brexit protesters outside the Houses of Parliament in London PA 42/76 People taking part in an Anti-Brexit, Let Us Be Heard march head to Parliament Square in London PA 43/76 People taking part in an Anti-Brexit, Let Us Be Heard march in Trafalgar Square PA 44/76 Anti-Brexit supporters cheer outside parliament AP 45/76 People taking part in an Anti-Brexit, Let Us Be Heard march past Trafalgar Square PA 46/76 Protesters shout and chant Getty Images 47/76 Cory (7) sits on his father's shoulders as protesters march towards Parliament Square Getty Images 48/76 People attend the 'Together for the Final Say' march EPA 49/76 Protesters march towards Parliament Square Getty Images 50/76 Mayor of London Sadiq Khan speaks on stage PA 51/76 A woman in EU costume EPA 52/76 Anti-Brexit protesters fill Parliament Square in London PA 53/76 Anti-Brexit protesters AP 54/76 Anti-Brexit protesters hold an Independent banner Angela Christofilou/The Independent 55/76 Protesters hold an anti-Brexit placard by The Independent stall during the Final Say Brexit march in London Tom Richell 56/76 Anti-Brexit protesters in Parliament Square, London, PA 57/76 Demonstrators hold placards and EU flags AFP/Getty 58/76 An anti-Brexit protester joins in the Final Say Brexit march on 19 October AP 59/76 EU supporters march in London REUTERS 60/76 Sir Patrick Stewart and Paul McGann join in the Final Say Brexit march in London on 19 October PA 61/76 EU supporters march Reuters 62/76 A demonstrator shouts into a megaphone as she marches AFP via Getty Images 63/76 A dog dressed in an anti-Brexit placard is walked in the Final Say Brexit march in London EPA 64/76 EU supporters march REUTERS 65/76 A morris dancer takes part in the Final Say Brexit march in London PA 66/76 Whippets are dressed in EU flag clothing during the Final Say Brexit march in London AP 67/76 Protesters march towards parliament in the Final Say Brexit march in London on 19 October 2019 PA 68/76 An anti-Brexit demonstrator takes part in the Final Say Brexit march in London AFP/Getty 69/76 EU supporters call on the government to give Britons a vote on the final Brexit deal Reuters 70/76 Anti-Brexit protesters Angela Christofilou/The Independent 71/76 An anti-Brexit protester Angela Christofilou/The Independent 72/76 Anti-Brexit protesters demonstrate in London during the Final Say Brexit march on 19 October AP 73/76 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London AFP/Getty 74/76 Protesters march towards parliament from Park Lane in the Final Say Brexit march in London on 19 October 2019 PA 75/76 Marchers visit The Independent stall during the Final Say March in London Tom Richell 76/76 An anti-Brexit protester holds a sign calling for a Final Say during a march in London EPA\n\nThere will be no gummed-up ports. The creation of the world’s biggest lorry park in Kent is on hold. Handing a prescription to the pharmacist will involve a wait of maybe ten minutes as opposed to… well, nobody really knows. That’s the problem.\n\nAnother problem is that the threat remains, as Hugo Dixon, the deputy chair of the People’s Vote campaign, pointed out this week. So every time the needle pierces my skin to deliver the stuff that keeps me alive, there’ll be a frisson of fear.\n\nThe same applies to those among Britain’s 3 million or so type two diabetics who also require drugs. Ditto the 500,000 who have epilepsy, which is controlled by, drugs. Did you know that more than 360,000 new cases of cancer are diagnosed in Britain each year? Guess what treating them requires.\n\nThese are just a few examples. According to healthcare charity the King’s Fund, there are 15 million people in the UK with some sort of long-term health condition.\n\nI know what you're saying: don't worry, the government is stockpiling. But if you trust the government, and in particular, this government, to get that right given its record on big projects, then you’re shockingly naive. Put “universal credit” into Google, for example, and look at what was said about it. Then look at what we’ve ended up with. Nothing this government says can be relied upon.\n\nThe impact of Brexit on us, or at least a no-deal Brexit, occasionally gets discussed by the UK media but rarely in great depth as the interminable manoeuvrings at Westminster continue.\n\nNo doubt there’ll be some wombat in the prime minister’s office who’ll say that if MPs would just back his putrid deal we’d be able to move on to the BoZo’s priorities for Britain, which appear to involve screwing it up and then dismembering it.\n\nTheresa May said much the same thing about her slightly less rotten offer, although comparing one to the other is like comparing a plate full of rotting meat with a bowl of month-old mussels harvested from the rocks near a chemical plant.\n\nMay’s deal would have cost Britain billions; Johnson’s will cost still more if he can find a way to force it through.\n\nA no-deal Brexit would risk lives on day one because of the walls Johnson and his friends want to throw up around Britain en route to turning us into some sort of foggy Singapore, a damp playground for the casino capitalists who fill Tory coffers and get to eat rubber chicken with ministers at the repulsive events they hold to say thanks.\n\nBut their alternatives aren’t much better. The impact on the NHS that supplies the medication 15m Britons rely upon hardly bears thinking about, and that’s assuming it doesn’t get broken up and sold off by a future Conservative administration. Which isn’t a credible assumption.\n\nNo, Johnson’s “deal” is just another con, one in a long line of them.\n\nThe best option for those of us with medical issues is remaining in the EU with the agreement we currently have, which is far superior to anything he, Theresa May, or anyone else has come up with.\n\nThat would require a referendum first, I recognise that. Those who, like Dixon, are campaigning for one really need to draw a line under the recent bout of infighting and get their acts together.\n\nThis isn’t a game. For millions of us, it’s a life and death struggle. The stakes couldn’t be any higher.", "description": "An outpouring of jokes at the expense of the \"Bo-zo\" in Number 10 accompanied the EU’s grant of a Brexit extension. It was no more than Boris Johnson, who’d promised to \"die in a ditch\" rather than break his self-imposed deadline of October 31, deserved.", "authors": ["James Moore"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/01/17/diabetes-drugs.jpg", "published_at": "2019-10-29"}