{"pub": "businessinsider", "url": "https://businesstimes.com.sg/energy-commodities/sempra-nears-us3b-chile-sale-to-chinas-state-grid-sources ", "downloaded_at": "2019-10-12 00:34:18.434593+00:00", "title": "Sempra nears US$3b Chile sale to China's State Grid: sources", "language": "en", "text": "US power company Sempra Energy is near an agreement to sell its Chilean business to State Grid Corporation of China for close to US$3 billion, the latest deal in its bid to shed non-core assets, people familiar with the matter said on Friday.\n\n[HONG KONG] US power company Sempra Energy is near an agreement to sell its Chilean business to State Grid Corporation of China for close to US$3 billion, the latest deal in its bid to shed non-core assets, people familiar with the matter said on Friday.\n\nSempra has been seeking to bolster its finances and increase its appeal to investors after a wave of wildfires in California exposed it and other utilities to more legal liabilities. It also came under pressure from hedge fund Elliott Management Corp and investment firm Bluescape Group to scale back its global operations.\n\nSempra's deal with State Grid Corporation of China could be announced as early as next week, the sources said, cautioning it was still possible that negotiations may falter at the last minute and asking not to be identified because the matter is confidential.\n\nSempra declined to comment, while State Grid Corporation of China did not immediately respond to requests for comment.\n\nsentifi.com Market voices on:\n\nChina, whose booming economy over the past two decades has driven up demand for South America's raw materials, has been investing more in Chile as it seeks to secure resources.\n\nChile, among Latin America's most open economies and the world's top copper exporter, has sought to remain neutral amid the growing trade tensions between China and the United States, promoting instead the need for open markets.\n\nSempra said in January it would wind down its South American businesses. Last month, it announced it would sell its Peruvian businesses to a unit of China Yangtze Power Co for US$3.6 billion, as it focuses on its core US and Mexican markets.\n\nElliott has now exited its investment in Sempra, according to its latest quarterly regulatory filing.\n\nSempra's Chilean businesses include Chilquinta Energía SA, the third-largest distributor of electricity in the country, and Tecnored SA, which provides construction services to Chilquinta.\n\nState Grid Corporation of China beat out a number of other bidders. Italian utility Enel had said in June it had made a bid for both the Chilean and Peruvian businesses.\n\nBased in San Diego, Sempra owns power utilities that collectively have the largest US customer base. It has about 40 million customers, and is active in California, Texas and Mexico. It also participates in the export market for liquefied natural gas, with Saudi Aramco as one of its clients.\n\nREUTERS", "description": ": THE BUSINESS TIMES Energy & Commodities - [HONG KONG] US power company Sempra Energy is near an agreement to sell its Chilean business to State Grid Corporation of China for close to US$3 billion, the latest deal in its bid to shed non-core assets, people familiar with the matter said on Friday. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/12/nz_sempra_121040_0.jpg?itok=4Vnvk9bx", "published_at": "2019-10-11"}