{"pub": "abcnews", "url": "https://abcnews.go.com/US/man-allegedly-raped-strangled-teen-1984-identified-genetic/story?id=66467113", "downloaded_at": "2019-10-23 16:38:39.957585+00:00", "title": "Man who allegedly raped, strangled teen in 1984 identified with genetic genealogy: Sheriff", "language": "en", "text": "Genetic genealogy has led authorities to the man who allegedly raped and strangled to death a Wisconsin teenager decades ago.\n\nBut there will be no arrest since the suspect, Philip Cross, died of a drug overdose in 2012, Ozaukee County Sheriff Jim Johnson said at a news conference on Tuesday.\n\nOn the morning of Dec. 15, 1984, Traci Hammerberg, 18, was found battered and naked from the waist down, lying on a driveway, Johnson said. She had been violently raped, strangled and repeatedly struck on the side of her head, the sheriff said.\n\nThe night before, she had gone to a party with friends, and was last seen leaving the party on foot, the sheriff said.\n\n\"She was known to accept rides from people she knew, or hitchhike,\" the sheriff said.\n\nOzaukee County Sheriffs Office\n\nCross, who was 21 at the time of the crime, was identified as a suspect this year after investigators turned to genetic genealogy, which uses an unknown suspect's DNA from a crime scene to trace his or her family tree based on relatives who voluntarily submitted their DNA to a public database.\n\nThe first public arrest through genetic genealogy was the April 2018 arrest of the suspected \"Golden State Killer.\"\n\nSince then, genetic genealogy has helped lead to dozens of other suspect identifications. But it has also drawn criticism from some civil liberties advocates, who say it raises significant privacy concerns.\n\nThe DNA left on Hammerberg's body was uploaded to a public genetic genealogy database, which analysts used to begin building a family tree of the possible suspect, the sheriff said.\n\nThe closest relative was a second cousin, the sheriff said, and from there, analysts started building a family tree and looking for related men who could have been a suspect.\n\nOn Aug. 28, Philip Cross was identified as a potential suspect, the sheriff said. His DNA was obtained from his 2012 autopsy, and on Sept. 3, investigators got confirmation that the DNA profile from Hammerberg's body was consistent with Cross' DNA, Johnson said.\n\nCross was never interviewed in connection to Hammerberg's killing, authorities said, though they might have known one another. Hammerberg's brother says Cross used to ride the same school bus as them, authorities said.\n\nIn a police interview in 1978 following a reported car theft, Cross allegedly said he \"sometimes\" \"does things without realizing what he's doing,\" the sheriff said.\n\nCross served time in prison for forgery and was released in April 1984, Johnson said.\n\nIn 1991 Cross allegedly tried to strangle a woman; the woman escaped and said she did not know what triggered Cross to attack her, Johnson said.\n\nThe sheriff said he has \"mixed feelings\" that Cross cannot be arrested for this crime.\n\n\"I wanted him to face greater justice. He stole Traci's life. he was able to live the life he wanted,\" Johnson said.", "description": "Traci Hammerberg, 18, was murdered on Dec. 15, 1984.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/hammerberg-cold-case-ht-jt-191023_hpMain_16x9_992.jpg", "published_at": "2019-10-23"}