{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/25/andrew-pollack-parkland-scott-israel-vote", "downloaded_at": "2019-10-27 00:31:54.987507+00:00", "title": "Andrew Pollack: Democrats Care More About Power than Murdered Parkland Kids", "language": "en", "text": "I was never a political guy until my daughter was murdered in the Parkland school shooting last year.\n\nAfter that, I got quite the political education.\n\nOne party wanted to understand everything that went wrong in order to take concrete steps to make schools safer: Republicans.\n\nOne party wanted to exploit the murder of my daughter and 16 others to attack their political opponents and grow their own power: Democrats.\n\nPresident Trump formed a federal school safety commission to write a report on best practices in school safety. Speaker of the House Nancy Pelosi (D-CA and congressional Democrats used the shooting – and even the report – as just another opportunity to attack Trump.\n\nFlorida Governor Rick Scott passed historic school safety legislation and launched a state commission to investigate what went wrong in Parkland. Florida Democrats used the shooting as an opportunity to attack Scott and try to flip Florida blue.\n\nI wanted to know everything that happened, expose all of the failures, and hold people accountable. Because I didn’t simply want to blame the National Rifle Association (NRA), the media labeled me the “pro-gun” Parkland dad.\n\nIt didn’t make much sense to me until I conducted my own investigation, which turned into a book: Why Meadow Died – The People and Policies that Created the Parkland Shooter and Endanger America’s Students.\n\nMy conclusion: If one single individual in Broward County school district made one single responsible decision about the shooter, it could have been avoided.\n\nBut you can’t even call what happened a “failure” because each obviously recklessly irresponsible decision made perfect sense given the policies of Broward County schools and the Broward Sheriff’s Office.\n\nHere’s a bit from my conclusion:\n\nI’ve been over every inch of what happened. The NRA had nothing to do with it. This happened in a Democrat county with a Democrat sheriff, a Democrat superintendent, and a Democrat school board, implementing Democrat ideas on criminal justice, Democrat ideas on special education, and Democrat ideas on school discipline.\n\nMeanwhile, at the national level, Democrat organizers swooped in and weaponized my daughter’s murder for their Democrat agenda and to fund-raise to elect more Democrats.\n\nOf all of the failures, perhaps the clearest and worst came from the Broward Sheriff’s Office, led by disgraced former Sheriff Scott Israel.\n\nDeputies were called to the shooter’s house 45 times, but he was never arrested – following a policy set by Scott Israel to not arrest juveniles.\n\nEight Broward Deputies arrived on the scene while the shots were still ringing out and didn’t go in – following a policy set by Scott Israel to make confronting an active shooter optional.\n\nSheriff Israel once told CNN that he had shown “amazing leadership.”\n\nApparently, Florida Democrats believe whatever they see on CNN.\n\nGovernor Ron DeSantis removed Sheriff Israel from office. Israel appealed to the Florida Senate – where all but three Florida Senate Democrats voted to reinstate him.\n\nI was pleasantly surprised by Senators Randolph Bracy, Darryl Rouson, Annette Taddeo — all Democrats, but none from Broward County.\n\nFortunately, Florida is a red state. Because the Democrats have proven – once and for all – that they are happy to put more kids’ lives at risk in order to advance their own political power.\n\nPeople ask me all the time, “Andy, why are you so negative about Democrats?” And I tell them to read Why Meadow Died to understand how the Democrats have wrecked public education with policies that led to my daughter’s murder, and then used a tragedy they created to advance their dangerous agenda.\n\nIf a Democrat is elected to the White House, policies that put kids’ lives at risk will become mandatory in all public schools. And every murdered child will become another opportunity for them to attack Republicans and grow their power.\n\nThey have no decency. One Broward Democrat state senator, Perry Thurston, apparently fell asleep during the debate.\n\nBroward Democrat state senator Lauren Book, who served on the state investigative commission, and knew every single failure — who saw the video of my daughter being murdered, and cried with the families — invoked the birthday of a Parkland student before voting to re-instate a sheriff whose failed policies and leadership she knew had allowed this child to be murdered in school.\n\nBut can you even blame her for that? It’s just who she is. She is a Democrat politician.", "description": "Of all of the Parkland failures, perhaps the worst came from the Broward Sheriff’s Office, led by disgraced former Sheriff Scott Israel.", "authors": ["Andrew Pollack"], "top_image": "https://media.breitbart.com/media/2018/02/Broward-County-Sheriff.png", "published_at": "2019-10-25"}