{"pub": "yahoo", "url": "https://news.yahoo.com/iran-yet-evidence-against-detained-093356453.html", "downloaded_at": "2019-10-28 09:51:31.118379+00:00", "title": "Iran yet to give evidence against detained French pair -lawyer", "language": "en", "text": "DUBAI, Oct 28 (Reuters) - Iran has yet to present any evidence against a French-Iranian academic and her French colleague held on security charges, their lawyer said on Monday, in a case that may complicate French efforts to defuse tension between Washington and Tehran.\n\nFrance has demanded that Iran release Roland Marchal, a senior researcher at Science-Po university, and his colleague, Franco-Iranian dual national Fariba Adelkhah.\n\nParis reported Marchal's arrest in mid-October, while Adelkhah has been in prison in Iran since June.\n\n\"My clients' case ... has not been sent to court yet,\" attorney Saeed Dehghan was quoted as saying by the semi-official news agency ISNA.\n\n\"Of course, we are still negotiating with the judiciary and hope that this misunderstanding will be resolved, as there is no evidence to date for the allegations,\" Dehghan said, adding that Adelkhah faced spying charges while her colleague was accused of \"collusion against national security\".\n\nDehghan said he and a colleague had visited the two academics in prison twice, ISNA reported.\n\nAdelkhah and Marchal were arrested at a time when France and other European powers were engaged in a global standoff over Tehran’s 2015 nuclear deal, which the United States abandoned last year.\n\nOn Oct. 9 France issued a new advisory for Iran, warning its nationals to postpone all travel plans.\n\nIt underscored the risk posed by \"the arbitrary arrest and detention practices of the Iranian security and intelligence services, especially with regard to the contacts of foreign nationals with the population, notably for those in universities\".\n\nRights activists have accused Iran of arresting a number of dual nationals to try to win concessions from other countries - a charge that the Islamic republic has regularly dismissed.\n\nIran’s elite Revolutionary Guards have arrested dozens of dual nationals over recent years, mostly on espionage charges. (Reporting by Dubai newsroom; Editing by Clarence Fernandez)", "description": "Iran has yet to present any evidence against a French-Iranian academic and her French colleague held on security charges, their lawyer said on Monday, in a case that may complicate French efforts to defuse tension between Washington and Tehran.  France has demanded that Iran release Roland Marchal, a", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-28"}