{"pub": "cbc", "url": "https://cbc.ca/news/canada/british-columbia/andrew-berry-verdict-1.5296462", "downloaded_at": "2019-09-27 01:31:09.344422+00:00", "title": "B.C. man found guilty in daughters' Christmas Day killings | CBC News", "language": "en", "text": "A B.C. jury has found Andrew Berry guilty in the deaths of his daughters — four-year-old Aubrey Berry and six-year-old Chloe Berry — who were found stabbed to death in an Oak Bay apartment on Christmas Day 2017.\n\nThe jury found him guilty on both counts of second-degree murder on Thursday, after three days of deliberation.\n\nA small gasp of relief was heard from an observer in the gallery of the B.C. Supreme Court after the first verdict was read. Berry showed no sign of emotion.\n\nBerry had pleaded not guilty to both counts, leading to a five-month trial in Vancouver that was live-streamed to a public gallery in a Victoria courtroom.\n\nThe Crown alleged that Berry used a baseball bat and a knife to kill Chloe, then stabbed Aubrey to death before trying to kill himself. He was found lying in the bathtub, naked, suffering from stab wounds.\n\nDuring his testimony, Berry told the court that he and the girls were attacked in his apartment by someone with dark skin and dark hair.\n\nHe testified that he owed a large gambling debt to a loan shark named Paul, and had given a spare set of apartment keys to Paul's associates so they could access packages Berry had agreed to store.\n\nAndrew Berry denied responsibility for the stabbing deaths of his daughters. (Jane Wolsak)\n\nIn his closing arguments on Sept. 20, Crown attorney Patrick Weir said Berry's testimony was \"like the plot from a bad, low-budget movie,\" alleging that there was no loan shark, no intruder and that Berry's wounds were self-inflicted.\n\nWeir argued that Berry killed the girls because of animosity with his estranged wife, Sarah Cotton.\n\nIn his closing submissions, Berry's lawyer, Kevin McCullough, reminded the court that it was the Crown's responsibility to prove beyond a reasonable doubt that his client killed the girls.", "description": "A B.C. jury has found Andrew Berry guilty in the deaths of his daughters — four-year-old Aubrey Berry and six-year-old Chloe Berry — who were found stabbed to death in an Oak Bay apartment on Christmas Day 2017.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.4465390.1569366861!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/chloe-berry-6-and-aubrey-berry-4-victims-in-dec-25-2017-oak-bay-homicides.jpg", "published_at": "2019-09-27"}