{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/2019/09/27/an-airman-was-picking-up-an-award-heroism-first-he-saved-baby", "downloaded_at": "2019-09-27 16:25:07.125656+00:00", "title": "An airman was picking up an award for heroism. But first, he saved a baby.", "language": "en", "text": "\n\nTech. Sgt. Kenneth O'Brien. (Airman 1st Class Mandy Foster/U.S. Air Force)\n\nHe pulled a person from a flaming vehicle in South Korea, served on President Trump’s security detail during the historic summit with North Korean leader Kim Jong Un and played a pivotal role in the widely publicized rescue of junior Thai soccer players trapped in a cave, during which he saved the life of a Thai Navy SEAL.\n\nIn recognition of those acts, U.S. Air Force Tech. Sgt. Kenneth O’Brien was named one of a dozen outstanding airmen of the year. But the Japan-based airman’s impressive résumé didn’t end there. On a Sept. 11 flight back to the United States to pick up the award, the Air Force said, O’Brien squeezed in another heroic act: resuscitating a baby that had lost consciousness after choking.\n\n“I can’t decide if he’s Superman or Mayhem (the guy on the insurance commercials),” Lt. Gen. Jim Slife, head of Air Force Special Operations Command, joked in a Facebook post.\n\nThis dude. He’s TSgt Ken O'Brien...a pararescueman assigned to the 320 STS at Kadena. I can't decide if he's Superman... Posted by AFSOC Commander on Tuesday, September 17, 2019\n\nA native of Bunker Hill, Ind., O’Brien began his Air Force career 12 years ago, leaving for basic training shortly after graduating from high school. He had dreamed of jumping out of planes and helping people since he was 12 years old, calling it his “only goal,” the Air Force reported.\n\nNow, as a special tactics section chief assigned to the 320th Special Tactics Squadron at Kadena Air Base in Japan, O’Brien is constantly looking for opportunities to step up.\n\n[A mistaken text from a stranger led this man to raise money for a sick boy he didn’t know]\n\n“If someone needs to go do something dangerous, I volunteer,” he said in the Air Force interview. “If someone needs a leader, I volunteer. I happened to be in the right place at the right time, and that’s what helped me stand out because I sought out key positions or responsibilities.”\n\nIn the summer of 2018, O’Brien was instrumental in creating the plan to rescue the Thai soccer players and coach stranded inside the Tham Luang Nang Non cave, which made him the American farthest inside the cave, according to the Air Force. He was the first person to reach the children as they made their escape, and told the Air Force that getting the last one out was “a big moment.”\n\n[‘Time is running out’: Inside the treacherous rescue of boys trapped in a Thai cave]\n\nDespite his many daring feats, O’Brien said he was “shocked” to learn he had been named one of the outstanding airmen of the year for 2019.\n\nBut on his flight from Okinawa to Dallas to accept the award during the Air Force Association conference, he proved himself a hero once again. While on the plane with his family, he noticed a 1-year-old choking. He sprang into action, clearing the child’s breathing passage and performing CPR, the Air Force said. He checked on the baby for the rest of the flight.\n\nO’Brien, as usual, was modest about the lifesaving act.\n\n“I’m thankful that the child is okay and that I was able to help when the family needed support,” he said. “I happened to be in the right place at the right time.”\n\nRead more:\n\nHe disclosed his 2-year-old’s cancer in a TED Talk. Liver donors lined up to help.\n\nPolice pack Texas football stands for fallen officer’s son at his first game\n\n‘Blinking Guy’ uses viral GIF of himself for the first time, asks the Internet a favor\n\nComedians are being hired by the hour to help dementia patients. Their goal? ‘A full belly laugh.’", "description": "“If someone needs to go do something dangerous, I volunteer,” he said.", "authors": ["Brittany Shammas", "General Assignment Reporter", "September At Am", "Brittany Shammas Is A General Assignment Reporter For The Washington Post. She Previously Worked For The Miami New Times", "The South Florida Sun Sentinel."], "top_image": "https://www.washingtonpost.com/resizer/6kXx-odqacFxWvbCmauWn-DaQdM=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4TUDNCIOB5DERJRZB6KKUZ42W4.png", "published_at": "2019-09-27"}