{"pub": "metro", "url": "https://metro.co.uk/2019/10/17/paul-dano-cast-riddler-batman-jonah-hill-talks-break-10938730", "downloaded_at": "2019-10-18 01:12:56.748319+00:00", "title": "Paul Dano ‘cast as The Riddler’ in The Batman", "language": "en", "text": "Paul will make a great Riddler (Picture: Picture: DC, Getty)\n\nPaul Dano has reportedly been cast as The Riddler in the upcoming movie The Batman, after Jonah Hill was linked to the role.\n\nReports emerged on Thursday that Paul, 35, had been in talks with director Matt Reed and producers to take on the DC Comics character. But according to Variety, the studio refused to confirm the reports.\n\nIt’s believed Paul will play The Riddler, also known as Edward Nashton, who is a criminal mastermind in Gotham City and incorporates riddles and puzzles into his schemes, leaving them as clues for the authorities to solve.\n\nPaul is best known for roles in Little Miss Sunshine, There Will Be Blood, 12 Years A Slave and Prisoners.\n\nThe character was famously played by Jim Carrey in 1995’s Batman Forever, while Frank Gorshin also played The Riddler in the 1960s Batman TV series.\n\nIt comes after reports that Jonah Hill was previously in talks to take on the role but decided to pass.\n\nAdvertisement\n\nAdvertisement\n\nThis week has brought even more good news for The Batman production, as it was confirmed that Zoe Kravitz is set to play Catwoman.\n\nThe Batman is shaping up to have a stellar cast (Picture: Mega/DC Comics/Getty)\n\nThe Big Little Lies actress sat for a table reading with Robert Pattinson, who will play the titular Caped Crusader, and snapped the role last week.\n\nShe was reportedly up against actresses Ana de Armas, Ella Balinska and Eiza Gonzalez.\n\nCatwoman, aka Selina Kyle, famously has a love-hate relationship with Batman quite literally – sometimes their enemies, sometimes they’re lovers.\n\nThe heroine has been played by some of Hollywood’s foremost darlings, including Halle Berry in 2004’s standalone Catwoman movie, and Michelle Pfeiffer in 1992’s Batman Returns.\n\nBoth stars congratulated Zoe, 30, on the exciting role with Halle writing on Instagram: ‘Special #WCW shout-out to your new #CatWoman, the eternally graceful & extremely bad a*s @zoeisabellakravitz.\n\n‘Keep shining Queen & welcome to the family! #CatWoman [sic].’\n\nMichelle, 61, also said on Good Morning America: ‘I’m so excited,’ before offering advice: ‘Make sure, whilst designing the costume, they consider how you’re going to go to the bathroom. Minor detail, but it’s an important one.’\n\nThe Batman is set to hit cinemas on 25 June 2021.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: The Batman may have found villain as Vincent D’Onofrio teases involvement after Zoe Kravitz casting\n\nMORE: Zoe Kravitz cast to play Catwoman alongside Robert Pattinson in The Batman and we are here for it", "description": "Paul Dano is reportedly in talks to play The Riddler in the forthcoming movie The Batman alongside Robert Pattinson and Zoe Kravitz.", "authors": ["Alicia Adejobi"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_90347768_1571341202.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-17"}