{"pub": "reuters", "url": "https://reuters.com/article/us-tennis-usopen-meghanmarkle/as-serena-fights-for-the-throne-a-duchess-watches-idUSKCN1VS0PG", "downloaded_at": "2019-09-08 12:09:42.817924+00:00", "title": "As Serena fights for the throne, a duchess watches", "language": "en", "text": "NEW YORK (Reuters) - Amid the excitement of Serena Williams’ latest bid for U.S. Open glory, some off-court news buzzed about the plaza at Flushing Meadows: a duchess had come to Queens.\n\nSep 7, 2019; Flushing, NY, USA; Serena Williams of the United States returns a shot against Bianca Andreescu of Canada in the women's singles final on day thirteen of the 2019 US Open tennis tournament at USTA Billie Jean King National Tennis Center. Mandatory Credit: Danielle Parhizkaran-USA TODAY Sports\n\nMeghan Markle, the wife of Britain’s Prince Harry, sat in the player’s box of her good friend Williams as she took on Canada’s Bianca Andreescu in the women’s final on Saturday.\n\nThe presence of the Duchess of Sussex heaps even greater significance on what could be a memorable tennis occasion as Williams looks to add her name to the record books by equaling Margaret Court’s tally of 24 Grand Slam singles titles.\n\nWhile the sight of royalty at Wimbledon is as common as strawberries and cream, Markle’s appearance in New York is sure to stun, even among the throngs of A-listers that regularly flock to the tournament.\n\nShe is not, however, the first royal to appear at the final Grand Slam tournament of the year.\n\nPrincess Beatrice of York attended the men’s semi-final match between Rafa Nadal and Juan Martin del Potro in 2017 and Queen Sofia of Spain attended the 2013 men’s final to support Nadal, tournament organizers said.\n\nYet Markle stands apart as one of the most recognizable faces in the world, after her 2018 wedding to Prince Harry, an event that commanded the global spotlight.\n\n‘I USED TO CALL YOU MEGHAN’\n\nWilliams has a long-standing and well-documented friendship with Markle, with the six-times U.S. Open champion attending her royal wedding last year and, according to numerous media reports, co-hosting her baby shower in New York.\n\nShe celebrated the release of Markle’s cookbook a year ago in a Twitter post that pulled back the curtain on her friendship with the former actress.\n\n“I used to call you Meghan (and I still do) but dear Duchess of Sussex your first project ‘Together’ a cookbook bringing women of all cultures together. I could not be more excited about it and proud of you,” she tweeted.\n\nMarkle, appearing an equally devoted friend, made the last-minute decision to fly to the Big Apple after seeing Williams beat Elina Svitolina in her semi-final, according to the Times.\n\nOn Saturday, she commands one of the most sought-after spots in sport.\n\nDemand for tickets to see whether Williams could capture an elusive record-equaling 24th major title was at a similar level to a year ago when she fell in the final to Naomi Osaka.\n\nYet demand for tickets to this year’s showpiece match was 33% higher than in 2017 when Williams did not play in the final, according to StubHub.\n\nThe retailer showed tickets costing hundreds of dollars just to get into the Flushing Meadows facility on Saturday.", "description": "Amid the excitement of Serena Williams' latest bid for U.S. Open glory, some off-court news buzzed about the plaza at Flushing Meadows: a duchess had come to Queens.", "authors": ["Amy Tennery", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190907&t=2&i=1427392847&w=1200&r=LYNXNPEF8610B", "published_at": "2019-09-07"}