{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7548625/Scottish-Government-report-no-deal-Brexit-preparations.html", "downloaded_at": "2019-10-08 02:17:10.548223+00:00", "title": "Scottish Government report due on no-deal Brexit...", "language": "en", "text": "Details on the Scottish Government’s preparations for a no-deal Brexit will be revealed at the Scottish Parliament.\n\nThe report will detail work done to mitigate effects on Scotland if the UK leaves the European Union on October 31 without a deal.\n\nDeputy First Minister John Swinney is due to make a statement to MSPs at the same time as the document is released.\n\nSpeaking before publication, he urged the UK Government to ensure an exit deal is reached before the deadline.\n\nA UK Government spokesman stressed a deal is wanted but added: “We will be ready for Brexit on October 31 with or without a deal.”\n\nMr Swinney said: “Any departure from the European Union will have a detrimental impact on the people and economy of Scotland but a no-deal would be especially damaging.\n\n“Even at this late stage we urge the UK Government to rule out such a course.\n\n“The Scottish Government strenuously opposes a no-deal but, as a responsible government, we must do all we can to address its potential impact.\n\n“This report will help the Scottish people understand the risks we face, the efforts we are making to mitigate those risks and where responsibility lies with the UK Government.\n\n“However hard we work it is impossible to prepare for all the problems a no-deal Brexit would cause.\n\n“The only way to stop the impact of ‘no deal’ is to take such a disastrous policy off the table.”\n\nDeputy First Minister John Swinney will take questions on the report (Jane Barlow/PA)\n\nThe report will also include recommendations the Scottish Government believes the UK Government should take regarding Brexit.\n\nA UK Government spokesman said: “We want a deal and we want to talk.\n\n“The UK has made a fair and reasonable offer and now it’s time for the EU to show a willingness to compromise too.\n\n“But any deal ahead of Brexit on October 31 will require movement from the EU.\n\n“We will be ready for Brexit on October 31 with or without a deal.\n\n“We are also supporting the devolved administrations to get ready for Brexit on October 31 and we have committed almost £140 million to the Scottish Government to fund their preparations.”", "description": "The document will detail mitigation measures in place to help Scotland in the event the UK leaves the EU without a deal on October 31.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/02/wire-19421740-1570499331-958_636x382.jpg", "published_at": "2019-10-08"}