{"pub": "metro", "url": "https://metro.co.uk/2019/10/09/jose-mourinho-tells-lyon-president-intends-return-premier-league-10891281", "downloaded_at": "2019-10-09 18:30:02.868060+00:00", "title": "Jose Mourinho tells Lyon president he intends to return to Premier League", "language": "en", "text": "Mourinho has been linked with the Tottenham job (Picture: Getty)\n\nJose Mourinho has turned down the chance to manage Lyon, telling the club he wants to return to the Premier League.\n\nLyon sacked Sylvinho this week in the wake of a derby defeat to Saint-Etienne, a result which has left the French side 14th in Ligue 1.\n\nClub president Jean-Michel Aulas was in contact with Mourinho and RMC claim the former Manchester United coach was offered the vacant manager role.\n\nMourinho, however, rejected the offer and told Aulas he intends to make his return to management in England.\n\nMourinho has set his sights on a return to England (Picture: Getty)\n\nThe former Chelsea boss’ family lives in London and Mourinho intends to be based again in England.\n\nThe news comes hot on the heels of speculation linking Mourinho to Tottenham.\n\nMauricio Pochettino’s future at the club is unclear after a dismal start to the season and some Tottenham players feel their manager is angling for an exit from the club.\n\nAdvertisement\n\nAdvertisement\n\nMourinho had two spells at Chelsea, Tottenham’s local rivals, but feels he could be a good fit at Spurs.\n\nWith Mourinho ruling himself out of the running to take charge at Lyon, Arsene Wenger and Laurent Blanc are now the frontrunners for the position.\n\nBlanc is the favourite to take up the role and Aulas is expected to hold talks with the former Paris Saint-Germain boss.", "description": "Jose Mourinho has turned down the chance to manage Lyon, telling the club he wants to return to the Premier League. Lyon sacked Sylvinho this week in the wake of...", "authors": ["Coral Barry"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1019409286_1570644426.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-09"}