{"pub": "mirror", "url": "https://mirror.co.uk/sport/boxing/inside-floyd-mayweathers-prison-term-20551685", "downloaded_at": "2019-10-10 15:25:36.563915+00:00", "title": "Inside Floyd Mayweather's prison term after boxer was jailed for domestic violence", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFor a man accustomed to being waited on hand and foot by his bloated entourage, Floyd Mayweather did not enjoy solitary confinement.\n\nSentenced to 90 days inside after pleading guilty to a domestic violence charge following a physical altercation with ex-girlfriend, Josie Harris, Mayweather would serve just 60 days.\n\nAnd during his two months behind bars in 2012, he repeatedly wrote to prison officials asking to be moved.\n\n\"There is [sic] 7 days in a week and I only get five hours out of my cell and that's unfair.\" Mayweather complained. \"This is my third time writing asking to be moved.\n\n\"My mind is not the same. I've lost weight I am stressed out I can't workout and I need some type of exercise.\"\n\n(Image: Getty Images)\n\nMayweather's pleas fell on deaf ears and he was retained in a maximum security prison for his own protection.\n\nThe American had had his punishment delayed so that he could fight Miguel Cotto on the Mexican holiday Cinco de Mayo.\n\nAnd prison documents offer a fascinating insight into his sentence.\n\nAs well as pleading to be moved, Mayweather complained of a rib injury which the prison doctor told him was not serious.\n\nThe boxer threatened to sue the prison and claimed he would have surgery upon his release.\n\nMayweather was also reported for verbally abusing prison staff when he was told he had been given two hours' of free time each day instead of just one.\n\nAn officer wrote: \"When I approached his cell to see what was his problem, he stated to me that he felt that I, for some reason, had it out for him.\n\n\"He told me that he felt I disliked him. I explained to him that I didn't have an opinion of him either way and that I'm trying to ensure that policies are being followed.\n\n(Image: FilmMagic)\n\n\"He looked me in the eye and told me that when he gets out of jail, he won't forget me. I then asked him if that was a threat. He said, 'I didn't say I was going to hurt you did I?'\".\n\nMayweather was stripped of even his hour's free time but the records showed he quickly got up to speed with the inner workings of prison.\n\nAnother report, obtained by Sports on Earth , details how the fighter paid two inmates to 'look out'.\n\n\"Last night while inmate Mayweather #1363917 was out for his scheduled free time he yelled up to inmate [Paul] Lopez #1532142 and said, 'I'm putting $500 on your books, thanks for looking out.\"\n\nFurther investigations revealed Lopez, who was in prison on gang-related charges, had indeed received $500 from a third party. Another inmate, Nicholas Howard received $200.\n\nWhen asked about the payment, the report says Howard smiled and said, \"It is what it is.\"\n\nAs an athlete who would go on to retire with a record of 50-0, Mayweather was used to a strict diet.\n\n(Image: Getty Images)\n\nAnd it is perhaps no surprise that the prison food was often not to his liking.\n\n\"Today Mayweather was offered a tray and juice for lunch but refused, stating he doesn't eat the food here,\" read another report.\n\nMayweather was so annoyed he asked to be released from prison on account of the low-quality food and water.\n\nA judge dismissed his claims, saying: \"It's jail. Where did he think he was going, The Four Seasons?\"\n\nA further report claims Mayweather eschewed prison food in favour of snacks including Snickers bars, noodles and beef jerky.\n\nUltimately, Mayweather had 30 days shaved from his sentence for good behaviour and was released on August 3.\n\nHe was met by his manager Leonard Ellerbe and several family members while rapper 50 Cent was also present.\n\nMayweather outpointed Robert Guerrero the following May before going on to earn hundreds of millions from fights against the likes of Canelo Alvarez and Manny Pacquiao.", "description": "Mayweather spent two months in a Las Vegas jail after pleading guilty to domestic violence charges", "authors": ["Martin Domin", "Image", "Getty Images", "Filmmagic"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20552841.ece/ALTERNATES/s1200/0_Floyd-Mayweather-Jr-Appears-In-Court.jpg", "published_at": "2019-10-10"}