{"pub": "news24", "url": "https://health24.com/Medical/Meds-and-you/Antibiotics/your-washing-machine-might-be-breeding-drug-resistant-germs-20191006-2", "downloaded_at": "2019-10-08 06:31:45.654786+00:00", "title": "Your washing machine might be breeding drug-resistant germs", "language": "en", "text": "Your washing machine might be breeding drug-resistant germs An investigation at a German hospital where drug-resistant bacteria was repeatedly infecting newborns traced the outbreak to a washing machine - and the infections stopped only after it was taken away.\n\nYour energy-efficient washing machine could be harbouring \"superbug\" antibiotic-resistant bacteria, a new study warns.\n\nThe warning follows an investigation at a German hospital where drug-resistant Klebsiella oxytoca was repeatedly infecting newborns. Investigators traced the outbreak to a washing machine, and the infections stopped only after it was taken away.\n\n\"This is a highly unusual case for a hospital, in that it involved a household-type washing machine,\" said study first author Dr Ricarda Schmithausen, a senior physician at the Institute for Hygiene and Public Health at the University of Bonn.\n\nHospitals usually use special washing machines with high temperatures and added disinfectants. Home washing machines clean at lower temperatures that save energy but may not kill drug-resistant germs, researchers warn.\n\nThey said the K. oxytoca that sickened the newborns was transmitted from the washer to knitted caps and socks used to keep babies warm.\n\nIt's unclear how the drug-resistant germs got into the washing machine, but researchers suspect they probably lived in water that didn't drain completely after a washing.\n\nThey said washing machines should to be redesigned to prevent residual water from accumulating where germs can grow and contaminate clothes.\n\nThe report was recently published in the journal Applied and Environmental Microbiology.\n\nWhat should consumers do to avoid this type of outbreak? The study's co-author had advice for households with patients.\n\n\"If elderly people requiring nursing care with open wounds or bladder catheters, or younger people with suppurating [pus-filled] injuries or infections live in the household, laundry should be washed at higher temperatures, or with efficient disinfectants, to avoid transmission of dangerous pathogens,\" said Dr Martin Exner, from the University of Bonn.\n\n\"This is a growing challenge for hygienists, as the number of people receiving nursing care from family members is constantly increasing,\" Exner said in a journal news release.", "description": "An investigation at a German hospital where drug-resistant bacteria was repeatedly infecting newborns traced the outbreak to a washing machine - and the infections stopped only after it was taken away.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9440/54a617af66454ab185a6fbc8d5387f63.jpg", "published_at": "2019-10-06"}