{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7552771/Simone-Biles-makes-history-wins-21st-world-medal.html", "downloaded_at": "2019-10-09 04:36:05.079870+00:00", "title": "Simone Biles makes history as she wins her 21st world medal", "language": "en", "text": "Simone Biles is on her way to becoming the most decorated woman in gymnastics as she has now won 21 world medals.\n\nLed by Biles' score of 172.330 - 5.801 points more than second-placed Russia - the United States women's team cruised to their fifth title on Tuesday at the gymnastics world championships in Germany and seventh consecutive at an Olympics or world championships.\n\n'I guess it's kind of crazy,' said Biles, who collected a record-extending 15th gold medal at the worlds. 'I feel like I haven't gotten the chance to process it yet.\n\n'But I think we'll do some celebrating tonight, for all of it. For the team, for the medal count, for the fifth year in a row.'\n\nSimone Biles led the team with a score of 172.330 Tuesday and is on her way to becoming the most decorated woman in gymnastics as she has now won 21 medals\n\nThe United States women's team cruised to their fifth title on Tuesday at the gymnastics world championships in Germany\n\nItaly took the third spot for its first world team medal since 1950 with a score of 164.796, while China slipped off the podium for the first time since 2003.\n\nBiles secured her 21st world medal, overtaking Russia's Svetlana Khorkina for the women's record.\n\nOnly Vitaly Scherbo of Belarus has won more world medals with 23, which Biles is expected surpass by the end of the individual events this week.\n\nBiles is likely to break records almost every time she is in action this week but the 22-year-old conceded she still feels the pressure of delivering results on the world stage.\n\n'Sometimes, I wish I would quit because the other day we walked out there, and I was like, ''I literally hate this feeling. I don't know why I keep forcing myself to do it,'' she told the Olympic Channel.\n\n'But you know, we love the thrill of it. It reminds me to never give up because, one day, I won't have the opportunity to get that feeling.'\n\nOn Saturday, Biles first landed the triple-double on the floor exercise, which involves a triple-twisting double backflip. Going forward, that move will be called the 'Biles II.'\n\nThen, while on the balance beam, she performed the double-double tuck - two flips and two twists - while dismounting. That move will be called the 'Biles.'\n\nSimone Biles performs on the Balance Beam during the Women's Team Final on Day 4 of the FIG Artistic Gymnastics World Championships on October 08, 2019 in Stuttgart, Germany\n\nBiles competes in the Floor women's team Final on Tuesday\n\nThis is the team's seventh consecutive team title at an Olympics or world championships\n\nThe Americans wasted no time on their path to glory, with Grace McCallum, Jade Carey and Biles landing three solid vaults in a row to give them an early lead.\n\nSunisa Lee faltered on the beam, just as she did in Saturday's qualifying round, but Biles continued to showcase clinical execution to post the highest scores on three out of four apparatus.\n\nBy the time Biles approached the floor exercises, she needed only a 9.533 to clinch gold.\n\nShe wrapped up the contest in style with a triple-twisting double back flip — now known as the Biles II — to finish with 15.333.\n\nIt was a much cleaner effort from Biles, who stepped out of bounds to earn a 0.2 penalty in qualifying.\n\n'It was a little bit nerve wracking, but it was kinda fun,' Biles added. 'I stayed in bounds. So I think that was the highlight of the night.'\n\nItaly huffed and puffed into the finals by grabbing the eighth and final qualifying spot but going into the final rotation they were in second place, trailing the U.S. by 2.434.\n\nReigning Youth Olympic Games champion Giorgio Villa led the team and posted consistent scores across all apparatus to ensure they took third spot, finishing 0.566 clear of fourth-placed China.", "description": "Simone Biles led the team with a score of 172.330 and is on her way to becoming the most decorated woman in gymnastics as she has now won 21 medals.", "authors": [], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/03/19470846-0-image-a-27_1570586547310.jpg", "published_at": "2019-10-09"}