{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/04/trump-to-protect-u-s-taxpayers-from-subsidizing-health-care-for-immigrants", "downloaded_at": "2019-10-05 06:17:51.058439+00:00", "title": "Trump to Protect Taxpayers from Subsidizing Health Care for Immigrants", "language": "en", "text": "President Trump signed a presidential proclamation on Friday to protect American taxpayers from being forced to subsidize the healthcare costs of legal immigrants wanting to permanently resettle in the United States.\n\nIn a new rule, beginning November 3, foreign nationals applying for visas — not including refugees, asylees, or those on nonimmigrant visas — will have to prove that they will have either employer-based health insurance before arriving in the U.S. or a non-subsidized private health insurance plan.\n\nThe proclamation reads:\n\nWhile our healthcare system grapples with the challenges caused by uncompensated care, the United States Government is making the problem worse by admitting thousands of aliens who have not demonstrated any ability to pay for their healthcare costs. Notably, data show that lawful immigrants are about three times more likely than United States citizens to lack health insurance. Immigrants who enter this country should not further saddle our healthcare system, and subsequently American taxpayers, with higher costs.\n\nThe rule means that foreign nationals with serious health issues and no means to pay for health insurance will not be eligible to obtain visas to permanently begin resettling in the U.S. — saving American taxpayers billions in subsidized costs.\n\nAs noted by the White House, hospitals across the country have had to foot the bill for uninsured immigrants who arrived in the U.S. on visas despite being a financial burden on taxpayers.\n\nThe proclamation reads:\n\nThe costs associated with this care are passed on to the American people in the form of higher taxes, higher premiums, and higher fees for medical services. In total, uncompensated care costs — the overall measure of unreimbursed services that hospitals give their patients — have exceeded $35 billion in each of the last 10 years. These costs amount to approximately $7 million on average for each hospital in the United States, and can drive hospitals into insolvency.\n\nResearch by the Center for Immigration Studies (CIS) has found that immigrant households, currently, are 44 percent more likely to be on Medicaid than households headed by native-born Americans. While about 23 percent of native-born American households are on Medicaid, about 50 percent of immigrant households consume Medicaid.\n\nImmigrant households each consume about $4,072 every year in Medicaid costs that American taxpayers are forced to pay. Native-born American households consume roughly half of that amount every year in Medicaid costs.\n\nThe rule comes as Trump announced a plan in August that effectively bans welfare-dependent immigrants from permanently resettling in the U.S., as they are a net-burn to taxpayers. United States Citizenship and Immigration Services (USCIS) Director Ken Cuccinelli has said the rule, known as the “Public Charge,” is designed to ensure self-sufficient, English-speaking foreign nationals are prioritized over those who are likely to end up on welfare.\n\nCurrently, there is an estimated record high of 44.5 million foreign-born residents living in the U.S. This is nearly quadruple the immigrant population in 2000. The vast majority of those arriving in the country every year are low-skilled legal immigrants who compete against working and middle-class Americans for jobs.\n\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.", "description": "President Trump signed a proclamation to protect American taxpayers from being forced to subsidize the healthcare costs of legal immigrants.", "authors": ["John Binder"], "top_image": "https://media.breitbart.com/media/2019/09/Healthcare-for-Illegal-Immigrants-640x335.jpg", "published_at": "2019-10-04"}