{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Family/2019-car-seat-check-honor-roll-top-ranked/story?id=65600302", "downloaded_at": "2019-09-16 13:05:03.033236+00:00", "title": "2019 Car Seat Check Honor Roll: Top ranked cars for easy car seat installation", "language": "en", "text": "Parents of young children know all too well that car seat installation can be a recipe for major headaches. But Cars.com's new list may help make buckling up your babies a breeze.\n\nKicking off Child Passenger Safety Week, Cars.com rolled out its 2019 Car Seat Check Honor Roll list Monday on “Good Morning America.”\n\nAll of the cars and SUVs that made the list received an \"A\" grade in their assessment based on their intuitive Latch systems and the car-seat fit, according to Cars.com Editor-in-Chief Jenni Newman.\n\nNewman appeared on \"GMA\" to announce two of the included models, a 2019 Toyota Camry and a 2019 Hyundai Santa Fe.\n\nThirteen vehicles made this year's list, the largest one yet, as automakers made improvements to Latch systems to ensure their cars work for modern families, Newman said.\n\nHere are five of the vehicles on the list:\n\n2019 Toyota Camry\n\nThis car is a family favorite, and its redesign offers better accessibility and a slew of new safety features.\n\n2019 Hyundai Santa Fe\n\nThis two-row mid-size SUV offers a roomy backseat and the latest in safety features, such as blind-spot warning, automatic emergency braking, lane-keeping assist and more.\n\n2019 Toyota Avalon\n\nThis full-size sedan has just had a makeover. This year, Toyota gave it a new platform, new looks, new powertrains and new technology. Plus, it also has a new Latch system for parents.\n\n2019 Toyota RAV4\n\nThis compact SUV is a fan favorite. In 2019, it's offering a new Latch system.\n\n2019 Nissan Murano\n\nThis mid-size SUV should have received extra credit for its safety grade. It can fit three car seats across its backseat. The vehicle can seat five.\n\nYou can check out Cars.com'sfull list of 13 cars here.", "description": "Cars.com unveiled its 2019 Car Seat Check Honor Roll of best models for easy car seat installation. Its list includes the top 13 cars for easy car seat installation.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/toyota-camry-ht-jef-190913_hpMain_16x9_992.jpg", "published_at": "2019-09-16"}