{"pub": "foxnews", "url": "https://foxnews.com/auto/chase-elliott-wins-nascar-charlotte-roval-race", "downloaded_at": "2019-10-01 04:29:25.323537+00:00", "title": "Chase Elliott wins NASCAR Charlotte 'roval' playoff race", "language": "en", "text": "Alex Bowman had just advanced to the second round of NASCAR's playoffs, climbed from his car and slumped to the ground, dehydrated and overcome by the heat. As he was receiving medical attention, Bubba Wallace approached him and angrily splashed liquid in Bowman's face.\n\nThat closing image capped a sloppy Sunday in scorching temperatures at Charlotte Motor Speedway, where Chase Elliott won despite crashing head-on into a tire barrier earlier on The Roval. Elliott was leading on a restart headed into the first turn when he locked his brakes and his car drove directly off the course and crashed into the makeshift wall.\n\n\"I couldn't believe I did that. That was just so stupid,\" Elliott said. \"I don't know that you could have done anything more stupid leading this race than what I did right there. Luckily our car wasn't too bad ... fast enough to drive up through there, got the cautions at the right time, and just didn't quit.\n\n\"If there's ever a lesson to not quit, today was the example.\"\n\nElliott celebrated by returning to the corner where he'd wrecked earlier and placing the nose against the barrier before smoking his tires.\n\n\"I was coming back and saw that dang thing and thought I couldn't pass up the opportunity to redeem myself,\" Elliott said of his celebration.\n\nThe winner, though, was not the spotlight in NASCAR's first elimination race of the playoffs.\n\nThe focus was on the four drivers who would be trimmed from the 16-driver championship field, and Bowman spent the entire race fighting for a spot in the second round. He crashed his car in the final moments of Saturday practice and had to go to a backup, then spun in the opening laps Sunday, deliberately spun Wallace in anger, and had to claw his way to a second-place finish.\n\nBut the 1-2 finish for Hendrick Motorsports was no guarantee that Bowman would advance. Ryan Newman, further back in the field, had the point advantage on Bowman and Bowman had no control of his own fate.\n\nThen Newman, racing Aric Almirola over the final few laps for a shot at advancing, missed a chicane with two laps remaining and the error eliminated him from the playoffs.\n\n\"I felt like I made a lot of mistakes trying too hard,\" said Newman, who also stalled his Ford during a pit stop. \"We did not have the race car and that's what I had to do.\"\n\nDALE EARNHARDT JR. ONCE OFFERED TO TAKE A $1 MILLION PAY CUT, HERE'S WHY\n\nThe point difference swung to Bowman, who couldn't celebrate because he needed immediate medical attention. As Bowman was slumped next to his car and surrounded by medical personnel, Wallace approached him, the two had a brief verbal exchange and Bowman appeared to laugh at Wallace right before Wallace angrily splashed the bottle he was carrying in Bowman's face.\n\nBowman was later treated in the infield care center for dehydration and said he spun Wallace for flipping his middle finger at him repeatedly on track.\n\n\"I got flipped off for every single straightaway for three laps, flipped off by him for like three or four laps in a row at Richmond, so I'm just over it. He probably wouldn't have got wrecked if he had his finger back in the car, right?\" Bowman said. \"Probably shouldn't repeat what he said to me, but nothing classy, by any means. I get it. I'd be mad, too, but he put himself in that spot.\"\n\nIt was a messy day on the hybrid road course/oval at Charlotte, where the championship chances ended for Newman, Almirola, Kurt Busch and Erik Jones.\n\nA late caution led NASCAR to stop the race for a cleanup and the drivers had to sit inside their cockpits, where temperatures hovered around 120 degrees. NASCAR officials went car-to-car handing out water bottles, and Newman was among the many who radioed their crew asking for bags of ice to be waiting for him when the race ended.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nKyle Busch decided he wasn't going to sit in the heat and drove his car to the garage, calling it a race with seven laps remaining. He was three laps down at the time and already locked into the second round of the playoffs.\n\nKevin Harvick finished third and was followed by Stewart-Haas Racing teammate Clint Bowyer, who was in danger of being eliminated from the playoffs but advanced with his fourth-place finish.\n\nBrad Keselowski was fifth and followed by pole-sitter William Byron, Martin Truex Jr. and Ryan Blaney as playoff drivers claimed the top eight spots.\n\nThe track, typically a standard NASCAR oval, was modified for this playoff race for the second consecutive year into a 17-turn, 2.28-mile circuit that uses both the road course through the infield and the oval. The twists and turns around the circuit are marked with chicanes on the backstretch and frontstretch to slow the cars, and, potentially increase passing on the oval portion of the track. An added wrinkle from last year is an overhauled backstretch chicane revamped to make it a braking and passing zone.\n\nNASCAR made it very clear in every communication with teams that skipping a chicane would be penalized, and Newman was one of many drivers to miss it and suffer a costly setback.\n\nJONES FIRST OUT\n\nErik Jones was the first driver eliminated from the playoffs after a horrible opening round.\n\nHe had a mechanical issue at Las Vegas, but rallied last week at Richmond to finish fourth in a 1-2-3-4 sweep for Joe Gibbs Racing. Then NASCAR said Jones' car had failed post-race inspection, and the 42-point penalty dropped him to last in the playoff field.\n\nJones was in a must-win situation at Charlotte to advance into the second round of the playoffs, but he went to the garage with damage to his Toyota at the end of the first stage and finished last. It officially knocked him out of the playoffs while the race was still going on.\n\n\"It's frustrating not to even have a chance throughout the whole race, you know?\" said Jones. \"It's unfortunate. We just had three really bad weeks and it's some of our own doing and some not our own doing. I'd love to be moving forward here and challenging for the championship. I thought we could have went pretty deep this year, but it's just the nature of the playoffs.\"\n\nBUSCH BAKES\n\nKyle Busch decided not to finish the race when NASCAR stopped it with seven laps remaining to clean up debris on the track. Busch was three laps down at the time and temperatures in the cars were hovering around 120 degrees during the stoppage.\n\nWith nothing to gain when the race resumed, Busch threw in the towel and pulled off the track.\n\nUP NEXT\n\nThe opening race of the second round of the playoffs, Sunday at Dover International Speedway. Chase Elliott won last year.", "description": "On to the second round.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/CHASE2.jpg", "published_at": "2019-09-30"}