{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/china-unexpectedly-injects-us28b-of-cash-as-growth-slows", "downloaded_at": "2019-10-16 05:10:39.265374+00:00", "title": "China unexpectedly injects US$28b of cash as growth slows", "language": "en", "text": "China caught traders off-guard with a surprise injection into the financial system via loans to banks, ahead of data on Friday which is expected to show a further slowdown in the domestic economy.\n\n[HONG KONG] China caught traders off-guard with a surprise injection into the financial system via loans to banks, ahead of data on Friday which is expected to show a further slowdown in the domestic economy.\n\nThe People's Bank of China added 200 billion yuan or US$28 billion of one-year cash through the medium-term lending facility on Wednesday. It kept the interest rate steady. The move took traders by surprise as the authorities usually inject liquidity when previously offered loans come due, and the next batch won't mature until Nov 5.\n\nThe Chinese economy has been under pressure amid a prolonged trade dispute with the US and a slowing domestic economy, prompting the central bank to ease monetary policy by lowering corporate borrowing costs and cutting banks' reserve ratios this year. Data released this week showed that China's factory deflation deepened and imports and exports fell last month.\n\n\"It's not expected by the market,\" said Becky Liu, head of China macro strategy at Standard Chartered, referring to the cash injection. \"They probably want to inject more long-term liquidity\" to ensure ample supply during the tax payment season in mid-October and to support the economy, which is still facing growth pressure, she said.\n\nsentifi.com Market voices on:\n\n\"Market reaction is muted, however, probably as the rate is kept unchanged\" while other central banks are cutting interest rates, according to Frances Cheung, head of Asia macro strategy at Westpac Banking Corp.\n\nThe yield on China's 10-year government bonds fell 1 basis point to 3.16 per cent as of 10:34am in Shanghai.\n\nBLOOMBERG", "description": ": THE BUSINESS TIMES Government & Economy - [HONG KONG] China caught traders off-guard with a surprise injection into the financial system via loans to banks, ahead of data on Friday which is expected to show a further slowdown in the domestic economy. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/16/wh_BankChina_161023_2x0001_0.jpg?itok=pSxSBY3T", "published_at": "2019-10-16"}