{"pub": "politico", "url": "https://politico.com/story/2019/09/24/adam-schiff-trump-impeachment-1509833", "downloaded_at": "2019-09-25 04:38:10.236172+00:00", "title": "Trump nemesis Adam Schiff holds the keys to his impeachment", "language": "en", "text": "House Intelligence Committee Chairman Adam Schiff touched off the accelerating impeachment process on Sept. 13, when his office released a news release about a whistleblower’s complaint. | Samuel Corum/Getty Images Congress Trump nemesis Adam Schiff holds the keys to his impeachment The House Intelligence Committee chairman's inquiry into a secret whistleblower has fueled a rapid shift toward impeachment in the Democratic caucus.\n\nRep. Adam Schiff has assumed control of what appears to be the single most consequential scandal facing Donald Trump’s presidency — and, for the moment, is driving a narrative that could lead to Trump’s impeachment.\n\nIt was Schiff’s late Friday news release earlier this month that first revealed a whistleblower had filed an “urgent” and credible complaint against someone in the executive branch. It was Schiff who issued a subpoena and secured testimony from the intelligence community’s top watchdog, who confirmed he had been blocked from providing details to Congress, in apparent violation of the law.\n\nStory Continued Below\n\nAnd it was Schiff, a top ally of Speaker Nancy Pelosi, who jarred the Capitol when he said on Sunday that Trump may have “crossed the Rubicon” of impeachable conduct by pressuring Ukrainian officials into investigating Joe Biden, adding that Trump “is pushing us down this road.”\n\nSince then, momentum has moved rapidly toward impeaching the president, with a growing number of lawmakers announcing their support for official proceedings.\n\nSome moderate Democrats have even floated the possibility of Schiff leading a special committee to handle an investigation that could lead to Trump’s impeachment, which they see as a more cautious route to a possible floor vote.\n\nThe suggestion comes amid heightened frustrations that House Democrats have failed to sustain any momentum on impeachment in the five months since special counsel Robert Mueller’s report on Russian interference in the 2016 campaign was released — a matter that has been handled exclusively by the Judiciary Committee.\n\nSign up here for POLITICO Huddle A daily play-by-play of congressional news in your inbox. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nRep. Stephanie Murphy (D-Fla.), who co-chairs the moderate Blue Dog Coalition, announced her support for a bipartisan select committee on Tuesday.\n\nSome moderate lawmakers believe Schiff could move the focus toward national security, which they say is a more persuasive argument to make for Trump’s impeachment.\n\nOther lawmakers, including Rep. Alexandria Ocasio-Cortez (D-N.Y.), are panning the idea as a delay tactic.\n\n“We don’t have the luxury of time [with] another committee,” the freshman firebrand wrote on Twitter. “Judiciary has been investigating and putting the pieces together for months. Impeachment belongs there. We must honor jurisdiction, historical precedent, and work done [and] allow Judiciary to move forward.”\n\nDespite damaging testimony from Mueller that Trump welcomed Russian help in 2016 and attempted to obstruct the investigation of his campaign, Pelosi remained unconvinced that impeachment was the right course. After months of debating whether to launch impeachment proceedings, House Democrats initially failed to convince Pelosi, who feared risking the House majority on an effort that seemed doomed in the GOP-controlled Senate and polls poorly.\n\nYet Schiff’s Intelligence Committee has helped change the calculus and Pelosi endorsed an impeachment inquiry Tuesday. The panel’s 13 Democrats are barreling toward an aggressive confrontation with Trump’s top intelligence official on Thursday, as the administration continues to withhold a whistleblower complaint that reportedly involves the president’s efforts to pressure Ukrainian President Volodymyr Zelensky to investigate Biden and his son.\n\nEven before the whistleblower complaint surfaced, Schiff joined two other committee chairmen to open an inquiry into efforts by Trump and his personal attorney Rudy Giuliani to pressure Ukraine to investigate the Bidens. That inquiry was based, in part, on POLITICO reporting that Trump was withholding critical military assistance to Ukraine as part of its efforts to counter Russian aggression in Eastern Europe.\n\n“This is a country that's still vulnerable right now. It has an occupied Crimea. This is the front of Russian attacks on the West,” said Rep. Mike Quigley (D-Ill.), a member of the Intelligence Committee. “To leverage that for political gain is not just illegal, it's just beyond cynical. If they get away with this, the system is broken.”\n\nThe Intelligence Committee is already getting to work on gathering information about the whistleblower complaint. On Tuesday, Schiff said the whistleblower wants to speak with his panel “and has requested guidance” from the Trump administration.” He said the whistleblower could testify as soon as this week.\n\nTrump, who has denied improper conduct, seems aware of Schiff’s centrality to the new allegations against him.\n\n“[W]ho is this so-called “whistleblower” who doesn’t know the correct facts. Is he on our Country’s side. Where does he come from,” Trump tweeted Monday. “Is this all about Schiff & the Democrats again after years of being wrong?”\n\nJoseph Maguire, acting director of national intelligence, is set to face a public grilling on Thursday over his refusal to disclose the whistleblower complaint to the committee, as required by law. But members of the committee have made clear they don’t expect him to cooperate, even if he shows up.\n\nAt least one member of the panel, Rep. Jim Himes (D-Conn.), favors reviving Congress’ “inherent contempt” authority — an arcane and extreme process which involves levying fines against or even jailing individuals who refuse to comply with congressional subpoenas. And he said it should be in the quiver when Maguire testifies.\n\n“It is high time for the Congress to begin employing its power of inherent contempt. We can hold people in contempt and sanction them,” Himes said in an interview. “It should be on the table for any witness who either refuses to testify or refuses to produce documents.”\n\nMaguire has indicated that he is answering to a higher authority in refusing to turn over the whistleblower complaint, even though Michael Atkinson, the intelligence community’s inspector general, has deemed it “urgent.” That raised the prospect that the White House or the Justice Department was again intervening to block compliance with congressional subpoenas, part of a months-long pattern of stonewalling that has led dozens of Democrats to support formal impeachment proceedings.\n\n“You are going to see members who are opposed or on the fence realize that both the process of the whistleblower, but possibly the substance, are ample grounds for impeachment,” Himes said. “It's going to become increasingly difficult for members.”\n\nA spokesman for Schiff declined to comment. But the pro-impeachment faction of the Democratic Party is becoming more restless over its leaders’ refusal to fully embrace impeachment, and lawmakers are angling for a more aggressive posture toward an administration that they say has no respect for the rule of law and Congress’ oversight role.\n\nSchiff hinted last week that the House could sue the Trump administration to obtain the whistleblower complaint.\n\nTrump and Schiff have a long history of sparring over the various Russia-related investigations that have ensnared the president and his associates. Trump’s allies say Schiff was the most aggressive purveyor of the argument that Trump colluded with Russia to influence the 2016 election, and they used Schiff as a punching bag when Mueller revealed he lacked evidence to establish a criminal conspiracy between the Trump campaign and Russia.\n\n“This is political theater,” Jay Sekulow, the president’s personal attorney, told POLITICO. “The Mueller investigation got them nothing. Their interviews with witnesses has produced nothing because there is nothing. So now they’ll shift to the Ukraine.”\n\nTrump has labeled Schiff “pencil-neck” and skewered him mercilessly on Twitter for two years. He has also fundraised off Schiff’s broadsides, and Schiff has ridden his infamy in Trump world to become one of Democrats’ most prominent spokesmen on alleged wrongdoing by the president.\n\nThe entire episode began when Schiff’s office issued a nondescript news release late on Friday, Sept. 13.\n\nNew Window INTERACTIVE: See where House lawmakers stand on impeachment\n\n“Chairman Schiff Issues Subpoena for Whistleblower Complaint Being Unlawfully Withheld by Acting DNI from Intelligence Committees,” the release stated cryptically.\n\nThough Schiff raised concerns that the complaint might implicate Trump — in part because Maguire cited executive branch “privilege” and “confidentiality” to block the complaint — there were no details about its substance. Schiff noted the complaint was filed on Aug. 12, while the intelligence community was in turmoil ahead of the impending departure of outgoing DNI Dan Coats.\n\nAtkinson reviewed the complaint, deemed it “urgent” and credible and transmitted it to Maguire for a final review. Though the law says Maguire was required to turn the details over to Congress by Sept. 2, he instead sent the complaint to the Justice Department, and ultimately blocked it from going to Capitol Hill.\n\nThen the leaks started, Trump himself began to weigh in and the calls for an impeachment inquiry turned into a flood.\n\nOn Thursday, Schiff will face a test as the demands for Trump’s ouster intensify.\n\n“If, in particular, after having sought foreign assistance and welcomed foreign assistance in the last presidential campaign as a candidate, he is now doing the same thing again, but now using the power of the presidency, then he may force us to go down this road,” Schiff said recently.\n\nSarah Ferris and Darren Samuelsohn contributed to this report.", "description": "The House Intelligence Committee chairman's inquiry into a secret whistleblower has fueled a rapid shift toward impeachment in the Democratic caucus.", "authors": ["Andrew Desiderio", "Kyle Cheney", "Natasha Bertrand", "Martin Matishak", "Burgess Everett"], "top_image": "https://static.politico.com/fb/23/4d39f8ff4d7292e5e93179f63da3/190924-schiff-getty-773.jpg", "published_at": "2019-09-24"}