{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201909302088/europe-markets-european-stocks-set-to-close-quarter-with-stronger-gain-than-us", "downloaded_at": "2019-09-30 10:44:50.787054+00:00", "title": "EUROPE MARKETS: European Stocks Set To Close Quarter With Stronger Gain Than U.S.", "language": "en", "text": "By Steve Goldstein, MarketWatch\n\nEuropean stocks on Monday were on track to end the quarter with a mild gain, capping three months of turmoil on the political and economic front.\n\nUp 0.04% to 391.93 on the day, the Stoxx Europe 600 index has climbed 1.9% for the quarter. The U.S. S&P 500 is up 0.7% over the same period. European stocks are much cheaper than their U.S. counterparts, reflecting worries about the area's low growth. According to J.P. Morgan data, the Euro Stoxx 50 has a price-to-earnings ratio of 14.6, compared to 18.1 times for S&P 500 components.\n\nTop gainers in Europe for the July-to-September period include telecoms group Altice Europe (ATC.AE) , French supermarket chain Casino Guichard (CO.FR) and U.K. aerospace firm Cobham (COB.LN), each with gains of over 40%.\n\nLosers included software firm Micro Focus International (MCRO.LN) , down 46% over the last three months, U.K. bank CYBG (CYBG.LN) , which has dropped nearly 42%, and steel maker Evraz (EVR.LN) , down 32%.\n\nThe German DAX dropped 0.03% to 12377.84, the French CAC 40 increased 0.06% to 5644.22 and the U.K. FTSE 100 fell 0.08% to 7420.60.\n\nAttention is turning to U.S.-China trade talks scheduled for October. A Treasury Department spokeswoman over the weekend said there no current plans to block Chinese companies from listing in the U.S., after a published report unsettled markets on Friday.\n\nWhitbread (WTB.LN) shares fell 4.2% as Barclays downgraded the U.K. owner of Premier Inn low cost hotels to equal-weight, with the bank saying the firm's investment case is \"muddled.\"\n\nElectricite de France (EDF.FR) shares rose 2.5% after the power firm said it will receive about 400 million euros in compensation for closing a nuclear power plant early.\n\n(END) Dow Jones Newswires\n\nSeptember 30, 2019 05:27 ET (09:27 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-30"}