{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7629557/Christine-Lampard-claims-Frank-werent-meant-Pride-Britain-Awards-10-years-ago.html", "downloaded_at": "2019-10-30 09:56:36.911672+00:00", "title": "Christine Lampard claims she and Frank 'weren't meant to go' to Pride Of Britain Awards 10 years ago", "language": "en", "text": "She recently revealed that they met at the Pride Of Britian awards ten years ago.\n\nAnd Christine Lampard admitted she and husband Frank were not meant to be at the awards the night they met, as she spoke about their first meeting on Wednesday's edition of Lorraine.\n\nThe TV presenter, 40, said candidly of their meeting: 'It’s a strange one it is because 10 years ago that we met at them, it was one of those nights that neither of us were meant to go to.\n\nFate: Christine Lampard revealed on Wednesday that she and husband Frank 'weren't meant to go' to the Pride Of Britain Awards 10 years ago where their first meeting sparked romance\n\n'It was a last minute thing for him and I arrived at the awards late because of work. We were sat on tables next to each other.'\n\nChristine added that Piers Morgan got some credit for introducing her to Frank as he 'did do an introduction', and joked: 'He was there at that moment so I can’t actually take that away from him.'\n\nThe TV personality went on to gush over Frank's skills as a father to their 13-month-old daughter Patricia, as she praised: 'He is very good, he has to be directed a little bit, I suppose, but he's great. He's so brilliant with her.'\n\nShe also added that their little one has 'none of my DNA in her' except her curly hair, and added: 'the rest is like daddy, everything else.'\n\nMeant to be: The TV presenter said of their meeting: 'It was a last minute thing for him and I arrived at the awards late because of work' (pictured at the event on Monday)\n\nPlaying cupid: Christine added that Piers Morgan got some credit for introducing her to Frank as he 'did do an introduction'\n\nIn addition to Patricia, Christine is also stepmother to Frank's daughters Luna, 14, and Isla, 12, from his former relationship with Elen Rivas.\n\nChristine praised the two girls for helping her with the little one, as she said: 'Even simple things, I’m going to nip to the shower for two minutes and I know she’s safe because I have them. They adore her.'\n\nChristine and Frank have been together since meeting at the 2009 Pride of Britain Awards in October, and tied the knot in a romantic ceremony at St Paul's Church, Knightsbridge, in December 2015.\n\nLast week, Christine lifted the lid on how she first met sportsman Frank, and sweetly gushed their daughter Patricia has 'completed' them.\n\nHappy family: The TV personality went on to gush over Frank's skills as a father to their 13-month-old daughter Patricia, as she praised: 'He's so brilliant with her'\n\nHappy family: Christine is also stepmother to his daughters Luna, 14, and Isla, 12, from his former relationship with Elen Rivas, who she said are great with Patricia\n\nThe ITV star, who is on the judging panel of the 2019 Pride of Britain Awards, revealed why the awards ceremony is a special night for them.\n\nShe told the Mirror: 'It was a complete Sliding Doors moment, I still remember the first meeting as clear as day. Who goes to an awards ceremony and finds a husband? That was me!\n\n'Neither of us were even meant to go and I was late after hosting The One Show. So when we are there now we do have a celebratory glass of champagne. It’s a special evening for us.'\n\nTalking about her daughter, Christine enthused: 'We were already really happy but I suppose it does complete things. I mean, goodness me, I still look at her now, a year old, and I honestly can’t quite believe she’s mine.'", "description": "The TV presenter, 40, admitted she and husband Frank were not meant to be at the awards the night they met, as she spoke about their first meeting on Wednesday's edition of Lorraine.", "authors": ["Roxy Simons For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/09/20367256-0-image-a-21_1572428367510.jpg", "published_at": "2019-10-30"}