{"pub": "businessinsider", "url": "https://businessinsider.sg/daniel-zhang-alibaba-chairman-succeeding-jack-ma-2019-9", "downloaded_at": "2019-09-13 07:50:19.868329+00:00", "title": "Meet Daniel Zhang, the workaholic who’s succeeding Jack Ma as Alibaba’s chairman and keeps such a low profile that he was once mistaken for a janitor in the company’s headquarters", "language": "en", "text": "caption Daniel Zhang addresses the crowd at Jack Ma’s retirement party on September 10, 2019. source Daniel Zhang\n\nAlibaba CEO Daniel Zhang took over as the company’s executive chairman after cofounder Jack Ma retired on September 10, 2019.\n\nZhang keeps such a low profile that the parents of an Alibaba employee once saw him in Alibaba’s Hangzhou headquarters and mistook him for a janitor, Bloomberg reported.\n\nAs Alibaba’s new chairman, Zhang could face challenges amid the trade war between the US and China and a slowdown in the Chinese e-commerce industry.\n\nZhang was a part of the team that created Alibaba’s hugely successful Single’s Day, the $25 billion online shopping event that is bigger than Black Friday and Cyber Monday combined, Business Insider previously reported.\n\nVisit Business Insider’s homepage for more stories.\n\nJack Ma is a hard act to follow.\n\nDaniel Zhang has accepted the challenge, first being promoted to CEO of Alibaba in 2015, the online marketplace founded by Ma, and then succeeding him as chairman after Ma’s retirement on September 10.\n\nZhang, however, is as private as Ma is flamboyant.\n\nRead more: Inside Jack Ma’s 60,000-person retirement party, which was held in an Olympic stadium and featured employee performances that made Ma cry\n\nAlibaba did not immediately respond to Business Insider’s request for comment on the transition or Zhang’s background.\n\nKeep reading to learn more about Daniel Zhang.\n\nDaniel Zhang, 47, is a Shanghai native.\n\nsource ChinaFotoPress/ChinaFotoPress via Getty Images\n\nZhang was born and raised in Shanghai, where his father worked as an accountant, Bloomberg reported. Zhang earned a bachelors degree in finance from the Shanghai University of Finance and Economics, according to his biography on Alibaba‘s website. Zhang is also a certified accountant, according to Fortune.\n\nEarly in his career, Zhang held positions at game developer Shanda Interactive Limited and PricewaterhouseCoopers, according to his biography on Alibaba‘s website.\n\nZhang first joined Alibaba after meeting cofounder and Vice Chairman Joseph Tsai.\n\nZhang and Tsai met while Zhang was Shanda Interactive’s chief financial officer in 2007, Bloomberg reported.\n\n“Daniel really understands business,” Tsai told Bloomberg of Zhang. “You can’t disrupt unless you really understand what you’re trying to disrupt.”\n\nRead more: Alibaba billionaire Joseph Tsai is buying out the Brooklyn Nets and the Barclay Center in a $2.35 billion deal, and it’s the highest price ever paid for a sports franchise\n\nMa promoted Zhang to CEO in May 2015.\n\ncaption Alibaba CEO Daniel Zhang speaks at a screen showing total value of goods transacted at Alibaba Group’s 11.11 Global shopping festival in Beijing, China, November 12, 2015. source Kim Kyung-Hoon/Reuters\n\nBefore that, Zhang served as Alibaba’s chief operating officer, according to his biography on Alibaba‘s website.\n\nMa originally appointed Jonathan Lu CEO after he himself vacated the position, but later decided that Alibaba would best be run by someone younger, Fortune reported.\n\nMa announced that Zhang would also succeed him as chairman in a letter published in September 2018.\n\ncaption Jack Ma, former chairman of Alibaba Group, in Paris in May 2019. source REUTERS/Charles Platiau/File Photo\n\n“Teachers always want their students to exceed them,” Ma wrote, according to a copy of the letter published by Quartz. “So the responsible thing to do for me and the company to do is to let younger, more talented people take over in leadership roles so that they inherit our mission ‘to make it easy to do business anywhere.'”\n\nZhang will likely have a different leadership style than Ma, who Business Insider’s Sinead Baker previously described as “the most flamboyant tech founder on the planet.”\n\ncaption Jack Ma, David Zhang and other Alibaba executives perform at Ma’s retirement party. source Courtesy of Alibaba\n\nMa starred in a kung fu movie, sang at a music festival, and once performed at a company party while dressed as Michael Jackson, Business Insider previously reported.\n\nMa is also known for the extravagant events he holds for employees during Alibaba’s annual Singles Day shopping event, whose sales last year quickly outstripped Amazon’s Prime Day. The event has featured performers like Mariah Carey and Cirque du Soleil.\n\nThat’s not to say that Zhang won’t partake in Alibaba’s famous company events. Zhang performed Josh Groban’s “You Raise Me Up” alongside Ma at the former chairman’s retirement party, the Wall Street Journal reported.\n\nZhang keeps such a low profile that the parents of an Alibaba employee once saw him in Alibaba’s Hangzhou headquarters and mistook him for a janitor, Bloomberg reported.\n\nZhang is not well-known in China like Ma is. Ma is so popular that his speaking engagements often draw large crowds, Business Insider previously reported.\n\nBloomberg described Zhang as “slight and soft-spoken, often proceeding haltingly in English during calls with investors.”\n\nZhang knows he has big shoes to fill.\n\nsource Daniel Zhang\n\n“We believe that the best way to give thanks to yesterday is to create the most beautiful future together,” Zhang said during his speech at Ma’s retirement party.\n\nZhang could face challenges amid the trade war between the US and China and a slowdown in the Chinese e-commerce industry.\n\nShares of Alibaba have lost 15% of their value since June of last year, Bloomberg reported. During Zhang’s tenure as CEO before then, Alibaba’s shares tripled, according to Bloomberg.\n\nRead more: Alibaba Chairman Jack Ma is stepping down on his 55th birthday on Tuesday, and his hand-picked successor could face a daunting challenge\n\nZhang is also looking towards Alibaba’s next big business.\n\n“Every business has a life cycle,” Zhang told Bloomberg. “If we don’t kill our existing business, someone else will. So I’d rather see our own new businesses kill our existing business.”\n\nOne new business Zhang supports is grocery and restaurant delivery service Freshippo, according to Bloomberg. Zhang worked on the project with a small team in a garage in Shanghai for months.\n\nZhang is already a workaholic, according to Bloomberg.\n\ncaption Alibaba CEO Daniel Zhang at the World Economic Forum in Davos, 2019. source Business Insider/WEF\n\nA normal weekday for Zhang “amounts pretty much to work, eat, and sleep,” according to Bloomberg.\n\nAlibaba has a reputation for requiring demanding hours and travel schedules from its employees, something employees poked fun at during their performances at Ma’s retirement party September 10.\n\nZhang has already created some big hits. He was a part of the team that created Alibaba’s hugely successful Single’s Day.\n\nZhang personally lobbied the online marketplaces’ merchants to participate in the first Singles’ Day in 2009, Bloomberg reported.\n\nThe event generated $25 billion in sales in 2018 and is bigger than Black Friday and Cyber Monday combined, Business Insider previously reported. Occurring every November 11, Singles Day is the world’s largest day on online shopping.", "description": "Business Insider - As Alibaba's new chairman, Zhang could face challenges amid the trade war between the US and China and a slowdown in the Chinese e-commerce industry.. Read more at businessinsider.sg", "authors": ["Taylor Nicole Rogers", "Business Insider Us"], "top_image": "https://static.businessinsider.sg/sites/2/2019/09/5d7811f12e22af1e4f19af33.png", "published_at": "2019-09-11"}