{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/25/climate-change-activism-the-lefts-new-power-play", "downloaded_at": "2019-09-25 13:39:52.879712+00:00", "title": "Climate change activism: The left's new power play", "language": "en", "text": "ANALYSIS/OPINION:\n\nAs we lead into the United Nations General Assembly in New York, the climate change extremists were out in force. There were student walkouts, demonstrations blocking traffic in Washington, D.C., and the adolescent child of Swedish theater performers lecturing and threatening attendees at the U.N.’s Climate Action Summit in Gotham.\n\nGreta Thunberg, a teen climate activist, was the media’s darling as she chastised world leaders with rage and threats over the lack of “climate” action: “You all come to us young people for hope. How dare you! You’ve stolen my dreams and my childhood with your empty words.”\n\nClimate activism is a new power-play by the left, taking on a fanatical religious facade making manipulation of its followers even more assured. But this week made clear that it has nothing to do with saving people’s lives or the planet itself; it’s just another manipulative gambit by the worldwide left for political power.\n\nFrom the start, the issue of “climate change” is perfect for the fear-mongering left. It is as malleable as Play-Doh, presenting a never-ending, always-changing existential crisis. It is something you can use to manipulate and terrify people for generations to come.\n\nIf those manipulating young people into a terrifying belief in impending doom were serious about wanting to save the planet and the people on it, they wouldn’t have to look very far for actual existential threats threatening humanity on a daily basis. Threats that have solutions.\n\nJust a few days ago BuzzFeed News reported that NASA internal emails revealed their scientists completely missed a football field-sized asteroid that barely missed Earth on July 25.\n\nThe website reported, “In late July, a record-setting asteroid hurtled just 40,400 miles over [E]arth, the largest space rock to come so close in a century. But perhaps more alarming than the flyby itself is how much it caught NASA by surprise. … Spotted just 24 hours before a relatively narrow miss with Earth, the incident reveals holes in NASA’s surveillance network to observe incoming space rocks. …”\n\nThe report indicated that the asteroid was flying at 55,000 mph and was detected first by an observatory in Brazil.\n\n“The flyby came five times closer to Earth than the distance of the moon,” BuzzFeed reported.\n\nIn one of the emails, obtained by the website through a FOIA request, a scientist at NASA’s Jet Propulsion Laboratory wrote to his colleagues, “This object slipped through a whole series of our capture nets,” adding, “I wonder how many times the situation has happened without the asteroid been discovered at all.”\n\nThat’s nice.\n\nOn NASA’s Planetary Defense frequently asked questions page, they tell us that we have discovered more than 19,000 “near Earth asteroids.” Those, of course, are just the ones we know of.\n\nIn addressing whether or not we would be able to shoot down an asteroid that is about to hit Earth, they noted, “An asteroid on a trajectory to impact [E]arth could not be shot down in the last few minutes or even hours before impact. No known weapon system could stop the mass because of the velocity at which it travels, an average of 12 miles a second.”\n\nOkey-dokey. But we’ve known this. There have been some theoretical discussions about the possibility of using a nuclear warhead on an incoming asteroid to destroy it before it gets near Earth’s atmosphere. And as the July debacle showed us, we have to work on finding the asteroids in the first place.\n\nIn the meantime, last December a tsunami in Indonesia killed more than 280 people. There was no warning or earthquake. It shocked the world as more than 1,000 people were injured, hundreds of buildings were destroyed, and as The New York Times reported, it was the second deadly tsunami in Indonesia last year.\n\nAn Indonesian official told reporters that they were unable to detect the tsunami and provide a warning because “we do not have a tsunami early warning system that’s triggered by underwater landslides and volcanic eruptions. What we have is early warning based on earthquake as a trigger,” The Times reported.\n\nNone of us will forget the horrific Dec. 26, 2004, tsunami that hit 14 countries, killing about 225,000 people. Most of us presumed that in the last 14 years there would’ve been tsunami early warning systems in place covering all potential tsunami events.\n\nWhile the asteroid and tsunami threats are complicated, they are scientifically known events, and with the right focus and investment, solutions can be found that will save lives. There is also the imperative of focusing on early warning systems for earthquakes, which would save untold number of lives when the “big one” hits.\n\nThen there’s climate change fanaticism. The rhetoric introduced by Rep. Alexandria Ocasio-Cortez of New York reveals the desperation of the left to manipulate us into a panic as she insists, without evidence or scientific facts, that we only have 12 years to live if we don’t do as leftist ideologues demand.\n\nClimate change fanaticism is a cynical and dangerous distraction, frightening children and adults alike, into believing that those who are opposed to the leftist agenda want the planet to die. The real crimes of asteroids, tsunamis and earthquakes are that they aren’t the fault of humans, and their solutions rely on science, not politics.\n\nMagically, “climate change” somehow can only be solved if we implement a leftist agenda, casting us back into the stone age. Ending the use of fossil fuels won’t stop an asteroid. Banning the eating of meat won’t make a difference with tsunamis. Banning plastic straws isn’t going to stop the football field-sized asteroid from slamming into Earth. And keeping you from being able to travel on an airplane isn’t going to alert citizens of an impending earthquake.\n\nThe reason the existential threat can only be climate change is because, as designed by its apostles, it’s our fault and requires political action aimed at controlling your entire life. In the meantime, we must decide to stop allowing Hollywood, misled adolescents and political charlatans from distracting us to death with nonsensical political theater.\n\n• Tammy Bruce, president of Independent Women’s Voice, author and Fox News contributor, is a radio talk-show host.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "As we lead into the United Nations General Assembly in New York, the climate change extremists were out in force. There were student walkouts, demonstrations blocking traffic in Washington, D.C., and the adolescent child of Swedish theater performers lecturing and threatening attendees at the U.N.'s Climate Action Summit in Gotham.", "authors": ["The Washington Times Http", "Tammy Bruce"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/23/aptopix_un_general_assembly_climate_conference_76370_c0-166-1980-1320_s1770x1032.jpg?aa02766cfb9ecf2e89c48d7f57b459b0c389d4d4", "published_at": "2019-09-25"}