{"pub": "guardian", "url": "https://theguardian.com/football/2019/sep/28/tottenham-southampton-premier-league-match-report", "downloaded_at": "2019-09-28 21:33:33.724210+00:00", "title": "Harry Kane rescues Hugo Lloris as 10-man Tottenham beat Southampton", "language": "en", "text": "With the heat on, the last thing that Mauricio Pochettino needed was a daft sending-off for the loose cannon that is Serge Aurier after 31 minutes and a goalkeeping howler from Hugo Lloris that presented Danny Ings and Southampton with an equaliser.\n\nAt that point, it was easy to fear for Tottenham, who had won only two of their previous eight matches in all competitions this season. It has been a slog and it has been impossible to ignore the impression that the problems have piled up for the club since the summer. The challenge for them was to get over this latest bump; to show their determination to fashion a springboard for better things.\n\nChris Wood strikes for Burnley to deny a frustrating Aston Villa Read more\n\nThanks to Harry Kane – who else? – and a battling performance, they did so. Kane was excellent and he scored what proved to be the winner just before half-time, rounding off a flowing move with trademark ruthlessness, while there would be redemption of sorts for Lloris, who made two high-class saves in the second half.\n\n“A few months ago, we played in the Champions League final and we cannot have changed too much since then,” Pochettino said. “I am not surprised about the character we showed. We need to realise that every time we play, we have to use this character.”\n\nEverybody at Spurs could breathe a little easier after the victory but for Southampton there were only regrets. Their achilles heel remains their lack of cutting edge. They had more of the ball and the chances to have got something but the statistics show they have scored only seven times in seven Premier League games this season.\n\nSpurs were desperate to impose themselves and Tanguy Ndombele was in the mood at the outset, driving past opponents and getting his team moving with sharp flicks and passes. It was Ndombele who broke the deadlock.\n\nMoments earlier, he had not quite been able to get a low pull-back from Son Heung-min out of his feet quickly enough and, when a Southampton boot came in, his shot deflected high. He had no such trouble when Son teed him up again, after Maya Yoshida had half-cleared a Christian Eriksen cross.\n\nNdombele’s shot was cleanly struck and his second goal in a Spurs shirt flicked off Jan Bednarek to beat Angus Gunn. He celebrated with Aurier, the pair pretending to perform a VAR check before signalling the goal – a reference to how Aurier had been denied by the technology at Leicester last Saturday.\n\nFacebook Twitter Pinterest Danny Ings celebrates and Hugo Lloris is floored after his blunder. Photograph: Paul Childs/Action Images via Reuters\n\nIt had felt as though Aurier’s afternoon was shaping up positively. But the right-back is a player who likes to live on the edge and he jumped over it with a pair of foolish bookings in the space of three minutes.\n\nOnly Aurier knows what he was thinking about when he needlessly went through the back of Sofiane Boufal in a non-dangerous area. And, when he was caught on the wrong side of Ryan Bertrand and fouled him, the referee, Graham Scott, had no other option. Spurs argued that Pierre-Emile Højbjerg had allowed the ball to go out of play before he set Bertrand away. That did not excuse Aurier’s actions.\n\nWorse was to follow for Spurs and, specifically, Lloris. Taking a back pass from Toby Alderweireld, he tried to trick his way past Ings when under pressure from the striker with a Cruyff turn only to get it all wrong. Ings robbed him and forced the ball home from two yards.\n\nLuka Milivojevic and Andros Townsend score as Crystal Palace beat Norwich Read more\n\nIt was a terrific first half with action at both ends, with choice cuts including Lloris’s save to deny Højbjerg and one from Gunn to keep out Son’s flick header. Tottenham stormed back to lead at the interval and what a lovely counterattacking goal it was, featuring instinctive combinations on the move between Kane, Son and Eriksen. The final ball came from Eriksen. Kane took a touch and banged it low into the bottom corner.\n\nRalph Hasenhüttl had looked ready to start with a back four only to lose Cédric Soares to an injury in the warm-up, call in Jannik Vestergaard and go with a 3-4-1-2 system. The manager is likely to be furious that his team conceded on the break against 10 men but he made tweaks to give them a platform to find the equaliser, most notably moving James Ward-Prowse from right wing-back to central midfield.\n\nSouthampton pushed and they asked questions of Lloris. This time, he had the answers. Lloris saved at full stretch from Ward-Prowse’s free-kick and a Yoshida header – andwhen Ings stretched but could not convert a Boufal cross, Southampton knew it was not their day.", "description": "Tottenham recovered from having Serge Aurier sent off in the first half and conceding an equaliser because of a Hugo Lloris blunder to beat Southampton 2-1", "authors": ["David Hytner"], "top_image": "https://i.guim.co.uk/img/media/9229756bc6ae508f0e460de1b0de8a851e4dbf30/0_187_2261_1356/master/2261.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=0f0adbc963c3b31a5e1177c6d9a3e286", "published_at": "2019-09-28"}