{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7563271/Dealer-charged-killing-Jodie-Chesney-says-didnt-know-busy-day-dealing.html", "downloaded_at": "2019-10-11 20:45:20.548348+00:00", "title": "Dealer charged with killing Jodie Chesney says he didn't know her and was busy 'all day dealing'", "language": "en", "text": "Manuel Petrovic, 20, is one of four youths jointly accused over the death of Jodie Chesney (pictured)\n\nA drug dealer who is charged with killing girl scout Jodie Chesney says he did not know her or any of her friends, the Old Bailey has heard.\n\nManuel Petrovic, 20, is one of four youths jointly accused over the death of the popular 17-year-old in Amy's Park in Harold Hill, east London, on March 1.\n\nPetrovic said he did not know she was going to the park and he had spent his day doing drug deals.\n\nThe court was told Ms Chesney and a group of friends were walking to the park at about 6.50pm.\n\nDefence lawyer Sarah Forshaw QC asked Petrovic: 'Did you know anybody from Jodie Chesney's group of friends?'\n\nPetrovic replied: 'No, I did not know any of them.'\n\nMs Forshaw asked: 'Did you have any idea there was a group of people heading towards Amy's Park at about 6.50pm?'\n\nPetrovic said: 'No, I did not.'\n\nHe denies murder along with Svenson Ong-a-Kwie, 19, and two youths aged 16 and 17, from east London.\n\nPetrovic (pictured in a court sketch today) said he did not know she was going to the park and he had spent his day doing drug deals\n\nPetrovic (right) denies murder along with Svenson Ong-a-Kwie (left), 19, and two youths aged 16 and 17, from east London\n\nJodie died after being stabbed in the back in this park in Romford, East London, on March 1\n\nMs Chesney was stabbed in the back as she was sitting in the park with friends.\n\nPetrovic agreed he had been 'all day dealing' when he was asked about his actions throughout the day through to early evening by Ms Forshaw.\n\nHe told the court he had gone to a cafe at about noon with two of his co-defendants.\n\nThe defendant said he was carrying a bag containing drugs worth about £2,000 at that point.\n\nPetrovic said he started taking cannabis when he was 13 or 14 years old.\n\nHe told the court he had been a would-be footballer who might have been scouted by West Ham, but the chance slipped by as he 'got into trouble with drugs and was bunking off school'.\n\nPetrovic is the youngest of five children of Croatian parents who split when he was about 14 years old. He has lived in the UK all his life.", "description": "Manuel Petrovic, 20, is one of four youths jointly accused over the death of popular 17-year-old Jodie Chesney (pictured) in Amy's Park in Harold Hill, east London, on March 1.", "authors": ["James Gant For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/15/19594924-0-image-a-18_1570805906283.jpg", "published_at": "2019-10-11"}