{"pub": "independent", "url": "https://independent.co.uk/arts-entertainment/films/news/matt-damon-avatar-role-cast-profits-box-office-le-mans-66-movie-interview-a9127831.html", "downloaded_at": "2019-10-01 11:44:13.355609+00:00", "title": "Matt Damon reveals he lost out on $250m in profits after turning down Avatar role", "language": "en", "text": "Matt Damon has revealed that he lost out on £250 million worth of profits when he turned down the lead role in Avatar.\n\nThe actor said that when director James Cameron approached him for the role of Jake Sully – which was eventually taken by Sam Worthington – he also offered him 10 per cent of the movie’s profits.\n\nAvatar made $2.79 billion at the worldwide box office in 2009, meaning Damon could have earned upwards of a quarter of a million dollars.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“Jim Cameron offered me Avatar,” Damon told GQ, “and when he offered it to me, he goes, ‘Now, listen. I don’t need anybody. I don’t need a name for this, a named actor. If you don’t take this, I’m going to find an unknown actor and give it to him, because the movie doesn’t really need you. But if you take the part, I’ll give you ten per cent of...’”\n\nShape Created with Sketch. The 10 best films about aliens Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The 10 best films about aliens 1/10 The Blob (1958; Irvin Yeaworth) So eager are we to plant metaphors onto alien movies that The Blob has been referred to as everything from an analogy for the Cold War to a grim warning against the perils of capitalism. But it’s also very much about a giant blob of goo that consumes everything in its wake. A pre-fame Steve McQueen in his feature film debut is the preppie high-schooler facing off against the aggressive alien entity. Burt Bacharach sings the film’s theme song¬ – driving home The Blob’s kitsch, drive-in-movie charm. 2/10 The Man Who Fell to Earth (1976; Nicholas Roeg) If the experience of being abducted by aliens was translated into a cinematic mood, it would result in something like The Man Who Fell to Earth. It dispenses with all logic and concept of linear time, and instead takes place in a kind of unmoored netherworld (Nicholas Roeg fans will recognise and appreciate it immediately). And its power is punctuated, of course, by the presence of David Bowie, who is beautiful and uncanny, and perfectly cast. Rex Features 3/10 Invasion of the Body Snatchers (1978; Philip Kaufman) We’re long-overdue a new remake of Invasion of the Body Snatchers. The pod-people premise is effortlessly translated into new decades, and spun into powerful new metaphors for modern threats. But of the many incarnations of Jack Finney’s novel, it’s Philip Kaufman’s 1978 adaptation that remains its most terrifying and daring, exploiting the Cold War paranoia of the era and building to a devastatingly brutal final twist. Donald Sutherland, Leonard Nimoy and a young Jeff Goldblum are among the stars confronted with an alien invasion that replaces the world’s populace with mindless doppelgängers. Rex 4/10 Alien (1979; Ridley Scott) The original and still the best. And not just in terms of the long-running Alien franchise, but the alien genre as a whole. Chilly and sparse, with moments of languid contemplation interrupted by bloody carnage, Alien is both a haunted house movie and delicate meditation on life, power and authority. HR Giger’s ubiquitous design work remains terrifying, and Sigourney Weaver is an instant star as the compassionate and smart Ellen Ripley. Rex Features 5/10 ET: The Extra-Terrestrial (1982; Steven Spielberg) A film that taught a generation of children (and, if we’re being honest, their parents) the importance of friendship, whether shared with an intergalactic gremlin or not. ET is magical cinema and the finest distillation of Steven Spielberg’s power as a filmmaker – emotional but never cloying, otherworldly but always resolutely human, and with a deep understanding and respect for child-like wonder. Anyone who isn’t in a puddle of tears by its conclusion is, I think according to international law, an irredeemable monster. GETTY IMAGES 6/10 Liquid Sky (1982; Slava Tsukerman) Liquid Sky is a fluorescent revenge tale, a hyper-stylised fever dream, and the most vivid depiction of New York’s underground no-wave scene in the early 1980s. It sees aliens arriving in New York in search of heroin, only to discover better highs via the human orgasm. Meanwhile an aspiring, put-upon model learns that alien powers can be a tool to rid the world of bad people. Liquid Sky touches on sex, drugs, art and androgyny, with eye-candy set design and a transfixing lead performance from Anne Carlisle. 7/10 Starman (1984; John Carpenter) Starman is ET if ET was an incredibly handsome 30-something man who looks uncannily like your dead ex. A radical departure for John Carpenter, this 1984 romantic drama sees Karen Allen’s grief-stricken widow spooked and then saved by the arrival of an alien who takes the form of her dead husband. An Oscar-nominated Jeff Bridges stars as the Starman of the title; he is astounding, tasked with embodying something odd and otherworldly yet warm enough to be loveable. The film’s climax, in all its aching, deeply romantic glory, is a tribute to maintaining hope in the face of grief, and proof that Carpenter is no one-genre pony. 8/10 Contact (1997; Robert Zemeckis) Worth revisiting in the wake of the Amy Adams vehicle Arrival, Contact finds Jodie Foster communicating with aliens and fighting for the right to meet them. It is a still, thoughtful movie, interested in bureaucracy and misogyny in a way that sci-fi movies so often aren’t. But it also recognises the emotional power of marvelling at something extraordinary, and the sheer wonder of cracking open a door to the previously unimaginable. Robert Zemeckis hasn’t done anything of a similar quality in the decades since. Getty 9/10 The Faculty (1998; Robert Rodriguez) A genre-splicing teen thriller that could only have been birthed in an era of Scream and Buffy the Vampire Slayer, The Faculty sees a cluster of disparate high schoolers (Elijah Wood, Josh Hartnett and Clea DuVall among them) become convinced that their teachers have been replaced by aliens (the likes of Salma Hayek, Famke Janssen and a scene-stealing Robert Patrick having been transformed into pod-people overnight). Sweet, pulpy and dripping in Gen-X cool, The Faculty is Body Snatchers by way of The Breakfast Club, with the cheery spookiness of an RL Stine book you loved when you were 13. 10/10 Under the Skin (2013; Jonathan Glazer) Alien movies are unusual in that they’re always driven by outsiders and extra-terrestrials, yet almost always anchored by us, the humans. Under the Skin, a characteristically trippy experiment from visionary filmmaker Jonathan Glazer (Birth, Sexy Beast), is us as seen through the eyes of a beguiling and curious alien played by Scarlett Johansson. She marvels at human idiosyncrasies and our faces, or else delights in our chocolate cake. And in a further twist, she finds that she likes us. Under the Skin is uncomfortable and horrifying yet also unusually tender, and proof that we haven’t yet run out of new ways to depict alien visitors. Under the Skin 1/10 The Blob (1958; Irvin Yeaworth) So eager are we to plant metaphors onto alien movies that The Blob has been referred to as everything from an analogy for the Cold War to a grim warning against the perils of capitalism. But it’s also very much about a giant blob of goo that consumes everything in its wake. A pre-fame Steve McQueen in his feature film debut is the preppie high-schooler facing off against the aggressive alien entity. Burt Bacharach sings the film’s theme song¬ – driving home The Blob’s kitsch, drive-in-movie charm. 2/10 The Man Who Fell to Earth (1976; Nicholas Roeg) If the experience of being abducted by aliens was translated into a cinematic mood, it would result in something like The Man Who Fell to Earth. It dispenses with all logic and concept of linear time, and instead takes place in a kind of unmoored netherworld (Nicholas Roeg fans will recognise and appreciate it immediately). And its power is punctuated, of course, by the presence of David Bowie, who is beautiful and uncanny, and perfectly cast. Rex Features 3/10 Invasion of the Body Snatchers (1978; Philip Kaufman) We’re long-overdue a new remake of Invasion of the Body Snatchers. The pod-people premise is effortlessly translated into new decades, and spun into powerful new metaphors for modern threats. But of the many incarnations of Jack Finney’s novel, it’s Philip Kaufman’s 1978 adaptation that remains its most terrifying and daring, exploiting the Cold War paranoia of the era and building to a devastatingly brutal final twist. Donald Sutherland, Leonard Nimoy and a young Jeff Goldblum are among the stars confronted with an alien invasion that replaces the world’s populace with mindless doppelgängers. Rex 4/10 Alien (1979; Ridley Scott) The original and still the best. And not just in terms of the long-running Alien franchise, but the alien genre as a whole. Chilly and sparse, with moments of languid contemplation interrupted by bloody carnage, Alien is both a haunted house movie and delicate meditation on life, power and authority. HR Giger’s ubiquitous design work remains terrifying, and Sigourney Weaver is an instant star as the compassionate and smart Ellen Ripley. Rex Features 5/10 ET: The Extra-Terrestrial (1982; Steven Spielberg) A film that taught a generation of children (and, if we’re being honest, their parents) the importance of friendship, whether shared with an intergalactic gremlin or not. ET is magical cinema and the finest distillation of Steven Spielberg’s power as a filmmaker – emotional but never cloying, otherworldly but always resolutely human, and with a deep understanding and respect for child-like wonder. Anyone who isn’t in a puddle of tears by its conclusion is, I think according to international law, an irredeemable monster. GETTY IMAGES 6/10 Liquid Sky (1982; Slava Tsukerman) Liquid Sky is a fluorescent revenge tale, a hyper-stylised fever dream, and the most vivid depiction of New York’s underground no-wave scene in the early 1980s. It sees aliens arriving in New York in search of heroin, only to discover better highs via the human orgasm. Meanwhile an aspiring, put-upon model learns that alien powers can be a tool to rid the world of bad people. Liquid Sky touches on sex, drugs, art and androgyny, with eye-candy set design and a transfixing lead performance from Anne Carlisle. 7/10 Starman (1984; John Carpenter) Starman is ET if ET was an incredibly handsome 30-something man who looks uncannily like your dead ex. A radical departure for John Carpenter, this 1984 romantic drama sees Karen Allen’s grief-stricken widow spooked and then saved by the arrival of an alien who takes the form of her dead husband. An Oscar-nominated Jeff Bridges stars as the Starman of the title; he is astounding, tasked with embodying something odd and otherworldly yet warm enough to be loveable. The film’s climax, in all its aching, deeply romantic glory, is a tribute to maintaining hope in the face of grief, and proof that Carpenter is no one-genre pony. 8/10 Contact (1997; Robert Zemeckis) Worth revisiting in the wake of the Amy Adams vehicle Arrival, Contact finds Jodie Foster communicating with aliens and fighting for the right to meet them. It is a still, thoughtful movie, interested in bureaucracy and misogyny in a way that sci-fi movies so often aren’t. But it also recognises the emotional power of marvelling at something extraordinary, and the sheer wonder of cracking open a door to the previously unimaginable. Robert Zemeckis hasn’t done anything of a similar quality in the decades since. Getty 9/10 The Faculty (1998; Robert Rodriguez) A genre-splicing teen thriller that could only have been birthed in an era of Scream and Buffy the Vampire Slayer, The Faculty sees a cluster of disparate high schoolers (Elijah Wood, Josh Hartnett and Clea DuVall among them) become convinced that their teachers have been replaced by aliens (the likes of Salma Hayek, Famke Janssen and a scene-stealing Robert Patrick having been transformed into pod-people overnight). Sweet, pulpy and dripping in Gen-X cool, The Faculty is Body Snatchers by way of The Breakfast Club, with the cheery spookiness of an RL Stine book you loved when you were 13. 10/10 Under the Skin (2013; Jonathan Glazer) Alien movies are unusual in that they’re always driven by outsiders and extra-terrestrials, yet almost always anchored by us, the humans. Under the Skin, a characteristically trippy experiment from visionary filmmaker Jonathan Glazer (Birth, Sexy Beast), is us as seen through the eyes of a beguiling and curious alien played by Scarlett Johansson. She marvels at human idiosyncrasies and our faces, or else delights in our chocolate cake. And in a further twist, she finds that she likes us. Under the Skin is uncomfortable and horrifying yet also unusually tender, and proof that we haven’t yet run out of new ways to depict alien visitors. Under the Skin\n\nAfter Damon trailed off, interviewer Stuart McGurk asked: “He offered you ten per cent of the Avatar profits?”\n\nTo which Damon replied: “I told John Krasinski this story when we were writing Promised Land... he goes, ‘What?’ And he stands up and he starts pacing in the kitchen. He goes, ‘OK. OK. OK. OK. OK.’\n\n\"He goes, ‘If you had done that movie, nothing in your life would be different. Nothing in your life would be different at all. Except that, right now, we would be having this conversation in space.’\"\n\nDamon added: “So, yeah. I’ve left more money on the table than any actor actually… So that sucked and that’s still brutal. But my kids are all eating. I’m doing OK.”\n\nThe actor previously revealed he turned down Avatar due to a scheduling clash with his other films The Bourne Ultimatum and The Green Zone.", "description": "Matt Damon has revealed that he lost out on £250 million worth of profits when he turned down the lead role in Avatar. The actor said that when director James Cameron approached him for the role of Jake Sully – which was eventually taken by Sam Worthington – he also offered him 10 per cent of the movie’s profits.", "authors": ["Ellie Harrison"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/23/07/gettyimages-1138814651.jpg", "published_at": "2019-10-01"}