{"pub": "foxnews", "url": "https://foxnews.com/travel/tourists-arrested-yellowstone-old-faithful-geyser", "downloaded_at": "2019-09-17 23:25:22.104121+00:00", "title": "Tourists arrested at Yellowstone National Park's Old Faithful geyser for 'thermal trespassing'", "language": "en", "text": "Two men are in hot water for getting too close to the hot water at the Old Faithful geyser in Yellowstone National Park in Wyoming. The tourists have since been arrested for “thermal trespassing” at the famous hot spring and are now due in court in two months.\n\nOn Sept. 10, two men were caught walking “dangerously close” to the spout of the legendary geyser and taking photos on their cellphones, said National Park Service (NPS) officials to KRTV.\n\nThe identities of the men have not yet been released.\n\n\"My family and I just couldn't believe what was happening,\" witness Kimberly Guilliams told ABC News. \"They just didn't care and we couldn't believe that they thought that that was OK.\"\n\nFATHER, SON FISHERMEN VIDEO HUMPBACK WHALE BREACHING WATERS OFF NEW JERSEY\n\nGuilliams said that the highly visited attraction is well marked with “No Trespassing” signs and a designated boardwalk to safely tour Old Faithful.\n\n\"I don't see how anyone couldn't be aware of the rules,\" she continued. \"They're posted everywhere. They're in multiple different languages. All around the border of the geyser, there are rules saying that it is very dangerous, that the ground is unstable and very fragile.\"\n\nBoth men have since been charged with thermal trespassing and are scheduled to appear in court in December, according to the outlet.\n\nThough a spokesperson for the NPS was not immediately available to offer further comment on the incident, officials for the park posted the following message to Facebook two days later, perhaps inspired by the offense.\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\n“Whether you’re looking for colorful springs or grand canyons, always remember to practice #SafeSelfies! No picture is worth hurting yourself, others, or the park,” officials wrote online. “Be aware of your surroundings whether near wildlife, thermal areas, roads, or steep cliffs.”\n\nIn addition, reps for Yellowstone offered the following statement on the story to Fox News:\n\n“Thermal area safety is an extremely important part of any trip to Yellowstone. We ask visitors to take the Yellowstone Pledge before coming to the park and to read the park Visitor Guide for more information on safety, rules and regulations,” a spokesperson said on Sept. 17. “Detailed information can also be found on the Yellowstone National Park app which will operate without cell service as long as it is downloaded before entering the park.”\n\nIt would hardly be the first time, however, that bad behavior at Old Faithful has made headlines.\n\nIn September 2018, a Yellowstone visitor was ticketed for walking too close to the famous geyser and reportedly urinating on it.\n\nIn August 2019, another Yellowstone tourist went viral for all the wrong reasons when he walked dangerously close to Old Faithful and allegedly flipped off a disapproving crowd.\n\nAs noted by Travel + Leisure, the geyser erupts boiling hot water every hour or so, shooting out around 3,700 gallons as high as 184 feet in the air during a regular eruption. The hot water is about 204 degrees Fahrenheit, with steam scorching up to 350 degrees Fahrenheit.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nFox News’ Michael Bartiromo and the Associated Press contributed to this report.", "description": "Two men are in hot water for getting too close to the hot water.", "authors": ["Janine Puhak", "Janine Puhak Is An Editor For Fox News Lifestyle. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/old-faithful-1-Facebook.jpg", "published_at": "2019-09-17"}