{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/castle-rock-season-2-is-brimming-with-misery-and-its-not-entirely-annie-wilkes-fault", "downloaded_at": "2019-10-16 07:27:27.140991+00:00", "title": "Castle Rock Season 2 Is Brimming With Misery, And It's Not Entirely Annie Wilkes' Fault", "language": "en", "text": "Image: Hulu\n\nAs we saw last season, and as we’ve known for decades thanks to Stephen King’s interconnected stories, Castle Rock is a grim little town — there’s no way one odd outsider is gonna change the status quo too much. But of course, Annie Wilkes still manages to stir up some chaos.\n\nThe first five (of 10 total) episodes of Castle Rock’s second season were made available for review, and we won’t be spoiling any of the twists here. We can say, however, that you absolutely don’t need to have seen the first season to dive right in; there are some familiar landmarks, like the big church in downtown Castle Rock and the Mellow Tiger bar, and a few sly name-drops (including Shawshank Prison’s late Warden Lacy), but otherwise the first half of season two follows the anthology playbook by offering up a new story and characters.\n\nWell, not entirely new. Anyone who’s read King’s Misery or watched Kathy Bates’ Oscar-winning turn in the 1990 film has Annie Wilkes branded into their nightmares. She’s the prim, folksy, seriously unhinged nurse who “rescues” a famous romance novelist after a car accident, then keeps him prisoner and tortures him while forcing him to write a new book that revives her favourite character.\n\nCastle Rock, which is set in the present day, applies its own timeline to Annie’s story; here, she’s in her 30s (played with mannered, manic energy by the excellent Lizzy Caplan), so it’s probably a decade before the events of Misery, with flashbacks that place her childhood and adolescence in the 1990s.\n\nThe season opens with one of those flashbacks, and though the circumstances aren’t explained until a later episode, it’s safe to say that teenage Annie got mixed up in Something Very Bad that will reverberate throughout her life. Without giving anything away, it’s something that instilled her passion for reading and the idea of being a writer’s “number one fan,” but also awakened the full capabilities of her terrifying dark side.\n\nWhen we meet contemporary Annie in Castle Rock, she’s living like a nomad with her daughter Joy (Eighth Grade’s Elsie Fisher, here playing another awkward teen with authentic angst). The two are on a continuous road trip as Annie, who’s secretive and clearly on the run from that thing in her past, infiltrates hospitals dressed in her nurse garb to steal the pills she needs — not to feed an addiction, but to keep her mood swings and her occasionally slippery relationship with reality in check.\n\nWhen a late-night car accident strands the duo in Maine, Annie and Joy become drawn into the drama — cultural, familial and supernatural — that’s already brewing in Castle Rock, as well as the adjacent town of Jerusalem’s Lot.\n\nJoy (Elsie Fisher), surrounded by ominous Castle Rock atmosphere. (Image: Dana Starbard, Hulu)\n\nOnce again, if you’ve read ’Salem’s Lot, its related short stories, and/or watched the made-for-TV movie or miniseries (side note: a James Wan-produced feature film is also in the works), you know what to expect: bloodthirsty creatures of the night!\n\nThe area’s sinister past, already teased in the story thanks to strangely macabre signs touting Castle Rock’s upcoming 400-year anniversary celebration, is brought into sharper focus when Annie has reason to visit the infamous Marsten House — a loaded structure in the King literary universe, perhaps not as well-known as The Shining’s Overlook Hotel or It’s Neibolt Street house, but overflowing with just as many bad vibes.\n\nWe won’t get into why Annie is there, but geographically speaking, the Marsten House overlooks an intriguing project happening in Jerusalem’s Lot: a cultural centre being built for the area’s Somali refugees. Construction manager Abdi Omar (Captain Phillips’ Barkhad Abdi) and his sister, Nadia (Yusra Warsama), who’s the head doctor at the local hospital, came to Maine as teens after losing their mother during the Battle of Mogadishu.\n\nWhen they arrived in Castle Rock, Abdi and Omar were taken in by Pop Merrill — played by Tim Robbins, whose casting is a nice mirror to his role in 1994's The Shawshank Redemption, though he’s playing a totally different character here. Pop is a gruff but fair Army veteran dying of cancer who’s long been one of the town’s most powerful residents. Like Annie, he’s also hiding an awful secret.\n\nPop is kind of a King deep cut (he’s in the novella The Sun Dog), but another kid he helped raise — his nephew, John “Ace” Merrill (Paul Sparks)—is notorious for his bullying antics in stories like “The Body” (adapted into Stand By Me) and Needful Things. The middle-aged version of Ace is no less cruel and menacing than he was as a young man, though Castle Rock balances him out a little by giving him a brother, Chris (Matthew Alan), who’s a much kinder soul.\n\nThe Omar siblings and their community — likely inspired by Maine’s real-life Somali population — bring some welcome diversity to the story, and also make King’s version of New England feel a little less bound to the past. But just because Abdi and Nadia share Pop with Ace doesn’t mean he accepts them as family; you expect him to be racist, but he’s particularly infuriated when Abdi’s business dealings start encroaching on his turf.\n\nWyd, Annie? (Image: Dana Starbard, Hulu)\n\nAll this is to say that season two of Castle Rock — still showrun by creators Sam Shaw and Dustin Thomason, with J.J. Abrams and King among the exec producers, and an array of different writers and directors involved throughout the season—delivers the viewer into a very tangled web.\n\nThere is a lot going on even without the supernatural elements, which really rise to the surface by episode five and are obviously going to have a huge impact on the back half of the season. Knowing that Annie will survive no matter what happens (so she can meet her end in Misery, that is) doesn’t really compromise any of the drama, because there are so many other characters with so many other things at stake. Each episode is emotional and packed with conflict and just, in general, a lot to take in.\n\nWhile season one also piled on a lot (inter-dimensional portals and fractured timelines, religious fanaticism, dementia, psychic empathy, etc.), the pieces didn’t quite fit together in the end, as much as the show wanted them to. Despite all its high drama, season two feels a little more conventional in its narrative, and that’ll likely make for a more satisfying story arc, especially with all the horror-fantasy elements to come.\n\nThe decision to make a known antagonist the main protagonist — Annie is the ultimate unreliable narrator, being a perpetual liar who also experiences hallucinations on the regular — is also an intriguing one. Among King’s hundreds of character creations, Annie’s someone whose backstory seems especially ripe for exploration.\n\nWe’re primed to fear and dislike her from the start, considering what we know from Misery and from seeing the strict way she controls Joy, a shy girl who wants nothing more than a stable, normal life. But there’s a specific moment in the season premiere (no spoilers, but you’ll know it when you see it) when you will find yourself rooting for Annie as she faces off with another character. They clearly have no idea what she’s capable of, but we sure do, and the payoff is tremendous.\n\nCastle Rock premieres October 24 on Hulu in the U.S. and will stream on Fox Showcase in Australia.", "description": "As we saw last season, and as we’ve known for decades thanks to Stephen King’s interconnected stories, Castle Rock is a grim little town — there’s no way one odd outsider is gonna change the status quo too much. But of course, Annie Wilkes still manages to stir up some chaos....", "authors": ["Bradley Brownell", "Tegan Jones"], "top_image": "https://edge.alluremedia.com.au/m/g/2019/10/CastleRock_S2_FullTeaser_90s_IG-TV_16x9_Bugs_Captions_091119_Web-Copy-01.01_00_32_02.Still0122W.jpg", "published_at": "2019-10-16"}