{"pub": "nytimes", "url": "https://nytimes.com/2019/10/10/opinion/frederick-douglass-detroit.html", "downloaded_at": "2019-10-11 00:18:04.722835+00:00", "title": "Opinion | What Makes Us All Radically Equal", "language": "en", "text": "Douglass’s genius was his ability to balance his indignation at oppression with his underlying faith in the American project. In his speeches he would praise his white audiences in one movement and thunder condemnation in the next. In an 1876 speech about Abraham Lincoln, he both condemned and complimented the man who inspired and infuriated him: “Viewed from the genuine abolition ground, Mr. Lincoln seemed tardy, cold, dull and indifferent; but measuring him from the sentiment of his country … he was swift, zealous, radical and determined.”\n\nDouglass could withstand all the ups and downs, all the ambivalences, because of an unchanging underlying belief: in the natural rights of all humankind.\n\nHe constantly returned to the core belief of America’s founding in 1776, that we are endowed by our creator with certain unalienable rights. Slavery and racism were not just wrong — they betrayed the divine natural order of the universe. Douglass had an underlying faith in the providence. Justice would eventually triumph. The “laws which govern the moral universe,” he said, would make it so.\n\nAnd here we get to the nub of what sustained Douglass and what sustains people today as they do this work. It is the belief that all humans have souls. It is the belief that all people of all races have a piece of themselves that has no size, weight, color or shape, but which gives them infinite value and dignity.\n\nIt is the belief that our souls make us all radically equal. Our brains and bodies are not equal, but our souls are. It is the belief that the person who is infuriating you most right now still has a soul and so is still, deep down, beautiful and redeemable. It is the belief that when all is said and done all souls have a common home together, a final resting place as pieces of a larger unity.\n\nWhen people hold fast to their awareness of souls, then they have a fixed center among the messiness of racial reconciliation and they give each other grace. If they lose the concept of the soul, they’ve lost everything.\n\nThe Times is committed to publishing a diversity of letters to the editor. We’d like to hear what you think about this or any of our articles. Here are some tips. And here’s our email: letters@nytimes.com.\n\nFollow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.", "description": "It’s not our brains and it’s not our bodies.", "authors": ["David Brooks"], "top_image": "https://static01.nyt.com/images/2019/10/10/opinion/10brooksWeb/10brooksWeb-facebookJumbo.jpg", "published_at": "2019-10-10"}