{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-49604584", "downloaded_at": "2019-09-06 12:18:40.751761+00:00", "title": "Brexit: Gina Miller's bid to stop UK Parliament suspension rejected", "language": "en", "text": "Media playback is unsupported on your device Media caption Gina Miller: \"My legal team and I will not give up the fight for democracy\"\n\nA legal challenge over Prime Minister Boris Johnson's decision to suspend Parliament has been rejected in the High Court.\n\nThe case was brought by businesswoman Gina Miller, who argued the move was \"an unlawful abuse of power\".\n\nRejecting Ms Miller's case, Lord Justice Burnett said she could immediately appeal because of the important points of law at stake.\n\nThe appeal is expected to be heard at the Supreme Court on 17 September.\n\nMs Miller said she was \"very disappointed with the judgment\".\n\nShe added: \"We feel it is absolutely vital that Parliament should be sitting. We are therefore pleased that the judges have given us permission to appeal to the Supreme Court, which we will be doing, and they feel that our case has the merit to be handed up.\"\n\nA similar legal challenge was rejected at Edinburgh's Court of Session earlier this week, and an appeal against that decision was heard on Thursday.\n\nThe judges are expected to announce their decision later.\n\nThe prime minister announced on 28 August he wanted to shut down Parliament, a process known as proroguing, for five weeks ahead of a Queen's Speech on 14 October.\n\nHis political opponents argued at the time that Mr Johnson's aim was to avoid parliamentary scrutiny and to stop them passing legislation that would prevent the UK leaving the European Union without a deal on 31 October.\n\nThe UK government insisted this was not the case and said the aim of proroguing Parliament was to allow Mr Johnson to set out his legislative plans in the Queen's Speech while still allowing sufficient time for MPs to debate Brexit.\n\nA bill designed to prevent a no-deal Brexit has since been passed by MPs and is expected to gain royal assent before the shutdown next week.\n\nImage copyright PA Media Image caption Lord Chief Justice Lord Burnett, centre, President of the Queen's Bench Division Dame Victoria Sharp and Master of the Rolls Sir Terence Etherton heard the case in London\n\nIn 2017, Gina Miller won a case which stopped ministers triggering the Article 50 process - by which the UK leaves the EU - without a vote in Parliament.\n\nThe latest case brought by Ms Miller was supported by a number of other parties, including former prime minister Sir John Major.\n\nDuring the hearing, Lord Pannick QC said prorogation breached the legal principle of Parliamentary sovereignty.\n\nHe said the PM's decision was \"extraordinary\" - both because of the \"exceptional length\" of the suspension and because Parliament would be \"silenced\" during the critical period leading up to the 31 October deadline.\n\nMr Johnson's lawyers argued prorogation was a political, not a legal, matter.\n\nRejecting the case, Lord Burnett said: \"We have concluded that, whilst we should grant permission to apply for judicial review, the claim must be dismissed.\"\n\nThe three judges are expected to give their reasons for dismissing the case in writing next week.\n\nWe don't know why Gina Miller lost, but we have an idea of what will be before the Supreme Court.\n\nMs Miller's team accepts Boris Johnson can ask the Queen to shut down Parliament.\n\nBut they argued an exceptional five-week prorogation was an abuse of his executive powers.\n\nThe problem in challenging that in court is that judges are there to enforce the law.\n\nThe government argues that the law is silent on how long a prorogation should be and that it doesn't help the court judge whether Parliament actually wants to sit, or what would constitute \"sufficient\" time for considering Brexit - or indeed whether the entire affair is simply a giant political argument that's no business of M'Lords and Ladies at all.\n\nAnd that's why the case is heading to the Supreme Court.\n\nWhat other legal challenges are taking place?\n\nImage copyright EPA Image caption SNP MP Joanna Cherry has led the legal challenge in Scotland\n\nIn Scotland, a group of politicians are attempting to overturn a court ruling made on Wednesday that Mr Johnson's plan to shut down parliament ahead of Brexit is, in fact, legal.\n\nLord Doherty, sitting at the Court of Session, said the prime minister had not broken any laws by asking the Queen for a five-week suspension as it was for Parliament and the electorate to judge the prime minister's actions - not the courts.\n\nThe group of more than 70 largely pro-Remain politicians, headed by SNP MP Joanna Cherry, argues that Mr Johnson is exceeding his powers and attempting to undermine democracy by avoiding parliamentary scrutiny before the UK leaves the EU on 31 October.\n\nAfter Lord Doherty's ruling, a UK government spokesman said: \"We welcome the court's decision and hope that those seeking to use the judiciary to frustrate the government take note and withdraw their cases.\"\n\nIn Belfast, a campaigner for victims of the Troubles is also bringing a case on Friday arguing that a no-deal exit from the EU could jeopardise the Northern Ireland peace process.\n\nThe lawyers of Raymond McCord - whose son was murdered by the loyalist Ulster Volunteer Force in 1997 - argue no-deal would endanger the Good Friday Agreement and that suspending Parliament is unconstitutional.\n\nAt a preliminary hearing on Thursday, a lawyer for the government argued for a delay to the case, saying the Labour-backed anti no-deal Brexit bill had \"changed the paradigm\" and altered the need for an urgent judgment.\n\nBut Mr McCord's lawyer said the case was ready to proceed and while it \"looked as if\" the bill would become law, \"we don't know\".\n\nWhat questions do you have about the latest Brexit developments?\n\nUse this form to ask your question:", "description": "But the High Court rules businesswoman Gina Miller, who brought the case, can immediately appeal.", "authors": [], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p07mmb37.jpg", "published_at": "2019-09-06"}