{"pub": "townhall", "url": "https://townhall.com/tipsheet/mattvespa/2019/10/08/scotus-to-nyc-oh-were-going-to-hear-your-ridiculous-gun-law-case-n2554344", "downloaded_at": "2019-10-09 00:37:41.222034+00:00", "title": "SCOTUS to NYC: Oh, We're Going To Hear Your Ridiculous Gun Law Case", "language": "en", "text": "We all know New York is an anti-gun bastion. The state, like most in the Northeast with the exception of Vermont, has some of the most stringent anti-Second Amendment laws on the books. The law that’s going to be argued before the Supreme Court is—well—what you’d expect from a state like this: In New York City, it’s illegal to transport a locked, licensed and unloaded firearm to a range or home outside of the city limits. When the lawsuit was filed, the city changed the law and urged the court to remove the case from the docket. The Supreme Court rejected that motion. And the Court also added that the city’s reasoning for changing the law would also be considered (via SCOTUSBlog):\n\nOne of the most closely watched orders today was the justices’ denial of New York City’s bid to dismiss the challenge to a now-repealed restriction on transporting guns outside city limits. The justices agreed to review the case in January, setting the stage for the Supreme Court’s first ruling on the scope of the Second Amendment in nearly a decade. But in July the city urged the justices to remove the case from their docket, arguing that changes to the city’s rule and to state law rendered the case moot – that is, no longer a live controversy. However, the court went ahead and scheduled the case for oral argument in December, deferring consideration of the city’s motion until last week. Today the justices made clear that the case will move forward: They rejected the city’s request to dismiss the case as moot immediately, instead announcing that the “question of mootness will be subject to further consideration, and the parties should be prepared to discuss it.”\n\nThe law was changed in April (via NY Daily News):\n\nOnce the NYPD’s new policy goes into effect — following a public comment period — licensed city gun owners will be able to bring weapons with them to a second home or to a business, as well as other places firearm possession is permitted, like a range or for a shooting competition. The NYPD, which has waged an intense campaign to halt inter-state gun trafficking, described the rule change as important to the legitimate interests of licensed gun owners. “This change applies only to legal gun owners who have already gone through a strenuous background verification process,” Police Commissioner James O’Neill said. \"The NYPD’s focus will always be on criminals who wield illegal guns, and those who would use guns to cause violence on our streets. Reasonably accommodating the interests of licensed gun owners in transporting their firearms to a legal shooting range or second home strikes a responsible balance between individual interests and public safety.”\n\nYeah, it’s almost as if the city knew this law was unconstitutional but decided to see how long they could coast with it before the eventual legal challenge. This is why you cannot give the anti-gun Left an inch. If you do, they will take several hundred miles.", "description": ".10/08/2019 20:33:32PM EST.", "authors": ["Matt Vespa", "Beth Baumann", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/238/3b03351f-5259-4939-8fec-06a9c908670b.png", "published_at": "2019-10-08"}