{"pub": "yahoo", "title": "Texas shooting: Seven dead after ‘white male’ opens fire in Midland and Odessa", "url": "https://news.yahoo.com/texas-shooting-five-dead-21-230300683.html", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:08:38.856561+00:00", "text": "Seven people have been killed and at least 19 injured in a mass shooting in west Texas, police have said.\n\nOfficers initially said that two shooters may have been at large. Later, they said those fears had proven unfounded, with the lone attacker having used two vehicles.\n\nThe shooter who opened fire in Midland and Odessa was a white male in his 30s, the Odessa Police Department said.\n\nThe incident began when a highway patrol officer stopped the driver and was shot, at about 3.17pm on Saturday. The shooter then drove into Odessa and onto the city’s 42nd Street, where many of his victims were shot. He then hijacked a postal van, causing more casualties, police said.\n\nMidland police posted on Facebook that the gunman had eventually been shot and killed outside a Cinergy cinema. The police initially reported a death toll of five people, with the number rising to seven the following day.\n\nLocal broadcaster CBS7, which was forced to evacuate its TV studio during the incident, has reported among those shot are a 17-month-old child, who was left with shrapnel in her chest, and a postal worker who died of her injuries.\n\nAt least one person is still believed to be in a critical condition following the incident.\n\nShortly after the shooter was taken down, Odessa police chief Michael Gerke said in a press conference: \"This was a joint effort by a multitude of departments to find this animal and bring him to justice”.\n\nAsked if the suspect had been identified, Mr Gerke said: “He is a white male in his 30s. I don’t have a positive identification on him yet – I have an idea who he is but I won’t release that information until we’re absolutely positive.\n\nhttp://players.brightcove.net/624246174001/default_default/index.html?videoId=6082248385001\n\nOdessa police chief gives emotional statement after mass shooting in 'horrific' day\n\nDonald Trump confirmed he had been briefed on the incident by the US attorney general’s office, adding that the FBI and other law enforcement agencies were “fully engaged”.\n\nThe attack is the latest in a string of high profile instances of gun violence across the US in August, including mass shootings in El Paso, Texas, and Dayton, Ohio, which led to a combined death toll of 31 people\n\nRead more\n\nO’Rourke ‘would force AK-47 and AR-15 owners to sell guns’\n\nThere have been more mass shootings across the US in 2019 then there have been days in the year so far – with at least 279 incidents taking place across 244 days, according to data compiled by non-profit group the Gun Violence Archive.\n\nA statement from Texas governor Greg Abbot said: “The first lady and I are heartbroken over this senseless and cowardly attack, and we offer our unwavering support to the victims, their families and all the people of Midland and Odessa.\n\n“I want to remind all Texans that we will not allow the Lone Star State to be overrun by hatred and violence. We will unite, as Texans always do, to respond to this tragedy.”\n\nThe state’s attorney general, Ken Paxton, said: “I am horrified to see such a senseless act terrorise the fine people of the Permian Basin. Thank you to the courageous local and state first responders who worked quickly today to stop this evil attack.”\n\nRead more\n\nRead more O’Rourke ‘would force AK-47 and AR-15 owners to sell guns’", "description": "Seven people have been killed and at least 19 injured in a mass shooting in west Texas, police have said.Officers initially said that two shooters may have been at large. Later, they said those fears had proven unfounded, with the lone attacker having used two vehicles.", "authors": ["Jon Sharman", "Vincent Wood"], "top_image": "https://s.yimg.com/uu/api/res/1.2/718QNke65BO.ZC8pzTjBPg--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/272bac5bbb273a3132ee022e61ff751b"}