{"pub": "businessinsider", "url": "https://businessinsider.com/supreme-court-says-boris-johnson-suspending-parliament-was-illegal-2019-9", "downloaded_at": "2019-09-24 13:53:52.863214+00:00", "title": "The UK Supreme Court rules that Boris Johnson's suspension of parliament was illegal", "language": "en", "text": "The UK Supreme Court rules that Boris Johnson's suspension of parliament was illegal.\n\nThe suspending of parliament is \"void\" rules the court, meaning that Members of Parliament must return immediately.\n\nThe verdict will lead to calls for Johnson to resign and apologise for misleading the Queen in his request for parliament to be suspended.\n\nVisit Business Insider's homepage for more stories.\n\nBoris Johnson's suspension of parliament was illegal and had \"no justification\" the UK Supreme Court has ruled, in a dramatic decision which will trigger calls for him to resign as prime minister.\n\nThe court ruled that Johnson's decision was \"unlawful\" and that the suspension of parliament was now \"void\" meaning MPs could return to Westminster immediately.\n\nJohnson closed down parliament for five weeks earlier this month in a move which opponents believe was designed to stop Members of Parliament from blocking his plan to leave the EU at the end of October under all circumstances.\n\nJohnson had insisted his suspension was designed purely to allow time to put together a new programme for his premiership and had publicly warned the court not to get involved in what he claimed was a purely political matter.\n\nHowever, the court upheld the earlier verdict of the Scottish Court of Session that Johnson's decision to close down parliament was a deliberate attempt to \"stymie\" the work of MPs.\n\nThey said the decision was now \"void\" and that parliament must be re-opened.\n\n\"This was not a normal prorogation in the run up to a Queen's Speech,\" Lady Hale ruled.\n\n\"The effect on our democracy was extreme.\"\n\nThe Supreme Court's eleven judges dealt with two appeals relating to Johnson's decision over a three-day hearing.\n\nThe first was the UK government's appeal against the Scotland's Court of Session ruling that Johnson's move to suspend Parliament was unlawful and intended to stifle parliamentary scrutiny of his handling of Brexit.\n\nThe second was from activist Gina Miller, who took an appeal to the Supreme Court after the English High Court ruled that Johnson's proroguing of Parliament was a entirely political and not a matter for judges.\n\nThe UK government has previously insisted that it would abide by the verdict of the court, meaning that parliament could be reconvened immediately.\n\nAsked on Monday whether he would resign if the verdict went against him, Johnson told the BBC: \"I'm going to wait and see what the judgement is,\" adding that the government \"fully respects the law and fully respects the judiciary.\"\n\nSpeaking ahead of the verdict, the Scottish National Party MP Joanna Cherry, who jointly brought forward the original case in Scotland, called on Johnson to face up to scrutiny.\n\n\"It is a damning indictment of Boris Johnson's short premiership and the broken Westminster system that cross-party MPs had to drag the Tory government to the highest court in Scotland and the Supreme Court in London over the Prime Minister's shut down of Parliament so he could duck scrutiny,\" she said.\n\n\"With each day that passes we are denied the time to properly scrutinise and debate the government's plans to leave the EU. MPs must be back in Parliament to do their jobs, and the Prime Minister must emerge from the bunker and come before MPs to set out his plans.\"", "description": "The Supreme Court rules that parliament must be re-opened in a devastating blow to Boris Johnson's premiership.", "authors": ["Adam Payne", "Thomas Colson", "Adam Bienkov"], "top_image": "https://image.businessinsider.com/5d89c6962e22af372a1e5023?width=1200&format=jpeg", "published_at": "2019-09-24"}