{"pub": "cbs", "url": "https://cbsnews.com/news/jchandra-brown-suicide-of-a-utah-teen-was-a-tragedy-but-was-how-it-happened-a-crime", "downloaded_at": "2019-10-25 03:30:04.004050+00:00", "title": "The suicide of a Utah teen was a tragedy, but was how it happened a crime?", "language": "en", "text": "CBS News correspondent David Begnaud and \"48 Hours\" investigate the tragic death of 16-year-old Jchandra Brown and the search to find out what really happened to her in \"A Death in Payson Canyon\" airing Saturday, October 26 at 9/8c on CBS.\n\nWithout question, the death by suicide of 16-year-old Jchandra Brown on May 5, 2017 was a tragedy. But was how it happened a crime?\n\n\"A Death in Payson Canyon\" is the stunning and heartbreaking story of a family, a community and authorities struggling to make sense of a young girl's death by suicide, only to discover that her friend, who had many opportunities to stop her, helped her complete the act instead.\n\nThe broadcast also explores the broader issue of teen depression.\n\n\"Jchandra was my world. She was my life,\" says the teen's mother, Susan Bryan. \"When Jchandra died, my heart shattered.\"\n\nBrown's body was found by a turkey hunter in the woods in Payson Canyon, Utah. To police, the scene initially looked like a clear-cut case of suicide; it was anything but that. There were clues that something wasn't right. Nearby, police found a note.\n\n\"It says, 'My name's Jchandra Brown and I hated my life,'\" says Utah County Sheriff's Detective Quinten Fackrell. \"'Watch the video. It's on my phone.'\"\n\nBrown's phone, also found nearby, contained a 10-minute video of her suicide that was recorded by someone she knew. They found two grocery bags as well, one of which had a receipt for rope, purchased with a debit card belonging to Tyerell Przybycien.\n\nAs police continued searching the area where Brown was found, Przybycien walked up.\n\n\"He introduces himself to me as Tyerell Przybycien,\" recalls Sgt. Josh Chappell. \"And he goes, 'I think you want to talk to me. I need to tell you the whole story.'\"\n\nSymptoms and treatment of teen depression: Advice for parents\n\nPrzybycien told police he was just helping Jchandra do what she wanted to do, but detectives later discovered new evidence that showed this may have been Tyerell's plan all along – such as a text he sent to a friend stating, \"It's like getting away with murder.\" And with that, Utah County prosecutors decided to charge Przybycien with first-degree murder.\n\n\"In his mind, I don't think that he was committing murder. He was helping her do what she wanted to do,\" says Neil Skousen, Przybycien's attorney.\n\n\"This goes beyond making bad mistakes,\" says Prosecutor Chad Grunander. \"This was criminal behavior. There's no doubt in my mind that Jchandra does not die on May 5, 2017, if she had never met Tyerell.\"\n\nBegnaud and \"48 Hours\" explore the events that brought Jchandra Brown and Tyerell Przybycien together in the remote woods in Payson Canyon that evening, leaving one dead and the other on trial for murder.", "description": "\"48 Hours\" explores the events that brought Utah teenagers Jchandra Brown and Tyerell Przybycien together in the remote woods in Payson Canyon, leaving one dead and the other on trial for murder", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/04/25/304b421b-3991-43a9-b072-1b52162bfaa9/thumbnail/1200x630/85e1727490dfc2c881e75f1f3c7d0fc3/jchandra-brown.jpg", "published_at": "2019-04-25"}