{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/technology/facebook-libra-proposal-could-win-over-regulators-at-a-cost-15134186", "downloaded_at": "2019-10-22 13:20:16.615026+00:00", "title": "Facebook's Latest Libra Proposal Could Win Over Some Regulators -- At a Cost", "language": "en", "text": "Facebook (FB) just floated a proposal that could address much of the regulatory blowback its Libra cryptocurrency project has received since it was unveiled in June.\n\nHowever, if pursued, the proposal would also add some financial complexity to Libra, and also eliminate a couple of its potential uses among consumers living in countries that have volatile currencies.\n\nDuring a recent banking seminar, Facebook Libra chief David Marcus said the Libra Association -- the non-profit group that will jointly manage Libra -- is open to having Libra consist of \"a series of stablecoins\" that are pegged to existing currencies, rather than a single cryptocurrency whose value is pegged to a currency basket featuring the U.S. dollar, the euro, the yen, the pound and the Singaporean dollar.\n\nMarcus' remarks come after regulators in the U.S. and elsewhere have raised concerns about Libra's potential to undermine the power of central banks by providing an alternate currency that individuals could quickly move funds into, as well as over the potential use of Libra for illicit activities such as money laundering and financing terrorist organizations.\n\nThe comments also come after several of the Libra Association's 28 original members -- some of which were rattled by the regulatory pushback, and some of which may have not been that crazy about Libra due to how it could compete against existing businesses of theirs -- pulled out. Those companies include payments incumbents Visa (V) , Mastercard (MA) , PayPal (PYPL) and Stripe, as well as Booking Holdings (BKNG) and eBay (EBAY) .\n\nAs I mentioned when PayPal abandoned Libra two weeks ago, a loss of support from payments giants is a negative for Libra, but not a death knell. While support from these firms would have likely helped drive Libra adoption among consumers and merchants, Libra's digital wallet services don't need the support of existing payments networks to function. Rather, much like stock brokerage accounts and PayPal wallets are funded today, users will typically add funds to Libra accounts via bank account transfers (\"unbanked\" consumers could also have the option of depositing cash with an authorized Libra reseller).\n\nLikewise, though it's still early, there's a good chance that the Libra Association can address concerns about Libra's potential use for illicit activities. Unlike Bitcoin and other truly decentralized cryptocurrencies, Libra is meant to be centrally managed and monitored, and users will have to share a government-issued photo ID to set up a Libra account.\n\nOn the other hand, concerns about Libra undermining central banks are the kind of thing that might not be easy to eliminate, at least if the Libra Association attempts to launch Libra in its current form. Should Libra consist of a single cryptocurrency that's pegged to a slew of existing currencies, it's not hard to imagine individuals in countries where currency depreciation is a risk moving funds into Libra simply to insulate themselves from such depreciation.\n\nAnd even in countries that have historically had low currency volatility, one could see central bankers being uneasy about the possibility of consumers one day transferring money en masse into a cryptocurrency that's pegged to foreign currencies.\n\nHaving Libra consist of a series of stablecoins -- so that, for example, American, German and Mexican libra users would have Libra funds that are pegged, respectively, to the dollar, euro and peso -- would address such worries. And such a move might also appeal to consumers in the U.S. and other nations where there's a high degree of confidence in the stability of the home country's currency.\n\nAt the same time, such a change would likely reduce some of Libra's appeal, both as a safe haven and as a means of conducting transactions, in countries where currency volatility has often been a fact of life.\n\nHaving Libra based on a number of stablecoins would also make it more complex to manage. Instead of having to manage just a single \"Libra reserve\" that's pegged to a currency basket, the Libra Association would have to manage many different stablecoins, each of which would need to have its own reserve that's tied to a particular currency.\n\nWith all that said, Libra could still have some intriguing use cases in a scenario where it's based on many different stablecoins. Among them: Financial services for the unbanked, cheap cross-border remittance payments and digital microtransactions that can't be economically carried out via existing payments networks.\n\nAnd while it's far from certain at this juncture that Libra will be a major competitor to credit cards, particularly given the pervasiveness of credit cards and their ability to lean on loyalty programs, Libra's lower transaction fees could allow it to compete with them to an extent.\n\nFrom the looks of things, Libra still has a ways to go before it's legally sanctioned and available in the U.S. or elsewhere. But Facebook still appears quite committed to seeing the project through, even if this means significantly changing its game plan to appease skeptical regulators.", "description": "The social media giant says it's open to having Libra consist of a series of 'stablecoins' pegged to existing currencies, rather than just one cryptocurrency pegged to a currency basket....FB", "authors": ["Eric Jhonsa", "Facebook'S Latest Libra Proposal Could Win Over Some Regulators -- At A Cost", "The Social Media Giant Says It'S Open To Having Libra Consist Of A Series Of 'Stablecoins' Pegged To Existing Currencies", "Rather Than Just One Cryptocurrency Pegged To A Currency Basket.", "Stocks Quotes In This Article", "Bruce Kamich", "Ed Ponsi", "James", "Rev Shark", "Bob Lang"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/4f4664b3-8081-11e8-b47c-732b4c22afc5.jpg", "published_at": "2019-10-21"}