{"pub": "guardian", "url": "https://theguardian.com/politics/2019/oct/16/police-watchdog-asks-johnson-arcuri-inquiries-to-hold-back", "downloaded_at": "2019-10-16 13:54:12.108330+00:00", "title": "Police watchdog asks Johnson-Arcuri inquiries to hold back", "language": "en", "text": "One of the four inquiries into claims of a conflict of interest involving Boris Johnson and a US businesswoman has been scaled back and a second is under pressure to hold off after requests by the police watchdog.\n\nThe Independent Office of Police Conduct (IOPC) is concerned that the reviews could prejudice its decision on whether to launch an investigation into allegations of misconduct in public office against Johnson when he was mayor of London.\n\nThe current mayor, Sadiq Khan, ordered an inquiry into his predecessor after it was reported that Johnson’s friend Jennifer Arcuri was awarded £126,000 in public money and given coveted places on mayoral trade missions despite failing to meet the criteria for them.\n\nKhan’s officials appointed the London fire brigade general counsel, Kathryn Robinson, to look into London & Partners, the mayor’s promotional agency, which granted Arcuri £11,500 in sponsorship and a place on the trips after intervention from Johnson’s office.\n\nExplaining Robinson’s investigation on LBC this month, Khan said it would look at three key questions: what processes were in place when Johnson was mayor, were those processes followed, and what lessons need to be learned.\n\nBut after a request by the IOPC it has now been decided that Robinson will not examine Johnson’s time as mayor and will focus instead only on current procedures at L&P.\n\nThe IOPC is examining documents and emails handed over by L&P that relate to the sponsorship for Arcuri’s company and her places on trade trips, before it makes its decision about whether to investigate Johnson.\n\nA spokesman for Khan said: “The mayor’s office has agreed with Kathryn Robinson that she will look into the processes currently in place at London & Partners and the Greater London Authority’s involvement in them, to see if they need to be strengthened. This review will begin shortly, irrespective of the IOPC’s work.”\n\nHe added: “The IOPC has informed GLA officers that they are concerned that unless the review is limited to current processes, there is a risk it could prejudice the work they are undertaking. Following completion of the IOPC’s processes, the review by Kathryn Robinson and the GLA oversight committee’s investigation, the mayor will consider whether any further steps are required.”\n\nRobinson will review how L&P decides who goes on trade missions and how it sponsors external commercial events.\n\nAn official at the GLA formally referred the allegations to the IOPC last month because Johnson headed the mayor’s office for policing and crime as part of his role. The IOPC is expected to make a decision on whether to investigate by the end of October.\n\nSeparately, the IOPC has urged the London assembly’s oversight committee to delay its investigation into the allegations against Johnson. A source at the assembly said: “They want us to wait until they make a decision on what they are going to do.”\n\nThe committee is due to meet on Wednesday, when it is expected to discuss whether to comply with the IOPC’s request to hold off. Last week a letter from Johnson’s lawyers to the committee said it had no remit to investigate.\n\nThe committee has threatened to use its powers to summon the former mayor to answer questions in person, as it did over his failed garden bridge project.\n\nA fourth investigation is under way into how a £100,000 grant aimed at fostering digital talent in the UK was awarded to Arcuri’s company Hacker House.\n\nOn Wednesday MPs will question the culture secretary, Nicky Morgan, about why her department awarded the money to the company despite its tenuous links to the UK.\n\nQuestions have already been raised in the Commons about the due diligence carried out on the grant approval after ministers justified awarding the money – meant to be spent on improving IT skills in the UK – by saying the company had a British phone number. Calls to the number from the Guardian were answered by a receptionist in the US, where Arcuri is now based.\n\nArcuri has denied she received any favouritism from Johnson, L&P or the government. The prime minister has insisted “full propriety” was followed and he has no interest to declare over Arcuri.", "description": "Police%20watchdog%20asks%20Johnson-Arcuri%20inquiries%20to%20hold%20back%20%7C%20Boris%20Johnson%20%7C%20The%20Guardian", "authors": ["Matthew Weaver"], "top_image": "", "published_at": "2019-10-16"}