{"pub": "euronews", "url": "https://euronews.com/2019/10/10/we-must-protect-jewish-life-says-german-president-following-anti-semitic-attack", "downloaded_at": "2019-10-10 15:37:30.233231+00:00", "title": "'We must protect Jewish life' says German president following anti-Semitic attack", "language": "en", "text": "Germans must protect Jewish life, the President Frank-Walter Steinmeier said on Thursday, as Jews in the country spoke of their fears of the growing threat of anti-Semitism following an attack outside a synagogue in which two people were killed.\n\nA gunman opened fire outside the synagogue on Yom Kippur, the holiest day of the Jewish year, in the eastern German city of Halle on Wednesday, live-streaming the attack online.\n\nAfter trying to blast his way into the synagogue, he shot dead a woman outside the building and a man inside a nearby kebab shop.\n\nTwo other people were seriously injured, but regional broadcaster MDR said their condition was not critical.\n\nGermany's federal prosecutor said on Thursday that Stephan B., the suspect who was arrested by police after the attack, wanted to carry out a massacre in the synagogue and inspire others to similar attacks.\n\n\"What we experienced yesterday was terrorism,\" Peter Frank said.\n\nHe said the suspect seemed to have built several of his own weapons and explosives were found in his car.\n\n'We must protect Jewish life'\n\n\"Today is a day of shame and disgrace,\" Steinmeier said outside the synagogue.\n\n\"I'm very sure the overwhelming majority of this society in Germany wants Jewish life to be part of this country...We must stand together long-term against violence like we experienced here yesterday. We must protect Jewish life.\"\n\nChancellor Angela expressed her shock at the attack, saying \"Hatred, racism and anti-Semitism have no place in our country,\" adding that the state needed to use all available means to take action against hatred.\n\nMore: Shooting which killed two in Germany was 'anti-Semitic attack' - Interior Minister\n\nMore: Amateur footage emerges of gunman opening fire in Halle, Germany\n\nFears of more attacks\n\nThe news has heightened fears of more anti-Semitic violence in a nation still scarred by the Holocaust. Attacks on Jews rose by 20% last year and were mainly carried out by right-wing extremists.\n\nMerkel joined a vigil held at a synagogue in Berlin last night, attended by around 200 people.\n\nRenate Keller, a 76-year-old attending the vigil with her husband, said the attack in Halle showed that Germany was not doing enough to fight anti-Semitism.\n\n“It scares me that after the Holocaust some people have learned nothing from our history, which still weighs on us today,” she said. “People like the attacker have probably never met a Jew in their lives. They are just blinded by hatred.”\n\nOther members of Germany’s 200,000-strong Jewish community expressed similar alarm over the attack.\n\n“It’s very scary,” said Samuel Tsarfati, a 27-year-old stage director, as he left a Berlin synagogue.\n\n“It’s not a coincidence it happened in east Germany. The far-right Alternative for Germany (AfD) is very strong there,” Tsarfati said. Leaders of the AfD party, which made big gains in elections in two eastern states last month, condemned Wednesday’s attack in Halle.\n\nPolice in the spotlight\n\nMost Jewish institutions in Germany's large cities have a near-permanent police guard due to occasional anti-Semitic attacks by both far-right activists and Islamist militants.\n\nJosef Schuster, president of the council of Germany's Jewish community, criticised police for not being stationed outside the synagogue that was attacked as dozens prayed inside.\n\n\"If police had been stationed outside the synagogue, then this man could have been disarmed before he could attack the others,\" Schuster told Deutschlandfunk public radio.\n\nIn the event, the synagogue's solid locked gates and high walls provided ample protection against the attacker's seemingly improvised weapons.\n\nSchuster said that while it was normal practice in his experience for all synagogues to have police guards while services were being conducted inside, this appeared not to be the case in the state of Saxony-Anhalt, where Halle is located.\n\nHowever, the head of Germany's police union was sceptical about providing that level of protection.\n\n\"We'd have to guard every synagogue, every church, every mosque, every holy place in Germany around the clock, so I don't know if this was a mistake or if this really couldn't have been foreseen,\" Oliver Malchow told ARD public television.\n\nNew Zealand-style attack\n\nThe attack appeared to be modelled on last year's gun attack on a New Zealand mosque, in which the perpetrator streamed his actions live on social media.\n\nIn a video of more than 30 minutes that Stephan B. live-streamed from a helmet camera, he was heard cursing his failure to enter the synagogue before shooting dead the two victims.\n\nHe livestreamed the violence on the gaming platform Twitch, with the video then shared across white supremacist channels on the encrypted messaging app Telegram.", "description": "A gunman livestreamed an anti-Semitic attack outside a German synagogue on Wednesday, leaving two people dead.", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/22/22/02/1000x563_cmsv2_6fa7411f-a6e1-561f-8db1-8270fe04be2c-4222202.jpg", "published_at": "2019-10-10"}