{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/2019/10/08/donald-trump-hillary-clinton-run-again-she-replies-do-your-job/3907084002", "downloaded_at": "2019-10-09 00:56:45.242000+00:00", "title": "Donald Trump to Hillary Clinton: Run for president again! Clinton to Trump: Do your job!", "language": "en", "text": "CLOSE US President Donald Trump says the impeachment inquiry is a \"scam\" that is driving his poll numbers higher and he says he sort of thrives on it, but admits it \"makes it harder to do my job.\" (Oct. 7) AP, AP\n\nWASHINGTON – Engaging in a favorite pastime, President Donald Trump taunted Hillary Clinton and the 2020 Democratic candidates on Tuesday by saying she should run for the White House again – only to have Clinton taunt back.\n\n\"Don’t tempt me,\" she tweeted at Trump. \"Do your job.\"\n\nShe was responding to an earlier post in which Trump said: \"I think that Crooked Hillary Clinton should enter the race to try and steal it away from Uber Left Elizabeth Warren.\"\n\nHe also listed one \"condition\" of her renewed candidacy, saying Clinton should disclose the reason she deleted emails from her time as secretary of State for President Barack Obama.\n\nClinton responded a few hours later with her own taunting tweet.\n\nTrump's hit came as he as under impeachment investigation for asking Ukraine's president to investigate another Democratic presidential candidate, former Vice President Joe Biden.\n\nDon’t tempt me. Do your job. — Hillary Clinton (@HillaryClinton) October 8, 2019\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/2019/10/08/donald-trump-hillary-clinton-run-again-she-replies-do-your-job/3907084002/", "description": "Trump loves to taunt Hillary Clinton and the 2020 Democratic presidential candidates; now he's doing both at the same time.", "authors": ["David Jackson", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/08/USAT/30e38e65-c404-42e0-9a57-58e6df272852-AP_SMALLBIZ-SMALL_TALK-ELECTION_CHATTER_85931958.JPG?crop=3797,2136,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-08"}