{"pub": "huffpost", "url": "https://huffpost.com/entry/wnba-tyler-diggins-smith-pregnant-dallas-wings_n_5daba27fe4b0422422c607d8", "downloaded_at": "2019-10-20 03:30:56.596033+00:00", "title": "Dallas Wings Women's Basketball Star Skylar Diggins-Smith Played Entire Season Pregnant", "language": "en", "text": "Cooper Neill via Getty Images Skylar Diggins-Smith poses in May for a Dallas Wings player photo — but never played for the team this season after taking two months off for post-partum depression.\n\nWomen’s National Basketball Association star Skylar Diggins-Smith revealed Saturday that she played an entire season for the Dallas Wings while pregnant. And she’s furious the WNBA didn’t support her this year when she took two months off in the spring for post-partum depression, Diggins-Smith expressed in a series of tweets.\n\nDiggins-Smith, 29, said she played while pregnant throughout the entire five-month 2018 season and “didn’t tell a soul.” She was still a leading player in the league and averaged 17.9 points and 6.2 assists. She also earned a fourth All-Star slot.\n\nBut Diggins-Smith said when she took two months early this season with a newborn son and post-partum depression, she was slammed as a “quitter” who was giving up on her team.\n\nI played the ENTIRE season pregnant last year! All star, and led league (top 3-5) in MPG....didn’t tell a soul. — Skylar Diggins-Smith (@SkyDigg4) October 19, 2019\n\nPeople called me a quitter, said I gave up on my team, etc., etc.\n\n\n\nNot knowing I took two FULL months away from everything because of postpartum depression. With limited resources to help me be successful mentally/physically.\n\n\n\nBut just wait though....KEEP THAT SAME ENERGY. — Skylar Diggins-Smith (@SkyDigg4) October 19, 2019\n\nThe blasts that disrespect of mothers (and our rights) in the WNBA is incredible. I can’t wait until you hear my story FROM ME! — Skylar Diggins-Smith (@SkyDigg4) October 19, 2019\n\nHaving no support from your own organization is unfortunate — Skylar Diggins-Smith (@SkyDigg4) October 18, 2019\n\nDiggins-Smith first publicly revealed she was pregnant with her first child last October, almost two months after the Wings ended its 2018 season with a loss against Phoenix in August.\n\nDiggins-Smith practiced with the Wings before the 2019 season started in May and expected to play but never did.\n\nTeam president and general manager Greg Bibb told the Dallas Morning News during the season that it was “100% up to Skylar” when she played. “We’re going to support her and her timeline and when she says she’s ready to go, we’re going to welcome her back,” he told the newspaper. She “needs to focus on getting herself healthy and getting her family situated and feeling good about all of that,” he added.\n\nIt’s unclear if the talented guard, who’s a free agent, will return to the team next season.\n\nUnder the WNBA collective bargaining agreement, players who become pregnant under contract are to receive half their salary, and their medical expenses are to be covered by insurance, according to Yahoo Sports.\n\nIt wasn’t immediately clear what Diggins-Smith received. But she tweeted that she had “limited resources to help me be successful mentally/physically.” At the same time she was expected to “keep that same energy” on the basketball court, she added.\n\nNeither the WNBA or the Dallas Wings could immediately be reached for comment about Diggins-Smith’s complaints.", "description": "And she's not happy about what she considers a lack of WNBA support when she took two months off for post-partum depression this season.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5daba9612100002d1a34a76e.jpeg?cache=pjqvlyh0g3&ops=1778_1000", "published_at": "2019-10-20"}