{"pub": "yahoo", "url": "https://sports.yahoo.com/nottingham-forest-move-top-table-210148956.html", "downloaded_at": "2019-09-28 10:18:59.668372+00:00", "title": "Nottingham Forest move top of the table with victory which piles pressure on struggling Stoke City manager Nathan Jones", "language": "en", "text": "Nottingham Forest's Lewis Grabban celebrates scoring his side's third goal - PA\n\nStoke City 2 Nottingham Forest 3\n\nNottingham Forest recovered from an early goal conceded to go top of the EFL Championship table and heap more pressure on Stoke manager Nathan Jones, who looks to be well into borrowed time now after taking just two points from the first nine matches of the season.\n\nScroll to continue with content Ad\n\nA header by James McClean seven minutes from time gave Stoke hope of salvaging a point but Forest did not let their advantage slip.\n\nStoke are without a win in 15 Championship matches and this result sets an unwanted club record of 10 home fixtures without a win, their last success here coming against Forest in March.\n\nThey had started looking confident and sharp and when Lee Gregory reacted superbly to a loose ball in the box to score his first Stoke goal after 10 minutes it was no more than they deserved.\n\nBut the mood and the balance of the contest changed after another expensive error by the currently accident prone Jack Butland handed Forest an equaliser nine minutes before half-time.\n\nStoke are without a win in 15 Championship matches, leaving the pressure mounting on head coach Nathan Jones Credit: GETTY IMAGES\n\nThe England goalkeeper, who has now cost Stoke four goals this season directly as a result of his mistakes, spilled a cross by Matty Cash as he tried to claim it off the head of Lewis Grabban, winger Joe Lolley pouncing to score.\n\nStoke looked immediately uneasy and relieved to reach half-time but within two minutes of the restart were behind, Sammy Ameobi making a prodigious leap to head home another Cash cross with two Stoke defenders caught ball watching.\n\nGrabban added a third - his fifth of the season - to put Forest in control just beyond the hour mark, despite having lost key defender and captain Michael Dawson to a first-half injury.\n\nStoke winger McClean flicked home a Tom Edwards free kick to lift some of the despondency but to no avail as Forest held on for a fifth win in seven.\n\nStory continues\n\nJones may have one more chance to save himself - Stoke are at home to bottom-of-the-table Huddersfield Town on Tuesday - assuming chairman Peter Coates and his board remain patient until then.\n\nMatch details\n\nStoke City (4-1-2-1-2): Butland; Edwards, Carter-Vickers, Martins Indi, McClean; Ndiaye (Lindsay 51); Etebo, Clucas; Ince; Powell (Vokes 68), Gregory (Campbell 74)\n\nSubstitutes not used: Federici (g), Batth, Vokes, Cousins, Campbell, Duffy.\n\n\n\nNottingham Forest (4-2-3-1): Samba; Cash, Worrall, Dawson (Chema Rodriguez 33), Robinson; Sow, Watson; Ameobi, Carvalho (Silva 60), Lolley (Adomah 77); Grabban.\n\nSubstitutes not used: Muric (g), Ribeiro, Fibueiredo, Johnson.\n\n\n\nBookings: Forest: Lolley, Dawson, Sow, Watson.\n\n\n\n\n\n\n\nReferee:Andrew Madley (West Yorkshire)\n\nAttendance: 23,800.", "description": "Nottingham Forest recovered from an early goal conceded to go top of the EFL Championship table and heap more pressure on Stoke manager Nathan Jones, who looks to be well into borrowed time now after taking just two points from the first nine matches of the season.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/lkUryaPrmXaf6uJkWBwnQw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/9ARkRRtNlo5aeZQTIm4n5g--~B/aD0xNTYzO3c9MjUwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_818/5bda512e2e5ca05dc49b1aec798ebbbc", "published_at": "2019-09-27"}